{"month": "10", "state": "FL", "station": "WMFE", "content": "And even though NPR staffers pass through the stages of denial anger depression and accept it [noise] they go back to the dial again whenever they hear us say if this is NPR\nHelen Hogan is threatening letter from election officials have to registering people to vote in Georgia makeup scared you know [noise] um and then so she got help\nYou want to shoot out of the OK Corral came to the right place shut out of the polls over the next movie [noise]\n\nJoin us for revealed from the center of investigative reporting that begins this afternoon it too right\nHere on Ninety point seven FM W. M. F. E. Orlando\nHave Peter said will hear from wait wait I'm well I'm really looking forward to seeing you all have every fifteenth I wanted to urge you all to become a member or just any member\nOf W. M. S. E. W. M. F. ...\nOrder which decided what Dr I'm Sorry that's one eight hundred seven eight five do oh well thanks [noise]\n\nFrom NPR and do what do you mean in the Chicago is wait wait don't tell me we get our news quiz [noise]\nBuilt hurting and I did or said this week the world's got to forget his troubles and enjoy a mystery instead who did it how are they going to get away with it was sort of like the ... cereal\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr and this is how we do it now have you been to the family\nDoes your support all uninterrupted programming but donating a dollar a day W. M. F. U. dot org or cold one hundred Seventy five twenty twenty\nFifth anniversary residents from NPR's\nNever going to be slow [laughter]\nI'm going to keep it forever will ask you really want the souvenir of a big day on our quiz right after this hour [noise]\n\nLive from NPR News in Washington I'm Barbara Klein\nPresident Trump calls Saudi Arabia's account of what happened to journalists democracy show ... credible\nFor the first time reacted Mitt's could show gee is dead saying he died in a fist fight with Saudi suspect and its consulate in Istanbul NPR's Deborah Amos reports the kingdom blamed senior advisors for a policy gone wrong\nThe Saudis now admit that there is a standing order to bring dissidents back to the kingdom by force if necessary but\nThe account lays the blame on the senior security officials who went beyond the order they killed this dissident journalist they covered up the murder\nTurkish officials continue to search for cars show jeeze body meanwhile Republican Senator Lindsey Graham says he's skeptical of the Saudi explanation democratic Congressman Adam Schiff says he doesn't buy it\nU.S intelligence officials are warning that foreign adversaries have already targeted next month mid term elections NPR's Carrie Johnson reports of Russian accountant is the first to face federal charges\nFederal prosecutors say Elena crew sign of conspired to defraud the United states authorities say she managed a budget in more than thirty five million dollars aimed at targeting elections here and in other countries\nThe methods familiar Russian ... domain names and Facebook ads just so division on issues such as race relations and immigration their messages targeted people including former president Brock Obama and late Arizona Senator John McCain\nThey also mentioned special counsel Robert Mueller the man leading the investigation into Russian interference in twenty sixteen\nIntelligence officials say the Russians are still on the attack\nBut they say there's no evidence foreign adversaries had been able to prevent Americans from voting or to change vote counts Carrie Johnson NPR News Washington\nThe Trump administration's trying to fast track and environmental review of projects that deliver federally subsidized water to farmers out west NPR's Kirk Siegler reports a new presidential memorandum is designed to loosen environmental restrictions in West coast states\nRepublicans going back to the George W. Bush administration have tried to increase water deliveries to farmers in California's massive Central Valley project where water from snow fed reservoirs gets pumped south to arid farmland but those deliveries are perennially cutback due to attempt to protect endangered fish and drought\nThe president's order would speed up the current review of this as well as to other projects in Oregon and Washington\nIs environmental restrictions are losing their will likely be a pro long legal battle and one of the biggest champions of this latest plan is deputy interior secretary David Bernhardt used to lobby for the Fresno based west ones water district one of the largest and most influential water agencies and the west\nKirk Siegler NPR News this is NPR the street\nBy him off on paying all of our president and general manager of your station Ninety point seven W. M. F. E. and fears these are silent Dr\nSpin a for two years since we first tried this less intrusive style of foreign reasons and this is how we do it now W American family fallen drives are no longer the new kid on the block but a tradition we are committed to keep things as long as we raise the money needed to pay for programs you listen to deal with\nYour contribution today helps pay for public radio news programming\nWithout the pressure of commercial interests Ninety point seven double you it might be powered by you show your support now for uninterrupted public radio news and programming\nOr making a donation right now for support news that matters actually sustain or from your bank account for credit card will send you appear Ninety point seven W. M. F. the customs Fox\nHow 'bout contributing thirty dollars a month\nYou will become the power behind the news you use you'll make a statement wherever you go together we have come a long way with the silent style the fund raising\nMore programming and less fundraising can only fix things with your participation contributed W. M. F. he's out of work will call one eight hundred Seventy five twenty twenty and thank you\nSupport for Ninety point seven news comes from alert today Florida working to improve the safety of bicycles and pedestrians distracted driving not only puts motorists to risk those who walk and bike are particularly vulnerable the role of public safety begins on line ... alert today Florida dot com because safety doesn't happen by accident\nOr NPR comes from NPR stations other contributors include T. I. A. T. I. A. is committed to helping those who are driven by a purpose reach their definition of success\nInvesting advice banking retirement learn more AT T I Am a dot org\nYou're listening to Ninety point seven ... W. M. F. B. I. bill Johnson taking a look out the weekend whether for today mostly sunny one isolated showers and thunder storms in a high near Ninety four tonight partly cloudy with a low ramp Seventy two and four to moral beautiful day mostly sunny with a high near eighty one\nFirst Sunday night partly cloudy below around sixty five and the outlook for Monday to start to work week mostly sunny on Monday with a high near eighty three\n[noise]\nRobin we are an WB is that you should go go this is wait wait don't tell me the NPR News quiz put your can be in my bucket it's below ... [laughter]\nThere's hosted the chase bank auditorium in downtown Chicago Peter ... thank\nWe are very excited to be talking later on to best selling author John Grisham later on you know him for his books a time to kill the from ray makers Lincoln lawyer we will ask him if it's believable plotline for a judge to shout out I like beer\n[laughter] end up on the Supreme Court\nWe need your help to unravel the mysteries of this week's news or give us a call the number is one AAA wait wait that's one eight nine to for it and I do for now let's welcome our first listener confessing Hi you're on wait wait don't tell me\nHey this is Zach from Washington DC\nHey Zach how are you what's going on in Washington [laughter]\nI don't answer that [laughter] [noise] yeah and I would\nDo work in the permanent government and the city what do you do there\nNo I work in the tech industry I work for over actually really actually on something more evil to do either [laughter] well\nWelcome to the show Zach let me introduce you to our panel this week first up at the comedian it'll be headlining at the ...\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric location to serve central Florida family more information including locations that early no health dot com slash kids need Dickinson [noise]\nAnd finally a correspondent for CBS Sunday Morning a host of the Henry Ford's innovation nation Saturday on CBS it's Moe Rocca [noise]\nWill come to the show you of course they're gonna play who's bill list I built Curtis is once again going to perform for your three quotations from the week's news your job as I'm sure you know identify or explains two of them do that when the prize any voice from our show you might choose on your voicemail ready to play\nAll here is your first quote you know here we go again would you know you're guilty until proven innocent and that was President Trump's defending was purely innocent a country that is definitely guilty\nFood the definition of food is something that sustains a nerve Russia's yeah nourishment in something that increases your health so forty percent of the stuff in American supermarkets wouldn't qualify as food wait\nForty percent wouldn't qualify sued right\nHow we connect with our food that next time on the Ted radio hour from NPR [noise]\n... listening to the Ted radio hour that'd be gives this afternoon at three right here on Ninety point seven F. M. W. M. F. E. Orlando\nHi this is talk on tape and all of our here letting you know that Ninety seven W. M. F. E. he's bringing capital steps back in twenty Nineteen this celebrity show will be coming to trinity prep on Thursday February twenty eight at seven thirty PM support this hour drive and get your tickets today\nBecause it W. M. S. dot org or cold one hundred Seventy five twenty twenty\nStarch your week with MORNING EDITION weekday mornings beginning at six right here on Ninety point seven ... W. M. F. E. Orlando\nSupport for MPR cubs from NPR stations and Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independents thought whether that's on line over the air or in the bustle born in Sierra Nevada dot com\nCapital one committed to re imagining banking offerings savings I'm checking accounts that can be open from anywhere capital one what's in your wallet capital was in a hand\nVisit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum the truly collection and the museum of fine arts ... visit saint Pete Clearwater dot com [noise]\nRobbing the R and W. me in the Chicago this was wait wait don't tell me the NPR News quiz I'm Bill Curtis where you're playing this week with mobile Raqqa Amy Dickinson and the hollering cutting through and literally go leisure\n[noise] [laughter]\nRight now it's time for the wait wait don't tell me last listener game called one AAA wait wait to play a game in the air Hi you're on wait wait don't tell me\nI I live where are you calling from I'm calling from Columbia University and the art of Columbia University up there in the north side of Manhattan are you from New York I Know I'm from the bay area in California\nReally how how did you uh how did you enjoy transitioning to life in the big city in Manhattan\nAnd it was really fun I really like it here really\nYeah there's so much to do this great are you sure you're from the bay area because no one has ever supposed to from the area ever to praise anyplace else\nThat's what everyone tells me [laughter]\nWell welcome to the show earlier you're going to play the game and when she was ready to tell the truth from fiction ...\nNine one one I think you wanted three one one don't worry\nThings are not as bad as it seems the sentence it only applies to this week's fluff the listener story Our panelists\nAre going to tell you about a false alarm we heard about in the news pick the one who's telling the truth in what our prize the voice of the weight waiter of your choice on your voicemail ready to play\nYeah All right let's hear first from Harvey kind of blue\nMarc Short lifting Jillian kind of an were returning home to their Brooklyn brownstone from a lovely honeymoon in the Bahamas when their worst fears were realized their home security alarm was blasting and police officers were standing in front of their building\nOne officer on the scene told them I've never seen anything like this but upon further investigation it wasn't a robbery at all\nSometime over the weekend marks dog Tom escaped from a neighbor who was watching him and returned home to the doggie door setting off the alarms motion sensors but Tom wasn't alone she brought the neighbor's dog and cat along with three other dogs [laughter]\nThe\nPlace was left in shambles muddy paw prints shredded sofa cushions and animal waste was everywhere\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric location to serve central Florida family more information including locations that early no health dot com slash kids [laughter]\nAnd there was also no water left in any of the toilet bowl [laughter]\nClearly a desperate attempt to get sober [laughter] when police initially entered Tom was in the living room having relations with the neighbor's dog\nIn what officer Toby Crittenden described as quote in style but doggies are accustomed\nTo [noise]\nMark suspects Tom was heartbroken over the marriage of his longtime owner and perhaps wanted to quote go on a bender both owner and dog or not when pet therapy booming industry in their neighborhood of park slope Brooklyn death [laughter]\nJust to be a Corgi orgy [laughter] your next door ... and the urgency comes from Amy Dickinson\nEmily Mason is a structural engineer getting her PHD at Cornell University in between projects she indulges her hobby surfing through the dozens of Instagram accounts devoted to her favorite building the leaning tower of pizza\nTourist pictures fall into a few different category they're oh it's a tiny I can squeeze it between my fingers\nOr the inevitable oh no this cat belongs in my trials there's [noise]\nSo many tourists were taking selfies with the tower in the background that the city of piece of stole they wouldn't sell the platform two hundred yards away\nBut starting about six months ago the American engineer noticed something odd in dozens of southeast posted over the course of several weeks the power appeared to be straightening itself ever so slowly\nShe analyzed the photos an estimated that at this rate in only five years this tourist landmark would have to be renamed the not very interesting tower in some Italian town\nAfter publishing our findings in a paper called lean on a famous tower finally goes straight officials in piece of fish really freaked out an international team of experts armed lasers and ladders closed the tower down while they investigated this mystery\nA Belgian engineer finally figured out what was happening\nWhat shots had borrowed under the wouldn't sell the platform was starting to lean at an adult\nNow or is that\nThe American engineer has been forced to apologize\nYour last year we have nothing being wrong gums promote rock up\nOn a recent Wednesday and the British Midland city of Birmingham an ordinary citizen passed by the downtown branch of not West Bank and noticed employees cowering beneath their deaths\nNaturally the passer by alerted the police and officers were on the scene in minutes only to learn that the employees weren't under siege\nThey were playing hide and seek as a team building exercise\n[laughter] in the bank\nWas embarrassed the police simply laughed and life returned to normal a funny incident that for one brief moment may people forget that in Thirty years earth will be uninhabitable [laughter]\nOn that charming no [laughter]\nChoices [laughter]\nFrom hari come to bulldoze a story of some vacation or from Brooklyn who thought their houses have been ransacked when it turns out it was only a bunch of dogs having fun\nAnd one drunk kept from any begins in the authorities in ... Italy becoming concern that there's famous leaning tower would no longer leaner turns out it was just the place where they were taking photographs from had finally from Moe Rocca\nA story of a bank robbery that wasn't it was just the employees playing hide and seek which of these is the real story of an emergency that wasn't in this week's new\nUm [noise] I don't like a wing tired he's a story but I feel like the ... story is true\nHe's only ... you're going to choose smoking a story of the bank employees playing hide and seek yeah All right that's your choice we spoke to someone familiar with the real story and I'm sure hide and seek was fun as a kid but then the bank [noise]\nBuilding one of the largest corporate team building the country talking about the reasons not to use hide and seek the team building exercise especially in a bank especially during business hours [noise]\nRegulations you got it right they really want to hear mow and if you don't\nThem men and women know me\nNext time on ask me now there we're joined by after Nick\nCruel from the krill show Broadway oh how low and the Netflix animated series mouse will play a game called best of the fast where contestants will have to get real festival from one we just made up so joined me up your eyes and break for NPR's our puzzles word games and trivia [noise]\nBe sure to listen in to ask me another that begins today at noon right here on Ninety point seven FM W. M. F. the Orlando\nEvery word count in public radio ham Rachel Martin and when we're working on a story we checked our stocks and she's in the shower words carefully we do it because accuracy and we're going to matter here's how you can show accurate needed matters to you too [noise] you can call one eight hundred and Seventy five twenty twenty or visit W.\nN. F. E. dot org thanks so much\nSupport for in the yard comes from NPR stations and lumber liquidators offering flooring installation nationwide with new styles of hard would it would look waterproof slurring more lumber liquidators dot com or one eight hundred to two seven four zero three six\nFidelity investments taking a personalized approach to helping clients grow preserve and manage their will to learn more infidelity dot com slash wealth\nFidelity brokerage services Elsie and luxury Craig family owned makers of small batch Kentucky straight bourbon whiskey ... barges town Kentucky\nForty seven percent alcohol by volume electric Craig promotes responsible drinking um\nSome NPR WB easy Chicago this was wait wait don't tell me the NPR News quiz on bill Curtis were playing this week with Morocco how they got into belly and Amy Dickinson and here again as your host after chase bank auditorium in downtown Chicago Peter cycle\nIt doesn't it builds got rheumatoid arthritis\nOr Lipitor limericks challenge if you'd like to play give us a call a bunch of like wait wait that's one eight eight eight and I do for it not too far right now pedal some more questions for you from the week's news hari a historic statue of a\nRevolutionary War general down in Savannah Georgia has been vandalized in an incident that city officials are calling quotes no laughing matter what did those vandals due to that statue\nUm did did they remove\nHis hacked they did not remove his hat or the added something\nThey they they put it in a red nose on him know that day or did they put glasses on him\nNo but you're getting closer to the better to Google ECU my daughter goes\n\nHas looked surprise you should see the statue [noise] the Google you guys were stuck on a statue of\nRevolutionary War general Nathaniel green making you look less determined to bring freedom to the colonies in more\nHours [laughter] wait a\nSecond date desecrated a U.S general they desecrated a general and they went after a revolutionary\nWar general you dig savanna they're somebody better targets but they went for this guy really yeah [noise] uh individual defense some historians think the new look accurately represent the look on general greens face when he said that there's going to be a hip hop musical about who\nKnows [laughter]\nSee the image of the statute with ... Google Google statue on Google dot com [laughter]\nAmy [laughter] yeah\nIt's the least of California are investigating claims at a high school student brought and cookies for her class that may have been laced with what\nHurts grant these Ashton yeah [laughter] although we heard it was a grandma but at this point how can you tell 'em according to reports the student brought in a tray of cookies\nThat had been baked with both love it also her grandma's ashes and she fed them to at least ten other kids in the class it's terrible could have been worse you could have made the cookies with raisins [laughter]\n... ... with her grandmother recipe exactly\n\nWhat they mean by that I Know\nIt's it's amazing she literally pull the senior prank she\nShould have defected something was a mess which you served the cookies out of an earned [laughter]\nYou know we ever\nFind out what her motivation I\nKnow it's an absolute mystery we don't know why she did it whether she did it on purpose but these school assurances that everybody's health is fine there's just a bunch of children who will never eat cookies [laughter]\nWell you know people used to always ask me what was in my grandmother's ravioli and how we know\nI told him no more for you know for me because that's good enough for me was\nComing up with lightning fill in the blank but first as the game or you have to listen for the rhyme if you'd like to play on air call to leave a message\nThat one triple a quick way to this one eight eight nine two four eight to four or click contact us link on our website wait wait that NPR dot org there you can find out about attending er shows here at the chase bank auditorium in Chicago and our big twentieth anniversary extravaganza this Thursday at the Chicago theater\nHigh you are on wait wait don't tell me how it\nIs it's a fascinating from Denver, Colorado how are things getting over\nThere they're pretty warm this week we're okay well what are you there in Denver I Am a keeper yours keeper\nIs exciting do you go to like are you in charge of any particular animal or mostly take care of the bears [laughter] oh no\nThey paired them jealousy our entire segment and we're now going to talk to you for ten minutes about what there's been we have\nAn ... here at the numbers\nI ever heard that grizzly bears and polar bears are the two most dangerous kinds of bears that they will eat you up\n[laughter] you know we try to keep people out of the exhibit marriages\nGrizzly bears and polar bears like each other I think it'll reporting question though is do they like you\n[laughter] they did a main grizzly bears can actually smell me out of a crowd\nWhen session with young jak [noise]\nA walk to the show\nCurtis is going to reduce three news related\nSupport for Ninety points and the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers to central Florida for more than twenty five years more information including national rankings available online ... Arnold Palmer hospital dot com\nWe all know that the boss is a jerk and met underground feelings will lurk given to that urge some teardrop emerge it's okay to be crying at work one that is really write a research\nStudy [noise]\nFive percent of CFOs thinks that crying at work once in awhile shouldn't carry a stigma in fact it's completely normal especially if you're completely useless that your job girl [laughter]\nOr if a beer by two [laughter]\nI'll tell you I'm a stand up comic I tried that once and I know that we are very quickly\nThe argument is crying is not a shameful thing as a human emotion happens to all of a sometimes you know like when the vending machine is out of Diet Coke so should not be seen as negative unless you're doing it every single day that's a problem or if your job is like an entertainer children's birthday parties\nOr something else for you need to be a cool right I mean you never want to hear greetings to the flight deck\n[laughter]\nHey I have a staff do bears have or cry [laughter]\nThey don't know that ever gets sad sad bears\nWanting the betting for one of our marriage and then she got really upset with that\nUh do can do cry [laughter]\nHere stuff and he is your next limerick in taken to unseat him Greek shouldn't [noise] with apples [laughter] our bombs will be an increase of ... ... how could I forget my work with my Powell\nAnd say I told him if he didn't want more\nThan\n... taken too I've seen him Greece should with Apple's are bombs be increase would lead style you know in the sense how could I forget my work with my bell\nI Need a hand guys imagine an actor I matched with a Scottish accent [noise]\n[noise]\nAnd the Schindler\nLiam Neeson [laughter] claims a horse or set of his new movie recognized him from filming a previous western years before either that or the horse was just being polite [noise]\nOf course yeah right oh yeah you mean years ago yeah\nOf course probably the connection was incident the horse got excited and we need when the actor arrived on set and nice and remembered him to saying you never forget a horse race [noise]\nPeople were doubtful but other actors backed up nuisance claims this is true Russell Crowe chimed in on Twitter he said he worked with a horse named George on the movie gladiator and then he worked with him again on Robin Hood divorce recognize them and they are quote lifelong friends oh ask for comment George said more like colleagues", "show_name": "Wait Wait... Don't Tell Me! (Rebroadcast)", "year": "2018", "city": "Orlando", "day": "20"}