{"month": "10", "state": "FL", "station": "WMFE", "content": "Looking for more of the masters on W. M. S. E. I object that's where there was a great way to hear more classical music on your radio\nTuned your HD Radio to Ninety point seven H. D. too for nonstop classical music twenty four hours a day don't have an HD Radio yet not to worry you can also listen online at W. M. S. dot org expert\nGhost towns across the wild west these little towns and you can unleash the imagination meat legends of Irish history has been immortalized in some\nIf it was a great song or tune it was there before us and it will be there after\nAnd investigate what happened to Michael Rockefeller in the wilds of New Guinea\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nJoin us for all the travel adventures and updates with Rick Steve that begins this afternoon at three right here on Monday point seven ... W. M. F. E.\nSupport for Ninety point seven news comes from boats do rentals boats do rentals was in Orlando baseball rental company offering a twenty foot soundtrack or deck vote including life jackets\nSound system Carmen safety equipment and seats nine people voted delivered to renters location and captain services are available reservation information is at boats do rentals dot com [noise]\n\nFrom NPR and the Chicago visit wait wait don't tell me and we are noticed with [noise]\n\nWhat Nineteen Ninety eight nobody could imagine what things would be like in twenty eight teams that we all have supercomputers in our pocket and just use them for solid there\nWould be a reality show starring even crazier than that naked guy from survivor and at a certain laws that you would still be on the air will celebrate the twentieth anniversary wait wait and build Curtis reflects on the fact that a distinguished career a news led him here [noise]\nSo good to see this coming\nThere's lots of surprises and this week maybe them off about them on our quiz coming up right after this hour's new [noise]\nRange in age from fifty four to Ninety seven among those killed three women eight men including two brothers at a husband and wife the dad from what is believed to be the worst attack in history on a U.S synagogue were listed by Dr Carl Williams the chief medical examiner for Allegheny county\nSeventy five year old Joyce Feinberg of Oakland or sixty five year old Richard got fried of Ross township Ninety seven year old rose mail in your scroll hill sixty six year old Jerry Rabinowitz ... would ah fifty nine year old Cecil Rosenthal of scroll hill ah\nFifty four year old the foods are Rosenthal or ... David Cecil Rose Bowl were brothers uh eighty four year old ... Simonov Wilkins bird is six year olds Sylvan five and a ... bird producing Sylvan her husband and wife\nSeventy one year old Daniel Stein of scroll hill ... year old's Melvin ... in sixty nine year old or younger of mount Washington\nThe accused gunman in the attack is facing federal hate crime charges oddly herring from member station ... W E essay reports that forty six year old Robert Bowers is due to make his first appearance in\nFederal court tomorrow us attorney Scott ... says powers made statements regarding genocide and his desire to kill Jewish people during the course of the shooting authorities don't yet know why ... hours targeted the tree of life synagogue in Pittsburgh ... hill neighborhood ... says they're still investigating\nKnow that we will spare no effort\nResource in ensuring that the defendant is held fully accountable for his unspeakable and hateful crimes\nPowers could face the death penalty he was also charged Saturday at the state level with counts of homicide ethnic intimidation and aggravated assault the victims ranged in age from fifty forty Ninety seven for NPR News I'm only hearing in Pittsburgh\nA foreign nation summit on Syria wrapped up in Istanbul yesterday with a call for a ceasefire elections and in your constitution NPR's Peter Kenyon reports they had to Germany and France joined a Russian a Turkish leaders after some\nAt a news conference following the summit Turkish president ... complete ceasefire across Syria is the immediate priority there was no clear progress on the future of Syrian president Bashar last ahead with\nThe final statement asserting only that his fate should be in the hands of the Syrian people these double summit effectively expands the so called a stone of process which included Russia turkey and Iran by adding two major European powers but without the U.S or any Syrian group's\nTurkey is also vowing to clear out terrorists from northern Syria a reference to Syrian Kurdish fighters\nAllied with the U.S military Peter Kenyon NPR News Istanbul visual NPR\nJournalists across the country covered local news and all those stories about your city's culture town hall and changes in your community\nThere are all connected I'm Jeremy Hobson and local journalism means going into your neighborhood schools and barber shops to talk to you when you wrinkle those stories together you get a vivid picture of our country its people and the challenges we face\nTake for an example education\nSchools across Oklahoma had been closed for nine days\nAnd in North Carolina thousands of teachers are expected to march on the state\nCapitol in Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix\nYou can hear the bigger picture when you listen to NPR and when you give each month you help support local stories that unite our country keep the stories that connect our country coming become a sustaining member now\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG\nYour general support of a dollar a day during this plan would drive make sure the reliable need to know information on that point seven W. M. F. ...\n... exactly where you expected to be please call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot orange once again one eight hundred Seventy five twenty twenty and thanks\nCornerstone society members play a powerful role in helping Ninety point seven W. M. F. you maintain its high standards for this reason I'd like to extend sincere thanks and appreciation to David and Debbie our back\nThank you for helping insured the future of public radio through your W him at the cornerstone society membership\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners to support this NPR station\nSpotlight is Ninety point seven weekly arts and culture and entertain them segment it features highlighted weekend events from my parents have we have the Daly city and reviews from\nScott josephs Orlando restaurant guide as well as interviews that spotlight the arts and culture of central Florida spotlight friday afternoon at five fifty on Ninety point seven means\n[noise]\nFrom in the argument that would be easy Chicago this is wait wait don't tell me the NPR News quiz open up your anniversary card everybody there is a ... dollar bill in the air [noise]\nI've heard it said that they should feel there is shut down\n[noise]\nFeel for you today and I know I always say that but this time I Am not lying [noise] today we are celebrating\nHi I'm up on taking all of our president and general manager of make the point that I mean do you imagine it's been two years since we first tried this less intrusive salad one racing called fine with Dr and this is how we do we know WMA family\nDo you support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\n[noise] so today our twentieth anniversary spectacular from the stage of the beautiful Chicago theater in downtown checking my notes Chicago and [noise]\nNow we couldn't decide which your panelists we should invite onto the show so we just invited all of them if you have to\nAnd if there's one you have well wait a minute we'll swap them out for somebody else it's a party with all our friends and that includes use or give us a call the number is one AAA wait wait that's one eight eight nine two four eight nine two four now let's welcome our first listener contest and how you are on wait wait don't tell me\nHigh it's in ... New York city in New York City and what do you do that and I'm an actor and a check to their chest tutor for kids in ... it's more interesting and the two at the\nTime [noise] do you do your chest to do to support your acting yeah absolutely\nYeah [noise] and what do you do to support your daughter and [noise] that's a good question [laughter]\nWell welcome to the show Jasmine you're going to be playing who's build assignment joining us for the game of our panelists Roy Blunt junior Peter gross and Paula Poundstone [noise]\nWhat are you sure you know how this works\nBill Curtis was going to create for your three quotations from this week's news you can correctly identify or explain just two of them you will\nWhen our prize the voice of your choice from our show and you'll hear all of them on your voicemail ready to play Jasmine your first caller is from former White House communications director Anthony Scaramucci\nHe's an intentional liar it's very different than just being a liar liar\nSupport for the New York comes from the station and from the NPR One club everyone comes with the story including NPR inspired bottles like weekend edition Saturday available to adults ... years or older learn more at NPR One globe dot org\nCapital I'm committed to reimagining banking offering savings ... hidden accounts that can be open from anywhere capital one what's in your wallet capital I'm at night\nAnd Trader Joe's all very new products and every store a new episodes of the original ... series you lose sunlight Trader Joe's that apple bug or what but gas or will be a little more at Trader Joe's duck gum\nRobbing the our WB easy Chicago though says wait wait don't tell me the NPR News quiz on bill Curtis and hosted the Chicago area there in Chicago Illinois [noise]\nRight\nNow it's time for our listener game will be playing with our next channel is Amy Dickinson safe sailing\nIn the air Hi you're on wait wait don't tell me\nA peer ... peer and I'm calling from Madison, Wisconsin\nHow are things in Madison to\nPhase in Madison or break what do you do there in Madison I'm finishing up some dark to research and all of our time pilots actually\nReally are you flying around really are you like a smuggling drugs over the border what are you doing [noise] well\nI Can't tell you not officially but what I can say is unlike some Illinois based airline carriers we make it a point to be on an\nAirplane burn airplane [laughter]\nTo the show Chandler you're going to play the game in which you must try to tell the truth from fiction but what is daily topic way to go I decided [noise]\nEvery now and then there is a terrible scandal in the world of science our panelists are going to tell you about one of those scandals that popped up this week pick the one who's telling the truth and you'll win the voice of the weight waiter of your choice on your voicemail you're ready to play\nAbsolutely alright Taylor let's hear first from faced singing like\nSharma climber and her husband Dr Peter Kramer and\nFor decades that known as the swamp plants couple like parents psychology they've always white lab coats that say his hers I became a primary focus is on record do parasites they love to brag about the crap they go through it together that stronger their marriage\nBut one Charlotte shockingly ran off with a hot young research assistant named Chad\nKeeter wanted revenge and his were then has rocked the world of microbiology without the macro court case you think when they don't think Peter recently discovered too new\nHi I'm up on taking all of our president and general manager of make the point that a double your your man it's been two years since we first tried this less intrusive salad one racing called fine with Dr ... how we do we now have you ever met family\nThrough your support uninterrupted programming donating a dollar a day and maybe that'll go call one eight hundred Seventy five twenty twenty\nSort of course is lack for Harry ad chat [noise] this\nIs a Web worm that causes ...\nBut only live for thirty second Peter named this species treacherous premature as I've been a Chad which means early a rival\nChad [noise] which is why\nChad Peter for defamation in Baltimore County circuit court in order for the organisms named to be legally considered libel that had vigil pre maturity of the actual chats arrival has to be explicitly argue in front of a judge\nFor a child former girlfriend testify to the fact that his\nShall we say personal biological studies often ran out of funding before they could reach a satisfying inclusion\n[noise]\nThe judge just a lawsuit as frivolous but a great reminder of the benefits of studying Latin [laughter]\n[noise]\n[noise]\n[noise] for vengeance biased burned lover your next story of a science screw up comes from Amy Dickinson\nJust in England have their British cars and the twins over recent articles published by the British Journal of sports medicine that they stay show a distinct and\nSlimy pro ... by us these articles and opinion pieces encourage nay urge\nPeople to stop eating their nutritious bowls of fresh kale and cabbage or the journal suggests if you must hate your salad at the very least you should top it off with a stick of creamy full fat butter\nKnow according to their studies fatty fat is good for you\nThe medical journal it's edited by pro butter cardiologist named Dr esteem now for tests and his stance on that\nIs still controversial\nThan a hundred and sixty eight British scientists have now published an open letter attacking\nThese studies accusing them of being nothing more than ... baloney\nDr ... declined to respond to the criticism directly but he did quote George Bernard shaw\nI learned long ago never to wrestle with the pig he said you get dirty and besides the pig likes it the doctor might have added you could also put your that pig render its fat into marred and credit onto your morning cupcake\n[noise]\nThe accusation at a British\nNutrition journal and your laughter in trouble in the lab comes from ... rock\nIf you're going to play with fire use your own fire that's a message from the national institutes of health to researcher Ted for\nBy gay first works as a chemist what's topical line Bunsen burner as in an age laboratory but by night furthest an aspiring flamboyant concert pianist the problem is first can't afford a candle ... de rigueur for flamboyant concert pianist\nAnd show he's been using and I ate bunch and burners grouping three of them together for his candle opera [noise]\nHands his stage name ...\n[laughter]\nForeigners have long been used for a variety of purposes young Robert Oppenheimer family famously connected nine of them for a makeshift Menorah during\nHanukkah at the end I Avon\nBurners our government property not to be use for anything other than whatever it is you use Bunsen burner for first has been suspended without pay Liberace has started to go find me page for real Kendall opera\n\nSomething scandalous happened in science circles this week it was it from a face daily a man's sued for naming two ugly parasites after his ex wife and her lover\nFrom Amy Dickinson accusations of pro butter by us at a prestigious British science turtle or from ... rock a month and\nBurners being misused by the concert pianist lover [laughter] the real story of a scientific scandal\nOr the ... the answer is from Amy the story you know with\nThe butter Taylor is our twentieth anniversary [laughter]\n... me neither [laughter] All right well we actually spoke to believe it or not\nTo one of the scientists involved with this real controversy we are not thriving locked out on\nThe job how to use on [noise]\nThat was Dr Nicole to guess from kings College London one of the scientists who accused the journal of having a pro butter biased congratulations you're going to run\nYou don't\nOn our show for your voicemail thank you so if you're playing with us today [noise]\nAnd now the game which for Twenty years has confused hundreds have guessed by asking them about things they don't know anything about is still not my job [noise]\nTwenty years ago NPR took a big risk by launching our show they were known for their serious journalism what wouldn't we do to their reputation I mean Walter Cronkite had a great run but he never had to say that the way it is now a man who stuffed thirty five dollars [laughter]\n\nSo we thought we'd bring on two of those legends of journalism and ask how they handled it Robert Siegel and Nina Totenberg welcome back to\nSo welcome back you both been on a show before Robert you were you retired from after a long career or\nI did I retired in January and and uh how you doing I'm doing whatever I Want to do and it's a lot of fun well how are you spending your time I listen to some radio I Do anniversaries twentieth anniversary thirtieth anniversary [laughter] when he was for him again for the first thing\nOr Ninety point German WM after you get stories with an inside\nThat make you stop and think it's radio you want everyone you know to hear and his radio that exists banks to the general support of listeners like you contribute now to support the silent Dr call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot org\nSupport for Ninety points that the news comes from tens preying\nOn chats private well he'll exist to be a collaborative community of individuals' families in committed professionals focused on growing wealth in support of the families entering values more information is available online at WWW dot ... dot com\nSupport for the New York comes from the station and from the NPR One club\nEveryone comes with the story including NPR inspired bottles like weekend edition Saturday available to adults twenty ... years or older learn more at NPR One globe dot org\nCapital I'm committed to reimagining banking offering savings ... hidden accounts that can be open from anywhere capital one\nWhat's in your wallet capital um LA and Trader Joe's over a new product every store a new episodes of the original ... series you lose ... journals that apple bug or what but guess are available\nMore at Trader Joe's dot com [noise]\nVR it'd be easy Chicago they choose wait wait don't tell me the NPR News quiz I'm Bill Curtis an irregular shows that the Chicago theater in Chicago Illinois finger thank you\nThink\nBack on those Twenty years in all the good rhymes we've had together as a listener limerick challenge game if you'd like to give us a call ... wait wait that's one eight eight eight nine two four eight nine two four now it's time for some more questions from this week's news and the pedal were playing with right now is Adam\nBurke and again our side and Adam celebrate\nRight we haven't got to be having a chance to warm up here to the jump right in there and we we ever been on a panel to get her really well yeah I don't know I don't like it\nNever had a job I mean I don't know that fresh panels smell yeah [laughter]\nWork the success of the game poke among go was inspired a number of knockoff versions where players can go around trying to catch things other than poke 'em up this week and what group released their version of a virtual reality hunting game\nI'm so things you would go out and hunt well you know book among do works well hold on to the oil and you see smoke monster as much as it's called LSD by the way back on our backstage now they've never ever been on NPR party people using library cards to cut up lines of flowers\n[laughter]\nHard again competition is man yeah I have\nNo idea what the answer to your outlook when like oh yeah you know hoping mon go\nOh it just to find saying the\nChurch no ... well yes we got the leading big Catholic Church the Vatican they're playing poker mind go their own version that just like talk among go without all the false idol is the [noise]\nTried to use video games for education and tourism before like clear disasters version of Tetris which every shape was across [laughter]\n[noise] it was hard\nTo play the kind of thing where they walk around the Vatican and it's like if you turn on your front and look you can see like a bleeding dying fainter so yeah it's actually yeah walk around and they're\nLike you can see holy figures you know from church history and the and the saints and you can ... their blessings around to the pope\nYou can check out a little ball yeah no the cat is that when you go to heaven you when you got to cut them off you know again as a veil over the course on precision\nAnd X. box three sixteen [laughter]\nAgain after a number of complaints Kleenex has announced it will stop marketing their extra large tissues as two shoes for\nWhom like do they have a lot\nBring that about [laughter] her face [laughter]\nNot too far\nThis was sexist market large size tissues in one way to try the other [laughter]\nWe got there and again that's all they were called man sized issue which was a problem [laughter] you\n[laughter]\nOther designations are potentially you know what I made a like extra absorbing widow strength is you\nKnow [laughter]\nSo\nThat they were called ... and they really want to really insecure men magnum tissues\n[laughter] yeah those are not ... for ...\nProud Boys is just an empty box [laughter] [laughter] I\nWas just a picture of your dad looking at you disapprove [laughter]\n\nComing up it's lightning fill in the blanks with this\nHi I'm up on taking all of our president and general manager of make the point I mean do you imagine it's been two years since we first tried this less intrusive salad one racing called fun to drive and this is how we do we know WMA family\nDo you support and interrupted programming donating a dollar a day and maybe that'll go call one eight hundred Seventy five twenty twenty [noise]\nIf you'd like to play on air Carlo leave a message in one triple a wait wait that's one eight eight eight nine two four eight nine two four high you are on when we don't tell me this is Kimberley dollars you know\n[noise] do you want to come on down to wage I'm actually only\nA few merchandise Mart him I think you're only what do you what do you do hear a traitor to the non profit organization\nThat's good grades [noise] one with two very good to have you can really do Curtis is going to reduce three news related member actually the last word or phrase missing from each of you can fill in that last word or phrase correctly in to the limit you will be a winner you ready to black here's your first limerick\nSince I Can't get my guts to get flatter I'm feeding my bridesmaids\nRaw better ... almost think that the do die of shake I Need all those girls to look yeah\nSaying the Australian publication women details a bride sinister but we're told very real plot\nTo look amazing and be the center of attention on her big day her plan to make sure the bridesmaid's looked terrible first you've selected neon yellow bridesmaid dresses that made them quote washed out in slightly ill\nBut she also regularly set them breakfast shake that she would spike with a protein powder for people who want to bulk up [noise]\nShe's gonna be in shape you know\nKorean presumably it was presented his true I did this and you know for giving me they lost all the way she said but we were could not believe that uh even the worst ... would actually sabotage around ... ... ... ... ... you had a wedding at one point did you have bread made that this wedding\nI think I did not have any ... names at the wedding but if my head I just let it made them went to see you know I wanted them to look like me\nYou don't need to watch out for [laughter]\nThem being like here I'm like you know fat\n[noise] here is your next glimmer some time\nWith my feelings are hurt by man's laundry aisle briefly divert for other people really you know what I'm sniffing his lean start smelling his old dirty shirt\n[noise] researchers Saccone\nUniversity released a new study showing that women de stress by smelling their\nPartners dirty shirts Peter it was ... it was a result of an experimental much thirty four women were repeatedly given the electric shocks\nTo stretch them out [noise] and then given stuff to smell [laughter]\nStraightened limit that like I mean the fact\nHere is your last summer\nView humans with snorkel and the small family court bugging ex go take a dolphin when you're looking above oh we don't want to make a lot of you have ruined the sex lives on the go\n\nA new study dolphins that friend time around humans\nHave less interest in meeting the researchers examined spinner dolphins swim in Hawaii near\nTerrorists and noted they're declining sex lives so not only are we ruining the ocean with our garbage were also blue hole blocking the dolphins\n[laughter] the question is\nIs it because she was like she has seen a human in the speed oh and she's like that is what I Want to have or is it because she saw a German tourist industry to when she was like I can never have sex with anything yeah pretty much again for the rest of my lab or just we're just not", "show_name": "Wait Wait... Don't Tell Me! (Rebroadcast)", "year": "2018", "city": "Orlando", "day": "28"}