{"month": "10", "state": "FL", "station": "WMFE", "content": "And even though city councils alter the leaf blower or the through the choir they use during our show whenever they hear us\nSaid this is NPR\n[noise] after Hurricane Maria last year Puerto Rico declared Disney to crisis was over so far\nWe are not that they think me okay [noise]\nBut it turns out the government just stopped looking for the ... I mean if you don't test for the guy how are you going to know how many people I mean in fact that the ... on the next reveal [noise]\n\nJoin us for revealed from the center of investigative reporting that begins this afternoon it too right here on Ninety point seven FM W. M. F. E. Orlando does your morning routine include coffee breakfast maybe a drive to work does it also includes Ninety point seven W. M. F. E. Hi\nThis is David Greene co host of NPR's MORNING EDITION help keep this station strong into the future by calling one eight hundred Seventy five twenty twenty or you can go online at W. M. F. E. dot org [noise]\n\nFrom NPR and do they mean Hansi Chicago visit is wait wait don't tell me being beyond this way [noise]\nIn Nineteen Ninety eight nobody could imagine what things would be like in twenty eight teams\nThe bar for Ninety point have the news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that she's darling do health dotcom\nLaunched that you would still be on the air will celebrate the twentieth anniversary of wait wait and filtered us reflects on the facts at a distinguished career in news let him here [noise]\nSo good to see this coming\nThere's lots of surprises in this week maybe about them on article is coming up right after this hour's new [noise]\n\nLive from NPR News in Washington on ... on a Justice Department officials say fifty six year old ...\nAn adventurer Florida center at least fourteen mail bombs to prominence Democrats he was taken into custody yesterday will make his first court appearance next week\nA feverish supporter of President Trump faces five federal charges in connection with the mail bomb plot that spurred a weeklong coast to coast investigation and that probe continue NPR's David Schaper has more on this story from Fort Lauderdale stay out delivered\nPizza for new river pizza in fresh kitchen in Fort Lauderdale for much of last year it has lost several reggae and says as a worker he was dependable reliable is political views\nI was a a lesbian or an inhouse along with the African Americans and the Jews\nEight and a transgender than Hillary Clinton ... you know while while\nStill ... says she was shocked to hear say X arrest for allegedly sending\n... saying he was never confrontational north threatening David Schaper NPR News Fort Lauderdale\nAnd unfolding story Pittsburgh Police report an active shooter near a synagogue police are on the scene since early October federal authorities have been releasing hundreds of asylum seekers and family who cross the border illegally and Arizona from member station ... in Phoenix Matthew Casey has the latest\nStudying volume in a court settlement that limits how long children can be detained federal immigration authorities started releasing families to churches and activists in Arizona\nNow the releases are also happening in Texas and California pastor bell Jenkins founded a San Diego based coalition that can provide about one hundred shelter beds he says the group may need five times that number\nIf we could turn over the you know every two nights we probably could handle it we're we're going to happen if people are going to get stuck in the system so to speak\nJenkins says families stay at the shelter longer when sponsors back out his coalition is trying to find more beds for NPR News I'm Matthew Casey in Phoenix\nAnd then we can stay there holding fire falling around of rocket attacks on Israel more from Daniel Estrin\nThe Islamic jihad militant group in God's that says it will adhere to any ... brokered cease fire Israel had no comment earlier today the Israeli military said the group fired more than thirty rockets at Israel and Israel struck more than ... eighty Hamas militant posting ... there were no injuries were reported on either side\nIsrael accuses Iranian forces in Syria of ordering up the rocket fire\nEarlier today the Israeli military hinted at might strike in Syria and retaliation\nEgypt is still trying to work out a deal between Hamas and Gaza and Israel to end months of Palestinian protests and violence on the Israeli border fence yesterday gossip officials say Israeli troops killed for Palestinians the Gaza border Daniel Estrin NPR News Jerusalem this is NPR\nAcross the country covered local news and all those stories about your city's culture town hall and changes in your community\nThere are all connected I'm Jeremy Hobson and local journalism means going into your neighborhood schools and barber shops to talk to you when you link all those stories together you get a vivid picture of our country its people and the challenges we face take for an example education\nSchools across Oklahoma have been closed for nine days and in North Carolina thousands of teachers are expected to march on a steak catchers in Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix\nYou can hear the bigger picture when you listen to NPR and when you give each month you help support local stories that unite our country keep the stories that connect our country coming become a sustaining member now\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG\nYour generous the board of a dollar a day during this plan would drive make sure the reliable need to know information on that point seven WM every\nSpain's exactly where you expected to be please call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot orgy once again one eight hundred Seventy five twenty twenty and things\nSupport for Ninety point seven news comes in the College of arts and humanities often graduate and undergraduate degrees and certificate the arts and humanities provide context for meaningful dialogue supporting central Florida it's creative economy in celebrating our diverse cultures find your voice it UCF College of arts and humanities C. H. dot U. C. S. dot edu\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a\nNew series from the creator of Mad Men starring Diane Lane newer widely Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nIs not the point seven ... W. M. F. E. bill Johnson taking a look at a beautiful forecast for today partly sunny for the high near eighty four tonight partly cloudy with low around fifty nine and for tomorrow a sunny day with a high near Seventy eight\nFor Sunday night clear with the low around sixty and for Monday a sunny day with a high near a fee to support public radio during this fall silent drive at W. M. F. U. dot org or by calling one eight hundred Seventy five twenty twenty\n[noise]\nFrom in the yard and I don't want to be easy Chicago who says wait wait don't tell me the NPR News quiz open up your anniversary card every body there's a ... dollar bill in the air [noise]\nI've heard it said that the Chicago theater in Chicago\n[noise]\nHere today and I know I always say that but this time I Am not lying [noise] today we are celebrating wait wait don't tell me he's twentieth birthday\nOne more year of having to ask for MORNING EDITION to buy our booze [noise] today our twentieth anniversary spectacular from the stage of the beautiful Chicago theater in downtown checking my notes Chicago [noise]\nNow we couldn't decide which your panelists we should invite on for the show so we just invited all of them have you ever had\nAnd if there's one you have well wait a minute we'll swap them out for somebody else it's a party with all our friends and that includes used or give us a call the number is one triple a wait wait that's one eighty nine two four eight and I do for now let's welcome our first listener contest in how you are on wait wait don't tell me\nThat didn't get to a theater in New York City\nHi I'm up on taking all of our president and general manager of make the point I mean do you imagine it's been two years since we first tried this less intrusive salad one racing called fine with Dr and this is how we do we know WMA family\nDo you support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nDo you do your chest to do to support your acting yeah lately\nYeah [noise] and what do you do to support your daughter and\nI took a class [laughter]\nWell welcome to the show Jasmine you're going to be playing who's build this time and joining us\nFor the game are our panel it's really a blood to junior Peter gross and Paula Poundstone [noise]\nPretty sure you know how this works bill Curtis was going to create fear three quotations from this week's news if you can correctly identify or explain just two of them you will when our prize the voice of your choice from our show and you'll hear all of them on your voicemail you ready to play Jasmine your first caller\nDot edu slush MBA nova southeastern university prepare to dominate\n... stand up comic with cerebral palsy and that part of ...\nAnd there was a non oppression Olympics I Would win the gold medal I'm Palestinian Muslim\nI'm female I'm the same old and I live in New Jersey [noise]\nThrough the pain that next time on the Ted radio hour NPR [noise]\nBe sure to listen in to the Ted radio hour that begins this afternoon at three right here on Ninety point seven ... W. M. F. E. Orlando\nHi I'm off on taking all of our president and general manager of Ninety seven W. M. F. be two years since we first tried this less intrusive style the fundraising called Dr this\nIs how we do with sugar support today if you can join our course don't just I don't eat one hundred dollars a month at W. M. S. dot org call one eight hundred Seventy five twenty twenty\nStart your week with MORNING EDITION weekday mornings beginning six right here on Ninety point seven FM W. M. F. E. Orlando\nSupport for the New York comes from the station and from the NPR One club everyone comes with the story including NPR inspired bottles like weekend edition cabernet available to adults ... years or older learn more at NPR One globe dot org\nCapital I'm committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital I'm MA\nAnd Trader Joe's all very new products every store a new episodes of the original ... series you lose sunlight Trader Joe's that apple bud ... or ... or will be a little more at Trader Joe's dot dom ...\nFrom NPR's WB easy Chicago the city is wait wait don't tell me the NPR News quiz on milk producing heritage or hosted the Chicago theater in Chicago Illinois [noise]\nRight\nNow it's time for our listener game will will be playing with our next channel ... is Amy Dickinson safe sailing\nBy are getting on the air Hi you're on wait wait don't tell me\nA pair that Chris Taylor and I'm calling from Madison, Wisconsin\nHow are things in Madison to\nPhase in Madison or break what do you do there in Madison I'm\nFinishing up some doctoral research and I'm a part time pilot actually really\nAre you flying can rally or you like a smuggling drugs over the border what are you doing [noise] well\nI Can't tell you that officially but what I can say is unlike some Illinois based airline carriers we make it a point to be on time\nAirplane burn airplane [laughter]\nTo the show Chandler you're going to play the game in which you must try to tell the truth from fiction bill what is Taylor topic way to go I go\nEvery now and then there is a terrible scandal in the world of science our panelists are going to tell you about one of those scandals that popped up this week the one who's telling the truth and you'll win the voice of the weight waiter of your choice on your voicemail you're ready to play\nAbsolutely are ideal there let's hear first from faced singing like\nSherman climber and her husband Dr Peter current\nFor decades they known as ... parents psychology\nIf all these white lab coats that say his hers I became primary focus is on rectal parasites they love to brag about the crap they go through it together that stronger their marriage when Charlotte shockingly ran off with a hot young research assistant named Chad\nCheater wanted revenge and his revenge has rocked the world of microbiology without macro court case you think when they don't think Peter recently discovered two new parasite\nHi I'm up on taking all of our president and general manager of make the point that a double your your man it's been two years since we first tried this less intrusive salad one racing called fine with Dr ... how we do we now have you ever met family\nThrough your support uninterrupted programming donating a dollar a day and maybe that'll go call one eight hundred Seventy five twenty twenty\nIs last for Harry and chat [noise] this\nIs the ... that causes\nBut only live for thirty seconds Peter named this species treacherous premature as I've been a Chad which means early a rival Chad [noise]\nWhich is why Chad Peter for defamation in Baltimore County circuit court in order for the organisms named to be legally considered liable to hit the actual pre maturity of the actual chat a rival has to be explicitly argue in front of a judge\nFor Chad's former girlfriend testify to the fact that his shall we say personal biological studies often ran out of funding before they could reach a satisfying clues\n\nThe judge dismissed the lawsuit as frivolous but a great reminder of the benefits of studying Latin [laughter]\n\n[noise] for vengeance biased burned lover your next story but science corrupt comes from Amy Dickinson\nJust in England have their British workers and the twins over recent articles published by the British Journal of sports medicine that they stay show it does stink and slimy pro ... by a\nThese articles and opinion pieces encourage nay urge\nPeople to stop eating their nutritious bowls of fresh kale and cabbage\nOr the journal suggests if you must hate your salad at the very least you should top it off with a stick of creamy full fat butter\nKnow according to their studies that if that is good for you the medical journal it's edited by pro butter cardiologist named Dr Steen now for tests and his stance on fat is still controversial\nThat a hundred and sixty eight British scientists have now published an open letter attacking these studies accusing them of being nothing more than ... alone a\nDoctor among the horror to decline to respond to the criticism directly but he did quote George Bernard shaw I learned long ago never to wrestle with the pig he said you get dirty and besides the\nPig likes it the doctor might have added you could also put your that pig render its bad in the lord and credit onto your morning cupcake [noise]\n\nVia the accusation\nBritish nutrition journal and your laughter in trouble in the lab comes from ... rock or\nIf you're going to play with fire use your own fire that's the message from the national institutes of health to research or cared for by gave birth to work as a chemist what the topic of the line function burners and an end I H laboratory but by night furthest an aspiring flamboyant concert pianist\nThe problem is first can't afford a candle ... de rigueur for flamboyant concert pianist\nAnd so he's been using and I ate bunch and burners grouping three of them together for his candle opera hands his stage name ...\n[laughter]\nBurners have long been used for a variety of purposes young Robert Oppenheimer is family famously connected nine of them for a makeshift Menorah dream on\nOn\nThe end I ate sponsoring burners our government property not to use for anything other than whatever it is you use function burners for first has been suspended without pay ... started to go up on the page for real Kendall opera\n\nSomething scandalous happened in science circles this week one this from faces salient man's sued for naming two ugly parasites after his ex wife and her lover from Amy Dickinson accusations of\nPro butter by us at a prestigious British science journal or from ... rock a\nMonth and burners being misused by the concert pianist lover [laughter] which is the real story of a scientific scandal\nUh the answer is number key Vicki answer is from Amy the story you know who to call him butter Taylor is our twentieth anniversary [laughter] ... I mean All right well we actually spoke believe it or not\nOne of the scientists involved with this real controversy we are not thriving knocked out onto the\nJob as much as you go on [noise]\nThat was Dr Nicole to guess from kings College London one of the scientist who accused the journal of having a pro butter bio congratulations\nYou've got to run well [noise]\nI don't want to try the voice of your story from anyone on our show for your voice mail thank you so much for playing with us today [noise]\n[noise] next time I asked me another instance later start ups about square pants the Broadway musical tells us about the call that led to it all\nAnd they said we have this audition for you can't tell you what it is technically the title of land that project but we think you might be the right shape for it [laughter]\nThey're joined me of your eyes and break for NPR's our pet those word games and trivia [noise]\nBe sure to listen in to ask me another that begins today at noon right here on Ninety point seven Afghan W. M. F. the Orlando\nI'm Joshua Johnson the host of one\nMay become a sustaining member of W. M. F. B. during our silent to drive your generator supportive a dollar a day and make sure the reliable needs no information on Ninety point seven W. M. F. E. stays right where you want it to please call eight hundred seven eight five twenty twenty or did the W. M. F. E. dot org\nSupport for the New York comes from the station and from the NPR One club everyone comes with the story including NPR inspired bottles like weekend edition Saturday available to adults ... years or older learn more at NPR One club dot org\nCapital I'm committed to reimagining banking offering savings and credit and accounts that can be open from anywhere capital one\nWhat's in your wallet capital I'm at night and Trader Joe's all very new products in every store a new episodes of the original ... series you lose sunlight Trader Joe's at apple bug ... or ... or will be a little\nMore at Trader Joe's duck gum [noise]\nMainly are already be easy you should go there to wait wait don't tell me the NPR News quiz I'm don't hurt us at ... shows that the Chicago theater in Chicago Illinois [noise] I don't care about\nDon't think\nBack in those Twenty years and all the good rhymes we've had together as a listener limerick gentleman's game if you'd like to give us a call ... wait wait that's one eight eight eight nine two four eight nine two four now it's time for some more questions from this week's news and the pedal were playing with right now is Adam\n... and again our side and Adam celebrate [noise]\nRight you haven't got to be having a chance to warm up here to the jump right in there I mean we ever been out of hand altogether really well yeah I don't know I don't like it\nNever had a bunch of fresh panel smell [laughter] Adam work\nThe success of the game will come and go and inspired a number of knockoff versions where players can go around trying to catch things other than ... this week and what group released their version of a virtual reality hunting game\nI'm so things you would go out and hunt well you know book among do works well hold on to the oil and you see monsters are coming out as much as called LSD backing all backstage is that if you've ever been on NPR party people using library cards to cut up lines of Claritin\nLike [laughter] it was\nHard again publication mad [laughter] [noise] yeah I\nKnow I Do end up not about what you're looking like oh yeah you know hoping ... go oh\nI just don't find saying is that the\nChurch no ... well yeah we got the big Catholic Church Vatican they're playing poker mind go their own version [noise] it's just like talk among go without all the false idols the\nTried to use video games for education and tourism before like clear disasters version of Tetris which every shape was across [laughter]\n[noise]\nHow what kind of thing where they walk around the Vatican and it's like if you turn on your phone and look you can see like a bleeding dying fainter so yeah it's actually yeah I Walk around and they're like\nYou can see holy figures you know from church history and the then the saints and being their blessings around for the pope you can check out a little ball yeah no the cat is that when you go to the U.S [noise] like\nI Know you gotta catch 'em all you know again as a veil of all the force on precision\nAnd X. box three sixteen [laughter]\nAgain after a number of complaints Kleenex has announced it will stop marketing their extra large tissues as two shoes for\nWhom it was like right\nDo you have a\nBring that out there [laughter]\nFade [laughter]\nToo far\nFor this was sexist market large size tissues in one way to try the other\nWe got to get your car that recall [noise] man size issue which was a problem you know [laughter]\nOther designations of you know what I mainly like extra absorbing widows strength because you\nKnow [laughter]\nYeah\nThere there were held man's life issues and they really want to really insecure men magnum tissues\n[laughter] what I hear those around for\nProud Boys is just an empty box [laughter] [laughter] I\nWas just a picture of your dad looking at it as a person [laughter]\n\nComing out is lightning fill in the blanks with a special all star edition but first it's the game where you have to listen to the rhyme and we'll be playing right now with Tyler Clancy Luca Burbank and Brian Babylon [noise]\nIf you'd like to play on their color leave a message in one triple\nA wait wait that's one eight eight eight nine two four eight nine two four high you are on wait wait don't tell me this is Kimberley no ... no\nMatter [noise] do you want to come on down to wage\nThe merchandise Mart in my you're only what do you what do you do\nFor Ninety point have the news comes from Orlando hell whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six ... ... ... more information is that she's darling do health dot com\nRedo three news related limericks for the last word or phrase missing from each of you can fill in that last word or phrase directly into the Olympics you will be a winner you ready to play I Am writing All right here's your first limerick\nSince ... got to get flatter I'm feeding my bridesmaids raw better oh they almost say that the do die of shake I Need all those girls to look bad yeah\nThe Australian publication of women details of bride sinister but we're told very real plot to look amazing and be the center of attention on her big day her plan make sure the bridesmaid's looking terrible [noise] first she selected neon yellow bridesmaid dresses that made them quote and washed out in slightly ill\nBut she also regularly fed them breakfast shake that she would spike with a protein powder for people who want to bulk up [noise]\nShe's gonna be in shape you know sad\nStory and presumably it was presented his true I did this and you know they've forgiven me they lost in the way she said but we were could not believe that uh even the worst Brad Miller would actually sabotage around ... ... ... ... ... you had a wedding at one point did you have bread made that this wedding\nI think I did not have any by name that the wedding but if I did I did when I made them went to see you know I wanted them to look like me you know in what counts [laughter]\nThem being like here I'm going to like you know fattening\nHere is your next limerick some timeless\nRuin my feelings are hurt by man's laundry aisle briefly divert for other feel relieved ... sniffing his sleeve I start smelling his old dirty Sharon\n[noise] researchers at Stockholm University\nReleased a new study showing that women de stress by smelling their\nPartners dirty shirts Peter it was ... it was a result of an experiment which thirty four women were repeatedly given electric shocks\nTo stress them out [noise] and then given stuff to smell [laughter]\nStraightened limit that like I mean the fact\nHere is your last summer\nView humans with snorkel and the small ... foot bugging us\nTake up those when you're looking up above oh we don't want to make a lot of you have ruined the sex lives ...\nAccording\nFans on around humans have less interest in meeting the researchers examined spinner dolphins swim in Hawaii nearer tourists and noted they're declining sex lives so not only are we ruining the ocean with our garbage were also global blocking", "year": "2018", "show_name": "Wait Wait... Don't Tell Me! (Rebroadcast)", "city": "Orlando", "day": "27"}