{"month": "10", "state": "TX", "station": "KUT", "content": "Okay you tease membership drive is under way so you only have a few hours laughing to grab our early bird special make your contribution of ten dollars a month or more than ...\nMidnight and you can get the new K. U. T. public radio nurse Jean shirt and two of our goals plastic my\nRe great thank you give one generous donations for the smart news you bend down from K. U. T. visit Kay you cheat outdoors right now and take a look at the new T shirt and plastic my glasses and check out this fabulous offered make your investment in K. U. T. by midnight tonight\nAt ten dollars a month or more to take advantage of our early bird special [noise]\nK. U. T. died or because the pay scale or five twenty four seven one six to nine one I'm Rebecca knocking right joined this morning by Katie senior editor Ben said good morning I got it made its way\nDo not ready this goes so fast when it when we do ...\nYeah it is going and in fact it's really going fast because this was the shortest course Dr we've ever had here at UT five days that's it Monday through friday then we're done\nThere's obviously a lot of news that needs to be covered starting next week which will be the second and last week of early voting and then a week after that we're going to have election day lots of things to coverage so we want to get out of the way\nAnd the best way to make us get out of the way is to go ahead and call in your support at five one to four seven one six to nine one or go to UT dot org\nKatie is doing a lot to keep you informed as you go to the polls tonight as a special program and then where is it\nThis was Wesley United Methodist church it say mares forum for the accounts for the candidates that are running for mayor will have the mayor of starting at seven o'clock at Wesleyan Methodist Church over east Austin and it'll be good is a good ... a good chance to come out and hear what the candidate effect say and you know decide who you'd like to be the next\nMayor of Austin exactly and then tomorrow night we have\nA show of using proves that the cactus cafe beginning at six o'clock all free and open to the public will have ABCs and political commentator Matthew Dowd with us to talk about what's going on a national seen\nEmily ... the editor in chief at the Texas Tribune She's going to be talking about what's going on here in Texas and Adrian ... to talk about Austin and\nAll of your voting information about Austin says you've got questions then sell pot is going to the guest host tomorrow night for that ... come on out and and listen have a drink and and let us know what's on your mind that said using brute tomorrow at a cactus cafe\nHates Peter said will you\nKnow being a public radio host and a member is just not enough for me I also like to cold call my friends to make sure they're donating to let's\nTry Alonzo bow to\nBail onto its Peter ... uh well I didn't know if you are in fact a member of your local public radio stations are we all do you get any coup premiums\nCoffee or I'm going one road to go on a book about ... or just do the hard really\nThere were like you know a lot of the vote and why don't you come to this wonderful event were doing yesterday will be provided by comedian Alonzo boats\nAre good you know do the ... going to grow a little above\nAll I can say as long as a thank you for being on the good side of the ledger gears how you can become a new member right now\nYou can go on line to K. U. T. dot org or give us a call five when to push seven months six to nine months\nAnd you know we the the events that we talked about earlier those are free and open the public but you know hey you want a little special benefit we do have things like the concert club that over ... started to cross promote but uh you know you've you've joined there at the\nFive hundred five hundred dollar level no\nSix hundred dollars you they get to our producer off off my producer six hundred dollars level a year and a you can get invited to come see some of the different bands that come through Austin which is a lot of fun because we got great bands that come through author and come to UT\nAnd we were able to build this great studio one a it's a really intimate space beautiful lots of great windows and you get to come in and check out the station as well we were able to build this great station because you've said you know what\nYour great news source and music source here in Austin and we want you to have a wonderful new building and he helped us to do that you've always supported us along the way\nTo make sure we stay strong and independent and right now is your chance if you have not yet become a new member of K U T go to K. U. T. dot org ... maybe you can get in a ten dollar month level and and all those early bird special wonderful messes\nYes like the ... the teacher and that you have like radio or the NPR nerd T shirt and a and the pie glasses plastic ... glasses which are great because you know they won't break as easily exactly nice\nK. U. T. dot Oregon thanks\nIt's easy to lose track of the fact what with all the claims coming at you from both sides of the political divide\nYou hear the claims reported on K. U. T. of course\nBut the difference in our recording\nIs the attention we paid fact checking and and now it's [noise] it really is as simple as that\nFact checking and analysis at the heart of all of our political covered\nIt leads to intelligence insightful reporting presented in a way that helps you understand the issues and the candidates [noise] listen to support is what makes this kind of smart and journalism possible new your parts today and become Katie's new sustaining member\nAs a sustaining member you make an investment on a monthly amount but if you're comfortable with\nFive Fifteen dollars among whatever works for you\nThis will be an investment in K U T that helps us build the capacity to bring you the news and information that you rely on from Austin's NPR stations\nMake the decision to invest in the smart news and information you trust become ... newest sustaining member right now by giving safely and securely ... dot org\nOr by calling five one to four seven one six to nine one\nAnd thanks so much had five twenty four seven one six to nine one or a K. U. T. dot org and you know K. U. T. public radio we have always been dedicated to bringing you\nThoughtful fact based journalism but that's not something that is is different now with this new administration and this whole idea\nFake news which we know is out there but we have just remained doing what we're doing and we're going to continue to do that because it's important to you want to have a news source that you can trust no matter what the rhetoric around news is so right now it's your opportunity to go on line to K. U. T. dot org\nCheck out our great new thank you gifts get in on that early bird special if you can or give us a call five one to four seven one six to nine ...\nAnd you know we made a decision and kill you can use as the elections were beginning back in a march in the primaries but yes of course we're going to cover what the candidates are running will cover some of what their campaigns are talking about but what we really wanted to focus on was really the effects of how you actually register to vote how you actually go vote\nThere's no fake news they're folks this is how you actually get to the pool and how you decide to vote however you decide to vote\nAnd uh you know we are able to put together a video showing you how to walk through the actual voting place and do that voting 'em and all that is because you have supported us in the past you have to appreciate the work that we do\nA and you know you want to become connected with the city by helping K. U. T. at UT Donald we actually got a nice comment if you're a Caroline and Jeff Martin husband and I have become sustaining members because we listen to tell you to you every day and many times we start a conversation with\nHey I was listening to the radio when I heard this on the UT you're already listening you're already getting something out of your with your enjoyment of UT so so go ahead and and you have a little money maybe you have to you to eat out or\nWhen you show your support for Austin's NPR station with a pledge of sixty dollars or more will say thanks with one of our great and you think you get\nFor just five dollars a month to clear plastic mind classes with love those are those your favorite often radio stations [noise] check out the K U T public radio nerds T shirts and new K. U. T. X. T shirts and the first ever Texas standard T\nThere's also a volume twelve of the K U T I live with sons from shaky gray Jim yard urges Calexico and many more\nForget the studio one a concert floods [noise] these kids are our way of saying thanks for your generous supportive of smart news you will make possible stickers on tradition level in a nice thank you get right now\nAt K. U. T. dot org thanks and thanks so much Jimmy monsters in next he's going to take you through the afternoon program stink is coming up just pass news headlines\nFrom NPR and arts eclectic in the twelve o'clock hour this has often said NPR station K. U. T.\nK. U. T. H. D. one Austin on line ... community supported public radio from U. T. Austin Austin water has issued a citywide boil water notice for our customers\nAs the utility works as often utility works to stabilize the water treatment system customers are asked to boil water for drinking cooking ice or water for pets to a vigorous boil for three minutes at least before consuming water is okay to use for showering\nWashing hands and doing laundry dishes however should be washed and hot soapy water\nAnd rinsed with boiling water boil water and bottled water should be used for baby formula water filtration systems are not enough to renew the harmful bacteria and that's going to be\nVery useful information going forward this week 'cause a lot of rain is in the forecast sixty one degrees in the capital city at the time is one of one\nEffort to change south Texas into a farming in agricultural economy also introduced farmers uh that had a different idea of not just about land use but also racial hierarchies and so they introduced a not just a farming culture\nUm but also Jim Crow segregation laws and so historians have called this a ... era in South Texas\nHow what was the purpose of the Texas Rangers when it was established as a law enforcement agency\nWhile it's been described that their their\nUh their reason for creating the ranger force was to help us support and protect Anglo colonizer\nAnd immigrants that we're living in what we now call Texas or even under when it was under flying into the Mexican flag and so Texas Rangers have a long history of uh being in conflict with a native nations in Texas a so that Anglo colonizer could\nYou know expand our foot hold and and hold on to property that they were claiming has their own\nUm but they also had over a role\nIn the allowing\nChattel slavery to thrive in Texas and so um you know Texas Rangers participated in the civil war a an in the confederacy and when in slave D\nAmericans people that were living in in in slavery we're trying to reach Mexico by traveling through Texas a Texas Rangers also participated in trying to um [noise]\nA capture those men and women and children and returned back to slavery so the the the the call for Texas Rangers as we broadly remember it is it they were\nCreated as a force to protect vulnerable Anglo a settlers are but we have to remember that this is a history of conquest and colonization and so their effort\nAnd their role was was to protect but also to to\nAh create um a a a new colony\n... so the years between Nineteen ten in Nineteen twenty were particularly bloody in Texas new rights I'm In some detail about three incidents in particular that will get into here in the hour but\nCan you talk about what the ... with the Mexican revolution had to do with the climate as it existed I'm In Texas between Nineteen ten in Nineteen twenty\n[noise] yeah well there had been a longer history of anti American Violence in Texas so\nWhat we understand is that the decade between Nineteen ten in Nineteen twenty really saw peak in anti Mexican violence um so there had been a long interest uh and use of mob violence and violence at the hands of state police to correct\nAny sort of um efforts by Mexicans living in Texas a that we're trying to to to to challenge Anglo colonization of the region\nUm but that didn't also mean the Texas Rangers weren't combating Anglo ranchers for example of that we're not supportive of the barbed wire that was being used to\nPolice to defense and private property so these conflicts between an ethnic Mexicans in that erupted in the early twentieth century has longer deeper roots\nUm but when you had a large numbers of England migrants from southern states in order to states moving to south Texas and early twentieth century they were calling for things like more border security so in that era\nYou had people who lived in towns like Brownsville a that bordered models and they were connected really communities not just economically but also socially and culturally and so people lived fluidly into borderlands\nAnd one of the efforts of these English settlers that came to south Texas was to make the border between the United states and Mexico feel more like order and so they called for things like\nBorder security and the militarization of the border and when the Mexican revolution uh the the conflicts that civil war arrived in the northern border with Mexico in the United states of those calls for border security were amplified and eventually they were answered by the United states government into in the form of hundreds of\nA hundred thousand us troops that were stationed in on the U.S Mexico border and a large number of them in Texas [noise]\nWorst fears that angle Texans had 'em that they might suffer the effects of some kind of spillover violence justify that there are stories aren't there like contributions guys coming across the border did this happen in Texas on a regular basis\nThey did happen in Texas do their part of a one of the the the complications of understanding this period\nUm is that there was a a an effort by some in South Texas to uh what's known as a revolution the blonde to San Diego I'm which erupted in Nineteen Fifteen and for the summer of Nineteen fifty was particularly brutal\nUm you did see raids taking place up either you did the Mexican revolutionaries you know crossing into the United states uh for creative and so you know Bon Jovi I is this\nMythical figure I'm In part because he also played up his role he posed for\nHollywood cameras um and uh on display of I've seen his saddles you know they catch the light of Hollywood film a with silver threat and and uh a silver weren't you know federal horns\nI'm so there certainly is a ... in popular memory but that figure of Bon Jovi and others\nThat crossed into Texas or crossed into New Mexico Arizona\nI'm a is it something that most Americans have a a a some sense of of memory of\n'em but in Nineteen Fifteen with a plan to San Diego there was really a there were there were efforts to undermine the infrastructure of this ... farm colonization so\nThere you know railroads were were blown up and real return our phone up and say you saw these efforts to try to to dismantle um these these icons of Anglo colonization um but what really took place was that you know in the case where you know there was a raid on an Anglo ranch\nA or a U.S soldier a died\nThe kinds of violence that were called for were expansive and so it was really an era of both of the hands of us soldiers but also Texas Rangers in England inch lend he's that you had a calls for revenge by proxy\nSo the victims of any sort of raid a we're not just the the targets of the rate of of of in some cases Mexican ranchers but also Anglo ranchers a but anybody in the region who looked method Mexican in this period was profiled as being a potential revolutionary or potential banned it\nAnd so the some of these raids that took place would that lead to as justification for the calls for more brutal policing and the warm military presence on the border\n[noise] All right I'm let's talk about some of these incidents um what happened to I'm telling you that I guess in Rock Springs Texas\nSo the story of Antonio nobody is is one that's been widely remembered in Texas um it's the case of a Mexican national who was by some accounts just passing through the\nTown of Rock Springs and Edwards county in central Texas um by other accounts he was a laborer who was living in Edwards county I'm In working on ranches but the\nWhat took place in November third Nineteen ten is that he was taken by a mob and accused of murdering I'm an Anglo ranch wife ... and um and\nHe was arrested placed in the county jail um and later a move by a mob and that took him from the jail denied him due process and instead burnt him alive at the state so this is a case that\nIn terms of our understanding of the history of lynchings in the United states I'm really resonates with what people understand as a as a public lynching yeah somebody being taken from police police can a custody and burned alive in front of a mob you know a crowd\nUm and so the brutality of being burned alive at the state left a lasting imprint\nOn the community um but it also shuttle light on a much longer history of lynchings of ethnic Mexican so ... you know recent historical studies have shown that between Eighteen forty in Nineteen twenty eight over two hundred ethnic Mexicans were lynched I'm In Texas alone\nSo the the the lynchings Antoni gets his looms large in public memory um but it's just one example of that kind of brutality that at the Mexican suffered\nMy guess is ... she is Stan Lee J Bernstein assistant professor of American studies and ethnic studies at Brown university and she has a new book out it's called the injustice never leaves you anti Mexican violence in tax if\nYou'd like to be part of the conversation you can call into one eight hundred nine three three five three seven to ... you can email think at K. E. R. A. dot org or go to Twitter We're at K. E. R. A. thing [noise]\nOh [noise]\n\nAnd so it's been that hard to dislodge I'm even a hundred years later Texans are some Texans are really struggling with with letting go of\nThis um this line of of of justification to violence\nOkay Nineteen Fifteen um two men on Tony ... and his sons were murdered in ... county by Texas Rangers what what took place there and what was the fallout after those killings\n... what do you mean by fall out well just first of all tell us what happened and then we'll we'll get to the second part of the question\nYeah so has this was on and on ... where\nI'm prominent members of society and you know go county um they were landowners in prominent ranchers\n... could trace back his family um property to Spanish land grant so it's important to note here that you know they not only had long standing roots in Texas but they had been part of a class of\nOf Spanish and Mexican colonizer seems so this also reminds us that this is a complicated history of conquest and colonization here um and so the ... family and it was on family the Antonina was has used was on um son in law\nUm and they were murdered in September Nineteen Fifteen um and there were noticed occasions into the double murder 'em in the the witnesses\nUm that placed a Texas Ranger and local civilians in a car and that shot the two men as they were leaving a ranch they were for travelling I'm actually a Texas Ranger headquarters in a ... on a near um by ranch to report that they had been robbed\n'em and at the horses had been taken from their ranch and so they were in a precarious position they had to decide\nYou know do we risk I'm interacting with law enforcement to to\nTo report this robbery um if we don't and later you know bandits or the or caught 'em in the capacity of our horses than they could have been mistaken as being banned sympathizers or in some way endorsing a theft\nAnd so they took a chance in in the reporter in robbed\n'em and as they were returning home they were shot in the back and I'm witnesses reported later remember later that they were instructed not to bury that remains and so it was a few days later that finally family and friends gathered in and gave the two men a proper burial\nSo if I fall and I mean with anybody punished for these killings no ... there was no prosecution there was no investigation and into the devil murders and so\nThis is an example of of two prominent citizens and this is I think than the on the part of the story that was they learned from conducting oral histories with some of the descendants especially not ...\nI'm One of the things that really troubles her as she learned a family history it was when she realized that there was no investigation into their into the double murder but also that she couldn't find historical documents\nThat gave her access to what happened and so for her it was a sort of let her on a quest uh she knew that the two men are Liz she had had seen photographs of them are she knew her grandmother Antonia\n... and so she um she could put together a a history of the men who were um and the families that were interrupted by their double murder\n'em and so she she put together a family archive that gave give us access to who these people were um but but what stands in contrast to that is that the state uh and the judicial system didn't give us access to their debt\nAnd so um you know that the work of the historians and and for a long time just Texas residents who've had to learn how to conduct history to try to piece together accounts of what took place and of course there are\nSo many unanswered questions for the descendants um in one that that stands out for me is that when my uncle had will take us\nYou know she she wonders if they suffered after they died and that is a reminder of the loss of life and the ways that the generations have been deeply impacted 'em by the justification of this violence by the criminalization of of people who died\nUm and and so there's an injustice not just in in in the violence that took place but also the injustice of the ways in which these killings has been remembered um and presented to the public as progress\nAnd that is um it's another injury this think I'm Chris Boyd\nSupport comes from CGI in is designed build embedded in the fabric of Boston for over half a century with architecture construction and interior design all under one roof CGI in is designed build fuel right at home support\nComes from Dr ... often thyroid and endocrinology with twenty plus years of experience at hormonal adrenal and thyroid disorder diabetes and osteoporosis new patients welcome Austin thyroid dot com\nYou're listening to think on K U T Ninety point five thanks so much for joining us Stay tuned for the world coming up at two o'clock President Trump threatened to cut off us aid to Central American countries as well as a reality check on the number of jobs Americans hold in the weapons sales industry\nThose stories and more coming up in the world at two right here on cagey\nPacey would like to thank for following business McCann Adam studio need him appraisal in consulting SARS in your eyes off Thomas so laughter seem Conway massage school [noise] chastity lock and key\nFocus the mind ADHD evaluation and treat cedar park Montessori school and savvy and she Montessori school\nLittle bar restaurant had hopper McCaskill V. O. L. C. [noise]\nAnd you're listening to the one of the shortest membership Dr ever in the history of K. U. T. radio here on Ninety point five I'm now joined by all things considered producer Trish are some times host Trish are injury\nGood afternoon to you it's good to be here on this the day the first full day of five full days of the membership drive it seems like a long time since we've done one of these so much has happened but it is that time once again and it's a great opportunity to become the next a new member of gay UT\nAll you have to do is go to K. U. T. dot O. R. G. these are strange times what can you do about it and I'm David Brown of the Texas standards\nWhen I was a student studying journalism one of the first things we learned about what's the purpose of a free press most countries don't have such a thing part of the role of journalism is to serve as a watchdog to monitor those in power another is to help educate because an informed citizenry is essential to a functioning democracy\nRight now there are a lot of folks who feel things have become dysfunctional and it's pretty clear that's tied to the proliferation of fake stories pretending to be news or opinion masquerading as fact\nWhich brings us back to the question what can you do you can support an independent news source committed to fact based journalism\nCan you see news and the Texas standards were founded on those basic principles and your support makes our work possible so let me use this opportunity to thank you for your part in this your commitment to responsible journalism through your support\nOf gay UT and its programs like the Texas standard and think from K. R. A. that\nHelp you broaden your perspective on your\nThe state you live in the city that you live in the world that we live in and you come to us for a perspective on culture and history behind stories like for instance Monica Munoz Martinez since she's talking about\nThe families of Mexicans killed by vigilantes in West Texas these are the stories that you are not going to get anywhere else on the dial in Austin, Texas today\nAnd it couldn't happen without the support from people like you are listening to it right now and we were getting\nGetting some names coming in people stepping up and showing that support may include Jim and Sarah riddles and a new business number Kimberly quarter a medical doctor who's also an OBGYN thanks for your support Dr ... and also the ... you can join them by going to ... dot org\n\nI'm Mary Louise Kelly we live in unsettling times and as we all try to make sense of forces shaping our world our country our towns were never I feel our job at NPR is not telling you what to think it's not yelling\nWe try to be a force for facts a home for civil and respectful but fierce questions to the people we interview police show your support for this station become a sustaining member and thank you\nAnd always thank you so much for becoming a new member today we couldn't do without you\nWe are need your support and more than ever especially on a very short and membership drive without your help getting us to the finish line by friday or we would be forced to make these things longer so no one wants that right to my right trying\nNo one wants to that and uh we do want and we know you want us to get back to what we primarily do and as minute news and information and you've heard of before but it continues to be true it's never been more important than it is now so do show your support by calling for seven one six to nine one are going to kill you to eat out the word she", "show_name": "Think", "year": "2018", "city": "Austin", "day": "22"}