{"month": "10", "state": "RI", "station": "WELH", "content": "Seven seven eight eight eight nine six three seven four seven seven and thanks\nSupport for Rhode Island public radio include rusty drums offering them for your modernized screaming operation with Sanford will force equipment for renting a drawing of drugs one governor's street at ... dot com\nPart of the ... school providing opportunities for curiosity challenging choice\nFor grades nursery through twelve open house October twenty of mind to June ... we were school dot org buy orchard condominiums offering single level two and three bedroom condo in a forest setting in West work on the crunch demar\nWWW dot orchard alright\nDoctor all the sort of Rhode Island public radio ... WNPR Newport one or two points of an image DWI ... maryann superior minded one point five FM WCBS why Coventry public schools\nIdiot port whatever ... W E L rich but we were school Providence Rhode Island public radio\nLive from NPR News in Washington I'm Windsor Johnston\nPresident Trump's divisive remarks about the woman who accuses Supreme Court nominee Brett Kavanaugh of sexual assault risk alienating key Republican senators Trump mock Christine Blasey Ford at a campaign rally last night\nNPR's Tim Mak reports Kavanaugh's confirmation almost certainly hinges on boats from Senator Susan Collins Lisa Murkowski and Jeff Flake\nTrump mocked Ford's Senate testimony at a political rally in Mississippi\nHis attack on Capitol is accuser was greeted with cheers but where is the place I don't remember how many [noise] not\nSo much on Capitol Hill Republicans have a slim majority in the Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nEye and taking everything into account and I think that the president's comments yesterday ... Dr Ford were totally inappropriate and in my view unacceptable\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nA un tribunal has ordered the U.S to ensure that sanctions against Iran do not impact humanitarian aid or aviation safety as NPR's Michele Kelemen reports Iran is welcoming the decision while secretary of state Mike Pompeo is blasting Iran for abusing the court\nSecretary Pompeo says Iran brought what he calls a merit list case at the international court of justice based on a treaty that he says Iran has been ignoring\nI'm announcing the United states terminating the Nineteen fifty five treat everybody with a wrong this was a decision frankly that his thirty nine years overdue ...\nSays while the U.S is re imposing sanctions on Iran having pulled out of the Iran nuclear deal the Treasury Department is making sure that humanitarian transactions can continue\nBut the secretary ads Iran could be helping its own people rather than arming proxy militias in Iraq Syria and Lebanon Michele ... NPR News Washington\nAt journalists group and turkey is calling on the governmental look into the apparent disappearance of a prominent Saudi journalist and critic of Saudi policies NPR's Peter Kenyon says journalist ... reportedly entered the Saudi consulate in Istanbul on Tuesday and did not come out\nTurkish Arab journalist association edits voice to those if the show these Turkish fiance and a friend who said they waited in vain for him to come out of the Saudi consulate the association said in a statement its ears because she'll be security he left Saudi Arabia\nThe writings about the kingdom NPR's Peter Kenyon reporting on Wall street that Dallas that city for planes the NASDAQ up twenty five the S. and P. I. Q. this is NPR\nThis is Rhode Island public radio good afternoon I'm bay Fallon in Providence Providence city councils ordinance committee plans of public meeting for October twenty second to consider the forty six story tower propose for former state highway property\nCommittee chairman ... says developer Jason fame has been invited to make a presentation about the whole point tower proposal as it says fame as the one voice that's been missing and all the testimony about the project\nThe public hearing is said four or five thirty at city hall on the twenty second\nAmazon's raising its minimum wage to Fifteen dollars an hour includes it's brand new facility in Fall River\nThe Providence Journal reports the wage hike is certain to affect other Fall River businesses are still county economic development officials say Amazon's opening of its facility in the fall river ... park\nIs actually made it harder for other companies to attract and retain workers some local business owners say they try to make their own companies popular in other ways and they think the opioid crisis is a much greater concern\nMassachusetts minimum wage is said to be Fifteen dollars an hour officially in twenty twenty three\nA boil water advisory has been put on for some ... island residents after eco live bacteria was founded a sample collected from the storage tank of the president's Iowa underwater district shuttled to our news reports this advise recovers as many as seven hundred residents\nThe state department of health says little water district recommends that customers boiled vigorously for at least admit it all the water use for consumption\nThat advisory does not apply to residents with private wells or with the prudence park water co-op customers with questions and call the prudence island water district\n... a little bit of sunshine now upper sixties and to my clouds of mid fifties tomorrow partly sunny mid seventies then for friday sunshine getting to the low sixties\nThis is Rhode Island public radio support\nFor NPR comes from NPR stations other contributors include exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription normally information at color guard tested dot com\nThis is all things considered from NPR News I'm Ari Shapiro and I ... in the weeks since Christine Blasey Ford accused Supreme Court nominee Brett Kavanaugh sexual assault President Trump's response has been relatively restraint\nThat changed completely last night when President Trump mocked Ford at a rally in Mississippi\nHow did you get home I don't remember how did you get there I don't remember where is the place I don't remember how many years ago\nAnd today the White House briefing room press secretary Sarah Sanders defended the president's comments NPR's Danielle Kurtzleben has been following the president's response to all of this controversy and she joins us now Hey Daniel hello\nSo as we noted the president's tone it shifted dramatically last night and I just want to start out by talking about how his comments last night compared to how he's been talking about Ford up until last night\nSure so late last week after Christine Blasey Ford and Brett Kavanaugh testified before the Senate Judiciary committee Trump had taken a much softer tone towards Christine Blasey\nI thought ... he was very compelling and she looks like a very fine woman\nRational Republicans seem to be hearing to which was something to the effect of Christine Blasey Ford seems credible but you know maybe she's mistaken or I Wish we had more corroborating evidence but a lot of them use that key word credible\nThen last night he got up in front of the crowd and he he was mimicking her and the fact that you know she can't remember every single thing that happened that night so he was really the verging from that line and he was playing it to last and cheers from that audience yeah you can hear it in the ... yeah and so that has people really upset today some\nHow the response has been in the Senate because to get Kavanaugh through Senate Republicans are focusing on two key senators Lisa Murkowski of Alaska and Susan Collins of Maine how either of those two women responded to Trump's comments from last night\nRight well they're not happy or Lisa Murkowski has said her words were that it's inappropriate and unacceptable and that Trump's comments could sway her vote now Susan Collins likewise she told CNN that it was quote just plain wrong what Trump said and she wouldn't say if it would affect her vote you know one thing\nThat has been swirling in the middle of all of this is the fact that Trump has talked about how he actually emphasizes with Kavanaugh because he himself has been accused of sexual assault of sexual misconduct\nAbsolutely he has more than a dozen accusations of misconduct against him and like Brett Kavanaugh Trump is denying all of the allegations against him but\nThat's not the only echo here I mean let's look at how Trump has responded to those allegations likewise\nAnd one of those allegations against Trump or Jessica leads that woman who said he had groped her on an airplane decades ago he also mocked her after that allegation came out the quote that he said was she wouldn't be my first choice he likewise said that to a crowd the crowd likewise laughter cheered\nAnd you know he was really he really seem to be saying she's an attractive and that wouldn't have happened there for so the important thing that we're trying to get out here though is that we have a pet or not only of how Trump reacts to sexual misconduct allegations\nBut how his supporters react\nAnd his supporters by and large seemed to have stuck with him through the allegations against him even if they find those allegations distasteful\nReporting on south coast communities is an issue of the Rhode Island public radio and to UMass sharpest journalism alliance\nSupport for NPR comes from the station and from Amazon Prime video presenting the return of the man in the high castle were America's history is under siege but the resistance rises to fight for the world today was the new season premieres this October on prime video\nAnd from capital one offering a variety of credit card options with features for a range of customers from foodies to travelers capital one what's in your wallet credit approval required capital one bank usa NA\nFrom NPR News this is all things considered melted Chang and I'm Ari Shapiro many people in the U.S auto industry are breathing a sigh of relief this week the new trade deal between the U.S Mexico and Canada and months of uncertainty if it's approved by Congress it will spare carmakers from some of the terrorists that they had feared\nAnd will soon as senior vice president of the motor and equipment Manufacturers Association which represents more than a thousand companies and make auto parts you're in the U. S. thanks for joining us here on all things considered thank you very glad to be with you to begin with what you just described for listeners what you remember companies making and where you are in the auto making supply chain\nSo our members make the vast majority of the content for new vehicles and we also manufacture parts and components for maintenance and repair\nAnd how much was on the line for you in this trade agreement where you're holding your breath to see what the details would be\nWell our industry has actually done quite well injured after we've actually been able to grow our supply chain in North America we've been able to grow manufacturing jobs in the United states but it counts and all three countries being part of the agreement\nSo we are very pleased relieved that all three parties were able to come to an agreement this weekend we're cautiously optimistic that the terms of the agreement will work for the industry and for the American public\nWhen you look at the details of the agreement can you tell how it compares to NAFTA for you\nWell there's going to be an increase in the amount of North American content that will be required\nFor parts to travel through the three countries cannot to call it the U.S Mexico Canada agreement but she traveled through North America without having to pay tariffs there's going to be a requirement for more North American steel and aluminum a so all of that will impact our members\nAnd in addition there's going to be some new administrative costs that are going to be required one of the concerns we have cell or there's some new tariffs out there right now on steel and aluminum and we'd like to see Canada and the United states address that before they find writes disagreement in\nThe end of November\nSo on the one hand there won't be terrorists for material crossing Canada U.S Mexico border is on the other hand the steel and aluminum tariffs that were of concern to your industry have not gone away\nNo they have and I think one of the things we have to keep in mind as ... particular burden to smaller manufacturers many of these smaller manufacturers are only in the U.S and some of our members have seen the cost of their steel purchases\nSignificant increase it's typically of concern between Canada and the United states we'd like to see those two countries roll up their sleeves used his fame energy they use to conclude this this new NAFTA and be able to come to some kind of agreement on steel and aluminum tariffs\nI Know that there's a lot of relief from the auto industry now the uncertainty is gone but how does this compare to the old rules under NAFTA isn't an improvement just is it worse well\nI think for the United states perspective one of the things in the United states said little pool through was an increase in the U.S content and for some of our suppliers and some component manufacturers this is going to be a challenge there is no doubt about that\nI Do think that we're going to see more steel moral ... that's from North America and our vehicles\nTo bigger concern our members are going to have to see a ministry of cost and we're going to have to work really hard with all three parties to minimize those costs because consumers are going to get any value out of it and that's going to be our next a real challenge for as we move forward that Greenland\nAnd we'll send a senior vice president of the ... Manufacturers Association picture speaking with us today\nAnd he was a pleasure\nAnd good afternoon you're listening to Rhode Island public radio we bring you all things considered each and every day through the support of our listeners I'm Elisabeth Harrison Rhode Island Public Radio's fall membership campaign is in full swing and we hope he'll take just a couple of minutes right now\nTo give and support the news that you rely on one eight eight eight nine six three seven four seven seven is the number to call you can make a contribution on line at R. I. P. R. dot org and here it with me in the studio is our membership director jet\nThor with more that afternoon Elizabeth you can make that gift right now by calling eight eight eight nine six three seven four seven seven\nYou can give on line at R. I. P. R. dot O. R. G. it's becoming so easy today to live in a kind of a thought bubble sometimes it's described as of ... and perhaps of partisan bubble if you will\nThat's when you surround yourself with news programs were a host match your preconceived opinions and support a particular point of view well Rhode Island public radio we try hard to burst that bubble public radio brings you new voices different thoughts and opinions is\nA great journalism and stories that oftentimes might surprise you and a challenger existing way of thinking how you hopefully gained inside some of the topics that challenger long held a long held opinions or perhaps provide inside inside it's with another perspective\nYou'll see the world and a different more comprehensive way when you listen to Rhode Island public radio and we hope that you find the value in that and call in right now with the pledge of support it eight eight nine six three seven four seven seven is the phone number again the website is R. I. P. R. dot org\nBeen listening for a long time and many of you have contributed and we've been hearing from some of you this week and we still appreciate all of the gifts that are coming in but if you're listening to the sound of my voice right now if you just heard Jed\nAnd are you still haven't picked up that phone or you haven't gone on line and you haven't made a contribution yet then we're talking to you right now it is time to do your part you feel great once you've done it because you know it's like this thing it's like an hanging over you know you've been meaning to do it every time you hear us You're like yeah yeah\nI'm going to do that I Want to do that now is the time\nMake that step become a listener contributor for the very first time become part of all of the growing number of people in your community who are supporting index journalism who care about verified information\nWho are trying to make sure that everyone in our community can be better informed intellect\nOne eight eight eight nine six three seven four seven seven or R. I. P. R. dot org\nAnd Elizabeth just laid out some really good reasons to get up and I'm going to give you one more if you're on the fence when you make your contribution right now you're going to get entered in for a really cool a prize drawing that we have coming up here and just an hour and a half so six o'clock\nIs the deadline for our fault foodie tore a this is the maybe third or fourth year that we've offered this and this year we have seven restaurants that have come together to offer this prize it's their way of encouraging you to become a part of the community of listeners who support their public radio listening with a contribution\nMedic calm and Warren birth or stir bar in Brazil of course little moss and darkness co surfing turf in New Bedford Julie ends in Providence Nick's on Broadway here in Providence is well\nIf you are if you're the lucky winner you're going to get seven different hundred dollar gift cards and you can go out for several weekends in a row may be given to her friend it's really up to you if you win but you can't to\nUm win the prize if you don't get entered into the drawing you don't have to give it to be honored but if you're going to go on to the website and enter the contest\nYou might as well make a gift there as well because I it's really up to you whatever you can contribute you can do that by going online the website again is R. I. P. R. dot org the phone number is eight eight eight nine six three seven four seven seven\nAnd Donald hey Donald Donald in Smithfield good afternoon and thank you so much for your donation Donald ... has been entered now into the drive down all the winner knows he might win a Elizabeth in Barrington thank you so much for your guest good luck to you in the drawing as well\nAh Elizabeth Nash who is from Barrington now that's a place where you can now here Rhode Island public radio even better because of the eighty nine points three FM signal we're now on and it's a good example of some of the changes we're making here are some of the ways that we are making this public radio station better so that we can\nBetter serve all of you we have some exciting new podcast one of them has just started to roll out it's called ... it's a project with the Rhode Island counsel for the humanities\nLooking at the media and the media's role in democracy so some really interesting issues there check out that pod cast and make a contribution to support your very own public radio station\nAt R. I. P. R. dot org or one eight eight eight nine six three seven four seven seven\nAnd if you can't remember the last time that you made a contribution to Rhode Island public radio it's probably been a little bit longer than you think\nTime flies and often times what seems like just yesterday has actually been maybe a year or two or more if I if you can't remember when you made the last gift well it's probably time to renew do that now by calling eight eight eight nine six three seven four seven seven or give on line at R. I. P. R. dot org [noise]\nThe administration has abandoned its policy of separating families to deter illegal immigration but only after widespread outrage and after more than twenty six hundred children were already separated from their parents\nTo talk more about the d._a. chess inspector general's findings were joined by NPR's Joel Rose angel hey also so you know we've been hearing all year about the problems with this policy of separating families but what is new in this report that contradicts what we've been hearing from the administration\nWell it contradicts some early assurances that we got from federal officials as this policy was being rolled out here's da chest secretary cures to Nielsen\nIt is important to note that these miners are very well taken care of I don't believe that press they are very well taken care of it\nBut this report paints and much less rosy picture the inspector general found that da chess held hundreds of migrant children in border patrol facilities well beyond the legal limit of Seventy two hours in fact federal officials held more than eight hundred migrant children for longer than that including one child who was held for twenty five days\nAnd many of these children were held in metal cages and border patrol facilities near the border until the government was able to find space in shelters that are equipped to has children\nAnd as we mentioned many parents and children had trouble finding each other in the system after they were separated\nWell again at the time officials denied that that was a problem remember here's Alex aides are the secretary of health and Human Services speaking it back in June before Congress\nThere's no reason why any parent would not know where their child is located I could with with just basic keystrokes within seconds would find any child in our care for any parent\nHGH asked by the way cared for children after they were separated while da chess had custody of their parents and at the time da just said there was a central database of the locations of parents and their children\nAs central database did the inspector general fine that central database\nThe inspector general found no evidence that there was such a central database that you agencies actually had computer systems that could not communicate with each other and the inspector general found that when distraught parents tried to track down their children the government sometimes gave them inconsistent or just wrong information in some cases parents couldn't communicate with their kids at all\nAnd then what happened to those families\nGovernment was ordered to reunify them by a federal judge and it has reconnected more than two thousand children with their parents but the inspector general's report says that this lack of communication made that reunification process slower\nAnd the process was especially hard for children who are so young that they couldn't speak immigration authorities according to this report made no effort to identify those young children in any way no risk bans\nTo find these children and reunite them so have federal officials responded to the inspector general's report in any way\nWell as the administration often does is blaming quote immigration laws that are broken and poorly written unquote\n... does say that it deserves some credit for working quote exhaustively to reunite these families although again they were ordered to do so by a judge but just also acknowledge that the government's computer system still do not communicate across these agencies\nAre there any children who still haven't been reunited with their parents\nOh yeah more than a hundred and thirty remain in us custody apart from their parents mostly because those parents have already been deported without them back to Central America\nAll right That's NPR's Joel Rose thanks very much Joel you're walking\nOr as certain type of person I'm Sarah McCammon and we know that people who listen to NPR are more likely to do things like vote and call their representative but it's a chicken or the kind of thing do you listen because you're engaged citizen or are you more engaged because he listened whatever the case and informed\nPublic is essential to our democracy so support the news that keeps you in the know [noise]\nThat afternoon and thank you for listening to Rhode Island public radio we just heard some coverage there of a report on the family separation policy I was one of the biggest stories of the summer and NPR they're continuing to follow it continuing to ask questions\nAbout how a government officials acted in that situation and how they're doing they're still families that have not been reunited so we are continuing to cover that\nOne of the many reasons you value public radio the that ability to just stick with the story\nSo please give now please support that kind of coverage because it does cost money to keep reporters are going at these stories and that kind of dug it fashion that you know you want reporter is working for you in that way so\nUh your contribution right now it is helping us to keep doing that and please won't you please\nBe generous when you give a pick the amount that is right for you at R. I. P. R. dot org or one eight eight eight nine six three seven four seven seven I'm Elisabeth Harrison I'm here with ... Public Radio's membership director\nGood afternoon Elizabeth if you're listening right now maybe you're from Rhode Island or southeast Massachusetts maybe you've lived your entire life here or maybe you're somewhat new to the area\nWe often hear from folks who uh our our recent transplants to ... to Rhode Island in South is Massachusetts and they tell us how much they appreciate Rhode Island public radio and the rule that public radio plays and helping them understand their new community\nMaybe you've not been her that long you know when you when you move to a new area you have a lot of things to do you gotta\nYou gotta get settled into your new place we got to figure out where you're going to buy groceries and eventually you figure out you know where am I going to get my news well effort Island Public radio has become that place where\nYou rely on getting their news and information about what's happening here in your local community now's the time to make a pledge to support maybe you've been a public radio supporter and a ... in your previous city\nAnd you have to make that contribution to your new local public radio station if that's you call right now eight eight eight nine six three seven four seven seven joined folks like Sharon in Providence Sharon just made her a gift [noise]\nNow it's time for you to make your gift as well eight eight eight nine six three seven four seven seven is the phone number the website where you can make that first gift as R. I. P. R. dot org\nA grassroots organization but we're not here to organize you into any kind of political camp we are here to give you the information that you need a so that you can organize yourself so that you can\nSee so that you can participate in our democracy and that you have all the information you need to do that that is our guiding principle here at Rhode Island public radio is that is a service that is important to you please know\nThat it is those little contributions of five and ten dollars a month that might not sound like a lot but those are the contributions that added up to the most important part of our operating budget so\nIf you've never given before because he thought I Can't really give them much it's not going to make a difference you're wrong he makes a huge difference and we need more people just like all of your friends and neighbors who have been giving that amount that five dollars or ten dollars a month or we need you all to come together so we can keep bringing you more of this kind of coverage\nMaybe you can give more than ten dollars a month maybe you could do thirty dollars a month or whatever the amount the most important thing is that we hear from you right now one eight eight eight nine six three seven four seven seven R. I. P. R. dot org\nThat we do have an annual budget of a little over three million dollars but as Elizabeth just said it really is um a lot of folks just like you who pitch and what I'm smaller contributions\nAnd a when a lot of people do that it gives us that three plus million dollars that we need to bring you everything that you rely on each and every day the average contribution actually here at Rhode Island public radio as a hundred and Eighteen dollars so that's a lot of people who maybe make a one time gift um\nUh some folks are doing ten dollars a month as a as a a monthly sustain earth\nAh but you pick the amount that fits your budget there is no other service that you rely on where they're going to say to you I just pay whatever you like Netflix isn't going to say that your local cable companies surely isn't going to tell you to set the prize but that's what we do here because we have faith and knew that when we have these pledge drives\nThat you and enough of your neighbors are going to call in with a with a pledge of support ivy and Warrick thank you so much for your contribution current and Cranston thank you so much for your gift as well just a little over an hour left to get entered into that\nFall through the tour southern restaurant seven hundred dollars and dining you can be the winner you're going to be automatically entered when you make your gift right now again you do that\nBy calling the phone number eight eighty nine six three seven four seven seven or by giving on line at R. I. P. R. dot org\nSupport for Rhode Island public radio includes Brewster sort an group architects\nDedicated to designing memorable homes and meaningful community spaces for Thirty years of photo gallery I'd roosters or the dotcom why ... a lot of bringing a taste of seaside Mexican cuisine and local ingredients to Newport\nCraft cocktails Sunday Brunch live music to\nHeroin so lotto dotcom pretty overcast overnight mid fifties tomorrow partly sunny nice mid seventies also support from or so Rhode Island express providing emergency care for acute orthopedic injuries\nMore at orthopedics ... dot com and reuse don't wait neither should do\nSupport to for Rhode Island public radio from a carton violins\nOr news update next on Rhode Island public radio support includes Gordon School committed to a progressive academic program to empower young mothers to advocate confidently confidently I should say for themselves and others\nOpen house November third Gordon School dot org by al ... two premium paints decorative hardware\nFabrics window treatments and wall covering all month long ... dot com just down the street from Stevens [noise]\nThe losers Rhode Island public radio eighty nine point three fmri WNPR Newport Russell hurt on one or two points Saddam ... W. N. B. Narragansett appear\nNinety One point five FM doubled you see the Y. Coventry public schools and on idiot point one of ... W E which we were school Robert ... P. R. dot org Rhode Island public radio\nLive from NPR News in Washington I'm ... the White House is defending President Trump's comments about Christine Blasey Ford who's accused Supreme Court nominee Brett Kavanaugh sexual misconduct ... more\nWhite House press secretary Sarah Sanders says Trump was not making fun of for during his remark that Mississippi campaign rally during the event the audience laughed and apply it to ... question for the count of the alleged sexual assault\nIt seemed to me that he was stating facts that Dr for herself a laid out in her testimony once again a every single word that judge Kavanaugh has said has been looked at examine picked apart by most of you in this room\nCabinet has categorically denied all allegations of sexual misconduct some Republican senators have complained that Trump's remarks were inappropriate ... NPR News the White House\nMurder trial of Chicago police officer Jason Van Dyke washing the hands of a jury is Patrick Smith from member station WB easy reports Van Dyke the Chinese wrapped up their defense today\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut a dash cam video showing\nTimes that video at the centerpiece of the prosecution's case it shows McDonald walking away from police and Van Dyke keep shooting until his gun is anti even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday then I took the stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot closing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nSecretary of state Mike Pompeo says he is cancelling a treaty with Iran that dates back all the weight of Nineteen fifty five establishing economic relations and consular writes between the two nations\nThe move comes on the heels of a ruling by the United nation's highest court ordered us to lift sanctions against Iran effect imports of humanitarian goods store does not enforceable bomb pale telling reporters day the ruling is disappointing but also a loss for Ron this is a decision frankly that is thirty nine years overdue\nIran alleges sanctions imposed by the Trump Administration after the U.S withdrawal or twenty fifty nuclear deal violate the Nineteen fifty five treaty\nPrivate sector jobs report out ahead of friday's broader base government data on hiring show solid games last month payroll processing from a deep pie says private sector companies added two hundred and thirty thousand jobs in September the most in seven months there were games and construction professional in business services and education\nOn Wall street today stocks close broadly hired the Dow Jones industrial average up fifty four points to twenty six thousand eight twenty eight that's a record high as that goes up twenty five points the U.S and the five hundred closed up two points today you're listening to NPR\nSays Rhode Island public radio good afternoon I'm be found in Providence\nA track of the public school attendance in Providence since the bus drivers strike began shows a resulting broad hike and absenteeism at schools where most of the students ride a bus channel twelve news reports absenteeism rights or above Fifteen Percent of some effect in schools\nIncluding the king because Iran and lauro elementary schools and the Nathan Bishop middle school\nProvidence School officials say apps and students could be falling behind in their studies\nThe bus drivers strike is centered around retirement benefits\nShellfish farmers in New England or stuck for now with crop insurance options that some senators called inadequate\nRhode Island Public Radio's environment reporter Avery Brooklyn's explains why\nCongress failed to reauthorize the federal farm Dale before it expired on Sunday the Senate's version of that there would have expanded crop insurance options for shell fish farmers the idea is that shell fish like ... and clans can get sick and that's risky for people who find them for a living right now only oysters are eligible for farm insurance\nFor Democrats including Rhode Island US Senator Sheldon Whitehouse advocate it to change that they push for muscles clans and scouts to be eligible for crop insurance kill\nThe bill would also allow selfish to be insured at different life stages to accommodate risks from unexpected weather events and illness a final version of the farm bill is expected from Congress later this fall but there's no guarantee that brought a crop protections for shell fish will be included\nA repercussions Rhode Island public radio\nThe Massachusetts cannabis control commission is nearing a final vote on retail marijuana licenses for two businesses in the bay state\nThe commission has scheduled a voting for its meeting on Thursday if approved the company's still would have to pass some technical and procedural hurdles but it would be a signal that the long wait for the first pot shops open in the eastern us is nearing and and\nIt's five or six\nSupport for NPR\nComes from indeed used by over three million businesses for hiring or employers can post jobs and use greener questions to build their short list a preferred candidates learn more and indeed\nDot com slash higher and the corporation for public broadcasting\nThis is all things considered from NPR News I'm Ari Shapiro and I also Chang a vote on Brett Kavanaugh's nomination to the Supreme Court could come as early as friday Senate majority leader Mitch McConnell wants it to happen this week though he hasn't scheduled and yet he\nAnd the rest of the Senate or waiting on the FBI to finish its investigation of sexual assault allegations against Kavanaugh\nThree Republicans who could determine the judges said say they need to see that at the report first before they make up their minds with this now to talk about the latest as NPR's Scott Detrow who joined us from Capitol Hill he's got a elsewhere\nSo senators are saying the FBI could complete this report and send it to them as soon as today which would be early because the FBI was given a full week to do this does this speed to give us any clues about the scope of the report\nWhat we got one clue on the scope just just a while earlier today we know now that the FBI has not yet talked to one key witness and that's Christine Boise Ford\nHer lawyer say as of today she has not been contacted by the FBI a lot of top Republicans are fine with that I asked John Cornyn the number two Republican as he got into an elevator earlier today\nBy going over there when we heard from ever says of course referring to last week public testimony a Judiciary Committee chairman Chuck Grassley has said something similar\nDemocrats say this makes no sense of the whole point of following up was to confirm or dispel what Ford and Kavanaugh said so the FBI should follow up here's Democrat Richard Blumenthal who's a former attorney general\nLeads are followed\nThe interviews creates additional questions [noise]\nSometimes they re interviews that's very common and that's an investigation it's got to be more than just check the box okay we have their accounts [noise]\nOkay so clearly there is a big split between Republicans and Democrats are talking about this that split was even more parent last night President Trump spoke at a rally and he mocked Christine Blasey Ford's testimony against Kavanaugh let's let's take a listen to a bit of that\nHow did you get home I don't remember how did you get there don't remember where is the place I don't remember how many years you don't want to [noise]\nWe had been saying all along Scott that Kavanaugh's confirmation comes down to a few key Republicans in the Senate how are they responding to what the president said last night\nReally not well Arizona Senator Jeff flake said that what Trump said was kind of appalling\nOf course all along Senate Republicans have distanced themselves from Trump's comments which we send them back to his agenda so the question is whether this time will be any different Alaska Senator Lisa Murkowski is one of those other key undecided vote on today she indicated maybe it could be\n[noise] I and taking everything into account and I think that the president yesterday my doctor for we're totally inappropriate and in my view unacceptable for taking\nEverything into account is is the key framing their Murkowski has made it clear she thinks a big part of this is treating women with respect listening town to them when they come forward with allegations so she is certainly someone to watch if the president keeps attacking Ford head on\nAnd how many of these key senators said anything about the scope of the FBI investigation and whether or not hearing from either Kavanaugh or Ford again\nA problem flake said earlier that there should be about knowing what there is to know and trying to answer questions not checking a box as for the very latest little unclear because it's hard to talk to them right now because they're the center of attention\nSupport for NPR comes from this station and from constant contact who's email marketing tools help small businesses and nonprofits connect with their customers learn more at constant contact dot com\nFrom Baird of financial partner guiding families businesses communities and institutions since Nineteen Nineteen R. W. bear to dot com has more information\nAnd from the Pew Charitable trusts celebrating Seventy years of serving the public learn more at Pew trusts dot org slash Seventy\nFrom NPR News this is all things considered I Know for Chang and I'm Ari Shapiro survivors of sexual assault are sharing their stories many for the first time Washington Post columnist Monica ... has been getting a steady stream of them in her inbox\nAnd her latest column has the headline deer dads your daughters told me about their assaults this is why they never told you how\nMany people have been sharing this column on line that I spoke with Monica ... about it earlier today\nI like a lot of journalists probably today had been getting a lot of survivors wanting to share their stories that sexual assault and what was notable to me is how many of them had a common thread of the one person I've never told if my dad I don't think he could handle this\nAnd what did they tell you about the reasons they never told their father\nSome women said I'm afraid to tell my father because I I Know he would kill the men who attacked me and I'm worried he would go to jail some women said I've never seen my father cry and I know that if I told him this make him cry someone in did say I'm afraid my father wouldn't believe me\nOf them were really more I think he would believe me but I'm afraid it would just destroy him he thinks it's his job to protect me and he would feel like he failed\nIs it only fathers or are people concerned about telling their mothers as well\n[noise] I did get responses from people concerned about telling their mothers but\nI think often survivors are putting their parents in different categories a lot of women said I told my mother and learns that she had been a victim to or I told my mother because I thought she would understand what it's like to walk through the world\nAs a young woman and so they they were really afraid that their fathers in particular wouldn't understand on the same level or might feel squeamish or embarrassed to be talking about these kinds of things\nYou write that a lot of ... exist because women don't want to make men uncomfortable with lady pain explain what you mean by that\n[noise] you know it just just think about tropes in sitcoms where\nThe dad is sent to buy a pack of ... for his daughters or his wife and it's presented as the most humiliating embarrassing journey to the grocery store that he can never make we do that with ... and we do that with breast feeding\nOf these things that happen on a woman's body are seen as being really embarrassing and inappropriate to talk about and I think that that exist on his spectrum where we're afraid to talk about sexual assault because it falls on the spectrum of gross or uncomfortable things that happen to women [noise]\nCan you tell us about some of the responses that you have to call them since it was published this week\n[noise] yeah I've received more than five hundred emails in the past twenty four hours but if you don't mind I'll just I'll read you my my favorite response yup ...\nDeer Monica thank you for sharing these stories I was very moved by them because I'd never even thought of asking those questions I shared your call in with my wife for forty years and asked her had this ever happened to her\nAnd she told me a story of herself at ten I just listened and inside I broiled I asked her should I ask my daughters and she said do you think you're ready I didn't answer but I'll do it soon\nNot today but the next time I see them right now though I'll have a couple of drinks and I'll think I Hope I can be of some comfort semper fi well\nSo I've gotten a lot of emails like that a lot of emails from dads who are good dads they're just really trying to think about what it means to be a good dad\nI've gotten a lot of emails from men who say I always told my daughter if anyone tries to hurt you own murder them and now I'm rethinking\nWas that the right message to send because what if that kept her silence because she didn't want me to go to jail for for murdering someone um so I think that these are conversations that have just been happening in secret for really long time\nAnd good men are trying to figure out how to be a part of those conversations and how to be a comfort in them\nAs part of your argument also that it's important for daughters to tell her father's about this so that they have a better understanding of what women go through\nI think so I really do and a lot of the feedback that I've been getting are women who are talking to their dads for the first time\nBecause of what we're hearing into the Kavanaugh for hearings because their fathers have said something like I'm really moved by her testimony but I just don't believe it because if it had really happened she would have told her parents when it happened\nAnd it's causing women to say that it happened to me it happened to me three years ago\nYou and here's why I didn't tell you so you're a father and you have some ... of how a victim should behave or whether someone would or would not have told someone I think it's really meaningful to hear from women in your life that you're close to who have said\nI grew up in your house you love me more than anyone and I never told you and this is\nWhy Monica ... Washington Post columnist and her new novel out this week is called the or outside thanks so much for joining us today thank you for having me\nYou're listening to all things considered here on Rhode Island public radio\nIt is a or fall fundraising campaign just wanted a quick reminder that uh you know you shared conversations on Rhode Island public radio maybe their conversations that inspire you to have conversations in your life\nThat's why you tune into Rhode Island public radio to get the news to get inspiration and uh the way it's paid for it is with listeners support R. I. P. R. dot org or call one eight eight eight nine six three seven four seven seven good afternoon I'm James ... here with Rhode Island Public Radio's environment reporter every broken\nAnd we know that you turn to the news to help you make up your mind not to have it made for you whether it's about health care education the environment or any other issue you an accurate unbiased information and you don't just want a few select facts to support one side or another\nYou want to hear the whole picture with Rhode Island public radio we give you the information you need to reach her own conclusion\nAnd your support gives us the resources to continue this kind of reporting so please contribute now at R. I. P. R. dot ORG or you can call us at eight eight eight nine six three seven four seven seven that's eight eight eight nine six three R.\nI. P. R. now it takes a little over three million dollars a year to keep Rhode Island public radio going and that\nKind of sounds like a lot of money in it and it kind of is but the the really amazing thing is that most of the the bulk of that comes from listeners support and listen to support of an average of\nOne hundred and Eighteen dollars a year from per per listener which\nNot a really huge amount of all this coming together to make up for this make up the support for Rhode Island public radio make up the budget\nFor it in public radio an average of about ten dollars a month from each listener that supports now of course the problem is that not every listener makes the contributions so that's why we come to you every once in a while and say hey if you supported Rhode Island public radio have first of all thank you very much\nIf you haven't now is a time to do it become a sustained her ten dollars a month\nOr a T. R. dot org or call one eight to nine six three seven four seven seven\nAnd there are thousands of Web sites dozens of radio stations and dozens of TV stations that compete for your attention every day and all those choices you choose a Rhode Island public radio you choose us for NPR News and for intelligent discussion programs you choose us for smart entertainment\nRhode Island public radio is worthy of your attention that makes us worthy of your support to so please make that first contribution of five dollars or ten dollars a month now\nYou can do that by calling eight eight eight nine six three seven four seven seven or you can donate on line just go right to your computer at R. I. P. R. dot org\nWhen you make a contribution you'll be automatically entered into our food detour drawing the deadline is at six o'clock seven hundred dollars and dining restaurants around the area including a dwarf tavern Julian snakes on Broadway bunch of others you'll you can check that out at R. I. P. R. dot O. R. G. ...\nContribution every month charged on your credit card and every news automatically you know that every month you were doing your part\nTo support Rhode Island public radio a lot of people see it like a subscription like one other streaming services\nOr ten dollars a month as the most popular amount for that or I P. R. dot org or call one eight eight eight nine six three seven four seven seven that's eight eight eight nine six three seven four seven seven and thank you so much\nAnd ultimately called Donald Trump sister who was then a federal judge in a lawyer obviously and ask her to intervene and to make sure that\nDonald's creditors couldn't come in and pillage Fred Trump's empire and the Donald we wouldn't have any more control or input over the state than any of his other siblings would\nThe White House has responded to your reporting by attacking the New York times and saying that the IRS looked at these arrangements as they were happening and found nothing improper how do you respond to that well\nWe think that's not true um we know there are cases where there was no audit done like all county building that we spoke about another transaction Trump Palace and then the cases where there were audits there's evidence that the trumps didn't give the IRS all the pertinent information about those buildings and that the appraiser\nGrossly undervalued some of the properties\n... is an investigative reporter for the New York times thanks for joining us today\nThanks for having me are the New York times story you just heard it now says Trump's were able to get away with tax dodging for decades and there's no evidence that state or federal officials ever did much about it\nAs NPR's Jim Zarroli reports regulators where either unwilling to take the trumps on or simply lacked the resources to\nThese are famous for finding ways to pare down their tax bills and some of them skirt the law they can understate the value of a property they've acquired for instance but NYU law school professor Daniel Shapiro says the sheer scope of the Trump family's tax avoidance puts it in a whole other realm\nI don't think this is just like oh this is talk funding as usual is one thing to have a self serving the patients that are on the ... side this seems to go beyond it\nYet much of what the Trump did apparently went under the radar for years\nThat doesn't surprise pace law school professor Bridget Crawford she says the Internal Revenue service for decades is simply lack the resources to police tax fraud effectively and years of political attacks may have made it reluctant to take on hard cases\nWhere there's a will there's a way and there has been no\nOnly one in a hundred tax returns is now audited and Crawford says it's especially easy to do what Fred Trump is alleged to have done pass on assets to your children without them paying much in taxes\nThe fact is that gift tax doesn't raise a lot of revenue also to the extent the IRS has resources they're not going to be allocating at court gift tax enforcement\nThe same is true with the state and local level although New York state officials are now investigating the Trump families taxes Crawford says it's taken them far too long to do so\nThat appears to me that the state department of finance has been\nUtterly asleep at the wheel for decades when it comes to a transaction some on the Trump family\nCrawford notes that questions have been raised about the Trump families taxes for years pro public eye has reported that President Trump's sold to Manhattan condos to his son Eric for much less than they were worth twenty sixteen\nBut because Trump hasn't released his tax returns it's impossible to say whether Eric Trump paid federal gift taxes as he was required to do\nBut the extent of the activity alleged in yesterday's times story is harder to ignore the question is what regulators can do about it and why use Dan Shapiro says if fraud was committed it's probably too late for the government to pursue a criminal case because of the statute of limitations\nBut severe says the IRS can always decided to take another look at the Trump returns\nFraud on her return means that it's never too late to revisit it\nIf the IRS finds evidence of wrongdoing severe a says it can retroactively force Fred Trump's heirs to pay back taxes and they may have to pay civil fines as well Jim Zarroli NPR News New York\nAnd ... and I live in east Providence Rhode Island I guess I started to get a little jaded with some of the other news outlets and I didn't like the fact that\nThey were very clearly biased in a lot of ways and I wanted something that felt a little more neutral and and also kind of spoke to my own personal views and I feel like\nPublic radio strikes are really good balance they always um show both sides of the story I've actually jumped into in turn on the radio and hurt interviews with I didn't know who it was at the time\nAnd thought oh this person's making some great points and then found out that maybe it was someone from the opposite side of the political spectrum and do the reporting\nI got that perspective and I found stuff that I actually agreed with and I wouldn't necessarily have thought that I Would ever agree with that person so it was kind of interesting hearing you know the person's name at the end of the interview on going oh my gosh I'm agreeing with them\nSo I I appreciate that I think that's something that we need more of in the news thanks so much Dixie is news\nOutside of your own perspective here some differing views that's what you hear on Rhode Island public radio and that is possible because of listeners support\nGood afternoon I'm James Bumgarner I'm In the studio with Rhode Island Public Radio's environment reporter every broken hello Hi ray ... and we're asking you to ah to make a call to make the contribution right now you can go on line or I. P. R. dot O. R. G. or you can call it eight eight nine six three seven four seven seven\nAnd no matter how old is your life may get listening to the news on Rhode Island public radio is likely unless for you each day\nResponsible fact based journalism that addresses issues important to you and your family\nThought provoking without being sensational report it in such a way that helps you understand the issues better without telling you what to think\nThe way it stays available to you is their contributions by the busy people who rely on Rhode Island public radio every day so please call us to make your contribution now the number is eight eight eight nine six three seven four seven seven or you can donate online at R. I. P. R. dot org\nAnd time is running out it is the penultimate day of our pledge drive and the next to last day but there is less than Fifteen minutes to go in a deadline we have coming up at six o'clock\nDeadline to get entered into our drawing the Rhode Island I'm Sorry the other food detour Rhode Island in southeastern Massachusetts seven restaurants one hundred dollar gift card reached seven hundred dollars and dining\nFor restaurants across the area including coach surfing turf and little moss and Bristol oyster bar a few others as well make a contribution you're automatically entered into that drawing R. I. T. R. dot O. R. G. or call one eight eight eight nine six three seven four seven seven\nAnd your guests comes with no strings attached it is free from commercial or political influence that sweat makes it vital to Rhode Island Public Radio's future how often do you tune in to Rhode Island public radio think about it maybe it's ten twelve fourteen times a week\nThat five hundred to seven hundred hours a year there's a lot of hours of listening\nFive or ten dollars a month is I'm at the sustain her level is all that it takes to become a new member and they'll call us now to make your contribution at eight eight eight nine six three seven four seven seven or you can become a sustain her online at R. I. P. R. dot O. R. J.\nWe submitted contribution this afternoon thanks so much Lee so we also heard from listeners in Middletown in Portsmouth and all over the region\nSupporting Rhode Island public radio or maybe you've heard about some exciting new things happening here at the station for one eighty nine point three of them we have that up on the tower in to Britain\nMuch higher tower reaching areas we couldn't reach before\nPeople able to hear us a lot better who couldn't hear so well before we're really excited that you're\nAble to get Rhode Island public radio now some other exciting things happening in the months to come we'll be opening a south coast news bureau with a reporter based in New Bedford then we'll be launching an investigative news unit or they'll allow us to dig deeper on local stories that require a little bit more time and research\nThat's a that's a as a result of the capital campaign and as a result of Rhode Island public radio being here and Rhode Island Public Radio's here because of the listener contributions because of that ten dollar a month sustain her contribution or you're a fifty dollar one time contribution\nRight now our I. P. R. dot O. R. G. or call one eight eight eight nine six three seven four seven seven that's eight eight eight nine six three seven four seven seven or give on line at R. I. P. R. dot O. R.\nSupport for Rhode Island public radio also includes quest Montessori school\nOffering an authentic Montessori education from Eighteen months to eighth grade in Narragansett an open house on October fourteenth from eleven to one quest school dot org\nBy the president's cultural series at Bryant University presenting the Copley Chamber Players trio on October Eighteenth and seven PM\nTickets and information at Bryant dot edu also by Providence business news announcing that Providence business news is holding its cyber security summit on October eleventh add the crown plaza from eight AM to eleven am\nMore information on panelists and topics for the summit at ... dot com\nAlso support for Rhode Island public radio from the brown arts initiative at Brown university presenting singer songwriter instrumental was an activist Aaron McEwen in concert this Thursday October for the seven figure I'm at the run off center\nOne fifty four angels street in Providence more information and tickets at arts dot brown dot\nEdu [noise] this is Rhode Island public radio eighty nine point three F. M. H. D. WNPR Newport were also heard on one or two point seven ... W. M. P. E. Narragansett\nAnd you see why Coventry public schools and um eighty eight point one FM W. E. L. A. ... province R. I. P. R. dot O. R. G. a news update is next\nYear on Rhode Island public radio\nLive from NPR News in Washington I'm jak spear President Trump's divisive remarks about the woman who accused the Supreme Court nominee Brett Kavanaugh of sexual assault risk alienating some key Republican senators\nDrop box Christine Blasey Ford at a campaign rally last night NPR's Tim Mak reports Kavanaugh's confirmation almost certainly hinges on boats from Senator Susan Collins Lisa Murkowski and Jeff Flake Trump\nMocked for Senate testimony at a political rally in Mississippi his attack on Capitol is accuser was\nGreeted with cheers where is the place I don't remember how many years ago was that I don't know [noise] not so much on Capitol Hill Republicans have a slim majority in Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers here senator mccaskey\nAnd taking everything in ... president yesterday and I came down here for were inappropriate and my\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nUS Senators voted overwhelmingly to send one point seven billion dollars in recovery aid to states affected by Hurricane Florence and other recent disasters and NPR's David Schaper reports the money is including the bill reauthorized from the Federal Aviation administration and funding Federal Aviation programs to\nBuild tackles a wide range of controversial air travel issues it requires the FAA to establish a minimum size for airplanes seats to stop the shrinking of leg room and it prohibits airlines from removing passengers from overbooked planes\nIt also attempts to shorten airport security lines by boosting the number of bomb sniffing dogs at airports like funding new passenger screening technologies\nIt's signed into law the bill would at ease cigarettes to the onboard smoking ban it would prohibit talking on cell phones during flights and it would set new rules for transporting animals but an effort to limit the fees that airlines charge for checking baggage and changing reservations failed David Schaper NPR News\nSenators heard today from the leaders of national governing bodies for individual Olympic sports about how to protect athletes from abuse hearing follows a number of sexual harassment and abuse scandals across multiple sports usa bobsled in scouting CEO Darren steals says every organization as a responsibility to protect athletes collectively we\nAll represents Olympic sport with one ... one organization fails to protect athletes we all have failed that athletes\nOver the past five months the U.S Olympic Committee is board of directors has expanded a fund for survivors of abuse\nLargest retail trade group is forecasting an upbeat holiday shopping season the national Retail Federation says it expects sales in November and December the rise by between four point three and four point eight percent on Wall street stocks gained ground the Dallas up fifty four points today you're listening to NPR\nThis is Rhode Island public radio\nGood evening I'm Dave ... in Providence love Providence city councils ordinance company is reconsidering the whole point tower proposal the plan to build a forty six story tower on former state highway property near the Providence River\nAnd our committee chairman tyrants Hassan says a public meetings planned about it for October twenty second\nThere give developer Jason fame the opportunity to testify about the project\nHas it says ... voice has been missing from the pro and con\nBut our Tobar twenty second the hearing is scheduled for five thirty at Providence city hall\nThe name of a Massachusetts man who died defending a pregnant waitress from a ... attack in taught him is on a memorial to homicide victims however low widow of George have watched his name to be removed\nRosemary ... says her husband was not a victim but a hero when he died in May of twenty sixteen she says no one ever told her about the name would be added to Boston's garden of peace\nAnd officials with a memorial say the man's name was added at the request of his daughter\nWell marine experts say there is an exceptional die off of men key whales in New England waters with at least twenty of those animals dying this year including nine off Massachusetts\nOfficials with the New England aquarium so you're twenty six foot Mickey way old died off Marshfield this week the second to Mickey to wash ashore there in recent weeks away all deaths will be investigated now by the national oceanic and Atmospheric Administration NOAA\nIt's six oh six pretty cloudy all my mid fifties for low low then tomorrow partly sunny ...\nSo I'm Sean ... low sixties for friday weekend Saudi and mid sixties on Saturday sunshine Sunday reaching the mid seventies\n[noise] this is Rhode Island public radio\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station\nThis is all things considered from NPR News I'm Ari Shapiro and I'd also Chang in the weeks since Christine Blasey Ford accused Supreme Court nominee Brett Kavanaugh sexual assault President Trump's response has been relatively restraint\nThat changed completely last night when President Trump mocked Ford at a rally in Mississippi\nHow did you get home I don't remember how'd you get there don't remember where is the place I don't remember how many don't want I don't know [noise]\nAnd today in the White House briefing room press secretary Sarah Sanders defended the president's comments NPR's Danielle Kurtzleben has been following the president's response to all of this controversy and she joins us now Hey Daniel hello\nSo as we noted the president's tone it shifted dramatically last night and I just want to start out by talking about how his comments last night compared to how he's been talking about Ford up until last night\nSure so late last week after Christine Blasey Ford and Brett Kavanaugh testified before the Senate Judiciary committee Trump had taken a much softer tone towards Christine Blasey Ford\nVoter testimony is very compelling and she was like a very fine woman [noise]\nNow he seemed to be sort of ... to the line that congressional Republicans seemed to be healing to which was something to the effect of Christine Blasey Ford seems credible you know maybe she's mistaken or I Wish we had more corroborating evidence but a lot of news that key word credible\nThen last night he got up in front of this crowd and he he was mimicking her and the fact that you know she can't remember every single thing that happened that night so he was really diverting from that line and he was playing it to last and cheers from that audience yeah you can hear the tape and so that has people really upset today some\nHow the response has been in the Senate because to get Kavanaugh through Senate Republicans are focusing on two key senators Lisa Murkowski of Alaska and Susan Collins of Maine how either of this\nLisa Murkowski has said her words were that it's inappropriate and unacceptable and that Trump's comments could sway her vote now Susan Collins likewise she told CNN that it was quote just plain wrong what Trump said and she wouldn't say if it would affect her vote you know one thing\nThat has been swirling in the middle of all of this is the fact that Trump has talked about how he actually emphasizes with Kavanaugh because he himself has been accused of sexual assault of sexual misconduct\nAbsolutely he has more than a dozen accusations of misconduct against him and like Brett Kavanaugh Trump is denying all of the allegations against him but that's not the only echo here I mean let's look at how Trump has responded to those allegations likewise\nAnd one of those allegations against Trump Jessica leads that woman who said he had groped her on an airplane decades ago he also mocked her after that allegation came out the quote that he said was she wouldn't be my first choice he likewise said that to a crowd the crowd likewise lasted cheered\nAnd you know he was really he really seemed to be saying she's an attractive and that wouldn't have happened there for so the important thing that we're trying to get out here though is that we have a pet or not only of how Trump reacts to sexual misconduct allegations\nBut how his supporters react\nAnd his supporters by in large seemed to have stuck with him\nThrough the allegations against him even if they find those allegations distasteful\nSix twenty this is Rhode Island\nPublic radio support for NPR comes from the station and from Amazon Prime video\nWe're America's history is under siege but the resistance rises to fight for the world they want the new season ... this October on prime video\nAnd from capital one offering a variety of credit card options with teachers for a range of customers from food to travelers capital one what's in your wallet credit approval required capital one bank USA Today\nFrom NPR News this is all things considered and also\nChang and I'm Ari Shapiro many people in the U.S auto industry are breathing a sigh of relief week the new trade deal between the U.S Mexico and Canada and months of uncertainty if it's approved by Congress it will spare carmakers from some of the terrorists that they had feared\nAnd will soon as senior vice president of the motor and equipment Manufacturers Association which represents more than a thousand companies that make auto parts you're in the U.S thanks for joining us here on all things considered thank you very glad to be with you to begin with what you just described for listeners what you remember companies making and where you are in the auto making supply chain\nSo our members make the vast majority of the content for new vehicles and we also manufacture parts and components for maintenance and repair\nAnd how much was on the line for you in this trade agreement ... holding your breath to see what the details would be\nWell our industry has actually done quite well under NAFTA we've actually been able to grow our supply chain in North America we've been able to grow manufacturing jobs in the United states but it counts and all three countries being part of the agreement\nSo we are very pleased relieved to that all three parties were able to come to an agreement this weekend we're cautiously optimistic that the terms of that agreement will work for the industry and for the American public\nWhen you look at the details of the agreement can you tell how it compares to NAFTA for you\nWell there's going to be an increase in the amount of North American content that will be required\nFor parts to travel through the three countries are going to have to call it the U.S Mexico Canada agreement but traveled through North America without having to pay tariffs there's going to be a requirement for more North American steel and aluminum a so all of that will impact our members\nAnd in addition there's going to be some new administrative costs that are going to be required one of the concerns we have though are there some new tariffs out there right now on steel and aluminum and we'd like to see Canada and the United states address that before they finalized disagreement in the end of November\nSo on the one hand there won't be terrorists for material crossing Canada U.S Mexico border is on the other hand the steel and aluminum tariffs that were of concern to your industry and knock on the way\nYou know they have and I think one of the things we have to keep in mind as they have been a particular burden to smaller manufacturers many of these smaller manufacturers are only in the U.S\nAnd some of our members have seen the cost of their steel purchases rise almost fifty percent so this is a significant increase it's typically of concern between Canada and the United states we'd like to see those two countries roll up their sleeves uses same energy they used to conclude this this new NAFTA\nAnd be able to come to some kind of agreement on steel and aluminum tariffs\nI Know that there's a lot of relief from the auto industry now that the uncertainty is gone but how does this compare to the old rules under NAFTA is it an improvement just is worse\nI think for the United states perspective one of the things in the United states said little pool through was an increase in the U.S content and for some of our suppliers and some component manufacturers this is going to be a challenge there is no doubt about that I Do think that we're going to see\nAnd our cat calls the biggest concern our members are going to have the administrators cost and we're going to have to work really hard with all three parties can minimize does cost because consumers are going to get any value laughing and that's going to be our next a real challenge basically look for that grade in it\nAnd we'll send a senior vice president of the motor and equipment Manufacturers Association thanks for speaking with us today\nAnd it's a pleasure\nYou're listening to Rhode Island public radio listening to a conversation about the changes in trade agreements between us or the U.S Mexico and Canada the replacement for NAFTA now called us and ca how that affects the auto industry hearing straight from the source about\nWhat changes can can we can all expect to see in the months and years to come that sort of conversation is what you tune into Rhode Island public radio to here and that sort of conversation is only\nPossible because of listeners support it is the next the last day in our pledge drive and we're asking for you to make a contribution right now are a PR dot O. R. G. click on that donate button\nOr call one eight eight eight nine six three seven four seven seven good evening I'm James ... here with Jim Thorpe\nFree speech and a free press were so important to our nation's founders that it was included right there at the top of the bill of rights not number three not number seven right they're number one at the top of the bill of rights but it's important to remember that freedom of the trust is not\nGuaranteed truth accuracy or balance it's up to each of us up to each of you to decide whether any reporting whether any journalism actually meets that standard would Island Public radio journalists provide thorough accurate fair reports told in ways that are hopefully clear and comprehensive\nThat kind of effort takes time and that kind of effort also takes money your contribution supports great journalism that's hurt on this station so make your contribution right now you can do it on line at R. I. P. R. dot org where you can do it the old fashioned way as we like to say by picking up the phone and calling eight eight eight\nNine six three seven four seven seven\nIf you tuned in Rhode Island public radio in the morning as you're getting your day started in the evening as you're driving home from work or cooking in the kitchen\nAnd if you listen to a couple of times on the weekend that can be fourteen times a week that you're listening to Rhode Island public radio back in total hundreds of hours of listening over the year is that sort of listening is that worth a dollar a day to you\nHope that it is because we have a great thank you gift if you make a contribution of three hundred and sixty five dollars or thirty dollars a month as a sustained and we'll let you sponsored the day of your choosing\nAnd that'll include to live on air announcement this one from Chuck him in in the morning one from day found in the afternoon can use that to say happy birthday are happy anniversary to someone you know\nAnd it's a great way to support Rhode Island public radio mitigate a fund birthday gift for somebody in your family as well\nYou can make a contribution at R. I. P. R. dot O. R. G. or call one eight eighty nine six three seven four seven seven become a thirty thirty dollars a month sponsor or three hundred and sixty five dollars dollar a day or I. T. R. dot O. R. G.\nDollar a day sponsorship that is one of the one of the thank you guess that you can select when you make your gift on line we have some other thank you guess there as well again you can pick up the phone if you want to talk to the cherry or volunteer who's here answering phones this afternoon Sherry would be more than happy to take her gift over the phone right now the phone number is eight eight eight\nNine six three seven four seven seven\nIf you give on line or if you call the phone number you can also become a monthly sustain or you may have hurt us ah throwing that word around here a fair bit what's assistant or while that somebody who makes an ...\nThe uh renews 'em and why is that important well you're a gift to five ten or twenty dollars a month provides a steady stream of support for Rhode Island public radio so there'll be can serve the community better\nSets the standing membership automatically renews your membership takes care of itself and you don't have to remember how when's the last time I met a gift to Rhode Island public radio you just sort of set it and forget it\nOnly takes a few minutes to become a sustained her\nAgain you can do that online at R. I. P. R. dot org or you can call it eight nine six three seven four seven seven\nSomething kind of funny happens when you become a sustain or you see that five dollar a month at ten dollar charge on your credit card statement and you kind of feel good about it it's a it's a nice little phenomenon you feel good that you've done your part there's something else you can feel good about you can feel good about supporting an organization that is growing that is investing in journalism that's what we're doing\nWe will be opening our south coast news bureau in the months to come do have a local reporter in New Bedford to report more on southeastern Massachusetts\nAlso be launching our investigative news unit or in the months to come to dig into stories that take a little bit more time and a little more more research that is what you're supporting with your donation right now marketplaces up next and that will be we will have no fundraising interruptions during that we can still\nEr here from you and you make a contribution R. I. P. R. dot O. R. G. or call one eight eight eight\nNine six three seven four seven seven that's eight eight eight nine six three seven four seven seven and thanks so much\nSupport for Rhode Island public radio includes Hank we Allen committed to combining legal strategy with the efficiency to address clients legal needs will offices in Providence and with Robin northeast online at ... dot com\nAlso by Laurel me the cooperative apartment homes on the east side of Providence for seniors young and older who are seeking new friendships and an active lifestyle Laurel made dotcom at six thirty visitors Rhode Island public radio", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Providence", "day": "03"}