{"month": "10", "state": "PA", "station": "WESA", "content": "Fried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nNot similar to the way that you pay other bills like utilities car insurance or cable bell but the best part is we don't tell you how much to give you get to the side that so how about starting at five dollars or ten dollars or even Fifteen dollars a month\nIt just takes a few minutes to set up and when you do will keep you informed and entertained for as long as he liked for far less than some of those other bills that you have to pay give us a call at Fort when she was six nine seven to nine five five or become a sustaining member on line at W. E. S. said I asked them\nTo feel good I mean this really you weren't going to feel so good if you've never given to W E s say before and your first time brand new never given before I'm telling you the feeling that you're going to have the guilt relief that you were going to it is it's palpable for one to six nine seven to nine five five\nOh we've got five people on the phone right now we're down to the wire eight hundred dollars left to raise to hit our goal this hour so make that call right now we think we can squeeze in for one to six nine seven\nTo nine five five and thank you\nThanks for being here with Ninety point five W yeah save this afternoon as we get ready to join all things considered\nCold temperatures in our future cloudy skies was evening clearing up partially late another chili evening level low of thirty six mostly sunny tomorrow\nWith a high a fifty one in Pittsburgh right now partly cloudy skies fifty six degrees there's just nine point five FM W E essay and W. E. S. C. H. D. one Pittsburgh Pittsburgh NPR News station the time is for one\nLife from NPR News in Washington I'm Lakshmi Singh President Trump is warning against rushing to judgment in a case surrounding ... g's disappearance cause show was last seen weeks ago walking into a Saturday consulate in Istanbul but never walking out\nThe Washington Post columnist who was us resident was critical of Saudi crown prince Mohammed bin Salman Turkish authorities think he was tortured and killed by Saudi Hickman which the kingdom to night NPR's Mara Liasson reports it for now President Trump seems to be giving the Saudi royal family the benefit of the doubt\nThe president said he'll be brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump is compared the Saudi royal family to Brett Kavanaugh suggesting that they've both been considered guilty until proven innocent today he was asked whether those statements gave the Saudis cover\nReg given caboodle with that being said Saudi Arabia's than ever important ally of ours in the middle east\nThe president also said he thinks audio tapes of what could be ... torture and dismembered meant at the hands of Saudi Government officials probably exists and that he's asked the Turkish government to share those tapes with us investigators Mara Liasson NPR News the White House\nToll from a mass shooting at a vocational college in Crimea is now up to Nineteen and Russian investigators on the scene saying Eighteen year old student was the gunman who say the assailant open fire at the college encourage before he took his own life more than forty people were wounded officials say they're no longer characterizing the attack as an act of terrorism\nIt has been another difficult day for residents in those states battered by hurricane that claimed at least twenty nine lives and left dozens of people on accounted for\nMichael made landfall with one hundred fifty five miles per hour winds on Florida's panhandle last week residents in parts of the panhandle are still waiting for power and cell phone service to return NPR's Hansi Lo Wang reports some rural communities or just\nFree to pursue the re to explore we're Ninety point five W E essay Pittsburgh's NPR News the sound of a free press\nYour specialist like Adam shoots the Virginia task force one in Jackson County sheets multiple trailers damage from the storm on the same property where a brick house still stands\nSalt families role in that home reserves ... sort of hers in order to get assistance from the medical medical issues\nHundreds of families are still sheltering in school buildings around the region as you along and Jerry news Jackson County Florida\nAnd is it figuring out a way to rebuild from the storm were not difficult enough survivors also have to guard against losers\nThe Panama City news here oh quotes a bay county sheriff's office saying officers have been arresting roughly ten people every night on suspicion of stealing from homes and businesses that are still without electricity some areas of bay county or putting looters on notice with spray painted signs that read losers will be shot\nBefore the clothes the Dow is down Ninety One points at twenty five thousand seven hundred six this is NPR\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurers so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com and the Emmy Casey foundation\nYou count on W. E. essay and NPR to be your window to the world we count on your contributions to keep that window open it's the next to last day of our fault membership drive please give now by giving us a call it for one to six nine seven to nine five five or you can visit us online at W. E. S. said that\n... that afternoon I'm Amy Sisk a W E essays energy reporter and I'm here with Margaret J crowds she is our development and transportation reporter\nGood afternoon some member stations across the country and around the world across the country NPR is equipped to cover story every region of the country so\nWhether news is happening on the beaches of Florida are on the streets of LA NPR has the resources to bring you those stories and it's only because we have your support to make sure that the radio stays on the radio\nNPR network is made up of hundreds of newsrooms of which W. E. S. A. is one we count on our listeners please call to be a part of the second the last day our phone number ship Dr ... for one to six nine seven to nine five five or go to W. E. S. A. dot FM\nNow it is expensive to bring programming like all things considered it actually costs W E s a one hundred and Ninety One dollars per hour to bring you MORNING EDITION and all things considered so how much of an hour can you pay for it maybe it's Fifteen minutes maybe it's thirty minutes\nHow about an hour is a small amount to pay for the many many hours of listening you do you can do your part to bring programming like all things considered and keep it on our air give us a call the number here is for one to\nSix nine seven to nine five five or you can visit us a W E essay or W. E. S. A. dot ass and\nAnd then you so much to all who have called today we have a ... couple of hours lots of were raising money today and we appreciate at\nToday's program and supported by ... healthcare benefits company offering coverage is all hospitals in western Pennsylvania\nAt now is dedicated to helping numbers achieve health goals manage benefits and view plan documents to secure member portal more information on line at at not covers you dot com versus all things\nFrom NPR News I'm Mary Louise Kelly and I'm Ari Shapiro the U.S turkey and Saudi Arabia or each maneuvering as more information comes out about the disappearance of ...\nRead it for free to explore we're Ninety forty five ... say Pittsburgh's NPR News the sound of a free press\nIt's more cooperation from Saudi Arabia\nUs secretary of state Mike Pompeo met with Turkey's president and said the Saudis are committed to a full transparent investigation pump hair was in Saudi Arabia yesterday\nAlmost daily leaks from the Turkish government strongly indicate the Jamal ... was murdered NPR's Peter Kenyon joins us now from Istanbul Hi Peter hey Ari tell us what's been happening stay with palm pilots visit to turkey just a day after he was in Saudi Arabia\nRight well this was billed as a fact finding mission and the church seemed pleased that Washington is showing not just in involved than here but support for Turkey's investigation\nOr there was a delay in searching the consul general's residence the Saudi consul general's residence er and that's what caused the foreign minister to say we need some more cooperation here but that surge then did begin today\nA ... told reporters that the administration is not going to get ahead of the investigations and draw conclusions but he denied the U.S would downplay or gloss over the killing of a journalist if that's what happened here's what he said\nI'm not I'm not going to speculate obviously if someone gauges of activities go off\nNo no one is going to defend\nBut Palmdale at the same time make clear that the church should be mindful of the many important partnerships that bind to us in Saudi Arabia and Donald Trump is said much the same thing\nThere have been some new details coming out today about what happened in that conflict and we should warn listeners that some of these details are graphic tell us what this investigation has revealed\nTurkish and Saudi investigators did enter the consul general's residence today with Saudi permission continuing their search of Saudi diplomatic buildings in property a the constantly building was surge Monday and apparently evidence was found pointing to a killing their at least according to the Associated Press\nTurkish authorities have also said they intend to search Saudi diplomatic vehicles but to get to your point a pro government newspaper has published a very graphic details of the torture and killing allegedly a Mr ... including him having his fingers cut off before he was killed\nAnd forensics expert putting on music to drown out the sound of the ... of the body [noise]\nAh no it's not clear how long are the Turkish investigation or the Saudi internal investigation for that matter will go on a secretary of state Pompeo today said we should give them a handful of days to get this over with sooner is better than later he said\nJanuary twenty six that the Saturday Night at the ... center we have front row orchestra seats we are giving away and when you give your going to help us meet our our legal thirty nine hundred dollars to raise by five o'clock this is the last all things considered a membership Dr tomorrow we will be here fundraising free for one to six nine seven to nine five five\nIf you've never given to W E s said before to public radio in general\nNo that W E and say we are here because someone else took that first step from being listening to a listener contribute your stay cooler in the station you get to call us and tell us that things are bad or if they're great and it only takes a couple of minutes though you do have to pick up the phone you do have to take that step is going to W. E. S. H. I. F. M.\nAnd promise it's painless it only takes a couple of seconds minutes sorry does take minutes\nAnd that is the best way to support the station called for one to six nine seven to nine five five or go to W. E. S. said that if\nYou share and and the drone heights for making a contribution we heard from Michele in a region square David in Pittsburgh we also heard from Rebecca in Swiss home park loves NPR appreciates the hard work all the journalists and everyone who worked so digital digital\nDigital\nThat yeah worked hard behind the scene for one through six nine seven to nine five five to join them as a member\nWhen you become a member today you can win a pair of Hamilton tickets to smash hit you too can celebrate threat like I once did enter a W E s a F ... call for one to six and seven to nine five five\nW E essay is supported by the ... foundation and supportive kids Bert dot org\nAnd online resource designed to keep families up to date about the people events and ideas making Pittsburgh a better place to raise their kids more information is available online at kids bird dot org\nSupport for NPR comes from this station and from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and diabetes solutions learn more it see three\nI O T dot a guy and from Americans for the arts\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nShapiro President Trump often criticizes people he has appointed two top jobs and the government lately he's going after someone who sets monetary policy\nAnd then I'm like ... is a sad day because the fed is ranging race too fast and it's independent so I don't speak to him but I'm not happy with what he's doing\nThat with Trump attacking Federal Reserve chairman Jerome Powell on the Fox Business Network last night there is a history of tension between the White House and the fed and NPR's Uri Berliner joins us to tell us more about the fiery hello or let's start with what's happening right now why is the president going after the chairman of the Federal Reserve\nBut back in July he said he wasn't happy with the fed rate hikes he suggested that they could interfere with the economic expansion\nAnd then more recently right after the stock market sell off he complained again there's some a lot more strenuously he said the fed had gone crazy and was out of control then yesterday he died that up even more saying the fed was his biggest threat\nNow the president's been criticized for these attacks including by some former members of the fed you know they say this can create political pressure that interferes with the feds independents but others say you know the fed is fair game and should really be able to defend its policies if they get criticized\nYou ever heard of that tape Trump saying well the fed is independent so I'm not going to attack them but they're crazy out of control the biggest threat he's not the first president to attack the Federal Reserve tell us more about the history here\nYeah that's true or not it hasn't happened so much recently but you know back when Lyndon Johnson was president he clashed with his fed chairman William McChesney Martin this was in Johnson was spending a lot on anti poverty programs and the Vietnam War\nMartin was a fiscal conservative and he famously said the Fed's job was to take away the punch bowl just as the party is getting going so they didn't get along and in Nineteen sixty five LBJ someone Martin to his ranch in Texas for a stern talk\nAccording to Martin's oral history LBJ said to him Martin my boys are dying in Vietnam and you won't print the money I Need\nAnd then it was Richard Nixon Nixon pressured fed chairman Arthur Burns to keep rates low in the run up to the Nineteen Seventy two election or the first President Bush he didn't criticize Alan Greenspan publicly when he was president but years later when he was out of office he said he thought Greenspan cost him his reelection\nSo it sounds like President Trump who's known for violating norms is keeping with a long established an army or is there anything different about these attacks happening now\nHis rhetoric not surprisingly how blunt it is also it's been very public ah you know I Can't think of any other president who said the fed is crazy\nOr what when presidents are unhappy with the fed is almost always for the same reason presidents want lower rates easier credit flowing through the economy\nThat can boost growth and not coincidentally make presents more popular but I can also lead to inflation presidents don't often worry about inflation central banks do however that's part of their job so there can be this inherent tension between the fed and the White House that can really pick up during an election year\nRight it's independent but also served kind of at the pleasure of the president is there any chance of Jerome Powell getting fired by President Trump\nThere's no indication of that the fed is supposed to be protected from politics and politicians Donald Trump has acknowledged that he's the one who appointed Powell and that the fed is independent but the fed is really seemed to have gotten the fed is really seem to have gotten under your skin to NPR's Uri Berliner thanks for joining us today You're welcome [laughter]\nAsking you this is Ninety point five W yeah and I fall membership drive which end tomorrow morning antennae and if you if you have to give please make your contribution giving our house\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt CMU dot edu flash I I I\nThought the fungi successfully kick us off your air you can call for one to six nine seven to nine five five where you can get online at W. E. S. H. I. F. M. I. Margie across joined by John ...\nAnd we are on track to meet our overall goal for the membership Dr we do need to raise them more money gets more sustaining members to the radio station\nThirty eight hundred dollars this hour and the next thirty five minutes that's the goal and this is the last four o'clock hour last all things considered of this entire membership campaign it ends tomorrow but for all practical purposes all things considered listeners this is your last day\nFor one to six nine seven to nine five five remember when you give your entered into win tickets to Hamilton and give on line that W E s a lot of them\nThe newsroom here W E essay has been growing over the past couple of years and one of the central reasons we wouldn't have been able to do it without you is listening or support we're now able to do more in depth reporting than ever before and a good example that were super excited about the series we launched today called dividing lines the shape of education in Pittsburgh\nIt's eight stories from five of us reporters here all about where Pittsburg kids go to school and why that is\nWe've got stories about magnet schools schools stories about diversity in schools stories about discriminatory housing policies it in a lot more it starts today runs the next friday and it's the kind of reporting that your membership supports Gulf War one to six nine seven to nine five five or you can go to W. E. S. A. dot ...\nThank you still available the membership drive for ten dollars a month you can pick up our good question book or the new tote bag that features the city escape artwork by Baron Batch along with a W E s a logo for Fifteen dollars a month we have a special thank you gift package for great thank you gifts that normally would require three hundred and sixty dollars of pledges to get\nIn until seven o'clock tonight Fifteen bucks a month and what is in that package\nWe call it the free press package it has our brand new stainless steel water bottle which says the sound of a free press on it we have our stand with the facts tote bag integrate download we give you a code and you can download to your phone or to your your computer\nYou can actually download twenty years' worth of highlights from wait wait don't tell me celebrating its ... anniversary and then you get our stainless steel usable straw all for Fifteen dollars a month today only after today's three hundred and sixty to get all this\nSwag Fort one to six nine seven to nine five five W E S H ...\nJust like public radio as for every one this messages for every one if you're already as a standing number you know it's easy and convenient support W E s a each month if it's been awhile since you first sign up why not consider increasing your monthly donation maybe\nTwo or three dollars more whatever's in your budget and increase of even really just a couple of dollars makes a huge difference for us\nIf you fall off recently because your credit card information is outdated those expiration dates now is a great time to update your account you can reactivate your sustaining membership at W E S H ... FM or calls it for one to six nine seven to nine five five it really helps\nWorking for thirty six hundred dollars now between now and five o'clock that gives us thirty two minutes the goal was so very important this was money budgeted to help bring you the news in the coming year you could come in the form of a sustaining membership from me five ten twenty dollars a month or one time gift if you're a new member maybe fifty dollars or\nIf you can afford a dollar a day because now you're listening every day or like the idea of having the station available every day\nA dollar a day works for one to six nine seven to nine five five\nBecome a member of W E s say today and we will really sweet in the pot for you you can win a pair of tickets to see Hamilton the Bradley musical it's coming to Pittsburgh and one there\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt CMU dot edu flash I I I\nMean right twenty six I was tempted to do the tire pitching in uh only lyrics from Hamilton I was told that was probably not a good idea you can just go in the long I think it'll be the happiest room in Pittsburgh on January twenty six you can engineer for a chance to we must tickets and support W E essay by going to W E s hate that accent\nA hundred and Fifteen billion in a while and fierce rats are hurting also and reporting from Brussels thank you sir oh You're welcome Mary Louise\nIt's all things considered on Ninety point five W E s say good afternoon I'm Christopher ears when you look at the map showing which Pittsburgh public school students were assigned to attend based on where they live\nThere are a couple of areas the look almost like mistakes and Bill Maher and east hills floating within the mostly black Westinghouse high school and Lincoln and phase on elementary feeder patterns or two islands within those islands kids were assigned to mostly white schools\nAs part of our series dividing lines Ninety point five W E s ... Schneider reports that decades ago children who live within those islands were some of the first to be busted schools outside their neighborhoods the warning for our audience\nFried ... free to pursue the truth Ninety five double you yet the Pittsburgh NPR News station the sound of a free press\nLives on the same street where she was raised her house is just blocks from where a bus picked her up in the morning and took her to schools outside of her neighborhood\nIn Nineteen sixty five to pitch for public schools board decided to move Bush era and other black students to mostly white elementary schools to relieve the overcrowded mostly black lemming in elementary school\nBush says the schools in her neighborhood where quality but there were differences\nIn you know just when you were in a fourth grade but you know at the hospital taller and economic resources in your community so that was the difference\nRebecca tardy brown grew up in the same neighborhood she remembers writing a bus to a mostly white elementary school and feeling like she didn't belong there\nI remember being called nigger I'm having rocks and things thrown out our bus\nKids not being allowed to talk to us in the classroom got not wanting to sit next to us\nSome white parents protested the move for months telling the board they didn't want their schools to be overcrowded many said it wasn't a race issue but the two black school board members refuted that a large group of supporters gathered the night the board voted chanting freedom and singing we shall overcome\nMany of those elementary schools fed into Taylor older days high school in squirrel hill a mostly white school where ... and brown graduated in Nineteen Seventy one and Nineteen Seventy three respectively both say they received a quality education were exposed to opportunities but faced challenges\nYou know you're the minority you're an all white community your bus\nBack and forth Bush remembers parents from her neighborhood patrolling hallways because a frequent fights\nYou know a fight us five so they say but the fights are\nRacially motivated Bush of neighborhood del mar gardens is a housing cooperative thought to be the first in the country to be owned by all African American shareholders who had been denied mortgages by banks now\nFew school age children live in the co op but the island and the island in lower east hills became entrenched in the feeder pattern both are still zone to attend ... elementary in older days high school not phase on Lincoln and Westinghouse nearby schools and home would the last\nTime the district changed the feeder pattern in twenty twelve to create more uniform class sizes and schools the board chose to maintain the two islands and the feeder pattern Kate Reed was the executive director of strategic priorities at the time and says many students in east hills were choosing to attend their science school and the district wanted to maintain population\nThe idea that you would take away\nFactor out today from my family as their home school\nThe student population and all their dice is half white and forty percent black just three miles away at Westinghouse Ninety eight percent of students are black\nAltered ice is one of the highest performing neighborhood high schools in the district and Westinghouse is among the poorest performing with the second lowest graduation rate brown says her parents told her older days was the best high school in the city so the move was a good opportunity\nI got a good everything I doubt it I screwed social life good education funding in high school I learned a lot got me where I Am\nImpossible to know what Brown's life would have been like if she had gone to another high school we do know the existence of these islands in the future pattern is the result of a city that was once and\nStill is segregated I'm Sarah Schneider Ninety point five W E s seniors\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nA Pittsburgh desegregated [noise] find more at W. E. S. H. dot FM slash dividing lines and\nA very good afternoon it is Seventeen minutes before five o'clock I'm John something with Margaret J crossing we're raising money here on the next to the last day of our membership campaign\nBut really it's it's for for all practical purposes it's the last day 'cause this ends at ten o'clock tomorrow morning we're not here tomorrow and all things considered asking for your support so all things considered fans we need you to step up we're looking to raise three thousand dollars in support of the news in the next sixteen minutes now three thousand dollars what part of that can you help out with\nFor one to six nine seven to nine five five W E S H ...\nWe can do it we need your help however and when you help us by providing your support today you can be entered to in Paris tickets to very fine tickets tc Hamilton\nAt its just smashed all kinds of records is a work of genius I'm very very biased on this point it's a pair front row orchestra tickets at the ... Center for Saturday January twenty six you enter to when\nWhen you contribute to our membership drive now even counted for one to six and seven to nine five five or you can go online to W E s a F\nAnd super important goal to meet in this hour it's our last chance and the four o'clock hour to raise money for all things considered pay that rather large bill we have to NPR each quarter if you can give Fifteen dollars a month well we've got a terrific thank you gift package we called the free press pack\nAnd it has a three hundred and sixty dollars worth of thank you get sued if you will Fifteen dollars a month\nIt has our brand new stainless steel water bottle that has the sound of a free press logo on WB essay logos there to our stand with the facts tote bag or it has our brand new stainless steel reusable straw and also a digital download that you get we send you a link\nTo a website and a code and you can download\nAll this wait wait don't tell me content highlights from the last Twenty years of the program all four of those were contribution of Fifteen dollars a month if you try to get a tomorrow morning\nDuring the pledge drivers were finishing it up it's going to be three hundred and sixty bucks to get all that but the thing you know give this is a steel Fifteen dollars a month that W E S H ... FM or for one to six nine seven twenty nine fifty five\nThere is not a thing to worry about when you contribute to the fund drive because your support goes directly to news coverage\nFor NPR and also from our newsroom hearing W E s say over the last few months we've been working on a series that we launched today\nAt the first story aired on ... island in the school year problem it's called dividing lines the shape of education in Pittsburgh it looks at the senior pattern white kids go to which school based on where they live\nA we have the first story about these islands that seemed to not make sense because of the pattern\nAnd we've got three and about desegregation and we've got stories about school closures it's an eight part series that runs from today the next friday they could not have happened without your support\nAnd the next series that we're working on can't happen either without your support please call for one to six and seven to nine five five help us reach our gold and put interesting in depth news on the air you can go to W. yet they die and then as well\nAnd we're looking for twenty nine hundred dollars in the next fourteen minutes to meet our goal last four o'clock goal for all things considered in the membership drive if you become a sustaining member we welcome all gifts but we would appreciate\nFive ten twenty dollars a month Fifteen dollars a month to get to that thank you give package you could also become a leadership circle member and this is becoming a steward of the public airwaves in a really powerful way by giving a hundred dollars a month plus there are some good benefits which include meeting\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nTalk from a Ira Flatow from science friday Joshua Johnson and NPR reporter Wade Goodwyn two or three a year and you'll be invited if you're in the hundred dollar a month club for one to six nine seven to nine five five W E S H ...\nWe have a listener in shady side we have Brian from the Lincoln ear he liked the environmental news Kelly and Joseph in Pittsburgh and a couple of other anonymous donors thank you so much for your support it makes all the difference in the world that by that it all adds up and contributes to the station that you turn to you for in depth\nSerious reporting fun stuff to we like to laugh not all of life is in charge in fact lots of it's very interesting or weird uh and all of that gets made because you can give us a call for one to six nine seven to nine five five or if you go to W. E. S. ada FM it doesn't happen without your support\nAnd we are giving away tickets to see Hamilton that's right Hamilton the musical is coming to Pittsburgh it's going to be at the ... center and on Saturday\nJanuary twenty six we're holding aside a pair of front row front row orchestra seats for you if you're the lucky winner you make a contribution to the station you're automatically entered into this give away\nAnd we're hoping that you make that contribution now and help us raise the last twenty eight hundred dollars to meet this hours go we just have twelve minutes to do that so why not support the station help pay for the news you get a chance to win tickets to see Hamilton for one to six nine seven to nine five five\nI moved back to Pittsburgh because I Believe in Pittsburgh and I believe in our ability as a key need to get things done so I think we can make that school but we do need your help if you've ever given before if you have listened for a long time or maybe you just moved to a town\nFor just Fifteen dollars a month you can support the news in a big way get some great thank you gets purchase Fifteen dollars a month to help us meet read article this hour we're ... W E S H ... FM just a couple of minutes from your desk or call for one to six Ninety seven to nine five\nFive suited in highland park Brian likes the environmental news he's at Lincoln here thank you for your support we also want to think ah Kelly and Joseph in Pittsburgh for their support uh everybody who gives right now entered into a giveaway to win tickets they Hamilton that is coming up on 'em\nA January twenty six at the ... and we've got great seats front row orchestra seats you make a contribution you're automatically entered for one to six nine seven to nine five five W. E. S. A. dot FM\nIt really is a an invaluable thing to be able to pick up the phone or go on line and know that you are paying for something that you get it every day you know there is a big push in the movement right now a big push in the world trade made in the U.S meaning the United states this radio was made in the United states these stories also may around the world and there's\nReally nothing else that you can do in terms of just\nTaking a couple of Lansing calling us going online that gives you the same kind of return on your investment music stories entertainment laughter every day coming out of your radio because of people like you they do have to pick up the phone\nFor one to six nine seven to nine five five or ... W E S H ... FM and thank you\nW E s I supported by the Frick Pittsburgh presented usability divorced grow fashioning art from paper look contemporary art exhibition features life size rendition of historic clothing created completely from paper\nThrough January six twenty Nineteen as a ... museum details at the Frick Pittsburgh daughter word\nLive from NPR News in Washington I'm ... beer\nAfter turkey claims it has evidence that missing Saudi journalist ... was killed inside the Saudi council didn't it didn't bowl U.S officials say they want a thorough investigation into what happened something with secretary of state Mike Pompeo made clear reporters during the refueling stop in Brussels today\nI'm the Saudis seriously\nHopeful that the Saudis sacred to seriously they indicated to me yesterday that\nI'm time will certainly tell we'll get to see the investigation and we'll see the results\nPresident Trump meanwhile says he's asking turkey to provide audio or video to the U.S if it exists Trump says he's not sent the FBI since the journalist walk attributing columns to the Washington Post is not a U.S citizen president again called for Saudi Arabia and an important ally noting the country is a customer of US military exports\nThe drop in ministry ... says America's greenhouse gas pollution felt by two point seven percent last year but as NPR's Scott Horsley explains the U.S is still expected to fall well short of the climate goals that were said under former President Obama coal fired power plants continue to lose ground to the U. S.\nFried ... free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nSays that help to reduce greenhouse gases from the electricity sector by four and a half percent last year but all smoked as we're getting cleaner tail types of not improve so much Kate Larson with the research firm ... group says it is right at the U.S is not likely to meet the pollution control targets needed to fight climate change\nPeople are driving more and they had that ... price as of last year's consumers are choosing larger heavier get off\nThe drop it in this race has announced plans to roll back Obama era fuel economy standards and withdraw the U.S from the Paris climate agreement Scott Horsley NPR News Washington\nA bomb blast killed an Afghan parliamentary candidate just days before elections are being held in that country Reuters reports the Taliban is claiming responsibility NPR's DSD reports from Muslim about\nThe boneless concealed in ... in the campaign office of up to ... he was a candidate in uh southern Afghan province\nCome on it's the seventh parliamentary can tend to to be killed in the militants tack another two had been abducted the Taliban and ISIS have been targeted candidates and rallies ahead of Saturday's elections most recently though the bummed lost at a political gathering it killed twenty two people\nOften security forces and the international community are under pressure to ensure all these elections are relatively peaceful they're also seen as a dry run for next year's presidential race ... date NPR News Islam about\nUs home building slumped in September assigned rising mortgage rates are starting to weigh on the market the Commerce Department says housing starts though to a seasonally adjusted annual rate of one point two million down from one point to seven million in August on his losses on Wall street today the Dow is down Ninety One points\nThis is NPR\nSupport for NPR comments from NPR stations other contributors include progressive insurance comparing car insurance rates from multiple insurers so shoppers can evaluate options in one place now bats progressive comparisons available at progressive dot com or one eight hundred progressive\nFour minutes pass five o'clock it's the next to the last day the penultimate day\nSomeone has to say the pledge drive\nTo the only said by lawyers and fundraisers in public radio the penultimate day of this membership campaign and we're asking you to make a contribution we will not be here asking for money and all things considered tomorrow but right now we do need your support for one to six nine seven to nine five five it's how we pay for public radio I'm John ... and this is Margaret\nCrafts hello good afternoon set amount of a budget each month is a nice way to support all your favorite program and make sure we have the money it takes to keep bringing them to you\nAre getting a little money every month is the best way to maintain a strong feature here W E s a into the programs from NPR even get five ten twenty months get crazy maybe fifties and your budget whenever it is we appreciate it and need your support where for one to six and seven to nine five five or ... W yeah take that event\nThat phone number again is for one to six nine seven twenty nine fifty five we have many thank you gifts you can get when you give ten dollars a month you can pick up our good question book it's based on the series that Katie black Lee has brought to the air and to our website good question\nWe have that great brand new Baron Batch\nArtwork tote bag our logo on one side of barren batch city escaping the other side ten bucks a month or pick up our\nA free press package which includes our water bottle stainless steel water bottle son of a free press are a tote bag stand with facts to back a couple of other gifts Fifteen dollars a month today only for one to six nine seven to nine five five\nYou've never given to public radio before I was talking to you in your car at your\nFried ... read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nThat's an everyday count on NPR and W. E. essay as your primary source for new this is radio station runs on idealism we need your help for one to the extent that into nine five W E essay is supported\nBy extending the firm Comcast offering in home why with X finish the X phi X phi enables users just sat life by curfew change passwords and create user profiles available on the X phi app more information at ... dot com\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly how much of the blame for what ever happened to Jamal ... G should land at the feet of Saudi crown prince Mohammed bin some on\nThis is a key question in the disappearance it appears the likely murder of the dissident Saudi journalist Turkish officials have identified Fifteen men who they say were present at the Saudi consulate in Istanbul the date that cause show she disappeared\nThan New York times has now linked several of those men to been saw him on security detail and tube and saw him on himself Maliki brown is one of the journalists on that times story he joins me now and I should warn listeners some of the details that we may be about to discuss maybe ... brown welcome\nThank you very least lay out first how you made these links you were coming through publicly available records also coming through photographs doing what just trying to match face to face\nUm yeah we were doing the matching names I'm trying to find social media profiles a finding email addresses and phone numbers that were related to these people through a phone databases\nThat allow us to see how their phone numbers are are saved in um in various different ups\nUm and then you know link using those email addresses and phone records phone records of finding social profiles that are registered using a those numbers and addresses are looking to buy a graphic details that are um those people shared\nUm and then we also you know we had information that several of the men were in the royal guard on so we retraced I'm I'm up in Solomon's movements over the past year or two um and yeah it's gone to like lots of archival reports\nLots of archival reports and lots of archival photos you published several of those photos of one of the Fifteen men who appears to be a frequent traveler companion if the crown prince who is a\n... I mean he's a he worked in London and doesn't seven I'm as an intelligence officer for the investor they're um we understand from ... ah information published by the Washington Post as well that\nHe um he went on to when I'm training as an intelligence officer or as a security officer\nAnd he's been his own there after he's been photographed the princess side on visits this year to the U.S to Houston to Boston to the U.N General assembly I mean that was just three weeks ago\nThere screaming in the world today and I don't just mean if you live near a playground there screaming headlines on cable TV they're screaming talk show hosts screaming commercial\nThat may be why'd you seek solace in Ninety eight point five W E essay each morning or afternoon or maybe on the weekend it's a civil way to get your news to check in with the world and with your can you need the informs intelligent and thoughtful lay with very little shouting at\nOne of those things that you can support something that you enjoy the show is that you do you can call for one to six nine seven to nine five five or you can go online to W E s said that at\nThat and when you do and make that contribution you entered win tickets to the Hamilton at the Bennett I'm center we have one lucky winner at the end of this membership drives the seats are front row orchestra on Saturday January twenty six what more to say than while ... you're probably not going to be able to buy them they're going to be hard to get there going to be expensive\nWhen you do so why not become a sustaining member get your name and on the drawing maybe give ten dollars a month you can pick up some of our thank you gifts including the good question book that we're putting out a with a Ford bike or Katie black Lee or maybe you can pick up the W yes a power bank gives you a phone a couple of good charges before you have to recharge it\nTen bucks a month for one to six nine seven to nine five five\nYou can also give on line W E S H ... FM in thanks\nW E s I supported by chorus call a worldwide Monroeville based provider of customer video conferencing audio conferencing webcast to invent\nDreaming on W E n J imported by Carnegie Mellon university integrated innovation [noise] detail on a master's program\nAt the end you dot edu slash I I I [noise]\nChorus call it was available at course called dot com\nSupport for NPR comes from the station and from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more infidelity dot com slash wealth fidelity brokerage services Elsie\nFrom logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\nAnd from the sustaining members of this NPR station\nThis is all things considered from NPR News I'm Ari Shapiro and I'm Mary Louise Kelly when most people make a mistake they say I'm Sorry but what should accompany\nDo when it makes a mistake a recent study looked at the economics of apologies Stacey Vanek Smith host of the podcast the indicator from Planet Money spoke with Benjamin whoa he's an economics professor at Vassar about why saying sorry is not as easy as it might seem\nNew to this like really really interesting study as a way to study apologies\nSo the study was partnered with Hoover so we look we focus on the Ninety five percent of lightness all the most extreme ... most late ride it was about five percent chance that you never come back to her again\nAnd the question is how can we repair this relationship how can repair said the trust between ... and its broader we tested different kinds of apologies and we found that the right kind of apology could basically increase revenues by one to two percent\nOf the wrong kind of apology could decreased revenue by one to two percent which we accepted apologies and evolved sort of commitments to do better or or not what we saw was that a commitment to do better in the future it's it doesn't seem to matter much right away but we track these writers for three months after the apology and we found that basically two or three months later these commitments have you been in the future\nActually backfired against the company\nI'm In part because you might commit to do but in the future and then the writers who vote didn't do better because then maybe maybe for some of them had another bad experience and I as a result those those people punished but more than than the control group that got no apology at all\nDid they ever had a good effect I'm\nNot in our data um [noise] so\nI think they they they they temporarily had a good effect right but I think there's this idea that once you've apologized we're going to hold you to hire a higher standard and sort of by the end of the three months three months of observation it seemed like they either had no effect or or or a negative effect\nIt is interesting that we expect remorse from a company like it's like minimizing human interaction yet still seems like we still want the same level of trust and accountability I think\nPart of it is that our brain sort of works on script singer sticks and so you know we're entering a relationship with a company we sort of like the same sort of scripts and risks triggering our brain and so because we expect remorse in real life we sort of expect it from a company\nSo what were the what would the apologies that really worked for ... like what was the magic\nThe magic was money [laughter]\n[laughter]\nYeah um show me the money basically yeah yeah yeah um that we tested apologies with or without a coupon and we've we've which and we found basically the most effective apology the ones that sort of increased revenues was a just a five dollar coupon\nWithin just money or with their certain language that people responded well to\nSo we were we were hoping to figure out the best language but we found that there was no statistical difference between the different languages his money it seemed to be just money and in fact the message that you might may have backfired a bit was a message that sort of committed to do more in the future\nDo you think this like carries over into personal relationships thing that I'm so sorry that I like whatever\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nRight or you're the waters and flowers flowers and candy they voted takes on a whole\nNew significance um did it hasn't changed the way like you apologize [laughter]\nWhen people thought always wanted to ask me the horse they do I was curious I think the main way change about because all my friends and my family and do that I study apologies than they would always be skeptical whenever I Apologize so I have to like go an extra mile to sort of sound like earnest and sincerely morsel because people are always was like oh you're just end up with their paper\n[noise] no apologies for telling you that was professor Benjamin Hope speaking there of a Planet Money's Stacey Vanek Smith [noise] support\nFrom Planet Money comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement Morris alliance for lifetime income dot org [noise]\nYou're listening to all things considered from NPR News and you're listening to Ninety point five W E s a very good afternoon to you and this second to last day of the phone numbers you guys were so close but we still need your help\nPlease give now to ensure that W E s a it here for you today tomorrow in all the date that follow giving you informed entertain it's easy you can go online to W. E. S. H. I. F. M. take just a couple of quick or you can call us at for one to six nine Seventy nine five five every gift is really important so we can end the membership\nDrives strong I'm Margaret crowd cheered Jones\nAnd we're looking re seven hundred and fifty dollars and just the next four minutes and we're up five hundred dollars and the next four minutes in a good position to meet that goal pleased become a sustaining members the best way to give\nFive ten Fifteen dollars a month some people give seven fifty a month because it's still less than a hundred dollars a year that works out to Ninety bucks but it works for them and that works for us to review Fifteen dollars a month we have this great package of thank you just recalled the free press pack\nWe'll talk about that more in a moment but please make that sustaining membership helpless raise five hundred dollars in the next three minutes\nFor one to six nine seven to nine five five\nSometimes the past can confound the future public radio in the path to survive cuts in threats to federal funding for decades now but in that same time a lot of stations have also suffered\nThey've lost funding that they need to report locally funding to the NPR member station in broadcast important programs that mattered to such a MORNING EDITION or all things considered\nThey've been forced to cut staff and services and some cities\nThe stations aren't even on the air anymore and the big picture public radio will continue to survive cuts and threats in the coming years but it's only with the financial support from people who listen and become members of their local stations\nPlease keep local coverage on the air support what you believe in you can call it for one to six and seven to nine five five or you could go to W. E. essay that FM\nWrapping up the membership Dr we have tickets to see Hamilton that we're giving away to some lucky winner it's withdrawing you make your contribution your entered into that give away the show was in January\nIf you can give ten dollars a month we'd be happy to sign you up for sustain or plan and thank you with a good question walks brand new gonna be coming out from a\nW BSA newsroom and Katie black leader will thank you with the Baron ... coffee mug that has that great city escaped by Baron Batch at ten bucks a month for one to six nine seven to nine five five W. E. S. A. dot FM\nIf you can handle Fifteen dollars a month we will thank you it was for ... W E s a gifts we called the free press pack which has a lovely ring to it nothing like the sound of water shutting out of your sound of a free press stainless steel water bottle or that sort of lovely feeling you can get\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nI don't think of yourself some laughs wait wait don't tell me how the twentieth anniversary digital album that comes in this pac and one of the use reusable straw that may be seen fence people using it for fancy people for everybody just like public radio\nYou'd normally have to give three hundred and sixty dollars to get all of the thank you yes but for today it's just Fifteen dollars not today only you can call for one to six Ninety seven to nine five five or go on line to be the essay death and\nWhen we're a public radio asked for your donations we offer what we call pledged premiums you know tote bags and mugs and T wobbles but let's face it all that is old and tired it is time for something new so how would you feel a pledge to the station got you something like\nThis you know I was like to go home but have you tried NPR's new assistant\nRubber hand to hand on the life\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute detailed on a master's program\nAt CMU dot edu slashed I I I\nBecause demographic change is very slow better work up here in an hour long CNN town hall of it to my evening and my child on the Texas\nBorder Ted Cruz declined to participate shortly after the voters questions himself Wade Goodwyn NPR News\nIt's all things considered on Ninety point five W E s say good evening I'm Christopher ears award winning Pittsburgh author Sharon ... published her debut novel the skin I manned Twenty years ago the book follows the story of ... smart dark skinned seventh grader who gets bullied by her peers\nFlake spoke with Ninety point five W E essays Katie black ... about the publications impact\nThe skin I mean is it just as popular now as one it was first published what is it about the novel that makes it so enduring\nI think in part because there's a little bit of um a league in so many of us I was just watching a documentary on Lady Gaga\nAnd which she said she never felt pretty enough or smart enough or good enough as a musician\nWhich sells crazy to us because she's so brilliant but so many of us I think struggle in the skin we're in right we're comparing ourselves to other people or someone else is bullying us we're looking at ourselves and saying we just don't measure up\nA and we're always trying to find a voice and find our place\nRegardless of the decade and so I think that's why it's indoors it's you know kids read it and feel like okay somebody gets who I Am somebody reflects who I Am a and they're kind of showing me a way to get passed them through some of this\nHe wrote the character ... got two decades ago but she still resonates with young readers why do you think that is she\nHas stood the test of time in a way I could never have anticipated or imagined\nAnd as we are sitting in the middle of the me too movement which is all about I'm finding your voice and I'm being able to speak your truth right no matter what that is an being okay with who you are and women\nAre feeling empowered and girls than with empowered\nI feel as if um the league has been doing that\nFor a long time and you you merge that the me too and the discussions around black lives matter and I think as a young adult novel is in his children's writer um I've been saying all along you know and we all do who write these books that black lives matter\nWhat would normally get say the kids in twenty Eighteen\nI think she would say you're okay\nThat is that it's hard alley here\nBut hang in there and and speak up even if you are afraid I think that's in that don't wait to be unafraid to sometimes we wait to be unafraid I waited to be on afraid I Would never have written a book but I you know if I jump in the water I figured out on the swim\nJumped at a Law Order you know I'm Still hearing like I said from\nYoung people people turn thirty at this point who say a young people who write their college essays and send them to me and they're about you know they're about how ... in the book changed their life\nI felt small I felt little people tease me 'cause I was darn I\nGot the book and it just turned everything around\nPittsburgh writer Sharon flake is the author of the skin I man which was published Twenty years ago and continues to be popular\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nReading from the skin I men at Barnes and noble and Fox chapel on Saturday\nLook I enjoy your cat videos as much as anyone but click bait isn't coverage I'm Scott Simon you listen to NPR for news about your community local journalism matters and show does your support please keep reporting it matters coming\nCan afternoon welcome to Ninety point five W E essays fall membership drive if you're just tuning into us asking you for money we promised that gun is going to be long now\nWe close up tomorrow ten am but we need your support to finish the drive strong even give us a call it for one to six nine seven to nine five five to support local in depth coverage national news\nOr you can go to W. E. S. A. dot FM I Margaret J crafts I work in the newsroom I'm here with general manager John ...\nLooking re Fifteen hundred dollars in the last Fifteen minutes of this hour and you know what we're done with fundraising and all things considered and marketplace at seven o'clock this evening the drive ins tomorrow at ten am\nBut then it's fundraising free one a fundraising free here now fresh air all things considered marketplace all fundraising free starting tomorrow we're hoping that you help us or in these Fifteen hundred dollars and if you give now you're entered into a giveaway to win tickets to the Hamilton\nHamilton coming to Pittsburgh we have front row orchestra seats on Saturday January twenty six at the ... center\nThey're going to be expensive they're going to be hard to get one you might win some that would be pretty easy to one lucky person who's gonna win you get your name and the drawing when you give a W E s a dot FM or call us at for one to six nine seven to nine five five\nYears unless there's every day about things you like and things you'd like to do differently\nThe thing is you can reach us we're right here in your community we welcome your thoughts whether you think we're doing a terrible job on something or a great job on something the one consistent theme though is that NPR and W. E. S. A. provide programs you can't find anywhere else and that these programs are important to you\nKnow we don't know where to find you even though you know where to find out and that's why membership drives are important you know you like W E s say you know the programming is unique\nBut if you didn't know the time to get is now because there's not much time left you can call us at for one to six nine seven to nine five five or go to W. E. S. said on FM\nNot much time left to get some of our very popular thank you gifts including the brand new good question book that Katie black leader has put together a long with folks from the W E S a newsroom you love the series good question you why because people from Pittsburgh they love their history they love their nostalgic even more but you know and love more than that\nTelling other people about it [laughter] that is that is very true here and so there are a lot of questions on the stump people and they want to make sure that if they've had these hand me downs stories from families are not quite sure that's right so they write the Wu essay newsrooms are good questions in our reporters find the answers\nThere on the radio now or in this book for a ten dollar a month contribution the good question book\nFor one to six nine seven to nine five five W E S H ...\nN when you hop on the phone or hop on line to support WBFO say we will send you for great thank you get in one special package or we can't be W E s a free press pack\nIt sounds like you should somehow be able to skip the line at the airport or something it will let you enjoy your time at the airport certainly a it is the sound of a free press stainless steel water bottle that stand with the facts tote bag\nA reusable straw perhaps for sipping from either your water bottle or some of her beverage and the wait wait don't tell me twentieth anniversary digital album literally tons and tons of laughs and even for the news and\nFree to pursue the re to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free friends\nI just today though you'd normally have to give a three hundred and sixty this is Fifteen bucks a month W E s said that eh than\nThirteen hundred dollars to raise in the next fourteen minutes we can do that with your help it will make this our success for one to six nine seven to nine five five W E S H ...\nI'm Mary Louise Kelly we live in unsettling times and as we all try to make sense of forces shaping our world our country our towns\nWere than ever I feel our job at NPR is not telling you what to think it's not yelling we try to be a force for facts a home for civil and respectful but fears questions to the people we interview police show your support for this station become a sustaining member and thank you\nEven call for one to six nine seven to nine five five it takes a couple of minutes or you can go online to W E s said that eh than when you call or you go online you are supporting civility you are supporting\nConversations that matter and today when you support us when you give a contribution you also get energy to win tickets of a pair of tickets to the Hamilton at the ... center on Saturday January twenty second\nTalking about supporting democracy this musical it's so beautiful tough enough persistent themes in our community in our culture asking questions making your own way through things\nTaking action even when things seem impossible when you contribute to W E S H date it entered for a chance to win their front row orchestra tickets get ready to cry your eyes out for one to six nine seven to nine five five or you can go to W. E. S. said that if you\nListened throughout the year now widespread your contribution your support throughout the year by giving our monthly sustain are playing either directly from your checking account or on your credit card or you give ten dollars a month and you think about it if you tune in just twice a day five days a week you're listening ten times a week\nAnd they do sting forty or fifty times a year so ten bucks to to support your habit of tuning in forty fifty maybe sixty times a year we think it's worth it we hope you do two for one to six nine seven to nine five five W E S H ...\nIf you've never given before to public radio or to ... W E essay\nYou matter your financial support comes with no strings attached that means that W E s a is free from commercial and political influence it's vital to W. E. essays feature vital to the future of our community to have a place where you can go where there's no spin\nThe gap between listeners support in federal support is large and it's not going to get smaller ever that's where you come in your contribution added\nWith other W E s a members is how we pay the bills that was pretty risky it all depends on trust but we don't think it's risky we trust you to pitch in a few dollars to pay for the news you listen to you and maybe they've already given and you can feel very smoke and you should\nUh if you hadn't given allow you can update your membership or you can get for someone who maybe isn't in a position to give right now a college student a single parent\nAnd a friend of yours his kind of get into the water is a public radio but haven't taken that plans you can help get them there and a given in their name you can call for one to six nine seven to nine five five or you can go to W. E. S. said that aesthetic\nOkay we're getting ready to go back to the news asking you to be one or two people to help us meet this hours go remember you're going to be entered into the Hamilton give away and just an hour to get our special free press package at Fifteen dollars a month for one to six nine seven to nine five five\nToday's programming is supported by ... academy a Catholic coed high school in the north hills its mission is to inspire students to achieve academic success and discover and developed through its international baccalaureate programs athletic programs clubs and activities open to all details that\nThan sentient academy dot org Pittsburgh NPR News station\nStreaming at W. E. S. A. dot FM [noise] this is Ninety point five FM W E as they can spur Ninety three I founded on YouTube to Eighteen Baltimore one hundred and twenty five of them W to six three A. W. Johnstown\nAnd one of four point one I found to lead to a one page leading areas are Ninety point five age do you want to work the burden on the news stations dreaming at W. ASA dot FM\nLive from NPR News in Washington I'm ... beer President Trump says he wants to find out what happened to Saudi ... ... but as NPR's Mara Liasson reports Trump also continues to give the benefit of the doubt the Saudi royal family\nPresident said he'll be brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump has compared the Saudi royal family to Brett Kavanaugh suggesting that they've both been considered guilty\nScreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nWould that being said Saudi Arabia's then a very important ally of ours in the middle east\nThe president also said he thinks the audio tapes of what could be ... torture and dismembered meant at the hands of Saudi Government officials probably exist and that he's asked the Turkish government to share those tapes with us investigators Mara Liasson NPR News the White House\nA week after hurricane Michael made landfall FEMA officials continue to conduct search and rescue missions throughout the Florida Panhandle W. F. as use owner Clark reports many communities there are still reeling from the scope of the damage\nJerry scene and her family chose to ride out this storm at home in Mariana fifty six miles from Panama City Florida she recall standing in her kitchen watching as the wind hurled trees and to their home after the storm she says debris trap the family on their property\nAs five day they have now\nThey get it to get the\nThat way you say they are [noise]\nSeating and her family weren't under in order to evacuate for seeing this storm was a wakeup call next time a hurricane comes this way she sat her bags packed and she's gone for NPR News I'm Eleanor Clark in Tallahassee\nRussian officials say an Eighteen year old student that went on a rampage at his vocational school in Crimea killed at least Eighteen students\nMore than fifty others wounded before killing himself\nAccording to one student a school shooting went on for at least Fifteen minutes Russia annexed Crimea from Ukraine in two thousand fourteen\nPropping international condemnation and western sanctions the victims in today's attack were teenage students who suffered shrapnel bullet wounds school officials say the attacks started with an explosion it was followed by more blast and then gunfire\nRegional leader in Crimea says it appears the student acted alone killing himself in the school library shortly after the attack took place\nNew York protesters or prosecutors why there are now saying formerly detected the sexual assault investigation of Harvey Weinstein or one of the women accusing him to delete information from her phone for turning it over to investigators ... days office detailing the alleged misconduct of literature winds teams lawyer that was made public today\nStopped recovered some lost ground after an early slide today still closing lower the Dow was down Ninety One points that aspect felt two points this is NPR\nSupport for NPR comes from NPR stations other contributors include that John D and Catherine the MacArthur Foundation recognizing exceptionally creative individuals and this year's MacArthur fellows and more information or Mac found dot org and the listeners who support this NPR station\nThat the good afternoon welcome to Ninety point five W E essays phone membership drive which ends tomorrow morning at ten o'clock\nYour contribution is essential now to keep all of your favorite programs and voices and personalities on the radio please give now helping and this gigantic that's really where it for one to six nine seven to nine five five or you can go to W. E. S. H. I. F. M. I. Margaret ... Johnson\nWe have just fifty five minutes left of fundraising and all things considered and marketplace for the day and then we're done with the drive ins at ten o'clock tomorrow but if you give by seven o'clock you can get in our special offer we call it the free press pack\nAnd it has for great thank you gifts in it for Fifteen dollars a month normally you'd have to give three hundred and sixty to get all of these it's our brand new or sound or a free press water bottle are staying with the facts tote bag are reusable stainless steel straw\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nRight listening on your computer we send you a code to go on line and download this all four of those for Fifteen bucks a month after seven o'clock today three hundred and sixty dollars to get all those thank you gifts for one to six nine seven to nine five five W E S H ...\nWe had a lot of people that think as a late each and every day but right now and anonymous donor in the north hills you count daily on W. E. essay in his or her car Patricia and then having coffee in union town\nRory in Spring Hill in ... new thank you a new members carry a new member Peter thank you for your guest be like Peter and Kelly and Rory and all the people in our community stepping up this evening call for lunch to explain seven to nine five five I Swear it's easy or isn't going to give you the essay that al ...\nAgain that phone number for one to six nine seven twenty nine fifty five or memory or give away for Hamilton tickets when you give right now give on line that W E S H ... n thanks for your support\nW E essay is supported by community college of Allegheny county presenting mission critical filling tomorrow's jobs on November fifteenth\nPart of the Robert M mill lecture series this discussion focuses on the efforts of business and labor to address the region's anticipated worker shortage details at C. C. A. C. dot edu\nThat says all things considered from NPR News I'm Mary Louise Kelly and I'm Ari Shapiro all this week we've shown you how women in prison are more likely than men to be disciplined for minor violations of prison rules\nWe end our investigation with a look at leadership prison reform created by women for women NPR's Joseph Shapiro explains\nJennifer ... is assistant superintendent of the women's prison in Vermont she started her career as a corrections officer a guard Eighteen years ago and she got a quick reminder about how prisons are world dominated\nBy men it was first told that\nWe'd get women's uniforms only to find out there in a women's uniforms and they were only men sizes and I had never worn men's clothes I had no idea what size pans I was supposed to get\nA woman making a career in corrections likely has stories of facing resistance or hostility from her male co workers and bosses but as a women's slow we moved up the ranks they'd help spark a movement called gender response of corrections\nCrowded classroom minimize rocky trained with the most recently hired corrections officers in Vermont you guy\nIt's hot here\nReally fairly\nSo they tell me why didn't you have one that I'm working with\nThese new officers get five weeks of training but just the four hours ... teachers on how to deal with women prisoners\nEveryone's the same where those treat everyone the same for fair and that's why in there and work\nThe country some Fifteen states are teaching new ways of treating women prisoners\nGender response of corrections is built around the understanding that women prisoners are different they're less likely to come to prison for violent crimes in prison are less likely than men to be violent but the discipline system in prison is set up to control violent men so those rules country women more harshly more unfairly\nIt's an insight that came out of decades of academic research from feminist historians sociologist another academics from women consultants who specializes in prisons and from that minority of women who made a career in corrections like Maggie Burke\nShe was the warden of a women's prison in Illinois but she too started as a corrections officer at a men's prison\nScreaming on WGN supported by Carnegie Mellon university integrated innovation details on a master's program\nAt the end you dot edu flash I I I\nAm and and I'm going to tell you that you know twenty nine years in the department and I've never had to use on\nThe quality of news and information you get from W E essay would not be what it is today if we had to rely solely on tax dollars you make up roughly half of our revenue and we wouldn't be here without you because of our listeners because of his community that we are proud to be a part of and\nWe asked for your support and then the radio keeps on Tommy even calls it for one to six and seven to nine five five think about what the station means to you and then do you think is right W E S H ... FM and thank you\nYou'd be obscene supports W E essay at our celebrates series Ninety neighborhoods ... good stories to people who make some place they live a better place to live UP MC life changing medicine\nSupport for NPR comes from this station and from Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and being\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nHitchcock's insurance encourage courage from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and diabetes solutions learned more it see three I O T dot a guy and from Americans for the arts\nThis is all things considered from NPR News I'm Ari Shapiro and I'm Mary Louise Kelly next month's thirty six states will elect a governor nine of those races where Republicans are in office are still competitive some analysts say they're a toss up even though a Republican in office now the winner could come from either party\nOne example Iowa where the Republican governor can't seem to ... past her democratic challenger here's Clay Masters of Iowa Public radio [noise]\nThere was barbecue and live music harvest seemed fundraiser for Iowa's Republican governor Kim Reynolds this weekend in Des Moines for the kids there were balloon animals and face painting White House press secretary Sarah Sanders was the keynote speaker for taking to the podium she signed autographs and the crowd\nHe\nEnters the daughter of former Arkansas governor Mike Huckabee helping crowd they need to keep\nThe state's top officer in Republican control\nTrust me I've seen what a liberal Democrat running a state looks like a member I'm from Arkansas and it lived under the Clinton for a long time\nThis is the first time Reynolds has run for the office she ... she was lieutenant governor and took over for former Governor Terry Branstad when he became US ambassador to China last year Reynolds\nTells the budget surplus of one hundred and twenty seven million dollars and a state unemployment rate of two and a half percent as a couple of reasons voters should keep her as governor that resonates with Carol ... Burlington who was at the fundraiser registered Democrats thinks Republican policies are working\nHere when Branstad we would've said within two he hadn't gone to China were staying when can we think even caring for them\nAs we know stepped out of the shadows of her predecessor she's walked into the light of president Donald Trump last week she appeared on stage with the president in front of a packed arena in Council Bluffs Iowa and praised him\n\n\n[noise]\nDemocrats here are hoping governor Reynolds close alignment with the president works in their favor\nImmediate effects of Trump's terrorists have not been good for farmers and while Iowa when big for President Trump than twenty sixteen\nTwo years later with less than stellar approval ratings in the state Democrats see an opportunity there Kennedy it spread Hubble the former board member of Iowa was Planned Parenthood has some name recognition and the state he's a wealthy retired businessman it is getting help from Democrats all over the country to things or your for just one\nNumber one friend who is going to be there you go\nThat's\nWashington governor Jay Inslee he's the chair of the Democratic Governors Association and just talking with volunteers getting ready to knock doors in the small Iowa college town of ... [noise]\nA Donald Trump is just a blip in history and we're in a rush to this country are you started right\nAnd polls show the race is close between Hubble and Reynolds Hubble has spent millions of his own dollars on his campaign which has primarily focused on what he sees as Reynolds mismanagement of Medicaid and the state budget\nShouldn't be taking money out of education out of health care out of public safety odd about judicial cyst\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News that the sound of a free press\nGot to explain why artist and democratic volunteer Tara Shukla Jones says she's voting for Hubble even though he wasn't her first pick in the\nPrimary voting is not really glamorous no not really I'm not you know it doesn't always make you feel like if you don't do it for a long time there are problems right so no I think Fred how well is that better\nChoice for governor with early voting underway some Iowans have already cast their decision in a contest that quickly become one of the country\nMost competitive governors races for NPR News I'm Clay masters in Des Moines [noise]\nSupport the news by doing a W E s saying now you're entered into a drawing to win a pair of tickets to see Hamilton\nCountry and we don't\nHave all those years come into this bird W E s a given the way up there on the front row orchestra seats to see the show at the center on Saturday January twenty six you don't have to give to the other but it's the end of a membership drop your support would be greatly appreciated the double you said on FM that WVU essay daughter to have them\nAnd you can make that contribution right now and it's going to help us meet a goal we're looking for just three hundred dollars in the next five minutes to finish up our fundraising and all things considered\nThat were done at seven o'clock this evening as well as we're hoping that you make that contribution now become a sustaining member twenty five bucks a month takes care of the whole goal but if you'd like you could give us five ten twenty dollars a month\nFor one to six nine seven to nine five five three hundred dollars five minutes to go W E S H ...\nAnd Justin till seven o'clock if you get Fifteen dollars a month we will thank you with a special for a pack of thank you yes we like to call it the free press pack which is really packing a punch\nIt's the sound of a free press famous Steele watermelon guys stay hydrated the reusable straw comparing nicely without water bottle you can throw it all and the stand with the facts tote bag and then\nHit that down on wait wait don't tell me is twentieth anniversary album a lot of laughs in store for you\nNormally it would be as three hundred and sixty dollar contribution to receive all of these gifts but right now just until ten o'clock you can have them all for Fifteen dollars a month and the anti bonuses supporting it station ... leave and you can call for one to six nine seven to nine five five or go to W. E. essay down here than\nJust the sustaining membership option the best way to give to the radio station easier on your wallet and or if you can do to your checking account we would appreciate it you can just set up a sustaining membership on a credit card or a checking account what we have found over time is that folks come to realize hey you know my credit card expired or I just would rather um\nKnow not have that monthly charge on my credit card or occasionally and unfortunately you get a note from the bank thing oh your car has been compromised and we have to set you up with a new one\nAnd then that creates some work on the back and for us and so if you can have it come out of your checking account we would appreciate it but all gifts are welcome including one time contributions for one to six nine seven to nine five five W E S H ...\nWhether you like to near it out with economic news stories or whether you get psyched about in depth new investigations are fascinating conversations with Terry Gross or Joshua Johnson on one day you can feed what have you here ... W E s say we've got something for everyone\nAnd that's why the name of this program is all things considered MORNING EDITION same thing all sorts of news and stories from around the country from\nThe ones that just named to wait wait don't tell me this American Life in New York or radio hour it's all here W E s senior she's your mind sued for the soul you can go that far one to six nine seven to nine five they really need it even though it sounds corny or you can go to W. E. S.\nFried ... free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nWe will meet this goal we're working to make this membership drive a huge success so that we can continue to sustain the NPR and W E s a news that you count on thank you Harry and Judy\nIn squirrel hill for him in regions where we heard from Margaret and Robert made a contribution out of Pittsburgh we also heard from more more of a thank you very much for uh for your generosity today and Scott Scott checked in with us Scott is in the north side so\nJoined some of these folks become a new member we knew your support if you've been looking at that letter that came in the mail and you haven't been sending it in why not give now also gets you into the Hamilton drawing for one to six nine seven to nine five five W. E. S. A. dot FM\nI like to think of the pledge drive is a judgment free zone so whatever you can give if you've waited this long there's no shame in that we're not throwing any shade we welcome your support in whatever form it takes forever fits your budget you can call us at for one to six nine seven to nine five five\nI'm really talking to all the people out there who have listened to W. E. essay for a couple of years and not get picked up the phone or gone to the Web address now at the time how does that help us reach our goal right W E s a F ... for whatever you can get\nFor one to six nine seven to nine five five Margaret there is no shade and radio\nW E essay dot ... just a half hour left to get in on our free press pack\nFifteen dollars a month and we'll send you for great thank you gifts are sound of a free press stainless steel water bottle or stand with the facts tote bag the digital download album of the best of wait wait don't tell me for Twenty years and our brand new stainless steel reusable drinking straw so you don't have used plastic anymore", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Pittsburgh", "day": "17"}