{"month": "10", "state": "PA", "station": "WESA", "content": "Free to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free press\nFinding just the right gas and making sure those stories are told extremely well that is what you are supporting when you support W E s say ah make that call right now for one to six nine seven\nTo nine five five or W E s said that FM just a few more minutes to have your contribution match dollar for dollar by our friends Dr Harry ... Christian manners and their dog ...\nIt's a special gift they wanted to offer you during science friday but it's about to end just a few more dollars to match a hundred and forty dollars that could be yours dollar for dollar that's two hundred and eighty dollars toward members supported public radio\nPlease give to us today and get twice as much by calling for one to six nine seven to nine five five and W. E. S. A. dot FM so everybody pitches in and does their part you got to think of it I think about this like\nYou're moving a sofa upstairs right ... one person takes one arm one person takes another arm and as a group together you get that sofa upstairs we're asking you to take an arm of the so for right now for one to\nSix nine seven to nine five five or W. E. S. A. dot at them just a hundred and forty dollars and matching money left so get your gift doubled right now and thank you so much for your support\nToday's program and you're supported by conservation consultants presenting the energy efficiency fair in cooperation with the Pittsburgh park conservancy Sunday at the ... environmental center from two to five PM\nThe fair provides homeowners with tools and methods to improve the energy efficiency of their home and address climate change details that Pittsburgh parks dot org\nAll things considered for this Friday is up next on Ninety point five W E s a mostly cloudy the rest of today\nMuch cooler than the rest of this week has been high fifty four cloudy skies tonight with scattered rain showers overnight low forty one cloudy early tomorrow partially clearing in the afternoon\nHigh fifty two it's cloudy and fifty four right now in Pittsburgh this was Ninety point five FM W yeah say and W. E. S. A. H. D. one Pittsburgh Pittsburgh\nNPR News station at four O. one\nLive from NPR News in Washington I'm Laurie London in the aftermath of one of the most destructive storms to hit the U.S mainland it's all about recovery officials in states impacted by hurricane Michael are assessing the damage and preparing for the work of putting things back together\nBut for some areas like Florida's Mexico beach that will be a daunting task\nFlorida Senator Bill Nelson says it's pretty much been flattened\nThere's no barrier islands out there to protect the\nWhole force of the women and the wave of water that came and more true see houses with no longer you see\nThe concrete slab of the house and that's all that's left\nIn parts of North Carolina trees and power lines are down and half a million people in the state are still without power\nThere have been at least Thirteen storm related deaths authorities in Virginia stay strong tropical storm Michael took at least five lives there including a firefighter Ben ... from member station WBUR Seavey has more from Richmond\nVirginia the police officers responded to around three hundred and traffic accidents during the storm that includes the death of Richmond area firefighter Brad Clark was struck corresponding to an accident along interstate for\nOther people drowned and flash floods including them in and the southern part of the state who was swept away from his car green Geller is a spokeswoman for the Virginia state police local residents\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nAround three hundred traffic accidents during the storm that includes the deaths of Richmond area firefighter Brad Clark was struck corresponding to an accident among the interstate for other people drowned and flash floods including them in and the southern part of the state who were swept away from his car green Geller is a spokeswoman for the Virginia state police\nLocal residents had laid down an attempt to try and and pulled the gentleman that safety but unfortunately the water was moving too fast the teeth strong and he was swept away\nFive tornadoes also touched down in Virginia and around four hundred thousand households are still without power for NPR News I'm Ben paid your\nThe Democrat challenging Texas Senator Ted Cruz this November has broken a fundraising record within a three month period congressman Beto O'Rourke raised more than thirty eight million dollars is Ashley Lopez of member station K. U. T. in Austin reports\nThat's more than any US Senate candidate has ever raised in One Fund raising quarter Beto\nO'Rourke has been lagging in the polls lately but he is vastly out fundraising his opponent in fact he received more than tripled the amount Ted Cruz race which is about twelve million dollars and the same time period\nAccording to our rights campaign he received more than a hundred thousand individual contributions none of which he said came from a political action committee or corporation even though ... individual campaign is raising a lot of money Cruz has been receiving a lot of support from conservative groups across the country\nCruises also maintained an edge in the polls the latest Quinnipiac poll shows true the lead has widened to nine points in recent days for NPR News I'm Ashley Lopez in Austin\nAt the closing bell stocks recovered some of the week's losses the down gain two hundred and Seventy six points this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christiana Hendricks and Isabel who pair a new episode every Friday on prime video\nWe our listeners supported W E essay and this is our fault membership drive or here now to raise money and support of the news you trust on W E s say\nPlease make your contribution at for one to six nine seven to nine five five or on line at W. E. essay data them I'm Kathleen Davis here with John sudden\nAnd we want to thank everybody who's already made a contribution during this membership drives to standing members who've help support the station throughout the year we appreciate your support\nAlso Susan and fill up in shady side appreciating the fact that a W E essay is helping the local news reporting that we have here and we also heard from\nA Kelly being north ... thank you we love you too and Kerry in ... science friday found some of the folks checking in and helping us out\nAlong with Lindsay in Pittsburgh we're asking you to join them because the more people who give the more solid the future of public radio will be give what you can for one to six nine seven twenty nine fifty five\nAs you might know listeners support is our primary source of funding and your contribution is essential to W. E. essay\nThe benefit of you giving now is that when you joined other listeners and taking responsibility for this radio station NPR and W. E. essay can always have a home here on your radio you can give now at for one to six nine seven to nine five five or online at W. E. essay that FM\nThat phone number against for one to six nine seven twenty nine fifty five we want to give a shout out to many in Pittsburgh and and\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nDelivery for this radio station NPR and W. E. essay can always have a home here on your radio you can give now at for one to six nine seven to nine five five or online at W. E. essay that ...\nThat that phone number against for one to six nine seven twenty nine fifty five we want to give a shout out to many in Pittsburgh and in Pittsburgh\nMarty and Gary and the Mexican war streets they rely on us for news will you do too that's a good reason to give in fact we're looking to get Fifteen people to give in this hour can you be one of the Fifteen people to help out by becoming a sustained member maybe it's time to renew your support for one to six nine seven twenty nine fifty five\nToday's programming is supported by bomb boulevard automotive abolished service Centre providing preventive maintenance\nState inspection and repair a foreign and domestic vehicles open Monday through friday bond boulevard automotive is located at forty seven forty one bomb boulevard and shady side information that bomb the LCD auto dot com\nFrom NPR News this is all things considered an alpha Chang and I'm Mary Louise Kelly this is a war zone that's how one resident of the Florida Panhandle described the aftermath of hurricane Michael to us today\nWe begin this hour taking stock of the devastation in two towns Appalachia cola and the neighboring town of East Point they are the heart of the Florida oyster industry and they are where NPR's Greg Allen has spent today he is with us now Hey Greg\nI'm Mary Louise so tell me what the two towns look like today\nWell you know these are this area is somewhat east of where hurricane Michael made landfall and they fared better than communities that we're right near the center of places like Mexico beach in Port saint Joe\nSo when we drove in today my producer by yourself and and I we didn't see the massive tree damage that we've seen like in those other communities you know the the trees are mostly stayed standing which shows that they didn't receive the same high wins you know the there I think there was tropical storm force winds and the trees were stood at\nA here in Appalachian coal in East Point storm surge was the main ... along highway Ninety eight the coastal road many buildings were destroyed these were businesses that were really part of the seafood industry they're all kinds of businesses were just in rubble I'm somewhat already taken a hit economically\nBut uh there's not as many there as a war there before the storm we also have people who live on highway Ninety eight who were flooded a but this is nothing like the destruction that we've seen some of those other communities\nAnd are you able to get around or the roads clear you were telling me yesterday I took him nine hours to make a drive that normally would take to so what's what's how's that going\nRight it's it's gotten much better I think throughout the region in this area of the storm surge did a lot of damage to the coastal road highway Ninety eight that's the section that runs really all along the coast through all of these beach towns\nAnd it's been damaged in in several places and it will be some time before that role will be reopened again because of the storm surge came up and basically just made the concrete buckled under wash them and a half an hour yeah yeah I've watched the\nThere's also in that area there's a causeway the links Appalachian coal in East Point together that was damaged now open to single lane but that said there is now a pathway through apple logical or going\nWest it would be toward places like port saint Joe which were really badly affected you have a steady stream of traffic going through with power company trucks your emergency crews and others and the people in a in a Appalachian coal watching these trucks go by saying hey we don't have power but\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nThat's a great reason to make a contribution now we help turn even the most mundane everyday moments into time well spent you can give now at for one to six nine seven to nine five five or online at W. E. essay data them do you\nOr in the office W ESE is with you all the way keeping you informed and entertained\nThat's a great reason to make a contribution now we help turn even the most mundane everyday moments into time well spent you can give now at for one to six nine seven to nine five five or online at W. E. essay data them\nDo you like food do you like food magazines where we have a special offer that ends tonight at seven give seven fifty a month or more on our sustain are playing Ninety dollar contribution we will thank you within any will subscription to food and wine magazine\nAnd so you'll be able to get the a magazine coming to your mailbox for a year you'll be supporting the station so it's kind of one of the things at school by public radio you listen to expand your horizons you get the magazine you expand your food horizons you're killing their\nHorizons it's a seven fifty a month and it's today only for one to six nine seven twenty nine fifty five W. E. S. A. dot FM\nGiving to W. E. essay is really easy on our sustain her plan all you need to do is pick an amount that fits in your budget\nThat can be five ten Fifteen dollars a month and it comes out of your checking account or to your credit card and it renews automatically and you can easily change your amount at any time and best of all it only takes a couple of minutes to enroll and then you don't have to worry about renewing your membership\nYou can give now at W. E. S. said that ... or ... for one to six nine seven to nine five five\nThat phone number again is for one to six nine seven twenty nine fifty five W. E. S. A. dot FM and uh we're asking you if you can to make your contribution now before you get on with your busy weekend you may not have a chance to make a contribution tomorrow or or Sunday while you're out and about doing different things\nWon't be trying to raise any money at one o'clock on Sunday that's for sure so why not make the contribution now for one to six nine seven twenty nine fifty five and thanks\nFrom NPR News this is all things considered I Know that Chang and I'm Mary Louise Kelly today in Turkey a court ordered the release\nOf an American pastor held for the past two years Andrew Brunson spent most of that time in jail he'd been under house arrest since July\nPresident Trump made pastor Brunson case a priority and tweeted today that he will be home soon we don't know yet but it's possible he could be home as soon as tomorrow NPR's Peter Kenyon joins me from Istanbul Hey there Hi Mary Louise so remind me why Brunson was in Turkey and the first place and what exactly he'd been convicted up\nWell his pastor around a small church in is near and western turkey for years and years a but after a turkey had this failed military coups and twenty sixteen there was a massive roundup of suspected or enemies and Brunson was caught up in that basically he's always denied the charges that he had anything to do\nWith this cleric for to the Gulen turkey blamed for the coup attempt\nThe U.S said the charges were baseless but he was picked up any way he's been in jail or house arrest for a couple of years now\nAnd then today in court we had three witnesses to adjust to fight against him suddenly changing the earlier testimony somehow he was still convicted after that incensed a little over three years in jail but then the judge is basically suspended the rest of the sentence removed restrictions on his movement so he's free to go home\n[noise] All right lots of questions about what evidence they actually had against him why release him and why release him now\nWell in some ways Brunson was caught up in these bilateral tensions between Akron Washington I mean there were Turkish officials who wanted to see us some Turkish executives who had been jailed in the u._s.\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nIs free to go home [laughter] All right lots of questions about what evidence they actually had against him why release him and why release him now well\nIn some ways Brunson was caught up in these bilateral tensions between Akron Washington I mean there were Turkish officials who wanted to see us some Turkish executives who had been jailed in the U.S back in Turkey\nAnd of course turkey wanted the extradition of this cleric for to the Glenn who lives in Pennsylvania because they charged him in this a coup from twenty sixteen\nA president ... once said at one point give us our pastor we'll give you a yours or this summer Trump spoke with air to one and reportedly Trump Saudi had an agreement to get Brunson released instead he was simply moved to house arrest\nThen the U.S got tougher they levied sanctions and then the pressure kept moaning and then we had this court case and that was released\nSo a lot of moving parts obviously and the U.S turkey relationship but bottom line is the release of pastor Brunson or good development a breakthrough in us Turkish relations\nIt should be an improvement that the question is how much I mean this has been a high profile issue for the Trump Administration is very important to evangelical Christians in the U.S they tend to support Trump\nAnd we should mention that Brunson is an evangelical pastor that says that's the church that he was running and turkey\nYeah absolutely and so that is the key for the American side of the equation on the Turkish side of the equation\nThey now expect these us sanctions that were put on recently to be lifted but will for instance a Washington continue delivering at thirty five fighter jets to turkey will lay re raised this issue of extra dieting the cleric for to Glenn I mean and there's other problems in the relationship this was far from the only one Syria and other things\nPossible murder of a Saudi journalist at the consulate of Saudi Arabia here and just tumbles taking up a lot of attention at the moment\nThe Jamal ... that we've been tracking all of us this week\nDid you mark a showcase right and I think turkey will at least be relieved to have this Andrew Brunson issue off the table\nThanks Peter You're welcome That's NPR's Peter Kenyon reporting from Istanbul\nW E essay supported by said Edmunds academy or co educational independent school in squirrel hill dedicated to serving the cognitive social had emotional needs of students in preschool through eighth grade\nInformation sessions are October November December eighth and December thirteenth registration at us to add ... dot net\nSupport for NPR comes from the station and from the log me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\nFrom exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard test dot com and from the listeners support this NPR station\nNews from around the world and your own backyard from NPR and W. E. essay you listen so please support us now during our fault membership drive you can give on line ... W E s said that ... or you can call for one to six nine seven to nine five five\nAnd Kathleen Davis W E essays general assignment reporter and I'm here with John sudden our general manager\nThank you share on Tom in Pittsburgh for your contribution getting a little closer to our goal we're down to eleven contributions to go that's pretty good we're we're making good progress here we appreciate hearing from you and again these goals are so very important and one of the reasons are in ...\nFree to pursue the re to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nYou e essays general assignment reporter and I'm here with John sudden our general manager\nAnd thank you share on Tom in Pittsburgh for your contribution getting us a little closer to our goal we're down to eleven contributions to go that's pretty good we're we're making good progress here we appreciate hearing from you and again these goals are so very important\nAnd one of the reasons that are important is because W E s say compared to his public radio peers stations around the country does about eight fewer days of on air fundraising we try to get the work done quickly that we can get back to the regular programming\nIf you appreciate the fact that we're trying to bring you more news and less on air fundraising will help us meet the goals that's a big part of it for one to six nine seven twenty nine fifty five W. E. S. A. dot FM\nAnd first time members are really important those of you who have never given before because W E essay is a grassroots organization some of our money comes from the federal government but it's the financial support from listeners of five to ten dollars per month that add up the most important portion of our operating budget\nPlease help us Stay on the air and you can do that by calling for one to six nine seven to nine five five or you can give online at W. E. S. say ... ... ...\nWhen you listen to W. E. essay you stand with the facts you stand for clarity you stand for a free press you stand for reason all great reasons to support NPR on W. E. S. A. right now please become a sustaining members started five bucks a month maybe you can join a hundred dollar a month club some very good benefits to that two\nFor one to six nine seven twenty nine fifty five O W E S H ...\nOne thing we've been seeing a lot this membership drive is that some W E essay listeners are choosing to joined us to stay in her plan at thirty dollars a month\nIt reflects the importance of having W E s stay at home in a car on weekends and on weekdays killed\nIf W E s a as part of your daily routine please consider giving thirty dollars a month about one dollar a day for the value you received from W E s say you can give now at W. E. S. said ... or ... for one to six nine seven to nine five fights\nAnd you need to correct facts you need complete facts and and you need to correct logical process NPR tends to lead the logical process up to you once you have the information they're also good on their fact\nChecking mindless sustaining member because recording of that nature\nComplete facts document to correct the fact is essential to my own decision making throughout the day\nHi I'm Steve snow back from reaching square please join me as a sustaining number so we can continue to be informed visit W you know say sought some thank you\nAnd when you're there and make a contribution now you can also call for one to six nine seven twenty nine fifty five looking for eleven contributions between now and five o'clock\nTo meet our goal if you give seven fifty a month or more today we also have a really special offer which is we can get you a one year subscription to food and wine magazine you love food maybe you love wine or you're interested in learning about wine it's a really great magazine to have a laying around to kind of just\nA give yourself a break from the news and learn something new so you get NPR News and everything from W E essay\nPlus a little bit more to stimulate your thinking and provide some enjoyment give seven fifty a month or more we will send you an annual subscription set you up for that annual subscription to food and wine for one to six nine seven twenty nine fifty five W E S H ... FM\nFried ... free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nNews and everything from W E essay plus a little bit more to stimulate your thinking and provide some enjoyment give seven fifty a month or more we will send you an annual subscription set you up for that annual subscription to food and wine for one to six nine seven twenty nine fifty five W. E. S. A. dot FM\nThink what we could say is they really don't seem to care if they're caught the Russians just deny deny deny\nWhat we could say is they really don't seem to care if they're caught the Russians just deny deny deny on there's no indication that they're they're stopping these kinds of actions\nBut what is the U.S trying to do to stop these kinds of actions and we keep hearing about indictments for example against Jerry you officers\nThat's right the indictments against you argue officers are seven were announced last week twelve from the Mueller investigation in July [noise]\nUm so there is this naming and shaming and providing details that level we really haven't seen previously now one of the interesting developments is how to respond or two months ago President Trump has signed a directive\nThat would streamline the ability of a U.S agencies to to take action so this is something to look forward to do to see if this deters the Russians in any way\n... thank you thank you\nIt's all things considered on Ninety point five W E s say good afternoon I'm Christopher ears Pennsylvania is forty fourth district is comprised of neighborhoods north and west of Pittsburgh including moon township in some prosperous Ohio Valley community for the last Fifteen Years the district has\nBeen led by Republican Mark must you who has decided to retire it's Ninety point five W E essays Kathleen Davis reports to first time candidates running to take his seat [noise]\nIt's a sunny morning in the weekly and Democrat Michelle ... is out knocking on doors\nShe's come to the home of Cindy nights and her one eye dog meat so and so I Want to work on education and state level of ethics that's that's a priority for me for sure is that a former teacher who worked with Pittsburgh public schools and also used to be an Avon worth school board member\nNo strong union support and she'd secured the party nomination after running unopposed in the may primary no currently works with very small children from birth to three years old who have developmental delays or disability she spends time with children and their parents to get them ready for preschool\nShe thinks her role as an educator will be a strength\nShe says she has helped families deal with challenges such as learning disabilities poverty and substance to\nWe have very few educators in Harrisburg right now\nHad some legislation where the general assembly talks about taking six days from teachers they've talked about arming teachers Novak putting a severance tax on natural gas drilling that would help us fund our school and I'm more sensible way than we are right now it would make up for any funding gap that we have\nA few days later Republican Valerie ... says that in ... park in the weekly\nShe's grabbing a cup of coffee with a group of older voters four of the sex our military veterans\nAre asking data about her stances on various issues she often criticizes both parties as as a district where Democrats slightly out a number of Republicans and get us herself has given financially to Democrats in the past but she is fairly conservative on hot button issues such as abortion and the second amendment\nAnd when I talked to folks people don't mind paying taxes they want to know where their taxes are going and that's where I think that both parties in my opinion about that a very good job at a at a officially while\nNo ... thirty five year history in the district to get us left Pennsylvania in the early Nineteen nineties to start an investment firm in Maryland get us says she traveled frequently for her job at the moved back to Pennsylvania in twenty ten\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nI think that both parties and you have a very good job at a at a officially abilities while\n... thirty five year history in the district gate us left Pennsylvania in the early Nineteen nineties to start an investment firm in Maryland gate us says she travels frequently for her job and moved back to Pennsylvania in twenty ten she still owns a home in Baltimore which property records identify as her primary address\nKato says that information is out of date it lets her late husband as a co owner\nAllegheny county voting records show that she consistently votes locally ghetto says she left Pennsylvania and the first place because the state lax tax incentives first start up businesses if she wins the seed she wants to help change that\nI Would love to bring a lot of those things that are working in other states and bring them here to Pennsylvania I Know how Pennsylvania can do better\nKato says she moved back to Pennsylvania in twenty ten she doesn't support or oppose adding a severance tax to natural gas extraction she says it's a complicated issue because Pennsylvania is the only state with an impact fee on the industry\nDo I believe that the oil and gas companies should pay their fair share absolutely the question is how you calculate that fair share and who's making that decision and that seems to be where we need as both sides need to come to the table and not just demonized any particular industry because this industry has bought a lot of jobs to this community\nGate us also supports drinking Pennsylvania's legislature and adding term limits to lawmakers\nThese jobs were never meant to be a career as I said I've I've had my career on now to my opportunity to to give back\nGate squeak through the Republican primary winning by twenty six votes in a four way race no matter who wins on November sex house district forty four will be represented by a woman for the first time but one area where both candidates agree is that this shouldn't be as notable as it is\nKathleen Davis Ninety point five W E s a news this is the W\nE S safe fall membership drive as he noncommercial nonprofit radio station we rely on listeners like you for the most important part part of our income\nPlease help pay for your future W E essay listening by giving now at for one to six Ninety seven to nine five five or online at W. E. S. A. dot FM I'm Kathleen Davis W E essays general assignment reporter and I'm here with John Button\nAnd a ... I Want to just comment on this report because obviously you heard Kathleen and she is here as a part of the pledge drive today right now and all that goes into putting together a report like that it after the initial report was written there had to be some updates to the report those updates were made they were fact checked\nThis is a very thorough report before it ever got to your ears and then when something a new develop that we require to change it was change we're committed to that level of excellence when we bring you the news and we're asking you to support that right now it for one to six nine seven twenty nine fifty five or on line with W E S H ...\nJohn we want to thank a few people who have given in this hour you have Rebecca in Pittsburgh we have Henry in Pittsburgh or in Swiss home park who says fine alright already I'll donate thank you Henry we rely on listeners like you\nTo fund our station we also have a donation from moon township thank you everyone for donating and you can join Rebecca and Henry and are anonymous donors ... W E s said at FM or at for one to six nine seven to nine five five\nFor eight more contributions and the next Fifteen minutes to stay on track here and all things considered before you get on with the weekend please get on the phone and make a contribution or on our website W E S H\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News that the sound of a free press\n... thank you everyone for donating and you can join Rebecca and Henry and are anonymous donors at W. E. S. said at FM or at for one to six nine seven to nine five five\nFor eight more contributions and the next Fifteen minutes to stay on track here and all things considered before you get on with the weekend please get on the phone and make a contribution or on our website W E essay dot FM and make a contribution and if you've never given before\nWe understand ah we we've heard from people that sometimes it takes a couple of years sometimes more than a couple of years to get around to making that contribution and sometimes it's because you don't have the money or you don't realize that you're relying on the station as much as you do but please know that somebody else\nHas been through this with you or like you before that and then they made that step from listener to listen to a contributor so you could discover public radio now we're asking you to pay it forward\nYou rely on us pay for your own listening but also make it possible for other people to just to discover this quality journalism that it's getting harder and harder to find for one to six nine seven twenty nine fifty five W. E. S. A. dot FM\nIf you want to support W E essay every year but maybe you occasionally forget to send in your check\nThe easiest way to give it to switch to a monthly sustaining membership that's when you set up a small monthly deduction from your checking account or you can make it ever occurring charge on your credit card your membership is always active until you tell us to change it or to stop it\nAnd that's it you're constantly doing your part to keep yourself informed and entertained to sign up now as a sustaining member ... W E S H ... or ... for one to six nine seven to nine five five\nHigh ... I came to public radio after I had quit being a lawyer I was on a quest to find a job that would tap into the parts of myself that I liked and along came this thing public radio where what matters is your ability to connect with others\nTo be empathetic to be a really good listener what public radio has taught me is that\nEveryone has a story to tell if you just led curiosity guy and I am so grateful that curiosity guided me here to NPR where new voices and different lived experiences\nAre valued none of this would be possible without listeners like you who invest in careful reporting in learning in stories that need our curiosity public radio gives all of us so much here's how you can get back [noise]\nYou go on line to W E S H ... and you click on donate you fill out the form takes very little time and then you've done your parts or you can call us at for one to six nine seven twenty nine fifty five\nEither way takes just a couple of minutes and then you're on your way and if it's a sustaining membership which we prefer if you can you don't have to do it again you've taken care of it until you need to change it or stop it we make it that easy\nFor one to six nine seven twenty nine fifty five W E S H ...\nAnd with a sustaining membership you can set up your membership similar to the same way you pay other bills like maybe your utilities maybe your car insurance or cable but the best part is we don't tell you how much to give you get to decide that\nAnd you can start with five dollars a month maybe ten or Fifteen dollars a month is in your budget\nIt takes just a few minutes to set up and when you do will keep you informed and entertained for as long as you like for for less than some of the other bills that you might have to pay and you can give now at W. E. S. A. dot ... or on the phone for one to six nine seven to nine five five\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nTen or Fifteen dollars a month is in your budget it takes just a few minutes to set up and when you do will keep you informed and entertain for as long as you like for for less than some of the other bills that you might have to pay and you can give now at W. E. S. said that FM or on the phone for one to six nine seven to nine five five\nSo before the day is out today and the day in this case is seven o'clock when the fundraising is over you can make a contribution of seven fifty a month or more and we will thank you with food and wine magazine a year's worth of food and wine magazines the thank you give special\nMake that contribution now it for one to six nine seven twenty nine fifty five looking for four and more people here and just the next two minutes it's an important goal before we get onto the weekend help us pay for the news that you're going to use in the months ahead W E essay dot FM for one to six nine seven twenty nine fifty five\nSo many of our listeners have signed up to W. E. essay on our monthly sustain or plan you pay a small amount each month on your credit card or haven't deducted from your checking account\nIt's similar to how you pay for cable or or any of the other bills that you pay it just takes a couple of minutes to set up and that monthly contribution will become stories and programs that you'll listen to in the months and years to come\nGive now at W. E. S. said that ... or ... for one to six Ninety seven to nine five five\nToday only and only until seven o'clock give seven fifty a month or more we'll thank you it's the subscription\nFor a year to food and wine magazine special little partnership we have with them and uh it's a it's going to go away at seven o'clock this evening seven fifty a month Ninety dollars so it's a less than a hundred dollar a pledge supporting the station and a big way as a monthly sustain her\nAnd will set you up to pick your curiosity satisfy your interest about food\nAnd wine for one to six nine seven twenty nine fifty five W E S H ... FM\nListeners support accounts for almost half of the funding on W E s age I mentioned this earlier your donation is an investment in programs that you enjoy you decide the amounts whatever as comfortable for you and said best in your budget for some people it's ten dollars a month we also have our leadership circle which is a gift of one hundred dollars a month\nAnd your support has a really big impact and it helps fund the programs that you love you can give now W E S H ... than the phone number is for one to six nine seven to nine five five once again W. E. essay data fan or for one to six Ninety seven to nine five five thank you\nW E s a is supported by oil and ... in celebration of attempts anniversary of dining restaurant in one bar\nChef owner Sonia ... presents a daily changing menu of salads small place and soon crust pizza from sustainable ingredients information is available that dynamic hyphen P. G. H. dot com\nLive from NPR News in Washington I'm jak sphere\nAs oil and gas workers began returning to platforms in the Gulf the job of assessing the damage along the Florida Panhandle after hurricane Michael continues some Gulf Coast communities just a matter of twenty miles appears to have made a major difference\nNPR's Greg Allen described to where it was that appear to sustain slightly less damage but it's still cleaning up after the storm\nWe visited Appalachian coal in East Point to communities that are the heart of Florida seafood industry there are a little bit east of where the storm made landfall they didn't get as much when some of these other communities what they saw was a massive storm surge that came in and push buildings\nBought off their foundations destroyed many and did a lot of damage there and to some buildings that are really the heart of waste ringing and other fishing in Florida meanwhile a short distance\nScreaming on W.\nE. N. appointed by Carnegie Mellon university integrated innovation detail on a master's program\nAt the end you dot edu slashed I I I\nSee food industry there are a little bit east of where the storm made landfall they didn't get as much when some of these other communities what they saw was a massive storm surge that came in and push buildings bought off their foundations destroyed many and did a lot of damage there and to some buildings that are really at the heart of waste ringing and other fishing in Florida\nMeanwhile a short distance away in the town of Mexico beach where Michael made landfall as a category Ford store and the damage is immense President Trump will visit some of the hard hit areas next week\nThe FBI is looking at a major security breach at Facebook the attack was detected in late September but the FBI is a social media platform not to disclose the suspects or NPR Jasmine Garsd hackers\nInitially stole access to four hundred thousand accounts then the hackers topped those users friends' lists snowballing the tall took thirty million Facebook users who's information has been compromised emails phone numbers and recent search history were exposed\nGuy Rosen overseas safety and security for Facebook he says\nWe have a tool in our health center that people can now use to see whether they were affected what information may have an access\nThat tool is not easy to find a better back to a Web search for Facebook newsroom Jasmine Garsd NPR News New York\nMedicare announced today premiums for its part the plan will go up next year they'll buy relatively small amount Medicare officials say retirees will see the premium rise by a dollar fifty a month with the standard premium costs about a hundred and thirty five fifty a month\nSocks finished a wobbly week with games though not enough to make up the five percent lost the markets abstain during a big two day downturn some analysts appear to be brushing aside the wild market dry rations do White House economic adviser Larry Kudlow telling reporters they thought the first time the market has had ups and downs corrections\nCome and go I've been around a while they come and go ah\nThe policy is put into place by just administration have delivered an economic boom that virtually everybody thought would be impossible\nAlthough pointing to job creation was brought down the unemployment rate along with wage gains he says a rising faster at the lower and middle end of the scale than at the top\nChecking the numbers on Wall street today the Dow closed up two hundred and eighty seven points to twenty five thousand three thirty nine the NASDAQ was up a hundred and sixty seven points this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nW E essay is funded primarily by listeners and that's why your sustaining membership during the fall membership drive is essential please give now by calling for one to six nine seven to nine five five or sign up online at W. E. S. said that offend and Kathleen Davis here with John\nAnd thank you to everybody who called in and helped us get close to our goal we just came up a wee bit shy but we thank you for coming in and uh and trying to help us do that new our new goal was we're wrapping up fundraising for the day today we're looking to raise a total of\nTwenty five hundred dollars in this hour and again we set these goals in such a way that we can do the least amount of fun on air fundraising as possible you're raising money and getting the sustain is we need to keep the station going twenty five hundred dollars\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free friends\nComing in and uh and trying to help us do that new our new goal was we're wrapping up fundraising for the day to day we're looking to raise a total of twenty five hundred dollars in this hour and again we set these goals\nIn such a way that we can do the least amount of fun on air fundraising as possible you're raising money and getting this sustain is we need to keep the station going twenty five hundred dollars between now and six o'clock can you help out please\nFor one to six nine seven to nine five five\nTo think about it you get to listen for free to get what you give or to get you to give rather we have to put on the best programs every day\nWe have to pay attention to what you're interested in hearing and we have to transform W E s safe from just another radio station into your radio station\nAnd now that we have it's time to sign up as a sustaining member you can call now at for one to six nine seven to nine five five or you can get on line ... W E s said that FM\nGive seven fifty a month before seven o'clock this evening and we will thank you with an annual subscription and one of your subscription to food and wine magazine special offer today only so you you pick your curiosity with the news and satisfied with the news you learn about food and wine when you're not listening to the radio\nFor one to six nine seven to nine five five W. E. S. A. dot FM\nThat's for one to six nine seven twenty nine fifty five on line W E s aid on FM\nW E s a it was supported by Duquesne University with recently added master's degree programs this year in biomedical engineering higher education administration and supply chain management more information is available it do you cue dot E. D. U. slash new programs\nFrom NPR News this is all things considered ... Chang and I'm Mary Louise Kelly search and rescue teams are out in force along the Florida Panhandle they are looking for survivors of Hurricane Matthew\nWhich is now being blamed for at least eleven deaths one of the towns along Florida's Gulf Coast that was puzzled by the hurricane is Panama City\nEmergency crews there are working to clear down trees and to breathe the city is still without water without power and there is no time table for when those services might be restored NPR's Joel Rose reports\nThe roof of the St Andrews United Methodist church is still in place at the pews are still there but we're the back wall should be there is only blue sky\nWe're all in our little safe rooms one of my members them around and looked in a search word and ... and just said job search where it's gone\nFaster John blonde with sheltering inside the church along with two dozen other people when the hurricane hit the wind ripped two of the walls away but blunt didn't even hear it because the storm was so loud blood says he's grateful that everyone in the building survived now he's looking ahead to this weekend\nWill have worst terrorist while Sunday somewhere and have a version of service they're playing the God of good\nAs we talk in what's left of the church a visitor arrives almost as if on cue\nFather Michael talking about I'm a write up here at St john's roof off Iraq facility is wonderful because we we didn't have that much damage\nFather Michael tug well says his church just a few blocks away came through the storm relatively unscathed but talk well knows that was the exception in Panama City\nThat is going to take years for this place to get re established\nAnd that was going to take months probably to get electricity back to help it doesn't take too long for water 'cause that's important cell phone\nService is sketchy there's no\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nHis church just a few blocks away came through the storm relatively unscathed but talk well knows that with the exception in Panama City\nIt is going to take years for this place to get re established\nAnd that was going to take months probably to get electricity back on Oprah doesn't take too long for water 'cause that's important cell phone\nService is sketchy there's no clear sense of wind power and water might be back on and the ... streets are still a tangle of fallen electrical wires twisted metal\nDown a tree [noise] it was a ... owns a landscape jak traveled\nHere to work cleaning up the mess what a storm like this there's really no where to start [noise] basically you just got to come in and whoever yelling out for help\n... is a terrific time to become a new member of this radio station because your contribution goes twice as much so no matter what you give your thinking maybe it doesn't make a difference won't make twice the difference because during the match\nCurrent donors will give us extra money to spend on all things considered and all the programs you hear when you give so please take advantage of the match by becoming a new member it if you can make that a sustaining membership\nFor one to six nine seven twenty nine fifty five O W E S H ...\nW E essay is commercial free and listener supported that means we're here because you want us here so this fund drive is an important reminder to do your part and make your contribution to radio you not only listen to the radio you believe in give now at for one to six Ninety seven to nine five five\nAnd thinks\nToday's programming is supported by the Washington symphony orchestra presenting scary music\nA night of musical fights complimented by a costume contest Saturday October thirteenth at eight PM had trinity high school in Washington PA tickets and details that wash ask why am dot org\nSupport for NPR comes from this station and from log men makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more Goto meeting dot com\n[noise] from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues\nTara data dot com and from the sustaining members of this NPR station from NPR\nNews this is all things considered I'm Mary Louise Kelly and I'm also Chang when the new NBA season tips off next week a relative newcomer is going to be hitting the court\nNot a player issue that's right the athletic Rand Paul Knight is stepping back into the basketball shoe business with an updated version of its Nineteen Seventy three classic collide\nThat was a shoe that was made famous by New York Knicks great walk Clyde Frasier and to hear all about this come back we're going to go to ESPN's Nick DiPaolo who covers the athletics you industry he joined us from Portland, Oregon hey good so why\nDon't want to get back into the basketball market now I mean it's been what Twenty years since there last basketball shoe at him\nSo they had it for him and it was very short list the orange one clear and been quarter and you'll go broke or if you're still there\nDreaming on W E n J imported by Carnegie Mellon university integrated innovation detail on a master's program at\nThe end you dot edu slash I I I\nHad said why don't want to get back into the basketball market now I mean it's been like Twenty years since there last basketball she wouldn't\nYeah so they had it for a in Nineteen Ninety eight and it was very short lived they sign just one clear and been quarter\nAnd yoga broker after two years and so they've been out the game for about Twenty years now but when I think when you look at basketball\nBasketball's always had these these elements of culture style and music that no other American Sport really has and so of course that's a big part of the appeal\nWhat's happening in with the players of today that are young and trend setting and exciting and also I think a big thing for them as as a branded as they look on to China and how they can make their mark their basketball's really a big gateway in terms of being a global brand as well\nBut how do they have now to get a big name behind him thinking like Nike and Adidas they were able to attract people like Michael Jordan and LeBron James is who may even in a position to be going after a name like that right now\nSo signing players is definitely one of the biggest hurdle for any newcomer yeah\nUm you know I I did a lot of research last year Nike had about sixty eight percent of the leak wearing their shoes last loud oh okay I step in and combat that is pretty tough but okay [laughter] yeah they do have they do have a huge budget an allowance for corporate standpoint and they signed\nSix the talk Fifteen draft picks this year along with it all started to an end to mark his cousin so\nYou know in terms of offers they've been extremely aggressive and that's that's a big part of how they are looking to make their imprint back\nHow big of a gamble is this for a company like you said the markets already pretty saturated is is a long shot to get back into the basketball she business\nIt's incredibly aggressive um the big the big hurdle and I guess the biggest thing that the detractors have been\nNot as high on his you know when you're signing a lot of rookies which they have\nIt's really tough to say how these guys will pan out man there's so many cases of guys that were drafted high that\nYou know we're bus that didn't pan out and so I think one thing they're really doing is is relying on social media she's gotten a chance to check out Pomona hoops on Instagram they are unlike any other brand and it's kind of wild wild west and they'll post whatever and it's very on corporate life but I think people have taken to that and man made a kind of fun\nYou said a lot about why is it more important in some ways how these players act off the court on social media when it comes to promoting issue brand name what they do on the court\nYeah that's a huge component of it I think you know as you look at all the steps in terms of high school kids they're watching less and less of a full through our game and they're really kind of immersing more and what these guys are doing away from the game and and they're seeing methods of highlights audience ... things like that but I looked it up the other day and out of the nine guys that poll assigned\nThey have six and a half million combined followers on Instagram so that's a huge nice as the brand of starting out you know I think the brand itself is only had a couple of hundred thousand followers and so\nThey're really lenient on their players accounts and ethical big part of their strategy with their shoes that\nThey don't want shoes that look just like a standard basketball shoe they're trying to create stuff that maybe has a little more lifestyle to it that guys can be showcasing in different ways on their own pages and so that's going to be a huge push for sure\n... covers the athletic she industry for ESPN tanks in my neck die [laughter]\n\nYou're listening to all things considered from NPR News\n... W E s they are on the radio today thanks to our listeners who gets that's how W E S H works the people who listen to it invest in it by making a country\nFree ... free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nYou're listening to all things considered from NPR News\nNPR ... W E s say are on the radio today thanks to our listeners who gets\nThat's how W E S H works the people who listen to it invest in it by making a contribution during the membership drive you can join in by becoming a sustaining member at W. E. S. said that FM or call for one to six nine seven to nine five five\nAnd Kathleen Davis W E essays general assignment reporter here with our general manager John ...\nAnd we are down to the last nine minutes of a dollar for dollar match that we have going on is the last match of the evening where you can get your gift doubled by current donors to the station so we're asking you to give ten dollars a month to get a hundred and twenty dollars and matching money\nThe rounded up to you but we're asking that you do it before you get on with your busy weekend get your gift doubled\nAgain the phone numbers for one to six nine seven to nine five five W E S H ...\nSo we know you're listening to W. E. essay right now but you're probably doing something else\nIt's probably a must do maybe you're driving home from work maybe you are cleaning up a little bit around the house or something you have to do every day\nAnd when we're not in the fun drive you make that time more valuable by listening to W. E. essay you learn about the world you meet interesting people you get the pleasure of having a meaningful moment during an otherwise dull time\nKeep making those meaningful moments with your support now you can give at for one to six Ninety seven to nine five five or online at W. E. S. said that I found\nAnd again we have a special offer today if you want to get a subscription or one year subscription to food and wine magazine while supporting the station this is the time to do at your gift as being doubled in the offer goes away it's seven o'clock and we've got this little arrangement where if you give seven fifty a month or more or Ninety dollars all at once\nWe will send you a a code you go online you register and put in your address and stuff and then they send you the magazine for a year it's really kinda cool very simple to do\nAs well and the special offers ends at seven o'clock this evening you get food and wine so you get to learn some great recipes get some food culture some food reporting learn about new winds\nKind of exciting 'cause your sports station you get this extra little benefit as well for one to six nine seven twenty nine fifty five that gift as match dollar for dollar also for about the next eight minutes W E S H ...\nThis is Ira Glass of this American Life and you hear these stretch commute them go chances are you have never donated to this public radio station and I think the reason why is because you think that we are talking to someone else and I just want to say we're not talking to somebody [laughter] we're talking to you look at yourself right\nYou are someone who sticks around and listens to the station even during the pledge drive\nWhat does that say about you look at your own behavior who argue who is the person who listens to the public radio station even when the pledge drive is going on this stuff I'm saying right now the here and come out of a radio it's not even interesting but yet you did not turn the station what does that say about you [noise]\nYou know they were actually trying to reach you personally\nIf I knew your name I Would say it right now\nAnd what we're asking you to do is an act of pure idealism\nBecause you can listen to the station for a while chances are you know rationally that you don't need to call you know the station is still going to exist and that's it\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nIf I knew your name I Would say it right now\nAnd what we're asking you to do is an act of pure ideal is\nDid you listen to the station for a while chances are you know rationally that you don't\nNeed to call you know the station is still going to exist and that's supposed to say that you're not supposed to say that during the Bush administration is going to be\nFine it's going to exist even if you don't call you know rationally because you have never called and we've all stayed on the air without you and so for you to call is an act of pure idealism you're doing it even though you don't have to do it which makes it even better and\nThe thing I Would say is that those of us who work here we're working here out of ideas were working here because we believe in the mission of his radio station\nAnd I just have to believe that if you're going to sound in my voice right now\nIf you listen all the time if you stick around during the pledge drive you have some small viewing of idealism about this radio station\nOften don't come forward right away and in fact the average age that a child comes forward to share their truth is when they turned fifty two fifty two and yet the law here in Pennsylvania says that we couldn't bring a criminal case after the age of fifty\nAnd so we believe and the data shows that if it's going to take that much time for someone\nTo come forward we shouldn't be barred from prosecuting\nWhat your officers report laid bare is how a large institution in this instance the Catholic Church but there are so many other examples how a large institution can go to great lengths to cover up sexual abuse and to protect abusers\nDoes reviving the statute of limitations get it that it actually increase the accountability internally at these institutions where\nYou hit the nail on the head so much of this is about an institution in this case the Catholic Church arguably the most powerful institution\nIn the world constantly and consistently putting its own reputation above the needs of the people they were there to serve in this case children I think there is our reckoning going on in this country right now about how we are going to or how much we are willing to\nHold powerful institutions accountable\nAnd I think you're seeing across this country with all that's going on but the me too movement and the Kavanaugh hearings and The Cosby trial is is you're seeing more and more people stepping up and being willing to hold powerful institutions accountable and law enforcement plays a unique in critical role in that process that's what we're doing here in Pennsylvania\nJosh Shapiro is Pennsylvania state attorney general thank you very much for joining us thank you\n[noise] some of the last secrets from the Watergate scandal may soon be revealed a federal judge in Washington has ordered the national archives to review key documents and prepare for their release\nThe papers helped to advance the impeachment effort aimed at president Richard Nixon and scholars say they are relevant today as another special counsel investigates the current administration NPR national justice correspondent Carrie Johnson reports\nA few years after the resignation of Richard Nixon the special prosecutor who investigated him recalled a critical moment in that probe moron laws for the basic said it which was the first in history\nDreaming on W. E. N. say it's supported by Carnegie Mellon university's integrated innovation Institute details on the master's program\nAt CMU dot edu flash I I I\nAs another special counsel investigates the current administration NPR national justice correspondent Carrie Johnson reports a few years after the resignation of Richard Nixon the special prosecutor who investigated him recalled a critical moment in that probe\n... exceeded which was first in history to get the courts to promote the grand jury report to go to the house Judiciary Committee because they promote it would have had real difficulty and doing it's worth ... haven't gotten all the borough\nLeon Jaworski told an interviewer in Nineteen Seventy seven the document contained in detail list of the evidence the Watergate prosecution team had gathered\nWe called a road map in our office because last dressed up\nFor forty four years that road map remained a secret under ... by the federal district court in Washington on orders of the judge who presided over the Watergate cases that secrecy persisted to protect the grand jury's work\nBut not for lack of trying in Nineteen Ninety seven Stephen ... was working for the independent counsel investigating President Bill Clinton base was looking for a precedent for how a special prosecutor might send an impeachment referrals to Congress\nThe national or higher let me see a lot of uh from the water that that was very interesting what what I asked you to load that was set up to the house I worse if\nSaid no Bates tried again years later but the answer was the same no last month he and others petition the court to release the Watergate roadmap their lawyer is Larry ...\nIs relevant historians it's relevant to the infringement ongoing interest in Watergate that alone would be sufficient to justify releasing this material but there's real urgency in this instance to getting the road map on to the public record\nUrgency because another special counsel is on the job now investigating the Trump campaign and one of the big questions about the end of Robert Mueller's investigation is whether he'll try to send to report to Congress or the public John sale worked on Watergate as a young lawyer\nOn twenty first century variation of the Silk Road is something that the team is likely considered\nSales boss on the Watergate team was James corals who now serves as mothers deputy\nBut he says unlike Richard Nixon Donald Trump's legal team is likely to object to any such material going to Congress Trump's personal lawyer Rudy Giuliani has already signaled he would fight in court to stop lawmakers from seeing that document\nMeanwhile the battle over the Watergate roadmap could soon come to an end this week judge barrel how ordered the national archives to review it and directed the Justice Department to get ready for its release Carrie Johnson NPR News Washington [noise]\n[noise] [noise]\n[noise]\nThis is NPR News\nExpanding your horizons and deepening your understanding of the world\nTo reasons you tune into W E essay and two good reasons to give to W E s said during our fall membership drive\nPlease sign up as a sustaining member on line at W. E. essay that FM or call for one to six nine seven to nine five five I'm Kathleen Davis W E essays general assignment reporter here with our general manager Johnson\nLooking or a six hundred dollars that's all that's left or our goal for this hour or six hundred\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nSustaining member on line that W E S H ... or call for one to six nine seven to nine five five I'm Kathleen Davis W E essays general assignment reporter here with our general manager Johnson\nLooking or a six hundred dollars that's all that's left or our goal for this hour six hundred dollars in the next sixteen minutes we're doing great\nAnd if you've already given thank you so much if not you can be a part of something pretty special which is keeping NPR News and W E s a news and all these great public radio programs on the radio and available to all whether they can afford to give or not it's a great community service we become stewards of the public airwaves together\nTo make sure that there's an informed public but plus some fun programs to listen to on the weekend please help us meet the goal now six hundred dollars by six o'clock for one to six nine seven twenty nine fifty five O W E S H ... FM\nWe spend a lot of time during or fund drives telling you how your dollars help pay for the news and entertainment programs\nIt's important for you to know where your money is going but ultimately what you're really paying for is a more interesting commute to and from work\nA lot of laughs on Saturday and more thoughtful Sunday Morning that's the real value of listening to W E s say what you hear it turns your daily routine and two time well spent you can give now at for one to six nine seven to nine five five or online at W. E. S. said that I find\nThat we have a special offers going up until six o'clock this evening if you like food if you like wine where we have a magazine called food and wine that will make available as a thank you gift if you give seven fifty a month or more\nIt's available to date only during the membership driver hoping that you will take advantage of this and help us meet our goal this hour it's basically Ninety bucks for the year you're supporting the station and getting the magazine seven fifty a month and sustain are playing\nIn the deal goes away at seven o'clock W TSA dot FM or for one to six nine seven twenty nine fifty five\nThank you to everyone who has given so far this hour special thanks to Parker in Oakland jak engrossed city\nJon Peters township Brianna in Greensburg we have a donor from ... who says the service you provide is more important than ever keep up the great work thank you so much for your donation and you can join them by calling for one to six nine seven to nine five five\nYou can give on line at W. E. S. said that FM\n... the local programming has been very important for me I'm a teacher and I actually use it in my classroom and I just changed an assignment in my composition class because I heard\nA program about how birds are becoming extinct in many cases and and and why and I changed writing assignment that they're going to start working on bird so I really am a family um Hi I'm sister radiation I live in the same town\nPlease join me in membership call for one to six nine seven to nine five five more visit W E s said God FM and thank you\nAnd please become a sustaining member if you can that is when you give monthly on your credit card or right out of your checking account\nAnd it really is a great way to give and you probably already know this but maybe didn't think about it in terms of supporting public radio because increasingly you're finding it very convenient to set up those automatic payments out of your checking account so you don't forget to pay something and uh\nAnd you don't have to go through the hassle of writing a check or logging on every time we can support the station exactly the same way and when you get that credit\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nIn terms of supporting public radio because increasingly you're finding it very convenient to set up those automatic payments out of your checking account so you don't forget to pay something and uh\nAnd you don't have to go through the hassle of writing a check or logging on every time we can support the station exactly the same way and when you get that credit card statement and you take a look at it and you're going to see this you know five dollars seven fifty ten dollars Fifteen bucks a month\nAnd you think about that in context of some of those other charges that are showing up at those levels here to see the value of public radio so please become a sustaining member now it for one to six nine seven twenty nine fifty five and it's really easy to sign up on line that's W E S H ...\nIt's also really easy to forget that W E s a is listener supported because all you have to do is push one button and there it is the programs that keep you informed and entertained in your home your car your headphones\nSo this membership drive as a reminder that W E S H is listener supported that button works because other listeners give money to W E s say we're asking you to become a new sustaining member by giving just five or ten dollars a month whatever is in your budget\nCall for one to six nine seven twenty nine fifty five give on line W E S H ... FM\nThis is Wu essay and Ninety point five W. S. A. H. D. one in Pittsburgh Pittsburgh NPR News station and we're asking you to support us and help us raise the last couple of hundred dollars needed to meet this hour's goal for one to six nine seven twenty nine fifty five\nSo we love hearing listeners tell us that they grew up with NPR that was the case for me it was on at home or they heard it on their parents' car radio while riding in the backseat\nFortunately enough of those parents and grandparents supported public radio in the eighties and nineties so that it would be there for you when you choose to listen because he wanted to\nSo now it's your turn become a member for the listening you do now and we'll ask your kids sometime down the road to become a member as well\nYou can give to W. E. essay by calling for one to six nine seven to nine five five you can also give on line at W. E. essay data them keep W E s say your radio station of choice help us on the news that matters to you\nYou can call for one to six nine seven to nine five five or you can give on line\nAt W. E. essay data them once again that phone number for one to six nine seven to nine five five on line at W. E. essay that FSN and thank you for your support\nToday's programming is supported by women for a healthy environment presenting the third annual healthy school summit friday October twenty six topics we'll focus on air quality in schools mold and lead in drinking water open to the public more information and registration at healthy schools P. A. dot org\nPittsburgh NPR News station streaming at W. E. S. A. dot FM [noise] this is Ninety point five FM W E s a Pittsburgh Ninety three offended I mean you know to to Eighteen Baltimore one hundred and twenty five of them W to six three and a W Johnstown and one of four point one I found\nOver you to a one page leading airing SARS Ninety point five HD one just for that spurred our news stations dreaming at W. E. S. A. dot FM\nRead it for free to explore we're Ninety forty five ... W E essay Pittsburgh NPR News the sound of a free friends\nThan any Eighteen you about\nOne hundred and twenty five ... W to six three hey W\nJohnstown and one of the four point one form of you to eight one age league in the air and SARS Ninety point five HD one first Pittsburgh NPR News stations dreaming at that he has said that ...\nLive from NPR News in Washington I'm ...\nWhy is it in Donald Trump says he will visit Florida and Georgia next week to assess the damage from hurricane Michael the powerful category for storm made landfall in the Florida Panhandle earlier this week causing massive damage there before moving inland and dumping heavy rains on Georgia the Carolinas and Virginia\n... owns a Mexican bakery in Panama City he says it's Fifteen year businesses gone it's\nIn the stomach and your heart you know they uh you know your second home as I say you know\nIs is there so I'm also caused major damage in Mexico beach in Port saint Joe the storm surge smashed through blowing out windows in brick walls just twenty miles away and the town of apple logic cola Stuart nineteenth century homes were largely untouched\nAnytime in Virginia flash flooding and several suspected tornadoes from hurricane Michael are blamed for five deaths they've inside Dell from member station WBFO in Roanoke reports the storm also cut off power to hundreds of thousands\nVirginia's department of emergency management says four people died and flash flooding set off by the remnants of hurricane Michael Thursday\nA firefighter in the Richmond area was also killed when a tractor trailer rear ended his fire truck crash seen\nNumerous roads were still flooded friday morning and others are damaged many schools are closed for the day the storm also brought down trees and power lines overnight utility companies say it may take several days to restore power to more than half a million customers for NPR News I'm David Sydell in Roanoke, Virginia\nAll told the death toll from Michael is not risen to more than a dozen and there's likely to go higher\nPennsylvania's top prosecutor is calling for changes to state law that would allow victims of clergy sex abuse to pursue decades old cases in court\nBobby Allyn of member station WHYY as more of the latest move from the state attorney general oversaw a sweeping grand jury report of sexual abuse and cover ups and the Roman Catholic Church\nIn Pennsylvania victims of sexual abuse have two years to file a civil lawsuit against an abuser state attorney general Josh Shapiro says he doesn't understand how lawmakers can lead the damning August report and not want to change that law\nA grand jury revealed decades of abuse and cover ups involving three hundred priests and more than a thousand child victims attorney general Shapiro told NPR's all things considered at the time bars gotten the way up the case\nIf we lived in another jurisdiction where there was no criminal statute of limitations I Would have charged every single one of them who is living\nThe Catholic conference has oppose lifting time limits on sex abuse claims saying it could bankrupt the church for NPR News I'm Bobby Allyn in Philadelphia\nDespite some recent remarks by President Trump that have been critical of the Federal Reserve is treasury secretary says the president respects the independence of the interest rate setting body charges secretary Steven Mnuchin saying Trump's comments including what he said about the fed recently so he favors low interest rates on Wall street that I was up two hundred and eighty seven points this is NPR\n\nFor NPR comments from NPR stations other contributors include the Robert Wood Johnson Foundation working alongside others to build a culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more it\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nWhen points this is NPR\nSupport for NPR comments from NPR stations other contributors include the Robert Wood Johnson Foundation working alongside others to build a culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. R. dot ORG\nNews from around the world and your own backyard from NPR and W. E. essay you listen so please support us now during our fall membership drive you can give on line at W. E. S. said that FM or call for one to six nine seven to nine five five\nI'm Kathleen Davis W E essays general assignment reporter here with our general manager Josh johnson\nAnd there is a challenge in effect right now getting ... ah twenty contributions by the time we're done fundraising for the day at a seven o'clock and if we do that we get a thousand dollar contribution from B. J. and Jeff labor and this is a great opportunity\nFor you to help us learn another thousand dollars that we can spend on your behalf that we can put right back to work for you in all things considered\nGoal is twenty contributions by seven o'clock that gives us fifty five minutes please let yours be the first it for one to six nine seven twenty nine fifty five or online at W. E. S. A. dot FM\nThank you to everybody who has donated over the last hour\nWe want to extend to special thank you to Hillary in Pittsburgh and Robert in get Sonia thank you so much for your contributions every little bit helps you can join at W E S H ... or call for one to six nine seven to nine five five\nToday only and only until seven o'clock if you give seven fifty a month or more we will thank you with a year's worth of food and wine magazine along with your support of the radio station so please take just a couple of minutes right now and again this offer goes away at seven o'clock\nYou can become a sustaining member seven fifty a month or more we'll send this is our thank you give give Ninety dollars all at once and you'll be one of the twenty people that were looking for to earn the challenge so while the news is on give a W E essay dot FM and thanks for your support\nW E s I supported by the Fritz Pittsburgh presented usability divorce grow fashioning ordered from paper\nLook contemporary art exhibition features life size resolutions of historic clothing created completely from paper openings Saturday October thirteenth African art museum details as a fringe Pittsburgh do to work\nFrom NPR News this is all things considered I'm Mary Louise Kelly and I also Chang Brett Kavanaugh is now justice capping off but the fallout from the bitter and divisive battle over his confirmation is still defining political conversation\nWhen Kavanaugh was sworn in President Trump apologized to the new justice for the rough confirmation process he had to go through\nThose who stepped forward to serve our country deserve a fair and dignified evaluation not a campaign of political and personal destruction based on lies and deception\nWhat happened to the capital of family violates every notion of fairness decency and due process\nNow how that confirmation battle will ripple out into the mid term elections is one of the things we'll be talking about in our regular week in politics segment students to do that I Am joined by Karen ... of the Washington Post and David Brooks at the New York times thanks to both of you for coming in today will be here\nSo turn that bit of tape we just heard from President Trump talking about political and personal destruction that's how some Republicans\nDreaming on W. E. N. say it's supported by Carnegie Mellon university's integrated innovation Institute details on the master's program\nAt CMU dot edu flash I I I\nGuess we'll be talking about in our regular week in politics segment do you do to do that I enjoy by Karen ... the of the Washington Post and David Brooks at the New York times thanks to both of you for coming in today the greater to be here\nSo turn that bit of tape we just heard from President Trump talking about political and personal destruction that's how some Republicans have been characterizing the opposition to Kavanaugh but\nAnother way they been describing the people who've turned out to protest his by using the word mob by calling the angry left mob like Senate majority leader Mitch McConnell has that the Senate Senator Marco Rubio of Florida Senator Chuck Grassley of Iowa\nWhat we have or is the resist that has existed since the day after the November sixty twenty six the New Yorker is centered right here on Capitol Hill they\nHave encouraged mob\nRule mob rule can was some sort of coordinated strategy this week I think several Republican to just happen to choose the word mob\nWell I think they've decided this is a good talking point of course it wasn't all that long ago that the sound of a you know angry protesters was actually music to Republican airs back when it was the Tea Party\nProtestors who were making it impossible for members of Congress to go to their own town hall without a police escort and of course we have a president in the in the White House who has on a regular basis encouraged people at his own rallies to inflict violence on on protesters there\nTen or Fifteen minutes that would be great would put us in a position to earn the challenge for one to six nine seven to nine five five\nMaybe you're new to the area and you just discovered W E essay is so welcome we're a public radio station and we rely on listener contributions for the most important source of funding if you like what you hear then please consider a signing up as a new sustaining member at just five dollars a month\nAnd that monthly contribution joined with other members will go a long way to pay for the many hours of listening that you'll do you can call now at for one to six nine seven to nine five five or you can give on line W E essay dot edu and\nW. E. S. A. is supported by Pennsylvania winds October is PA one month celebrating Pennsylvania's locally grown and crafted winds with special things to do taste and discover across the state profiles tasting tips and defense or billable at P. A. Y. month dot com\nSupport for NPR comes from the station and from log me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\nFrom exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information\nAt color guard test dot com and from the listeners who support this NPR station\nThis is all things considered from NPR News I'm also Chang and I'm Mary Louise Kelly Mad Men creator Matthew Weiner is back with a new series for Amazon called the ...\nDreaming on W. E. N. say it's imported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nShould I call a guard test dot com and from the listeners should support That's NPR station this is all things considered from NPR News I'm also Chang and I'm Mary Louise Kelly Mad Men creator Matthew Weiner is back with a new series for\nAmazon called the Romanoff it is an anthology Syria's different cast different story and each episode\nBut NPR TV critic Eric Deggans says the series rarely matches the heady ambition of its creator\nEpisodes of the Romanoff that I've seen film like a collection of creative ... aimless indie films linked by single then premise at least one person in each episode thinks they're related to the ... the last royal family the rules on Russia and that connection has seriously messed up their heads\nTaken the ... an aged ailing woman in Paris played by Martha Keller who's cared for by her American nephew Greg played by Aaron Eckhart ... racist classes then demanding reacting predictably when a Muslim woman is sent to workers are home health care aide I made\nA cat if I'm not always\nThey emailed me or references she's educated she studied the nurse you know CPR first day she the best caregiver they have any you are by far the worst client\nHope to see whether when she grows up my apartment\nAnd this could claims of family connection to the Roma knobs lamenting the humble end of our once proud family line graduates are only relative left struggling with the caustic French girl friend who just wants to know what's going to die so they can have her opulent massive apartment in Paris all themselves\nShe might seem [noise] why does Haiti\nNeed to be sent they need to be washed kind to me and I think keeps you from going in this case um eating in restaurants so what's\nThe terrible French girlfriend doesn't want a baby nice Muslim caretaker shows up nicely American nephew likes or\nBy the middle of this nearly Ninety minute episode you can guess where the story's going which is a serious problem but that doesn't compare to how contrived things get in another episode called the royal weak\nIn this story Corey stole is a sad sack has been in therapy with his wife played by Kerry bus Shea who wonders why he never wants to do anything with her\nI don't care what we do\nI Would do anything you want\nBut you do care because you make the decisions what I Do with my spare time how many hours I work I went to ...\nThe business is both of ours okay but we both know that you're the boss employee id will only say that is true Shelley we try not to say people always say anything\nRight except he does kind of always blame her which causes issues in his job helping students prepare for standardized test when he confronts a not too bright kid who is fixated on getting into Harvard\nYou have to accept the reality and try to be happy and his\nWhatever you get ill listening age or the big secret\nNobody's happy I just came to protest perhaps\nEventually those character meets another woman he would very much like to spend time with during jury duty this story has an awful ending which mostly leaves you wondering why was forced to spend so much time with the Supreme Leon likeable people\nMatthew Weiner wrote and directed every episode of the Romanoff filming and beautiful locations across the globe there's also an ace cast with names like Diane\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt CMU dot edu flash I I I\nJury duty the story has an awful ending which mostly leaves you wondering why was forced to spend so much time with the Supreme Leon likeable people\nMatthew Weiner wrote and directed every episode of the Romanoff filming and beautiful locations across the globe there's also a cast with names like Diane Lane Christina Hendricks and Catherine ha but one or who may deplorable people so compelling on Mad Men and as a writer for the Sopranos\nCan't manage the same trick here\nCritics were only given three episodes in advance so it's possible the series gets better but so far the Romanoff feels\nLike a glitzy showcase for mediocre stories with a tenuous connection to each other it's a disappointing second act and the guy who created one of the best promises this [noise]\n\nThis is all things considered from NPR News and we count on listeners like you for the money needed to pay for the news reports analysis and discussion you depend on every day\nThat those are full membership drive and we're asking you to do your part to become a sustaining member you can give on line ... W E s said that FM or over the phone for one to six nine seven to nine five five I'm Kathleen Davis here with John setting\nAnd we have a challenge for leadership circle members DJ and Jeff Weber and you know what they're helping us get this friday wrapped up great third day of ... of the membership drive\nAnd we're done fundraising for the day at seven o'clock if we can get Fifteen more contributions BGN Jeff liberal they'll give us an additional one thousand dollars to invest in the news that's the challenge getting to our goal which is Fifteen more folks by seven or seven o'clock so thirty five minutes from now\nWe get we get an extra thousand bucks now and we give counts towards this challenge sustaining gifts new member contributions joining the hundred dollar per month club please make that contribution now for one to six nine seven twenty nine fifty five or online at W. E. S. A. dot FM\nThere's never a shortage of news and your contribution makes it possible for NPR and W E s said to cover the news and the way you expect and depend on it's expensive to put reporters in the field\nWhen you think about where news is happening and where it could happen next it's important to get as many listener contributions as possible so we can continue to bring you the important news of the day no matter where it is\nYou can give now at for one to six nine seven to nine five five or online at W. E. S. said that FM\nAnd again in for the next thirty four minutes if you give seven fifty a month and our sustain are playing you not only helping us or in the challenge will set you up with a year's subscription twelve issues once you each month the food and wine magazine great reason to take a couple of minutes and give now a little extra benefit\nW. E. S. A. dot FM for one to six nine seven to nine five five\nJohn mentioned earlier there is a challenge in effect right now\nAre getting twenty contributions by seven P. M. unlocks a one thousand dollar contribution from listeners BJ and Jeff lab or\nGive them now and your contribution will help us claim that one thousand dollars that we need it so that we can work to put it into providing you programming like all things considered the gold is twenty contributions right now we still have Fifteen to go\nAnd we have just over half an hour to unlock that challenge call for one to six nine seven to nine five five or give on line ... W E s said ...\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nDo providing you programming like all things considered the gold is twenty contributions right now we still have Fifteen to go and we have just over half an hour to unlock that challenge call for one to six nine seven to nine five five or give on line ... W E S H ...\nNPR brings you breaking news in depth analysis and conversations with context because you need to know what's going on\nI'm Audie Cornish and win dangerous weather threatens lives and property you look to us for updates and stories out of the affected communities whether it's yours fifty miles away or on the other side of the country's main street\nIn Ellicott City Maryland with less like a street than a raging river hundreds of thousands of acres of California land has been burned by the fires raging across the state Lopez lives in a small house at the edge of the dairy west of political capital\nMaria stripped his roof right on\nA storm can change lives and the teachers in just moments you listen for up to date coverage of what's happening and how you can help one way to do that is to support this reliable source of news and information here's how you can make sure your community safe up to date on storms near and far [noise]\nCall for one to six nine seven to nine five five the money you give keeps us NPR programming coming to you every day give on line at W. E. S. A. dot FM please consider giving monthly or monthly sustain her plan when you have something charge to your credit card five dollars seven fifty ten bucks a month to come right out of your checking account\nAutomatically news we can make it change a anytime you want if you need to stop it anytime you want we can do that too so standing membership the best way to support the station for one to six nine seven twenty nine fifty five", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Pittsburgh", "day": "12"}