{"month": "10", "state": "MA", "station": "WBSM", "content": "And it includes of course the meal entertainment many invitations have been sent out but they're afraid that maybe they didn't get to everybody so they've asked us here at the radio station to spread the word if you are\nAnd alumni of either the Waterman or pierce ville schools in Rochester you're having a reunion at twelve o'clock noon high noon October the seven\nAnd it's only twenty five dollars if you'd like to\nGo to your reunion [noise]\nThat's another reunion coming up\nWe're going to pause for the ... uh nine o'clock news and then we have our kitchen cabinet [noise]\nComing in and all of you chiefs fans my goodness gracious you're still undefeated [noise]\nFavored news talk stations will be boys\nGenes wanting to get them for streaming worldwide on the bill UPS and don't do you let them do it\nFrom anything new\nDepressed and about three hundred and fifty thousand workers at Amazon or in line for a raise the company announcing today everyone there will make at least Fifteen dollars an hour\nWith the jobless rate hovering around four percent nationwide employers realize they have to offer something special to attract new workers at online retailer Amazon\nWay evaluate the federal minimum wage to seven point five we think it's too low\nSays Amazon's senior VP of worldwide operations Dave Clark\nWe look at what other companies have done it with a Fifteen dollars is a vice they want to be\nAnd that's where Amazon is setting the minimum hourly pay for all of its workers starting on November first Jim wrong on ABC News several people are hurt after a ... protesters this morning and Michigan who are calling for a Fifteen dollar an hour wage multiple people hurt one of them are ruined pickup truck hit the crowd of protesters were demonstrating outside of a flip McDonald's\nAbout a hundred protesters were calling for a Fifteen dollar minimum wage and the right to form unions\nMichigan Democratic gubernatorial candidate Gretchen Widmer was scheduled to joined the group emergency responders or at\nThe scene that's ABC's Ryan borough over twelve hundred people are now confirmed dead and Indonesia after last week's earthquake and tsunami the FBI investigation into sex assault allegations against Supreme Court nominee Brett Kavanaugh is moving ahead with more interviews were told\nThe FBI has not reached out to Christine Blasey Ford but investigators have talked to three people she said we're at the party where Brett Kavanaugh allegedly assaulted her they've also talked to another accuser Deborah Ramirez who said Kevin exposed himself to her before the New Yorker published a recount cabinet I may have reached out to classmates to discuss her claim\nThe FBI now has a series of text messages suggesting cabinet contacted at least one classmate for support the text also suggest a classmate solemn eras act uncomfortable around Kavanaugh at a Nineteen Ninety seven wedding Aaron ... ABC News new\nCanadian scientists data Strickland is sharing this year's Nobel Prize in physics she is the third woman ever to win the award you're listening to ABC News\n[noise] [laughter] no matter\nHow modern your family might be if you're pedaling around that rock and a gas engine vehicle you're living in the past [noise]\nMe here at the electric vehicle has a ride with instant acceleration electric cars are more fun to drive and more affordable than ever electric cars are here again to the president learn more like into the present dot com sponsored by boat flag and group of America\nIndeed knows finding the right higher takes time away from your business hiring unqualified did engineered felt like a second job\nMore job seekers use indeed than any other site so there's no better place to find someone with the skills you're looking for I needed someone with a masters in computer science and database experience plus indeed screener questions hope you find your shortlist fast now I'm back to having just one job see one more than three million companies worldwide using ... to hire poster job in D. dot com slash higher\nIndeed the world's number one job site source ... visits\nStories on the coast bill you be a loser beers Taylor Cormier news\nFifty nine degrees for people from Fall River are among those indicted for running in a legal gambling operation the state attorney general's office has charged a total of six people were distributing illegal gambling machines to various establishment and southeastern Massachusetts\nIndicted or sixty eight year old ... Maria Seventy five year old and tone out of Arab forty four year old and the ... fifty two year old Mario Teixeira Fall River\nFifty nine year old John ... of Somerset in fifty six year old Clipper Wilson of diet and they're also charged the indictment came after state police raided several establishment and may and June removing the illegals slot machines the raids also recovered more than one hundred forty thousand dollars in cash\nAs a police officer was attempting to check out allegations of ...\nSit in an apartment Sunday evening he was attacked and assaulted by a woman living at the apartment\nThe officer was investigating a charge of three children living in a in squalor at an east water street department when he was reportedly attacked by thirty four year old mother surging hope she was arrested and appeared yesterday in talking district court she was released on personal cognizance and his due back in court in November\nThe children were taken from the home and placed in the care of the D.C up due to living conditions that hopes department\nThe union that represents Massachusetts state police strippers has named a new president amid a year that has seen allegations of overtime abuse against current and former troopers the union announced yesterday that surgeon Marc Lynch has been avoided president by the state Police Association of Massachusetts board\nLynch has served in the Massachusetts state police for thirty seven years and was previously a union rep for true bay he replaces tripper Dana polling who resigned friday over personal reasons after six years leading the union over the past year the union has been embroiled in a number of scandals including get overtime scheme that led to the dismantling of a trooper Baric\nAnd the low flying helicopters that ... used to inspect power lines and structures supporting the lines are being replaced by drones the energy company says the drones are already being used in eastern Massachusetts and opera more detailed up close look at the high voltage energy infrastructure\nEvery source also says the drones are more cost efficient and make it easier to inspect the hard to reach areas ... also plans to use the drones to assess damages to the electric system in the wake of major storms WBFO some news time nine a Bible check sports and the\nGet you when you're maybe after the rights die you can rely on the comprehensive maternity services that hall foreign medical associates in Dartmouth and New Bedford they're seven board certified\nObstetricians are part of your community and it provided that carrying environment for women for more than Twenty years mom deliver locally and uh hawthorn doctor is on call twenty four seven to deliver your baby her personalized maternal and newborn care home Bible eight nine nine six\nThree nine nine one [noise]\nKind of street motives were buying a car makes you feel good has a twenty year reputation of respecting customers and helping those going through hard times comedy street motorists will put you in a safeguard that they'll stand behind with a thirty day warranty with no interest in a small down\nIf you already have a car and it needs repairs comedy street voters can help\nYou'll love ... cutting street motors fight eighty nine cottage street New Bedford cottage street voters people pleasing [noise]\nWhat could you do with several hundred dollars come by in your home and the auto insurance by calling pollen Dixon or instability it's daughter insurance they represent several top insurance carriers including our mutual\nBased right here in Massachusetts they offer the coverage is and this could be just like for you about politics and specialist can answer any questions you may have your current policy and recommend what's best for your family's insurance program at no cost to you\nIf you're not already appalling Dixon orange Dougherty joins fly and you see yourself to find out how much you can\nIn and in downtown New Bedford at five ... five Ninety three or on the Web\nDash ins dot com that parliament Dixon Stoddard insurance ads are none of mutual here for you here for a good\nGood [noise]\nWBFO some sports the red Sox away the winner of tomorrow night's AOL wild card game as they prepare for what they hope will be a long postseason run the Yankees and AIDS pays off into one game battle to decide to advance\nThe news the news it nine brought to you by the power of life chiropractic stay up to date with New Bedford news talk station fourteen twenty WBFO Sam and get breaking news alerts with the W. B. S. M. S. [noise]\nInto new day in New Bedford we'll go to the bill ... show present whereas before we still see breaking news from the news director Taylor Cormier\nFacebook Live tweeting from digital producer chasing Sylvia and your calls in conversation and live away from nine to five hundred areas for number one talk show W we asked him for morning mayor Phil ... thinking\nFor tuning in reminding you that\nToday Michael rocks birthday is a day to celebrate this until the second Tuesday [noise]\nThey have a overcast guys but we're going to brightens things up not only with that announcement by the kitchen cabinet is on their way in and we'll be talking all about the issues that are important in the meantime let's get are improbable question shared with her audience and [noise]\nFor the question of the day I'm Still a little bit torn on that but let's get\n[noise] Hi this is Jason Kudo with who'd openly I'm here to let you know of a grain of that coming up questions I had a run their biggest event the third annual October fest\nI knew the pit and\nAnd educational charities feel tickets are available\nOctober fest dot com boom the all the on October Thirteen don't miss it\nWould you like to savor invest for your future saber invested you every time it safe\nFor your children's education call Jose mothers ... six seven eight three seven one type of advance financial group at seven twenty five state road in Westport mass as a financial consultant since Nineteen eighty nine I have experience in setting a poor when case IRAs and annuities for a variety of my clientele\nSecurities an advisory services operate through commonwealth financial network member N. A. S. D. S. I. B. C. registered investment advisor\n... show was Rosie by flagship insurance the continues no new for news organizations forging\nOnly do you [noise] All right ...\nWell [noise] [noise] spelled Gleick say what now geek\nSpelled Gleick G L E K perfect spell Sheikh\nUh S. H. I. E. K. get away from me I think that can never remember the I. E. I. before e accept after seeing and weird neighbor and all these other things like oh come on\n[noise] how about ... ... bleak\nO. B. L. I. Q. U. E.\nYou are on the money to like him and spot now ... all of these words rhyme with geek\nAnd that's the most important part of\nMy message about a company that has been very much involved in your basement for over Thirty years pioneer basement folks these\nThese folks have dedicated themselves to the the whole purpose of the companies actually to take dangerous conditions in your basement and make them healthy again they want to make sure that\nWhatever is down there mold and all that stuff gets out of there and they can do it because their goal is to make each and every single\nHome healthier\nHelping uh of course with basement environment that's their whole job and yes they are known as the the ... the some palm geeks and all that but they're also folks who really wants to make sure that you have a healthy environment\nAnd by studying the latest in the best products available for basement water proofing Steve endriss\nAnd job hires have a company folks that is so successful I mean you hear them all the time you see their trucks on the road the some pomp geeks\nAnd ... when I tell you this so very proud that they are part of the morning show part of our advertising campaign because they are a company that makes life better\nI continue am so impressed by Steve and Joe Steve Andrews ... the founder of the companies are are originator [noise] he\n... basement water proofing so good that now they're using his technologies over in Europe all over the world so just remember the some pomp geek it to ... tweak\nAnd how 'bout peak or as the kids here on the show say fifty years of being an antique\nWant you to go to this wonderful company that makes dangerous conditions in your basement healthy\nAnd that is pioneer basement great great group of guys thank you to pioneer basement the some ... ... let me give you a phone number and you can call this number make an appointment they'll come right out and make sure that they make your home safer and healthier all\nRight let me give you this number right now it is five oh eight nine nine four\nEighty nine one eight five oh eight nine nine for eight nine won eight I guarantee you will love this company I endorse it with my entire P. A. L. E. O. L. O. G. O. S. name\nIt is eight and nine twenty four nine twenty four the kitchen cabinet is going to be with us in just a moment but before we go there I just want to remind you that sue I've been with the Sioux and re ... motors lately and\nI just want you to know that if you have a day like today where it's overcast gray kind of dreary well if your skies are kinda like that financially cottage street motors\nIs more like the sunshine to help you drive off into good reliable car truck that you could afford first of all they don't charge you any interest whatsoever secondly they only charge you a small down payment and then there's a thirty day warranty that's right and sue we'll put you behind\nA car that say that's good cottage treat motors and they do their own financing this is why folks\nYou won't pay interest because their their own bank so one way to uh of course cultivate a loyal following over the decades is by doing that\nAnd it has worked cottage street motors on like any other car dealership around I Know them personally and I can assure you that they believe than that one philosophy that we all rise by lifting others [noise]\nThey are right there on ... street their addresses five eighty nine Karen is over there mark\nIs their hat\nMan is they're all yeah famous mark an ad man\nYou have to go by just to say hello and sue is keeping them all in line at cottage street motors where I Know you'll find a car that you love the people pleases cottage ... motors good morning it's nine twenty six [noise] morning\nFor the new for the on the FM terrible\nStory about a ... a woman ... a month or so I don't even know if I can use that [noise] who allegedly has problems\nI'm going to tell you about a woman who allegedly kept her children in cages in taunton it is a story that has just broken my heart and we'll get to that story when I come back in just a moment plus the kitchen cabinet is coming up in just a few minutes\nProblems [noise] I'm going to tell you about a a woman who allegedly kept her children in cages in taunton\nIt is a story that has just broken my heart and we'll get to that story when I come back and just a moment plus the kitchen cabinet is coming up in just a few minutes don't go\nBy this is the thing to do with who do ... I mean let you know great of that coming up questions I had a one of their biggest event the third annual October fest\nI knew the ... and\nAnd educational charity route feel tickets are available\nOctober fest dot com hope the all the on October thirtieth don't miss\nThe higher the reading of hiring side to the radio [noise]\nChristmas cards to the game right\nVoting including till you're oh you're too young for tricks when our area ... ... I mean are there any\nLong would I pull a drink or is there an age limit I mean I Know checked for kids well they stopped producing the tricks that we're a fruit shaped a\nWhile back a little fear is now right [noise] yeah and the shame\nKnowing that now so enough people complained to General Mills that they're changing their act they're going back to the original nice isn't that nice so of community out\nOf the world the shelves away filled with your old favorite tricks and maybe they're going to come back to the ... the you know fruit shapes as well\nDo they still make the tequila there yeah I I've seen it on the shelf yeah half yeah I used to love that series so good yeah mhm do you have a favorite now\nUm I don't eat cereal very often like classic honey nut cheerios and that wind the chocolate piece a Special K like the chocolate one\nLittle shaving that chocolate and sign relative yeah ...\nGood dessert type you know yeah so the kids love craze you know that's chocolate in it to crave Cady\nBut he's not going to be returning to teach at Harvard law school\nWell we won't need to because I I think all in all I I really believe is going to be confirmed\nI don't know it wouldn't it wouldn't surprise me if it comes down to Pence deciding getting the deciding\nVote Osama that is crossing my fingers [laughter] nah I got the the books are it's\nInteresting so you think he will be confirmed a and Peter you're on the family on them with us\nUp I think that you see the interesting part about it is with Jeff Flake is that he's not running for reelection has nothing to worry about unless he's planning some sort of magical career after he leaves\nAnd one way to get there is to become this figure\nI'm like he was doing yesterday in Boston but he's got nothing to fear from the electorate because he's not running for and again right right as far as the other two\nGoes I frankly don't think the Susan Collins has anything to worry about\nAnd here's a reason you know the group was going to raise a million dollars against her yeah there's only so much time now between now and election they don't have enough time to really stay any kind of campaign about how much money they have to get her in less than thirty days ...\nAnd ... you know it cracks me up with all the you know the cost of double standards we can turn around at any time and find millions I'm about one of them is that you know they they talk about collusion in an outside or\nThey you know influences and everything else but George Soros never comes up on the other side of how much now that the Hungarian I mean how much he has interfered\nHe ... he ... he hires a bunch of people you know the move on dot org ... finances all these things to divide people and so on and that's no big deal you know so that was like isn't that the same thing is going on Facebook sure of what the Russians did which I'm not condoning it or anything but I'm saying ... ... you know\nIf you do it on this side it's okay to do it on that side you know [laughter] I\nHaven't really been an in depth study George Soros you know what makes him such a hater of democracy\nI don't know that well I Know that he is a game to him or taken down economy is something that he is pretty proud of that\nRemittance money either is a a he was money uh manipulator [laughter]\n[laughter]\nAnd he did say on a talk show one time years ago that you know taking deli that the United states would be kinda fun you know I'm paraphrasing you know but he said something along those lines and he certainly has gone after that\nI Believe that ah he feels in his heart that are making this a one world order giving everyone at least a roof over their heads are is better than how conditions are\nWell today to heart transplant [laughter] actually probably wants to be a leader\nLeader of the world yeah the way to get rid of the other strongest country\nWhile he's in a a an eagle maniac oh yeah yeah oh yeah so you know you're you're right about the being the leader of the world\nShow he lives in an armed an armed fortress walled [laughter] all armed with Arnold yeah I've got um he definitely it would be one take good care of himself\nYup yup [noise] so now the press wants to do what they did during a the Iraqi war do you remember the embedded themselves in the foxhole with the soldiers\nOh yeah [laughter]\nNow they want to do the same by embedding themselves with the FBI behind the scenes they want to know who is the FBI are investigating and interviewing what are they asking are they going deep enough for the media's sci\nInvestigation is supposed to be confidential all the way down the line\nWhen now they they want to know if they can be in on them just to make sure you see what's happened here that the media that so many ... yeah yeah yeah absolutely we've\nGot this army of uh FBI agents galloping around the country interviewing these are supposedly witnesses to whatever and I have a suspicion that most of the witnesses a damn terrified of getting anywhere near any of this investigation\nCan you imagine if there was a like a board of ethics like like in ... lawyers they have ... you can bring them up on ethics charges and they can lose their license to practice law but in that shift that was like the journalism too because journalism has really you know gone\nOff the deep that yup yup\nOh yeah [noise] ah what do you think about our senator or hinting that she's going to take a hard look at running for president ...\nWant want it and very simple\n[laughter] go ahead [laughter] because I I you know go for it I say because you know that's just going to solidify I'm On a strong\nI Want to see you get in Iowa and have to defend what you said about Mali did or didn't say yeah yeah and I want to see a get out there because I have a suspicion that she stands out out there her democratic challenger is not Republicans it'll be the other ones running 'cause it's gonna be a horde of them running to and they're going to take her apart\nBecause that's the fun thing to do what you gotta you gotta become number one in any way to become number want us to get rid of number two or three and four that's it and if they don't there'll be more issues to her than the Republican and they probably think that they'd be wrap it up [noise] yeah\nThe debates you know prior to the nomination and stuff have changed over the years they've gotten pretty a heat their own you know both sides here's wrong I Want to\nKnow a ... regardless of who runs is this one gonna be the bloodiest one yet ...\nSure is um the the problem the Democrats have is they have a lot of weak contenders they haven't got anybody who really charismatic to\nThe oh they do about denying Blumenthal\nOh yeah and then go on with all he's\nNot all that was so funny if I had to laugh [laughter]\nAh [laughter] we have a particle there or\nWhatever you know I was watching some of the stupid the testimony\nOn you know what the Senate and stop at the one like this cat or Cory Booker and another one you know they walk out and not going to vote you know so there are so tough and I think that how it should be in the Senate is if you don't vote which is your job that's why you're on that panel\nThen you cannot survive on another pain you're done you're done because you're not doing your job so to go to these things and then say oh I'm not voting 'cause you know I didn't get my way so here's a little ... little tantrum and I walk out of the room that's how strong I Am and it's like OK yeah great you don't go on another any other panels because you will not doing your job\nWell a few of these senators on the committee should have should resign not only from the committee from ... from set it off and\nGet all yeah definitely but what I'm Booker\nYeah he grow up to Fifteen year old and he admits it see that's a that's kind of a criminal act yeah so he should be out of there and Blumenthal he's that's that's stolen valor he should be out of there\nYeah yeah I think one other oh I don't know how they even got on that can be like I had I don't know how they select people I don't know how that gets done I\nDon't I think the um Senate minority leader picks them\nWell he picked a few ... well you know that's only going to showcase\nKnow that's not bad to pick the ones that you know are not capable or you know and that are going to get attacked himself so that's pretty smile ... what about Joe Biden running for president\nUm well you know once again going to be lost in a pack of twenty and ah they mail out of him to a great degree but he's not a leftist but he's going to become very much in the middle east also kind of a week ... so\nI'm now the Boston Globe and humor and the globe\nIs and I think the times in New York Times and saying that if he does have this in his mind he he too may have a\n[noise] Thomas at a dash hill moment to explain in his life or problem does anybody think that Hillary still thinks that it's our turn\n[laughter] I don't think so oh I I Would I don't know I don't know if they'll be said that\nShe has always felt entitled to walk into the presidency or anything that she touches so I don't think it's off the table\nI I don't think so either oh yeah I it's completely off because like John Kerry in he wouldn't run again oh he thinks about it oh he thinks about it but uh the party wouldn't allow it he wouldn't get past the primary and neither would she\nWe don't know what the Democratic Party is going to do it very much slip by this growing leftist very left French is getting larger correct in the heart of the party and this is one reason why you can't believe the polls yeah because I Am suspicion or an awful lot of centrist Democrats don't tell you what they really think\nYou know the ... what about Bernie do you think they'll they'll they'll and very well I Know I I think he'll run that I think that one of the Democrat's gonna do I mean when he runs are they going to stonewall him again\nNo because they're going to be controlled by the left side with well\nYeah yeah and uh the New York times is sponsoring a come out and see Bernie a event either tomorrow or very soon and this is all in an effort to get the students at Columbia and uh yeah and why you to come out and vote\nYeah that's right so a Jeff Flake we had a ... day in Boston yesterday do you think he's thinking about running for president ...\nWell they all think about it uh-huh same way that a lot of our city councils thanks very one time I don't want to be mayor so [laughter] I'm sure he's thinking about it he's not\nGoing to ... speaking of which I Want to ah give you guys the heads up I'm going to be gone for a few days are going to my fiftieth high school reunion and filling in on the Tuesday that you have the kitchen cabinet will be\nYou're not unionized oh they needed a union union I see no but\nThey couldn't use any of the staff at the a mansion or the\nUh because of the Peter you always have the answers man thank you okay thank you and thank you and he won the thank you ladies and gentlemen Chris is next state June for the Christian McCarthy show Barry at noon how we as three\nThank you for listening to fourteen twenty W. B. S. M. New Bedford Massachusetts\nSherry pressed in over three hundred thousand Amazon workers will be getting a raise in less than a month\nBefore dawn that Amazon's facility in east ... California [noise]\nSenior vice president day pork announced that Amazon is boosting its internal minimum wage to Fifteen dollars an hour for every worker [noise] now it's on to Washington\nWe certainly hope that we're able to influence Congress to move forward with an increase in the federal minimum wage\nWhich stands at seven twenty five an hour Amazon has taken criticism for years from employees who described a high stress low morale work environment generally an ABC News\nTruck hit a crowd of people protesting for a Fifteen dollar an hour wage this morning and Flint, Michigan police think it was an accident half a dozen people hurt\nThe FBI now talked to several witnesses in connection with its new investigation into sexual assault and harassment allegations against Supreme Court nominee Brett Kavanaugh anything new chief justice correspondent Pierre Thomas says questions are being raised around allegations from Gail classmate Deborah Ramirez who says he exposed himself in college\nWith our mayor restart the classmates before the New Yorker story ran to discuss the claimed by rumors that he exposed himself the FBI now has\nThere is a text messages suggesting that Kavanaugh contacted at least one classmate for support and refuting his claim but the text messages also suggest a classmate sovereign mirrors act uncomfortable around Kavanaugh at a Nineteen Ninety seven wedding\nThe Supreme Court shorthanded with eight justices is hearing arguments today the high\nCourt said to hear arguments in the case of Vernon Madison a death row inmate convicted of killing an Alabama police officer in Nineteen eighty five but whose lawyers say he can no longer a member of the murder because of memory loss after suffering several strokes\nThe case raises eighth amendment issues of whether it's cruel and unusual punishment to execute Madison NBC's mark from a large in Guyana that's why\nA lot of profit for her first solo international trap\nYou're listening to ABC News [noise] how can a fully stocked restaurant improve your image of service fire extinguishers or first aid cabinet make your employees more prepared how can comfortable work apparel make your business more productive for over a million customers the answer is simple\nAnti since last delivers everything you need to open your doors with confidence because housing keep businesses well equipped to clean it looking there best that's our business\nGets into and getting ready for the worst day\nThis season one long green sleeves shot to make a world of difference\nYou can protect yourself and your clothes talking co workers how signing neighbors two month old and he's looking at specially trained pharmacists but it provided over sixty million police onto the thousands and for your flu shot today is the dollar company would look to insurance because protecting the world starts protecting you are\nPlump green justice is nice you know one thing I just sort of a ... agent health related restrictions may play\nStories on the south coast bill you be a loser beers Taylor Cormier he's\nSixty degrees after a series of state police raids and southeastern Massachusetts earlier this year six people from the area have been indicted for running in a legal gambling operation\nThe state attorney general's office says for people from Fall River one from Somerset in one from dikeman we're distributing illegal devices to establishment throughout the region the rage in may and June seized the machines as well as over a hundred and forty thousand dollars in cash\nCharged or sixty eight year old ... Seventy five year old Anton on a Berra forty four year old ... showed Teixeira and fifty two year old Mario Teixeira all Fall River\nAlong with fifty nine year old John ... of Somerset and fifty six year old Clifford Wilson a diet and there'll be arraigned in Bristol county superior court at a later date\nHarvard law school has announced that U.S Supreme Court nominee Brett Kavanaugh will not return to teach in January the announcement was made in an email from administrators to law students yesterday\nThe email said judge Kavanaugh indicated that he can no longer commit to teaching a course in January term twenty Nineteen so the course will not be offered a Harvard law school spokeswoman confirmed Kavanaugh's decision to the Associated Press today Kavanaugh was scheduled to teach a three week course called the Supreme Court since two thousand five\nHe's taught at the law school for about a decade\nUh tightened woman has been arrested for the alleged assault of a police officer while he was investigating child abuse at her home police say when the officer editor east waters three departments Sunday night thirty four year old ... protect the officer hope was arraigned yesterday and taught them district court then released until they're hearing in November\nThree children living at the apartment removed and plays in D. C. F. custody due to living conditions in the apartment and ever source as it's now using drones for the inspection of electric lines in eastern Massachusetts\nThe energy company has the drones checking the line structures and other equipment ever source says the drones are not only more cost efficient than low flying helicopters but can get better up close looks at this\nSupporting structures the company will also use the drones to assess damage to the electric system after major storms ever sources that will allow them to more accurately dispatch crews and informed customers when power will be restored WBFO some news times ten oh by the sports\nThe red Sox await the winner of tomorrow night's AOL wild card game as they prepare for what they hope will be a long post season run the Yankees and AIDS based off into one game battle to decide who advances the winter will play the red Sox in game one friday night at Fenway Park\nAnd the Celtics get their first look at the Cleveland Cavaliers without the brawn James denied the cabs come to tell them for their first preseason game\nAnd overcast and damp starts today temperatures this morning on the fifteenth of afternoon we top out near Seventy it's another ... but then late tonight around it happier rain and thunderstorms cross through the area\nBut now for and I was staying in the sixties we start tomorrow with ... scattered showers as well but as we hadn't to tomorrow afternoon sunshine breaking through ... Saturday hadn't eighty six other center I made the rounds with Chelsea priest told me that for these talk station fourteen twenty ... than\nIn New Bedford we have sixty degrees ... be a news the news at ten is brought to you by the extradition corporation stay up to date with New Bedford news talk station fourteen twenty WBFO Sam and get breaking news alerts where the W. B. S. M. at\nFord's new succession fourteen twenty double UPS him present silver ... radio\nFree slicker get on the air by calling Bible eight nine nine six o five hundred washes UPS MTV videos on YouTube or listen anywhere on the New Bedford McCarthy is on the air\n[laughter]\n[noise]\n[laughter]\nWell good morning could morning welcome to the show I'm Chris McCarthy thank you so much for joining me we're going to be talking today with a earlier in the week that we normally do without resident liberal fellow Marcus federal markets good morning how are you sir\nI'm good I'm just wondering where a P J ... and the boys are because you know the FBI isn't\nMark judge has been interviewed I heard this morning did was he a cause I Know foreign how's it hadn't been interviewed until maybe yesterday oh I don't think she didn't even ... I mean there are lawyers that said she hadn't been interviewed they hadn't reached out to her and after they made that known to the press I think the FBI reached out to\nHer guys I was listening to someone and again thankfully nobody knows what's really going on in an FBI investigation right everything speculation just isn't isn't sending out press releases yeah too many anyway would I Would open um\nI listen to a former budget director the FBI I don't know how many of those of those there are there could be a million former assistant director says the FBI both knew one gentleman ... sounded pretty interesting he said that he felt they would interview\nI'm Dr Ford and a judge Kavanaugh last that they would get all the information first that they couldn't sit down with those\nBooks I think the question becomes do they have the time to get all the requisite information before the Senate vote that's apparently happening happening this week\nThey said again this guy this guy is former FBI direct assisted FBI Director\nSaid he felt that they could get everything in by friday\nThat um because of the massive resources that they have he felt that that they they could get that all done because they have a command center apparently set up and they got unlimited resources in a ton of age and some of the best agents working on this thing so again\nI don't know how many ... former starting directors rocks but it but it just seems it just got to be pretty cool\nSaying look he didn't think it's a big a big lift for them to get done okay well we'll see\nYeah 'cause I I was um I I had fourteen twenty on ah in my car that I just I got my car was like eleven o'clock so I don't know what a night I don't know what show is playing\nUm but there was an FBI eight a former FBI agent on saying\nLiterally insured by in the late ... inappropriate for having an\nEight hundred three one two Ninety nine forty six [noise]\nBack to the ... show on fourteen twenty but yet [noise]\nSo many times\n\nBrett Kavanaugh it feels like he's being used at all that's Eric Clapton fulltime Chris MacArthur with Marcus pharaoh in here and when I ... used [noise] yeah I think I Would think she would um [noise]\nQuite a bit of a ... who were were talking before we go to the phones I'm\nTalking off air ... I think the Republicans going to put this to a vote anyway ... ... yeah and just to to make the Democrats in his who defending seats in in in heavy Bush states to go on the record because if\nAll they need is a couple I don't think there's any Republican there's no Republican senators at risk should they probably got lucky is one of these usually there was a really good map for them yeah there are only defending a ... really that's been any seats quite frankly you know they really don't have any seats that are vulnerable\nAnd the Democrats than there is some hope there is some open races that that look kind of ah what kind of frightening\nYeah there was a was a tendency Corker is all they had to say yeah that's an interesting ... rocks at least made it mildly competitive I don't think he's going to win ... bail rock is going to be like the kid down in Georgia oh chef yeah once every ... when the dumped all that money you're blown out yup [noise]\nHe he's you know yeah you're not going to win yeah I'm Ted Cruz in Texas right I mean it's like saying hey Jeff deals made a hell of a show here in so far in in in in Massachusetts yeah end of the day that's Massachusetts going to vote yeah come on you know of course um\nDoesn't mean you don't go out and support you can do all that stuff but\nUm but you look at it it certainly swing states don't exist when they're just absolutely solid red states that have Senate races in them and mansion yeah mention might as well Lucy is not a Democrat anyway\nUm yeah you got mansion a tester Jon Tester is or how do you how do you camp yep she's up in North Dakota you've also Florida is actually now in play yeah a Rick Scott and Bill Nelson right yeah and you've got um\nIndiana is still in Play Doh dong ... said he's not go to Joe\nJoe Donnelly a one in twenty twelve because uh that guy had said it was it was a rape thing he'd read that or I'm Talking about abortion said well even if even if even in the world such horrible situation of rape it's all part of God's Plan\nSo I mean turns out voters didn't take kindly to testing that God's ... a proxy rapes people so um yeah he had to do is a tough year for\nMcCaskill I think is in in ... she's in a tough re doing this or you know he's the only way they want these folks have to vote on it so so Kevin ... goes down and the vote they they they they possibly by their theory would solidify the sun but we'll see we'll see actually eleven or maybe uh some\nOf the international year of the man reclaim last night by law Ingram on Fox's news channel\nThat must blow your mind how can you support what a woman by plane\nCan you gentleman and I use that term loosely ... remember the international year of the woman\nWasn't that a year that was is that important to point is that it was a destructive to the cause of the republic\nAs was the night that the men and now we have the you're the man because way way way with Kavanaugh regarding use Kavanaugh ... so that men in this country can finally wake up stand up and push back and declare war against certain women\nYou know certain women are a mark has this report the algae to kill kill pay gang yeah those are the women they marry but NATO main lawyer ever go up and get married but I Do I like to go up and get\nMarried but not all we all know that I might be able to get a a you know ... I mean I knew Ben for ... stimulated burglar marital dot com [noise] what's that have you heard about the quarter marriage dot com\nYou've only told it to me every day since ...\nAnd he called market all talking to mark his\nRemember what he heard last night on WB assembled WB I send as valuable station thank you and the more we have this ... of a pain go lawyer\nOn for a ... I don't how does he get standing hardest to get on someone like a ...\nYou get on the radio find like you get on the radio and that's why you're on the radio and I like yeah well\nThat's right but you got you got kids out here listen to the communist crap and as he says the answer is that a Democrat\nMentioned is a Democrat that's a ball face lie by alliance thinking lawyer from God Knows\nWhere whose name as close to Ferris arrow markets how close is your name to mine Marcus um put up for a couple of letters we have there's hope for you or not it's not an ideologue\nOkay if you had an open mind and I refer you to study a book called a or the closing of the American\nMind by Alan books Lewis fellow from the University of Chicago member that he has an excellent book would so markets raise that he he might try\nOh no don't ruin my liberal guy you know hardly to find a liberal smart guy who wants to come on the radio rarely does 'cause only blue and you get some people call the common cold in the liberals lying paint goes\nYou know how stupid your listeners are you had a woman called up and said Kevin belong to a sorority yes you got to realize that he's damaging these idiots that listen to this radio station\nNo he's not yes he is because they believe that it's crap and and I hope my brother's what will back me up on this we've got to get rid of this pharaoh\nDown and you're not going to get listed you'll be gone before he's gone I assure you [laughter]\nYeah what what you got your fare went up during the year when you were in high school you've already confessed to it you know all the way\nI could be as well what do you believe that you weren't you weren't Chris just shot in an echo chamber do you want to have you want to have some actual dialogue\nI Want to have a broadcast show that people can hear the truth I you know that that's important because I mean the\nLoyalty local you have your own I think that's being worked on his ...\nWell I I it is being worked on but it it takes hard work when you're up against the L I said oh I see central lesbian in\nCharge is wanted every organization I'm thinking of flower for and get along with the new California law requires a woman out every board of directors of every company that's held on you know what that how about that in the law did you hit it certainly had yeah there there must be a woman in a rural okay are you I don't want to get this\nReally do you get this book having I Do I have high hopes for you\nTo get it it's it's ... it's it's ridiculous because I don't think you need to have a lot to get women on the board the law no and you are\nIn and out and now there will be a law that required to have a woman in every conversation work toward more men are\nGathered talking about anything and I I broadcast this five years ago I could see a comment\nYou do get a lot of credit from my listeners for for being able to force the into the future Mike ... of course I'm done I'm at my job is I'm a futurist he predicted all the way bathrooms laws on so how many how many future as you know really\nI don't know that guy who travels back in time it was that was like I think John take ... John Tanner no I'm a futurist yeah but that's what you were in the future now you've come back\nNo no no I well I'm ... I'm ...\nI had prior you I live in a rare because George\nGeorge George Patton understood reincarnation 'cause he's a brilliant highly educated man\nOh God well the George Packer the Well Adam genome reincarnation of well what was going to remember the wealthy\nHad as a young man how privileged was George Patton what did he do he took what are you know and and letting men into\nBattle and medicine which he love who else was or what you're going to get in and he didn't want the war of the battle\nHe loves the battle for as I Know you love the battle to yeah George ... son lived in ... which most Jessie George battling the Massachusetts oh we're ... what's going on\nTrolling you're allowed to be a Sam\nHi I I Do agree though your guest ... um\nI think that you know your guest had made a comment that um he didn't think that ... cabin I was I'm qualified and I I just want to bring up the fact that Obama when he nominated Kagan Kagan was only a lawyer she had no never had\nBeen a judge you can't get almost ... only young lawyer Kagan wasn't only a lawyer she was the solicitor general for the United states and she was the dean of Harvard law school she's she wasn't yeah only lawyer no but it was Reagan nominated hold on hold on Reagan nominated hold on hey let me finish experience\nReagan nominated chief junk a chief for the chief justice Reagan nominated Rehnquist William Rehnquist who was an assistant solicitor general and I don't think you had an issue with that did you\nOh I don't know yeah exactly yeah exactly I Know that that happens all the time I probably\nWould have a problem with that because yeah you know\nPeople who say that they don't have someone is unqualified just like every single president that has ever been elected\nHad no experience so I don't know whether they would Democrat or Republican there's no experience you know but it seems to be the way and the Democrats now I mean look at Obama got in after what in the Senate saying a private about how many times\nThe markets are your thoughts [noise] sure sure does the constitution and so it was and it gets a\nHe yeah of course in and let's not the there's a false equivalence and the Senate is just as important as the Supreme Court ah\nRoe v Wade brown versus board of education Dred Scott versus the United states plus he versus Fergus and these are all monumental decision Kramer versus Kramer that\nThese are all monument a these are all ... a monumental decisions that shaped\nThe ... the way we handle a particularly social issues but the way we interpret the law the way that our country is run to the civilizations versus ... so yeah so I'm In the ... citizens who are Citizens United so best case ever and also the blues just talk about the decision of Citizens United\nBut go ahead [noise] codified the first ... I I Will be the whole show to talk about that like we'll do two shows on them but um anyway um\n[noise] so uh I lost my train of thought that's what I Do here yeah okay oh you were talking about the court ... court large first of all I don't know if I don't know anybody on the Senate Judiciary committee to beat anybody's wife or anything like that but um it's um\nNo there is so it's a ... I can look at a you know what to say the wrong name so I can look it up to shore so Cory Booker of some of the corporate could grow big incident I'm Cory Booker in Nineteen Ninety two he might not be an judiciary famous\nBookers and you know this guy who beat his wife the Democratic to be just like might not be educated they're talking about a thousand no okay no no no he's in the house yeah I Know I I Know he's in the house um but so\nCory Booker uh Nineteen Ninety two for the Stanford newspaper um while he was attending stamp or Stanford or wrote an article about uh how he was making out with a woman in high school or he was also in high school at a party New Year's eve\nAnd uh he had reached for breast and was merely we're both by the woman and he was talking about how he learned from that experience and it said we need to treat a you know we need to we need to be more cautious about how we act at parties and how we treat women how we make our advances towards women\nSo uh you know Brett Kavanaugh is that something he talked about an experience you talked about that it grew from Brett Kavanaugh is accused of being a woman to a bad covering her mouth because so she um so he she doesn't scream and trying to penetrate here\nSo there's two starkly different accusation tier one one is it admission and experience they talked about growing from and you didn't hear anything from that woman that Cory Booker was talking about so I doubt that you know this is even an issue but Brett Kavanaugh to hear from her soon though well if we do then that's a whole different issue in the voters can vote him out but Cory Booker can be voted out by Kevin I Can't\nExcellent point um folks when we come back we'll give you the name of the Democrats who admitted to beating his wife in Nineteen Ninety eight interview and how he will be voting on a judge capital left school and come back here on fourteen twenty W. B. S. and\nJust say the magic word Alexa WCBS down your wishes granted\nWelcome to fourteen twenty\nBridgewater credit union wants to be the best place you've ever bank for you and your ...\nThat means a great rate for you and supporting local animal shelter and point five million animals Andrea us out there every year and one point five million are never adopt that that's why they partnered with someone else happening and like how animals out there for a concert pies to promote the adoption rescue that they've got to find when I started out constantly\nThat featured rats you visit whenever they rented or Bridgewater for you dot com they really enjoyed my interest in equal housing African\nFraser sign on October thirtieth supporter of his annual event that benefits so many children in our community the south coast business alliance along with my properties are proud to present the thirteenth annual October fest at least here three sample a variety a great deal what was going on for musicians great affected mellow seven day weekend for\nThe poor man ... all those seats at risk youth\nPrograms identify the memorial boys and girls by the police effort high school so many more involved get info and get your free cell tickets today envy October fest dot com [noise]\nToday envy October fest\nDot com [noise] McCarthy creates smoke over the show vote gene ... fast to [noise]\n[noise]\n\n\nHey we'll come back to the show I'm Chris McCarthy with Marcus federal are liberal fellow attorney at la Marcus ... what's your alarm um the law office the markets the federal markets for law dot com or do I can all cases I also can handle personal injury cases and I always say if I don't know if I if it's something that are my office has been going to handle than I can put you in the direction somebody you can forgive me a call\n... or let's go back to the phones thanks rolling your lived to be some\nClapton like you are or who's the Esquire that's it right now\nOh awesome awesome awesome awesome oh how about this broad that's complaining what's up with her background come they haven't been a microscope and that one\nWhat do you mean\nWell why aren't they pick it up well I think the FBI will look into her yeah I think they will you I think you're going to hear some stuff\nMaybe not but you should but also I Do I Do have to say this one of the reasons we want to do so much about his background he's going to be going on the Supreme Court everybody's\nAlways this what about this what about is is is like oh what about Cory Booker what about Blumenthal what about for now what about Brett Kavanaugh he's the one getting a lifetime appointment to the highest court in in the entire country\nBut mark is that the lord you hold on to say is a lawyer you would if if if you were involved in this case you were defending court which I knew it was not quite sure he would look into the accuser\nBackground right I mean it's customary to get a gory check on on a ledge victims and witnesses are just so you can teach them but having said that you know because I Know this is this is usually where the conversation is headed it's not permissible\nTo um to admit the sexual exploitation of the victim in a rape case or in court you know\nRight so wouldn't be sexual history but if they had been found of lying and things like that that would be half they had a history of wine that something you could potentially impeach them for okay go ahead to\nI don't really think credibility should be looked at that time even if it's not sexual is probably worse than mine\nThank you thank you know who the next step\nGave me the greatest Indian of all you see how would you I was here when you were you gave it to you know you and she gives you yeah it's in and you can testify Marcus ... my office now it is they're yeah they're on my desk taking up space\nIn love I Love my back to the phones thanks we're all in your lab know it'd be a sin\nHello Monica so you um well how 'bout yourself okay\nI won't talk to you about sexual matters changing\nThe traditional heterosexual marriage now\nI'm hearing the discrimination thing being thrown around as to why\nMarriage has changed with additional\nVersion now if if you can achieve the same results as me\nBut you are being denied because of bias that could be discrimination right [noise]\nUm depends on why were being denied what we're being denied ... why were being denied that certain particular thing\nFirefighters policemen or a lawyer\nUm it depends on the reasons that you are being denied\nWould you admitted that can be discrimination if you're denied up from a certain thing that you have no control over I guess no um or\nYour nationality said they needed more Portuguese lawyers and you're an Irishman\n... a reason for no more and more of these lawyers\nAre what's the reason for needed more Portuguese lawyers\nI'm just here this is an example of what discrimination is moving to higher up something you can achieve the same results are being denied because of the bias\nThat can be defined as with discrimination is\nYeah it's just like I said it depends on the line now\nFrom illegal prospect right\nHomosexual relations in heterosexual relations are two completely different biological\nThen you've got to be in some cases so boring yeah hey\nWell All right see when I'm ... now\nA seal it a man if\nI like ... are trying to cross examine lawyers thanks for holding in Lebanon we'd be on\nThe line and cry warning it's market market I\nMean I'm I wind up to now yeah prospective out of the outcome ever think he's going to get that can be done\nI I Would I mean it's it's it's really hard to know but I Would I be leaning towards he's likely going to get the nominee I get get to see it just seems that way doesn't seem like any Republicans are really coming out hard against\n... ... ...\nYes except that if the athletes should only he loses raises the FBI comes out and says you got a problem yeah right I mean it's oh yeah so maybe he doesn't the I'm not sure\nI mean he he he has an until they take it from him so right back to it and he's not gonna make all that he is he's not he's not teaching at Harvard lying or different name played on he's not he's not teaching at Harvard law ... why is there a different name played on the door no I mean in his office\nOr not you know because I'm not looking at my church cabinet goes back to work with holiday I I don't want right yeah [noise]\nWhy is all that stuff in my office fighters boxers which is a picture my kids\nWill be back in the car and they\nFirst talk stations will be\nTwenty first street was Jill UPS and don't do you do it [noise]\nFrom ABC News\nI'm Sherrie Westin Amazon and said to raise the pay for hundreds of thousands of workers\nSenior vice president David cartels ABC he'll be at least Fifteen dollars an hour starting November first\nA Fifteen dollar minimum wage is a new starting wage for all and poison all voice high\nFulltime part time these no our holiday associates people working with agencies staffing agency is Larry\nKudlow the president's chief economic advisor was asked if Amazon had Jeff Fager was making a good move if I'm In favor of higher\nWages says making that well look at the business decisions for a good businessman\nThe FBI is now wrapped up its interview with a key witness in the investigation into sexual assault allegations against Brett Kavanaugh all that is according to the lawyer for market judge actor Christine Blasey Ford says judge was in the room when Kevin attacked her in the Nineteen eighties\nThe political fight over Kavanaugh Supreme Court nomination hitting the Senate floor today with majority leader Mitch McConnell promising a vote this week\nThey will not be satisfied\nUnless they have brought down judge Kavanaugh's nomination\nDemocrat minority leader Chuck Schumer sang\nTo say Democrats are causing delays coming from the same man who delayed the nomination of Supreme Court justice Merrick Garland for over\nThree hundred days without a shrug our shoulders give me a break\nAs the death toll and Indonesia pushes past twelve hundred after two earthquakes and tsunamis and he sees James long run it's found one reason to smile\nVery heavily pregnant woman I've just been evacuated from the uh the ... and she arrived had jumped in time for the section ... to one little boy to to go go very healthy I spend time with the dad study one year old he could not why this fall on his face there's a lot of sadness head but that's a little bit of joy\nMillennia Trump is now landed in\nMajor international trip as first lady Mrs Trump visiting poor African countries on the trip you're listening to ABC News\nYou guys can hear from the hip typecast today's growth who would win at three mile bicycle racing eleven year old girl or last year's winner the Tour de France it all depends on the bicycle it depends on their vehicle\nAnd it tends to be in the ... going to win every time but put the race run a trace Ikle and the eleven year old when every time you see it's not the driver it's the vehicle when it comes to generating revenue it's exactly the same if you have a job or a small business you are writing a trace Ikle you can only go so fast\nIf you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy simple they choose to only right ten speed when it comes to helping people create their next revenue model both for joining recommend income store as a can't miss when it comes to putting people in a ten speed could your household or business using additional revenue model that doesn't solely dependent on you\nIf so you need to check out income store dot com that's income store dot com\nStories on the south coast failing bill you be a loser beers Taylor Cormier he's the news\nSixty one degrees for people from Fall River are among those indicted for running and illegal gambling operation the state attorney general's office has charged a total of six people would just rebutting illegal gambling machines to various establishment and southeastern Massachusetts\nIndicted or sixty eight year old ... Seventy five year old and tone of era forty four year old and the terror should Teixeira and fifty two year old Mario Teixeira all Fall River\nFifty nine year old John ... of Somerset and fifty six year old Clifford Wilson of diet and they're also charged the indictment came after state police raided several establishments in may and June removing the illegals slot machines the raids also recovered more than one hundred forty thousand dollars in cash\nHarvard law school has announced that U.S Supreme Court nominee Brett Kavanaugh will not return to teach in January ... was made in an email from administrators to law students yesterday the\nEmail said judge Kavanaugh indicated that he can no longer commit to teaching his course in January ... twenty Nineteen so the course will not be offered a Harvard law school spokeswoman confirmed capitals decision to the Associated Press today\nKavanaugh was scheduled to teach a three week course called the Supreme Court since two thousand five is taught at the law school for about a decade\nAs a top police officer was attempting to check out allegations of child abuse at the park on Sunday evening it was attacked and assaulted by a woman living at the Parkland the officer was investigating a charge of three children living in squalor nice water ah east water street apartment when he was reportedly attacked by thirty four year old Melissa gene hope\nShe was arrested and appeared yesterday in talking district court she was released on personal ... that is due back in court in November the children were taken from the home and placed in the care of the D. C. F. due to living conditions that hopes department\nAnd the low flying helicopters that ever source used to inspect power lines and structure supporting the lines are being replaced by drones the energy company says the drones are already being used in eastern Massachusetts an opera more detailed up close look at the high voltage energy infrastructure\nEvery source also says the drones are more cost efficient and make it easier to inspect the heart to reach areas company also plans to use the drones to assess damages to the electric system in the wake of major storms\nNobody BSN news time eleven o five in sports\nThe red Sox await the winner of tomorrow night's AOL wild card game as they prepare for what they hope will be a long post season run the Yankees and AIDS face off in a one game battle to decide who advances the winner will play the red Sox in game one friday night at Fenway Park and the Celtics get their first look at the Cleveland Cavaliers without LeBron James denied\nThe cabs come to town for the first preseason game\nAs the economy after ... breaking through the clouds again still had the ... the scattered showers that's wild temperature top out and about Seventy degrees overnight the risk of front heavier rain showers and thunderstorms comes through the area and then in ...\nMorning we continue to see for scattered showers but from there we should from so clearing in the afternoon hyper ... and they probably couldn't eighty things because I didn't ... I made the rounds with turkey praying for me that for ... fourteen twenty WBFO farm in New\nBedford we have sixty one degrees I'm Taylor ... BS in news the news at eleven brought to you by lows stay up to date with new a New Bedford news talk station fourteen twenty ... BS them and get breaking news alerts with the W. B. S. M. at\nFord's news station fourteenth wanting to leave them present so these two hours on the radio\n[laughter] Christmas cards you should get on the air by calling ... nine nine six o five hundred washes the UPS MTV videos on YouTube for listeners anywhere on the bill you we have a New Bedford McCarthy is on the air\n[noise]\nPay will come back to the show back I'm ... I'm\nTrying to remind you of something of a serious nature of course we've been doing a lot of serious things here lately with its Kavanaugh story but it's breast cancer awareness month\nIn fourteen twenty WB is I'm In Hawthorne medical recognizing breast cancer awareness month\nFor you and whether you get the facts and tips to stay healthy uh W. B. S. M. dot com or on our WBAI some ap or we have all kinds of great information there so it is breast cancer awareness month we want to make sure that you you know that along with everybody else\n\nAll right let's go uh talking about what we're gonna talk about it there's if there's nothing else on your mind besides a cat and I think obviously we can talk about it but it is the biggest and one of the most important stories going on in the country it is also sucking the life out of a lot of other stories I mean we had just had a huge trade agreement\nPresident Trump kept another campaign promise by\nWorking on NAFTA [noise]\nAnd you know after what twenty eight years it deserved an update anyway right\nI mean nobody makes an ... know corporations make agreements that nobody makes contracts that long it doesn't make any sense to make a business which that's what was really a business agreement for that long without taking taking a look at it so\nPresident had a major major breakthrough with both Mexico and Canada announced it yesterday\nIn a wide ranging press conference if you didn't get a chance to hear it makes them popcorn I mean it was even if you don't like the guy if especially if you don't like the guy if you like them you'll find a lot of funny moments if you don't like them you'll be angry but um anyway\nPresident's doing his job he's he's got a lot of balls in the air but again there was some big stuff going on with a with the economy and the cabinet story hey look I'm not blaming the Kavanaugh story I mean I think the Kavanaugh story although the NAFTA thing probably affects more people than what cabinet does who knows\n'cause regardless of whether Kavanaugh gets in someone like Kavanaugh is getting in\nNine nine six zero five I'd love to hear from you folks who I never hear from ... out there sitting by the radio say gee I never given critical give me a call it's easy we have fun with it I don't care how you feel about that as well I mean I carry your job I think what I'm saying that it doesn't matter to me in the sense of whether you get on whether you agree with me a disagreement\nBut am interested to hear what's going on out there what do you what do you feel and what do you what are you hearing what do you think 'cause right now we're all in the\nRight now we don't know right I mean I don't know what happened in Nineteen eighty two would cabinet and this woman spending more than you do plus you were there in which case tell me how the FBI worked out we know that interview where do\nWe just don't know so it's a you got to go with a gut feeling that got ... who's telling the truth who's mistaken\nAs I said yesterday to one of her longtime regular callers I said you know at this point I'm I don't see anyone's lying\nI say someone's mistaken in this thing someone who's mistaken about what took place right oh take corporate Quebec stick around uh fourteen twenty W. B. S. M. [noise]\nOh we guard duty and three new burns news does the voting twenty\nFiber optics move crazy amounts of data and even crazier speed and ... and is the one hundred percent fiber optic network\nWith files that connection you'll get the fastest Internet available download speeds up to nine hundred and forty makes TV phone ad a two year price guarantee over Seventy nine Ninety nine per month on line with a two year agreement plus get two hundred dollars toward a range of Google and that's smart home devices and a one hundred dollar visa prepaid card when you order online\nGo to get fired dot com and switched to the one hundred percent fiber optic network one\nHundred percent phenomenal\nIf you love football yelling at television screens with friends and we're including with someone else's name on it [noise] there's a seat waiting for you at buffalo wild wings where you can enjoy football food and put\nAll member of Jews on our new five dollar game day menu cheeseburger fries brush cocktails and pitchers of beer or just five dollars each escaped to\nBuffalo wild wings Bryson participation vary by location not valid with any other offer please drink responsibly\n\nYou think you know despicable me ... years ten things you may not have known about grew in his men you\nDirectors here coughing and Christopher now did the voices for most of the minions including Tim Bob ... Stewart day being Larry [noise]\n... provided the voices for millions Kevin engineering\nOriginally the minions we're going to be grooves henchmen and the big ugly work like Bruce the filmmakers wanted to make more likeable and they felt the best way to do that with surround him with a confidence\nThey looked for inspiration from Willie ... and the job was from Star Wars the sleepy kitty story was made into an actual book and you can buy the accent that Steve grilled chose ... was a mix between a car to multiple on\nAnd Bela Lugosi despicable me was originally titled evil me\nIndians are incredibly resilient they can survive in outer space which means they can resist freezing and don't eat air to breathe and apparently are made up of the same stuff down to glow sticks the filmmakers wanted the cast actors who are graded improv tents casting the grill Jason segal Russell Brand will our net Christian wicks jak prayer\nCan jump David bright and then decay like Christine ... plays mishap during the first one and Lucy and despicable me to the film score was composed by for real Williams and produced by ... and here's a bonus one Margot was wearing a ... shirt and there's a million and The Lorax movie\nThat did this episode of you think you know movies make sure to subscribe like ... ... followers on Twitter and get the latest movie and TV news on screen rush dot com [noise]\nWaste nine nine six three nine nine one [noise]\nMcCarthy McCarthy voting plenty [laughter] [noise]\nAh for me\nI'm a five minute yeah no he oh why don't\nWe [noise]\n\nWe all know\nSame way where you feel ...\nYou know as part of my continued commitment to figure out what exactly what songs will playing at the party that Kavanaugh may or may not have ever been attempted where the Susan took place I Am continuing to play the top hits a Nineteen eighty two\nAnd that was Paul McCartney and Stevie Wonder we're both still with us thankfully ... we really are all the same wherever you go is that true I I don't think so but do you ever been anywhere I look I have I have the people at the same wherever you go\nOr they're quite different actually for they're quite different that's why in some countries you need guns just right on the open I can assure you that er\nWhich my experience [noise] people everywhere not to say and there are measures are good and bad and all of us but some have a little more bad than good so have a lot more good alright fiber way down in six zero if I were to we're going to play all the hits of eighty two\nAnd some point here and it's really by the way I've now discovered I should have been a top forty DJ Nineteen eighty two except that I was eleven\nIt was a protest vote sure well\nI think if everybody here on the social protested the ah the middle of a Baker and the flake or maybe something good might happen\nAnd now let me ask you just have to question because this is actually interesting I'm I'm Glad you brought this up actually for for because a lot of people voted for ... I think as a protest smoke do you\nDo in fact I I think I voted for him in ... but it really enough to do with his positions right oh yeah a lot is because I didn't really find too many negative uh\nWhat about the stuff on on on a on gays\nOh I didn't realize he had a\nBall or did he want he he helped or he helped he's\nHe helped with a with the Ugandans who put the death penalty and plays the gays oh no I Know most people didn't know about it um then that's what we were we were kind of been discussing that with other people in in in media or who cover politics about whether people realize just how\nBad lively someone ... positions were or are they just voted as a protest I knew what you're saying as you were a protest vote you didn't realize this stuff\nAnd and you know as far as a car goes you know if he would like to position sure right for ... for governor no question\nI think he made a good governor governor\nOh yeah well not just funny but I think he would get a lot done\nYou know I Know that you get a lot to I don't think the Senate in the house and have much fun with how the car I don't think they'd push a single bill through his but that's beside the point why don't you got going on\n[noise] well I basically that's about it I think a in a kickback gonna show like a un bury always have good shows on there\nI appreciate that thanks my friend okay All right Bye bye Eli ... and I think everyone here here's a here's a good show feels kinda going from Phil all the way to uh to how we write and of course the national stuff is great All right let's go back to the phones to actually allow him to be us in\nA moniker he's good morning I'm going back to a Feinstein yeah she had this a letter of the nation on cat on a few months before I had in July\nYeah I'm I'm pretty sure uh ...\nUh but the tea also leaked it to her the collies and the Democratic committee members so\nI you know I've heard and again we're all in that we're still in the speculation mode but why you've heard Lindsey Graham make that accusation that she didn't in fact share it with some of her colleagues and we know that she got a letter from a member a Democrat member of the house of representatives and who that woman may lead to we don't know\n[noise] so if they want to investigation which they're crying for well let's have an investigation has the FBI question hates Democratic Senate did did they know the old\nNear ... you know I think Grassley has called for a hearing or at least talked about calling for hearing to lease interview the staff members because they're the ones who usually do the work you know there are the senators don't pick up the phone and leak but the staff select staff members that do it so so you and I believe that may be but it's a smart move right because this woman\nAt least if we believe her and I think if you're going to believe or you have to believe everything she said she wanted to remain anonymous you did not want her namely Jeannette was she was pulled out of a pulled out of hiding by the Democrats [noise]\nWell that's I'm even though she wanted to stay anonymous ... when Feinstein got a letter like that that's a good meal he went to the chairman\nOf course of course it's look this is why you so what I've said from the beginning hears you can you whether you believe the charges on you have to know that the Democrats are not doing this because they really care about these trends are doing it to delay and delay and destroyed at this point\nYes everybody knows that if you know the\nAbout it [noise] ah another thing maybe you know um [noise] uh this lady forward um this is the first time she said ice on Kevin Hart that house or that you know an before\nHe's maintaining that he ... never knew her I think she's claiming she she had seen him around\nAin't seen nothing yet ain't seen nothing yet\nWhen you have a very elderly very slow moving as all of us would be we got to her age um\n\nSupreme Court justice she's a\nCould be the next thing I mean Trump could literally get three appointments in his first term in office not to mention all kinds of other federal budget all across the country I mean you've got it's unbelievable I mean she just felt anyway these are the things I just don't think the Democrats have thought it through strategically I don't um but of course\nMaybe they said well would rather die on the hill to try to stop cabinet I don't know anyway what would take a very quick if you're on hold stick around we'll come back and we'll go right to you but stick around here and fourteen tornado it'd be us and we'll be right back\nTowards being twenty W ... them as crystal clear is pretty much the\nFiber optics move crazy amounts of data as even crazier speed and fires five arise in is the one hundred percent fiber optic network with files that connection you'll get the fastest Internet available to download speeds up to nine hundred and forty ... TV phone added to your price guarantee over Seventy nine Ninety nine per month on line with a two year ...\n[noise] do you think you know the ... brothers well here's some things you may not have known about this directing duo\nJohnny's in cone I've directed more than Fifteen films together but began working together when they were very young they're collaborative directing began when Joe saved his lung money to purchase a super ... camera\nRecreated the films they saw on TV with the brothers are notorious for being scripts stickler says most of their films line for Lyme are exactly as they are on screen as they are on the script some of the actors\nMost frequently cashing their films ... John Goodman and Joel's white French has been dormant in interviews they're usually described as being relatively brief with their responses and less than accommodating often pacing effort of in their behavior\nHowever despite this they're very accommodating to those they work with George Clooney instead of the duo quote they are really very easy to work with will put George that different this episode of you think\nYou know movies and make sure to subscribe like ... ... followers on Twitter and get the latest movie and TV news on screen writing dot com [noise]\nInside New Bedford regional airport [noise]\nBack to the ... show on forging twenty but yet [noise]\n\n[noise]\n\nYou know the sad part that's the primary by John hauling a holdout strength or from the beginning of top song in Nineteen eighty two could possibly been playing the part of the cabinet may may not attended I'm certainly playing at numerous parties do where he was playing the drinking game called devil's triangle\nNo doubt about him\nTop hitting Nineteen eight to one of the things that sad is that I watch these type find this amusing I find this music for you on the brake I could be getting a cup of coffee but no trolling the Internet looking for you for music from Nineteen eighty two\nI think that it occurs to me as boy was MTV's videos back then\nIt was pretty fun\nThey played video now it's just all these screaming talk show screaming a reality t._v. show there's no music television anymore or something you don't remember Jake Tapper was during the news back then on MTV\nShow the world changes and it stays the same it's the same Jake Tapper from CNN was the news boy on MTV or anyone to work with one daughter's part what Beck nickels thanks for patiently holding a lot of them\nWere Chris how are you I'm doing well you\nGood good yeah the hypocrisy that continues to be exposed on the left is just stunning I'm far left\nHim far right the FARC stream right but the the far left as what's in the whole democratic I Know\nI was studying you know it happened I should've said he was a member of the children getting in high school and did cocaine in college and then maybe everybody would've left them alone because that's what Obama did exactly right you know and then it it it's just it's\nActually never said when he stopped doing either\nYou said when he stopped either I'm not a fan I'm not a lefty and it really doesn't bother me um I guess it was kinda\nI'm not old enough to know that but I guess in the eighties there was a done constantly all over the place that judgment on his part but again it wasn't like if you're wearing the things that I don't like what Obama did that doesn't even register on the left\nOr right right yeah I had no effect on you what he did\nNo no not at all and and and I and I didn't vote for him um and they're worried about ice cubes now I mean ... uh what was that one of the other lady is not a while before that ... Kavanaugh exposed is ... and I guess that sexual assault\nBut you know then the hypocrisy comes in if a little girl these opinions in a restroom than it's ... it's all earns right you've got to be part of that but and you know it's just it's disgusting and to be quite honest with you I Know they're playing politics on both sides but if I was the Republicans I Would I\nI don't think I Would have waited this out um I Know its strategy I Know one of the elections coming up but the last the far left in these tactics needs to be destroyed it needs to be destroyed because if they succeed in cabinet are not getting on the court by all these arms unsubstantiated claims and the last minute\nHe has another Jane Doe here's another gene do 'em and if it's even remotely true that the senators and the Democratic party will corroborating with the media to spread this out slowly then\nPeople have to be punished for it in cabinet has to get on the ... otherwise the practice will be used continuously over and over and over and then yes people good people will decide you know I'm not going through that\nWell I think I think that your your last point is the most prescient one which is a good people are going to say hey look I don't know if I drank too much in high school you know go like I don't know what the standard is right because what's the state to state and you're listening\nTo the editor only matters if you're on the other side right you know it only matters in the other side and I really really think\nLike you you were talking earlier about the Senate I think the republic Republicans are going to like going to gain seats in the Senate and I think it's going to take a miracle to see\n... to a lot of Democrats to take the house I don't think they're going to do it I'm too many people are upset at\nI'm way too upset about anyone with a little sense of American history who knows who who had civic switch that means anyone in the last Twenty years in high school doesn't know anything about civic or because they don't teach it I'm\nReally has to be here for um the future of our country in judicial system the loss of presumption of innocence\nYou and you know it's funny is all the immigrants from Portugal team your ideas stories from my uh my my father and my father in law how you could just say something bad about a government official and you could be taken away and\nFurniture and the salads alright yep yep\nSo how can you think people who lived under an oppressive regime be okay with the Democratic tactic the one thing the same thing here in the United states\nBut that's what it is it's no different\nIt's ... it's he teach you when you see these people\nAnd the ... is a great point that I had forgotten about not forgotten but I hadn't made the correlation but you know I look at these crowds going into chasing down people who worked for the Trump Administration or happened to be Republican center\nAnd they're screaming at them remind you what they doing to but when they have the defense in the revolution committees where they knew everything everybody in the neighborhood does noble in front of your house and they'll pick at you and they're screaming yelling keep your family up all night long until you go back to not criticizing Castro\nSo anyone of Portuguese descent honestly looks at the ... that the left is using what a lot\nYeah this is what the left wants to do here in America and and and then they're almost eating quite honestly if they get Kavanaugh of\nGreat call thing going from making next\nI think there's a lot of people out in the country right now we're looking at this and saying what's the standard\nIf I did something that kind of know what happened to Kevin and high school said I'm not concerned the guy was drinking a lot in high school you know why I happen to a guy who's talking right now and this radio station who drank a lot in high school I drink a lot in college\n\nI you know I just don't have the ability anymore right up in the morning I go to places to go you know but\nWe ... we drank colossal amounts not proud of intimate bragging about it just telling me that's what it was a very honest about it than I Know it was stupid I had friends die and drunk driving accident\nBut it was a ... it's a fact it happens and I don't think what what someone does and again I'm I'm not I'm separating the sexual assault allegations let the FBI is going to figure that out or not be able to figure out whatever but I'm just talking now about this new notice how the ... they moved on now it's you know he drank too much\nWhy would a guy standing for the U.S Senate and inform his wife and kids and say you know he got all the time he got loaded in high school and college", "show_name": "The Mike Gallagher Show", "year": "2018", "city": "New Bedford", "day": "02"}