{"month": "10", "state": "MA", "station": "WRKO", "content": "He as a hundred and ten percent a hundred and ten thousand dollars because it went up ten percent they get they get the full market return All right so you have a hundred and five they have a hundred and ten okay\nNow that the your to the market goes down by ten percent\nSo the person that is in the S. and P. five hundred just last ten percent of their money because they have a um they have a security and they can lose money so now they have about Ninety eight thousand dollars in their investment All right\nWell what do you have\nYou have so for a year to you received a zero because the market went down mhm\nBut you still have your hundred and five thousand dollars\nYou didn't lose any money and not only that you still have your previous return because as I said to me protected yeah your own that whenever you make capture a return just like a CD you can't lose it\nAnd you know like I said they're going to give you fifty percent of the S. and P. five hundred because they're taking on all the risk you know they are they are taking on all the risk so let me give you an example we're just talking about this early in the show\nThis will protect you from this and I don't know what the market is going to do nobody does I don't pretend to know if it's going to keep going up guess what you're going to get fifty percent of the S. and P. five hundred you're going to do pretty good I have an illustration of this exact vehicle twelve years back\nThrough I'm Sorry further than that it goes back to like Nineteen Ninety eight so I think it goes Twenty years back at Twenty years back right mhm and it shows two thousand one it shows two thousand eight it shows going through all these things\nIn this product that you're getting fifty percent of the S. and P. five hundred averaged the exact same is the S. and P. five hundred that are pretty close to it\nIt was like six point six point eight percent or something like that\nBecause if you're directly invested in the S. and P. five hundred\nYou lost a lot of money in two thousand eight and you lost the money a lot of money you know potentially two thousand one thank God the markets have rallied like they have\nBecause let me let's talk about that in two thousand eight the S. and P. five hundred last thirty eight percent of its value\nSo you had a hundred thousand dollars in in in two thousand eight you went down to sixty two thousand dollars okay it took you sixty five percent in returns just to get back to a hundred thousand dollars\nWell if you were invested in a fixed indexed annuity in two thousand eight\nYou would have gotten a zero which would have been a wonderful thing\nAnd the following year when it rallied up twenty three are twenty four percent\nYou would have made twelve I think it was like twelve point seven four percent I can show you this illustration of you come in and see me if you come in and meet with me but it and as a matter of fact if you like to come in and meet with me at either my office and hang them\nOn derby street and hang them or Wyman street in a in wall Pam or my office at the ... center in Beverly I either of those three locations give me a call at eight five five three one eight eight three eight seven that's eight five five three one eight eight three eight seven and we'll discuss this All right\nSo David we usually wrap up the showed a with a couple of questions or do you have any emails or yeah\nLet's see uh we I think we've got time for one the one that's one of them All right so here's one from Tom in ...", "year": "2018", "show_name": "Cigar Dave", "city": "Boston", "day": "06"}