{"month": "10", "state": "MS", "station": "WMPN", "content": "Even contemporary every weekend Sunday for rescue can hear a variety of modern performers treats couldn't use it gets a living are twenty put their unique imagine\nIt gets stamp on music and the Eighteenth century earlier I don't I Hope you can join me for some people will be\nSunday Morning at six or impede be music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi W. M. A. W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W. M. A. O. green ...\nCheck out what's happening on MTV music radio and listen online at ... be online dot O. R. G.\n[noise]\nLanded the heat that shaggy would land up the mountain and the flood nearby there that inspired this music by ... [noise]\nThose traditional Scottish lyrics everyone still use to describe the exciting landscapes that Scott led to\nHave you really listen you'll hear that how much of a coup piece of music does the exact same thing [noise]\nYou'll enjoy this musical trip to Scotland hearing about six minutes land of the mountain and the flood and much more on the way [noise]\n\nWhen it comes to the music of Bach there is that typically a theme or program just great notes written on the page his shells missile slept roster Povich and a little music above [noise]\nMm Mm\n\nMm\nMm Mm\nMm\nMm Mm\nMm Mm\nMm Mm Mm\nMm\nMm\n\nMm Mm Mm\nMm Mm\nMm\nMm Mm Mm\n\n\nUh Julius conclusion to the musical depiction of the Scottish landscape how much my Coons land of the mountain and the flood you heard it performed there by the royal ballet since Sonia under the baton of maestro John Wilson\nYou and I'll pop over to Venice a little later this hour next performance from Sweden don't go anywhere\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n\n\nHistory has proven that there's a thin line between war and peace\nThat line was even dinner when it involves Napoleon Bonaparte\nWhen it's forced the defeated Sweden back in Eighteen ten Swedish composer what Keane Nicholas AIG arch responded musically with the symphony this is his symphony number four it's subtitled a war and peace Sweden's ... symphony orchestra performs well\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n", "show_name": "Tech Tent", "year": "2018", "city": "Jackson", "day": "06"}