{"month": "10", "state": "GA", "station": "WUWG", "content": "I'm Fred Child that this is performance today from a PM American public media\nSays his members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nUs on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nThank you for tuning into listener supported chief ... and most importantly thank you for your support I ... and this is our fault fund drive a reminder it is your support that allows us to bring you the programs on TV that matter to you day in and\nDay out please do your part right now at whatever level is right for you good at ... dot org and click donate or call us at eight hundred to two two forty seven eight hate thank you so much for your support have cheap TV [noise]\n\n[noise] from the University of west Georgia Ninety point seven FM Wu WG paying to W. W.\nG. H. G. Carroll part of Georgia Public broadcasting radio network\n\nCity is a free flowing expressive kind of peace and traditionally the title of Rhapsody might include the that it's written in something like Rapid City in B flat\nGeorge Gershwin with making a statement when he called the Jazz Age show piece for piano\nThe evening it's night cap on gp I'm Sarah that's come to the shower\nI'll be with you for classical music of many stripe between now and ... support in Georgia Public broadcasting\nIn addition to the Rhapsody in blue coming up our immediate Komen's afro Cuban ...\nAnd the planets by Christopher home which just celebrated its hundredth anniversary\nLive from NPR News in Washington I'm ... President Trump is celebrating what he calls the biggest trade deal in us history NPR's Scott Horsley reports the updated agreement with Mexico and Canada could give a boost to American dairy farmers an auto workers\nAll amounts to a rewrite of the quarter century old NAFTA agreement which President Trump is often criticized\nIt gives American dairy farmers new access to the Canadian markets and is designed to encourage more auto production in the United states more auto parts and automobiles will be manufactures inside the United states we will be manufacturing many more cars for the White House deadline approaching candidate\nMore auto parts and automobiles will be manufactures inside the United states we will be manufacturing many more cars\nFor the White House deadline approaching candidates signed on to the deal late Sunday night the agreement leaves in place for now us tariffs on imported steel and aluminum as well as the retaliatory tariffs that Canada and Mexico and post and response Scott Horsley NPR News Washington\nAs the death toll continues to rise from last friday's massive earthquake and tsunami in Indonesia President Trump is sending condolences to the country and its president at a Rose Garden press conference today Trump said he is dispatch first responders including the military and others to help in the aftermath of the disaster\nOfficials say the earthquake and tsunami wave that struck there have claimed the lives of at least eight hundred and forty people and\nDestroyed thousands of homes triggering immediate humanitarian crisis perhaps the hardest hit area of the city near Palo another earthquake that struck the country today the it's not clear though whether that caused traditional damage\nThe White House has released a memo analyzing the testimony of Christine Blasey Ford by the prosecutor who questioned or before the Senate last week NPR's Kelsey Snell reports sex crimes specialist Rachel Mitchell says she believes ... Ford's accusations would create a weak case\nTo the Syrian Committee Republican hired Mitchell to question for Dr accusation that Supreme Court nominee Brett Kavanaugh sexually assaulted her more than Thirty years ago and the nano Maker Faire she does not being a reasonable prosecutor would bring a case based on the evidence for present it\nForward identified written either refuted her allegations or failed to corroborate sports lack of details about the party where she alleges the attack took place undermined her claim\nThe FBI is now investigating fourth accusation against cabinet and another accuser who had come forward in recent weeks now NPR News Washington\nA group of business economist is forecasting the U.S economy will continue to grow to healthy pace this year into next\nThough Congress that the national association for business economics say the Trump administration's trade policies could potentially slow growth the survey fifty one economist forecast us economic growth a two point nine percent this year from two point three percent last year next year the group predicts the economy will expand at a to point seven percent annual rate\nA mix clothes on the first trading day of the fourth quarter the Dow is up a hundred Ninety two points Jay the NASDAQ closed down nine points you're listening to NPR\nToday marks the one year anniversary since a man opened fire with an outdoor music concert in ...\nI'm points you're listening to NPR\nToday marks the one year anniversary since a man opened fire with an outdoor music concert in Las Vegas killing fifty eight people before turning the gun on himself and beers Windsor Johnston reports the shooting sparked a nationwide debate over bump stock devices that allow semi automatic weapons to operate more like machine guns sale\nBump stocks is still legal in most states despite efforts in promises from lawmakers to ban the devices Andrew Patrick with the coalition to stop gun violence says there's been some action on the state level but very little on the federal\nWe were told by Speaker Ryan that they would take a look at bump stocks there was never a hearing on that in the house of the president told us that the Parkland or bump stock for done that he was going to get rid of them are we know that's the case the ATF has still been caught up in the bureaucracy and and banning these accessories\nPresident Trump has reiterated his pledge to get rid of bump stocks saying he expects to finalize restrictions on the devices within the next several weeks Windsor Johnston NPR News\nOfficials in Georgia today called in the capital re after a tractor trailer caring eighty nine cows overturned this morning interstate Seventy five and I to eighty five sending animals fleeing causing accidents and clogging morning traffic\nCobb County police at last words at all but two of the cows have been recovered ten animals were killed in the crash law enforcement officials directed a metal barrier and some real cowboy sub law enforcement to round up the way we are to animals\nCould also features prices closed higher today oil up to ... percent to Seventy five thirty a barrel in New York I'm jak spirit NPR News in Washington\n\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home and visor dot com [noise]\nGershwin Rhapsody in just a moment night Kathy ... than I thought [noise]\nNights tennis and killed Chris Pine has both jazz and classical child [noise]\nImportant to find the right balance Gabby impractical when you're playing music and dancing up can be over done [noise]\nThat killed ... thing\nAnd he says I'm pointing to find the right balance between jak the classical when you're playing music I first jumping up can be overdone [noise]\nBut ... says peace is a master piece of cake you more than a decade of having it in his reputation\nTo weigh that it's such a volatile stylistic blend second by second oh\nWe're going to hear the Nineteen twenty four version for piano and jazz band at the range by friday grow Faye here now the volatile second by second energy of the Rhapsody in blue\nAnd I love that this recording credits not only piano Carol ... signed the St Louis symphony orchestra and conductor David Robertson but also the clarinet if Scott Andrews\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nMusic by George Gershwin arrangement by fear to grow fake\nLouis symphony orchestra conductor\nDavid Robertson and pianist ... Stein\nResigned described that piece of the volatile stylistic blend he says there are moments were ... diluting to jazz and interrupt to say I ... I can do that I can do Tchaikovsky no problem he says it's a piece that naturally playful\n[laughter] I'm Sarah das law it's night cap on ... and you can see the planets with recording details at G. P. B. news dot org slash programs slash nightclub\nLet's hear now a music that combines afro Cuban influences with the traditional when quintet imani when there's a group founded in Nineteen Ninety seven one of its founding members is polluted and composer Valerie Coleman and this is herpes afro Cuban concerto for when queen tacked\nBesides flute we'll also be hearing and although a clarinet or the ceiling and a French horn\n\nAnd\n\nLater when my grandmother\nWas a Muslim ... la la la la la la la la la\nLa\nLa\n\n\n\nLa la la la\nLa\n\n\nLa la la [noise]\n\nNa na na\nDa da da da da da\n\n\n\nDa da\n\nBut like the ... [laughter]\n[laughter] what what we're going to do\n\n\n\n[noise]\nMan you know [noise]\n\nWho doesn't you know\nIn\nThe middle of the world\n...\nWas one\nI'm really\nOne when I was\n\n\n\n[noise] ... played music by one of their own members flew to Valerie Coleman that was Coleman's afro Cuban concerto for wind quintet\nValerie Coleman was born in Louisville, Kentucky got her music degrees in Boston in New York has been composing and playing flute since she was a kid she wrote that in two thousand one\nI'm Sarah ... thanks for being here for night kept this evening after that quarter hour with wind instruments let's spend the next quarter hour or so with the top three members of the ... music of divorce Jacques here this is divorce rocks to settle for violins it'd be all\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n\n\n\nNa\n\n\n\n\n\n\n\n\n\n\n\n\n... trio for a pair of violinist at one of the meal\nDivorce Jacques ... into a trio for a parent violinist and one of the list and we heard members of the chilling Girion cortex closing the first hour GBDs night cap with that music ...\nHead on night cap the planets by goes to host a great piece that celebrated its centennial\nRoosters listener supported G. P. B. that means people who listen just like you're doing right now provide the most important and unreliable share of the funding that keeps the programs\nYou rely on and enjoy on the air\nI'm Don Barclay and it's our fault sunrise\nAnd right now I Hope you'll join our public radio community and\nDVD is stronger and better with your support quick and easy to give on line at gp dot org for coal eight hundred\nTo two to four seven eight eight and thanks\n[noise] from the University of west Georgia mind be point seven F. L. W. W. W. W. A.\nG. H. G. Carroll good order but Georgia Public broadcasting radio network\nLive from NPR News in Washington ... Stevens President Trump says the FBI should do a comprehensive investigation into the allegation surrounding Supreme Court nominee Brett Kavanaugh at NPR's Mara Liasson reports Trump also says that Senate Republicans should determine the scope of the probe\nPresident Trump said he wants the investigation to end quickly and that the FBI should look into whatever the Republican Senate wants it to he said he believes cabin all was truthful and his testimony and that his family has been treated horribly but he also said he has no backup plan if Kavanaugh should withdraw or be rejected by the Senate\nI Hope that he gets approved I Hope that the report comes out\nLike a ... like I really think it should I think it will I Hope\nOr be rejected by the Senate I Hope that\nHe gets approved file that the report comes out\nLike a ... like I really think it should I think it will I Hope\nBut look I'm waiting just like you the president said he was surprised how vocal Kavanaugh was about his drinking problems in high school President Trump doesn't drink which he joked today was one of his only good traits Mara Liasson NPR News Washington [noise]\nNorth Korea is warning the United states than a declaration to end the Korean War should not be seen as a bargaining chip\nAnd talks to end Pyongyang's nuclear program and or its official news agency claims the country has taken when it called significant steps to end hostile relations between the two countries\nBut it says the U.S has said doing those actions through sanctions it also says the formal end the Korean War can never be seen as a bargaining chip burned denuclearization\nPresident Trump is celebrating what he calls the biggest trade deal in us history Canada's prime minister Justin Trudeau he's also talking up the benefits of the new continental trade agreement as Dan ... reports Trudeau brief provincial leaders earlier today\nTrudeau says the United states Mexico Canada agreement will modernizing stabilize the economy and guarantee a higher standard of living over the long term the Canadian prime minister says the agreements still needs to be ratified by all three countries but Trudeau says he and his American and Mexican counterparts agree that this trade deal would strengthen their close partnership\nNot everyone in Canada is pleased representatives of the dairy sectors say will undercut their industry by opening up the Canadian market to American products\nAnd there's concern that the tariffs on Canadian steel and aluminum are still in place by the head of you know for the auto workers union says overall us MCA as it's known will provide benefits for Canadian workers and the economy for NPR News I'm Down carpeted shark in Toronto\nSome four days after an earthquake and tsunami devastated much of Indonesia civil ways the island the region is still experiencing aftershocks the quake another quake hit the region today as the search for trap survivors continues\nA disastrous claimed at least eight hundred forty lives and destroyed thousands of homes the hardest hit area is near the islands capital city of ... President Trump says the U.S descending first responders to aid disaster relief efforts [noise] this is NPR News [noise]\nDry university one of the nation's largest for profit colleges is being sold to Connecticut based venture capital firm palm ventures if the deal is finalized\nUniversity one of the nation's largest for profit colleges is being sold to Connecticut based venture capital firm palm ventures\nIf the deal is finalized pumps EEO Bradley Palmer would become CEO and chairman of the national education chain he already runs Caldwell education L L C which owns a small profit for college in San jose\nThe business friendly trauma administration has given a tentative green light to the sale the department of education says that ... must honor promises previously made to students including a commitment to disclose a variety of information about costs and student debt [noise]\nThey're selling it just one from Texas the other from Japan share this year's ... prize for physiology or medicine has Houston Public media's Davis land tells us the cold winters are being recognized for advanced in cancer treatment\nThe Nobel Committee says James P Allison in ... both discovered ways to use the body's immune system to fight off cancer Alison spoke at a press conference this morning he thinks patients in clinical trials instead of receptor called C. T. L. A. for was key in his discovery\nProtected after St George for was the breaks open source or role as just disabled or breaks for several hours near systems or to attract transfer from a friend of\nOurs and says it's the first ... given to a cancer therapy drugs developed from the method treat melanoma and other cancers for NPR News I'm Davis land in Houston\nOn Wall street stocks closed mixed the down gain hundred and Ninety two points this is NPR News in Washington\nSupport for NPR comics for NPR's stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum but your who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\nAnd this is night cap on gp I'm Sarah as I saw\nSeptember mark ... big centennial for a big piece a hundred years since the premier of the planets bankers composer good stuff ...\nNearly our lungs sweet depicting the astrological character seven of our solar systems planet had a huge influence not only another concert composers but also an film composers including several generations later John Williams when he was coming up with music for Star Wars\nFor NPR's weekend edition ... put together at six or seven minute piece about them\nReal generations later John Williams when he was coming up with music for Star Wars\nFor NPR's weekend edition Tom ... and go put together six or seven minute piece about the planets in its history and it sounds and it's a legacy and recommend you look that up sometime when you're not listening to me it's called the planets that one hundred a listener guy to whole solar system\nTonight instead of talking more about the planets let's listen to them the seven planets we'll hear our Mars to bring her of more Venus the bring or of peace mercury the winged messenger Jupiter the ringer geology Saturn to bring or of old age urine is the magician Neptune the mistake\nSimon Rattle conducts the Berlin Philharmonic on gp be in this century old music the planets by ...\n\n\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\nOoh ooh\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\nWho\n\nOh\n\nMm\n\n\n\n\n\n\nOr\nWho\n\nWho these men were then you know no one or\nTwo a\nOr\n\nAnd\n\n... one\n\n\nOh whoa\nWhoa\n[noise]\n[noise] [noise]\n", "year": "2018", "show_name": "Nightcap", "city": "Carrollton", "day": "02"}