{"month": "10", "state": "GA", "station": "WUWG", "content": "I'm Fred Child victims performance today from a PM American public media\nIs members supported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook\nNetwork you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nGeorgia is outdated voting machines have made headlines this year but state officials say they're just one piece of the larger election puzzle\nSomebody conceding or the news calling something has zero effect on anything we do we still have to account for every ballot this cast and even it doesn't end up in the morning after the election\nI'm Steven Fowler I'll take a closer look at how\nGeorgia's elections are run tomorrow on MORNING edition and all things considered [noise]\n\nFrom the University of west Georgia because Ninety point seven FM W. W. W. W. A. G. H. G. Carroll good part of Georgia Public broadcasting radio network\nNew recordings hits me coming up after news\nYou this recording done they can come from the ... my I can also join a camping Dan Rather than make it but\nTruck at how the cat is\n[noise]\nLive from NPR News in Washington I'm ...\nAfter a brutal confirmation battles for his Supreme Court nominee president Donald Trump took a victory lap at the White House tonight joined by newly appointed associate justice Brett Kavanaugh drop attack Democrats another so weak used of carrying out a campaign of personal and political destruction based on lies and deception\nWhat happened to the cabinet or a family violates every notion of fairness decency and due process [noise] our country a man or woman wants to always be presumed innocent\nFairness decency and due process [noise]\nOur country a man or woman wants to always be presumed innocent unless and until proven guilty\nCapital for his part thanked those who put him on the court while acknowledging the contentious confirmation process the ceremonial swearing in comes two days after the officially joined the cord less than a month before ... mid term elections\nBumps superstar Taylor Swift designing her voice of the political realm and Instagram post swift says she could not support Marsha Blackburn a Republican Congress woman running for US Senate from Tennessee instead swift actual vote for Democrats ... reports which is urging\nHer fellow millennials to vote and said she would be casting a ballot for candidates to fight for human rights and support L. D. P. T. Q. racial and gender equality like Ken I'm In Tennessee and Democrats\nTo switch could have a big influence on getting young people who are now young voters with jobs student loans and mortgages to see themselves as part of the political process\nWhereas before we never thought that we could make an impact now we have no choice but to have the option to try to make an impact\nThat tendency on Republicans say swift boat sway many young voters but do you hope more cast ballots in November ... and ...\nYears since a firestorm in northern California wine country that let forty four people dead and damaged Twenty one thousand homes or Sarah Hussein ... of member station ... reports Napa County officials are testing out new ways of communicating with the public during emergencies\nIt's windy and warm here in Napa red flag warnings are in effect I'm not like it was a year ago\nWhen the county sheriff's deputy ... drove around searching for people to rescue some of whom because of uncoordinated and delete alerts were worn too late\nTo focus on people that you couldn't get to what you could have done differently\nThat sentiment that's dragging several changes Sheriff John Roberts in is putting special disaster sirens on squad cars to let people know\nIt's time to tune in time to turn on your television to turn on your cell phone to work with your neighbors communicate\nOther changes include mailbox evacuation tags for those who've left and a federal cell phone warning system set to debut here on Tuesday for NPR News I'm Sarah Varney in\nThe stock market was open on this Columbus Day holiday with a mix close the Dow was up thirty nine points to twenty six thousand forty six the NASDAQ bill fifty two points [laughter] this is NPR\n\nUh thirty nine points to twenty six thousand forty six the NASDAQ they'll fifty two points [laughter] this is NPR\nPresident Trump apparently spent some time today talking with his deputy attorney general Rod Rosenstein though at least for the moment it appears the president does not intend to fire Rosenstein\nRosenstein ... tenure at the Justice Department's been viewed as somewhat tenuous since remarks he supposed to have made about secretly recording the president or invoking constitutional powers have Trump removed from office\nRosenstein who oversees special counsel Robert Mueller's Russia probe is denied those reports\nNew laws ended the prevention of sexual harassment on the job take effect tomorrow in New York NPR's Yuki Noguchi has that story\nNew laws take effect almost exactly a year from the start of the me too movement public allegations of sexual harassment and the resulting Alister as many leaders in industry and government have transformed the workplace culture\nThat new laws require every employer to conduct interactive prevention training of all its workers every year it also requires employers to publish and provide their policy to employees\nAnd and foreign and about how to file complaints experts say while many larger employers already had sexual harassment policies in place many smaller ones are unaware that this new law also applies to them you can ... NPR News Washington\nFacebook as wading into the live video calling space the social media giant announcing his first brand electronic device called portal a camera equipped gadget that makes it easier to make video calls the device will feature artificial intelligence to out of the camera to automatically track and pandering calls\nPortal comes in to sizes and will sell for between two hundred and three hundred and fifty dollars I'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Newman's Own foundation working to nourish the common good by donating all profits from Newman's Own food products to charitable organizations that seek to make the world a better place more information is available at Newman's Own foundation dot org [noise]\nAn ethics and he says my cat um they're going to put a TPP I'm sad that\nOpenness nights music and not turn out\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise] Mm Mm\nWell [noise] [noise] Mm Mm\n\n\n\n\n\n\n...\n\n\n\n\n\n\n\n\n\n\nWell\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n...\n\n\nWe're\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nWe're\n\n\nOr\n\n... ...\nInside of me I can I be plays music of\nComing up after the news here on this new supporting TPP to have you seen the\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\nAh\n[noise] Georgia's outdated voting machines have made headlines this year but state officials say they're just one piece of the larger election puzzle\nSomebody conceding or the news calling something has zero effect on anything we do we still have to account for every ballot this cast and eat it and it does it in the morning after the election\nI'm Steven Fowler I'll take a closer look\nAt how George just elections are run tomorrow on MORNING edition and all things considered [noise]\n\nFrom the University of west Georgia because Ninety seven FM Wu WG pain W. W. P. H. D. Carol ... is the Georgia Public broadcasting radio network\nLive from the news in Washington a joyous Snyder the newest justice of the Supreme Court will be on the bench in the morning when the court hears oral arguments NPR's Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in at the White House for Brett Kavanaugh\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind it and he promised to serve in a non partisan fashion\nI was not appointed to serve one party or one interest but to serve one nation\nWell Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a kid\nSo but to serve one nation well Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a campaign against Kavanaugh he called dishonest and deceptive the president thinks ceding the new justice will give a political booster Republicans in the mid term elections Scott Horsley NPR News Washington\nFederal investigators are looking into that deadly limbo crash in upstate New York to kill twenty people the chairman of the national Transportation Safety board Robert Sumwalt says his agency has hard questions for prestige limousines\nCompanies safety culture\nCompany's records\nRecords of prior clashes their management of drivers their fatigue management program vehicle maintenance fitness for ... driver fitness for duty we want to look at everything that we can relate into the company that operated that Lehman same\nState police say the crashes the subject of an ongoing criminal investigation earlier this evening more than a thousand people attended a vigil\nIn Amsterdam New York Florida's panhandle preparing for hurricane Michael shelters expected to begin opening up on Tuesday Ryan daily of member station WFSU reports of Tallahassee mayor Andrew Gillum is urging the public to take precautions\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including our mind to thousands Seventeen but he says the state's panhandle region should brace itself or an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages\nThose who would rely on our electric utility system for their livelihood\nWe would recommend that day\nFind a place to ride out the\nMandatory evacuations have been called in some coastal counties Michael is expected to make landfall Wednesday for NPR News I'm Ryan daily in Tallahassee\nThe international Monetary Fund seems more pessimistic about the global economy the IMF has released an update to its world economic outlook\nDownright grading its forecast for this year and for twenty Nineteen the IMF now says it expects the global economy to grow three point seven percent down from three point nine percent it was forecasting in July ... Ming a variety of factors including trade tensions between us and China this is NPR secretary\nOf state Mike Pompeo is calling on the government of Saudi Arabia to support what he says should be a thorough and transparent investigation\nSyria's state Mike Pompeo is calling on the government of Saudi Arabia to support what he should be a thorough and transparent investigation into the disappearance of Saudi journalist ...\nIssued a statement tonight seeing senior State Department officials have spoken with a Saudi Arabian government which are we as a critic of the Saudi Government who has written for the Washington Post Turkish officials believe he was killed inside the Saudi council to Istanbul last week\nInterior secretary Ryan Zinke he is taking action against new mining Montana's Yellowstone National park you know so in public radio scale Adderall shows more\nI think he returned to his home state of Montana he signed papers that put a hold on mining of thirty thousand acres of federal land there\nThere's places that mine to there's places to more\nAnd you have to look at the American conservation ethic of\n... best practices greatest good\nTo land off limits to development is known for its natural resources and tourism that document extend protections put in place during the Obama administration and twenty sixteen but otherwise would've expired next month the withdrawal of those lands last Twenty years which is the maximum length of time and interior secretary Ken Grant\nFor NPR News I'm Caleb ...\nThe regional markets a financial markets in Asia down and Tuesday trading Asian chairs are slipping following a mixed day in the U.S the Dow closed up thirty nine points of thirty and Monday trading but the NASDAQ was down fifty two points in the U.S and the end of the day almost flash [noise] this is NPR News\nSupport for NPR comes from NPR stations other contributors include the huge charitable trust celebrating Seventy years of serving the public learn more ... trust dot org slash Seventy\nAnd the ... foundation at ... dot org\nAnd on with night cap here on gp good evening I'm Sarah ... thanks for being late at night\nWe got until midnight to share music together and I'd like to begin this hour with a new recording of ... Ashkenazi who has been making recordings for decades and is still going strong within the recording of boxing French sweet\n... didn't titled these French sweets someone else gave him that name but it works because each is a collection of French Style dances and mom decorum Sarah up on the ... or ... maybe a ...\nBut uh it works because he is a collection of French Style dances and my mom decorum Sarah Don demean us or ... maybe ... and they all end with ... in other words they dig and after his approach playing the music on this recording by asking us he says\nI tried to have as clear sound it's possible\nThe music is transparent and ... own instrument was terribly clear so this has to be taken into account and he's very few ornaments and don't think the sound of the ... the court the piano is what we have today when I Try to do he says is play on what we have today and make the combination of voices as clear as possible\n[laughter] let me ask you cannot be applying his clarity now to a modern piano in French sweet number one in the minor by Johann Sebastian Bach\n\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\nMen women\nNa\n\n\nAnd\n\n\n\nNa\n\n\nPanic let them your ... in a new recording I'm French sweet number one in the minor by by Johann Sebastian Bach\nThe latest recording from a venerable piano\nMusical stocks opening this hour a night cap on gp I'm Sarah that's all you can see the planets with details about the recordings CPB news\nOpening this hour a night cap on G. P. B. I'm Sarah that's all you can see the play at least with details about the recordings G. P. B. news dot org slash programs slash Nike cap ... news dot org slash program slash night cap\nAnd at this point in the evening I like to settle this and with a long piece to escort us on the way toward midnight and whatever the nice cold [laughter] let's hear violinist Arab ...\nWent through a violinist by the name of Arab Ella Stein bacher with the Berlin radio symphony orchestra and conduct ... concerto by check composer on Janine divorce shock\nDoor jak violin concerto in a minor it's only a violin concerto with Arab analysts linebacker on G. P. B. [noise]\n[noise]\n\n\n\n\n\n\n\nNa\n\n[noise]\n\n\n\n...\n\n\n\n\n\n\n", "show_name": "Nightcap", "year": "2018", "city": "Carrollton", "day": "09"}