{"month": "10", "state": "GA", "station": "WUWG", "content": "I'm Fred Child this is performance today from eight PM American public media\nJust as members supported G. P. P. we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and\nThe gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening when a life\nHangs in the balance what does beyond a reasonable doubt really mean\nTroy Anthony Davis on John ... from my\nGPA be present the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know\nThe story follows the death penalty case of Troy Davis joined us at ten am on Sunday October twenty first starting G. P. B. radio\nFrom the University of west Georgia this is Ninety point seven FM Wu WG and W. W. G. H. B. Gerald Ford of Georgia Public broadcasting radio network [noise]\n\nMonday evening\nI'm Sarah's asked waiting for ... for the next two hours here and you can quickly soured because they should leave romantic quintet for piano and strings\nFirst in in ... he doesn't\n\n\n\nLive from NPR News in Washington I'm jak sphere\nSecretary of state Mike palm pale travels from Saudi Arabia to turkey as he pushes for a full investigation into the disappearance of a Saudi journalist turkey says ... was killed when he went to the Saudi conflict is symbol they'll do Saudis denied any knowledge of that more from NPR's Michele Kelemen\nSecretary Tom Perez says he had a candid conversation in Saudi Arabia and in every one of those meetings they Saudi leadership strongly denied any knowledge of what took place at their consulate\nAnd it candid conversation in Saudi Arabia and in every one of those meetings that Saudi leadership strongly denied any knowledge of what took place at their consulate in Istanbul his statement says there's a serious commitment to determine all the facts and ensure accountability\nPresident Trump spoke by phone with the Saudi crown prince wild on bail was there and came to the same conclusion writing on Twitter that Mohammed bin Salman totally denied he knew what happened\nTrump goes further in an interview with the Associated Press saying he sees this as an attempt to declare the Saudis guilty until proven innocent\nMichele ... NPR News Riyadh\nDemocrats have continued in even strengthen their financial advantage in the fight to control the house of representatives NPR's Peter Overby says the numbers told the story and third quarter reports just filed at the federal election commission\nIn sixty two races that will determine the house majority Democrats have consistently and dramatically outraged Republicans last quarter the Democrats collected a hundred and forty million dollars to Republicans fifty one million\nA couple of specifics outside Austin, Texas Democrat M. J. Hagar raised one point nine million compared to not quite six hundred thousand for a long time Republican incumbent Jon Carter\nSome races are closer than that in Wisconsin districts it's been represented by house Speaker Paul Ryan Democrat Randy Bryce pulled in one point four million or Republican Brian style wasn't far behind it just over a million as for the polls the races are generally tighter\nPeter Overby NPR News Washington [noise]\nCuban diplomats and their supporters disrupting the un meeting called by the U.S to spotlight the islands treatment of political prisoners protesters loudly banging tables and shouting and Spanish too but he asked us blockade no\nThe protesters rounded out us stepping in Bastrop Kelly curry senior drop a bit of stretch and officials or the secretary general of the American the organization of American states above the noise in the U.S chamber was aware protests by accredited diplomat to have a right to attend any open un meeting\nAlso shows the generation of us Cuban relations or the Trump Administration pulling the restoration of ties with the island nation under then president block Obama in two thousand Fifteen\nNumber of help wanted ads went up in August Labor Department says job openings rose aid tens of ... percent to seven point one for a million that's more than a six point two million people on the unemployment rolls last month\nOn Wall street a strong day the Dow jumped five hundred and forty seven points you are listening\nMore than a six point two million people on the unemployment rolls last month on Wall street a strong day the Dow jumped five hundred and forty seven points you're listening to NPR\nOf federal judges approved a settled in between Tesla CEO Elon Musk and securities regulators over his infamous message on Twitter about taking the company private\nThe SEC to argue the message was posted was misleading harmed investors who bought stock in the electric car company the company letter announced it was not going private the SEC find mosque and the company a total of forty million dollars and settlement agreement allows him to hold onto a CEO posed but he's given up his seat his company chairman for three years [noise]\nAnd NPR News investigation finds women in prison get disciplined more than men for smaller infractions Here's NPR's Joseph Shapiro women get punished at higher rates often two to three times higher for those lesser and non violent violations of prison rules for things like in someone's disrespect\nFor cursing or disobeying an officer\nNPR and the ... school of journalism at Northwestern university\nAnalyzed data from Fifteen states\nAnd found punishments even for small and fractions can have big consequences women go to solitary confinement they lose good comic credits that would reduce time in prison and they lose phone and visitation privileges\nThat cuts off mother's from children more than half of women in prison or the mothers of children under the age of Eighteen\nJoseph Shapiro NPR News new U.S astronaut who survived last week's failed launch an emergency landing after problems with the Soviet liftoff says he knew we needed to remain calm\nUs air force colonel Medicaid and Soviet cause not were on their way to the international space station was ... years rocket failed their capital ripped away and as designed plummeted earth both men are okay\nI'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include live lock lifelike with Norton works to help protect identities and the information on devices from cyber criminals learn more at life log dot com and the ... foundation at ... dot org\nCPB night cat unfair that's not good evening music had\nMaybe I shouldn't say that they get a kind of energy from a live audience that they just can't duplicate in a recording studio I Know it's possible to create great recordings in the tail and it's possible to be less than inspired in front of a live audience that right now we're going to listen to a recording that bears out in the general principle that great\nAccording to the studio and it's possible to be less than inspired in front of a live audience but right now we're going to listen to a recording the bears out in the general principle that great performances can come from playing before live audiences\nThis fabulous performance issue on piano quintet took place in Holland the concern about concert house in the mid nineties Marta arguments is the piano and the four string players joining her are Dora shorts bird in the whole ... ... and ... chill out\nThe piano quintet in each class by Robert Schumann with martial arts rich and friends live in concert\n[noise]\n[noise] well\n[noise]\nNah nah\n\n\nKnow\nA\n\n\n\n\nNah nah a\nDuring World War\n\n\nAbove\n\n\n\n\n\n\n\n\nNa\n\n\nSupport for ... comes from generous listeners like you in the fast paced world you want to have access to news when you need it check out our Web site at gp news dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performances from great musicians in our GDP music present series\nFor information and entertainment you cannot gp the news ... news dot org [noise]\nFrom the University of west Georgia because Ninety seven FM Wu WG pained W. W.\nH. D. Gerald Ford of Georgia Public broadcasting radio network\n\nFrom NPR News in Washington I'm neuron\nPresident Trump is still standing by members of the Saudi ruling family as they continue to deny knowing anything about the suspected killing of Saudi dissident and legal us residential market she'll give Jay\nNPR's Mara Liasson reports Trump told Fox News that if the Saudi ruling family knew about what happened to his show good cheap that would be bad but he also tweeted that he talked with the crown prince who quote totally denied any knowledge of what took place inside the Saudi conflict in Istanbul\nTrump tweeted that he had no financial interests in Saudi Arabia\nThey denied any knowledge of what took place inside the Saudi consulate in Istanbul\nTrump tweeted that he had no financial interests in Saudi Arabia that may be true but in the past he's boasted about how much Saudi money comes to him in the U.S and twenty Fifteen he said that the Saudis quote they buy apartments for me they spend forty million Fifteen million am I supposed to dislike them I like them very much\nMeanwhile there are bipartisan calls in Congress for sanctions against Saudi Arabia Mara Liasson NPR News the White House\nAbout Ninety percent of all the immigrant children separated from their parents at the border have now been released from us custody but as NPR's John Burnett reports more than two hundred children remained in shelters\nThe office of refugee resettlement that oversees the government's youth shelters reports for two thousand three hundred and sixty three migrant children who were taken from their parents as part of the Trump administration's controversial zero tolerance policy have been released as of Monday\nOf the remaining two hundred and forty five kids still in shelters a majority of them are there because their parents were deported back to Central America\nThe American civil liberties union which successfully sued the government to reunify families says almost all the parents back in Central America had been contacted to find out if they want to be reunited with their children\nAnd ACLU attorney says two thirds of those deported parents want their kids to remain in the U.S where there'll be safe from criminal gangs and food insecurity and their hometowns John Burnett NPR News\nDoctors at the Centers for Disease Control are tracking a rare disease that affects mainly children it's called acute ... mile lightest and causes partial paralysis Dr Nancy ... says is affected more than one hundred people this year\nTwenty teens so far ... has received the port of one hundred and twenty seven patients under investigation key wise Casey sixty two cases have been concerned as ap and\nShared his parents to seek medical treatment right away if their child develops a sudden the weakness or a loss of muscle tone and the arms her legs she says she's frustrated doctors have been unable to so far to identify the cause of the illness\nIs closed higher today the Dow is up five hundred and forty seven points just over to present the NASDAQ rose almost three percent and the essence he was up more than two percent and this is NPR News analyst say part of the reason for the game\nAlmost three percent and the U.S and he was up more than two percent and this is NPR News analyst say part of the reason for the games on Wall street today which some positive company earnings reports NPR's Jasmine Garsd reports on the digital streaming company Netflix\nNearly seven million people subscribe to Netflix\nJust in the last few months that's according to the company's latest quarterly report it streaming revenue grew to about four billion dollars net flicks shares were up ... percent at market closed and continued to rise in after hours trading\nIn the report Netflix predicts it will continue to grow for the rest of the year adding nearly ten million more subscribers in the fourth quarter Jasmine Garsd NPR News New York\nThe Labor Department reports the job openings in the U.S rose in August to the highest levels since it began keeping that statistic in two thousand it says that we're a seven point one four million open jobs far more than a six point two million people who are looking for work that month\nThat suggest companies are finding it increasingly difficult to find qualified workers\nThe death toll continues to rise six days after hurricane Michael's slammed into the Florida Panhandle officials now say at least twenty six people died in Florida Georgia North Carolina and Virginia tens of thousands of homes and businesses are without power\nCanada is legalizing marijuana starting tomorrow it becomes the second country after you're going to allow the recreational use of the drug it's already tomorrow in Newfoundland so sales are now legal their candidate has authorized the medical use of marijuana since two thousand one\nI'm neuron NPR News in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and Brazil game cities at rock found dot org and Americans for the arts [noise]\nI had this hour and in the hour sitting by Alexander didn't mean to make the\nTurn of the century Vienna\nBut let's begin back in the borough Clinton music by Garrett Philip calamine\nIn a group called the public music pe you B. L. I. T. K. U. S. I. C. K. Stevens zone is director of the public music and tonight let's hear the trio to not an F major ... although I Am in continual like mine\n\n\n\n\n\n\nA cell\n\n\n\n[noise]\n\n[noise]\n\n...\nOr\nOil\n\n\n\n\n\n[noise]\nWell", "show_name": "Nightcap", "year": "2018", "city": "Carrollton", "day": "17"}