{"month": "10", "state": "GA", "station": "WUWG", "content": "I'm Fred Child this is performance today from eight PM American public media says his members supported TPP we're in Eighteen station radio network you can listen online at ... dot org and you can\nYeah this is member supported G. P. P. we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nWas off on a lecture night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country listen on election night then wake up and hear what the outcome means for America on MORNING edition\nCritical election is central coverage in John you\nJoin us for all the results on election night starting at eight Iran GB\nFrom the University of west Georgia is Ninety seven FM Wu WG and W. W. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\n\nSo maybe it's not the flashy his music\nIn the lead up to ... death in health was poor in his professional life wasn't going well either is needed was seen as tormented meditative lacking necessary brilliance it was barely played in public concerts\nSo mostly where she was able to share his music was in the evenings of domestic music making ... one person who did appreciate him was a young composer Robert\nSchumann here's what he said about ... he has sounds to express the most delicate feelings\nOf thoughts man however manifold are the thoughts and desires of man all their thousand facets or to be found in the music and paper lines there that's a this is Knight capital and coming up this hour on gp be the final piano sonata by Franz Schubert ooh\nLive from NPR News in Washington I'm ... beer brothers Cecil and David Rosen power eulogy ... in Pittsburgh today as part of the fabric of the local Jewish community W IDS Katie by reports do manned developmental disabilities were killed in the shooting Saturday at the tree of life synagogue\nShe wouldn't coffins were loaded into a hearse mourners crowded around Kansas thing\nEulogy tree of life rabbi\n... on David ... fish and helping him set up all he had to do was lead services\nTheir friend Bob Goldstein says it was seized those customs ... finger and tell people you better go to services\nWhere taking a cough and I I gave him when he gives me all the time\nYou better go to services and that's what I'm going to remember of\nFamily and friends say David Was quieter industry is worker fascinated by police officer was born politician who wanted to be involved with everything rabbi Myers think brothers parents sharing them with the community services he said I won't be the same for NPR News I'm ... in Pittsburgh\nPresident Trump and members of his family traveled to Pittsburgh to console the victims of this past weekend shooting facing a mixed welcome from the city Jewish community some residents near the squirrel hill neighborhood were eleven people were shot and killed said Trump was not welcome unless he changes his ways over others said that this president he should be welcome\nBen spouting hatred for Jews is blamed in the mass shooting one of the worst incidents of anti Semitic violence in us history Trump has been calling for national unity at the same time he's been expressing partisan rhetoric at election rallies with the midterms now weak way\nA top Republican lawmaker is pushing back against President Trump's assertion he can revoke automatic birthright citizenship without involving Congress or changing the constitution or if NPR's Ayesha Rascoe\nTrump says he believes he can act on his own to an unrestricted birthright citizenship for those born in the U.S to parents who are not us citizens and an interview with ... he said he could end the right with an executive order\nIt was always told to me that you needed a constitutional a member on and you don't need a number one number one you don't need that\nBut Republican speaker of the house Paul Ryan says Trump can't do that Ryan told a Kentucky radio station that such a move would be unconstitutional saying it goes against the plain text of the fourteenth amendment the White House has offered no further details about Trump's comments Ayesha Rascoe NPR News the White House\nHome price gains appear to be easing something they could help potential buyers were part of the reason for the slowdown is a drop in sales tied to higher mortgage interest rates\nPrices are still up substantially from a year ago the U.S in the Case Shiller twenty city home price index says prices in August up five and a half percent from the same period last year on Wall street the Dow closed up four hundred and\nFrom a year ago the U.S and the Case Shiller twenty city home price index shows prices in August up five and a half percent from the same period last year on Wall street the Dow closed up four hundred and thirty one points today you're listening to NPR\nA lawyer representing convicted mob boss James Whitey Bolger says he blames his clients death\nOn decisions made by the Federal Bureau of prisons attorney Jay W Carney junior in a statement today said Bolger was initially sense to two consecutive life terms but had that sentence change to the death penalty\nPrison officials say the eighty nine year old Bolger was found dead in his West Virginia prison cell today he'd been serving time for his role and eleven murders prison union official says Bulger's death is being investigated as a homicide\nStudy finds when teens and young adults stop using marijuana even for a week they're learning and memory improves their study adds to a growing body of evidence suggesting park and her some brain functions and young people more from NPR's ...\nResearch at the top I recruited eighty eight point to using young people of ages sixteen to twenty five and I one half of them were off to abstain from the drug for a month or the other half the control group was allowed to continue using marijuana [laughter]\nThe group that gave a pot showed an improvement in learning and memory test compared to the control group an improvement was evident as early as the last week\nThe results are published in the journal of clinical psychiatry touchy and can you\nScientists exploring the seabed off the coast of central California have found something unprecedented hundreds of octopuses between rocks covering groups of white eggs\nThe cluster of upwards of a thousand octopuses was last week and the Davidson seem out an underwater extinct volcano located in the Monterey Bay National Marine sanctuary submersible cameras spotted the often reclusive creatures I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors includes the air and about ... Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent about whether that's on line over the air or in a bottle more at Sierra Nevada dot com\nAnd onto the music on ... I said that's not good evening graduate share\nHer musical time travel this hour we'll take that from the late twentieth century back to the renaissance and then out to the early romantic period with music by Andrew York\nTravel this hour we'll take it from the late twentieth century back to the renaissance and then up to the early romantic period with music by Andrew York Anthony whole born in France Schubert\nAndrew York up first he's a guitarist and it's named Brett Los Angeles guitar quartets you read a lot of music for four guitars here's one of those and it puts us overlooking the ocean I'm the far left coast here's Andrew York's Pacific coast highway\nMm\n\nMm Mm\n[noise]\n[noise]\n\n\n[noise]\nDo then\n\n\nThen then\nThen ...\n...\nFive pieces for brass quintet by Anthony hold born reading back in the renaissance\nThe empire brass plus percussionist Richard Jensen performed Sharon gp\nThe playlist for night cap is that the ... news dot org slash programs flash night cap if you'd like to review or preview what we're listening to TPP news dot org slash programs slash Nike cap\nOne thing that always makes me sad to think about is how young from Schubert was when he died and how much great music he might have come up with if you stick around hunger he only lived to his thirty first year\nIn just a couple of months before his death he had a burst of almost superhuman creativity turning out to large scale magnificent piano sonata\nAnd here's the last one his last one she birds piano sonata number Twenty one in B flat in recording here with Ken is Paul Lewis I'm G. P. B.\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[laughter]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\nMm\nMm\n\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nMm [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nOr a\n\n\n\n\n[noise]\n\n[noise]\n[noise] Mm\nNa\nNa\nWho\n\n[noise] oh\n\n...\n\n\n... ... ...\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[laughter]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\nOoh [noise]\n\nAnd that's all he wrote for piano solo the final piano sonata by Franz Schubert completed a couple of months before his death in Eighteen twenty eight when he was just in his early thirties\nHere on G. P. B. that was British pianist Paul Lewis was Schubert piano sonata number Twenty one in B flat major\nWhich this thing nine sixty it's just awful to think about the great music we don't have because great composers died young but what an amazing legacy she left for us even in his short life\nI'm Sarah ... please stay with me for currently in Glen ... after the nays\nElection night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be live all night watching the close races around the country listen on election night didn't wake up and hear what the outcome means for America on MORNING edition\nCritical election central coverage NPR News\nJoined us for all the results on election night starting at eight Iran GDP\nFrom the University of west Georgia is Ninety seven FM Wu WG aimed W W G. H. D.\nGerald Ford the Georgia Public broadcasting review [noise]\n[noise]\nUm on from NPR News in Washington ... Stevens [noise] the first funerals have been held for victims of Saturday's mass shooting at a synagogue and Pittsburgh Amy Sisk of member station W E essay reports on the surface sales for Jerry Rubin votes\nHundreds of people attended the funeral for the sixty six year old Pittsburgh doctor at the Jewish community center family and friends filtered in past police providing security during the service friend fall was one of them she Rabinowitz because they both attended the door ... congregation tree of life in Pittsburgh squirrel Helmy\nSecurity during the survey ... fall was one of them she Rabinowitz because they both attended the door had dash congregation tree of life in Pittsburgh squirrel hill neighborhood\nBar president a synagogue wonderful age she even more of those tactics Jerry Lewis never without at that time she\nSays Rabinowitz always arrived early for Saturday services and helped out where ever needed for NPR News I'm Amy Sisk in Pittsburgh\nWhite House press secretary says President Trump's visit to Pittsburgh was very humbling it very sad to every Sanders telling reporters aboard air force one the Trump visited a local hospital where one of the first responders was being treated\nFirst lady Milan daughter a bunker and son in law Jared Kushner joined the president congressional leaders of both parties declined to joins first family on the trip meanwhile thousands of protesters took to the streets marching toward the tree of life synagogue and demanding that the trumps go home\nThe president wants to eliminate automatic citizenship for U.S born babies of undocumented residents as guaranteed by the fourteenth amendment\nDuring an interview with ... upcoming HBO series Trump floated the idea of doing so by executive order but house Speaker Paul Ryan tells W. V. O. K. radio in Lexington, Kentucky that the president doesn't have that authority\nOr does it very clear is you can't change this executive at a at the very least it would have to be statutory\nCongress Ryan knows that GOP lawmakers were not happy when former President Obama tried to change immigration law by executive order\nNotorious Boston gangster James Whitey Bolger is dead date ... West Virginia public broadcasting reports mulder was killed in a federal prison where he arrived on Monday\nThe U.S zeroed prison says ... unresponsive at eight twenty in the morning Richard Holbrooke president of the American federation of government employees local for twenty called Bulger's death and apparent homicide based on information from responding guards\nThe FBI was notified in an investigation has been initiated the eighty nine year old had been transferred to the results in penitentiary near Morgantown West Virginia the day before his death\nHe was serving a life sentence for racketeering money laundering possession of unregistered machine guns and other convictions the ... FBI informing has been sixteen years on the Web before please call up within in two thousand eleven for NPR News I'm Dave missed itch in Morgantown West Virginia\nFrom Washington You're listening to NPR News\nThere's no weapon for NPR News I'm Dave missed inch in Morgantown West Virginia\nFrom Washington You're listening to NPR News [noise]\nIndonesian armed forces chief says search crews may have located the fuselage from the ill fated lion air passenger jet a two month old Boeing seven thirty seven crashed into the job of sea on Monday just minutes after take off from Jakarta killing all one hundred eighty nine people on\nBoard NASA's Kepler space telescope is being retired after running out of fuel as NPR's Nell Greenfieldboyce reports Kepler discovered thousands of planets during its nine year mission\nNASA's Kepler telescope stared at around a hundred and fifty thousand start watching for tips in brightness that meant a passing planet had blocked some star light\nAll in all Kepler detected more than two thousand six hundred planets lead scientist William ... says a favorite is Kepler twenty to be which is more than five hundred light years away\nIt shouldn't planted in between the size of the earth and now turn on like any planet in our solar system [laughter] it's just kind of may very well be in the water world ocean\nKepler showed that planets are common that many of the stars visible in the night sky are likely to have small planets with temperatures mild enough for liquid water and maybe even life Nell Greenfieldboyce NPR News\nCurrently Davidson is recalling nearly one hundred Seventy thousand motorcycles in the U.S\nBecause of a clutch problem that can prevent the driver from switching gears Harley says to wear a five crashes linked to the problem but no injuries recall covers twenty six vehicles from two thousand Seventeen and Eighteen this is NPR News\nSupport for NPR cameras from NPR stations other contributors include their Joyce Foundation committed to advancing racial equity and economic mobility for the next generation and the great lakes region learn more at Joyce SBN dot org and the ... foundation\nAnd they kept continues on listener supported G. P. B. Georgia Public broadcasting\nThat evening I'm Sarah asthma and let's begin precisely in the years Seventeen hundred in fact on January first Seventeen hundred the beginning of a new century that's the date that Italian ... chose to publish his great set of violence and not as his opus ...\nThe beginning of a new century that the date that Italian composer are ... really chose to publish his great set of violence and not as his opus five\nThey were very popular there were very influential but the notes that currently published are only part of the story because in his day performers would be expected to improvise adding ornaments and embellishment to know true performances would ever be the same\nThat's something sheet music just can't capture and it's something that recordings don't capture very well either but let's hear the way baroque violinist Andrew Mann Z and hearts of court is Richard ...\nChose to interpret one of ... violence and not as on the one occasion that the tape was rolling through this recording the violence and number two in B flat ... currently\n[noise]\n\n\n\n\n\n\n\n\nWell\n\nWill\n\nOoh [noise]\n\nGuy out by me kind of ugly guy you heard the Detroit symphony orchestra their conduct or ... an GBDs night cap\nI won't take the time to spell all the names and titles of pieces but you can look them up the players just posted each day for Nike cap at gp be news dot org slash programs slash night cap\nAnd now we come to the final piece on that plane left a trio for violin and cello in piano by Mario ... to ... go\nCustomers to desk was born in Florence in Eighteen Ninety five and he worked in Italy as a pianist and freelance composer until Nineteen thirty nine he fled fascist Italy and settled in Beverly Hills California and he lived there until his death in Nineteen sixty wrote film music in more\nHistory O. N. G. major dates from the old country in Nineteen twenty eight in his autobiography cost him over to discover describes it as a work which is rich and outgoing perhaps to elaborate in any case it contains a second movement litany with variations which is among my most beautiful\nThe arm on ensemble plays the piano trio number one by Mario customs over to a desk\n[noise] [noise]\n[noise]\n...\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n... na\nNa na na na na\nNa na na na na na na\n...\n... ... ...\n\n\n\n\n... ... and I remember that", "show_name": "Nightcap", "year": "2018", "city": "Carrollton", "day": "31"}