{"month": "10", "state": "GA", "station": "WUWG", "content": "I'm Fred childhood disease performance today from eight PM American public media which has members supported ... where in Eighteen station radio network you can listen online or G. P. B. dot org\nAmerican public media\nSays his members supported GAPP where an Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\n[noise] Hi I'm Sarah vast evening classical ... TV I get to share musical stories in Tibet sucking\nBut I Know that what really brings us together\nListening to music to relax to commune be lifted\nKinda road when words\nLeave off easy to get\nYour support keeps the music here for you good at ... dot org and click donate\n\nFrom the University of west Georgia because Ninety point seven FM W. W. W. W.\nG. H. D. Gerald Ford of Georgia Public broadcasting radio network\nI was a teenager he and his mother went on a trip they left Salzburg, Austria\nSpent time in musical capitals where they hoped would get jobs or at least commissions after a soldier and in Manheim Germany they're off to Paris where the musically inclined elite\nLike having sat around included a father and daughter pair from together played flute and hard\nComing up this hour on the cat\nCome to the show on there\nStick around after the news for that nuts are severe Wagner Copeland in Greek between now and they\n\nLive from NPR News in Washington I'm ... beer but senator is a wedding was also the FBI investigation into Supreme Court nominee Brett Kavanaugh NPR's Windsor Johnston reports the agency is looking into allegations of sexual misconduct stemmed from capital as high school and college days\nFBI is in the process of interviewing witnesses in an attempt to corroborate the stories of cabin all and his initial accuser Christine Blasey Ford Senator Jeff flake the Republican\nAnd interviewing witnesses any attempt to corroborate the stories that Kavanaugh and his initial accuser Christine Blasey Ford Senator Jeff flake the Republican who played a key role in securing a delight to allow time for the ... has the FBI needs to be fair out\nMy hope is that they as they interview these individuals' then they'll immediately follow up on other leads that they might they might have so we don't know exactly where it is in terms of what it will take it and I just hope that we find in fact\nPresident Trump says he's hoping for a positive result in the Senate this week for a cat and all but it will be dependent on what comes back from the FBI when Johnson NPR News Washington\nWhite House economic adviser Larry Kudlow is defended the administration's new trade agreement with Mexico and Canada as NPR's Scott Horsley explains the agreement drew criticism from the conservative editorial page of the wall Street Journal\nKudlow there was a former CNBC commentator calls the Journal's editorial writers dear friends but he takes issue with their criticism of the trade deal nothing is perfect Kudlow says the deal provides an update to NAFTA which took effect a quarter century ago\nWe've improved the supply chains of terrorists would we notice a tear free zone in the spin effect supply chains will be their business will not be disrupted all those threats have not come to pass so I\n... the president's or some credit\nNever mind that it was the president himself who threaten cross border supply chains with promises to tear up NAFTA if he didn't get his way Kudlow stumbled over the name of the new NAFTA which Trump insisted on rebranding as the U.S andme ca Scott Horsley NPR News the White House\nFederal Reserve board chairman Jerome Powell seems to be taking a steady as she goes approach in terms of the bodies current interest rate policy\nSpeech prepared for the annual conference of the national association of business economics central bank chairman says the current combination of low inflation and very low unemployment shows the country's going through as she put it extraordinary times\nI'm Glad to be lucky to be able to stand here and say that the economy is strong unemployment is near fifth year lows inflation is roughly at our two percent objective [noise]\nAnd that the baseline outlook of many forecasters inside and outside the fast fed as for more of the same\nHouse as the main concern with the fed at this point he's making sure it doesn't raise rates too quickly pushing in the country into recession online retail giant Amazon is taking a major step to date popping it's minimum wage for all us workers to Fifteen dollars an hour the company says the move will benefit more than three hundred and fifty thousand\nYou know giant Amazon is taking a major step today upping it's minimum wage for all us workers to Fifteen dollars an hour the company says the move will benefit more than three hundred and fifty thousand employees but that was up a hundred and twenty two points this is NPR\nSecretary of state Mike Pompeo is getting off or a third time to North Korea for another round of talks ultimately aimed at convincing that North Korean leader Kim Jong loon to give up his country's nuclear weapons bomb pale reportedly will travel to paying young Saturday to meet with a North Korean president\nState Department spokeswoman Heather Nauert told reporters palm pay will be pushing for progress achieving the goal of denuclearization agreed upon by President Trump and Kim during the summit in Singapore\nStudy is finding a simple rules change in college football could dramatically cut the risk of concussions NPR's Jon Hamilton reports on research in the journal of the American Medical Association\nMore than twenty percent of concussions in college football occurred during kickoffs when players often collided full speed so in two thousand Fifteen Ivy League schools moved to kick off line five yards up the field the idea was to make it less likely that the ball would be returned\nAnd an analysis by three Ivy League scientists found that the change reduce the chance of a concussion during kickoffs by more than eighty percent\nThe NFL also a decrease in brain injuries after changing its kickoff rules in two thousand eleven\nAnd a new study's authors say that if schools beyond the ivy league made similar rule changes it might reduce concussions for all college football players Jon Hamilton NPR News ... who inspired the Nineteen fifty eight buddy Holly hit Peggy Sue as died at a hospital in Lubbock, Texas\nPeggy so Gehring racket was Seventy eight she released the autobiography in two thousand eight to mark the fiftieth anniversary of the song bearing her name\nShe later married a member of the band the crickets buddy Holly died the next year in Nineteen fifty nine and a plane crash I'm jak spirit NPR News\nSupport for NPR comes from MPR stations other contributors include the ... foundation fostering improvements and learning and enrichment for disadvantaged children and the vitality of the arts for everyone ideas at while this foundation dot org and the listeners who support this NPR station\nGPA and say that's not sure what it is that make fruit and heart such a great combination that many people had figured this out Mozart had the good sense to put them together ...\nLet's hear ... reunion most ... things on not gain weight conductors\nMozart had the good tends to put them together and it can sure do\nLet's hear flute is ruined our most purpose seems on McGahn with conductors Scott ... symphony orchestra in Denmark in this recent recording of Mozart's concerto first cleared and heart\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\nThe man\nWho\n\n\n[noise]\n\nNa\n\n\nNa na\n\nOrioles anything\nOrleans\n\nOr all\nAnd I'm In a\n\nA while\n\nOr\n\nOr\n\nUh\nOr\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n... thinking that like Kenny than either got cats continues right after they can recognize the TPP\nIs listener supported ... that means people who listen just like you're doing right now provide the most important and reliable share of the funding that keeps the programs\nYou rely on and enjoy on the air [noise]\nHi I'm Dana Barclay and it's our fault sunrise\nAnd right now I Hope you'll join our public radio community\nDVD is stronger and better with your support quick and easy to get on line TPP dot org or call eight hundred\nTo two to four seven eight eight and ...\nFrom the University of west Georgia was Ninety seven Wu WG paying to W. W. G. H. G. Carroll do\nFor the Georgia Public broadcasting radio network\nAre you from NPR News in Washington ... Steve and President Trump says he seems strong Republican support for Supreme Court nominee Brett Kavanaugh NPR's Scott Horsley reports on Trump's remarks today at a rally in Mississippi\nTrump says Kavanaugh's nomination has become a rallying cry for the geo Pete and expressed confidence that the closely divided Senate will confirm his nominee by the end of this week Kevin up has strongly denied allegations that he sexually assaulted women decades ago Trump says he's not concerned by stories of Kavanaugh's drinking during that\nThis week Kevin up has strongly denied allegations that he sexually assaulted women decades ago Trump says he's not concerned by stories of Kevin O's drinking during that period even though the president himself does not drink\nI remember my college days everybody was very good it was like I was abnormal it was totally normal everybody was drinking\nTrump defended Kevin O's performance during the congressional hearing which some critics have gold overly partisan by the president cautions lying to Congress would not be acceptable Scott Horsley NPR News the White House\nA secret services is suspicious down below was mailed to President Trump but never reached the White House the agency says it's investigating whether the envelope is linked to others found at a Pentagon ... mail screening facility two of them containing the poison rice and\nChicago police officer Jason Van Dyke says he had no choice but to shoot a quantum McDonald's because the teenager turned toward him while waving a knife from member station WBFO easy Patrick Smith reports on ... dykes testimony today and his own murder trial\nVan Dyke shot McDonald's sixteen times while he was on duty and twenty fourteen he choked up on the stand as he gave his account the shooting\nTurned parcels towards me\nThe weeds and noise\nMoore writes sorry towards cross was burned my shoulder\nWhen he didn't want to push 'em\nIn cross examination the prosecutor pointed out inconsistencies between Van Dyke testimony and what's seen on a dash cam video of the shooting she also push Van Dyke to explain why his testimony different from what he said an official police reports Van Dyke repeatedly said he was in shock and doesn't remember what he said immediately after the shooting for NPR News I'm Patrick Smith in Chicago\nTime is running out for finding any more survivors from friday's earthquake and tsunami in Indonesia the official death toll from the disaster now tops twelve hundred and climbing NPR's Julie McCarthy made her way to one devastated area by traveling with an army eight and security convoy\nWhere are all there is a high wanting to hug the coach says we may know Cho hollow or the roads are decent condition it started to rain or which sort of added to the misery here there's not a lot of traffic coming\nOut um which you would have expected because a lot of people are trying to leave however there is no gasoline to do that and so people really that sense of feeling trapped\nNPR's Julie McCarthy reporting\nHowever there is no gasoline to do and so people really feeling you're trapped\nNPR's Julie McCarthy reporting this is NPR News [noise]\nFacebook is being sued by a woman claiming the social media company enable to sex traffickers who recruited her when she was Fifteen\nAnd he make Adams and attorney for the un identify point to\nTo their client was befriended by another Facebook user who gained her trust and promised or a modeling job\nThe case filed and Houston Monday Sikhs at least a million dollars in damages it also makes the owners of to Houston hotels and a website shutdown earlier this year\nFor allegedly posting ads for sexual services a new analysis by the American Cancer Society finds that many teenagers are not up to date on the HP the vaccine which can prevent several types of cancers\nNPR's Allison Aubrey has details\nNearly fourteen million pre teens will need to be vaccinated to reach the target of an eighty percent vaccination right by twenty twenty six and a new analysis finds a disproportionate percentage of teen boys whose families have private insurance\nHave not gotten the vaccine the vaccination rate is higher among medicate insurance teens the author's point two initiatives such as a federally funded vaccines for children program that provides free vaccines for low income children\nThe human papillomavirus causes about thirty thousand cancers a year the majority can be prevented through vaccination the author said one barrier to vaccination is a lack of awareness of the vaccines benefits\nAllison Aubrey NPR News\nI'm about two hundred twenty five million mobile devices across the U.S will receive a test emergency alert tomorrow it to Eighteen pm eastern time famous as his first national test kind this is NPR\nSupport for NPR comes from dream ways maker of luxury massage chairs from Japan with shootouts viewpoint detection and sixteen program to massage years including warning night and stretch sessions retailers nationwide more a dream wave chair dot com Andy any case he found Asian\nAnd they'll come to the second tower and they kept here on G. P. B. I'm Sarah is that\nWhen I describe this show is music to settle down with at the end of the day that doesn't mean it's all lullabies and soothing salt so things it just means that listening to music at all can help focus and put us in a better place and it hasn't allowed to be one flavor\nTwo things soft sort of things it just means that listening to music at all can help focus and put us in a better place to be one flavor\nSo we have a range of flavors this hour as usual well here the dramatic chill us and other by advised Greek which has its share of storm and stress and it will be a short likely number for pursuing and piano scared so by someone named Ali ...\nTo begin an American masterpiece that has a whole range of emotions within itself the clarinet concerto that Aaron ... in Nineteen forty eight\nThis recording is near and dear to my heart because it features one of the stars of the Atlanta symphony orchestra ... are Dan Celeste industry according she's performing with the Nashville chamber orchestra conductor ... Laura or Dan and friends and Copeland clarinet contract out\nOh\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nErin ... clarinet concerto on G. P. V.\nPoll gamble conducted the Nashville chamber orchestra and the so Lewis was Laura are Dan Laura are done with the clarinet deterred by Copeland continuing night cap on Georgia Public broadcasting I'm Sarah basketball player list for the show was up at gp be news dot org\nSlash programs slash like kept\nComing up and just a few minutes and ... Greeks cello sonata [laughter] but to pave the way for that a different low instrument and piano but soon here is all of them are often called scared so in G. minor from the same hears the Copeland we just heard coincidentally Nineteen forty eight as soon as an shoemaker as a company by pianist K whoa soda I hear\n\n\n\nIs they sit there\nAnd they\nKept their\nAnd\n\n\nDa\n\nDa da da da\nDa da da\n\n\n... ...\n... ... ... ...\n[noise]\nNa na na na na na na na\nNa na na na either\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\nNa\nNa na na\nNa na\n\n\n\n\nNa\n\n\nNa\nNa\n... ... ...\n\nNa\n\nNa\nNa na na na\nNah\nMan and [noise]\nDon't\nAnd and I\n...\nAnd\nThen when I was able to go over and over\nAnd [noise]\nAnd yeah you\nNa\n\nNa\n\nNa na na na na na na na na\nNa na na na\nNa na na na\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n...\n[noise]\nMy mom\nTo my ... my name is ... and and and\n\n\n\n\n[noise]\n[noise]\n[noise]\n", "year": "2018", "show_name": "Nightcap", "city": "Carrollton", "day": "03"}