{"month": "11", "state": "GA", "station": "WUWG", "content": "I'm Valerie Taylor this is performance today from eight PM American public media\nSuch as members supported gp beat where an Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening support for G. P. B. programs comes from our list\nThis on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nSupport for G. P. B. programs comes from our listeners\nAnd the savannah food and wine festival November this three will never a legendary week of food and drink from river street and throughout the historic district celebrity chefs wind experts and more savannah food and wine festival dot com\nDoes your busy life keep you from staying informed CPB has you covered you can listen live the TPP news dot org and on your smart home device follow us on Facebook and Twitter at gp be news\n\nFrom the University of west Georgia because Ninety point seven F. L. W. W. W.\nW. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\n\nI'm Sarah ... with a Halloween edition of night cat ... [noise]\nCan use the ... mine in our midst Tchaikovsky George Chadwick composed the tale of ... [noise]\nHard drinker reading the in late one night [noise]\nReaches orgy going on inside a church\nOne which in particular is wearing a very short skirt\nInto the cries out well done ...\nEverything goes dark legion print him\nFor all of the story is once you remember ... backup green [noise]\nThat were ... years ago Kelly more on the way after the [noise]\nLive from NPR News in Washington ... ...\n... Donald Trump is going on the offensive after house Speaker Paul Ryan dismissed his call to an automatic birthright citizenship for the children of non citizens born in the U.S\nTrump saying Ryan should focus on holding the majority rather than giving his opinions Ryan said yesterday he does not think the president can limit birthright citizenship which is addressed to a constitutional amendment by simply issuing an executive order but speaking to reporters today have another GOP campaign trip Trump disagree\nBelieve you're going to have a civil voted for even thought\nIn my opinion\nThey have another GOP campaign trip Trump disagree\nI Believe you're going to have a civil voted guy or even possible\nMy opinion is really very valid legal\nThat you can do it through\nI'd rather do\nWhile Trump continues to push the executive order idea he also says he expects lawmakers to work on closing immigration loopholes and securing our border [laughter]\nIn Montana's tightening Senate race the libertarian candidate is now endorsing the Republican challenger\nNPR's Kirk Siegler reports democratic Senator Jon tester is seen as having a slight lead in the race it's not clear how much of a difference this endorsement will make those the libertarian candidate had said he expected to get about three percent of the vote\nRepublicans are helpful they can prevent Democrat Jon Tester from winning a third term in a state that went overwhelmingly for President Trump\nBut Montana is famously unpredictable says former state GOP chair and Trump critic Susan good D.C Montana is truly a maverick\nWhere the real deal good ... he says even in Montana there's now an urban rural divide this race could come down to whether Democrats turn out the vote in liberal college towns and on reservations\nKirk Siegler NPR News Helena one of eleven people killed in Saturday synagogue shooting in Pittsburgh eighty seven year old Melvin wax was laid to rest today as Kathleen Davis reports from member station WBFO say he was someone who wore many hats and his community\nMelvin wax was a retired accountant who lives in a close knit heavily Jewish neighborhood at squirrel hell he was known as a kind demand attended services every weekend friend joked finally to the press that wax would fill in any role that service if someone was unable to attack and accept Cantor\nMore than forty cars joined the procession after the funeral and dead more services are scheduled throughout the week for NPR News I'm Kathleen Davis in Pittsburgh\nThis on a window for the Affordable CARE Act subsidize health insurance opens tomorrow with some stabilization of premiums are more choice nationally the average premiums under the plan are going up but only by low single digit percentages next year a year ago wasn't clear whether former President Obama's signature health care initiative would survive\nAlso after January first those who opt out of health insurance won't be penalized attacks time\nOn Wall street stocks gained ground the dollars up two hundred and forty one points the NASDAQ rose a hundred and forty four points this is NPR\nAutomaker General Motors says it's looking to offer buyouts to roughly eight teams\nDoes that grows a hundred and forty four points this is NPR\nAutomaker General Motors says it's looking to offer buyouts to roughly Eighteen thousand which white collar workers in North America the automaker says it intends to offer the buyouts to salaried employees with more than twelve years of service\nGym says well reported profits or two and a half billion dollars in the third quarter that wants to make the change in its workforce while the economy is strong gems not disclosing terms of the offer\nTo new research studies conclude women with cervical cancer are likely to live longer if they get abdominal surgery rather than less invasive methods to remove diseased uterus so NPR's Richard Harris explains many surgeons do recommend the less effective\nSurgery though surgeons often treat early cervical cancer by removing a woman's uterus using instruments that fit through small incision women tend to have fewer immediate complications from these types of surgeries\nBut two new studies in the New England Journal of medicine find that women who get this less invasive surgery are more likely to die in the following years in one study women who had minimally invasive surgery had nine percent chance of death within four years women with abdominal surgery headache five percent chance of death\nSome surgeons have already stopped doing minimally invasive surgery for cervical cancer based on early reports of these findings Richard Harris NPR News\nSan Francisco giants have announced the death of baseball hall of famer William how the copy nickname stretch where his six foot four inch height and long arms with a former first baseman in fearsome hitter with five hundred and Twenty one home runs more than Fifteen hundred R B eyes and twenty two major league seasons William of ... he was eighty years old\nI'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent about whether that's on line over the air or in a bottle more at the our Nevada dot com\nMake kept on G. P. D. happy Halloween I'm sad that to begin\nI danced the ... and ... ... it full orchestra ration\nFirst you'll hear the clock strikes midnight and gas tune up his fiddle begins his off kilter wealth keen on the phone and folks the bones of celebrating scale tenants they become more and more\nIt'll end begins his off kilter well another tune on the phone book the bones of celebrating skeletons they become more and more frenzied until the rooster ... Don and they just ... and ...\n\n\n[laughter]\n\n\nOr\nOr ah\n\n\n\n...\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\nI don't know what's going\n\n\nWell\n\n\n\n[noise]\n\n\n\n[noise]\nMhm\n[noise]\nBungee PV that check state philharmonic with conductor Jose sa ... played it on G. P. B. the check state so harmonic with conductor Jose ... play the symphonic poem cam oh shelter by George white feel Chadwick with demons and devils and witches and\nWith demons and devils and which is an ... and ... are trying to escape on his tired old horse who loses her tail at the end and ...\nWith demons and with demons and devils an ogre is all chasing after ... after he\nAfter he will for after he wolf whistles after he wolf whistles and attractive young which in a short skirt\nBasically after he wolf whistles and attractive young which\nFor election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country listen on election night then wake up and hear what the outcome means for America on MORNING edition\nCritical election with central coverage NPR News\nJoined us for all the results on election night starting at eight Iran GDP\nFrom University of west Georgia with his mind be point seven W. W. W. W. A. G. H. G. Carroll of the Georgia Public broadcasting radio network\n[noise]\nLive from NPR News in Washington ... Stevens the man accused of killing eleven people at a synagogue in Pittsburgh has now facing forty four federal counts as W E essays on leave herring reports today's indictment include some new charges\nFederal prosecutors originally detained Robert powers on twenty nine pounds of hate crimes and firearms offenses this grand jury indictment includes additional firearms charges and also accuses him of preventing ten other worshippers from practicing their religion through an attempt to kill them\nAnd the indictment accuses the alleged gunman of entering Pittsburgh's tree of life synagogue with three handguns in an AR Fifteen rifle it also says he expressed his desire\nIndictment accuses the alleged gunman of entering Pittsburgh's tree of life synagogue with three handguns and an A R Fifteen rifle and also says he expressed his desire to quote killed Jews there\nThe alleged shooter is set to appear for a preliminary hearing on Thursday he's being held without bail for NPR News I'm only herring and Pittsburgh\nMeanwhile more funerals were held today for victims of the synagogue attack in Pittsburgh mourners gathered to say goodbye to sixty nine year old urban younger and Seventy five year old Joyce Feinberg a funeral was also held for eighty eight year old ... who was leading Sabbath for one of the temples three congregations when the attack began\nA federal appeals court says Ohio residents spurs from state voter rolls for not participating in elections for six years most be allowed to cast ballots in next week's midterms Karen caster of Ohio public radio has details\nAnd appeals court in Cincinnati says voters who were removed from the rolls between twenty seven and twenty Fifteen may cast provisional ballots as long as they still live in the county where they were registered and hadn't been disqualified from voting because a felony convictions or other reason [laughter]\nThese are voters who may have been removed or purged before a lawsuit was filed in twenty sixteen challenging Ohio's voter roll maintenance method which was upheld by the U.S Supreme Court in June\nOhio secretary of State John used as he disagrees with this ruling but won't appeal it because it doesn't affect many voters and because of the short timeline until election day for NPR News I'm Karen councilor in Columbus\nPresident Trump's says he's confident that Republicans will do well in the mid term elections before heading to a campaign rally in Florida tonight Trump also insisted that citizenship rights for U.S born babies of undocumented residents can be revoked\nI Believe you're going to have a devoted father survived\nYour daughter\nRather do your\nTrump's as the number of us troops being sent to the southern border will be increased from five thousand to as many as Fifteen thousand that's in addition to the national guard troops border patrol in immigration enforcement agents already there for the anticipated arrival of asylum seekers from Central America\nYou're listening to NPR News\nSan Francisco giants say hall of fame slugger Willie McCovey has died at the age of ... a former first basement in left field\nSan Francisco giants say hall of fame slugger Willie McCovey has died at the age of ...\nA former first baseman ... because he was a career to Seventy hitter with five hundred Twenty one home runs and Fifteen hundred and fifty five ... and twenty two major league seasons Nineteen of him with a giant he also play for the athletics in the ...\nJoined announcements this Kobe died peacefully today in his sleep after losing about a with ongoing health issues [noise]\nA year after the hash tag me too movement took off a new NPR Ipsos poll shows deep divisions over the issue of sexual assault and harassment\nNPR's Tovia Smith reports that the disagreement is mostly along party lines\nA majority of those surveyed say the movement has assured in a new era of accountability and which offenders and we'll be held accountable and about a third seem to think the movement has not yet gone far enough saying they believe allegations of sexual harassment still get ignored\nBut a larger chunk forty three percent say we need to has gone too far including three quarters of Republicans versus one quarter of Democrats or Republicans are also much more likely to say false accusations are common and they tend to be more forgiving of political candidates who've been accused of sexual misconduct\nMost Democrats say that's a deal breaker most Republicans do not Tovia Smith NPR News\nSt stocks closed in positive territory today for a second street day on more encouraging earnings report that Jones industrial gained two hundred and forty one points I'm ... NPR News in Washington\nSupport for NPR comes from dream ways maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including warning night and stretch sessions retailers nationwide more a dream wave chair dot com Andy any case he found Asian\n\nAnd this is a G. P. B. the Eighteenth station Georgia Public broadcasting radio network I'm there I was asked a happy Halloween\nThis final hour of night cat brings us we chief stories by Tchaikovsky and up first Franz Liszt than the fish still waltz number one dance at the village in is one of lifts pieces inspired by the ... legend\nOn the music scoreless quotes the poem Foust by Lin now and here's a summary of that part south ... wearing\nThe ... legend on the music scoreless quote the poem espoused by Leno and here's a summary at that part Foust ... wearing disguises Andrew religion and find wedding celebration in full swing\n... too shy to approach a young woman who catches by ... lasted him and make fun of musicians for playing lethargic Lee suddenly he sees as the violin from the hands of the kids the fiddler and begins to play at himself\nUnder the spell of Memphis ... playing the dancing becomes Wilder south takes the girl's hand in crudely declared his passion all the couples dance right out of the ... and into the dark wood ... all one could hear inside the into the open doors is the sinking of the Nineteen gal\nRobert de guy turnout plays dance at the village in the face to waltz number one by [noise]\n\n[noise]\nDance at the village in still waltz number one by Franz Liszt which again is Robert de guy to now you're listening tonight cap on G. P. D. and Halloween edition with musical tales of encampments in Huntington orgies\nAnd become now to check ... only symphony that he gave a title rather than the number the men Fred symphony pieces also based on literature the dramatic pulling men Fred by lord Byron in the first movement which we don't have time for men Fred is wandering in the Alps tormented by metaphysical questions\nWill pick it up in the second movement scared so where the alpine ferry appears before ... read in the rain both from the spray of a waterfall\nThe movement after that is a picture of the simple free life of the mountain of folk it includes a peasant dance and hunting corn\nAnd then the fiery finale is where things get in for null and here's the nutshell of that movement were in the subterranean pilots have already money's infertile orgy appearance of men read in the middle of the bucket no indication that appearance of a sheet of his love us start ... men British pardoned\nDeath of men Fred me hope that you have conducts the Russian national orchestra movements to through for a demand for symphony by checkup ski\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nOf the roller we're number\nOne\n\n\n\n\n\nAnd uh\n... ...\n\n[noise]\n[noise] well", "year": "2018", "show_name": "Nightcap", "city": "Carrollton", "day": "01"}