{"month": "10", "state": "GA", "station": "WUWG", "content": "And I'm Fred Child victims performance today from a PM American public media\nSuch as members supported G. P. P. we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and\nThe TPP where an Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nMORNING EDITION and on second thoughts totally fickle rewind it all the teachers\nSplit their support make everything you hear on the beep off if we didn't hear from your during our fault fungi your contribution now still make a difference we take just a couple of minutes to support the programs you rely on them enjoy on PBS and do your part now at whatever level is right for you\nTo G. P. B. dot org and click donate and thanks so much for your support of Georgia Public broadcasting\n\nFrom the University of west Georgia with his mind be point seven F. L. W. W. W. W.\nG H Street Gerald Ford of Georgia Public broadcasting radio network\nOh\nI'm Sorry I was asked why it's night cap on ... oh laid\nIt occurred to me that I could've named show that night cap\nAnd let me pretend just for a moment here on Sara's asked a\nWelcome to classics and chill listener supported G. P. B. and I kept by any other name sounds as me tonight this hypnotic piece by our vote paired stony a mirror mirror with violinist and ...\n\nAlso between now and midnight from grade second piano concerto and right after the news that they can for them funny by Englishman Charles Stanford thanks\nFor being here for classics and show I mean for night\nOn PBS\nLive from NPR News in Washington I'm jak spear President Trump is announcing a big departure from his foreign policy change today bathroom to the U.N Nikki Haley is leaving at the end of the year more from NPR's Michel Calvin\nAppearing with Trump in the oval office in Pasadena Nikki Haley was making clear she has no plans to challenge him in twenty twenty she says she's proud of her record in promoting Trump's America First agenda at the un\nWe said\nAmerica First agenda at the un now\nWe said what\nKnow that if we say we're going to do something we fall for when\nIn her resignation letter she town to the administration success in passing\nTop un sanctions on North Korea and an arms embargo in South Sudan she says she also push back at what she calls the relentless bias against Israel at the un Michele ... NPR News the state department\nAre you on human rights expert says the case of a missing Saudi journalist is what the Turkish government in a difficult position\nThe winds David case says that's because ... was last seen entering the Saudi consulate in Istanbul and it puts turkey in the position of having to may have diplomatic relations why also conducting a high profile investigation\nUS state department spokeswoman Heather Nauert is among those calling Riyadh to provide answers\nThe United states is certainly concerned about his whereabouts senior officials at the state department have spoken with Saudi officials through diplomatic channels about the matter we call and the government of Saudi Arabia to conduct a thorough ... transparent investigation turkey\nToday says it will search the consulate worker show he was last seen some Turkish sources of said they believed ... critic of Saudi policy was killed while inside the mission Saudi Arabia's called those allegations baseless\nAfter hurricane her mean destroyed the northern coast of Florida two years ago hurricane Michael appears about to wreak havoc in the same area as a category three storm W. F. tease Tesla ... spoke with a local business and the town of esteem happy to see how they're preparing your\nEmployees that good times motel in marina are busting down all the tables chairs and everything else that's movable and the bar area there trucking as much as they can to higher ground to protected from flooding manager Kenny McCauley says she's been through this kind of thing before\nI'm not sure about it for myself but for\nAnd the hair\nTo make sure to come\nShe's hopeful that what the precautions they're taking damage won't be as bad as it was two years ago even if the storm is worse for NPR News I'm ... and ... Florida\nNewly appointed Supreme Court justice Brett Kavanaugh seems to be wasting little time jumping into his new job do they have to ask questions in the first arguments of the day a case dealing with increased prison sentences [laughter] on Wall street the Dow closed down fifty six points you're listening to and ...\nQuestions in the first arguments of the day a case dealing with increased prison sentences on Wall street the Dow closed down fifty six points you're listening to NPR\nA major us coal producer is filing for bankruptcy Westmoreland coal operates seven minds across the u._s. which employ more than Fifteen hundred people from the mountain west news bureau Nate hedge has more\n... more than coal company says it isn't laying off anyone or closing any minds right now shortly after announcing the bankruptcy the company's stock plummeted by more than forty percent Peter Morgan is senior attorney with the Sierra Club he says the company might try to sell its coal mines\nBut I question whether Westmoreland couldn't it be able to find anyone willing to buy these mines given that their economic model is just inherently flood\nThat model involves owning coal mines that directly supply power plants Westmoreland has struggled as the nation transitions towards cheaper and more abundant renewable and natural gas for NPR News I'm edgy\nAlphabet Inc Google is unveiling three new devices as this continues to push its Android operating system\nAs an alternative to others on the market\nAddition to the one who pixel smartphone in the company's first tablet computer Google Home is making available new smart speaker with a display picks will phones faced a tough road garnering less than one percent of the global market during the company's first two years of trying to break into the market\nGoogle much like libel apple is trying to branch into the hardware market in order to have full control of its applications and the revenues they generate\nCritical futures prices regain some lost ground oil and the discussion up nine tenths of a percent at Seventy four Ninety four a barrel in New York I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors to include the public welfare foundation committed to advancing justice and opportunity for people in need\nMore information at public welfare dot org and the John ... and Catherine the MacArthur Foundation at max pounded dot org [noise]\nSpecies in the back and forth and tourism to repeat after infinity nearer nearer\nDown\n\nThere that they need to have you made\n[noise]\nI'm Sarah that's not good evening glad to have you with me [noise]\nFor Mir Mir well here's some French music and the first half of this hour belongs to Charles Stanford\nHe was an English composer writing at the beginning of the twentieth century and he was a bit of a funny daddy his taste ran to Nineteen century Germany\nAnd so as we listen to Charles Stanford's final symphonies symphony number seven from Nineteen eleven you'll hear echoes from the likes of mental thing and even she worked at the beginning David Lloyd Jones conduct the burden the symphony orchestra and the beautifully retro symphony number seven by Stanford\n[noise]\n\n\n[noise]\n\n\nNo\n\nOh\n\n\n\n\nLot of\nAround or\nWhatever\n\nWho\n\n\n\n\nOr\n... or\n\n...\n\n\n...\nOr\n\n\n\n[noise]\n\nOh\nOh [noise]\n\n\n\n\n\n\n[noise]\nOh\n\n... and ... and pianist to carry a duty\nTo steaming those mesmerizing phrases and gradual evolution to that piece from Nineteen Seventy eight by turning born out of a parent speaker him ... sweaty competent German in English you can say never in mirror\nThat winds us down to eleven o'clock news is next listener supported CPB and in the design far ranging ... concerto by a hundred times ... ...\nThis fall we're counting on the participation of everyone who listens to cover the rising costs of programs we bring you an G. P. B. if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make it on my contribution to the G. P. B. dot org and click donate at the top of the page your contribution\nAt whatever level is right for you cover the cost of the programs you love on CPB thank you so much for your support of Georgia Public broadcasting\nFrom the University of west Georgia Ninety point seven FM Wu WG and W.\nW. H. B. Gerald Ford of Georgia Public broadcasting radio network\nLive from NPR News in Washington on Giles Snyder hurricane Michael is strengthening in the Gulf of Mexico and NPR's Debbie Elliott reports on the path to make landfall in the Florida Panhandle tomorrow as a major hurricane\nFlorida governor Rick Scott says the biggest threat from hurricane Michael is a storm surge that's predicted to be eight to twelve feet high along a wide stretch of Florida's coast east of the storm's path\nAbout this way this storm hits near Panama City the Tampa area was still see it a life threatening storm surge you cannot hide from storm surge so get prepared and get out if an evacuation has ordered coastal evacuations are under way from the Alabama ...\nIt would have been deployed to help with the response and the coast guard has closed all of the port in the path of hurricane Michael ... NPR News forecasters\nAt the national Hurricane Center in Miami expect Michael to being near category four strings when it makes landfall latest word from the hurricane center puts the storm about two hundred miles southeast southwest of Appalachia cola Florida\nIs currently packing top winds of one hundred twenty five miles per hour President Trump has declared an emergency for the entire state\nA surprise announcement from the White House today about the United nations ambassador Nikki Haley she's planning to resign NPR's Scott Horsley reports and Haley relief or posed as one of the nation's top diplomat at the end of the year\nHaley offered no explanation for the timing of her departure which caught many observers off guard the former South Carolina Governor suggested she simply worn out by the often combative diplomacy at the un joking that she wears body armor on the job President Trump praised Haley as an effective advocate for his America First agenda we've\nOf so many other friends who also and I think the world is Nikki says the world is really respecting the United states much more so they haven't they haven't many many decades in\nFact international surveys but if you Research Center showed that attitudes towards the U.S and its president have sharply declined in most countries since Trump took office Scott Horsley NPR News the White House\nSecretary of state Mike Pompeo was praising ambassador Haley\nHad been a great part of their mind for the now\nFive months that she and I had been working together\nAnd I want to wish her very well whatever comes back\nPresident Trump says he will name a successor in the next two or three weeks he told reporters on his way to Iowa\nThere are five people on his short list including former White House advisor Dina pow\nOn Twitter today a bunker Trump shot down the possibility of replacing Haley after her father suggested that he would consider her but acknowledge that they would be accused of nepotism federal law prohibits hiring relatives had an executive agency\nFrom Washington this is NPR News\nPresident Trump is celebrating the swearing in of Supreme Court justice Brett Kavanaugh\nWait for America [noise]\nAnd\nYou talk about why\n[noise] and\nYou talk about why\n[noise]\nPresident Trump speaking earlier tonight at his campaign rally in Council Bluffs Iowa again calling Democrats attempt to block Brett Kavanaugh a national embarrassment to did not mention the sexual assault allegations Kevin joined the eight other justices on the bench for the first time today following a bruising confirmation fight\nThe national trust for historic preservation is named John Coltrane Long Island home a national treasure NPR's Andrew Limbong reports the group hopes to preserve inner revitalize the house\nJohn Coltrane those one of his greatest Supreme India upstairs bedroom [noise]\nHis wife Alice Coltrane recorded her own jazz records and the base [noise]\nThousand currently bacon to end in disrepair but\nLegs that director of the action fund at the national for historic preservation says don't work with the local neighborhood to raise money to restore the house\nTend to use it to inspire the next generation of artists to follow in the footsteps of the ...\nFall goes according to plan leg says the house will be open to the public in two years into Limbong NPR News and I'm toil Snyder in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work and food health power jobs and resilient cities at rock found dot org and Americans for the arts\n\nAnd you can run around with ... times you\nCan ask for being here and thank you for putting\nKinds of music that's well written\nPiano to pray for human beings thinkers in a normal nation\nOr get their hands around around second piano concerto it really kind of a work permit them to and when you're in the audience who don't necessarily know what could push can attest to go through and to create that for me even though Brahms was ...\nWe're listening to and when you're in the audience who don't necessarily know what can I can attest to go through to create that beautiful music even the Brahms was a pianist\nYears after he wrote it in long after his death the great pianist championed the peace I'm Glad it will be able to hear a new recording it tonight here on gp be\nThe first movement opens with so little French horn and has a lot of serenity to a movement is much stormy or a gorgeous ... between the piano when cello sets up the third movement and the finale is a good natured\nNorman Krieger and the London symphony with problems be flat concerto on G. P. T.\nO.\n\n\n\n\n[noise]\nAre on the\n\nA\n[noise]\nOr\n\n\n\n\nThere are there any\n\n\n\n\n\n\n\n\n\n\n\n... ... ...\n\n\n\nA\nWho who\n\n\n\n... or\n...\n\n... ...\nWhich\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n...\n\n\n\n[noise]\n\n[noise]\n\n\n", "show_name": "Nightcap", "year": "2018", "city": "Carrollton", "day": "10"}