{"month": "10", "state": "FL", "station": "WMFE", "content": "For any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospitals for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nLooks like another unseasonably warm day with high is again up around Ninety degrees and a twenty percent chance of showers but a cool down this first Sunday with Heinz only reaching the lower eighties under mostly sunny sky they says Ninety point seven need\nSupport for any points that the news comes from hell in San ... attorney and certified financial planner with a mission to advise central already in about the importance of planning ahead educating WMA the listeners that the ability to lead just two percent of their state to their favorite charities and nonprofits\nLearn more as far as the seven five three nine thirty nine thirty nine\nThis is public radio for oil of central Florida you're listening to Ninety point seven W. M. F. E. FM Orlando Melbourne Daytona Beach\nMajor funding from point it's provided by Geico offering auto insurance coverage for cars trucks are SUVs and providing twenty four seven customer service more information on auto insurance at ... dot com or one eight hundred mine for seven on him [noise]\nFrom WB or Boston and NPR's David Folkenflik and this is on point the president thinks Mohammed bin Salman is a principal guy what happens if the prince ordered a murder on the Washington Post columnist\nThe midterms are spreading toward us what's going to be decided\nElizabeth Warren discloses her distant Native American ancestry why should we care deputy attorney general Rod Rosenstein affirms Russian interference in two thousand sixteen race what's that mean for the Mueller investigation\nUp next on point or weekly news roundtable dives in [noise]\nFirst news [noise]\n\nLive from NPR News in Washington I'm jak sphere\nSaudi Arabia is acknowledging the death of journalist or ... you have to solve the consulate in Istanbul this month that's according to report in the Saudi state news agency NPR's Peter Kenyon reports Eighteen people that have been arrested including to advisors to the Saudi crown prince\nFirst official confirmation of democracy will ... death came from a report in the official Saturday press agency it said ... died after what it called a fight inside the consulate in Istanbul workers showed you had gone to collect paperwork for his pending marriage to a Turkish woman\nThe report says several officers were fired including senior intelligence officer major general Ahmed Asiri and another advisor to crown prince Mohammed bin Salman Souter Khatami Turkish investigators have said to show you was killed in his body dismembered\nUntil now Riyadh and maintain to show you left the consulate freely and it didn't know his whereabouts Peter Kenyon NPR News Istanbul\nIn a statement the White House said it is saddened by the confirmation of the journalists death and says it will continue to follow the international investigation into what labeled a tragic incident\nSecretary of state my palm Pelayo says the U.S will do what it can to help Mexico stopped a caravan of migrants he says for police officers were injured today's the migrants tried to breach the boarder who in Guatemala and Mexico Here's NPR's Michele column and\nWrapping up a trip to Mexico bomb pay us as he had good conversations with the president and foreign minister about that caravan of migrants\nHave a large group of people there for the women and children [noise] run of the caravan for you that feels as they make their way through [noise]\nAnd I have four\nHe welcomes the Mexican decision to bring in the United nations to address the situation President Trump is thinking Mexico for trying to stop the caravan and says if the migrants who do make it through Mexico and to the U.S border is vowing to send in the military Michele ... NPR News Washington\nA week after the Trump Administration asked a judge to reject a draft planned reform Chicago's twelve thousand officer police force attorney general Jeff Sessions is saying the kind of reforms being discussed will create a surgeon violent crime there\nThose reforms include limiting please use of deadly force such and such bringing the department under close federal supervision is not the way to go micromanage thing this sci fi through a federal court or\nDoes it justifies really is an insult to the\nFarm sessions claims that dramatic increase in homicides in the city and twenty sixteen on the green it between Chicago in the American civil liberties union the Trump Administration maintains a proposal would take flexibility away from police\nSocks gave up a rally earlier today bouncing between small gains and losses for ending the session on a mix note the Dow uh sixty four points today to end the week at twenty five thousand for forty for the ... thirty six points this is\nNPR News I'm Mark mammoth NPR's standards and practices editor here's a quiz for you which are the following sentences is grammatically incorrect\nHey they celebrated their one year anniversary or be they celebrated their first anniversary\nSeen one year anniversary would actually be redundant so the correct answer is the [noise]\nThe difference might seem insignificant but when our listeners turn to us for fairness and accuracy using the correct language is important\nPublic radio reporters across the country work everyday to bring you clear and transparent reporting that some foreign quite strong ethics and we count on you to when you sign up to become a new member of this public radio community you help our reporters and editors to get it right to\nBecome a new member today here's how\nIt's easy to support Ninety point seven WMA feed during the silent Dr\n... W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty you can make a one time gift or become a sustaining member with a set amount monthly from a bank account or credit card\nIf you become a sustaining member oh about thirty dollars a month or more will send you a pair of nutty point seven W. M. F. E. customs sucks visit W. M. F. C. dot ORG or call one eight hundred Seventy five twenty twenty\nSupport for Ninety point seven news comes from Medicare Medicare is dedicated to providing a team of health care professionals that are built around the patient needs and will be with them every step of the way more information is available at one eight six six\nNine eight seven six two to four or at ... dot com\nSupport for NPR comes from west in hotels and resorts Westin is committed to the wellbeing of travelers with offerings like heavenly beds a super foods are ex menu and gear limping for when workout gear is left behind at home west and led to rise learn more at West in dot com\nAre listening to Ninety point seven news that Nicole dark and crashed in in your forecast partly cloudy skies this evening with a thirty percent chance of scattered showers moving through most skipping down into the lower seventies taking a look ahead after a weekend\nSaturday looks like another unseasonably warm day with high is again up around Ninety degrees and a twenty percent chance of showers but a cool down there in first Sunday with high it's only reaching the lower eighties under mostly sunny sky it says Ninety point seven need support for any place other news\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician that committed to children tell by the health care partners dedicated to their well being from birth to adulthood including us all important teenage years later how over twenty pediatric location to central Florida family more information including locations Arlene do health dot com slash kids\nI mean at least part super him in the heart of Orlando what car buying comes from the commitment to lifetime care without pressure dealer feet alliance for super dot com\n[noise]\nFrom WVU are often end NPR David Folkenflik and this is on point\nFor the first time President Trump was knowledge is it a pure Saudi journalist and dissident Jamal ... G is dead\n[laughter] [noise]\nFiery accusations and this week's Arizona Senate debate as Republican congresswoman and former combat pilot Martha mix Sally accused democratic congresswoman ... cinnamon of the train her country during her anti war activism Fifteen Years ago the only sign of highly\nFound Martha has chosen to run a campaign like the one you're so right now we're getting ready to attack clearing my campaign [noise]\nImage terms and more later this hour this hour on point in the weekly news roundtable dives and\nYou can join us on air on line\nWhat do you make of the ... story and this scandal how should the u._s. respond worried one hundred forty three eight to five five that twenty eight hundred and forty three talk\nOr joined us anytime on point radio dot org around the twitters and on the Facebook it on point radio\nJoining me now in Studio is Margaret ... senior White House correspondent for Bloomberg also a board member and past president the White House correspondents association and the Washington press club foundation she's with us here in Boston today 'cause she's spending the fall is a fellow at the Harvard Kennedy School since due to politics Margaret ... welcome back to on point David it's great to be here with you\nAnd with us from Washington Fernando bizarro she covers Congress covers the White House she covers the federal government for Univision Fernando does are welcome Don point\nThanks to David a good to be here have you went from Hanover New Hampshire Jack Beatty joined us hello jak David Margaret and Fernando I Want to\nStart a business that discussion today by just having a little bit of a sample of how discussion had ... you could say of all over the course of the week\nI Want to hear how President Trump and his secretary of state Mike Pompeo those descriptions went for the disappearance of Jamal ... G of all this week starting with what the president had to stay shortly after he spoke with Saudi king Solomon on Monday\nMe I'm David Folkenflik and this is on point [noise]\n\n\nSupport for Ninety point seven news comes from that nearly foresee Bruce out now with the locations desires central Florida unless colonial giant on south orange blossom trail offering super is full line of vehicle down nearly sports the British Sounds were car buying comes with a commitment to lifetime care without pressure ideal iffy on line at the bar scene during the dot com\nAnd now at sports Hebrew south dot com\nHi I'm Matthew petty the host of interest ... points even use way you can hit and they have conversations about issues that matter in central Florida and you can have usa support local programming on ... even during the silent drive by calling one eight hundred Seventy five twenty twenty or make a contribution on line of W ... dot org slash support and thanks\n[noise] support for on point comes from the listeners have W. B. U. R. Boston and your NPR station from ... offering motorcycle an RV insurance more information available on motorcycle an RV insurance\nGeico dot com for one eight hundred nine four seven auto and hardly travel dedicated to changing the way it's client see the world\n... custom groups are designed with guidance from country specialist more information is available at AU D. L. E. Y. travel dot com [noise]\n\nThis is Dave is on point I'm David Folkenflik we're looking at the week in the news you can join the conversation is the name Trump on your mind if you vote even though he's not on the ballot what issues do you care about where one hundred forty three to five five ... hundred and forty three talk you can also follow us on Twitter and find us on Facebook it on point radio\nI'm here talking with Univision Washington correspondent Fernando bizarro Bloomberg senior White House correspondent Margaret ... and on point that analyst Jack Beatty I Want to take a couple of your calls about the ... the uh apparent murder\nAnd also what it means for our relationship with Saudi Arabia a Jake is calling from Oklahoma City Oklahoma Jake you're on the air\n[noise] Hi thanks for taking my call thank you sir I just\nA statement that I got a question my statement is uh I really like it kind of ridiculous that we're still talking about this about the guy that's not a you know that was murdered not in the United states and we think that the credits possibly could have something to do it and we're actually talking about ... billion\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDoes your support for uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nMaking negative you know look on Trump like we don't even know if the Saudi ... doing that's just what are speculating and I just I'm like my question is what what should President Trump do\nBy ... says this one guy got killed there's not a U.S citizen again and it didn't have enough that should we just cut all ties with kj with Saudi Jake\nThank you for that that's actually really good question Fernando what do you say\nI think the administration obviously he's not going to cut ties with Saudi Arabia is just what I Would jak was discussing we're all discussing earlier um\nBut I think that uh you know the the ties are both a strategic and commercial are are huge a Saudi Arabia from what I've read some analysis on from the energy sector is no longer\nThe ... and the biggest provider of oil as to you or to the U.S as he used to be still important but not the biggest anymore um but um I think\nThat uh what what the Trump Administration needs to do is try to get to the bottom of this and maybe show um ... you know a stricter stance or you know in front of what seems to be this um this murder because there's murder has been condemned by everybody by so many places I Can't say everybody may sound like Trump saying that everybody's talking about it\nBut um you know but so many leaders around the world of the that that maybe they the United states has to take a stricter stance at least what what is not whether it's been\nShowing right now or on a not the attitude that's been public are too many\nUh okay uh we also have a call from a uh Richmond a Vermont a John you're on the air go ahead\n[noise] hello David thanks for taking my call or just for the counterpoint to your previous caller I'm\nPresident Trump here is to be completely transactional what all this decision making\nAnd uh you know we should have a policy at a stance on human rights and independent journalism and but also have the idea of what we're\nWhat the players here have its stake in terms of a wire the Turks providing this information [laughter] if they have access to video and and recording in the county conflict or we checking or conflict\nAnd just as a again a counterpoint\nHe talks about the apparent death of a uh mister show gay and then goes to Montana and law to Congress and who assaulted a journalist and\nYeah and that was pretty stark right John\nHow long would it it it affects it brings into question his judgment and that's my concern or you know just to suppose that this is somehow a an event and you know designed trapped someone frankly I don't think the world\nIs worrying about what the president is doing when they're having their own crises\nAll right well thank you thank you so much for that John ... I really appreciate markets all do you draw the connection between ah the president's remarks in Montana and what we've all been talking about for the past ten days or so\nWell I'm feels grows to talk about politics and all that stuff in the midterms are a couple weeks away let's be honest that's the lens through which uh\nEveryone is going to be thinking and discussing every major issue between now and then and I think what\nJake and John ah are talking about the last two callers is you know actually can give\n'em a really good reflection of some of the divide in this country right now about why they should care about this issue how much they care about this issue in and and and what is it really mean a ... you know I mean the reasons why what happens to somebody who is\nA Saudi man living in the United states a with a contractual relationship from an American newspaper why should anybody care about that it's from a U.S perspective for two reasons number one is the U.S getting played President Trump\nJared Kushner have put all of us really almost all of their eggs into the Saudi basket in terms of rain mentioning how to deal with Iran or who to do business with who to share power and intelligence with\nUh and uh it is this the right gambit\nAnd number two does the U.S still have I'm Still view itself as having a role in I'm trying to send ... trying to send the right signals about human rights around the world why should the u._s. do this why should the U.S get involved in other people's business wealth\nOr because to promote democratic ideals and to um\nTo try to make 'em the rest of the world I'm the kind of place where it also safe to live and be a dissident express your views on to try to have around the world and and maybe morality is too big a word but but some\nSense of appropriate global behavior okay so uh why should every American care about that more than the economy or a more than health care or more than the tax cut debate well they probably don't which is what President Trump is betting on when he\nTries to energize a crowd in in Montana or about a domestic issue and he doesn't believe that it will will impact them negatively\nI mean what Carlos how important we think this is geopolitical spaces journalistic bases the moral basis very few people are going to vote on that are interested in ... but at the same time for briefly I Want to get at the question of do you think there is a direct line and the rhetoric from what the president says about the congressmen who just before his election assaulted ... American reporter for the guardian\nAnd pleaded guilty to that I Believe in misdemeanor assault\nOr two convicted on that are and what he's counting singer was seemingly kind of hoping to tolerate happened from the hands of a a an allied from Saudi Arabia\nI'm not going to uh [noise]\nI'm just trying to position to make predictions about what the president's rhetoric the president's rhetoric in the United states\nUh it had caused this in any way our fuel this in any way but I Will say that um when when the president does make remarks suggesting that violence towards journalist is okay American journalists are concerned uniformly not just about the implications that has in the United states but about the implications that has another country's I'm\nI wanted to play you know we should turn to the midterms is coming up quick I Want to play a clip of what the president had to say uh recently here so that the the tenor of what he has said in trying to rally the Republican faithful and the base out at rallies in in sequence from Missouri West Virginia in Mississippi just in the past few weeks\nI'm not on the [noise] but I Am I\nVoted for me I Want you to turn them on the balance it out in twenty Eighteen because you're voting for me in twenty eight [noise]\nOoh\n\n[noise] support for on point comes from an exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information that Colo guard test dot com and told me advice or\nMatching homeowners with home improvement professional for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home in visor dot com [noise]\n\nThis is on point I'm NPR media correspondent David Folkenflik I'm Talking about this past week in the news with Fernando bizarro he's a Washington correspondent for Univision Margaret ... senior White House correspondent for Bloomberg and on point use analyst Jack Beatty\nYou can join the conversation what stories caught your eye this week where one eight hundred for two three eight to five five ... hundred forty three talk\nYou can also follow us on Twitter and find us on Facebook at on point radio a couple of listeners weighing in on line\nA Roger hunter at least a but listen posting on the name Roger Hunt post ah\nAh that civility and the Democrats in the GOP is long gone the opposition is now the enemy hard to see during these a midterm election season what could bring us together or another one speaking about the question of what we are expecting President Trump to do a notes\nSays it's worth noting the President Carter's disastrous legacy\nIncluding a strong emphasis on human rights which in part led to the overthrow of the shah in Iran and its devil Lucian to fifteenth century theocracy a as described there are a couple of listeners way and I wanted to turn to another element of the midterm elections which was the question of turnout and particularly turned out to Latino voters\nDemocrats talk about this a lot I think that in Texas they'd been staking that the idea that bait or work would somehow benefit from that his\nHe has flew into a in Spanish appealing to Latino voters are\nUh are said to be even though a\nHis opponent the Texas Senator Ted Cruz is of Cuban descent ah Fernando bizarro how important\nIs a Latino turnout to Democrats and how well are they doing in trying to accomplish that teen Latino\nTurnout was very very low is twenty seven percent and twenty sixteen went up twenty percentage points um [noise]\nPew I'm pure research Hispanic trends came out this week with their\nWith numbers on the you know a vote this year they they are saying that there's a record uh they they estimate twenty nine million eligible Latino voters but the key word here is eligible not registered um it's it's been low in talking about taxes there is a five point four million\nEligible voters in a Latino voters in Texas Beto O'Rourke probably needs that but you know it's sometimes it's really hard to to define a if\nProduces a appeal to two Latino Republicans in Texas is is is strong enough um interestingly for instance the Univision just a interviewed a last week both candidates and\nAnd and ... did it as as though he always does with Spanish language media didn't in Spanish a Ted Cruz didn't um he he never likes to talk in Spanish in public\nUh but I think it's very important to see what the what the turnout was going to be that traditionally tends to be disappointing the national association of Latino elected officials which is an authority on on on the Latino vote as well will\nCome out next week would there a year I'm not yearly every two years um their their projection um they'll let you know load we might get a clearer picture than but but this again and we'll we'll dependable hands on on the turnout\nAh Fernando or they're in a couple of other races that you point to that in which you think that's going to be politically important\nWhat we have Florida a and I think Florida it's very interesting that much has been talked about um\nThe influx of Puerto Ricans in Florida and we tend to think about it I think that conventional wisdom tends to think about Hurricane Maria and all the people who who left Florida may be temporarily and who have I'm Sorry left the island unsettled in Florida\nI'm temporarily all over the country as well but mainly in Florida particularly on the Orlando area there's a story that I saw this week that nearly seven eight thousand Puerto Rico\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been to the family\nDon't your support for uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nWhen Hurricane Maria but no that's not the case there's been a a population train and Puerto Rico for the last three years or more since the fiscal crisis on the island hit really hard\nAnd people have been leaving and many of them happened settling in in in Florida so we'll see what the difference is going to be particularly in the ... and the race for governor\nI'm In South Florida it's there's a different dynamic\nYou know the Latino bases well entrenched there there are some changes of course demographic changes in some of those ... districts that are turning more democratic than\nThan the than the Cuban Americans who would tend to vote more Republican have wanted but ah there's I think still they have some safe seats in there but\nBut it's the key vote for the Puerto Ricans would make may make a difference in other parts of the state\nDuring an interview with CBS this morning on Wednesday former Obama administration official in San Antonio mayor Julian Castro says he's concerned about Latino turnout in the midterms because numbers have shown that the rate is ... at what he said it's not what it should be\nI think what it's going to take the change that his campaign done six months before an election for by any one or two candidates it's going to take folks investing in a massive and sustained effort\nTo care for the eagles registered and then the turnout sort of old a ... and until that happens I don't think that the numbers are going to move a lot of\nMargaret tolerate it seems to be that almost every cycle we shared the importance of Latino voters and the idea there's gonna be a surge but that there is a even if there's greater registration there's not a huge edition of of Latino voters what's your sense of all\nThis I was really struck by one of your callers earlier actually left in the middle of the question not to be disrespectful them but because it resonated with me so much he said he was so frustrated by the ... of different narratives about what's really going on in the midterms and I think you know not everybody is asking the right questions which is it's a mentor me or are\nThe Republicans who voted for Trump still as enthusiastic are they going to go out and vote for their congressmen or will they turn you know what's the Latino vote going to be one about young voters typically\nIn the past is very low for young voters are they energize they say they're energized and they actually going to turn out what about the non college women what about the college educated women and I\nYou know I the the polling attempt to measure a snapshot in time but you could say something three weeks before an election and then just\nWake up that Tuesday Morning and say you know and that's what the term question has always been so these questions are really important the president and many Republicans\nHave a I have at least been probably talking again about believing that things are swinging in their favor that Republicans could hold the house and\nAnd I think some Republicans see this caravan of Hondurans who have been moving up through Guatemala and Mexico as something that could actually help them a ... kind of a counterintuitive thought so we have a lot in play here but\nUh the question really does when it's all said and done come down to what individual people do um either for absentee voting or in terms of going to the polls that day\nI Want to actually play a clip of a couple of a Honduran migrants who spoke to CNN this week there's ... and I'm Andrea I lame on they spoke to CNN this week about why they're making that track from Honduras towards the United states\nThere's much corruption here in Honduras we want to work there is nothing we want them to plant bananas teams being there isn't any brother we need to migrate to another country brother in the hospitals there's new security there is nothing or patients die brother\nWere heading to the United states we're going to arrive with Donald Trump he has to receive us\nUh you've heard that the voices of those migrants speaking through an interpreter is on on on CNN a Fernando ... wrote a vis a caravan it's obviously intended to create a tension or what are the repercussions of it\nWhile the repercussions can be many obviously we could have a second family separation policy as it was a suggested by the administration or and reported last week that they are considering it in New policy in which in a way that they would give somewhat of a\nVoluntary separation option to these families once they were detained but this is mostly right now in the works we we still do not know the details of this but if I may give some some context to this care of and I think there are some politics involved I mean you interview I've seen many of the interviews that people that are coming up and there is a true need\nRadio listeners contribute because they value the programs they hear listener donations are the single largest source of revenue for Ninety point seven WMU the that's why your financial support means so much right now make your contribution today during the silent Dr call one eight hundred\nHi I'm off on taking all of our president and general manager of made the point that I Do and that it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and how we do it now that I'm happy family\nDon't your support uninterrupted programming about donating a dollar a day W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nSeven programs news stories and audio streaming find that a whole lot more at W. M. F. E. dot org this is not the point seven W. M. F. E. F. M. Orlando Melbourne Daytona Beach\nMajor funding from the point is provided by Geico offering car insurance as well as services for homeowners and ranchers insurance through the Geico insurance agency additional information can be found at Geico dot com or one eight hundred nine four seven odd out [noise]\nFrom WB or Boston and NPR's David Folkenflik and this is on point\nMovie that he knew give out today tells the story of star card an African American teenagers shuttling between dueling realities are predominantly black lower income neighborhoods and her predominantly white an affluent private school [noise] the movie explores police shootings of African Americans the ravages of the drug trade and paths for hope\nUp next on point we talk to the film's director George Tillman junior and then to three young African American activists [noise]\n\nLive from NPR News in Washington I'm jak sphere\nAnd a statement of White House press secretary Sarah Sanders is offering condolences the family of Saudi journalist smokers show gee finance is fiance and friends as well after the kingdom confirmed just deaths as NPR's Tamara Keith explains there is no indication of how the Trump Administration will respond\nIn her statements Sanders said the United states acknowledges the announcement from Saudi Arabia that its investigation into what happened ticket show gee it's progressing and that it has taken action against several suspects\nShe didn't weigh in on whether the Trump Administration considers that Saudi explanation credible now Republican Senator Lindsey Graham was late has been a very close ally of the president's tweeted quote\nJust say that I Am skeptical of the new Saudi narrative about mistook his show gee is an understatement Sanders said the administration would continue to closely followed the ongoing international investigations and wants justice that is timely and transparent camera ... NPR News the White House\nSpeaking to reporters tonight in Arizona President Trump said the the best ... was a good first step you also said he prefers any sanctions against Riyadh nod includes canceling big defense orders\nThe death toll from hurricane Michael is climbing at least thirty six deaths are now recorded across for southeastern states majority of those fatalities aren't Florida appears Debbie Elliott reports one of the latest cows loses a firefighter struck by a tree and the Florida Panhandle yesterday\nOfficials say forty nine year olds fire coordinator Brad prize was killed on his tractor clearing trees from his family property and we were hit Scott ... county emergency services cheap mark Bowe and says the death as a blow to first responders already stretched dealing with a catastrophic aftermath of hurricane Michael\nThose guys are done I mean they've got to get some rest but it happened to have um two plus they just make 'em leave their lives you know there's more to keep doing this for\nRecovery is hampered by heavily damaged infrastructure back powers body cell phone service and destroyed gas stations Debbie Elliott NPR News Panama City Florida\nA caravan of Central American migrants has clashed with Mexican police at the country's southern border about fifty people were apparently able to knock down the Guatemalan border fence to find both Mexican authorities calls for orderly migration and US President Donald Trump's threats of retaliation\nMexico City today secretary of state Mike palm peyote a news conference with the Mexican counterpart was asked about the situation we\nAre deeply aware or that the the way that Mexico will handle this way you will handle this is your sovereign decision or Mexico will make its decision if leaders in its people will decide the best way to achieve what I Believe our our shared objective\nPolice drove back other migrants using pepper spray on Wall street today the Dow was up sixty four points this is NPR\nOur our Michel Martin I'm Kelly McEvers I'm Ari Shapiro your for my numbers on how this drug laws for my name's Jenny all day\nAnd my name is David Draine co host of MORNING EDITION you know there's something you hear when you turn on public radio it's the sound of voices across the world the sound of information the sound of the nation listening together why do you listen\nTo literally listen to anything about it when I'm Talking with friends and family the friends I've been listening to NPR yesterday and it's something that I just find myself repeating over and over and over again I find that diverse and different ... that people are listening to NPR they're getting real news [noise] real information on NPR\nReal new and real information or a great reason for was there are also a great reason to call or go online and you and when you do you make of then six stories and voices from around the country possible the best of all you make your own voice for the call or go on line and make a contribution to the station today\nAnd thank you if you're hearing my voice well then you are a listener the question is\nAre you a member become a member today please help support Ninety point seven W. M. F. you during this silent Dr make a financial contribution on line and W. M. F. U. dot org or you can call one eight hundred Seventy five twenty twenty and thank you\nSupport for Ninety point seven news comes from central Florida community arts presenting our greatest hits here Florida's largest symphony orchestra performance twenty of concerts with\nFilm scores and covers of hits by queen Michael Jackson the Beatles and more October twenty six and twenty seventh calvary Orlando in winter park tickets available at CFC arts dot com\nSupport for NPR comes from the little market offering artist and made goods at home to core with the commitment of fair trade a nonprofit founded by women to empower female artisans in marginalized communities around the world more at the little market dot com Andy any UK fee foundation\nYou are listening to Ninety point seven news I'm Nicole dark and crushed and and your forecast partly cloudy skies this evening with thirty percent chance of scattered showers moving through low skipping down into the lower seventies [noise] taking a look ahead at the weekend\nSaturday looks like another unseasonably warm day with high is again up around Ninety degrees and a twenty percent chance of showers but a cool down moves in for Sunday with Heinz only reaching the lower eighties under mostly sunny sky they says Ninety points seventies\n[noise]\nFrom W. P. U. R. Boston and NPR\nOn David Folkenflik and this is on point in the opening scene at the new movie the hate you give an African American father gets his three children and the talk over the dinner table\nIf they're pulled over the father says they should put their hands on the dashboard where the officer can see them answer his questions and despite all they might go through they should remember that being black is something to be proud of the lead characters that teenagers start\nFor any planes and the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nAs we learn and the aspirations and challenges shared by African American you\nWere going to speak to some young activists later this hour but first joining me now here in Studio in New York is George ... junior he's a film director producer and screenwriter known for his films soul food barber shop\nMen of honor and a tourist among others he's the director of the heat you get what you set for wide released today George welcome Don point thank you for having me and congratulations on your phone Oh thank you I'm very excited\nThat talk that maverick is they'll really personal I Want listeners to hear that because they haven't had a chance to see the movie at the opening scene of the movie stars father maverick Carter gift that talked his three kids their age is ten nine and one\nWhen it happens do you answer the questions we don't have an extra keep your hands out your pockets you dropped from ... to ...\nYears before\nThat talk in the movie felt incredibly intimate and personal to me on viewing how close was that just a to a talk that you either received or given\nYeah you know that's something that I experienced very young they came from the various ah family members my father at a very young age I remember around a lease about eleven ten years old\nUm Milwaukee, Wisconsin that's where I grew up as a young kid um um it was the ideal of really trying to make me aware\n\nSupport for Ninety point seven news comes from boats do rentals boats do rentals is in Orlando baseball rental company offering a twenty foot soundtrack or deck vote including life jackets\nSound system Carmen safety equipment and seats nine people voted to deliver to renters location and captain services are available reservation information is that boats do rentals dot com\nSupport for Ninety point seven in ... some of the seminal state college speaker series\nFeaturing Ross Douthat New York Times columnist and author with a presentation can the Republican Party keep the working class reception and book signing to follow Thursday November first at seven PM more at ... dot edu slash speaker stashed series\nSupport for Ninety point seven news comes from the ... museum of history and natural science and cocoa hosting its third annual Florida frontiers festival Saturday October twenty of performers include folk singer Bobby last singer songwriter Chris call into Qusair rocker Mica Garcia event details and tickets at Florida frontiers festival dot com\nNinety seven W. M. F. E. is here for you date in and day out you can be here for Ninety point seven W. M. F. you in the same weight support news that matters with your own going monthly get from your checking account or credit card\nAnd we'll send you a pair of Ninety seven W. M. F. E. customs socks ... hundred Seventy five twenty twenty or visit W. M. F. you got to work\nAnd support for on pulling comes from the listeners have W. B. U. R. Boston\nAnd your NPR station from exact science is offering Colo guard for average ... adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information that Colo guard test dot com [noise] and oddly travel\nHardly country specially designed trips and experiences intended to change the way it's client see the world\nMore information is available\nAt a U. D. L. E. Y. travel dot com [noise]\n\nThis is on point I'm David Folkenflik we're talking to young activists about the new film they hate you give\nOut for a wide released today and also what it means to be a young African American in America today we want you to join in what aspects of the Carter family story resonate in your own life in your own community where one eight hundred forty three to five five ... hundred for two three talk\nYou can also follow us on Twitter and find it on Facebook at our point radio\nWe just heard from Georgetown junior he's the director of the movie he told us about the importance of listening and he also said to us it starts with young people\nWell we get to hear from a panel of three young activists from across the country right now first joined me from Chicago is a ... a Seventeen year old senior at ten would academy she's a member an organizer with good kids ... city\nAnd advocacy organization that includes young people from Baltimore in Chicago who are working to end violence in their cities ... welcome down point\nHi David thank you for having me and joining us from New York is dimitrius downward he's a Seventeen year old senior at Washington Heights expeditionary learning school a member of a million ... movement for justice that's an organization that trains leaders to fight against end end anti black racism and systemic violence dimitrius welcome non point\nHi David thank you for having me and also joining us from Franklin Wisconsin is chaos\nSupport for Ninety points in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children have been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nNation are led by use of color or that organizes young people around issues related to political power and social racial and economic justice cab welcome Don point\nHi David thank you for having\nCare first would start up with you a drug to him and his friend Milwaukee himself but what struck you about uh our conversation today\nUm I think one of the biggest thing that struck me was talking about star code switching and I find that often for me because\nI Do I Do live in Milwaukee, Wisconsin and I go to a like a better school how out here in Franklin Wisconsin\nSo can we just take a moment and I'd like to unpack that a bit for those folks who might not know about code switching is basically as a as I as I understand it you know basically switching how yet talking how you handle yourself if you're in different communities different neighborhoods how does it play out for you\nWell um so I I'll be going to NPs or not in the ... project on rocky because that's where I live well when I started a as a freshman in high school I came over to Franklin high school and it was a whole new ballgame than the one from being around people all day who look and talk just like me now\nComing here to people who look completely different and had different lingo and different things than I have so\nI remember my freshman year I Would\nStill talk like normal or I was ill you started playing and people would not understand what I meant by sanctioning words or I Will get feel different for talking less property and they did\nSo I kinda get started teaching myself that when I met or I taught properly I use proper English and when I go home I'm able to talk how I feel comfortable talking and you dislike that my family and friends I used to\nYou know there's a scene in the movie a that goes that speaks directly to that a start Carter is a ... played by the actor Amanda Stern ... she lives to live she shuttling between garden heights a reporter and mostly black neighborhood and Williamson which is ... mostly white a private prep school did she attends\nA in this scene as a start enters William since she explains that she also shuttles between two ... two different persona is\nDied and I said well we're really incentives another\nAnd I got to keep it separate so when I'm here I'm Sorry version to\nNow means slipping a switch in my brain Williamson died doesn't use slang if a rapper was saying she doesn't even for my friends you\nHave to pay how are you\nThing makes me but\nYou know those kids\nFace scans\nKay is that what you're talking about\nYesterday's exactly what I'm referring to\nI Wonder ... you know I did you read uh uh uh the book as well if I'm not mistaken\nUm or these themes that kind of play out in your own life where you you have to think about how you handle yourself because of the fact you're African American\nYeah I'm specifically to like my own past experiences I used to live in a suburban I was younger and so the transition from when I moved away to the city and how\nEverybody speaks them now you have to act as a completely different and so because of the areas of where I work at I definitely have to experience the idea of code switching because um\nIt's like you because you are\nBlack saying these worries an acting like this makes you appear as hood and makes you appear as less educated than somebody else so when you're around these people even though we don't like intentionally mean to do it it just kind of happen subconsciously because you'd never wants to be like labeled as something like that\nAnd so I resonate with star a lot because when I had to switch back and forth between both of my\nMostly white communities and mostly populated with last year we didn't the way I spoke to the way I talk to address the way I act it was completely different I definitely can relate to that idea of Code Switch team\nWhich at how much like how much of an extra burden is that walking around having to St consciously about how you present yourself or is that kind of similar to you know how teenagers have to figure out who they are going to be anyway\nUm I think it's definitely an extra burden that we have because for black people it's this idea of a double identity that we always have to say\nThis now dimitrius\nYou want to go in there for ... no I'm Sorry okay go ahead ... right ahead\nSorry a live radio waves [laughter] I um I definitely think that\nIt's way more harder for black person to find themselves because we're always faced with having to fight so many negative stereotypes that's already approaching this is the first place so I think if you're somebody who doesn't grow up\nBeing educated on history of our people and learning about how to really truly love yourself for being black and you're kind of just growing up in a world where if you're not hearing these things but you're hearing by people or an educated they missed their that their head they will never waned blah blah blah blah blah it's kind of like\nSo what do I have to conform I substitute it seemed like I can make it so I think\nCode switching is definitely a burden for a lot of black people because it's especially a lot of young black people because we're not\nFully aware of ourselves yet and civil or face I was trying to be ourselves but then also face on trying to please others it does become an extra burden because most other people won't have to go through that because they're already\nThe idea of perfection other people's eyes but we are\nTo be trusted you have a different take on that\nUm I agree on that one Minnesota situations like when I have like a job interview or something oh pill on voice like not to be like a pill like a white voice that spirit but um\n[noise] do you get back on bacteria\nYou sure of course I actually ... what I did want to ask you about a little bit was you know we heard from a maverick who's the father\nOf a stark harder in the opening scene about how important a must be proud of being black in at the same time he offered that in the context of the talk the talk about how a young black kids are boys and girls need to to handle themselves when they were dealing with law enforcement officials\nDo what you did you ever receive a version of the talk like that\nUm yes ah received a talk like that when I was younger so had that lay out what was that way it was just one night when me and my father was like in the kitchen token they were just talking about driving his stuff and we got to the topic about police from the get pulled over\n\nYou are listening to Ninety point seven news that Nicole darkening crashed in in your forecast partly cloudy skies this evening with a thirty percent chance of scattered showers moving through Lowe's getting down into the lower seventies taking a look ahead at the weekend\nSaturday looks like another unseasonably warm day with Heinz again up around Ninety degrees and a twenty percent chance of showers but a cool down this first Sunday with heights only reaching the lower eighties under mostly sunny sky they say it's Ninety point seven need\nSupport for Ninety point seven news comes from Flagler College ideas and images in partnership with the St Johns county tDCS posting Sherry Johnson professor of history from Florida International university\nAnd she presents Florida in Cuba find centuries of shared history and culture on Thursday October twenty cents details that Flagler dot edu slash ideas\nMm\n[noise] support run bully comes from college fine for consultants work with high school students to identify energy their goals in high school complete the college admissions process and negotiate merit scholarship awards more at college buying dot com\nAnd carbon I offering secure data protection solutions for growing businesses including automatic back up for servers in computers\nHigh availability and disaster recovery solutions and automated data migration\nLearn more at carbonate dot com [noise]\n\nThis is on point I'm NPR media correspondent David Folkenflik we're talking to three young African American activists about life in their communities were inspired by the release at least broadly today of the film the heat you give\nBut our conversation is expanding so much more you can join our conversation what are you hearing from these students have their accounts affect the way you think about race in the U.S what are your experiences\nWere winning hundred for two three eight to five five ... hundred for two three talk you can also follow us on Twitter and find us on Facebook at on point radio\nStill with us from Chicago is a ... a member an organizer with good kids mad city chaos Heinz she's program coordinator at leaders igniting transformation Milwaukee and dimitrius downward a member of million ... movement for justice I first want to do to take a call from Tampa, Florida a Michael you're on the air\nYes sir um first of all hello and thanks for taking my call Yes sir\nI'm I'll get I'll give credit and and praise to the you for doing what they're doing but I'm uh fifty eight year old black man and this is nothing wrong with America and I don't think it a ... matter of fact they seemed like it got worse since the seventies to be honest with you\nWhat's gotten worse and Michael\n... the the the racial profiling and the tension between the rate that I mean look we got we got Donald Trump elected that the the the attitude and the mentality of\nWhere the state of mind you know the police force was created to keep the Jim Crow laws and check and everything and that mentality and psychological profile is still on the fourth today\nThank you so much for your perspective Michael I appreciate it very much dimitrius downward you focused a lot in your group as I understand it on thinking about how to de escalate tensions with police there's there's a line in in\nThe movie where star Carter's a uncle who's on the police force basically\n... he's in her corner but a certain point he says to you know police face a lot of dangerous circumstances situations you've got to understand that how do you approach thinking about uh how how you deal with police are in this day and age and and the challenges they face as well as the the challenges that you might face\nUm I think is respect we need to respect for both both sides um when I was Thirteen I had to experience would stop and frisk and that put me to have a lot of fear and the next two years I always had like fair for police can you tell me about\n... can you tell me a little bit about what that incident was like\nOh it was like what happened it was scary I was walking around my block and I'll go build into building trying to find a friend and I know like these two policemen are following me so I've started like kind of walking fast because that was kind of scary\nAnd um they called me around the corner and they started to check my ankle to see if I had drugs or anything and\nTwenty dollars because at my parents and having a pockets and I was just shaking the whole time and they say well you scared I was like\nThis never happened to me before so the next few years every time a ... like Cruz by me I always like shake up to do\nYeah I mean it you know look I Lived in New York and have for a while and and it's been part of the the background of New York is that this this debate on a policy level ... you know among people who make policies in laws about stop and frisk\n... you know it's about this issue but it kinda takes away from the human element right like this are you acted not only your night but but how you thought about yourself out in public\nYes and um I think to have a solution for that uh-huh I think there should be like police officers in the same neighborhood for ... years circus I growing relationships with them\nHi I'm off on taking all of our president and general manager of Monday point seven W. M. S. it's been a food two years since we first tried this less truth style the fund raising cold be fine with Dr and this is how we do it now can you imagine family\nThrough your support for uninterrupted programming donating a dollar a day the W. M. S. dot org or cold one hundred Seventy five twenty twenty\nAnd sometimes I think that that should happen they should please please offices and the same neighborhood\nAnd there have been efforts to do that but it sounds as though it has been a you know taken root in a way that's been meaningful for you and your neighborhood majors yes do\nYou know there was an exclusive interview today that good morning America had with a Jeremiah Harvey he's a nine year old\nWho is a falsely accused of sexual assault a I Believe in Brooklyn New York uh when his backpack brushed up against a woman in the corner store or the woman Theresa Klein is white she called the police and has since apologized but your mind his mother told good morning America that lake like dimitrius they can't shoot the incident\nIs so hard because it causes lately on my mind like I Can't I Can't think nothing but his home in ...\nAre you concerned that this has permanently scarred Jeremiah Wright certainly you know\nIt was devastating for him because even after walking away he was pointing to patrol cars on Flatbush Avenue and saying mommy are they he had to take you away from\nCaroline how much a or is this idea of living while black uh uh uh we've heard instances where a man was stopped from entering his own home or apartment building in St Louis because a white resident there didn't trust him although he lived there as well how much does this affect kind of your your daily rhythms in your life\nI think it affects me heavily because it it creates this constant fear that you walk around and you carry it creates when you when you drive you look out of your near you see a police officer here and even though you're doing everything right you immediately think what am I doing wrong\nAnd I'm just to add on listening to the video and the incident with the little boy it very much reminding me of the situation we're in the two\nAnd how that affected him he and the tail had no idea what he had done wrong and nodded to the little boy that it just happened to and\nThey now he feels as if he did something wrong he feels as if he made a mistake or that you know something bad is going to happen to him at such a young age and now he's going to grow up and had that carrying around him so just\nGrowing up black and living up living in this type of situation create a constant um\nAmount of fear on you and a constant amount of worry anxiety and she got to carry around because you just never know what it's going to happen or what a small move it's gonna um how ... what was going to affect you it affect your life in the long run though\nIn the movie the heat you give star coterie as I said earlier played by among Lester stern bird is a attends a mostly white school called Williamson prepped\nAfter her friend ... was killed in a traffic stop by a police officer some students take the opportunity to school and to go to a protest in is a clip that we'll hear star reviews her friend Haley who's played by Sabrina Carpenter\nI just don't know who he is the situation as we get class start class it's a good cause so happened to be a really good because who\nReally don't want to say that I Do\nKind of your school had what you guys called book talk on the heat you give up what kinds of conversations or the prompt with your white classmates that spark any any new thoughts\nUm actually I had two of them one of my freshman year and then one maybe last week the first one that I had with my freshman class actually did start a conversation about what happened but it wasn't a I'm a growing conversation and it was more so like my teacher talking and then", "show_name": "On Point (NPR)", "year": "2018", "city": "Orlando", "day": "20"}