{"month": "10", "state": "FL", "station": "WMFE", "content": "For Ninety point at a news come some land out how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six outpatient enters more information is that to their land on health dot com\nRain to speak that afternoon heights tapping out in the upper seventies overnight lows dropping below sixty Sunday we'll see similar conditions mostly sunny and rain free afternoon hide in the upper seventies [noise] this is Ninety point seven\nSupport for and he points at a news comes from Don nearly sports they very devoted to improving the dealership experience teaching this brute force there but I say drivers this technology up to thirty two miles per gallon highway\nAnd superstar linked safety and security that mainly sports they bring in the heart of our land down like are buying comes with a commitment to lifetime care without pressure at the end of the alliance for super dot com\nThis is public radio for oil central Florida you're listening to Ninety point seven W. M. F. the FM Orlando Melbourne Daytona Beach\nMajor funding from point it's provided by Geico offering auto insurance coverage for cars trucks are SUVs and providing twenty four sat in customer service more information on auto insurance at ... dot com or one eight hundred mine for seven on him [noise]\nFrom WB or Boston end NPR on David Folkenflik and this is on point a suspect is now in custody over the suspicious packages the targeted some of the nation's leading Democrats\nIncluding rock Obama Joe Biden and Hillary Clinton and seeing in New York headquarters do the president refocused his attention to a caravan of migrants about a thousand miles south of the U. S. Trump says he's a national as they can ... out but NBC's Today show and oh yeah the elections there just eleven days away\nI'm next on point or weekly news round table [noise]\nFirst visit to [noise]\n\nLive from NPR News in Washington I'm jak sphere\nCaesar say are cooler suspected of sending explosives to prominent critics of President Trump through the mail may face up to forty eight years in prison NPR's Quil Lawrence reports the investigation remains ongoing\nFBI Director Chris Wray said that a fingerprint found on one of the package you soon turned up a match with Cesar say Iraq because of the Florida Man had a long criminal record that includes theft battery and making a bomb threat DNA from two packages also matched race said the FBI's crime lab had found there man within thirty six hours of receiving the evidence\nWe see unbelievable work like this on TV and Hollywood but to see it up close and reality is something to behold\nRe cautioned that more packages could still be in circulation he said the packages did contain explosive material and should not be considered hoaxes despite the fact that no one so far has been harmed Quil Lawrence NPR News New York\nAsked again by reporters today about whether his own rhetoric has anything to do with the man accused of sending bombs through the mail President Trump largely brushed off the comments after doting it appears the suspect is an ardent supporter of the President Trump said he himself bears no blame president also doubled down on his recent criticisms of the media's coverage of his administration\nWell I think is that you want to know if I could really started out as you know this is really really unfair to ban the Republican Party I think the media is very very unfair deserves the\nHas always been covered Trump's\nRemarks kamikaze came as he headed off to Charlotte North Carolina for a political rally tonight the ashes of match shepherd the young gay man murdered Twenty years ago when Wyoming were laid to rest today at the national cathedral NPR's Tom Gjelten says the internment of his ashes brought together many was so saturated with shepherd and the suffering\nThe Nineteen Ninety eight murder of Matthew Shepard came to symbolize crimes of hate and anti gay bigotry his parents did not enter his ashes previously for fear of the site would be desecrated\nSpeaking out the internment ceremony at a shepherd said he was relieved his son could now rest is so important that we now have a whole\nFormat [noise] all the others [noise] can visit [noise]\nIt is safe from\nHaters Matt shepherds ashes will rest in the cathedral crypt alongside those of about two hundred other notable figures Tom Gjelten NPR News Washington\nTo the consumer financial Protection Bureau says it intends to take another look at its payday lending rules finalized last year ... says it wants to focus specifically on its ability to repay provision which would force payday lenders take into account the ability for customers repay their loans in a timely manner that's changed you could make it more difficult the bureau to protect consumers from potential abuses\nOn Wall street that I was down two hundred Ninety six points today you are listening to\nNPR\nI'm Scott Simon I get upset when I listen to our shows sometimes I'll hear an opinion I don't like the story that riles may about something I didn't know before and almost wish I could forget that's also why keep listening to NPR\nWe just don't give you a voices and opinions that to you when you're you're right we give you points of view and hard facts that challenge what you think you were sure about subjects\nYou didn't know that you can and should care about us journalists that's what this magic carpet and time travel machine called radio can do\nThe voices and NPR become familiar friends but they take us to places ideas and people would open up our world in ways we can't predict that's what keeps me listening all that and some lightness and laughs please give your support at this station by becoming a standing member and thank you\nHelp support you're listening habits by donating a dollar a day become a ... point seven W. M. every monthly sustain er during the violent drive and we'll send you a pair of Ninety point seven W. M. F. E. customs sucks\nCall one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot O. R. G. that's one eight hundred Seventy five twenty twenty or is it W. M. F. E. dot ORG\nSupport for not he points Evan Hughes comes from ... education foundation who believes that education changes lives and strengthens communities and is guided by disbelief to invest in programs that promotes students' success in the early grades college and career readiness and post secondary completion\nLook more at ... dot org\nSupport for NPR comments from little passports a monthly subscription service for kids each package includes the games souvenirs and activities from a new country designed to spark curiosity and cultures around the globe at little passports dot com slash radio\nOr listening to Ninety point seven news I'm Nicole dark and crashed and\nAnd your forecast mostly cloudy skies tonight with ... in the middle sixties and the thirty percent chance of rain gives way to mostly sunny but cooler weekend days on Saturday expects them scattered clowns but no rain to speak that\nAfternoon highest happening out in the upper seventies overnight lows dropping below sixty Sunday we'll see similar conditions mostly sunny and rain free afternoon hide in the upper Seventy this is Ninety point seven\nSupport for Ninety point seven news comes\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been in the family\nDoes your support all uninterrupted programming but donating a dollar a day the W. M. S. dot org or cold one hundred Seventy five twenty twenty\nAnd offers to Bruce whole line of vehicles ... brew south Florida's new super super storm on line at the port Subaru south dot com [noise]\nFrom WB or Boston end NPR David Folkenflik and this is on point a man and Florida is now in custody after suspicious and potentially explosive packages were sent to CNN top democratic leaders and supporters here CBS News correspondent Vladimir ...\nOne person has been arrested in connection with these various numerous bombs that have been mailed to public officials [noise]\nNBC's Megan Kelly under fire an off year for defending blackface [laughter]\nIt's really you do get in trouble if you are a white person who was on the way for a black person that puts on weight like that that was okay as long as you're addressing other character\nThis hour on point or weekly news round table with some men Kim Daniel dealing on point news analyst Jack Beatty joined us how well do you think the nation's leaders have responded to this seeming plot how fair is it to link it to current political discourse where it went a hundred and forty three eight to five five twenty five hundred for two three talk\nWhere you can join us anytime but on point radio dot org or on Twitter and Facebook and on point radio\nWith us from Washington is ... Kim she's White House reporter for the Washington Post something great to have you with us\nHey dad for having me also with us from Washington as Daniel Dale he's the Washington correspondent for the Toronto Star a Daniel welcome Don point thank you so much and from Hanover New Hampshire we got on points news analyst Jack Beatty on board hello Jack\n... Daniel ... a cement wanting you started how seriously it's just being taken in Washington by federal authorities\nI mean is that top priority for everyone here in DC right now which the city does seem to be on edge and you know the entire political world seems to be on edge\nOn I was in the I was in the White House with the president earlier this week when he spoke it was before a ceremony where he signed this big opioids bill\n\n\n\nSupport for Ninety points on the news comes from Eileen do sentinel the calendar section inside friday's Linda sentinel contains movie and dining reviews plus local event information for planning weekend activities throughout central Florida\nInformation about home delivery of Orlando Sentinel is available at our land do sentinel dot com slash subscribe\nIt's been a full two years since we first run or less intrusive style of fundraising call the drive and this is how we do it now W. M. F. E. family show your support for I'm interrupted\nProgramming my donating a dollar a day does it W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty\n[noise] support for on point comes from college fine where consultants work with high school students to identify and achieve their goals in high school complete the college admissions process and negotiate merit scholarship award more in college vine dot\nCom and posters Smith printing posters on wrinkle resistance vulnerable fabric that transport flat for conference presentations posters Smith provides a service to research communities worldwide learn more posters Smith dot com [noise]\n\nThis is on point on David Folkenflik\nAnd we're talking about the biggest stories the week you can join our conversation what do you make of trial balloons from the White House about sending troops to the border tightening asylum laws\nWhere one hundred forty three eight to five five that twenty eight hundred and forty three talk you can also follow us on Twitter and find us on Facebook at on point radio my guests today are Daniel Dale up to Toronto Star sung Kim at the Washington Post and of course our own news analyst shirt on point Jack\nBeatty up some in ah the president has talked a lot this week about the caravan of migrants wending its way about a thousand miles south of the U.S border or in Central America south of even of Mexico at this point ah\n[noise] that that is certainly gotten a lot of news coverage and it's a very real issue on the other hand I'm In the president's framing of it as part of a a a an issue of vital national\nSecurity concern is it the sense that there is something that the president needs to address on a federal level or their sense of distant turning attention maternal elections\nI think that that I think he wants to make the sense that\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been in the family\nDon't your support for uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nIs about more than nine hundred miles south of the U.S Mexico border so it is still significantly far away\nOn you know experts in their region and ... on the issue how sad for a long time that these are people who are you know seek or who are fleeing from violence and terrible conditions and their home countries\nAnd trying to find refuge in the United states and that\nYou know the vast majority of these or asylum seekers who will try to obtain legal status inside the United states um I Do want to point out one new development that broke last night that the administration is considering invoking a national um basically at our national security powers and then and national security rationale\nTo block on ALO people at the border who come here to seek asylum it's ... they are considering using kind of the same\nNational security rationale that they use to invoke the travel ban and the different generations the travel ban and the early part of his presidency which I Do want to point out that the final determination of that band was that ... as constitutional by the Supreme Court\nAnd one option that the administration now considering is doing that on the southern border um you know experts say you know under US law you have to you know if it's someone presents themselves at the border as someone seeking asylum you have to let them apply for asylum\nBy the administration does appear to be testing how far that national security has national security powers can go on and I think that's as she liked the border which clearly we've seen the president become more I'm more focused on in these last several days and weeks\nGetting a bill are our listeners may or may not know that I'm as well as reporting for\nThe star from Washington or you kind of bird dog the statements from the president from major officials are pretty much in real time in a rather extraordinary way\nI'm On Tuesday vice president Mike Pence bolstered the president's claim that there are unknown middle Easterners mixed in with Central American migrants moving toward the U. S. borders here's what the vice president had to say the\nUnited States of America intervenes and prevents them terrorists or suspected terrorists from coming into our country every day so it's just inconceivable that there would not be individuals or from the middle east as a part of this growing the Caribbean\nDaniel how accurate as the president and vice presidents remarks been in terms of characterizing what we know about that a caravan\nThey've been hugely inaccurate I mean you could teach that statement in like a logic class um you know he he you know\nBy President Pence made his statement that is arguably factual dispute based on department of homeland security statistics about people and tear walk as being prevented from entering the country and then made a completely unfounded link a leap from that to the caravan you know just because\nTen terrorists or suspected terrorists were glad to terrorists or prevented from entering the country um had no obvious connection to people are trying to walk into the country from Honduras Guatemala\nUm and so I think consistently the president at first and then joined by the vice president and others in human history I shouldn't\nHave made logical leaves and completely baseless claims about this ... that have no granting it ... in reality at all\n[noise] Jack Beatty is there nothing to the idea that that we should be concerned about the borders I mean there seems to have been as a significant rise a number of people in recent years have been seeking asylum we\nCertainly should be concerned about it but we should be concerned under the age of civil law laws which involve the right to seek asylum in the United states\nYou know what's going on here is the politics of fear of which Mr Trump is a master during the two thousand campaign he let it out is it real power is I don't want to use the word see here he's playing on fear\nA fear of the nation under attack by brown skinned people coming up from the south\nAnd reporters have talked to people as far north as Minnesota who's an interview with the times with a woman in Minnesota who said you know\nIf these people aren't stopped they're liable to come up here in Minnesota\nAnd to be going into the cabins that that uh people have a summer homes and staying there for the winter and then when the people who ... who come in the summer they'll see these these uh these migrants will be living in their cabins of course they'd have to walk a thousand miles to the border and then the Fifteen hundred miles to\nTo uh to Minnesota but this is this is what's here is the magnification of deep seated American anxieties especially among conservatives about keeping the country you know ...\nWe've got a call from El Paso Texas John is calling a John my understand if you do some work down there that's related to this\nAh yes I Do or they take my call we we work with a a little militia down here where mobilized but on the order to make sure that this caravan not make it into our country we're disgusted with what you people in the media have been doing a we're sick of your rhetoric at the president\nSo ah ... you actually to be honest you told their producers that your your uh uh trying to help [noise] well that's all right\nOh hey there's there there's a line that we're not going to happen not going to share what we do advocate has its good discourse back and forth and and uh just disagreement a in a civil way but we're not we're not gonna have people abusing each other on the air or we are going to return however to one of the comments that are that I Want to follow up with Daniel Dale of Toronto Star\nA and think about the question she hadn't flagged questions about uh statements made by the president other members ... that he'd been burned down because a lot of them weren't factual here uh uh just Wednesday a couple of days ago\nFrom the White House communications director Anthony Scaramucci went on the air uh and she called President Trump his man he advice as a liar he then went on Bloomberg TV yesterday to clarify that what he meant was that the president was an intentional liar\nHe asked the president is speaking ms truth yes the president is lying what he's doing it intentionally\nTo incite surfing people which would include left leaning journalists and most of the left leaning politicians or what is happening is they come out like a hall monitor and the elementary school or junior high school and they say oh wow the president's lying and his\nFace is basically laughing at him okay if someone's taking your lunch money in the cafeteria if you call the hall monitor it's not going to help you okay you got to defeat the person at the table with your peer group\nSued Daniel Dale ... compares a sort of fact checkers people are doing real time ah verifying of information given to the public by their leaders home monitors\nA recently also a trolley or worse old of a a buzzfeed posts a piece where he says look depressed is participating in that cycle of a\n[noise]\n\n\n[laughter]\n\n\n\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] support for on point\nComes from the listeners have W. B. U. R. Boston and your NPR station the music emporium guitar seller since Nineteen sixty eight featuring calling guitars crafted in Austin played in Boston and around the world learned more at the music emporium dot com\nAnd Geico offering auto insurance coverage for cars trucks are SUVs and promoting twenty four seven customer service and more information on auto insurance Geico dot com or one eight hundred nine four seven auto [noise]\n\nWelcome back to Folkenflik friday is this is on point I'm David Folkenflik we're discussing the week in the news you can join the conversation why wasn't making Kelly's apology enough to save her how severe are mild should the U.S response speed that Saudi Arabia is ever shifting acknowledgement of blame in the\n... killing where one hundred forty three to five five ... hundred and forty three talk you can also follow us on Twitter find us on Facebook and on point radio\nMy guests today are Daniel Dale Toronto Star sung Kim of the Washington Post and on point news analyst Jack Beatty so uh one of these stories playing out in the last couple of days are involved a Megan Kelly who on Tuesday or\nMade comments simply defending people dressing up white people I should be clear dressing up in blackface for Halloween on Wednesday making Kelly opened her NBC morning show making Kelly today with an apology for what you'd have to say\nHi Megan Kelly and I want to begin with two words I'm Sorry we may have heard that yesterday we had a discussion here about political correctness and Halloween costumes and that conversation turned or whether it has ever okay for a person of one race to dress up as another\nBlack person making their face later or a white person making errors darker to make a costume complete I defended the idea\nSaying as long as it as it was respectful and part of a Halloween costume it seemed okay well I was wrong and I am sorry\nOn my other lifetime other media correspondent for NPR News and I last night reported a ... a person with direct knowledge of the matter said that her show was gone from NBC should not be hosting the today show and that she was involved\nIn essentially exit negotiations with the network all of that has not played out yet some men Kim what do you make up the networks response to her remarks uh uh that that we just heard\nUm I think it shows that I mean their minds as firestorm of criticism after her initial comments on on the today show and I think I was watching the clock and it seemed like some of her fellow panelist wrong kind of caught off guard\nIt looks like an NBC is doing what they feel they have to do a ... I you know I don't cover the media but in the reporting that's been out there and our publication and in other news outlets um\nThe the head at NBC News and the lack held a town hall shortly thereafter those comments and said and really condemned those comments according to sources who were there and who told us another and other news outlets I think that says why the the news organization just thought they had to do at this point\nUh I Want to thank you I Know some men you have to dash and cover a few days to thank you for joining us that's the voice of sung Kim of the Washington Post thanks for having me I Want to take a couple of calls about making Chely uh we've got a call from Tampa, Florida Carl go ahead\n[noise] I um I Am as sensitive as anyone else I'm ... I'm a black ...\nI like Ike you for taking my call sir I think that um sometimes on the on the racial issues we couldn't go over the top I really don't think that there's anything that I'm like I'm telling you have to apologize I come from a society which we have a ... oh God well yeah\nI Do a little bit iffy Asian all types of any racial connotation [laughter] if you if you if you will do the rule would you go to unless you're going to be able to do not take\nThe job so ridiculous [laughter] I I'm ... I'm Wondering whether NBC I Love the ... you want you to give up on the Jews\nThank you so much for that call call call I appreciate it very much it's worth pointing out and perhaps not incidentally making Kelly's ratings were were not strong a and that her embrace by our colleagues even prior to this\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDon't get support from uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nI think I I'm not a fan of Megan Kelly I'm but you know in in hearing reports about how this all came about [noise]\nUm I think we all make mistakes\nUh especially on the air um and it's no different than a story that comes out from the news service and they have to retract story a she made a mistake she apologized or I don't think there was anything malicious about her intense\nAh so I I really don't think uh they're taking the right course of action I'm\n... I'm very much appreciate your input on that rich important here thank you so much a Jack Beatty you know obviously the question of blackface plays into a\nA you know a rich and very painful history of ah the way in which white says that not only treated blacks or over the decades and centuries but how they've detected them\nAt the same time making Kelly said she was unaware of the full scope of that history and her apology how does that the decision of NBC to essentially a park with her I said well you\nWell it's not so much how it is with me is how it fits with the American public a in a massive study called hidden tribes to study of America's polarize landscape just recently released\nA group called more in common and they they interview that fold eight thousand people they had our long interviews focus groups et cetera et cetera on the question of political correctness and bite eighty percent\nOf Americans of all stripes say it is a problem in the country a three that includes three quarters of African American it includes Seventy nine percent of young people where you tend to think political correctness\nIs rife the only group in the in the tribes of America as a divided here that thinks political correctness understood however you want to put it\nA is a good thing by a majority are eight percent of the population and these are defined as progressive activists they are very affluent they are very white\nAnd they are often highly educated but they're all by themselves and that's what he called he decided he calls them team walk\nThat's not what the what the whole American public feels they don't like political correctness on the other hand eighty two percent of Americans think hate speech is a problem so the American public doesn't like political correctness I'm not saying that this was an example of it but it will be called that\nAnd they don't like a hate speech either\nTenure bail you know it's interesting we we heard a lot about political correctness on the campaign trail back into my sixteen and it seems like it's popped up in some races maybe a quarter Stewart does underdog race in Virginia against a democratic Senator Tim Kaine how much is a\nOur racial resentments and how much is the question of political correctness of influencing some of the uh the political races you're you're tracking around the country\nI think he is having a significant impact or at least Republicans are trying to make another dignity can impact in quite a number of house race in the the course Stewart Senate race in Virginia and all these example um you know you wrap themselves on the Confederate flag almost literally Mr Stewart I'm but I think you know perhaps even more interesting is the the more subtle\nUh efforts that a Republican superPAC some candidates are trying to make in various races they are in several cases trying to tie their democratic opponents to terrorism I'm In one case a there are in in New York state they are emphasizing the fact that a Rhodes Scholar who's running for the Democrats\nUm was once a rapper who use profanity in his in his political music um and and so these I think they're quite an subtle\nAppeals to bigotry or or generously racial resentment um and it's either that they feel that this is a a compelling message to many voters or that this is their best message I'm In a in a very challenging for them\nAnd then you have built there there are also been questions of whether race informs some of the arguments we've heard about of of voting rights and voter access a during this election season a subject we've covered on this show but nonetheless one that keeps having new fresh fresh revelations every every day or so\nNinety point seven WMA ... bringing capital steps back in twenty Nineteen this hilarious show will be coming to trinity ... on Thursday February twenty seven thirty\nShow your support an assignment drive and get your tickets today [noise]\nIs it W. M. F. E. dot org\nFor Ninety point at a news comes from Orlando hell to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six patients centers more information is that to Orlando Health\nDot com you'll find more on Ninety point seven programs news stories and audio streaming find that a whole lot more at W. M. F. E. dot org this is not even seven W. M. F. ... FM Orlando Melbourne Daytona Beach\nMajor funding for on point is provided by Geico offering car insurance as well as services for homeowners and ranchers insurance through the Geico insurance agency additional information can be found at Geico dot com or one eight hundred nine four seven odd out [noise]\nWVU are Boston end NPR I'm David folks and this is on point\nEarlier this week President Trump signed me opioids legislation into law by the discussion in Washington often obscures the human toll\nIn recent days for a woman who died for opioid addiction was honored for ... by her breathing sister\nThat went viral and it inspired a police chief public plea for policies to treat ... people who are struggling [noise] not as criminals they both joined us along with ... author the book lipstick up next on point a human look at the opioid crisis in the quest for help [noise]\nFirst this news [noise]\n\nLive from NPR News in Washington I'm jak spear the Justice Department is bringing a raft of charges against a Florida Man in the case of Thirteen letter bomb sent a prominent Democrats in recent days and be our core large report she could face up to forty eight years in prison\nCaesar say oc is fifty six years old and has a long criminal record including theft battery and making a bomb threat at a press conference attorney general Jeff Sessions was asked about say ox motive\nI don't know other than a what you might uh normally expect a I'm a I'm a part of ... appears to be a partition but that would be determined by the facts of the case goes for now I'm not able to comment on that\nAll the target so far we're prominent critics of President Trump politicians would also former career intelligence officials whom the president has attacked in public speech Trump has continued to denounce violence and appealed for unity he has also resume some of his regular verbal attacks on the press and his political opponents Quil Lawrence NPR News New York\nFormer president Brock Obama took sharp aim at President Trump's tenure during a speech in Milwaukee today the trip part of a get out the vote effort for Democrats they're Obama accused drop and other Republicans of making stuff up you also said voters deserve a country where politicians seek to help and not divide the country [laughter]\nOne [laughter]\nRight [noise] that's one\nOf the country ... is one of the sharpest attacks on Trump to date by the Democratic former President Obama also blast Wisconsin Governor Scott Walker Walker is being challenged by Democrat Tony Evers\nThe cost of running for political office keeps rising and now the reports of a record smashing sixty million dollars in campaign donations and outside spending go into Montana's contentious US Senate race Democrats are hoping to hold onto a seat there in a state that has been leaning toward President Trump\nSocks and the u._s. went through another volatile day the markets opened with a dive and recovered only slightly by day then NPR's Alina Selyukh reports tech earnings cause the jitters it's\nBeen a very turbulent weak on Wall street with stocks soaring one day and plummeting the next day after the bell on friday the Dow was down more than one percent the Cindy five hundred one point seven percent and the NASDAQ more than two percent\nThe S. N. B. and the Dow have erased their gains for the year two companies in particular had prompted this sell off Amazon and Google staring company alphabet\nThe two giants had reported makes quarterly results solid profits but disappointing sales this even overshadowed strong economic data some investors are warning that the bull market may have had its run and a correction is coming you know so you NPR News\nToday the Dow closed down two hundred and Ninety six points you're listening to MPR [noise]\nFive ... all of our president and general manager of your station's viewpoint seven double MSG and this is our silence Dr\nSpin a full two years since we first tried this less intrusive style of foreign reasons and this is how we do now have you in my family solid drives are no longer the new kid on the block but a tradition we are committed to choose things as long as we raise the money needed to pay for programs you listen to Dale\nYour contribution today helps pay for public radio news programming\nThat was the pressure of commercial interests Ninety point seven W him if he is powered by you show your support now for uninterrupted public radio news and programming\nOr making a donation right now for support news that matters as interesting or from your bank account for credit card will send you a player Ninety point seven W. M. F. the customs ...\nHow about contribute thirty dollars a month\nYou will become the power behind the news you use you'll make a statement for ever you go together we have come a long way with this island style the fund raising\nMore programming and less fundraising can only sustain with your participation contributed W. M. F. he's out of work will call one eight hundred Seventy five twenty twenty and thank you\nSupport for Ninety points on the news comes from our land does that now the calendar section inside friday's Orlando Sentinel contains movie and dining reviews plus local event information for planning weekend activities throughout central Florida\nInformation about home delivery of Orlando Sentinel is available at our land do sentinel dot com slash subscribe\nSupport for NPR comes from NPR stations other contributors to include the public welfare foundation committed to advance injustice and opportunity for people in need more information at public welfare dot org and the John D and Catherine the MacArthur Foundation ed ... found a dot org\nOr listening to Ninety point seven news I'm Nicole darkening crashed and\nAnd you forecast mostly cloudy skies tonight with the lows in the middle sixties end to thirty percent chance of rain gives the way to mostly sunny but cooler weekend days on Saturday expects them scattered clowns but no rain to speak that\nAfternoon highest helping out in the upper seventies overnight lows dropping below sixty Sunday we'll see similar conditions mostly sunny and rain free afternoon hides in the upper seventies [noise] this is Ninety point seven\n[noise]\nFrom WVU are Boston end NPR I'm David Folkenflik and this is on point this week President Trump promised to wipe out the deadliest overdose epidemic in us history\nWe're going to end this gorgeous drug addiction in America we're going to end it for we're going to at least make an extremely big dent in this terrible\nIt's terrible terrible problem\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now that you've been happy family\nDon't your support all uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\n[noise] her sister's powerful and pointing obituary went viral so did the response from Vermont police chief who has dedicated himself to combating this plague\nThis hour on point a grieving sister a small city law enforcement official and a deep dive into the people affected by this crisis\nWe want you to join us as well\nAnd I have a special request this hour I'd like to hear from listeners who themselves have been affected by this addiction and this epidemic those who struggle with the use of opioids and those who struggled to help those who are addicted we'd like you to please join in\nWhere one eight hundred for two three eight to five five that twenty five hundred and forty three talk or you can participate anytime a through our website on point radio dot org or on Twitter and Facebook it on point radio\nWith us from Philadelphia, Pennsylvania is Kate O'Neill her sister Madeleine ... died October seventh she was Thirty years old and first tried Roxy continents a teenager a relationship with opiates that would dominate the rest of her life and you'll wrote in her sisters moving obituary you can find a link to it at our website on point radio dot org kid when You're welcome Don point\nHi thanks for having me\nYou know you and your tribute to your sister or Tim Allen you wrote a it's impossible to capture person an obituary and especially someone whose adult life was largely defined by drug addiction to some ... he was just a junkie when they saw her addiction they stopped seeing her and what a loss for them because Matty was hilarious and warm and fearless and resilient\nWhat made you decide a ... in your tribute to to talk so a expressly and and directly about her to her addiction itself\nYou know it honestly didn't even occur to me not to talk about that like I said it\nSupport for Ninety point seven news comes from the thirteenth manual central Florida that fast this Saturday October twenty seven I don't really into festival park this vegetarian festival we'll have food speakers cooking demonstrations live music art is the animal rescue was a kid zone over two hundred vendors\nInformation available let's see uh fetch pest dot org\nSupport for Ninety point seven news comes on the lake whales museum presenting the forty third annual ... festival this Saturday and Sunday October twenty seventh and twenty eight on the shores of lake whales disadvantage open to the public and celebrate the communities history with heritage arts historic tours and other family family events more ... city of like ... dot com\nSupport for Ninety point seven news comes from Westminster towers as senior lending community in downtown Orlando offering maintenance free living with services including dining housekeeping twenty four hours security and transportation\nThat community offers active living as well as assisted living in skilled nursing care available when needed more at Westminster towers Estelle ...\nHi this is Steve Inskeep with MORNING EDITION from NPR News takes a lot of people to bring you MORNING EDITION everyday on W. M. F. E. listeners support makes it all possible and your gifted W. M. F. E. now help to be here for you everyday\nCalled eight hundred Seventy five twenty twenty and give us generously as your cat facts\n[noise] support for on point comes from ... Boston guy kind of offering motorcycle and RV insurance more information available on motorcycle an RV insurance Geico dot com or one eight hundred nine four seven auto and exact science is offering Colin guard for average risk adults over fifty\nA noninvasive colon cancer screening test that can be used at home by prescription only\nInformation that color guard ten dot com [noise]\n\nThis is on point I'm David Folkenflik we're exploring the opioid crisis this hour by talking to people most affected by it you can join the conversation what do you find works\nMedication assisted treatment abstinence only in twelve step programs where white hundred for two three eight to five five that's when a hundred and forty three talk you can also follow us on Twitter and find us on Facebook at on point radio\nI'm Talking with Kate O'Neill who wrote a string obituary for her sister who passed away after spending more than a decade struggling with addiction and Brandon don't pose the chief of police in Burlington, Vermont a jeep composer you've called this one of the priorities of your time they're directed that way by the mayor of Burlington what steps have you taken their\nOne of the things we realized right away the mayor Nuys that we couldn't just take a policing approach and if you're wondering why chief of police got this job of addressing the opioid crisis because most\nAmerican cities um don't have a department of health right we're either relying on county government which we don't have much up in Vermont were state government to\nProvide a solution but at the end of the day it's local governments and their collaborations with hospitals and addiction services providers that have to uh come up with an answer to turn the tide is the number one source of accidental death in our society\nFor Ninety point at a news comes from Orlando how to cover their whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to their land on health dot com\nSolution that unlike crystal meth or on my crack cocaine other drugs there are medicines that interrupt the cravings and withdrawal and the urges and human body for heroin and fentanyl are the don't exist for these other drugs and they're like a cage said even orphan methadone there's a lot of stigma around um\nYou know just the the idea of medication assisted treatment but period it saves lives uh the evidence is irrefutable and otherwise I won't get us out of the spiritual Malaysia that some people say leads to drug addiction it will lower the mortality rate we could take a deep breath and we could move forward so [noise]\nAh with the mayor directed is that we do everything we can to uh get every opportunity to put people into medication assisted therapy or as of late at our needle exchange if you were to walk in to get some clean syringes and say I'm not ready for treatment but you want it to try some of the medication\nOr you'll get a prescription for it and that prescriptions written by a doctor or a doctor who lost his son to a opioid overdose um if you go to our emergency department with an overdose of sort of just being made conscious again and being\nKicked out the door hey we saved her life but you still have the problem which is what happens in nearly every emergency department in America you can get a prescription for buprenorphine\nAnd Seventy two hour appointment with an addiction psychiatrist that's a new pilot\nAnd we worked very hard in Vermont a familiar Merle Weinberger up to Governor Scott to get legislation in place that mandates medication assisted therapy for every prisoner or in our prison system who needs it\nAnd I'll say briefly that if you look at that a model in Rhode Island which made a commitment to getting getting every prisoner in his prison system who needed a the right medication the right time\nThey reduced post incarcerate of overdose deaths by sixty two percent by two thirds in fact there down in Rhode Island twelve percent as of last year an overdose deaths two thirds of that reduction two thirds of that ... percent ... percent of it is just due to what they've done in their prisons and in Vermont where we're trying all these things are and hopefully they'll turn the tide\nUm kitten O'Neill with this of helped a Matty and people like her\nI mean\nI Believe that ... than incarcerated multiple times I never received medication assisted treatment while in prison [noise]\nUm you know I think Burlington is an incredibly special place really progressive I think it could lead\nThe country in responding to this um but you know the fact that it is a law enforcement issue with the problem that it's being treated that way this is a public health issues so if if it's if it's being ... you know our jails are the biggest opportunities for rehabilitation in this country right now\nAnd we need to act on that but it needs to we need to step back as a public health issue and from our again is doing a great job and I think a lot of these measures would have been helpful\nTreatment is still a huge issue in a lot of rural states you know where this this epidemic is occurring you know you have to drive hours to get there but if you don't have a car you know um and then the programs are Twenty one day twenty eight day off an abstinence space programs you know so there's a lot of issues than I Do think that [noise]\nBurlington and you know on keep that pose a will be leading this and I appreciate that but I'm more needs to be done\nI just want to be clear when you talk about absent space which is another way of describing some of things like twelve step you're saying that's not actually always helpful folks right I mean 'cause in popular culture for people who don't struggled addiction they may think well that that's going to get them on a good path or it's it's it's easily enough done\nYeah I think you know I'm Brandon just referred to this is a lot of stigma around medication assisted treatment and my family but not he was first starting to get clean had the idea well if you're taking methadone or if you're taking the pronouncing land you're not really clean clean you're not so far right\nWhich is just you know there's so much evidence that show that these treatments are the most effective way to treat\nThis disease and sell denying people access are making it difficult for them to have access to it\nYou know I'm I think you know if you\nIf you have an issue where you have diabetes we don't say people you know like you can't have this drought that would help you get better and we make it difficult for people to get this drug on that would make them get better and there's stigma around that within the recovery community which I think it's hard to\nBelieve that like if you please please go ahead please no I I I think it's important to even be more categorical about what Kate is saying if we stick to an abstinence based plan to help our way out of there will be a crisis we are headed\nFor unmitigated disaster um if somebody is is hell bent on being obstinate were behind them every step of the way clinically if you look at that public health research in the medical research abstinence fails well over Ninety percent of the time as an intervention\nIt's the medicines that we have available to us that reduced uh the these bad outcomes I have a friend of my old town in the Hudson Valley who I did not know for years was a a recovering heroin addict I used to play with his kids we used to go to social events together and when I started doing this line of work you said Brandon\nI've been on buprenorphine for a decade now\nAnd it's the only reason why I'm healthy and alive and that's not I know that's an anecdote but um\nIf you just look at the success rates if anybody's spent a few minutes looking at the success rates for abstinence versus the success rates for medicine when it comes to addiction there's no question an abstinence as a population level interventions reduced mortality\nIs a losing proposition and we need to make these medicines available and we need to overcome the stigma that surrounds taking medicine to\nWrite yourself because we don't have that stigma when we recovered from HIV we'd give someone the AIDS cocktail we don't have that stigma as Kate said when somebody has to take diabetes medicine for the rest of their life\nYou know we've been getting fasting and stronger response from listeners or as as the show's been going on one poll Norton says addictions like a cancer when does not choose to have either he posted on our website or she's on her Facebook page\nAnd an wrote addiction is a lifelong bite of a disease that fewer specter relies can't be cured by jailer combination only love respect understanding and radical forgiveness and patients can cure it or another comment to our website a one or the name near as nine wrote I've had a cute chronic pain for over ten years opioids have kept me alive\nThey're the only reason I haven't killed myself do the endless horrible pain these drugs keep it at least at the level where I can read watch TV et cetera and get some website I tried so many non drug treatments and non opioid drugs\nYou're listening to Ninety point seven news I'm Nicole dark and crashed and and you forecast mostly ... night with all those in the middle sixties end to thirty percent chance of rain gives way to mostly sunny but cooler weekend days\nOn Saturday expects them scattered clowns but no rain to speak up after meeting heights tapping out in the upper seventies overnight lows dropping below sixty Sunday we'll see similar conditions mostly sunny and rain free afternoon hides in the upper seventies dishes navy point seven\nSupport for Ninety planes have the news comes from a window rather central Florida ... lake orange in Osceola county since Nineteen Ninety five providing energy efficient double inflated vinyl windows inciting doors and hurricane protection in home is mentioned custom measurements available more including financing information design ideas and energy savings calculator window elderly into dot com\n[noise]\n[noise]\n\n\n\n\n[noise] support for on point comes from guy go offering car insurance as well as services for homeowners and writers insurance through the guy go insurance agency\nAdditional information can be found a guy go dot com or one eight hundred nine four seven auto ... working to make higher education more affordable with the same page on limited subscription students can access over twenty two thousand each textbooks online homework access codes\nAnd study guy is engaging limited C. E. N. G. A. G. E. dot com [noise]\n\nThis is on point I'm NPR media correspondent David Folkenflik\nWe're looking at the human cost of the opioid epidemic that's devastated our country you can join the conversation who do you think is responsible for this devastating drug crisis big pharma law enforcement drugs pouring in from overseas or wanting to hundred and four to three eight to five five ... hundred forty three talk\nYou can also follow us on Twitter and find us on Facebook at on point radio\nI'm Talking with Burlington, Vermont police chief Brandon do ... and ... she's the author and journalist whose latest book is titled dope sick dealers doctors and the drug company that addicted America I Want to start with a couple of calls they're kind of flooding in\nAnd like to take a call first from ... to a calling in from ... South Carolina thanks for joining us\nHi thank you for taking my call\nUh-huh I wanted to hear a little bit I'm Sorry\nI just want to hear what your thoughts were about all this\nWell I'm I'm a recovering addict and I think an addict ever is here because I think for men were hard wired differently than normal people you know our one Tylenol may be good for somebody at five would be great for me um I went from\nI hated thank medicine until I had 'em all surgery and they gave me ... all of a sudden I wasn't allowed I thought this was happening I kidney stand there and they gave me I think drugs um and and that was that was like God have in our\nYou know and then they turn ... loose back out into the prescription and then I said you know and then you're you're out there on your eye on what your body aiming for more of what you can't yet and you'll do just about anything you can to get what you need\nMhm thank you for that change that we've also call from Boston, Massachusetts\nTom you're on the air go ahead\nBarry how you're doing okay I think that if you believe a cheap from\nVermont is right on but I I I got to tell you if the drug companies are providing the medicated assisted medication or pushing that drug is hot as\nPurdue chemicals pushed the uh actually caught and we wouldn't have a problem and because the medication is effect of I I'm a recovering addict and I'm also a treatment provider and I've been doing it for twenty eight years\nAnd I've never seen anything like what a few over the last\nYou know the the uh pharmaceuticals were bad enough but now that they're pulling back from the pharmaceutical ... no there's a a flooded throughout the addiction to heroin belt in Massachusetts anyway and so what I'm seeing I'm seeing people\nThat have stabilized on a I'm not a medication and then what happens is they are off and then they relapse die because there's no just plain relapses anymore it's just a\nGreat big shot up front and all of a they get the uh the uh her thirties that are that are really a crushed fact you know and they got a couple of them and they guy now my history I was incarcerated because of my opiates or the conduct\nAnd uh I relapsed that day I got up has that been read today I'd be dead\nBecause I'm so twenty percent of the population that are regularly proven that have a addictive um or heroin or histories died within the first ah two weeks\nTalking with Tom let me let me let the folks here here weigh in on this but thank you for ...\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr and this is how we do it now that you've been happy family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nAn active part of the solution constructively engaging to find ways to remedy this and not a currently part of the problem or how does that fit in with your reporting on this\n[noise] well um\nIt sits in in that um you know they've just uh have plans to create a new buprenorphine product which is great but if they really wanted to make\nA difference in America they could do as chief do posed a and others and some of the states that are finally starting to push back their overdose death rates by a very little bit\nAnd make it widely available one of the things I wanted to point out by what about the cheap and what's happening in Vermont is that's really unusual I mean my hat is just off to him\nBut in a state where are we were very slow to pass Medicaid we just passed it in Virginia became the thirty third recently I mean we have we have already\nTalking forget that you're talking about Medicaid expansion right\nYeah I'm Sorry yeah Medicaid expansion I mean we have waiting lists that range from three weeks to two years to get into MIT program we have no funneling from our ERs into MIT programs\nI'm In my city in Roanoke, Virginia we have a police chief that's come out against syringe exchange there's nowhere for somebody to go\nWe don't have any treatment in our jails\nAnd um you know it it shouldn't be geographic it shouldn't be the luck of where you live uh whether you get this lifesaving\nTreatment or not but we we have a listener who wrote on line she wrote I Believe the opioid crisis reflection of American culture to disease of despair our culture is money driven their lack of opportunities for the majority of Americans in your book it seems to me that one of the themes that comes out is sort of the\nConstriction of opportunities for Americans particularly in the rust belt in Appalachia\nA you know stretching from the you know the American\nSouth east up to the northeast a ... in industries where they could rely on steady jobs exactly\nAnd that's where you know the crisis first erupted in these distress rural communities where the jobs were closing at the same time this pain is a vet idle sign was being\nPushed that will what we really need our policies to address the root causes which are mental health issues and so go socio economic despair I mean there's a kid in my book who's interviewed a or one of his teachers asked him in middle school when you want to be when he grows when you grow up\nAnd he says I Want to be a draw or she goes oh you want to be an artist and he goes no I Want to be a drawer and want to draw Social Security disability because that was the only thing he can imagine 'cause that's what he saw\nAround him in Lee county which I write about in the book uh it's hard it's hard to central ... opioids were prescribed three hundred six hundred percent that the ... of the national average and there are fifty seven percent of men who are working age there who are unemployed\nRecently the president has talked about the mobilization of the federal government to address the crisis on Tuesday health and Human Services secretary Alex is are said to us is starting to turn the corner on this epidemic or she cited figure showing a to point eight percent dip in over deaths from September twenty seventeenth of march twenty Eighteen according\nTo provisional data from the CDC the seemingly ... trend of rising overdose deaths seems to finally be benefiting in the right direction\nPlug telling it such a high level is hardly an opportunity to declare victory but the concerted efforts of communities across America are beginning to turn the tide\n... you know the number of Americans dying from a ... a related deaths appears to be a just under the number of Americans in total who died in the Vietnam War but ... is the secretary right are we turning the corner of it on this", "year": "2018", "show_name": "On Point (NPR)", "city": "Orlando", "day": "27"}