{"month": "10", "state": "TX", "station": "KTDH", "content": "[noise] a\nShot at the moment dream job\nGrade and then when you maintain where we can\nYou you're\nNot doing anything to do\n[noise]\n[noise]\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well and\nSome American jazz radio\nJohn John barely dollars ...\nJobs the jobs\nWelcome to an archive edition of twelfth street jumping Public Radio's we jazz blues and comedy jam on your host Pete Weber and this week we take you back to an evening last year when we celebrate the birthday of Latin percussionist ponchos match up with our special guest Gary Hill\nGary played so what's your question and we remember my mom was giving everyone there lecturing day bloom\nIt'll have been looks our on twelfth street jump\nPlease well for twelve children most\nAh [noise]\nEbony where again I Know that leaves outside are changing colors the Adams and folks are deciding\nOh [noise] Evan anywhere here again I Know that\nLeaves outside are changing colors the other knee and folks are deciding which way they're going to booked a are yeah I mean well let's just have fun tonight I agree\nSo this week on TALK down we're celebrating the birthday of Latin jazz percussionist poncho stench it so that special guest Mr Gary now\nYou know we're going to touch Gary knowledge of ponchos music and find out what giving all of us in the election\nDay blues but first ebony did you hear that two major donors to Donald Trump's campaign have asked the candidates for something\n... admission to the witness protection program [noise] no\nOh well I guess the IRS isn't the only one he stepped\n[laughter] speaking of stiff did you hear what contestants in the midst team usa pageant claim that Trump did during their show a handed out free samples of tic tac\nNo no he walked into their dressing room while they were changing their clothes\nYeah apparently the Donald main qualification for running the pageant was watching reruns of course you know\n[laughter] well there's nothing inappropriate about this show like let's get the music started with an eddy Harris to that John Cho Sanjay record cold that time\n\n[noise]\n\nNo\nMe\n\n\nDa da da\nDa da da da da ding ... the ... century the youngest of eleven children live shows was born in Laredo, Texas and he grew up in Southern California it was influenced by two very different styles of music\nRide Gary you're good at that let's try another one about the blues for fifty logo\nDo blah blah blah blah blah blah blah [laughter] All right the answer is I live in Hollywood so\nWhat your question\nEasy what's the most recent album released by poncho Sanchez oh what's\nAnother wrong answer the answer is live in Hollywood the question is where can you find most of Hillary's donors [noise]\nOh you know what that sound mean don't you as daily double time now and you have a few seconds scary to complete the titles of these poncho Sanchez song titles that were rejected as Donald Trump campaign slogan\nAre you ready ready All right I remember nothing I said\nOkay it's a wine and\nRaise your\nMy next wife to\nThe judges oh\nSome clothes scary that's all the time we have\nThat's all the time we are over\nWas less than\nLot of jobs don't go anywhere there's more to go right here on twelve [noise]\n\nHello I'm rebelling Lynch underwriting sales rep for high plains public radio I'm proud to say that high plains public radio it's an exclusive National Public radio affiliates and one of the largest NPR station in the United states\nBased upon the size that broadcast Syria CPR is close to achieving our eighty five thousand dollar operating go for twenty Nineteen each contribution to your community public radio station does matter at H. P. P. R. dot org [noise]\nPrime bureau here this week on talking to ... we were going to get back into the straight ahead punk rock bands like flat liners bred to be radio measures will join your Saturday Night at midnight special right here on HBO [noise]\n[noise]\n[laughter]\n[noise] [noise] where ...\nLive on Trump to jump on the radio the weekly jazz blues in comedy jam\nNope besides poncho suture celebrate the birthday this week\nA judge spoke with Diane ... born in Detroit and raised in Denver we came from a musical family or uncle was racist Charles borough because it is just beyond his George Duke\nPerforming with our high school band in Chicago Diane was noted by trumpeter quirk Terry who hired her to sing with his ensemble\nAfter a year in college Reeves moved to LA where she's staying with family ... Lenny White\nWith more than forty albums as a special get or headliner to her credit and\nDianne Reeves practically owns the Grammy Award for best jak booklets female having won the title five time Juilliard awarded reads an honorary doctorate and music and her two thousand Fifteen album beautiful live without it at that album at the jazz as him award\nNo here's urban interesting a clear Fisher tune that Dianne Reeves recorded\nJoe Sanchez on which ones gold morning\nLoaning\nBring the day\nAnd they only memory\nThat sell those little so\nWhat do we call you\nOlder you\nKnow I was born in\nThe last long\nThat the other gun wielding only a\nWho the hell they want a longer than\nOne long knees\nA day please don't be set up a good thing though\nThe day he\nSaid oh they love the snow\nAnd all the Long Island\nAlthough they\nDe\nDe\nDa de ...\nThose are the well mental really\nTo\nStill recall you\nKnow anything on the\nWas and they\nOn the little girl oh\nThen you've\nGone through a little\nNew days only loans mom has been a ... I still listen\nTo them again Rene diligently\nSit up on the game\nA lot of money a\nOf money or they may\nWith us Don Young son of\nOr a\nYeah na\nThere to that was good she\nNot enough\nMhm\n[noise]\nAnd now that the public service and don't see jumping around above today's top headline if you think you had a bad week how 'bout these believes in the news\nWell that goes through disgusted with\nAnd its reputation in God's scar\nThe made millions\nWinner those drugs to withdraw their money I Hope the ACLU eat his car\nIt comes to NFL gear\nThey're sold the fans don't want to pitch\nTo the keys to Christmas Jeff problems that key reason says writing if the car sounds like that\nI Do on it [laughter] I\nDon't know what the other you go [noise] you know you go nowhere with that [laughter] you know\nBesides poncho Sanchez and Dianne Reeves we celebrate the birthday of Trump or any Henderson happy birthday to vote Andy bay and another great Latin jazz\nArtists Chico Will Ferrell as George Wellington as a birthday alone with jazz legends Clifford Brown ensue Sam's happy birthday to three more sex players are\nBorn marsh Charlie Bartlett and Jimmy Little bird each\nOther of basis Percy\nAnd it's a birthday week of trumpet player Neal hefty range charts for Herman and count basically it as a composer gave the Batman TV series a little swinging smoke it all happened this week in jazz [noise]\nAnd don't forget to peace [noise]\nHave you so\nAnd smile lack crazy man\nDo you drive [noise] yoga we'll go\nRight here on twelfth street [noise]\n\nI'm John ... I'm yet to come Alaska and we are your host radio deluxe this week couple of years composers singing their own so wow\nSarah Vaughan Carmen McCray steel McLaurin ...\nKatherine Russell and we really have to really settled in the record the killer and all the while\nEating ...\nMade my what a challenge I jump it's really you are just enormous joined it will be more radio deluxe Saturday morning at one central high plains\nPublic radio is excited to announce the launch of the H. P. P. R. wind club\nWhere you can indulge in tasty lie patients and support a service you love joined us this Friday October twenty six at the H. P. P. R. studio in Garden City just simple tasty wine plus we'll be celebrating the one year anniversary of little ... from the prairie Valerie brown ... will be in house with live readings plus performances by Ron Raul than\nValerie Smith learn more at H. P. P. R. dot org [noise]\nSucceed Public Radio's weekly dad blues and comedy jam [noise]\n\nFish John and John\nGuys just\nThe joy always jumping at a jazz club near you in Phoenix stopped by the national or the rhythm Indianapolis listeners can see what's cooking at the jazz kitchen\nIn Austin, Texas elephant room at the place to be\nIn Portland, Oregon music can be found at the banquet society ball\nCorners loan genetic code a jazz club or the spot in Minneapolis and the brotherly love is found in the south of jazz parlor in Philadelphia I have a drink\nPrisoners loan genetic code a jazz club or the spot in Minneapolis and the brotherly love it's time to stop the jazz parlor Philadelphia have a drink kick back and let the music wash over us at the candlelight wound in Trenton New Jersey or if you're closer to Madison try Shanghai jak\nEvery week in Tucson and brother John chopping and right here in Kansas City come down to the green waiting lounge or stop by the blue\nOr wherever you are get out of the support your local jazz and blues see that's what always jump\n\nHere's a gene pool to\nA poncho Sanchez recorded on freedom of sound album this one's called you don't know what\n\n[noise]\n\n\n\n\n\nFamily", "show_name": "12th Street Jump", "year": "2018", "city": "Dalhart", "day": "27"}