{"month": "10", "state": "TX", "station": "KTDH", "content": "Anything [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] ah\nFrom being shot at the moment you know draw\nThen when you're in where we came to the\nYour your um\nI'm not saying that [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\nThis is Ninety One point five eighty ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. PBR at H. P. P. R. dot org\n...\nSome American Jen ...\nJohn John ...\nThe jobs the jobs\nWelcome to an archive edition of twelfth street Joe Public Radio's weekly jazz blues and comedy Jay I'm your host Webber and this week we take you back to two thousand you celebrate our hometown Kansas City jazz and blues heritage there special guests can\nWe find out what gives Kelly the blues and all that great old ...\nJohn John ...\nThe jobs the jobs\nThe welcome to an archive edition of twelfth street Joe Public Radio's weekly jazz blues and comedy Jay I'm your host Webber and this week we take you back in two thousand fourteen celebrate our hometown Kansas City jazz and blues heritage there special guests can\nWe find out what give Keli the blues and all that great old lever stolen to go with the Kansas City and that all happened this hour about twelve and ... [noise]\nLosing comedy it's good to have you with us\nYes it is and David Wright tonight we celebrate the music of blue gray Kelly was that special get Kelly I Am\nWhat gives Kelly the blues and learn some new versus tour towns favorite song but first ebony did you hear about that Ohio State football coach who tackled the fan running on the field during the game\nYes I did the right after that they offered him the job of Secret Service director\nAnd apparently President Obama says he's still feel safe in the White House of course you can always hiding place no one can find them oh you mean next to his birth certificate [noise]\nOur I listen to some cats who don't let anybody in the front door unless they have some\nBeer here's David basking in the twelfth street jumped band with a tune that Frank Sinatra recorded with Kansas city's own Count Basie I've got you under my skin\nMhm\nOn the bus skin\nSo there's ...\nYou read the law to be\nTried so\nDo given\nTo myself this is a rare\nUse them then you can win\nYou lose your comedy you\nDo reality\nLive and where\nYou use your medical drama the\nDo reality\nGood or bad you know\n[noise]\n\nNow [noise]\n\nCan weigh in\n'cause I got you\nOn the months [noise] [noise]\nI got you\nA ski\nKind of way of looking\n'cause I got news\nOf the ... [noise] [noise]\nAre you\nAll the buzz ski\n[noise]\nIt is a blues singer killing hundreds\nBorn right here in Studio city kill me ... all the rhythms of Kansas\n... everybody wants to get us started with the Kelly on flu\nMine Kansas City and I love the home town do you ever\nShe realized she was a new\nIs a man\nAnd he isn't laying the at\nSuper power of\nGermany be so ...\n...\nMay pay about\n... a little run down you've a\nWith De Niro and mainly to\nJay Jay but that doesn't matter\nGame of ... ...\nVisited ... gives him a blue\nSo she thinks about a picture\nHaving out into the to\nDebate I Want to have\nWith their feet you lose power you wedding she\nThat someday\nAre saying hey there isn't\nNo matter if you are a self proclaimed Newtown or just an interested party this is definitely an interesting mid term election cycle issues candidates the political arena is buzzing you hear about the issues and the candidates right here on H. B. PR ... your\nFinancial contribution right near keeps it coming to you it's quick and easy to get online and H. P. P. R. dot org\n[noise] Mm Mm\nNo matter if you were a self proclaimed Newtown or just an interested party this is definitely an interesting mid term election cycle issues candidates the political arena is causing you hear about the issues and the candidates right here on H. B. PR ... your\nFinancial contribution right now it keeps it coming to you it's quick and easy to get online and H. P. P. R. dot org [noise]\nMm Mm\n[noise] hey Brian bureau here hoped to bunk and the daughter Leon high plains public radio this weekend I'm putting together a special episode patch with punk rock ...\nWe'll hear from pairs the vandals whereby ever know affects lots more so come hang out with me the Saturday Night at midnight central right here on H. P. P. all\nThe\n\n\n\nWay back live on five something like radios weekly jak losing comedy jam\nThe whole you know about Kansas City jak probably do the story worldwide popularity or\nOur biggest musical heroes being isn't bandleader William basing\nBorn in red bank of New Jersey the count grow up in Harlem sound and the piano lessons his mother David\nToying with an all male hack painted in Kansas City in Nineteen twenty\nBill they liked the rough and tumble down here\nSo he's stuck around and made a living playing Oregon movie theater in Nineteen twenty nine he landed a gig playing piano with Damian\nWhen many died during a routine path of lightening Baker was elected to take over and the Count Basie man what's going\nTo the story goes that record producer John Hammond within Chicago listening to the radio when he heard the beep you ban live from the rental club on a show just like this one girl to Kansas City signed it took them I knew you were born the child's career exploded\nWe're going to celebrate the ... the mammoth saw Joe Williams\nMatt dab in the middle\n\nGet any color\nThey say we\nDo they do not\nSpeak to the gym\nJim Cadillac\nJim Snootzie blowback or\nI'm just a Q\nA chat room\nAs a barbecue\nChicken NATO boost wanted to\nMe mad man\nJim ...\nJust do the number\nOf drastic Q\nA chat room how\nSome barbecue\nChicken now what will just wanted to do\nMe mad man\nCourse grew\nDown the street the\nA wagon low number\n\nAttending the boulevard\nTo watch it down\n\nSpecial guest James\nSpecial guest strange a tribal\nAll the trucks go to ... to ...\nNow from base either Kelly let's keep the Kansas City music rolling here's Joey hooked singer own composition when well is that the wheel\n\nAll the time during then and then I wrote them down or hard dance dry modern day all night out in ... and then the dog can age\nIn a nice Ronald Ross Kelly on our special guest [noise] what are the hardest workers are women in show business are\nBeautiful new album the beautiful bowls available on just about everywhere the Kelly have been doing this for quite awhile last week or two uh what do we do and you write down the line between jazz and blues I Love that that's a beautiful thing well you know what I heard growing up my mind I\nThink I mean somebody blues I mean you're considered boosting or by so many people but if you come to get to see you got to have your jazz tops together to well you know there's so many great musicians in Kansas City in great jazz singers already I mean look at this stage like laying on\nGuys are ... and ...\nYou know under cavity and I'm I'm happy to be a working musician I then went all\nMy life as we think well it is an honor to have you with the territory street jump and uh have you on\nThe stage give her a really great ground the\nAnd wherever you purchase music or wherever you purchase music get her music and check\nIt out check out a song about gravity gravity loves you\nThat's known that don't kill that is such a great go thank you that's a great show and then there's just so many I'd ask you a thousand questions if I go up\nAnd I'm not going to ask you right now those people would get mad at me and I don't like it would be mad at me no no he's already mad because he'd been outside for three days\nSo and he has and he also go ahead be\nCelebrating the birthday this week how 'bout Eddie Harris leak Conan rose Sanders rate a understand cozy coal bill Stewart Terry gives Howard all the Barney castle ... brown\nNATO day Bobby ... really\nWho play the Eighteenth and bond jazz festival right here in Kansas City and how about when the lore salad\nYou all have a lot of fun I Hope it's as much fun as it is for us to be a part of it is it is for you to listen don't go anywhere who\nAre small coming up right here on swelled in St Joe\n\nBrian bureau here hosted bunk and the daughter Leon high plains public radio this weekend I'm putting together a special episode packed with punk rock great [noise]\nWe're right here in Kansas City and how about when Marsalis\nY'all having a lot of fun I Hope it's as much fun as it is for us to be a part of it is it is for you to listen don't go anywhere who\nWar coming up right arrows welders rate jumped over\n[noise]\nHey Brian bureau here hosted bunk and disorderly on high plains public radio this weekend\nI'm putting together a special episode packed with punk rock ...\nWe'll hear from pairs the vandals revive or no effect and a lot more\nSo come hang out with me the Saturday Night at midnight central right here on H. P. P. O. M. A. yeah\n\n\nHi I'm Valerie Smith development director for high plains public radio I have the direct benefit of working went on the line with H. P. P. R. members hand under writers in my opinion public radio attracts the cream of the\nPeople who support public radio or lifelong learners who think globally and act locally they concerned themselves with news that matters and music that's meaningful gain knowledge grow community gift today at H. P. P. R. dot org\n[noise] that [noise] you know we really think comedy jam\nJohn and John Ben Ben\nGood shape guy Johnny jokes\nThe joy always jumping at a jazz club near you in Phoenix stopped by the national or the rhythm real Indianapolis listeners community was talking at the jazz kitchen\nIn Texas the elephant grooming place three I'm In Portland, Oregon the music can be found at the secret society ballroom runners alone genetic code agenda lumber the spot in Minneapolis and the brotherly love found the love of jazz parlor in Philadelphia\nAnd have a drink kick back and let the wash over you at the candlelight wound you know ... or in your culture to Madison Shanghai jazz\nEvery week in Tucson or other John de ... right here in Kansas City come down to the green waiting lounge were stopped by the blue\nYoung support your local jazz and blues and that's where I always joke\n\nHe's the banner that song from the Count Basie orchestra circa Nineteen thirty seven top the\n[noise]\n\n\n[noise]\n\n[noise]\n", "year": "2018", "show_name": "12th Street Jump", "city": "Dalhart", "day": "13"}