{"month": "10", "state": "TX", "station": "KTDH", "content": "Dang thing I\nFrom being shot feeding on dreams and all\nOne in ten days when you're making\nYou're you're\nDoing anything that [noise]\nDo you want\nTo bring\nDown and [noise] [noise] [noise]\n[noise]\nThis is Ninety One point five eighty ... eighty nine point three ... heart Ninety One point seven KGAN Hayes service the high plains public radio\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details\nFrom American Jen drinking and\nJohn John ...\nThe jobs the jobs\nWelcome to an archive additional twelfth street Joan Public Radio's weekly jazz blues in comedy Jay I'm your host whether we would take you back in two thousand Fifteen I celebrate the birthday of jazz legit alone is smoke\nEbony has some political advice for Ted Cruz a little recording and the therapist helps the Connecticut couple couple for\nCarly Fiorina remember her at all have in this hour on twelfth street jung\nWays welcome or Charleston Chuck pose\nA ... year winter ... such great introduction there but thank you\nUm such such the winter in my bag searched introduction thank you for that so it's a\nTime of year when the when the leaves start changing color and then it will start to complain about how cold it is yeah but this week is a good week for us\nIs a great week are celebrating the music of jazz legend that Loni is marked with a special guest Nick role and he's going to be on saxophone\nThat's right you know Hillary writes in for some campaigning advice and the facts therapist is going to help a couple with fears of fury me\nBut first ebony did you hear the waffle house announcement that has you know and now that they serve their one billion waffle oh was it on the house but probably you know of course the unofficial waffle total there's a lot higher because most people who are there are too drunk to remember\nThinking of hire him farm in Oregon law a thousand plant when deer got the real thin and ate them\nYou know that sounds like the work of Rudolph the red\nRain well the hip didn't harm the deer but they did get take four hours later after eating a thousand packages of Oreos which\nYou know let's get right into the music here's David Mann dissing among tune with lyrics by Sally switch or this is straight no chaser\nWell among said history it's not a time you can wait you got to be all got to be strong job\nWill dress job I don't do it\nDo we know when you're out of the Gulf War because some of them but he was the place where I live there is no way to get this straight\nAmong cat aware of the ... out of the day I had it is not in the same ...\nWas on ... why\nDo you do the ends of the time to dance but you can back up to ... which I always\nTo God or didn't do that do do greeting\nBow to wear the red and\nMud room where they need the job\nThe bed at it and do better to do that and do it\nThe drove through grants to do do do do do where\nOf global though we\nDid it and they didn't they didn't they didn't they didn't do anything to do it they said they\n[noise]\n\n...\n\nOh\nOh oh\nOh\n\nOh ... it's not the same way\nThat we got the ...\nYeah\nUser fees will be it happens but it was no one\n...\nWay ahead of his time it's not the same\nShe was a common\n\n[noise] are you David [noise]\nNow this week\nSt jumped to celebrate the birthday of one of the giants of American\nMusic baloney is among\nBorn in North Carolina named after his father yeah that's right there were two Vilonia is amongst you moved to New York city with his mother and two younger siblings to the midtown Manhattan neighborhood he'd call home an entire life\nIn the early Nineteen forties now my lender the gate with the house band it meant a famous club in Harlem where he met Charlie Parker dizzy Gillespie and Miles Davis together the musicians were at the forefront of the birth of be bought and modern jazz [noise]\nAlthough monks so that people didn't understand as music at times and he had a long period of near poverty you wrote and recorded many jazz standards amongst dream ruby my dear straight no chaser and of course the classic around midnight or just some of his greatest tests\nOne of only five jazz musicians ever featured on the cover of time magazine ... was truly an American original\nWere going to spend the next hour playing some of the tunes that ... made famous and to help us get that done we're going to enlist the help of an old friend tells the gentleman that player Nick Roland\nWelcome back to the twelfth street Nick ... feet where you've been man just around\nWhat the ending and you're from Kansas City right I Am just so I actually grew up in a way to Kansas oh boy oh boy now monk was a piano player\nAmongst other things but you you're a sax player why do we get you to come in for this show man\nOh heck no\nYou know monk or his quartets are very important is protests were a\nYou know I went to Donald Trump's wedding but now he ignores me just like his wedding vows [noise]\nBernie Sanders gets all the press even though I have had bad hair and bad suits for years [noise]\nYou know I Need some attention so I can win and twenty sixteen what should I Do have\nAny politicians I tell you this lady there you know I think I can yeah\nI don't like you your campaign makes them not only now another woman's on the move and they talk about it carling\nLearned that lesson to get out of this let's\nOn all the late night shows and show me that blue dress\nUp but have you made Donald had a very very commonly known based it'll break a bunny yeah but I mean even Joe Biden will rule the shame\nAway from McDonalds please\nRenee is very common running to\nRunning on a cell phone yourself healthy\nNow but that didn't hurt that it\nWas all you've got problems ebony explainer songs\nCannot afford an hour of your help it depends on what's wrong with you I don't know where to START I don't know if you don't have that problem there wherever there's more to go and writer of wealth\nOf your hopes that depends on what's wrong with you I don't know where to START I don't know if your letter brown [laughter] wherever there's more to go ... through the joke [noise]\n\n\nOctober is a crucial month for high plains public radio as it marks the beginning of a new fiscal year the phone membership campaign which also falls in the month of October\nIs an opportunity for listeners across the high plains to work together to keep the service in our region from regional new treatments around the globe public radio keeps you up to date with media that matters\nGain knowledge grow community give today at H. P. P. R. dot org\n[noise] are you tired of hearing the same music over and over again I Want something a little more maybe something with an update some interest in the ... we don't hardly public radio ... she first image image Demi Moore\nI'm Brian bureau joined me the Saturday Night at midnight special right here on HBO ...\n[noise]\n[noise] we're back live on ... street jumps Public Radio's weekly jazz blues in comedy jam\nKnow in addition to the Lonnie among we celebrate the birthday this week of granny wedding saxophonist Kenny Garrett a product of the Detroit dad main Kenny gained fame early in his career\nAs a member of the Duke Ellington orchestra and Miles Davis is banned his two thousand twelve Mac avenue released pushing the world the way it received a Grammy nomination the same year he won his first down be breeders poll upbeat he'd repeat in two thousand Thirteen\nJared Jared has been honored with an honorary doctorate music from the Berklee College\nOf music and receive Soul Train award nomination for his album speech from the underground which or to or Grammy nomination you receive the coveted N. double ACP image award and it was voted saxophonist of the year as a Canadian echo award [noise]\nKenny Garrett recorded the Brubeck tune on his album reality here Nick rolling with in your own sleep way\n\n\n\n[noise]\n\n\n\n\n\nThat stuff and\nNot\nDa\nDa da\n\nDa\n\n\n\n\n\nDa\n\n\n\n\n\n\nMm Mm\n\n\n\n\nWe are the drama I think about you and I teach our drones might be your chest I you're a drum we and we moved to\nOurselves hey hey hey now really hey\nI'll keep it from there we on the birthdays to talk about here\nNow from a side so alone is mark\nAnd we celebrate birthdays this week a pianist composer Mose Alison Bass player ray brown\nBecause so many of those tracks with pianist Oscar Peterson drummers had black well and Billy Higgins celebrate birthdays this week alone with Art Blakey founder of the Jazz Messengers on a lifelong friend amongst and it's the first week of Trump literacy so breed Bridgewater rather and Harry sweets that isn't\nBeing as junior Manson multi instrumentalist\nYousef motif and we pay tribute this week to a great base where Jimmy Blanton born this week back in Nineteen Eighteen now to learn more about our show all these cats in upcoming episode go to twelfth street jump dot com you'll find all kinds of cool stuff and we'll be sure to keep you updated\nWhat's happening on the jazz scene\nAt twelve St Pete and you know that's my Twitter handle David ... you know\nLet's go get [laughter] I'll read you\nCalled me a loser the top of this so I go on with you [noise] oh no no you all stick around don't go anywhere we'll be right back with more twelfth street so [noise]\n\nI'm jumping around and just thinking the last time we are your hopes Iranian we're empty nesters so yeah we've been talking about that for years yeah like you know we've got a beautiful song by Coleman is weak and you're a CD by battling for real Tierney sudden Katie ... and ...\nAnd we'll hear from your regulars John ... so income lots of great music to be heard joined us won't you for radio shack song\nSaturday morning at one central\nIt's easy to keep up with the headlines but understanding the issues behind them it's tougher that's why you listen to H. P. P. R. we bring you the headlines but even more importantly we bring you the insights and background on the stories of the day\nYou depend on H. B. PR for coverage that has depth and intelligent we depend on you for the funding we need to keep it going\nGain knowledge grow community give today at H. P. P. R. dot org [noise]\nWelcome back to the general Public Radio's weekly dad losing comedy jam [noise]\nThere's John and John ...\nCan adjust\nThe joints always jumping at a jazz club near you in Phoenix stopped by the national or the rhythm rhythm\nIndianapolis listeners can see what's cooking at the jazz kitchen\nIn Austin, Texas the elephant room in a place three I'm\nIn Portland, Oregon the music can be found at the secret society ballroom critters alone genetic code a jazz club or the spots in Minneapolis and the brotherly love is found some jazz parlor in Philadelphia [noise] have a drink\nThe judge a club or the spots in Minneapolis and the brotherly love is found loved jazz parlor in Philadelphia\nTo drink and kick back and let the music wash over you at the candlelight why would you know ... or a or closer to Madison try Shanghai jazz every week to shock that other jarred right here in Kansas City come down to the green lady lout washed out by the blue\nWherever you are get on the porch of what the Jet Blue sea that's worth always jumped\n\nAlright heres Tyrone clerk on the base to Nick rolling on tenor sax with the ... classic round midnight\n\n\nL\nO L O O L\nL L\nL L L\nL\nOf a\nBall ball ball ball ball ball role model for ...\nFor all the\n\nMm Mm Mm\nMm\nMm\nMm Mm\nOh oh\nOh oh oh oh oh rude to all who\nWho are\nAnd\n...\n\n\nMm mhm mhm mhm\n...\n\nThe kids in the ...\nThe ...\nAnd ... and ...\nAnd ...\n\n\nAnd\n\n... and ... ... ...\n\n...\nAnd\n...\n\nI had a\nKid\nAnd cats\nAnd ...\nAnd ... and [noise] and how often\nIn a\n\nI'll\n", "year": "2018", "show_name": "12th Street Jump", "city": "Dalhart", "day": "06"}