{"year": "2018", "content": "[noise] [noise] [noise]\n[noise]\nThis is it required monthly death of the emergency alert system\nHad this been an actual emergency or dangerous situation official messages and directions would have followed the alert this test is brought to you by the division of emergency management the Florida association of broadcasters and your local broadcast station or cable provider biscuit was required to\n\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nNo\nNo but a lot of\n\n\n\n\nUh\n\nGuards were partying and\nWith our friends\nShare share old man Murray\nThe garden party\n... nah mean\nEvery one was there\nYou go ...\nOver and the Carter\nAnd that ...\nLaw that's why they can\nDo one heard the news\nThe in the news and\nJeannie long for me [noise]\nMan I'm about to fall into\nLearned my lesson what\nWhy is it do\nJust a lack of Iran\nYou got a blade guard in the party\nI Wish you a lot of the\nSee them every one\nSees everyone\n... ...\n[noise]\nYou're listening to relax radio in eighty nine nine ... W. J. C. T. H. D. three Jacksonville, Florida\n[noise]\nChrist steely isn't the only mandolin player out there making way Allison Stephens specializes in mandolin works like this one from centuries past\nThis is a piece by Johan humble a student of Mozart it predates what you and I would consider folk music but it still has a bit of that flavor doesn't\n[noise]\nHe'll here Allison Stephens perform it with the London Mozart players than about twenty minutes from Garret McQueen Johan humbles mandolin concerto and much more coming up\n\n\n\n\n\n\n[noise]\n... ... Mm\n\n\n\n\nMm\n\nMm\n[noise]\nMm\n\n\n[noise]\n\n\nIt's always nice to pay a visit to the chamber music object you know we're seeing you just heard is so not a number four formed by members of New Yorkers trip the age of didn't like Mitt music featuring the mandolin is fixed they to\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\nOh really\nWere\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\nReally\nWhat\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nAlison Stephen but the mandolin ... sit there with the London Mozart players you're didn't perform demand Lincoln chaired by Johan humble music for one ... is our music next\n[laughter] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n... good morning and thanks for joining me here wrapping up this hour music is an intimate performance by pianist I Need a punch remotely she performs here work title intimate friendships like Saturday go\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\nA performance thereby pianists Anita ...\nShe's currently the head of the collaborative piano department at the Cleveland Institute of music and sounds like she knows a thing or two about intimate performances you just heard her perform at work by ... title intimate impression\nI'm Garrett McQueen thanks so much for coming along up to see you can't say\n\nExpert ghost towns across the wild west these little towns and you can unleash the imagination meat legends of Irish history has been immortalized in so\nIf it was a great song or two in the air before and it will be there after\nAnd investigate what happened to Michael Rockefeller in the wilds of New Guinea cannibalism is all about intimacy empower\nGets on the next travel with Rick speak Saturday morning upset on eighty nine nine W. J. C. T.\nI beat her said oh wait wait turn twenty this year meaning we're just one year away from being able to buy the drink we desperately need after two decades of doing that to join us for unauthorized celebration on this week's Newsweek printed bill\n... nine nine double your Jaycee to get them Jacksonville providing news information in music from Florida's palm coast to Georgia go do not listen on your computer or mobile devices W. J. C. T. Donald\n\n\nThe tragedies composers dealt with during their lives should themselves in the music they wrote all the time this tragic piece of music by Brahms though doesn't reflect anything negative in his life he was simply showing off his ability to create a tragic stamp\nBrahms wrote it in Eighteen eighty alongside of much cheer composition in his words that one last well this one cries [noise]\n\nYou'll hear it in about Fifteen minutes the tragic overture Brahms in more coming up [noise]\n\n\n\nAlways great performances by hobo is Heinz holiday gr you just heard him there but the ensemble emu Z cheat and musical tomorrow so how many ... that was his elbow concerto number three\nYou know they work at a really noble cheery sale to my ears music with more tragic that static up next\n\n\n\nClassical music is great for relaxation yes but\nFor me it's important to sometimes listen to music that'll help you sort some sort of feelings of anger or maybe frustration his next whereby brown does a great example of that beautiful with lots of musical anger does this tragic overture performed by the beginner fill their money under maestro Carlo Maria ...\n[noise]\n\n\n\n\n\n\n\n[noise]\nOh\n\n\n\n\n[noise] well\nMusic of hunters brown so is this tragic overture performed by the piano philharmonic music by a hero of ... coming up next\n[noise]\n\n\nWell\nI'm ... good morning and thanks for joining me\nFrom shows of heightened was all the rage in London when he moved there from Austria back in the Seventeen nineties his audience is according to research with I think it pretty rowdy and they preferred music they could hit two like Eighteen century classical sort of way\nBut he's a work those audiences fell in love with instantly I think you will to this is heightened string quartet number fifty seven and see if we can do in string quartet performs\nAnd\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\nUm\n\n\nAnd then\n\n[noise]\n\n", "show_name": "Classical 89.9", "month": "10", "state": "FL", "day": "27", "station": "WJCT", "city": "Jacksonville"}