{"year": "2018", "station": "WJCT", "show_name": "Classical 89.9", "month": "10", "state": "FL", "day": "06", "content": "... a\nGot\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\nYou're listening to relax radio and eighty nine nine at Penn W. J. C. T. H. D. tree Jacksonville, Florida\n[noise]\nLand of the heat than shaggy would land up the mountain Andy flood near rhyme there that inspired this music like how many ... [noise]\n\nThose traditional Scottish lyrics everyone still use to describe the exciting landscapes that Scotland\nHave you really listen you'll hear that how much but Coontz piece of music does the exact same thing\nWill enjoy this musical trip to Scotland hearing about six minutes land of the mountain and the flood and much more on the way\n\nNo no no no uh no no\n\n\nMm\n\n\nUh Julius conclusion to the musical depiction of the Scottish landscape how much my land of the mountain and the flood you heard it performed there by the royal ballet since Sonia under the baton of maestro John Wilson\nYou and I'll pop over to Venice the little later this hour next performance from Sweden don't go anywhere\n[laughter] [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\nHistory has proven that there's a thin line between war and peace that line was even dinner when it involves Napoleon Bonaparte\nWhen it's forced the defeated Sweden back in Eighteen ten so we just composer what Kim Nicholas ... responded musically with this symphony Mississippi symphony number four it's subtitled a war and peace so we got some New Yorkers trip performs well\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[laughter]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[laughter]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[laughter]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n... think of a music box when I hear that recording that was catching fits in music up ... his carnival I've been is I'm getting a quaint extra listening\n\nIf you want to move to Japan and you'll need to know a few things to video Japanese people are more modest and read served in public they don't usually talk loudly and touring\nThe state the popular British TV shows might give you the wrong impression\nIf he were to watch the ... I guess a crusty old is the one that we don't have the highest note the right to know what it's all in the next to travel with Rick ... Saturday morning up step on eighty nine nine W ...\nPeter said we don't know if I get paid the attorney general still has a job where Brett Kavanaugh will get one but we do know that our guest this week is actor John have listened to the dreaming is and this week's wait wait don't tell NPR\nThat says safety nine nine W. J. C. to get that Jacksonville providing news information and music ... Florida's palm coast to Georgia's golden I'll listen on your computer or mobile device W. J. C. T. dot ...\n\n\n\nAt the turn of the nineteenth century to composers were competing for audience attention\nWhen did they must be telling the other student of Mozart's named Johan ... [noise]\nThink it's safe to say the Beethoven won that battle overall but\nHumble made a deep impact as well in a way he helped solidify music by land viola cello base and piano\nWith those instruments can bind you get a piano quintet and you'll hear one in about twenty ... McLean Johan how most piano quintet in more coming up [noise]\n\n\n\n\n\n[noise]\n\n\n\nA performance by the ensemble set it up to of London and very appropriate group to play serenade like the one you just heard by Mozart that was his set enough to know total that Minneapolis art it sounds so I'm all takes it away next\n\n\n\n... ...\n...\n\n\n...\n\n\nBecause you hunt humble was around at the same time as Beethoven many of its works have fallen into obscurity a few of them that didn't do include a but soon concerto a trumpet concerto\nChamber work for piano violin viola cello and base if I'm familiar with that work I think you'll really be happy to take a listen to it now this is a piano quintet in the play by composer Johan ... ...\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[laughter]\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[laughter]\n\n[noise]\n\n\n\n", "city": "Jacksonville"}