{"month": "10", "state": "GA", "station": "WABE", "content": "Were joining me now a Monet use the Norwegian ambassador to the United kingdom thanks for being with us and do know regions know the story of yolk him run about\n... but was this very interesting I think is that it took quite a while before you can run a bird and a lot of the other\nIn in the resistance during the second World War started to talk I think it was the kind of an aptitude for Saturday's almost Thirty years after the war that\nThat one wanted to forget that generation didn't want to talk about it so it was actually only in the last Twenty years that that those who took part in the various operation and those who whether sort of the heroes of the resistance\nStarted really to to walk and saw also the value in educating\nYoung people in all by about actually the whole history of the second World War\nSo that ah Nineteen sixty five filled the heroes of a telemarketer did that night all reignited interest in the story in Norway\nYeah I think it was was about ... ignite thing rather than leagues night thing because I think the interest from from a bold well so does that may be bigger than than than than what was ah the the case or in in Norway\nSix to eight doesn't that are given the achievements of a random and the rest of his team\nI absolutely but I I I think as as written about himself said in in indeed do you I think they took also a lot for them to realize what they actually at all the important and so what they're doing but I think it was more about\nSort of that car no war generation that that too\nAnd it was just kind of attitude that this while their best to to not talk too much about what's happened let's move on let's let's start to rebuild our lives as a as if we can\nTrey enough to sort of be to sort of hanging out in both had happened\nNonetheless some ... ... is ... now in no way there's a statue to\nAbsolutely there is a statue in his home town I'm In no listen that was sad and ... when he had this nine to ... yeah well they say four years ago\nAnd he he had to be I mean golf all kinds of ... nations and and the last ... years so all his life that so I said what I was saying a lace enough that it it's at last about Saddam [laughter]\nFor forgetting what ... what what has been going on because he really took a great effort in\nIn ah in educating going to school to see the young people\n... a must a break you often we've run out of time that was money you'll know return ambassador to the United kingdom ... from the ... of world update [noise]\nNine point one WABC Atlanta for a T o me the [laughter]\n\nSupport for W. H. B. E. comes from sugary will formerly Maggie Culiacan associates of the only sustainable wealth management firm specializing in holistic financial life planning and values based investing trickery wealth integrating money and meaning trickery wealth dot com\nUnder Republican Brian Kemp Georgia has put a new obstacles devoting all in the name of stopping fraud\nNow camp is accused of voter suppression\nThe best way to stop people from even trying to about let them know they're not welcome\nAnd make it hard camp is running for governor against Democrat Stacey Abrams I'm WABC reporter Johnny Kauffman we spent months investigating voting in Georgia and you can hear our story today during all things considered\n\nGood morning President Trump says Russia as violating a nuclear treaty and the U.S plans to pull out [noise]\nSo what what Russia's next move\nFrom Moscow on MORNING EDITION from\nSome allies including Britain stand by the president's decision although some analysts fear a new arms race I'm Steve Inskeep and I'm David Draine is our help me too movement has finally arrived in our country with a higher rate of sexual violence\nLater why the state of Georgia for more than half a million voters from an older\nOne way to treat depression and anxiety laying it means force is Monday or over twenty second happy birthday to Mitch over Modern Family Jesse Tyler\nFerguson turns forty three in\nThe news is next\nLive from NPR News in Washington ... Coleman President Trump says he'll withdraw from the intermediate range nuclear forces treaty a decades old agreement with Russia and beer is Emily ... rather Sullivan says it eliminated an entire class of nuclear weapons\nThe decision is a severe blow to the arms control regime that has helped preserve peace since the Cold War Trump accused Russia failing to honor its agreement other U.S officials have accused Russia of violating the IMF in the past including the Obama administration chose not to leave out of concern for a possible arms race\nNPR's Emily Sullivan reporting the president of turkey has spoken with President Trump about the death of a Saudi Arabian journalist at the Saudi consulate in Istanbul NPR's Peter Kenyon reports the Turkish leaders says that tomorrow he will reveal the naked truth about the case\nPresident ... spoke with Trump by phone and state media said the two leaders agreed that all aspects of journalist ... must be clarified aired one has so far not blame Saudi Arabia though investigators have said to show he was killed in the embassy and his body disposed of\nButter to once as you'll talk about the subject in detail during a political address too\nDo the Saudis story of what happened to the show has changed multiple times on Sunday the Saudi foreign minister told Fox News channel that the killing was a huge and great mistake but said it wasn't ordered by crown prince Mohammed bin ... Peter Kenyon NPR News Istanbul\nEarly voting starts today in Florida some voters of camped overnight to cast ballots in Miami but his cave on Antonio Hadar reports they also attended a gubernatorial debate between floor to candidates last night\nVoters gathered to watch the debates candidates for governor of Florida Democrat Andrew Gillum and Republican Ron dissent is\nThe two sparred about issues like health care guns and immigration afterwards about thirty Democrats eager to cast an early ballot camped overnight outside a precinct in the Shenandoah neighborhood of Miami they brought\nFood and music oh Dr Eileen ... is a county commissioner or are people that are actually willing to sleep in\nStatton night long so they can mean at first and vote for ... and that is something that is not ordinary\nEarly voting continues for two more weeks until the general vote for NPR News I'm cave on Antonio dory in Miami\nMexican authorities say around seven thousand migrants from Honduras are crossing into southern Mexico the migrants have said they're scraping violence and poverty at home and plan to go to the U.S border\nPresident Trump has been very angry about the group is called it an onslaught and threatened to seal the U.S border with Mexico Mexican authorities are also warning the migrants they face\nDeportation some Mexicans have welcomed the migrants you're listening to NPR\nSupport for NPR comes from progressive insurance offering her weights or by home insurance with their home quote explorer tool custom quotes in rates are available online learn more at progressive dot com or one eight hundred progressive now bats progressive and the corporation for public broadcasting\nFrom W. A. B. E. news in Atlanta\nGood morning I'm Sam Whitehead about a hundred and seven thousand people were removed from Georgia's voter rolls and twenty Seventeen for non voting in previous elections it's according to an investigation by W. A. B. E. news and a P. M. reports\nThe removals were part of a legal process called list maintenance or voter purges Georgia is one of at least nine states with such a policy on the books\nVoting rights advocates call it a new form of voter suppression likely to spread around the country Republicans like secretary of state Brian Kemp who happens to be the Republican candidate for George governor says the process is necessary to combat voter fraud we'll hear more on the issue from W. A. B. east Johnny Kauffman later this hour and MORNING EDITION\nSome rural hospitals have not gotten the donations they were promised as part of a state program so Georgians will get another chance to divert part of their taxes to struggling healthcare providers Susanna capital Ludo has more\nTo help rural hospitals people and corporations can donate up to ten thousand dollars instead of paying the money to the state in taxes when that program open in July the cap of sixty million dollars in pledged donations was quickly met\nIt was a tweet within anonymous allegation that he had inappropriately touch the college classmate Seventeen years ago Grover denies it she\nSays he supports India's me too movement but he's upset that while investigative journalists vetted complaints against Harvey Weinstein in the U. S. in India the accusations have exploded mostly on social media where some of the accusers remain anonymous\nI understand the anger bart are the same time ... you got me some of them can on you must have known it was almost like being a voice\nThough Grover says he understands why many women choose to remain anonymous they're scared to go to the police it on and on\nMore illiterate women sing a song about the beatings have endured in ... in northern India\nThis is a world away from the urban elites in their ... to hash tax\nBut bond ... news their struggle in Nineteen Ninety two she was working for her local municipality\nAnd it started a campaign against child marriage some powerful men in her village did not like it but to see what you said about um an Oakland Debbie describes house three local men beat up her husband and then held her down to others raped her in an open field\nDebbie's case went all the way to the Supreme Court and led to India's first workplace sexual harassment guidelines in Nineteen Ninety seven\nBut most sexual assault in India is still perpetrated by relatives the neighbors not co workers or bosses\nAnd well Bollywood film stars and media figures have been at the center of India's me too movement sexual violence as most rampant and most under recorded in rural areas where the majority of Indians still live only about a quarter of Indian women have jobs\nDebbie is one of the few working women in her village a lot of them I guess I'd asthmatic and if I ...\nThat are still not use cases often involving father's ... brothers and no it's different from the city in villages abusers can hide behind their families victims they speak out I think the whole villages on now it's\nBeen twenty six years since Debbie was attacked the men were never convicted of rape only one of them is still alive Debbie doesn't have a TV or a cell phone a human rights worker from the city had to tell her about the me too movement she wanders they first sole surviving attacker has even heard about it\n... miles in the news is that I had to have gone up awfully mining live at age don't people against the I've been ostracized by my community because I spoke up\nDaddy is now in her sixties she doubts she'll get justice in her lifetime but she says she's hopeful that the next generation of\nHer sisters in India just might learn by our NPR News jak more on\nThat it couldn't have\nIt does then\nThose that mine now and then that that in fact\nKnow that in a non ... and then it oh outlet if this is NPR News\n[noise]\nJust ahead on MORNING edition MORNING EDITION producer such a corner steps into the head of the news will be keeping our eyes on this week that\nUp and just about twelve minutes but first research shows that exercise can help people with depression but a recent study indicates that the type that exercise matters\nSo if you run on a treadmill for example it's clear that you're getting my biological stimulation but perhaps there are other elements of depression but you're not going to be tapping into\nComing up why team sports maybe the best option\nI'm Sam Whitehead thanks for joining us for MORNING EDITION or number supported Ninety point one\nW. A. B. Atlanta\nSupport for WABC comes from ... when the orchestra this week Donald ... returned\nTo lead the Atlanta symphony orchestra and chorus with an all star cast him Benjamin Britten smash up him to the phones the war requiem return World War one poems from the battlefield Thursday and Saturday October twenty ... twenty seventh and Atlanta symphony hall details at a a so dot org\nClassical series presented by Delta Airlines\nSome areas of frost out there before nine am this morning that they will have sunny skies would hide from the mid sixties currently forty two degrees that are clear skies here in Atlanta [noise] thirty nine indicator in Fayetteville [noise]\nOr time to six twenty [noise]\n[noise] I'm On you Lucas W. A. B. E. were so thankful for every one who pledged during the fall of member Dr\nThanks to the staff and volunteers who worked a little bit of extra to the student who gave Fifteen dollars to the new cornerstone members and to that person who donated at five oh eight am\nThank you we wouldn't be here without you\nDidn't get around to it there's still time\nAt W. A. B. E. dot org that's W. A. B. E. dot org thank you\nSupport for NPR comes from this station and from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with female tablets a drag and drop email editor and twenty four seven customer service Morris campaign monitored dot com [noise]\nFrom T. I. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more it T. I. A. dot org\nAnd from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep when it comes to healthy aging and keeping your memory sharp here's one idea you're may not have considered ditch your hearing checked\nYour ears and beers Allison Aubrey reports a new study finds people who restore hearing loss with hearing aids actually slow down memory loss\nOf all the things that can cause friction in a marriage you might put hearing on the list that is until the person you love begins to lose it that's what happened to carry and Lucy and Johnson\nWas caught a screaming screen real out for him to understand that was bothering you yes it was drawing them approach you up and everything\nAnd her husband ... Johnson Celtic to\nErdogan was calling because it does your program just ignoring you would not just a near what'd you say so Roger emerging which I won't go Georgia [noise] those last\nSo a few weeks ago Lucy and Johnson was fitted with hearing aids and audiologist Dina Rollins says as with many of her patients he's hearing is now\nBetter stimulating your ears stimulates the nerves that stimulate your brain so we're giving your ears back what they're missing and really given your brain what it needs to make sense of what you're hearing\nAnd here's another benefit that many people don't consider when you were store you're hearing a whole lot of living can come back\nSocial isolation is a huge part as of hearing loss and people will notice their loved ones withdrawing from conversation not going out to finally functions like they used to\nIt's not just the loss of social stimulation the latest evidence shows when people cannot hear well memory loss can set in faster peers dogs as an experimental psychologist at the University of Manchester in the u._k. he\nWanted to understand this better for he and some colleagues designed to study it included thousands of healthy older adults in the U.S\nAnd we looked at the trajectory decline in the memory performance a before and after they started using it hearing it\nThey did this through a series of cognitive assessments performed every two years for sixteen years the way it worked a research assistant would visit participants in their homes and give the test one was a word ...\nThey have a list of ten for random words that read out loud to the ... better than us to recall the words immediately\nAnd then after a delay they're asked to recall them again ... says it turns out after the participants began wearing hearing aids their rates have recalled changed it wasn't a huge difference but it was measurable\nThe very intriguing results I mean we weren't expecting that hearing it use would completely eliminate cognitive decline of about ... not going to happen but what we've found is that it just slows the rate at which declined proceeds\nSo many factors play into healthy aging and ... says good hearing can be one of them so it's important to understand the benefits Kerry and Lucy and Johnson the hearing\nAids have made a big difference well he can hear me now don't have the say yelled loud right or what do you like to bug them about getting up he likes to stay in bed yet and get up dying to get a\n... [laughter] it was you were wide\nLucy and Johnson is Ninety two years old and it just it's a nice to have a problem you can fix Allison Aubrey NPR News\nI'm millions of Americans suffer from depression and anxiety research shows regular exercise can ease conditions like panic attacks mood swings sleep disorders in a recent study shows that the type of exercise really makes a difference social Woodruff reports\nDemocrats and civil rights groups say that these voters don't show up at the polls as regularly as Republicans so to use it or lose it purges disproportionately affect those voters and they say they really this is a new voter suppression tactic Republicans are using to help them win and so what reaction has there been\nFrom voters I mean this is becoming a campaign issue and he's found a way\nYeah voting has really become a central issue in the campaign here and we went to a rural southwest Georgia I visited a small town called Moultrie which is mostly black and Latino\nAnd voter turnout is really low there and we spoke to Reverend Cornelius ponder who's a community leader and he explains that low turnout is because of these obstacles to voting like the purchase on here's a clip of ponder from our story that aired on the podcast reveal\nIt almost give people the reading my say that this is a privilege not a right and so now anything that is a privilege has to get permission and so if you don't do our way we will give you permission to use his privilege\nAnd so when it comes to the purchase a punter aunt was actually someone that was root for not voting\nShe voted for Obama in two thousand eight she hasn't voted since then and she's thinking about voting for Abrams but unless she registered before the deadline earlier this month she may go to the polls and she won't be able to vote Georgia doesn't have same day voter registration like some states so the idea that this is creating a\nMindset that voting is a privilege to the idea that there's voter suppression\nI mean those are incredibly serious I'm Serious charges um [noise] what is secretary kept saying in response to to all of that well ...\nPoints out that he's following the last year the Supreme Court has approved this use it or lose at policy they did that this year\nAnd he says you know the state sends out multiple notifications before moving these people\nHe says he hasn't been more aggressive and purging voters and other secretaries of state but the numbers show a big jump and people were moved by one point six million people since he took over that includes all rule so people who have moved our died and these people who have been removed for not voting and\nYou've been following a lot of issues like this as as as washing gets close right yeah there have been at least\nI I think for lawsuits filed in the last week over voting on the big one is over this policy that's disproportionately holding up the voter registration applications of people of color\nThose people can still vote but civil rights advocates are worried about confusion and people getting discouraged um there's some ... a lot of absentee ballots that have been rejected in one county specifically\nAnd ah you know this is a really close race they're few undecided voters both candidates are really trying to motivate their bases and they found that criticizing the other candidate over voting seems like a way to do that\nJohnny Kauffman from member station W. A. B. E. Johnny thanks a lot You're welcome\nA Chicago police officer who shot and killed a Fifteen year old boys six years ago\nWill be returned to duty that is even after his own boss tried to keep them off to force the Chicago police board made that decision it is a group of civilians appointed by the mayor and city council they get final say on police discipline it's one of many civilian police sports in this country\nPolice do not always like civilians peering over their shoulders this way but this civilian board routinely blocks the department from firing officers W ... Miles Bryan reports\nUntil recently pan the Edwards was feeling hopeful that the officer who killed her son would face serious consequences\nIn twenty twelve Chicago police officer Brandon turn in fatally shot Dakota bright on the city's south side\nTurn and says he saw the teen carrying a gun but no gun was found on his body\nLast year an official investigation finally found the shooting to be not justified and the police superintendent moved to fire tournament but earlier this month Chicago's police board voted to reject that conclusion Edwards says she had no idea it was coming\nHard because as well I think an ally\nBaby my baby is going to get some justice\nIn a written opinion the police Port Said it found officer turn out to be credible when he said decoded bright made him fear for his life and where it says the decision was particularly painful to take because in a closely watched trial just a week earlier a jury voted to convict Chicago police officer Jason Van Dyke the murder of another black teenager Guam McDonald\nStanding on the residential block where her son was killed and word says Boyce her son's age just don't have the luxury of trusting the police\nThey have no share a misleading with the folks\nYou are nothing when it comes\nRights case is not unusual from two dozen five to twenty Fifteen the Chicago police board voted almost sixty percent of the time to allow officers the police superintendent wanted to fire to keep their job instead\nBrian core heads the national association for civilian oversight of law enforcement he says well lots of cities have civilian oversight groups the Chicago Board the ability to overrule the police departments wishes makes it\nStand out for a civilian oversight leads you to have that power of the many oversight agencies around the country it's relatively unusual\nInsured it's it's due process run amok ... teaches at Northwestern law school and is an attorney with the MacArthur Justice Center\nShe says the police sport which was created in response to a police scandal in the fifties has a reputation for protecting officers from discipline according to a department of justice investigation released last year the information that board members get to see about a case is unfairly skewed in the officers favor\nIn the board members are political appointees who investigators say generally have had no background in policing or accountability\nNot set up to try to root out police officers who are engaging in excess\nWho are racist and you use these tactics indiscriminately that's not what system set up to\nChicago officials are considering a number of reforms to police oversight one proposal would scrap the police sport entirely replacing it with an elected body but that's little comfort for ... Edwards who still angry as she grieve the loss of her son\nPeople wish cargo [noise] why nobody means nothing alike [noise]\nBase they may lead to kill us and may stand by\nThe Chicago police board wouldn't make any of its voting members available for an interview but the board's executive director says it weighs its own evidence and\nMakes decisions case by case for NPR News I'm Miles Bryan in Chicago [noise]\nThis is NPR News\nDo why\nJust ahead on the marketplace morning report it's the first holiday season without Toys R us sometime makers like ... or jumping at the opportunity to fill the void is the biggest season in toys spending gets under way\nMore on that and just about ten minutes but first comic actress Julia Louis Dreyfus was awarded the Mark Twain prize for American humor at the Kennedy Center last night we'll take a look at that ceremony straight ahead [noise]\nI'm Sam Whitehead thanks for joining us on member supported Ninety point one W. A. B. E. Atlanta\nOr ATM meets NPR\nSupport for WABC comes from Emory Healthcare Emory Healthcare welcomes the cab medical to the family together delivering stronger more accessible high quality care close to home more at Emory Healthcare dot org slash the cab medical\nAnne from the Atlanta Journal constitution it's worth knowing what's really going on the AJC watches elected officials tax dollars and provide ginned up the county by county coverage print and eat paper subscriptions at AJC dot com slash worth knowing\nSome areas of frost out there before nine am this morning today will have sunny skies hides in the mid sixties currently forty two degrees that are clear skies here in Atlanta forty one in ... in East Point our time is six forty three [noise]\n\n[noise]\nOn the next closer look we'll go inside the mission of Doctors Without borders and in Studio conversations with the authors\nI remembered how my uncle used to talk like this summer nobody um and nothing and the idea of sort of revisiting him again\nMitch album on writing a sequel to the five people you meet in heaven and Jane sharing to heart talks about the biography of Justice Ruth Bader Ginsburg I'm Rose Scott closer look today at one on Ninety point one W ab [noise] people of\nColor could decide Georgia's bitter race for governor but we'll all the obstacles devoting keep them away from the ...\nThe races they like is no longer need more vote in there and I think that's what we're trouble with\nFor years Democrats the Abrams and Republican Brian Kemp have fought over you can do to be um W. A. B. reporter Johnny Kauffman we've spent money investigating voting in Georgia and you can hear our story today during all things considered\nSupport for NPR comes from the station and from the ... Family Foundation supporting shattered proof a national nonprofit dedicated to ending the devastation of addiction and transforming treatment in America learned more it shattered proof dot org [noise]\nFrom capital one offering a variety of credit card options with features for a range of customers from ... to travelers capital one what's in your wallet credit approval required capital one bank usa NA and from the listeners to support this NPR station\nWell the powerful trait in tech organization the Institute of electrical and electronics engineers has just come up with a new ethics certification process\nIt's designed to help engineers make technology that on balance helps rather than hertz is transparent about the assumptions built in John ... is executive director of the ... artificial intelligence and robot ethics project thanks for coming in\nMy pleasure to be here this is about what a putting human needs\nFirst when it comes to autonomous robots self driving technology\nWell I think in general it sort of an idea of a contract when you buy a piece of technology and the expectation is it will be safe and all that but with autonomous and intelligence systems there's just new things that people have to understand are trustworthy\nSo for instance as engineers work\nOn autonomous vehicles self driving cars and trucks they have to program in different preferences of self driving car has a choice of saving the occupants of the car in an impending crash but at the expense of killing pedestrians would the certification program demand that we know about that\nParticular choice the logic is to write out all the potential scenarios that could happen but right now a lot of times those conversations happen outside the context of how many humans unfortunately are killed with cars is they are right now\nBut the way the technology answers that question is that something that the sort of a patient process wants to know more about or wants to the end user to know more about\nIn the sense I'll give you an example it's more of a cultural thing recently autonomous vehicles were tested in Australia\nAnd the lidar the technology that's used to sense surroundings hadn't been programmed to recognize kangaroos [laughter] so the big kind of like bouncing jumping around motions weren't recognized whereas like squirrel dirt emotions were recognized but\nThe point is is that you have to ask even more questions than you had before when you have these new types of technologies and then actually goes back to safety it's just a different type of safety question than some people may have asked before\nAs the technology advances it requires human beings to decide what are our values and what our values in different countries you have to actually define them and be aware of them all\nEthics questions oftentimes especially in western media is coming from a Greek background of ethics whereas when we have the entire other side of the planet and the global south\nHas things called Confucian ethics or a boon to ethics and its reframing of the paradigm that's how we come to these questions and so it's when you ask those questions that much more this is where the word safety or trust can really be elevated to more global levels and that's what a trip believes about consensus building globally\nIs to say we don't know we don't know yet but we have to ask\nJohn ... is one of the architects of the ethics certification program for autonomous and intelligence systems at the ... Tripoli he's also author of heart official intelligence that's the word heart there at the beginning embracing our humanity to maximize machines\nJohn Hoeven thank you my pleasure\nThat new ethics certification process also addresses wider economic effects of new technology and pushes for openness about potential economic winners and losers more that interviews it marketplace dot org give gotcha marketplace\nEight PM American public media\nFor WABC comes from the Decatur wine festival November of ...\nTwelve thirty four thirty in downtown Decatur on the square you can taste more than five hundred winds invites from Decatur eateries proceeds benefits the dictator arch alliance tickets at ... dot com\nAnd from Doctors Without borders presenting forced from home and interactive exhibition about the global refugee crisis October twenty first through twenty eight that west plaza park next to the Georgia world Congress center learn more at forced from home dot com\nJust ahead on MORNING edition President Trump is touting his own job performance while campaigning about the dangers of illegal immigration\n[noise] everybody\nWill have more on Trump's efforts to help fellow Republicans in the mid term something just about Fifteen minutes that after a check of the mornings top stories from the NPR W. A. B. newsrooms this is MORNING EDITION of Ninety point one W. A. B. Atlanta where our time seven o'clock who\nGood morning Senator Ted Cruz who famously stopped short of telling people to vote for Trump to twenty sixteen convention now calls on this for the Trump campaign proven in Texas It's MORNING EDITION from NPR News\nMexican officials talk of stopping a caravan of Central American migrants I'm David\nGreene and I'm Steve Inskeep instead the migrants were allowed to pass northward was hoping to reach the U.S\nAre far behind Republicans in the number of governors have a shock to capture the governorship in deep red Kansas also this hour how Afghanistan's elections turned out it's Monday October twenty seconds to say in Nineteen sixty two presidents John F. Kennedy told the nation of Soviet missiles in Cuba\nUse the signal the start of the\nThe news is next\nLine from NPR News in Washington encore of a Coleman President Trump wants to withdraw from the intermediate range nuclear forces treaty with Russia blaming Russia for violating it NPR's Lucian Kim says the Kremlin has long blamed Washington for breaking it\nRussia has been saying that elements of the American anti missile shield and Eastern Europe is in violation of the IMF treaty\nAnd some analysts here in Moscow say that couldn't has actually wanted to industry for a long time but he wanted us to be the one to rip it off because there are a lot of other countries first and foremost China that are developing these medium range missiles and Russia doesn't want to be have it's tied ... hands tied 'em in countering those threats\nLoosing came reporting from Moscow Mexican authorities estimate some seven thousand Honduran migrants have been trying to enter Mexico with the goal of walking north to the United states many have been returned to Honduras Maria Martin reports\nMedia in Honduras report more than three thousand migrants who left that country's most violent cities ... eight days ago have returned\nOther migrants to weight of the what am I the Mexican border still there are now in Mexican territory some have obtained applications for refugee status sub not those now in Mexico spent the night in ... to laugh and tend to continue to the Mexican state of Chiapas Hanukkah\nMexico's president elect under the slope is over the border is calling for the U.S Canada and Mexico\nTo come up with funding for a developing plans for Central American and southern Mexico so migrants won't need to leave for NPR News I'm Mark ...\nSome Florida voters can start voting early today that includes the eight counties most affected by hurricane Michael from member station WFSU Lynn had her reports hundreds of local precincts were damaged or destroyed during the storm\nIn addition to an extended period of early voting voters can also request their mail in ballots and those ballots can be sent to address as other than the ones on file in Tallahassee deputy Leon county election supervisor Chris Moore says the move makes sense\nIn which two more days so they'll just be able to stay put and whenever they designate for early voting stay there for the Monday or Tuesday as well\nPrecincts are being consolidated into a handful of sites and affected counties that will stay open to election day the changes are meant to help displace voters and county election supervisors\nDealing with power outages damaged offices and spotty communication for NPR News I'm land hotter in Tallahassee the national hurricane\nCenter says hurricane Wilma is a powerful storm just off Mexico's Pacific coast top sustained winds are one hundred and fifty five miles per hour will is forecast to make landfall in Mexico then lose a lot of strength\nIt will cross into southern Texas probably by early Thursday that the rain will be falling on a region of Texas that's already waterlogged\nYou're listening to NPR\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes in modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more ... dot com\nAnd the ... e Casey foundation from W. A. B. E. news in Atlanta good morning I'm Sam Whitehead the second\nWeek of in person early voting for next month's midterm elections gets underway today\nVoters went to the polls in droves last week to cast early ballots some five hundred Twenty one thousand early votes have been cast so far during the last midterm elections and twenty fourteen only about one third of that number of early votes had been cast by this point that's according to the website Georgia votes which crunches state voting data\nEarly vote early voting runs through November second for information on when and where you can cast in early ballot check with your counties elections office\nCivil rights groups are asking a federal judge ordered the state of Georgia to change how it handles voter registration problems at the polls Johnny Kauffman reports\nThe groups want an emergency order before the midterms it's part of a lawsuit over a policy that hopes voter registrations if they don't exactly match other government records if someone's registration is why they can still vote by bringing their photo ID but in some cases they may need to provide proof of citizenship\nRight now county registrars look over that paperwork but the civil rights group said that takes too long and poor workers should be able to do it themselves saving time for voters Johnny Kauffman WABC news\nOf course that same comment had him one hundred percent against Hillary Clinton now Trump is president Heller is on the ballot and well here is this past weekend this president is doing a great job [noise]\nHoller at a rally in the town of El Loco Nevada it's a place known for its gold mines and Heller talked about gold as Trump's nearby onstage nodding approvingly\nOr president you know a little bit about goal in fact I think everything you touch turns to go [noise]\nOr his heart from nature people knew that ... has been there for him in the Senate especially with Supreme Court nominations\nBy the way I have to thank Dean Heller for helping us with justice Gorsuch and justice Kevin\nTo Arizona and another GOP candidate who once kept Trump at arm's length congresswoman Martha ...\nShe is in a tough race for an open Senate seat mix Sally a former fighter pilot was at Trump's side as he toured an Airforce base on friday and again later at a big outdoor rally here is the president\nOffers a veteran or great veteran a great fight or a warrior and the first female fighter pilot\nTo fly combat missions in American history thinking that she's the first [noise] of\nCourse you never know exactly what the president will say once he comes to town you can spend more time talking about his own election in twenty sixteen when he does on getting out the vote in twenty eight teams in Montana just days ago he promoted the Senate candidacy up Republican Matt Rosendale\nBut got far more attention for what he said about another local politician congressman Greg gene forte he is best known around the country as the guy who body slammed of journalists who was attempting to ask him a question last year in Missoula Trump celebrated that attack and by the way it never wrestle him\n[noise]\nAnd that your your body slammed which brings us to tonight in Texas Senator Ted\nCruz has long since made up with Trump after they waged an ugly battle both political and personal for the GOP presidential nomination back then after Trump denigrated his wife's looks in a tweet Cruz responded with this\nI don't get angry all [noise] but you mess with my wife you mess with my kids that'll do it every time Donald your sibling or leave it alone\nDon't expect any such talk tonight as Trump and cruise shared the stage no mentions of lion tad\nSome play ball references to pass differences perhaps but outwardly at least two politicians happy to be supporting one another hoping to stave off a challenge to cruises reelection all with the\nPurpose of hanging onto slim GOP control of the U.S Senate Don Gonyea NPR News\nThis is NPR News\n[noise]\nStay with us just ahead on MORNING edition we'll check in with the W. A. B. E. newsroom Georgia's public school start the year so early that for some kids summer's over at the end of July\nThe lawmakers though we're considering changing that we'll have more in just about twelve minutes but first while Taiwanese electronics giants box cutters building a factory in Wisconsin It's also looking to use its resources to modernize that states dancing cross which Wisconsin farmers selling the Asian markets more on that effort straight ahead\nI'm Sam Whitehead thanks for joining us for MORNING EDITION of never supported daddy point one W. A. B. E. Atlanta\nSupport for WABC comes from city springs presenting Prague philharmonic children's choir who's beautiful sales will feel buyers theater on Thursday October twenty fifth you can experienced the wonder of these children's voices on October twenty fifth city springs dot com\nAnd from Brandon hall school Atlanta's only coed preparatory day in boarding school Serbian grade sixth through twelve ranked on the top twenty five percent best private prep schools in in the top Fifteen Percent most diverse in the usa Brandon hall dot org\nSome areas of processed out their clearing around that am this morning today will have sunny skies with hides in the mid sixties currently forty two degrees in a clear skies here in Atlanta thirty eight in Kennesaw in Lawrenceville our time is seven twenty\n\nPeople of color could decide Georgia's bitter race for governor but we'll all the obstacles devoting do you keep them away from the molds\nThe races like is no longer need more devoted now and I think that's what we had trouble with them\nYears Democrats the rooms and Republican Brian Kemp have fought over who can do to be I'm WABC reporter Johnny calm and we've spent money investigating voting in Georgia and you're\nOur ... today during all things considered ...\nSupport for NPR comes from the station and from zoom zoom offers cloud video conferencing online meetings and a video conference room solution in one platform featuring digital video and audio were screened sharing account registration and more at ... dot us\nFrom the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges a next done UFO ... you\nAnd from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learned more it go to meetings dot com\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep Afghanistan voted over the weekend or most of the ... the killings of top officials in one major problems for slate there but the rest of the country cast ballots for parliament Pamela constable of\nThe Washington Post joined us on friday just before the voting and now she's back hotel Hi how are you okay thank you very much what was voting day like\nA well it was a it was pretty chaotic um every polling place a I visited in the capital and\nDozens of polling places across the country a reported on a large problem with a disorganization unprepared polling officials last materials um a biometric equipment that didn't work\nVery very very long lines um many of the polls opened three four five hours late um did not open at all so it was um a well intentioned effort\nBut the but the but the practical results were were pretty chaotic\nUm use your clear that enough ballots were casting a legitimate way that this will feel like a legitimate result\nThat's a good question and I can't answer it yet\nBecause as you mentioned um you know a large number of voters and one province Kandahar where there were some serious killings in the past few days\nHas a has been delayed for one week and in a second province staff they were there had been makes it a tax as well that voting has also been delayed so you've got two provinces a where the voting hasn't even happened yet and you also have a dozens or possibly even hundreds\nOf polling stations both an accountable and elsewhere where people had to vote yesterday a second day of voting because the polls never opened\nA on on election day itself and election officials say they're not going to be any uh any results or of any of any significance for weeks and possibly even for a couple of months\nWell so we have no idea who won these elections in ... given the they're not even quite over but let me ask you about what the winners will face we should note people know from a distance that Afghanistan has had a very powerful president to the extent that it's had a central government at all and of course a lot of decisions\nIn some cases are in the hands or influenced by the United states influenced by allies or her for that matter influenced by the Taliban which controls portions of the country will this parliament once it's seated have much to say what were the Robie\nThat's also a good question I I I think and I and I hope\nI'm that the country and for change when I was reporting from the campaign interviewing candidates and interviewing voters oh I found an enormous amount of a surprisingly large amount of is going to say as them and hope that this election actually wouldn't bring change in parliament itself\nA young people voting young people running a more educated people voting and running a and a lot of hope to sort of out with the old faces and with the news so I think I think there is still hope for that\nPamela constable of the Washington Post always appreciate your insides thanks so much you're very welcome she's into\nAn unusual alliance is shaping up between Foxconn that global electronics giant that's building in a normal plant in Wisconsin and some farmers in the state who grow the medical ... from member station W. W. M. and Milwaukee Mayan silver reports\nYou know at a little girl who is tucked under a blanket with her mom right next to them is a little boy he's probably three or four years old\nOr with his parents there's a there's a guy just sleeping under a little plastic bag here um these people walk more than twenty miles yesterday to get here temperatures got above Ninety degrees um so you can just tell they're absolutely exhausted\nYeah I can imagine um so I mean in addition to sleeping on sidewalks and walking is long distances and exhaustion or I mean it's I guess a lot of uncertainty about whether the Mexican government whether the U.S government is actually going to let them continue this journey\n[noise] yeah and it's been very confusing to try to figure out exactly what the Mexican Government strategy is here um because\nYesterday I was walking with the care of and then we heard there was a blockade being set up by Mexican police that we went to check it out they had like two hundred riot police ready to stop the caravan and then a couple of minutes later they just took this blockade away all the police left\nAnd the caravan kept marching so they don't know if the Mexican government is really going to put police there to try to stop them or if they're going to be able to continue north it's it's just not clear yet so\nWe've been obviously reporting on migrants from Central America making their way to states for a long time now that this group and correct me if I'm wrong seems particularly large um\nDoes that tell us anything [noise] so ... you're right we we have been saying for years people fleeing countries like Honduras and El Salvador in Guatemala there's you know lots and lots of crime gang crime is very bad there you know poverty is also really bad um\nYou know talking to people about why during this caravan of why so many of them have come together they just said they saw the caravan as an opportunity to be safer because\nThis migrant route is so dangerous for migrants and especially if you're traveling with kids\nTravelling alone put you at risk of so many things of cartels and gangs attacking you which is very common here in Mexico so they saw this as the safest way to get out of their countries and they think the United states is is the safest them best place they can be\nOkay and of course president I'm not saying though that they're not going to be allowed into the country is a lot of uncertainty for the group you're falling that's reporter James Frederick speaking to us about this caravan of migrants moving northward you speaking to us from Mexico James thanks a lot\nYou American voters are choosing more than the U.S Congress this fall they also choose state legislatures and many governors Democrats have a chance\nTo gain back some of the governorships they have lost to Republicans only sixteen fifty governors right now are Democrats Republicans are working to defend their games including into very red state of Kansas here's Jim McLean of the Kansas news service\nLaura Kelly is a veteran member of the Kansas Senate and the ... democratic nominee for governor\nShe's doing their best to keep the memory of former Republican governor Sam Brownback fresh in the minds of Kansas voters particularly the memory of how the income tax cuts that Brownback champion crashed the budget and forced to cut funding for schools highways and health care\nWe can either backward and repeat the last eight years from\nProbably isn't running against Ron back who moved on to the Trump Administration but in debates like this one at the cat is a state fair she misses no opportunity to talk her Republican opponent Kansas secretary of state Kris Kobach to the former governor and his policies\nKris Kobach is making it very clear where he will take us as a state he will take us back to the devastation that we had just flew through\nKelly is getting help from some on expected sources some big name Republicans at least picked occasions or jumping party lines to support\nLaura Kelly is the only Democrat I have every office or moderate\nRepublican bill raised was governor of cameras from Nineteen Ninety five to two thousand\nTwo more to me has almost all of these old people believe we're supposed to leave the state during this difficult time\nWeek after graves endorsed Kelly soda GOP stalwart Nancy Kass a ball she represented Kansas for Seventeen years in the U.S Senate as a scope box promise to restore the comeback tax cuts convinced her go public\nTry so hard steadily let a lot of change\nA spokesperson for the Obama campaign dismissed the endorsements calling graves and catch up on quote tired has been Z and poured into this as the endorsement that matters\nI Want to introduce the next governor of Kansas Kris Kobach [noise]\nBoxes President Trump's initial endorsement delivered on Twitter the day before the primary might've been the difference maker and his razor thin victory over the incumbent governor and he's counting on the president's recent visit to Kansas to energize his base in the final weeks of a general election campaign that's coming down to the\nWire to put it simply I Want to do for Kansas what President Trump has done for America [noise]\nOh Joe ... virtually deadlocked that means that race could be decided by independent Greg Orman he's a wealthy businessman from the Kansas City suburbs who's hoping to exploit what he believes is widespread voter frustration\n'cause I traveled through the state of Kansas I find talking to Republicans and talking to Democrats up you know sort of a broad dissatisfaction with what's going on right now and the fact that we don't seem to be solving problems we seem to be having food fights\nIn twenty fourteen was no Democrat in the race or been through a scare into Republican U.S Senator Pat Roberts but this time around he's pulling in single digits even so says former Democratic governor Kathleen Sebelius that could be enough to tilt the race\nHe certainly can be a spoiler Greg Orman could elect Kris Kobach governor and less Kansas voters are paying a lot of attention\nPaying attention to the likes of graves and casual bum who were urging moderate Republicans in particular across party lines for Kelly NPR News I'm Jim McLean in Topeka and\n\nUh\nUm [noise]\nThis is NPR News [noise]\nJust ahead on the marketplace morning report a un find to combat climate change decided how it's going to spend one billion dollars projects all that fun help boost take a look at that and just under ten minutes but first\nDespite running against the Affordable CARE Act for years many Republicans are running ads saying they support a central feature of the law the requirement that pre existing conditions be covered more on that straight ahead I'm Sam Whitehead thanks for joining us on never supported Ninety point one W. A. B. E. Atlanta ... meets NPR\nSupport for W. H. B. E. comes from Kaiser Permanente wearing the integrated system of primary care doctors and specialist worked together as a team to deliver healthy outcomes and consistent care more at K. P. dot org Kaiser Permanente thrive Anne\nFrom Atlanta history center presenting the CIA BC private wealth management author series Carla Hall discusses her book Carla Hall soul food everyday and celebration on October twenty six at seven PM tickets at Atlanta history center dot com\nGot some areas of frost out there this morning should be clearing up by around nine AM today than these guys but hides in the mid sixties currently forty degrees in a clear skies here in Atlanta thirty nine in Marietta and south Bolton our time is seven forty three [noise]\n\n[noise]\n\n[noise] how has the mayor Andrew Gillum isn't the political side of his life he's running to be Florida's governor against former Republican representative Ron dissent his poll showed them in a dead can Gillum star power get him across the finish line will meets a mayor next time on one at\nThis morning at ten on Ninety point one W. A. B. E. [noise]\n\nHi I'm Dennis O'Hare host of the political breakfast pod cast on Ninety One WABC eat than Johnsen Brian Robinson and I want you to know we're serving up alive evening diner edition of the political breakfast timing couldn't be better Thursday November first at Emory University and joined us as we count\nDown the final days till election for more information and to claim your free tickets go to W. H. B. E. dot org slash community see their\nSupport for NPR comes from this station and from logged me in makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more it go to meeting dot com\nFrom Rhodes Scholar and not for profit offering learning adventures for adults and natural settings across the country learn more at R. O. A. D. scholar dot org slash retreats\nAnd from the ISI and the foundation at ISI MC foundation dot org\nAnti delight private delivering audit tax consulting\nAdvisory services tailored to the needs of growing privately held companies delight dot com slash us slash crime it\nOut Flagstaff, Arizona way a fellow used to be able to pull up with this horse get a tonic at the local saloon and forget the tribulations of city life\nAnd that was a bad in the last decade northern Arizona university has doubled the number of students on the Flagstaff campus and now the state wants to increase enrollment further to help with budget shortfalls like twenty twenty five the plan is for northern Arizona or to have thirty five thousand students that is a lot of growth\nFrom station kj ... Laurel Morales reports\nWhen Matt and Olivia Nick Reynolds meant as students at northern Arizona university more than a decade ago the Flagstaff population was around sixty thousand people since then ten thousand more people live here\nI remember the sticker shock of paying nine hundred dollars a month for her a one bedroom apartment\nAnd you had to sell your Suzie cheaper and the summer I had to get a job and we're all night\nThey moved away and came back twice because they love the mountains in two thousand eight the average rent was eight hundred and fifty dollars a month to date it's fourteenth Seventy a month\nI'm an attorney and I make decent money and it's puzzling that despite that this is what we were able to afford in Flagstaff this\nIs a tiny two bedroom rental for a family of five from where we're sitting on a ... you can almost see the entire apartment\nWe are around five hundred square feet and were pain over sixteen hundred a month\nIn addition to home prices locals also great about the traffic the parking and the threat of losing the quintessential charm that makes like staff unique\nSince the recession Arizona law makers cut university funding more than any other state to close the budget gap Mike Mitchell at the center on budget and policy priorities says many states did\nToday ten years on states are spending about seven billion dollars less on higher education than they were just prior to the recession\nMayor coral Evans says an alumnus of any you she lives in a home built by her grandfather just three blocks from campus so she has to deal with students partying at all hours but she says she couldn't afford to move if she wanted to you\nBecause with the growth of university came every Dick yours prices for the housing in the city with absolutely no relief\nSome community members have come up with solutions to mitigate the gross ideas like building a satellite campus buying more buses and encouraging students to get involved in the community so they care about it for marketplace I'm Laurel Morales in Flagstaff\nAnd a very big association of engineers has just started a certification program to encourage the tech community to\nBuild robots and artificial intelligence to do more good than harm marketplace dot org if you missed out on the air and I'm David Brancaccio was the marketplace morning [noise]\nATM American public media\nSupport for WABC comes from ... to pest management protecting Georgia homes for half a century from termites mosquitoes roaches and all critters if it ... or ... or day stop them inside and out B. R. E. D. A. ready to pass dot com and from Zan desk\nIts customer service and engagement platform connects companies with customers through email live chat and phone support all from one interface to be the company or customers want you to be learned more ads in desk dot com\nJust ahead on MORNING edition we'll bring you a conversation with Russian journalist Vladimir Pozner that had the Kremlin reacted to President Trump's decision to withdraw from a Reagan Era nuclear weapons treaty with Russia\nThat eliminated short and intermediate nuclear missiles or on that and just under ten minutes that after a check up some of the mornings top stories with NPR and W. A. B. E. newsrooms\nYou're starting your day in the new with MORNING EDITION of never supported Ninety point one W. A. B. Atlanta\nI'm Sam Whitehead or time now is eight o'clock\nGood morning President Trump says Russia as violating a nuclear treaty and the U.S plans to pull out [noise]\nSo what what Russia's next move\nSome allies including Britain stand by the president's decision although some analysts fear a new arms race I'm Steve Inskeep\nAnd I'm David Draine is our help me too movement has finally arrived in with a high rate of sexual violence again\nLater why the state of Georgia ... more than a half million voters from its voter and one way to treat depression and anxiety playing a team sport is Monday over twenty second happy birthday to Mitch over Modern Family Jesse Tyler burgers and turns forty friends\nNews is next\n\nLive from NPR News in Washington encore of a Coleman Mexican officials estimate some seven thousand migrants mostly from Honduras are crossing into southern Mexico they're trying to come to the U.S\nJames Frederick is with some of the migrants in ... Mexico he told NPR's MORNING EDITION Mexican officials have said they'll stop the migrants but they haven't seemed to do that yet\nI was walking with a caravan yesterday and then we went to a couple of miles because the Mexican police had set up a huge market with hundreds of riot police were worried that was going to be another clash and then a couple of minutes later\nMexican police lifted that blockade and the church and continued marching as a so so it's been hard to figure out how Mexico wants tours gonna continue responding to this ah they're still in very far southern Mexico or we don't know Mexico's going to try to use what we used to just stop this caravan\nJames Frederick reporting President Trump has threatened to close the southern us border is the migrants reach in\nThe Kremlin is reacting cautiously to President Trump's intention to withdraw from a landmark nuclear arms treaty NPR's Lucian Kim reports from Moscow the Russian government says it expects us national security adviser John Bolton to clarify the matter\nJohn Bolton arrived in Moscow over the weekend and it's expected to hold talks with high ranking officials including president flooding recruiting foreign minister Sergei Lavrov told reporters so far he's only heard about us intentions to withdraw from the intermediate range nuclear forces treaty putting spokesman said the U.S hasn't\nTaken any formal steps to exit the treaty that if it does Russia and other countries will be forced to restore the balance of arms treaty was signed in Nineteen eighty seven by then president Ronald Reagan and Soviet leader Mikhail Gorbachev restricting short and medium range nuclear missiles\nBoth Washington and Moscow have since accused each other of violating the treaty Lucien Kim NPR News Moscow\nFrance says the European Union will not accept a temporary measure to solve the issue of the Irish border in Brexit negotiations NPR's Eleanor Beardsley reports the ... waiting for proposals from London for a permanent solution\nNeither Britain or the European Union want a hard border reinstalled between the republic of Ireland and Northern Ireland\nBut they are in disagreement over how to proceed after Britain leaves the AAU Brexit talks have stalled over the issue the AAU wants to put in place to measure known as the Irish backstop\nThe backstop as a position of last resort meant to guarantee the free flow of people and goods between Ireland and Northern Ireland and the event that the u._k. leaves the AAU without securing and all encompassing deal\nThere is fear the resurgence of a border with identity checks could threaten the more than Twenty years of peace in Northern Ireland Eleanor Beardsley NPR News Paris\nThe national Hurricane Center says very powerful hurricane Wilma will make landfall on Mexico's\nPacific coast sometime tomorrow you're listening to NPR\nSupport for NPR comes from NPR stations other contributors include Jones Day and integrated partnerships collaboratively providing legal services for more than a century forty three officers five continents serving clients as one from worldwide learn more at Jones Day dot com\nFrom W. A. B. E. news in Atlanta good morning I'm Sam Whitehead so one hundred seven thousand people removed from Georgia's voter rolls and twenty Seventeen for not voting in previous elections that's according to an investigation from W. A. B. E. news and a P. M. reports\nMove over part of the legal process called list maintenance aren't voter purges Georgia is one of at least nine states was such a policy on the books will hear more on the issue from W. A. B. east Johnny Kauffman later this hour and MORNING EDITION\nOf searches on this morning for a suspect in a shooting that look ugly net county police officer dead this weekend that as a number of officer involved shootings is on pace to break last year's record here in Georgia does name Charlotte has more\nLast year there were eighty eight officer involved shootings according to the Georgia Bureau of investigation and so far this year there have been at least Seventy six\nToday policing when a county are still looking for Eighteen year old safari Maynard who fatally shot officer Anton toning he was shot when he checked on a suspicious vehicles near a school in ... Maynard is still at large and police say a second suspect is in custody he's charged with aggravated assault\nFor allegedly pointing a firearm at another officer after the incident when a county police say Toni was the fifth officer to die while on the job in the history of the department Tony has been with the department since twenty Fifteen this name ...\nBut really Grover a screenwriter and stand up comedian famous for poking fun at the establishment\nYou'll be ... maybe he has also been accused we are I was like look in our phone messages from four or five friends just shooting\nIt was a tweet within anonymous allegation that he had inappropriately touched the college classmate Seventeen years ago Grover denies it he\nSays he supports India's me too movement but he's upset that while investigative journalists vetted complaints against Harvey Weinstein and us in India the accusations have exploded mostly on social media where some of the accusers remain anonymous\nI understand the anger barred are the same time ... coming from a complete ban on you must have gone there drugs almost like fight being a voice\nGrover says he understands why many women choose to remain anonymous they're scared to go to the police and\nMore illiterate women sing a song about the beatings they've endured in ... in northern India\nThis is a world away from the urban elites and their meat to hashtags\nBut beyond that he did the news there struggle in Nineteen Ninety two she was working for her local municipality\nAnd it started a campaign against child marriage some powerful men in her village did not like it but to do what you said about um an Oakland they Debbie describes has three local men beat up her husband and then held her down to others raped her in an open field\nDebbie's case went all the way to the Supreme Court and led to India's first workplace sexual harassment guidelines in Nineteen Ninety seven\nBut most sexual assault in India is still perpetrated by relatives the neighbors not co workers or bosses\nAnd well Bollywood film stars and media figures have been at the center of India's me too movement sexual violence is most rampant and most under reported in rural areas where the majority of Indians still live only about a quarter\nKing cruises dot com\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep when it comes to healthy aging and keeping your memory sharp here's one idea you may not have considered get your hearing checked\nYour ears and beers Allison Aubrey reports a new study finds people who restore hearing loss with hearing aids actually slow down memory loss\nOf all the things that can cause friction in a marriage you might put hearing on the list that is until the person you love begins to lose it that's what happened to carry him loose in Johnson\nWas tired of screaming scream real out for him to understand that was bothering you yes it was drawing them approach you up and everything\nAnd her husband ... Johnson sell to to\nErdogan was calling because it does you ... you know what most just didn't hear what you're saying so Roger diverted which I won't go through those last\nSo a few weeks ago Lucy and Johnson was fitted with hearing aids and audiologist Dina Rawlins says as with many of her patients he's hearing is now better\nStimulating your ears stimulates the nerves that stimulate your brain so we're giving your ears back what they're missing and really given your brain what it needs to make sense of what you're hearing\nAnd here's another benefit that many people don't consider when you were store you're hearing a whole lot of living can come back\nSocial isolation is a huge part of of hearing loss and people will notice their loved ones withdrawing from conversation not going out to finally functions like they used to\nIt's not just the loss of social stimulation the latest evidence shows when people cannot hear well memory loss can set in faster peers dogs as an experimental psychologist at the University of Manchester in the u._k. he\nWanted to understand this better so he and some colleagues designed to study it included thousands of healthy older adults in the U.S\nI mean look at the trajectory decline in the memory performance a before and after they started using a hearing it\nThey did this through a series of cognitive assessments performed every two years for sixteen years the way it worked a research assistant would visit participants and their homes and give the test one was a word recall past\nThey have a list of ten for random words that read out loud to the ... better than us to recall the words immediately\nAnd then after a delay they're asked to recall them again ... says it turns out after the participants began wearing hearing aids their rates have recalls changed it wasn't a huge difference but it was measurable\nVery intriguing result I mean we weren't expecting that hearing it you would completely eliminate cognitive decline of ... not going to happen but what we've found is that it just slows the writer which cognitive decline proceeds\nSo many factors play into healthy aging and ... says good hearing can be one of them so it's important to understand the benefits Kerry and Lucy and Johnson said hearing aids have made a big difference\nWell he can you hear me now don't have the say yell real loud right or what do you like to bug them about getting up electric than be yet and get up to get a\n... [laughter] it was ... was\nLucy and Johnson is Ninety two years old and at this age it's a nice to have a problem you can fix Allison Aubrey NPR News\nOr millions of Americans suffer from depression and anxiety research shows regular exercise can ease conditions like panic attacks mood swings sleep disorders at a recent study shows that the type of exercise really makes a difference social Woodruff reports\nDemocrats and civil rights groups say that these voters don't show up at the polls as regularly as Republicans so to use it or lose it purges disproportionately affect those voters and they say they really this is a new voter suppression tactic Republicans are using to help them win and so what\nReaction has there been from voters I mean this is becoming a campaign issue and he's finally\nVoting has really become a central issue in the campaign here and we went to a rural southwest Georgia I and then visited a small town called Moultrie which is mostly black and Latino\nAnd voter turnout has really low there and we spoke to Reverend Cornelius ponder who's a community leader and he explains that low turnout is because of these obstacles devoting liked to purchase here's a clip of ponder from our story that aired on the pod cast reveal\nIt almost getting people to read mine said that this is a privilege not a right and so now anything that is a privilege as they get permission and so if you don't do our way we will give you permission to use it for ...\nAnd so when it comes to the purchase a ... was actually someone that was a root for not voting\nShe voted for Obama in two thousand eight she hasn't voted since then and she's thinking about voting for Abrams but unless you registered before the deadline earlier this month she may go to the polls and she won't be able to vote Georgia doesn't have same day voter registration like some states so the idea that this is creating a\nMindset that voting is a privilege to the idea that there is voter suppression I mean those are incredibly serious I'm Serious charges um\nWhat is secretary Kemp saying in response to to all of that\nWill Kemp points out that he's following the last year the Supreme Court has approved this use it or lose that policy they did that this year\nAnd he says you know the state sends out multiple notifications before moving these people\nHe says he hasn't been more aggressive and purging voters than other secretaries of state but the numbers show a big jump and people were moved a one point six million people since he took over that includes all rule so people who have moved our died and these people who have been removed for not voting\nAnd you've been following a lot of issues like this as as this election gets close right\nYeah there have been at least I I think for lawsuits filed in the last week over voting on the big one is over this policy that's disproportionately holding up the voter registration applications of people of color\nThose people can still do but civil rights advocates are worried about confusion and people getting discouraged um there's some ... a lot of absentee ballots that have been rejected in one county specifically\nAnd I you know this is a really close race they're few undecided voters both candidates are really trying to motivate their bases and they found that criticizing the other candidate over voting seems like a way to do that\nJohnny Kauffman from member station WBUR a B. E. Johnny thanks a lot\nYou're welcome a Chicago police officer who shot and killed a Fifteen year old boys six years ago will be returned to duty that is even after his own boss tried to keep them off the force\nThe Chicago police board made that decision it is a group of civilians appointed by the mayor and city council they get final say on police discipline it's one of many civilian police sports in this country\nPolice do not always like civilians peering over their shoulders this way but this civilian board routinely blocks that apartment from firing officers WB Xi's Miles Bryan reports\nRecently ... Edwards was feeling hopeful that the officer who killed her son would face serious conflicts\n... says in twenty twelve Chicago police officer brand Internet fatally shot decoded right on the city's south side\nTurn an says he saw the teen carrying a gun but no gun was found on his body last year an official investigation finally found the shooting to be not justified and the police superintendent move to fire return it\nBut earlier this month Chicago's police board voted to reject that conclusion Edwards says she had no idea it was coming [noise]\nHard because it's like [noise] they get like\nBaby my baby is go get some justice\nIn a written opinion the police sport said it found officer turn out to be credible when he said decoded bright made them fear for his life\nAnd where it says the decision was particularly painful to take because in a closely watched trial just a week earlier a jury voted to convict Chicago police officer Jason Van Dyke for the murder of another black teenager acquiring McDonald\nStanding on the residential block where her son was killed and ... says Boyce her son's age just don't have the luxury of trusting the police they have\nNo share a misleading with the\nYou are nothing when it comes\nThe ... case is not unusual from two thousand five to twenty Fifteen the Chicago police board voted almost sixty percent of the time to allow officers to police superintendent wanted to fire to keep their job instead\nBrian core heads the national association for civilian oversight of law enforcement he says well lots of cities have civilian oversight groups the Chicago Board the ability to overrule the police departments wishes\nMakes his stand out for a civilian oversight aged ... to have that power of the many oversight agencies around the country is relatively unusual\nInsured it's it's due process run amok ... teaches at Northwestern law school and is an attorney with the MacArthur Justice Center\nShe says the police sport which was created in response to a police scandal in the fifties has a reputation for protecting officers from discipline\nAccording to a department of justice investigation released last year the information that board members get to see about a case is unfairly skewed in the officers favor and the board members are political appointees who investigators say generally have had no background and policing or accountability\nIt's not set up to try to root out police officers who are engaging in an excessive force who are race as any use these tactics indiscriminately that's not what system set up to\nChicago officials are considering a number of reforms to police oversight one proposal would scrap the police sport entirely replacing it with an elected body but that's little comfort for pansy Edwards who still angry as she grieve the loss of her son muscle [noise]\nPeople wish cargo quite nobody means not light\nBased they may ... kilos\nThe Chicago police sport wouldn't make any of its voting members available for an interview but at the board's executive director says it weighs its own evidence\nAnd make decisions case by case for NPR News I'm Miles Bryan in Chicago [noise]\n\nThis is NPR News\nDo ... well\nJust ahead on the marketplace morning report we're approaching the first holiday season but don't Toys R us some lawmakers like has bro are jumping at the opportunity to fill the void as the biggest season and toys spending begins\nOn that and just under ten minutes but first comedian Julia Louis Dreyfus was awarded the Mark Twain prize for American humor at the Kennedy Center in Washington DC last night\nWe'll take a look at the ceremony straight ahead I'm Sam Whitehead thanks for joining us on member support it Ninety point one W. A. B. E. Atlanta\nOr ATM meets NPR\nSupport for WABC comes from ... tree specializing in tree work including disease treatments pruning hazard tree removal and\nConsulted serving in Atlanta since two thousand three your neighbors your or ... more at B. O. U. T. T. E. tree dot com and from blessing trinity Catholic high school in Roswell hosting an open house for prospective students and their families this Sunday from one to three splits\nAt trinity was named a national blue ribbon school of excellence more at Vicente Catholic thought for for the ...\nGuys today with high in the mid sixties currently forty degrees in a clear skies here in Atlanta thirty nine and ... street corners thirty five palmetto our time is eight forty three [noise]\n\n\nWe'll get a bit of it laugh at it in ... city lie\nBeyond this will ransom and bake a quartet violin is Jessica ... who\nWill join us to their upcoming performance at the world's most\nCelebrated venue the concern about\nI'm Lois bright Seuss joined me out of eleven AM mum doubled you may be\nPeople of color could decide Georgia's bitter race for governor but we'll all the obstacles devoting she'd them away from the polls\nThe reasons why there's no long no word holding their and I think that what we're trouble with\nFor years Democrats zebras and Republican Brian ... bought over invoked WABC reporter Johnny Kauffman spent money investigating voting in Georgia and you can hear our story today during all things considered ...\nSupport for NPR comes from this station and from the ... e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at a E. C. S. dot org [noise]\nFrom F Jaycee a foundation of donor advised funds working to maximize the impact of charitable giving and to create customize philanthropic solutions learn ... J. C. dot org and from the listeners who support this NPR station\nOr self driving car has to decide whether to protect occupants or bystanders in some crashes and artificial intelligence could discriminate against women job applicants a story we covered the other day\nA powerful trade and tech organization the Institute of electrical and electronics engineers they just come up with a new ethics certification process it's designed to help engineers make technology that on balance helps rather than hurts\nAnd his transparent about the assumptions built in John Havens is executive director of this artificial intelligence and robot ethics project thanks for joining us\nMy pleasure to be here this is about what a putting human needs first\nWhen it comes to autonomous robots self driving technology was being a\nJournalist sort of an idea of a contract when you buy a piece of technology and the expectation is it will be safe and all that but with autonomous and intelligence systems there's just new things that\nPeople have to understand her trustworthy so for instance as engineers work\nOn autonomous vehicles self driving cars and trucks they have to program in different preferences of self driving car has a choice of saving the occupants of the car and an impending crash but at the expense of killing pedestrians would\nCertification program demand that we know about that particular choice\nThe logic is to write out all the potential scenarios that could happen but right now a lot of times those conversations happen outside the context of how many humans unfortunately are killed with cars is they are right now\nBut the way the technology answers that question is that something that the sort of a Geisha process wants to know more about or wants to the end user to know more about\nIn the sense I'll give you an example it's more of a cultural thing recently autonomous vehicles were tested in Australia\nAnd the lidar the technology that's used to sense surroundings hadn't been programmed to recognize kangaroos [laughter] so the big kind of like bouncing jumping around motions weren't recognized whereas like squirrel dirt emotions were recognized\nBut the point is is that you have to ask even more questions than you had before when you have these new types of technologies and then actually goes back to safety it's just a different type of safety question than some people may have asked before\nAs the technology advances it requires human beings to decide what are our values and what our values in different countries you have to actually define them and be aware of them\nAll ethics questions oftentimes especially in western media is coming from a Greek background of ethics whereas when we have the entire other side of the planet and the global south has things called Confucian ethics or a boon to ethics and it's a reframing of the paradigm that's how we come to these questions\nAnd so it's when you ask those questions that much more this is where the word safety your trust can really be elevated to more global levels and that's what I Believe about consensus building globally is to say we don't know we don't know yet but we have to ask\nJohn Havens is one of the architects of the ethics certification program for autonomous and intelligence systems\nOf the eyes Tripoli John ... thank you my pleasure\nYou also wrote a book called artificial intelligence that new ethics certification also addresses wider economic effects from New technology and pushes for openness about potential economic winners and losers more of that interview was posted in marketplace dot org I'm David Brancaccio with\nThe marketplace morning\nEight PM American public media [noise]\nStay with us just ahead on MORNING edition President Trump is telling his own job performance while campaigning about the dangers of illegal immigration [noise]\n\nMore on Trump's efforts to help Republicans in the mid term that's up in just about Fifteen minutes\nThis is MORNING EDITION a ... point one W. A. B. E. Atlanta support for WABC comes from the Carlos museum presenting an odyssey a father a son and an ethics a lecture by author Daniel Mendelssohn about experiencing homers masterpiece with his father Thursday October twenty fifth Carlos dot ... dot edu\nAnd from Kaiser Permanente were members can see a doctor and get a lab test and pick up medication all in one connected system delivering healthy outcomes and consistent\nCare more at ... dot org Kaiser Permanente thrive\nGood morning Georgian public school start the year so early that for some kids summer's over at the end of July now a group of state lawmakers is looking at changing that we'll have more later this [noise] It's MORNING EDITION on members' support in Ninety point one W. A. B. E. Atlanta ... meets NPR News\nI'm Sam Whitehead thanks for joining us this Monday morning Monday is off to a great start\nOff of this hour the killing of Saudi Arabian journalist humongous show genes and the reaction to disrupt the middle east and us relations with Saudi Arabia [noise] look at the latest many Republican candidates have warmly welcomed President Trump to campaign with them before the midterm will consider how that's playing out in Texas\nAnd friday black a collection of dystopian short stories on America struggles with race last similar as I'm Talking with the book author\nBut first we'll check in on some of the morning top stories from the NPR W. A. beans or [noise] or time now is not a one\n\nLine from NPR News in Washington encore of a coal miner walking caravan of several times\nCentral American migrants he's making its way through southern Mexico reporter Emily Green has been traveling with them as they had for the U.S border\nThey care that took off at five AM from the southern Mexican border many of the migrants had been walking over the last week from Honduras although others were already in Mexico the goal was to make it twenty miles north to type a true law by today and it was sweltering hot\nStill thousands of migrants continued forward moms breastfed their babies as they walked that pushed strollers three year olds put one foot in front of the other despite at are exhausted ...\nI was walking with a five year old daughter she and her family had been traveling for three days from Honduras family at\nThe federal she says she wants to reach the United states God willing but if not she will stay in Mexico and work for NPR News I'm Emily Green ... Mexico\nPresident Trump tweeted last hour he's alerted the border patrol and the military that the caravan as a national emergency and he's demanded than unspecified laws be changed\nEarly voting starts today in some areas of Florida that includes eight counties in the states panhandle from member station WFSU Lynn had her reports hundreds of precincts in these counties were damaged or destroyed by hurricane Michael\nVoters can start casting ballots as soon as today and the eight counties most affected by the storm they can also request mail in ballots and raining or over the phone and those ballots can be sent to address as other than the ones on file\nThe move is meant to help county elections supervisors and voters still grappling with this locations mighty communication and infrastructure damage\nLynn had her reporting the president of turkey has spoken with President Trump about the death of a Saudi Arabian journalist episodic consulate in Istanbul NPR's Peter Kenyon reports the Turkish leader says that tomorrow he will reveal the naked truth about the case\nPresident ... spoke with Trump by phone and state media said the two leaders agreed that all aspects of journalists ... death must be clarified\nHaired one has so far not blame Saudi Arabia the investigators have said could show was killed in the embassy and his body disposed of\nBut everyone says he'll talk about the subject in detail during a political address Tuesday\nThe Saudis story of what happened to the show gee has changed multiple times on Sunday the Saudi foreign minister told Fox News channel that the killing was a huge and grave mistake but said it wasn't ordered by crown prince Mohammed bin Salman Peter Kenyon NPR News Istanbul\nNATO says that us brigadier general Jeffrey smiley was wounded last Thursday in a Taliban attack in Kandahar Afghanistan he was attending a meeting with top Afghan leaders when militants open fire they killed the powerful provincial police chief and intelligence officer It's NPR\nSupport for NPR comes from progressive insurance offering or weights or by home insurance with their home quote explorer tool custom quotes in rates are available online learn more at progressive dot com or one eight hundred progressive now bats progressive and the corporation for public broadcasting\nFrom W. A. B. E. news in Atlanta good morning I'm Sam Whitehead\nThe second week of in person early voting for next month's midterms elections gets underway today voters went to the polls in droves last week to cast early ballots some five hundred Twenty one thousand early votes have been cast so far during the last midterm elections and twenty fourteen only about one third of that number of early votes have been cast by this point\nThat according to the website Georgia votes which crunches state voting data\nEarly voting runs through November second for information on when and where you can cast early ballot check with your counties elections office\nCivil rights groups are asking a federal judge to order Georgia to change how it handles voter registration problems at the polls Johnny Kauffman has more\nGroups want an emergency order before the midterms it's part of a lawsuit over a policy that hopes voter registrations if they don't exactly match other government records if someone's registration is why they can still vote by bringing their photo ID but in some cases they may need to provide proof of citizenship\nRight now county registrars look over that paperwork but at the civil rights group said that takes two\nAnd poor workers should be able to do it themselves saving time for voters Johnny Kauffman WABC news\nOf course that same comment had him one hundred percent against Hillary Clinton now Trump is president Heller is on the ballot and well here is this past weekend this president is doing a great job [noise]\nAt ... at a rally in the town of El Loco Nevada it's a place known for its gold mines and Heller talked about gold as Trump's nearby onstage nodding approvingly\nOr president you know a little bit about gold in fact I think everything you touch turns to go [noise]\nFor his part Trump made sure people knew that hell or has been there for him in the Senate especially with Supreme Court nominations\nBy the way I have to thank Dean Heller for helping us with justice Gorsuch and justice Kevin\nNow to Arizona and another GOP candidate who once kept Trump at arm's length congresswoman Martha mix Sally she is in a tough race for an open Senate seat mix Sally a former fighter pilot was at Trump's side as he toured an air force base on friday\nAnd again later at a big outdoor rally here is the president\nOffers a veteran or great veteran a great fighter a warrior and the first female fighter pilot to fly combat missions in American history thinking that she's the first [noise] of\nCourse you never know exactly what the president will say once he comes to town you can spend more time talking about his own election in twenty sixteen when he does on getting out the vote in twenty Eighteen in Montana just days ago he promoted the Senate candidacy of Republican Matt Rosendale but\nGot far more attention for what he said about another local politician congressman Greg gene forte he is best known around the country as the guy who body slammed of journalists who was attempting to ask him a question last year in Missoula Trump's celebrated that attack by the way never wrestle him\n[noise]\nAnd I get your body slammed Mike [noise] which brings us to tonight in Texas Senator Ted\nCruz has long since made up with Trump after they waged an ugly battle\nBoth political and personal for the ... presidential nomination back then after Trump denigrated his wife's looks in a tweet Cruz responded with this\nI don't get angry all [noise] but yet mess with my wife you mess with my kids that'll do it every time Donald your sibling or leave it alone\nDon't expect any such talk tonight as Trump and cruise shared the stage no mentions of lion tad\nSome playful references to pass differences perhaps but outwardly at least two politicians happy to be supporting one another hoping to stave off a challenge to cruises reelection all with the purpose of hanging onto slim GOP control of the u._s.\nDon Gonyea NPR News\nThis is NPR News [noise]\n\nJust ahead on MORNING edition Georgia's public schools ... so early that for some kids summer's over at the end of July\nState lawmakers are considering changing that we'll have more in just about twelve minutes\nBut first while Taiwanese electronics giant Foxconn is building a factory in Wisconsin It's also looking to use its resources to modernize that states ginseng crops which Wisconsin farmers selling the Asian markets will have more on that effort straight ahead\nI'm Sam Whitehead thanks for joining us for MORNING EDITION on never supported Ninety point one W. A. B. E. Atlanta for a deal meets NPR hope you're Monday morning is off to a great start support for W. H. B.\nE. comes from community foundation for greater Atlanta a trusted partner with financial advisors to help their clients make a lasting community impact biased abolition customized philanthropic solutions with an immediate tax benefits she of greater Atlanta dot org\nWill have sunny skies today was hides in the mid sixties currently forty one degrees on a clear skies here in Atlanta it's forty in Johns creek and Peachtree city or time is nine twenty [noise]\n\nUnder Republican Brian Kemp Georgia has put a new obstacles devoting all in the name of stopping fraud now camp is accused of voter suppression\nThe best way to stop people from even trying to about let them know they're not welcome\nAnd make it hard Kennedy's running for governor against Democrat Stacey Abrams I'm WABC reporter Johnny Kauffman we spent months investigating voting in Georgia and you can hear our story today during all things considered\n\nSupport for NPR comes from the station and from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with the male temp bullets that drag and drop email editor and twenty four seven customer service Morris campaign monitored dot com [noise]\nFrom T. I. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more it T. I. S. S. dot org\nAnd from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep Afghanistan voted over the weekend or most of the killings of top officials in one major province forced to lay there but the rest of the country cast ballots for parliament Pamela constable of the Washington Post joined us on friday just before the voting and now she's back I Pam\nHi how are\nYou okay thank you very much what was voting day like\n[noise] ah well it was a it was pretty chaotic every polling place I visited the capital and that narrative falling prices across the country I reported on a large problem with\nThat gets organization unprepared polling shows last material a biometric equipment that didn't work\nVery very very long lines um many at the polls three four five hours late rounded not open at all so it was um a well intentioned effort\nBut the results were were pretty\nChaotic um use your clear that enough ballots were casting a legitimate way that this will feel like a legitimate result\nThat's a good question and I can't answer it yet because as you mentioned um you know a large number of voters and one province Kandahar where there were serious killings in the past few days has a\nHas been delayed for one week and it affected province staff they were there had been recent attacks as well that already has also been delayed so you've got two provinces a where the voting hasn't even happened yet\nAnd you also have a dozen or possibly even hundreds of polling stations both an accountable and elsewhere where people had to vote yesterday a second day of voting because the poll never opened a\nOn on election day itself and election officials say they're not going to be any uh any results or of any of any significance for weeks and possibly even for a couple of months\nWell so we have no idea who won these elections in ... given the they're not even quite over but\nLet me ask about what the winners will face we should note people know from a distance that Afghanistan has had a very powerful president to the extent that it's had a central government at all and of course a lot of decisions\nIn some cases are in the hands or influenced by the United states influenced by allies or her for that matter influenced by the Taliban which controls portions of the country will this parliament once it's seated have much to say what were the Robie\nThat's also a good question I I I think and I and I hope I'm at the country and for change when I was reporting\nFrom the campaign interviewing candidates and ... voters\nI found an enormous amount of a surprisingly large amount of it going to the present and hope that this election actually bring change in parliament itself\nA young people voting young people running a more educated people voting and running a and a lot of hope to sort of out with the old faces and with the news so I think I think there is still hope for that\nPamela constable of the Washington Post always appreciate your insides thanks so much they are very welcome she's into\nAn unusual alliance is shaping up between Foxconn that global electronics giant the building in a norm is plant in Wisconsin and some farmers in the state who grow the medical route ... from member station W. W. M. and Milwaukee Mayan silver reports\nPretty much unavoidable that my work um engages subjects that are highly politicized I think that\nMost identities or where they intersect with the culture that they come out of 'em there's this this politics involved sometimes just existing in space and proudly mildly is somehow political so I think um if you write fiction\nAnything that's not a vacuum on some level I think it's political and so because no one who writes in a vacuum and no one comes out of a vacuum you're kind of doing some of the political and if you and I think it's a great privilege to think you are not\nMany of your stories are are filled with brutality but there is also a wide vein of dark humor running through some of them which I think might surprise people this story that gives you a book it's titled friday black\nThis short story takes place in what we assume as a department store\nAnd it's a it's a Black Friday the Friday after Thanksgiving which we all know is is kind of a nightmare of consumerism your protagonist as a young man working in the stores selling fleece jackets\nYou have these just vicious scenes where people consumers shoppers storm\nThe entrance of the store and\nThere are so overwhelmed at the idea of getting a deal that they trample each other they when they trample each other to the point of death they they show bodies out of the way that is a heck of a way to look at at Black Friday what were you saying there\nTo talk about the humor in it for me it's important to\nTry to laugh when you can because\nI think it's healthy but also I think for me it's a way to help me\nSay exactly what I wanted to say because if I don't add some Lebanese um humor I probably won't get through on some level for the reader I think it's like the sugar it's health and medicine go down sometimes um you kind of get to a story where there's like ... the state of humor and sometimes I think the punch line is it actually wasn't a joke after all but with on that story fraud a black\nI did work in retail I really have seen a like a woman step one another woman's like cash for genes um we all know for a fact that pretty much annually someone gets killed because people in Wal Mart or trying to get TVs in my mind the first time that happened everyone the country the world to the ... will will will will\nYou know maybe we've I'm taking this thing too far but it's that's a scary thing for me to think about what's scary to think how how we can know that happens so regularly is still sort of casually participate\nYet the main character in that story and friday black as a young man who wants to get the sales record because he will win a prize and the prize is a code that he intends to give to his mother\nAnd at one point to a colleague it in the unmanned can find some and says you know seeing seeing the body string about hearing the yelling and screaming he says this this is just not worth it your mother knows that you love her she doesn't need a cult\nAnd you know what's what's funny about that moment and I didn't have that moment ... ... if you can believe that originally no really like the original draft and surprised I\nYeah and actually I'm prior to the book being called friday blackout a previous title and after I made that editorial change after Ira buys it and made that moment I was\nFinally like okay this this can be the title of the book because you absolutely need that moment to moment of self implication in which the somebody said like you know you think you're not in this but you are and to just the same line of logic I'm going to participate in this craziness\nBecause I'm going to get my mother a thing and the ... and again for me is important because like I said I really didn't work in retail there was a contest my stores that are getting more money or something whoever's made the most sales we get um a north face jacket [noise]\nAnd I got it from my mom I really did wow I really did do that and um\nYou know I don't know that she wears it any more\nYou are the the sign of of immigrants from Africa Africa yes both my parents are from Donna how how do you think that informs the way you see race in the United states and in particular racial tension which makes up so much of of your book in in the United states\nI'm sure it informs me and a lot of ways I Can't even really perceive you know my parents are they're very decided we um they're African got me in and they would sometimes even ... I had a built in thing that I have to work doing sort of just about\nEven my distinction from black Americans which they were like you know you're not from here and I don't think you can act like these people here\nAnd because of the way I started again in Queens New York I was I I understood you know block is different and all you know for because of the way like the sort of pride associated with it\nMy parents come from and I didn't have to default to a feeling of\nWhite is the best which I think is really hard to escape and America and you mentioned something before like some of my characters [noise]\nA lot of them it's explicit or by some of them they're not but in my mind they're all black you know I don't accept the sort of white ... in in the world they almost like if you don't say they're black or white\nI definitely like sort of tried to resist that and especially because in my eyes to his son's often the way their races revealed his do some type of traumatic incidents happening because of their race and I don't want that to be the case where I'm readers are owning seeing characters that are of color\nHaving that matter of fact in some kind of pain of trauma for them [noise]\nNone of climbing Ajay ... thank you so much for coming in to talk today we really appreciate it I appreciate it thank you so much [noise]\nThere's no short story collection is called friday black [noise]\nAnd this is MORNING EDITION from NPR News I'm Steve Inskeep and I'm David Greene [noise]\n\n[noise] Hi I'm Dennis O'Hare host of the political breakfast podcast on Ninety One WABC eat than Johnsen Brian Robinson and I want you to know we're serving up alive evening diner edition of the political breakfast timing couldn't be better Thursday November first at Emory University so join us as we count\nBound the final days till election for more information and to claim your free tickets go to W. H. B. E. dot org slash community we'll see you there [noise]\n\n\nJust ahead on the marketplace morning report and un fund to combat climate change decided how it's going to spend ... billion dollars but project so that fund to help support will look at that just under ten minutes but first despite running against the Affordable CARE Act for years and the Republicans are running ads saying they support a central feature of that law\nThe requirement that pre existing conditions be covered more on that straight ahead I'm Sam Whitehead thanks for joining us I'd never supported Ninety point one W. A. B. E. Atlanta or a T L meets NPR\nSupport for WABC eat comes from Comcast Business providing a gig speed network that helps business get done Comcast Business beyond fast learn more at Comcast Business dot com\nAnd from Karen in Atlanta and assessment is the first step to figuring out if the problem is addiction or something else Karen Atlanta real about recovery C. A. R. O. N. dot org slash Atlanta\nWe can expect sunny skies with ties in the mid sixties today currently forty four degrees and a clear skies in Atlanta it's forty two and Clark spending thirty eight and ... our time is not forty three [noise]\n\n[noise]\n\n[noise] ... the mayor Andrew Gillum isn't the political fight of his life he's wanting to be Florida's governor against former Republican representative Ron dissented polls show them in a dead can Gillum star power give him across the finish line will meet the mayor next stop on one ...\nThis morning at ten on Ninety point one W. A. B. eat [noise]\n\nAcross the country colleges are beginning to offer students nor can in case they need to reverse an opioid overdose\nWe felt that he was on the university to provide the because it's a life saving drugs and we're in the midst of an epidemic affects every but others question if it could\n... story plus the fallout from Jamal 'cause she'll gee staff this afternoon on all things considered from NPR News from four until six thirty a Ninety point one WABC\nSupport for NPR comes from the station and from the ... Family Foundation supporting shattered proof a national nonprofit dedicated to ending the devastation of addiction and transforming treatment in America learned more it shattered proof dot org\nFrom capital one offering a variety of credit card options with features for a range of customers from ... to travelers capital one what's in your wallet credit approval required capital one bank usa NA and from the listeners to support this NPR station", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Atlanta", "day": "22"}