{"month": "10", "state": "GA", "station": "WABE", "content": "Are Arlene I'm uninsured or you translate to some cable bizarre roses into which languages\nYet I translate Korean K pop song from Kerry into Chinese so I may have translate tests on somehow\nAnd how popular is crippled for insurance\nIs extremely popular like um nowadays the\nHighest paying after saying in China or\nWas it was that two men one called ... through and one is called Lou Hans both of them are former K pop I joke remember they just create the grip and and now they're extremely popular in China and become the pop star\n... wants to view is the appeal of march using just how the excesses becoming more global bar for the week\nUh like glass that is it the music itself will cause and another\nAspect I Would think that it is a parent as a style of Cape upstart as the iconic style of a case of ... they had died in the ... and really fashionable costing and also doing make up\nSo I think ... actually is creating a new kind of sexual ... new kind of ... I Do in many countries that is a ton of ... to them dominant culture\nOr clerk was about to be here for a very huge [noise]\nShe knew what I mean to put\nTo put it into was quite difficult they've just\nNailed it I mean it's it's not just about them is a group it's the songs the songs are undeniably grades\nAnd ... is finding the hits if you don't have hits you know going to have a successful career and they managed to find great songs with and they they they match with great choreography grace styling fantastic music videos it's just a complete package and they go\nWhen people say that you ... ... they've got it\nFor her for go the X. box or support I certainly have the exactly they definitely have the X factor\nTrying to get a quick fund a word from Eileen I mean for for for South Korea how in ... in terms of culture\nWithin South Korea yeah of course it is now a national industry like the major export cultural ... but\nBut don't even have something for young people do I mean is it important ... in that sense\nYes they'll cut because ... is based on that a patient a fan like salads and campaign and support from the fans so um I think you create a kind of PA attachment to the young people nowadays unquote\nObsessive judging by some of the fans in the state will have to leave that riling Sherman clump Rodrigues Lee will lead will leave you with a little bit of a beef yes that is it for this edition of world up to me [noise]\n[noise]\nThis is nine point one WABC Atlanta\nWe're ... meets NPR [noise]\nYou need facts understanding in context and that's what you get from Ninety point one here's something else you can get a one year digital subscription to the New York times\nIt's yours with an early donation at ten dollars a month to W. A. B. E. but once the member Dr starts later this week the New York times thank you give jumps to Fifteen dollars a month so please make your early pledge now and she lives in New York Times at W. A. B. E. dot org slash donate thanks\n\nGood morning less than a month for the midterm elections Democrats and Republicans have at least one thing in common they want to get their voters\nEnergized in the polls in November\nComing up on MORNING EDITION from NPR News hurricane\nMichael is headed for Georgia will take a look at the potential impacts of that storm at six so for\nGood morning I'm Sam Whitehead\nWas the Democratic strategist whether his party can gain it's enthusiasm advantage back after the appointment of justice Brett Kavanaugh of David\n... and I'm Noel King also this hour the curious case of among among the way he was the president of Interpol the international law enforcement agency now he's contained in China and being investigated for a variety of crime and in Alaska ballot initiative that wants\nHits fishermen against the oil and mining industry\nTo stamp overnight filmmaker Guillermo del Toro fifty for today and the news is next\nLine from NPR News in Washington I'm core of a Coleman the newest justice of the U.S Supreme Court will be on the bench this morning when the court hears oral arguments NPR's Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in for Brett Kavanaugh at the White House\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind him and he promised to serve in a non partisan fashion\nI was not appointed to serve one party or one interest but to serve one nation\nWell Kevin O's remarks were conciliatory President Trump's were not drop blasted Democrats for a campaign against Kevin all he called dishonest and deceptive the president thinks ceding the new justice will give a political booster Republicans in the mid term elections Scott Horsley NPR News Washington\nThe national Hurricane Center says that hurricane Michael is moving north in the Gulf of Mexico and aiming for the Florida coast forecaster John ... says Michael's top sustained wins or Ninety miles per hour\nIt's gonna be likely to make landfall in the Florida Panhandle of Florida Big Bend area during the day Wednesday that is our current\nUm and it's likely to make landfall as a major hurricane so that's category three or stronger or on the scale\nHurricane Michael is projected to then blow north across Florida and into Georgia and the Carolinas tropical storm watches are posted from the Florida Gulf Coast north to South Carolina\nThe international Monetary Fund is cutting its forecast for global growth NPR's Giles Snyder reports the IMF blames rising interest rates and trade tensions\nThe IMF has revised its forecasts from July when it said the global economy would grow three point nine percent this year it's now cut that down a couple of nachos downgrading expectations for this year and for twenty ninth team the IMF now says the global economy will grow at a three point seven percent clip\nThe IMF loved us economic growth on change for the rest of this year but cut the U. S. is twenty Nineteen forecasts to two and a half percent because of the trade tensions with China\nThe revisions to the global forecasts was issued on the resort island of Bali as the annual meetings with the IMF and World Bank get underway this week ... NPR News Washington\nThe south Korean government says North Korean leader Kim Jong un wants Pope Francis to visit North Korea\nThe south Korean presidential office released a statement saying Kim told diplomats that the pope would be enthusiastically welcomed in North Korea the president of South Korea is expected to deliver that formal invitation to the conscious during his scheduled visit in Rome next week\nNorth Korea it strictly controls religious expression in that country Kim has seemed to welcome diplomatic engagement this year meeting with South Korean officials and President Trump\nThis is NPR\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more at campaign monitor dot com and Americans for the arts\nFrom W. A. B. E. news in Atlanta good morning I'm Sam Whitehead\nAs we just heard from NPR hurricane Michael is turning towards the Florida Panhandle the national Hurricane Center says metro Atlanta could start to see isolated thunderstorms related to that storm this afternoon and tonight\nStrong winds and heavy rains are expected in Georgia Wednesday afternoon into early Thursday morning now meteorologist say the track of the hurricane could still shift in effect the amount of rain and wind speed the category one storm is about four hundred miles south of Panama City Beach Florida\nThe nation's housing agency wants to know why more landlords don't accept government funded vouchers so it's asking Stephanie stokes has more\nSection ... vouchers help low income tenants afford rent but a recent report from the Urban Institute found many landlords reject voucher holders before even meeting them to find out why the U.S department of housing and urban development is doing listening sessions around the country\nAnd Atlanta southeast regional had Denise Cleveland leg it says a big concern she's hearing is red tape\nThere are a number of rules and regulations that they'd like to see loosened our changed in order to bring about a an more of an easy to do the housing choice vouchers\nThis year's confrontation actually started with a farming fiasco last year the company Monsanto which is now owned by Bayer rolled out a new way to kill weeds it told farmers we've created some special new varieties of soybeans and caught and they can tolerate a weed killer called dicamba\nSo you can spray dot camera and the crops will be fine but you're weeds will die Terry Wohlers a member of the Arkansas state plant or kind of the pesticide police honestly I don't think anybody\nIn the whole world dreamed that ... could create such a nice you bring so many farmers against farmers\nThat gamut in stay where it belonged to drifted across the landscape been injured millions of acres of regular crops it was especially bad in Arkansas farmers who sprayed dicamba loved it but Terry fuller and the state plant board decided the collateral damage was unacceptable I talk to them about it last year\n... best known your neighbor and your friend that's not my definition of good for business\nSo the plant board passed the most dramatic limits on dot camera in the whole country no die campus spraying during the growing season this summer I called Terry fuller back see how it was going and he told me it was happening again thousands of acres of crops damaged also trees in people's yards this was not supposed to happen this year\nNot supposed to happen this year ... just been a sad situation and um you know really an unbelievable situation\nThe plant boards investigators tried to catch the outlaw farmers inspectors drove country roads looking for dying weeds that looked like they'd been sprayed with Ken Buck took samples tested them\nIn at least a couple of dozen cases they found the band chemical those farmers now could face fines at least a thousand dollars possibly twenty five thousand dollars per violation\nI talked to a couple of those farmers and some of their supporters\nThey did not want me to record those interviews or use their names they told me spraying dicamba was a business decision some of them think Monsanto's dot camera tolerant seeds will give them a bigger harvest one said spraying dicamba is the only way to survive\nA couple of them said paying the fine is cheaper than fighting weeds any other way and by defying the band they're putting enormous pressure on the farmers who are farming by the rules like Ted now\nPersonally I don't believe in spraying dot camera I think it's too dangerous to spray I mean anybody that says otherwise is dreaming\nSo he didn't plant those new die Campbell tolerant crops he got rid of weeds with other chemicals\nAre you not one drop but ... says it can't be done it's a myth\nAnd then he solved the leaves of his soybean plants curling up I can but had blown in from some other farmers field\nDo I go out and try to which people and find out I'm not doing that but I have the legal right as a farmer to keep a crop that is not damaged by somebody else's sprayed\nThat legal right may not be enough though if other farmers insist on spraying dicamba he may have to also plant those new dot camera tolerant soybeans because they won't get injured\nAnd then he'd be tempted to spray dot camera to\nDan Charles NPR News\nAnd this is NPR News\n\nJust ahead on MORNING edition today is the final debate of registered to vote for next month mid term elections\nOne more on that and just about twelve minutes but first Interpol is president has resigned after being detained by Chinese authorities who accused him of corruption\nIs the latest string of detentions of influential people in China will go there for a look at the latest straight ahead I'm Sam Whitehead thanks for joining us for MORNING EDITION on member supported Danny point one W. A. B. E. inland\nSupport for WABC comes from Georgia Power committed to being citizens wherever they serve Georgia Power employees volunteered over one hundred forty seven thousand hours of their own time last year alone details that\n... power dot com slash community and from Colorado State university global campus and online State University offering career relevant bachelor's degrees master's degrees an certificates of completion learn more at sea su global dot edu [noise]\nTaking a look at the weather for your Tuesday a chance of showers and thunderstorms with allies will have most of the sky the highs and the low eighties we've got Seventy two degrees that are cloudy skies in Atlanta it's Seventy one in Alpharetta in Seventy three and cell phone or time mystic twenty [noise]\nToday's immediate environment is complex to say the least but you get context when you listen to Ninety point one and here's something else you can get when you become an WABC donor I did do subscription to the New York times when you do so before the member Dr starts it starts\nWith a pledge of ten dollars a month\nAfter the dry starts then it jumps to Fifteen dollars a month so stay informed and pledge well right now at W. A. B. E. dot org slash donate thanks\nSupport for NPR comes from the station and from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom Harvard Business school executive education for executives said any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot any slash executive\nAnd from it less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work\nBetter together more at at ... dot com\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King until recently the head of Interpol the international police organization based in France was a man named among Hong way he's from China\nBut in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol\nI talk to NPR's Shanghai correspondent Rob Schmitz and asked him what do we know about my\nWhole ... hallway is sixty four years old he served as the vice minister of public security bureau which is China's national police are in twenty sixteen\nHe became the first Chinese head of Interpol and there's an election was a big victory for China's government which under leader Xi Jinping was eager to use Interpol to locate an extra day Chinese officials at it deemed corrupt would escape China\nBut as it turns out among himself is now under investigation by Chinese authorities for corruption\nWhat exactly are they investigating him for\n[noise] what China's government has been released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how is the tension unfolded has come from his wife ... an September twenty fifth\nThe day her husband arrive to China for a visit she allegedly received a text from him that said wait for my call which was followed by in a mood to even nice fish suggest that she was in danger a week later she reported missing to French police on Sunday she spoke to reporters and we own friends wearing trouble is headquartered and here's what she said\nWe had to go in and you know when I'm speaking on behalf of my other than my children on the people in my mother for all the wives and\nChildren's husbands and fathers so they may no longer disappear\nAnd as you can hear in that tape now while she's crying during this part of the video with their back\nTurned to the camera because she's received threats and is under protection by French police well\nWhen she talks about the husbands and fathers who disappeared in China what does she mean\nWell she's talking about the government anti corruption campaign was launched by shooting paying immediately after he took office in twenty Thirteen and it snowed hundreds of thousands of FIFA officials both on the local level as well as among the highest echelons of the party in fact the man who appointed Malone way to vice minister of public security\nJulian Kong the highest ranking Chinese official who was brought down by this campaign Joe was a former member of the politburo standing committee the group of seven men who rules China he was trying to security czar before he was sent to prison for life and twenty Fifteen\nRob by removing money from the presidency of Interpol China loses a lot of sway within that organization that much is clear what does this mean for Interpol well even\nBefore this happened China's use of it are all under amongst presidency was starting to raise some red flags earlier this year China tempted to issue a red notice that it's an international alert for wanted person\nFor an exile weaker activists were yours are mostly Muslim ethnic minority who live in northwestern China who China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with lung is a good example of how China's messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob Dexter\n\nAcross the United states more criminal courts are turning to video proceedings this isn't an effort to save time and money that happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology\n... ... email address all that data could have been available to outside developers if basically if your friend had signed up\nTo some Google Plus at those developers potentially could have gotten access to this data\nThe number to potentially affected ... number is abuser is small it's only about potentially half a million users which in the world is kind of potential data breaches that is not a member of the real questions that are reporting focused on our kind of what Google did\nWhen did find out this this this uh you know the security patch flawed existed or didn't\nDo right I mean they they didn't go public and let people know that that their privacy might have been at risk why\nYeah so there's sort of the story that they're telling which is they took a look at what happened they investigated these apps to some extent\nThey found that there was no suspicious activity and they decided that there was no evidence of a misuse of data so they had no obligation to tell you users\nBut our reporting shows that there was another factor at play which was they were worried about the repercussions of coming a forwarded this information or you know earlier this year right right of the time they discovered this the face but Cambridge Analytica data breach and just happened um there's a lot of regulator scrutiny of\nFacebook and tech companies and how they're handling data and internally they were worried about being pulled into this conversation in a bigger way ... what\nHave they responded to your reporting and I I guess also they said anything about how they might prevent this from happening in\nThere they took a pretty drastic step which is they now you said earlier they ... they announced they're closing the consumer side of Google Plus which is pretty big stuff there also taking ...\nSteps to kind of rain in\nA some data privacy potential problems or they make a lot of data available to outside developers on an Android phones for things like ... there are there are a lot of\nDifferent apps that can you can use to to and those developers can also get your data so they're taking some steps to shut down some of those channels in the short term that could actually hurt some of their relationship to developers\nBut they're saying that in the long term maybe this was at\nA situation like this from happening again\nBased on your reporting should people feel safe using Google for care about privacy\nI think that there are some real questions that users have to ask themselves about trust 'em it and the situation there was a pretty serious decision being made about how to handle a situation involving sensitive personal data\nAnd there was no transparency into that decision the you know these people and in a room in Mountain View decided how to handle a sensitive issue around user data\nSo can users you can Google Keep the trust of its users going forward I think that they're going to have a lot of work to do to to get that trust back\nDoesn't villain covers Google for the wall Street Journal who joined colleagues and writing the story was working with fellow reporter rubber McMillan thanks much for joining us very much for having me\nIn Alaska a ballot measure is cutting right to the heart of the state's identity it's hitting Alaskans love for salmon against another powerful force the oil and mining industries Elizabeth ... has the story she's with Alaska's energy desk and NPR's energy and environment team [noise]\nUsing his vote to cross whispers creek Mike what points out a massive shadows undulating just beneath the current the last of this year salmon for writing here to spot\nThere's some fish Silver's\nSome chums in there to\nA small scale commercials salmon fishermen and the consummate Alaska today he's supporting a candle jacket and a gun on his back in case we run into a moose increases vote to have a look [noise]\nWas also helping leaves the stand for salmon campaign for a ballot measure aimed at protecting the state's most iconic fish walking along the creek woods says he thinks it's a long overdue change\nScale is friendship too far in favor of of development and industry and and we're just trying to pull it back towards the center\nAlaska as some of the most valuable salmon fisheries left in the world but wouldn't other ballot supporters say the state's laws protecting salmon are weak putting them at risk especially with a number of large mean mine's in oil developments in the works\nIf it passes Alaska would enact a much tougher permitting process for big projects in salmon habitat among other things it would set strict standards for restoring salmon streams if they're disturbed and the companies don't follow the rules they could face criminal penalties\nWould acknowledge is that in states like Alaska it's a big ask\nWhen you start doing something like this it's really kind of\nSome in your nose at the big guys you know for decades Alaska's\nEconomy has depended on industry dollars and oil and mining companies hate this initiative banded together under the name stand for Alaska they're backing a campaign to stop it running a blitz of ads like this wire\nIt claims to protect their habitat when it actually improved it brings a new regulations that flu or stop Alaska projects\nCompanies have poured millions into the campaign against the ballot measure with help from donors like BP and Exxon Mobil they've not raised more money than all free of Alaska's gubernatorial candidates combined\nTurned Matthias is with the council of Alaska producers the group that represents mining companies and she argues the state's salmon fisheries have so far ... existed with minds that oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem just\nSeems crazy Matthias thinks the initiative prioritizes standing at the expense of the state's biggest economic engines and taxpayers we couldn't\nHave the Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans similar more than just a living or the occasional meal here\nThey represent something deeper their vital food source and a traditional way of life in one of the last states were wild river's still team with them every summer so when voters head to the polls this November there'll be weighing that against fears that I met her to protect him and couldn't read all the states' economic foundation\nFor NPR News I'm Elizabeth herbal in Anchorage [noise]\n\nThat report came to us from Alaska's energy desk it's a public media collaboration focused on energy and the environment\n\nThis is NPR News [noise]\nJust dead on the marketplace morning report political conversation it's tough with family and friends but how 'bout coworkers this morning some advice on how to do or how not to engage with politics at work\nThat's coming up and under ten minutes along with a look at the mornings other business students but first NPR's Nina Totenberg updates us on what happened since her father's stolen that Stradivarius violin was recovered by the FBI more on that straight ahead\nI'm Sam Whitehead thanks for joining us on Ninety point wind W. A. B. Atlanta\nOr ATM me NPR\nSupport for WABC comes from Margaret Mitchell house presenting to see I'd be see private wealth management author series Christian konger and Carolyn urban discussed an lady like a field guide to smashing the patriarchy in claiming your space on October ... Atlanta history center dot com\nAnd from ran wealth management group financial advisor pat round author of finding your money's greater purpose and his team have overseen to financial affairs of local clients for thirty five years more at R. E. N. N. wealth dot com\nWe could see some showers and maybe a thunderstorm this afternoon otherwise we'll have mostly cloudy skies with high and the low eighties it's Seventy two degrees in her cloudy skies in Atlanta Seventy two in Riverdale and Lawrenceville our time is six forty three [noise]\n\nAll the murder of ... McDonald prove a turning point for policing in America former Chicago police officer Jason Van Dyke no awaits sentencing for the unlawful death of a black teenager but questions remain over a code of silence and over how we train those who protect and serve\nUpholding the law when enforcement in charge deadly next on on one ...\nThis morning at ten on Ninety point one W. A. B. [noise]\nMhm [noise] do you need facts understanding and contacts and ... you get from Ninety point one here's something else you can get a one year digital subscription to the New York times it's yours with an early donation at ten dollars among WABC but\nOnce the member Dr starts\nLater this week the New York times thank you gift jumps to get ... dollars a month just please make your early pledge now and she lives in New York Times at W. A. B. E. dot org slash donate thanks\nSupport for NPR comes from this station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from PBS with the circus American Experience explores the rise and fall of the big top end its influence on entertainment in the U.S the circus that tonight event continues tonight at nine eastern on PBS\nFor extracting involves significant risk of Las ... legal zoom offering a network of independent attorneys who can provide the advice your business needs more legal zoom dot com slash marketplace\nYou can jam in your ear buds you can try to wall yourself in your desk with bankers boxes but how you're really supposed to handle it when people want to talk politics at work especially in these divided days\nWe work with Alison green who writes the popular ask a manager blog where you can write to her or to us with your thorny workplace or management issues things for\nWeighing in here Alison Hi David thanks for having me we talked to some people before the last presidential election who had lost clients because\nPolitics came up and they did not see eye to eye and people fired them it's still going on we have a very polarized America give us some advice here I mean what do you do if politics comes up at the office and you're the person who don't want to talk about it\nYeah it really is okay to set boundaries if you don't want to talk politics at work you can be directed at that you can say you know we look at these issues pretty differently and I'd rather keep politics out of our work relationships and other people may actually be relieved that someone is setting that boundary\nBut the presumption or your answer is that it can be acceptable to talk politics in some offices in certain situations\nIf everyone involved is consenting to the conversation that's fine I Would say you want to be aware of trapped bystanders he might not appreciate the conversation as well that's a good way to drive your co workers that are just make it hard for them to concentrate so you've got to be respectful it out that\nIt also at some level is a diversity issue because if you have a model culture you hire only people who agree\nWith the boss politically that's going to cut out some talent\nI think that's a problem that I cared about ... is that they're working in an office where their political views are very different from most people around them that people are assuming that they agree and they're drying them into conversations sort of making them feel complicit envy points that they find pretty harmful or offensive\nLard these days to pull this off in recent days the Supreme Court nomination hearings I've been going on and even if someone is\nResolved I'm not going to talk about this at work regardless of what side of that particular issue one is you can imagine someone looking at the TV and saying oh you know one way or another and it's a little hard to suppress\nAll of one's reactions\nI think it can be useful to to get it from the other side if your coworker\nWe're talking about a candidate all the time who you found frankly harmful or had a big sign in their office promoting them it may impact the way that you thought of that person may impact the relationship in subtle ways\nAnd there's no reason that you need to inject into your workplace there are a lot of other times and places to use your life and the political process work generally should not be one of them\nAsked manager Alison green is a work advice columnist Alison thank you thank you\nAnd you heard there it's not just speech I asked about red make America great again hats or my body my choice shirts and Alison sense was not at work for reasons we'll stood above sounds like company should make it clear what ever the policy is our producers are Michael Lipton\nCity long Daniel ... in New York I'm David Brancaccio with the marketplace more\nFrom ATM American public media\nSupport for WABC comes from community foundation for greater\nAnd after serving our region for almost Seventy years powering your philanthropy with assets like appreciated stock and business interests for taxi fishing giving learn more at sea of greater Atlanta dot org and from log Meehan makers of go to a meeting\nA collaboration meeting platform allowing people to connect around the globe to get work done\nLearn more at go to a meeting dot com\nJust ahead on MORNING edition or bring you a conversation with Tom Nichols used a lifetime member of the Republican Party about why the confirmation process for justice Brett Kavanaugh prompted him to leave the G O P\nThat's up in just about ten minutes that after a check of the mornings top stories from the NPR and W. A. B. E. newsrooms\nYou're starting your day in the know with MORNING EDITION on member supported Ninety point one W. A. B. E. Atlanta where a tea on meets NPR I'm Sam Whitehead but have you on our time is seven o'clock\nKavanaugh says he's joining the Supreme Court with no bitterness but when President Trump took to the campaign trail he blasted Democrats for going after his nominee It's MORNING EDITION from NPR News [noise]\nHurricane Michael is headed for Georgia will take a look at the potential impacts of the storm at seven oh for\nGood morning I'm Sam Whitehead\nUs Naval War college professor and longtime Republican who's leaving the GOP after watching Kavanaugh's confirmation I'm Noel King and I'm\nDavid Greene will spend time in Europe this hour looking at why China invested heavily in a port in Greece where the workers that are being exploited and his journalism becoming more dangerous than Europe the weight of death of burying journalists found rape and murder also child homelessness rises\nAn eighth grader in Idaho with living that reality too that's overnight Britain's prime minister David Cameron's were fifty two years old [noise] here's the news [noise]\nLive from NPR News in Washington encore of a cool and President Trump has apologized to Supreme Court justice Brett Kavanaugh for the quote suffering he experienced during his confirmation process\nNPR's Emily Sullivan says the apology came at a swear rather ceremonial swearing in on Monday at the White House Kavanaugh was confirmed by the Senate on Saturday receiving fifty votes after an emotional confirmation process centered on allegations of sexual assault\nHe has denied all accusations\nPresident Trump started Monday ceremony with an apology\nOn behalf of our nation I Want to apologize to Brett and the entire family for the terrible pain and suffering you have been forced to endure\nBefore making his comments the president acknowledged they were out of the norm\nIn his speech at the ceremony Kavanaugh said the confirmation process tested him but it did not change his approach to judging\nEmily Sullivan NPR News Washington the national Hurricane Center says hurricane Michael is a little more than four hundred miles south of the Florida Panhandle top sustained Windsor Ninety miles per hour but forecasters warn the storm will get much stronger before it crashes into the Gulf Coast\nBecca Amy manages the sense that I only got an RV club in Florida as Big Bend region\nIf you can go you probably should go and she can't be just like the best preparations you can set to hunker down and hang in there knowing that that uh emergency management won't be able to help the at some point\nAlthough hurricane Michael will lose strength when it hits Florida it's predicted to barrel across Georgia the Carolinas as a tropical storm before crossing into the Atlantic ocean\nThe state of Delaware plans to take public comments this week on the Trump administration's replacement for the Obama era clean Power Plan NPR's Jeff Brady reports Delaware officials are frustrated the EPA is not holding public hearings on the east coast\nThe clean Power Plan to reduce carbon dioxide from power plants to address climate change it was a blow to the ailing coal industry President Trump CPA is replacing it with a new rule that give states more authority to regulate emissions\nThe EPA he'll just one public hearing earlier this month and Chicago Delaware natural resources and environmental control secretary Shaun ... says residents of his coastal state deserved to make their voices heard too we are\nThat are feeling the impact now will continue to feel it found it in the future if we do not take steps to mitigate climate change\nDelaware plans to transcribe comments from its public meeting and forward them to the EPA for the official record Jeff Brady NPR News\nThe online company Google is shutting down its social network for consumers Google Plus this comes after the company discovered a flaw that could have exposed some personal information of half a million people the wall Street Journal published a report that said Google discovered this long in March this is NPR\nSupport for NPR comes from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that held them thrive at ... verified dot Gov slash go\nAnd the ... foundation at ... dot org from W. A. B. E. news in Atlanta\nGood morning I'm Sam Whitehead hurricane Michael turning towards the Florida Panhandle is expected to arrive in metro Atlanta late tomorrow afternoon and into Thursday and ... is with the national weather service and Peachtree city she says the region could see one to three inches of rain\nHowever that track of Michael shifts a little further east well less rainfall if he tracks a little further west we may have a little bit more rainfall\nList ... says the storm could also bring wind gusts of up to twenty five miles an hour to the metro Atlanta area\nMeanwhile Atlanta based Delta Airlines has kept fares to some Florida and Alabama cities in advance of hurricane Michael airline also issued waivers for flights to the Florida Panhandle through Thursday that allows travelers to change their reservations at no cost the airline says flights could be cats later in the week as the storm makes landfall\nThe nation's housing agencies figuring out how to get more landlords to accept section eight at the subsidy for low income tenants\nSome cities have passed laws making it illegal for landlords to reject section ... vouchers but the U.S department of housing and urban development is looking for a different approach Denise Cleveland Leggett heads the southeastern office\nFor church group filed out of their tour bus to take pictures and seeing the Israeli and us national anthem\n\nOne\nVisitor from Texas Jason ... walk an hour from the walled old city wearing a Trump Pence T shirt to take his picture in front of the embassy\nThis is a prosthetic moment the profit from\nThere were a few Jewish visitors including an Israeli family who like Trump's gesture but thought Palestinians also deserve the capital in the city most of the visitors I met issued traditional religious labels like Christian evangelical but said they believe in Jesus and they saw the U.S embassy as representing something biblical\nAs the Bible being\nYou know you look at scripture Jerusalem as the capital ... seeing the word of God being fulfilled the one can look at it with your own ice yep yep\nDeborah home and Diane Weber from Minnesota say they're with their worship group visiting Israel to reach out to the Jewish people they support Trump's decision to move the embassy here\nWell because it says in scripture that does that flat Israel well themselves the blast those that curse Israel will be curves\nLook at what happened since the U.S moved its embassy she says the U.S economy has improved\nWere blessing is wrong or being lost\nSeveral people I met at the embassy mentioned the Israeli Palestinian peace plan Trump says he'll present and a few months recently Trump said he thinks the two state solution would work best a Palestinian state alongside Israel Holleman Webber and other visitors I met had this message for Trump\nDon't give up any inland\nDo not negotiate to give up any us wherever\nThey think Palestinians won't stop at a Palestinian state and will want Israel for themselves to\nMelissa Bruno was visiting from Georgia\nDoesn't mean that you discriminate against that that\nPalestinians\nYou know you love them and they should be taking care of and things like that that Israel is solving and they should have their own sovereignty this is their land\nAs one of the church group saying a Palestinian watched on he was Palestinian Americans that Korea has year at the embassy for relatives visa interview I asked him what he thought the idea of these visitors have that moving the U.S embassy to Jerusalem reflects God's Plan everybody\nCan seem like got told me this is my land\nGod's Plan for me is this just by the ...\nThe other Palestinians I met here we're not interested in talking politics they were trying to get visas to go live in the U.S\nAnd he wanted to send you that there's more freedom and us in the west bank we can't take our kids out for fun you need Israeli permits for everything and I want to keep my children protected\nThat's jak lean Rafiq who came to the embassy from her home in the Israeli occupied West Bank she's with her husband in six children they happen to be Christian for them this embassy represents a\nPossible escape from the reality is that the life they live here [noise]\nDaniel Estrin NPR News\nJerusalem [noise]\nThis is NPR News\n...\nJust ahead on MORNING edition we'll check in with the W. A. B. E. newsroom\nA group of Georgia lawmakers meets today to see if it's time to change school calendars and start later in the year was the latest on that and just about twelve minutes but first a Chinese shipping giant recently took over Greece's sport of progress creating a new reality for the dock workers there\nWill silent obedient cheap workers with no unions in this means no right what's the future we didn't go into these future\nComing up China's impact on an iconic Greek port that straight ahead I'm Sam Whitehead thanks for joining us for MORNING EDITION on member supported Ninety point one W. A. B. E. Atlanta\nSupport for WABC comes from the Atlanta symphony orchestra presenting rebels love literature Greek mythology the luxury of ballet deafness and Chloe also violinist ... Smith makes his debut in music by view Tom and guest conductor June Marco kicks it off with an overture by barely owes\nThursday on Saturday October eleventh and thirteenth in Atlanta symphony hall details at a a show dot org classical series presented by Delta Airlines\nChance of showers and thunderstorms today otherwise we'll have mostly cloudy skies highs and the low eighties it's Seventy two degrees under cloudy skies in Atlanta Seventy two also and Sandy Springs in Conyers' our time is seven twenty\n\nYou need facts understanding and contacts and that's what you get from Ninety point one\nHere's something else you can get a one year did you do subscription to the New York times it's yours within early donation at ten dollars an hour to W. A. B. E. but once the member Dr starts later this week the New York times thank you give jumps to Fifteen dollars a month so please make your early pledge now\nShe has a New York times at W. A. B. E. dot org slash donate\nThanks support for NPR comes from the station\nAnd from Bible a language apps that teaches real life conversations and a new language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at battle B a B B. E. L. dot com\n[noise] from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information it builds on dot a W s\nAnd from universal pictures presenting the new film first man from Damien ... director of la la land and whiplash and starring Ryan Gosling and Clara fully in theaters and IMAX friday\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene China has poured billions into making basically a Silk Road of the sea running dozens of ports and container terminals around the world it's a way to move Chinese exports to important markets including the European Union and in Europe it all began in the Greek port of Piraeus\nThe Chinese shipping giant Cosco has spent millions transforming it into the fastest growing port\nIn the world but as Joanna Kakissis reports from previous this has come at a price\nIs as iconic to greet the proper way it's were lawyers set out for each of the battle and more Hollywood ... team sixty film never on Sunday\n\nI\nPersonally know medical ... saying that there's no port she loved as much as ... ...\n... my knee\nToday now may he got on me also showed Lee ...\nRetired David or your ... and his wife Maria the song by heart he worked at the port of Piraeus for thirty five years\nTo but better than the average listener demise but that is this is my father got when I talked to reporters who didn't have many machines to load cargo into the reward them we just didn't without ... without the bags of groceries rather go to Nick we're all made in Greece old bound for North American astray\nHe says prey is took care of its stock workers he made good money and now has a\nGood pension he flipped the string of worry pizzas he reminisced says in his living room underwater color painting of a ship\n... even a ... year many heroes using the ... Ross from the sewers if you get some deep enough of big ships it's got everything\nTo be successful but for years when the Greek state owned a port your credit red tape made it hard to attract investment\nThen came the debt crisis which began in twenty ten ravaged the Greek economy the he pushed Greece to privatize before the gray is only the Chinese showed serious interest [noise]\nThe Chinese shipping giant Pasco took over the port in twenty sixteen it now owns\nA majority stake in the Port Authority Cosco runs cargo terminals cruise ship peers and the largest passenger ferry Wharf in Europe and the Chinese are not stopping there\nThey want to expand the car terminals they want to expand or they want to create the logistics center they want to build a new ah cruise terminal\nCan be done by let us advisors to the Greek shipping ministry he's aware of the Chinese lease on the port will run out and about thirty five years\nIf at some point in the future they want to abandon food as we will have all these investments they will not take them with with them okay and they will leave them here\nYou see it as it entirely a win win yes when when those are the words of kept it food chunk chill costs goes CEO and parade as heard here in twenty Fifteen\nHe's a ... tool Greece and took us ...\nOne of the port union leaders I ... as another interpretation\nWhen the Chinese said when when they they mean vaguely life she says the benefits mainly go to China\nOr in southeast Europe particularly um embezzlement of a fun thing so she had not been a long and the job but she obviously was was was touching on very sensitive subjects which is you know corruption\nAnd do you see a clear connection between that investigation and and um her murder\nAt this point it's too early to say that you know that's why we want the place to do a credible jolt of investigating this because I'm In the past that's not always been the case\nUm if if there is a link between him and her reporting she will be the food journalist in the European Union to have been killed in the last twelve months\nFor doing investigative reporting\nAnd and let me ask you about that I mean to investigative journalists killed in the EU in addition to her now um is there's something happening is there a climate in Europe that that could explain I mean I Know it's not tons of people but I mean is this certainly seems like\nMaybe the beginning of a really disturbing trend\nWell what you did you grow up more journalists doing more investigative journalism you have a whole network of organizations that have banded together through newspapers through online sites\nThat are doing deep dives into um corruption organized crime human trafficking and that is upsetting a lot of people particularly corrupt officials who politicians\nAnd criminals and so and in a way I think it's because journalists are doing their job while and successfully that they've stood up a lot of them\nA lot of trouble for ah these ah these criminals and Europe that that's one thing and then then the other thing is there in certain countries there's just not enough enforcement of the law and that is rampant impunity which means that you can sometimes\nA silence critical journalists\nAre closed down to the investigation by having that journalists killed because back then sends a warning on a very chilling message to others not to do the same thing\nAre you optimistic that the situation can get safer for journalist that I mean there could be better enforcement of the laws I mean or European countries paying attention to this and I'm willing to work to make things better\nThey have to I'm already these this murder as being condemned by a city or officials in Brussels by the secretary general of the United nations is is high profile but you know I'm not I'm not going to be too optimistic because it's been years since the June\nJournalist or Africa or want to live here was blown up in her car in Malta and we still don't have any justice in that case\nRob Mahoney of the committee to protect journalists talking to us about a disturbing trend in Europe the death of journalists who have been ah doing investigations are on the continent\nWe really appreciate your time thank you thank you [noise]\nIn any given year two and a half million kids in the U.S are homeless that's according to the American Institute for research\nAnd that number is rising as house prices and rental costs also rise the problems really visible in big cities but also in some that you might not think of like Boise idaho which is the fastest growing city in the U.S a mentor teacher of Boise State public radio recently spent time with one eighth grader who is living this reality\nCases in Mormon school they start early and late has an hour and a half long bus ride to get from the homeless shelter and where he's staying to middle school wake up five forty five freshman chains do my hair\nAnd then I hurry and rushed downstairs so I Can't get out and catch my bus sometimes\nCatering to staying at the shelter with is eleven year old brother and his grandma Pam can't travel she says they moved here after getting an eviction notice\nThe landlord decided to sell the property and we just could not find a place that we could afford it more and more depressed I got I just I didn't know what to do\nDrug it's a small disability type and and the government but it's nowhere near enough to cover rent in Boise controls grateful for the shelter but says it's hard on her grandsons\nMy youngest one have to be a little terror because she's upset but you know he gets angry men [noise]\nHe'll sit in a corner [noise]\nHe'll just say I hate this place hate this place\nIs typical for cable too but you wouldn't know it came as a social fourteen year old with a big smile one of his favorite things about school is seeing his friends\nMy friends you know about it and me being homeless and they don't teach me on it I'm trying to work hard and it's just a effort to try not to break down\nIt's harder for students who are anxious and worried to concentrate homeless kids tend to score and lower on standardized tests and have more graduation rates\nAnd sometimes king does break down with his friends [noise]\n[noise]\nAnd my ... is doing okay\nCame carries his tray of food to a table with his friends\nHe says that is out of the picture\nAnd his mom has a drug problem before his grandma stepped in and he had to help take care of his little brother\nOh ready for school [laughter] the ... one small wash Pashto for days on time when we only had cereal for what Julie\nKing has been trying to convince his grandmother she should let him get a job so he can help the rent\nSo I Want to do [noise] you know well I Can't travel won't have it you need to be a child as long as possible and you don't want to be in a big hurry to grow up\nA few weeks later there's good news and cadence world they've got a house it's about seven hundred square feet that they share with a roommate for ... it's a huge improvement\nI feel much more comfortable and safe\nAnd probably most importantly he can say something he hasn't been able to for quite some time this is home\nFor NPR News I'm Amanda ... teacher in Boise\nThat story came to us from the mountain west news bureau and later today on all things considered in rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name\nThis is NPR News\n[noise]\n\nJust ahead on the marketplace morning report credit card interest rates are rising this morning a look at the factors that lead credit card companies to raise borrowing costs that's up and under ten minutes\nBut first north Atlantic right well he's defeat in large numbers off the New England coast not so much anymore look at why straight ahead I'm Sam Whitehead thanks for joining us from on never supported Ninety point one W. A. B. E. Atlanta\nOr ATM meets NPR\nSupport for WABC comes from the Grady burn center a leader in pediatric and adult burn care greedy has one of only two American burned association verified burn centers in the state learn more at Grady health dot org\nAnd firms in desk its customer service and engagement platform connects companies with customers through email live chat and phone support all from one interface to be the company or customers want you to be learned more at ... dot com\nA chance of showers and maybe a thunderstorms today otherwise we'll have mostly cloudy skies with high in the low eighties it's Seventy two degrees that are caught these guys in Atlanta Seventy one at Johns creek and deliver it to\nOur time is seven forty three\n[noise] [noise] [noise]\n\n[noise] it can require team work to make a good meal or good theater birds and he left office and then director Rachel May know their way around it's going to take some work and some sacrificing as a compromise\nAnd and that's what you're going to end up with a beautiful I'm Lois writes this we'll talk about love and loss I made spaghetti on the next city la high ... eleven AM mom believes you lazy [noise]\nToday's immediate environment is complex to say the least but you get context when you listen to Ninety point one and here's something else you can get when you become a W. A. B. E. donor I digital subscription to the New York times when you do something before the member Dr starts it's yours with a pledge of ten dollars a month\nAfter the dry starts then he jumps to Fifteen dollars a month so stay informed and pledge well right now at W. A. B. E. dot org slash donate\nThanks support for NPR comes from this station and from log men makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more Goto meeting dot com\nFrom Charles Schwab when it comes to wealth management Schwab believes in asking questions and being engaged so investors can better own there tomorrow learn more at ... dot com\nAnd from the William T grant foundation at WTC grant foundation dot org\nMarketplace morning report is supported by Deloitte private helping privately held companies address risk and find opportunity in today's complex business environment you can learn more into Lloyd dot com slash and us laugh cried out and buy for X. dot com committed to empowering and helping traders seize opportunities incur\nThe markets since Nineteen Ninety nine for X. dot com it's your World Trade it for X training in significant loss and legal assumes offering a network of independent attorneys who can provide the advice your business needs more legal dot com slash marketplace when\nMy offspring were little I take them to the marketplace newsroom in LA hey kids look at all the needs studios reporters and engineers at work\nAll they cared about was the gumbo machine that we still have there and if the goal is good old American gum balls the United states is down to just one company up near buffalo Ford Gum and machinery has been around for over a hundred years but the gumbo biz is not what it used to be WBFO as Chris Cairo reports\nIn the small village of ... a sweeter Roma walk through the air outside board gum and machinery inside there's a large collection of machines Ford made over the years [noise] company President George state says when he joined forwarded Nineteen eighty there were about a half dozen us based gumbo lawmakers but\nStay he says a Depression era subsidy known as the U.S sugar program raises the price of sugar for consumers and domestic food manufacturers because it's\nCheaper to produce a gun balls in a foreign country to them moved up to Canada\nOthers one out of business or were bought up by multinationals who closed us operations in favor of low cost gum balls from overseas forward survived and part he says by evolving and developing a retail division which produces name brand and private label chewing gum sold in more than a dozen countries\nAnd I think that these divisions or will sustain us in the future\nWith more people shopping online steak he says he's not sure how much longer for will be selling gumbo ...\nThey're very few people that woke up this morning that I got it by ... machine\nFor golf balls along with those from foreign competitors are still popular though at candy machines dot com gun balls or one of our top sellers That's Kevin Johnson the company's director of operations\nI think one of the reasons for that as the profit margin even at a twenty five cent than the operators can still make a profit\nJohnson says his company's expanding its warehouse capacity\nWe've seen a lot of things come and go and we've heard people say that it's a dead or dying industry and we just don't see it that way\nWhether or not for gumbo stick around chewing gum suture looks to be sweet according to market research firm I marked the segments anticipated to grow over the next five years by four billion dollars worldwide in Buffalo New York I'm Kris K. off for marketplace SARS Kris K. out there\nToday we also talked to a workplace advice expert on something I'm guessing we've all run into in the last couple of weeks people who want to talk politics at work all fine unless you don't\nAgree on the place dot org and the marketplace morning before the test feet if you miss it on the air in New York I'm David Brancaccio with the marketplace morning reports from eight PM American\nPublic media support for W. H. B. E. comes from Kaiser Permanente wearing the integrated system of primary care doctors\nAnd specialist worked together as a team to deliver healthy outcomes and consistent care more at K. P. dot org Kaiser Permanente thrive\nAnne from embrace jurors master degree legal training for nine lawyers more than twenty concentrations with health care law and business law now offered online more at Emory law Jay ... dot org\nJust ahead on MORNING edition Republicans have been closing in on Democrats lead in voter enthusiasm are bringing in a conversation with democratic campaign strategist robbing look about whether Democrats can gain back their edge\nThat's up in under ten minutes after a check of some of the mornings top stories from the NPR and to be a B. E. newsrooms you're starting your day and and now with MORNING EDITION I'm never supported Ninety point\nWind W. A. B. E. Atlanta I'm Sam Whitehead got to have you along our time now is eight o'clock\nGood morning less than a month for the midterm elections Democrats and Republicans have at least one thing in common they want to get their voters energized and out of the\nComing up on MORNING EDITION from NPR News hurricane\nMichael is headed this way we'll take a look at the potential impacts of that storm on Georgia and metro Atlanta today do for the morning I'm Sam Whitehead [noise]\nWhat the democratic strategist whether his party can gain it's Susie as an advantage back after the appointment of justice Brett Kavanaugh of David\nAnd I'm Noel King also this hour the curious case of among among the way he was the president of Interpol the international law enforcement agency now he's detained in China and being investigated for a variety of crime and in Alaska ballot initiative that wants\nPay its fishermen against the oil and mining industry\nTo stand overnight filmmaker Guillermo del Toro forward today and the news is next\nLive from NPR News in Washington ... Coleman the national Hurricane Center says hurricane Michael is less than four hundred miles south of the Florida Panhandle in the Gulf\nTop sustained winds are one hundred miles per hour and forecasts to become much stronger shelters are beginning to open up today from member station WFSU Ryan daily reports Tallahassee is mayor is urging residents to take precautions\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including Irma in two thousand Seventeen but he says the state's panhandle region should brace itself or an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages for those\nWho rely on our electric utility system for their livelihood\nOr we would recommend that day\nFine of a safer place to walk out the\nMandatory evacuations have been called in some coastal counties Michael is expected to make landfall Wednesday for NPR News I'm Ryan daily in Tallahassee\nOnline site Google says it will shut down its Google Plus side after saying it found a flaw that could have exposed personal information of half a million users\nGoogle says it has no information the personal data was misused but it's only disclosing the vulnerability now Wall Street journal reporter Douglas McMillan wrote about the breach he told NPR's MORNING EDITION there's no clear law that Google broke by withholding the news\nThere is a a patchwork of laws there's there Patrick state laws and there's a there's a new European law that addresses is the\nProblem is the laws hinge on whether or not the company knew that data was improperly access in this case Google was pleading ignorance they're saying we don't know we have no evidence the data was access so we therefore have no obligation\nHe also says Google was worried about damage to its reputation and about government scrutiny Brett Kavanaugh takes the bench today for his first arguments since the Senate voted narrowly to confirm him to the Supreme Court Saturday NPR's Carrie Johnson reports the new justice spent the weekend working\nBrett Kavanaugh and his family appeared at the White House Monday evening for a ceremonial swearing in ceremony but he's mostly been studying up for his new job\nKavanaugh's hired for women clerks a first for the Supreme Court\nIn a source close to the justice says he's been reading brief to get ready for oral arguments\nHis first cases involve what kinds of crimes sugar mandatory prison sentences under the arm career criminal act Kavanaugh's confirmation opens up another seat for the White House to fail on the prestigious federal appeals court in Washington Carrie Johnson NPR News Washington\nMourners held a candlelight vigil in Amsterdam New York last night for the twenty people killed in the limousine\nCrash on Saturday the vehicle ran a stop sign to pedestrians are among the dead you're listening to NPR\nSupport for NPR comes from NPR stations other contributors include the University of Florida we're solving for next is powered by its land grants heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot UFO dot edu\nFrom W. A. B. E. news in Atlanta good morning I'm Sam Whitehead\nJust heard from NPR hurricane Michael is turning towards the Florida Panhandle National Hurricane center says metro Atlanta could start to see isolated thunderstorms related to that storm this afternoon and tonight ...\nWinds and heavy rain are expected in Georgia Wednesday afternoon into Thursday morning meteorologist at the track of the hurricane could still shift in effect the amount of rain and wind speeds that we see here in metro Atlanta the category to storm is currently about four hundred miles south of Panama City Beach Florida\nThe nation's housing agency wants to know why more landlords don't except to government funded vouchers so it's asking Stephanie's stokes has more\nSection eight vouchers help low income tenants afford rent but a recent report from the Urban Institute found many landlords reject voucher holders before even meeting them to find out why the U.S department of housing and urban development is doing listening sessions around the country\nAnd Atlanta southeast regional had Denise Cleveland lake it says a big concern she's hearing is red tape\nThere are a number of rules and regulations that they'd like to see loosened our changed in order to bring about a an more of an easy to do the housing choice vouchers\nThis year's confrontation actually started with a farming fiasco last year the company Monsanto which is now owned by Bayer rolled out a new way to kill weeds it told farmers we've created some special new varieties of soybeans and caught and they can tolerate a weed killer called dicamba\nSo you can spray dot camera and the crops will be fine but you're weeds will die\nTerry Wohlers a member of the Arkansas state plant or kind of the pesticide policing honestly I don't think anybody\nIn the whole world dreamed that ... could create such an issue brings so many farmers against farmers\nThat gamut in stay where it belonged to drifted across the landscape and injured millions of acres of regular crops it was especially bad in Arkansas farmers who sprayed dicamba loved it but Terry fuller and the state plant board decided the collateral damage was unacceptable I talk to them about it last year\n... known your neighbor and your friend that's not my definition of good for business\nSo the blackboard asked the most dramatic limits on campus and the whole country no die campus spring during the growing season this summer I called Terry fuller back see how it was going and he told me it was happening again thousands of acres of crops damaged also trees and people's yards this was not supposed to happen this year\nNot supposed to happen this year scripts liquor is just been a sad situation and um you know really an unbelievable situation\nThe plant boards investigators tried to catch the outlaw farmers inspectors drove country roads looking for dying weeds that looked like they'd been sprayed with Ken Buck took samples tested them\nIn at least a couple of dozen cases they found the band chemical those farmers now could face fines at least a thousand dollars possibly twenty five thousand dollars per violation\nI talked to a couple of those farmers and some of their supporters\nThey did not want me to record those interviews or use their names they told me spraying dicamba was a business decision some of them think Monsanto's dot camera tolerant seeds will give them a bigger harvest one said spraying dicamba is the only way to survive a couple of them said paying the fine is cheaper than fighting weeds\nSupport for WABC comes from leap frog celebrating Twenty years of offering managed IT Services and solutions to businesses including disaster recovery and into an service packages leap frog services dot com leap fraud extraordinary IT Services\nNamed among Hong way he's from China but in a stunning moved China's government detained mom put him under investigation and now he has resigned from Interpol I talk to NPR's Shanghai correspondent Rob Schmitz and ask them what do we know about my whole month\nAway is sixty four years old he served as the vice minister of public security bureau which is China's national police are in twenty sixteen\nHe became the first Chinese head of Interpol in his election was a big victory for China's government which under leader Xi Jinping was eager to use Interpol to locate an extra day Chinese officials at it deemed corrupt would a scape China\nAs it turns out among himself is now under investigation by Chinese authorities for corruption\nWhat exactly are they investigating him for\n[noise] which I think government hasn't released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how his attention unfolded has come from his wife grace among September twenty fifth\nThe day her husband arrive to China for a visit she allegedly received a text from him that said wait for my call which was followed by in a mood to even nights suggesting that she was in danger a week later she reported missing the French police on Sunday she spoke to reporters in Leone France wearing trouble is headquartered in here's what she said\nWe had to go see half of my children on them all the whys and children's husbands and fathers so they may no longer disappear\nAnd as you can hear in that tape now while she's crying during this part of the video with their back\nTurned to the camera because she's received threats and his under protection by French police well\nWhen she talks about the husbands and fathers who've disappeared in China what does she mean\nWell she's talking about the government's anti corruption campaign was launched by paying immediately after he took office in twenty Thirteen and it smeared hundreds of thousands of officials both on the local level as well as among the highest echelons of the party\nIn fact the man who appointed Malone way to vice minister of public security was Julian Kong the highest ranking Chinese official who was brought down by this campaign Joe was a former member of the pull up your standing committee the group of seven men who rules China he was China's securities are before he was sent to prison for life and twenty Fifteen\nRob by removing them from the presidency of Interpol loses a lot of sway within that organization that much is clear what does this mean for Interpol\nWell even before this happened China's use of Interpol and amongst presidency was starting to raise some red flags earlier this year China tempted to issue a red notice that's an international alert for wanted person\nFor an exile weaker active is ... years are mostly Muslim ethnic minority who live in northwestern China who China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with lung is a good example of how China's messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob thanks do\n\nAcross the United states more criminal courts are turning to video proceedings this isn't an effort to save time and money that that happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology from Illinois newsroom in Urbana league games reports\n... ... email address all that data could have been available to outside developers if basically if your friend had signed up\nTo some Google Plus at those developers potentially could have gotten access to this data\nThe number to potentially affect the number is abuser is small it's only about potentially half a million users which in the world of kind of potential data breaches that is not a member of the real questions that are reporting focused on our kind of what Google did\nWhen it find out this this this uh you know the security patches ... existed or didn't\nDo right I mean they didn't go public and let people know that their their privacy might have been at risk why\nYeah so there's sort of the story that they're telling which is they took a look at what happened they investigated these apps to some extent\nThey found that there was no suspicious activity and they decided that there was no evidence of a misuse of data so they had no obligation to tell users\nBut our reporting shows that there was another factor at play which was they were worried about the repercussions of coming a forwarded this information or you know earlier this year right right of the time they discovered this the face but Cambridge Analytica data breach in just happened um there's a lot of regulator scrutiny\nOf Facebook in tech companies and how they're handling data and internally they were worried about being pulled into this conversation and a bigger way\nWe'll have they responded to your reporting and I I guess also they said anything about how they might prevent this from happening in the U.S so that\nThey're they took it pretty drastic step which they now you said earlier they ... they announced they're closing the consumer side of Google Plus which is pretty big step they're also taking um a number of steps to kind of rain in ah some data privacy\nPotential problems or they make a lot of data available to outside developers on an Android phones um for things like ... there are there are a lot of different apps\nThat can you can use to to and those developers can also get your data so they're taking some steps to shut down some of those channels in the short term that could actually hurt some of their relationship to developers but they're saying that in the long term maybe this could prevent a situation like this from happening again\nBased on your reporting should people feel safe using Google that care about privacy\nI think that there are some real questions that users have to ask themselves about trust on it and the situation there was a pretty serious decision being made about how to handle\nA situation involving sensitive personal data and there was no transparency into that decision the you know these people and in a room in Mountain View decided how to handle a sensitive issue around user data\nSo can users you can Google Keep the trust of its users going forward I think that they're going to have a lot of work to do to to get that trust back\nDoesn't villain covers Google for the wall Street Journal ah he joined colleagues in writing the story who was working with fellow reporter rubber McMillan thanks much for joining us wanted very much for having me\nIn Alaska a ballot measure is cutting right to the heart of the state's identity it's hitting Alaskans love for salmon against another powerful force the oil and mining industries Elizabeth ... has the story she's with Alaska's energy desk and NPR's energy and environment team [noise]\nThe thing is though the ... creek Mike what points out a massive shadows undulating just beneath the current the last time this year salmon for writing here to San\nThere's some on base Silver's [noise]\nSome challenges in there to\nA small scale commercials saving fishermen and the consummate Alaska today he's supporting a candle\nIt in a gun on his back in case we run into a moose ... vote to have a look [noise]\nWould also helping leaves the stand for salmon campaign for a ballot measure aimed at protecting the state's most iconic fish walking along the creek would says he thinks it's a long overdue change\n... chip too far in favor of of development and industry and and we're just trying to pull it back towards the center\nAlaska at some of the most valuable salmon fisheries left in the world but wouldn't other ... supporters say the state's laws protecting salmon are weak putting them at risk especially with a number of large new mines and oil developments in the works\nIf it passes Alaska would enact a much tougher permitting process for big projects in salmon habitat among other things it would set strict standards for restoring salmon streams if they're disturbed\nAnd the companies don't follow the rules they could face criminal penalties\nWould acknowledges that in a state like Alaska it's a big ask\nWhen you start doing something like this it's really kind of\nSome in your nose at the big guys you know\nFor decades Alaska's economy has depended on industry dollars and oil and mining companies hate this initiative banded together under the name stand for Alaska they're backing a campaign to stop it running a blitz of ads like this lawyer\nIt claimed to protect they had a cat but it actually improved his burdensome new regulations that slow or stop Alaska projects\nCompanies have poured millions into the campaign against the ballot measure with help from donors like BP and Exxon Mobil they've raised more money than all three of Alaska's gubernatorial candidates combined\nTurned Matthias is with the council of Alaska producers the group that represents mining companies and she argues the state's salmon fisheries had so far coexistence with minds that oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem just seems\nCrazy but I just thinks the initiative prioritizes standing at the expense of the state's biggest economic engines and taxpayers\nWe couldn't have the Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans salmon are more than just a living or the occasional meal here they represent something deeper their vital food source and a traditional way of life in one of the last states were wild river's still team with them every summer\nSo when voters head to the polls this November there'll be weighing that against the fears that a measure to protect same and couldn't read all the state's economics foundation\nFor NPR News I'm Elizabeth ... in Anchorage [noise]\n\nThat report came to us from Alaska's energy desk it's a public media collaboration focused on energy and the environment\n\nThis is NPR News [noise]\nJust to add on the marketplace morning report dropping diminished ration is expected to allow more ethanol in gasoline year round typically higher ethanol gas isn't sold in the summer because the air quality concerns look at that and then\nAll the other morning business news and under ten minutes but first NPR's Nina Totenberg updates us on what happened since her father's stolen Stradivarius violin was recovered a few years go by the FBI that straight ahead\nI'm Sam Whitehead thanks for joining us on member supported Ninety point one W. A. B. E. Atlanta\nWhere ACL meets NPR\nSupport for WABC comes from Kaiser Permanente were members can see a doctor get a lab test and pick up medication all in one connected systems delivering healthy outcomes and consistent care more at ... dot org Kaiser Permanente Dr\nAnne from Comcast Business providing a gig speed network that helps business get done\nComcast Business beyond fast\nLearn more at Comcast Business dot com\nShowers and maybe a thunderstorm today otherwise we'll have mostly cloudy skies that high in the low eighties [noise]\nWe've got Seventy two degrees under cloudy skies currently in Atlanta it's Seventy in Greece and in Kennesaw\nOur time is eight forty three [noise]\n[noise]\nWell the murder of ... McDonald prove a turning point for policing in America former Chicago police officer Jason Van Dyke now awaits sentencing for the unlawful death of a black teenager but questions remain over a code of silence and over how we train those who protect and serve\nUpholding the law when enforcement towards deadly next on on one day\nThis morning at ten on Ninety point one W. A. B. [noise]\nWe know you have lots of choices when it comes to the news [noise] what do you believe everything you read or hear\nProbably not and that's where Ninety point one comes in because you listen why not get\nWith your donation to W. A. B. E. digital subscription to the New York times is yours for a donation of ten dollars a month but once the dry starts this thank you get will jump to Fifteen dollars among contribute now at W. A. B. E. dot org slash donate\n\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers working food health power jobs and resilient cities at rock found dot org\n[noise] from the doors do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to this NPR station\n... legal zoom offering a network of independent attorneys who can provide the advice your business needs more legal zoom dot com slash marketplace\nYou can jam in your ear buds you can read a wall yourself into your desk with bankers boxes but how are you really supposed to handle it when people want to talk politics at work especially in these divided days\nWe worked with Alison green who writes the popular ask a manager blog where you can write to her or to us with your ... workplace or management issues thanks for weighing in here\nHi David thanks for having me we talked to some people before the last presidential election who had lost clients because\nPolitics came up and they did not see eye to eye and people fired them it's still going on we have a very polarized America give us some advice here I mean what do you do if politics comes up at the office and you're the person who don't want to talk about it\nYeah it really is okay to set boundaries if you don't want to talk politics at work you can be directed at that you can say you know we look at these issues pretty differently and I'd rather keep politics out of our work relationships and other people may actually be relieved that someone is setting down J\nBut the presumption or your answer is that it can be acceptable to talk politics in some offices in certain situations\nIf everyone involved is consenting to the conversation that's fine I Would say you want to be aware of trapped bystanders he might not appreciate the conversation as well that's a good way to drive your coworkers Matt or just make it hard for them to concentrate so you've got to be respectful of that that\nIt also at some level is a diversity issue because if you have a model culture you hire only people who agree with the boss politically that's going to cut out\nSome talent I think that's a problem that I hear that from leaders ... is that they're working in an office where their political views are very different from most people around them that people are assuming that they agree and they're drawing them into conversations started making them feel complicit envy points that they find pretty harmful or offensive\nLard these days to pull this off in recent days the Supreme Court nomination hearings I've been going on and even if someone is resolved I'm not going to talk about this at work regardless of what side of that particular issue one is you can imagine someone looking at the TV and saying\nOh you know one way or another and it's a little hard to suppress all of one's reactions\nI think it can be useful to to get it from the other side if your coworker\nWe're talking about a candidate all the time who you found frankly harmful or had a big sign in their office preventing them at night impact the way that you thought of that person may impact the relationship in subtle ways\nAnd there's no reason that you need to inject into your workplace there are a lot of other times and places to use your life in the political process but work generally should not be one of them\nAsk a manager Alison green is a work advice columnist Alison thank you thank you\nYou heard there it is not just speech I asked about red make America great again hats or my body my choice shirts and Alison sense was not\nAt work for reasons of sounds like companies should make it clear whatever the policy is our producers are Michael Lipton city long and Daniel ... in New York I'm David Brancaccio with the marketplace morning [noise]\nFrom a PM American public media\n...\nStay with us just to head on MORNING EDITION we'll bring you a conversation with Tom Nichols sees a lifetime member of the Republican Party about why the confirmation process for justice Brett Kavanaugh prompted him to leap GOP\nThat's up in just under ten minutes you're starting your day and they do with MORNING EDITION on member supported Ninety point one W. A. B. E. Atlanta I'm Sam Whitehead thanks for joining us\nSupport for W. E. B. E. comes from flat iron school a coating boot camp with the curriculum and career support designed to help students get jobs once they graduate applications were\nFlat aren't midtown campus or now open more at flat iron school dot com\nAnd from Kimberly Clark corporation home of brands like clean ... and ... more information about Kimberly Clark and it's one hundred and forty six year history of innovation is available on the Web of Kimberly dash court dot com\nGood morning hurricane Michael is turning towards the Florida Panhandle and getting stronger look at the potential impacts for Georgia metro Atlanta later this hour [noise]\nIt's MORNING EDITION on Ninety point one W. A. B. E. Atlanta where Haiti um meets NPR\nI'm Sam Whitehead thanks for joining us this Tuesday Morning hope your days off to a great start\nAlso this hour with state lawmakers meets today to start talking about the public school year starting to public school year later and summer\nAnd look at why the new U.S embassy in Jerusalem has become a pilgrimage site for some American Christians will pay hit a visit and we'll bring you a conversation with musician catches the core from the string band old crow medicine show about writing songs and children's literature\nBut first we'll check in on the morning talk national and local stories from the NPR WABC newsrooms\nSeventy two degrees under cloudy skies in Atlanta our\nTime now is nine to one\n\nFrom NPR News in Washington I'm core of a cold and the national Hurricane Center says her\nMichael is now a category ... storm in the Gulf of Mexico with Tom sustained winds of one hundred miles per hour its forecasts to strengthen and become a major hurricane category three more stronger\nMichael is less than four hundred miles away from Florida's panhandle that's where Jesse heat is preparing his home near Pensacola for storm surge\nBut some plastic of over the garage and since their legs up and walk the front door and um\nWe've got a garage sale averse levels and we'll try to keep the water out of their\nResidents along the curved ... part of Florida's Gulf Coast or big band or being warned you expect as much as a foot of storm surge some areas of the Florida Panhandle are under mandatory evacuation\nNewly confirmed Supreme Court justice Brett Kavanaugh takes his seat on the high court today for the first time he was confirmed Saturday and had a ceremonial swearing in last night at the White House cabinet has been studying legal briefs to prepare for today's oral arguments\nTurkey says Saudi Arabia it needs to prove that missing Saudi journalist left us out of the consulate in Istanbul as the Saudi Government claims the Turkish foreign ministry says authorities will search the Saudi consulate NPR's Peter Kenyon reports journalist ... has been missing for a week\nSpeaking during a visit to hungry president ... said prosecutors are looking into the show these disappearance including the arrival of more than a dozen Saudis to assemble on the day the journalists disappeared\nHere to one said Saturday consulate officials can't get away with saying he left the building addressing the Saudis air to one added if he left the building then you need to prove it\nInvestigators suspect to show he was either spirited out of the country by the Saudis or killed inside the consulate Saudi Arabia denies the allegations President Trump says he's concerned but to show these disappearance Peter Kenyon NPR News Istanbul\nThe international Monetary Fund is cutting its forecasts for global growth NPR's Giles Schneider reports the IMF blames rising interest rates and trade tensions\nThe IMF has revised its forecasts from July when it said the global economy would grow three point nine percent this year it's now cut that down a couple of nachos downgrading expectations for this year and for twenty nine team the IMF now says the global economy will grow at a three point seven percent clip\nThe IMF loved us economic growth on change for the rest of this year but cut the U. S. is twenty Nineteen forecast a two and a half percent because of the trade tensions with China the revision to the global forecasts was issued on the resort island of Bali as annual meetings of the IMF and World Bank get underway this week\nTrial Snyder NPR News Washington\nThe White House says that musician Kanye West will have lunch today with President Trump and top aide Jared Kushner west and his wife Kim car Deschene visited the White House earlier this year you're listening to NPR support\nFor NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more ad campaign monitor dot com and Americans for the arts\nFrom W. A. B. E. news in Atlanta good morning I'm Sam Whitehead hurricane Michael headed towards the Florida Panhandle is expected to arrive in metro Atlanta late tomorrow afternoon and into Thursday and the whole list of ... is with the national weather service and Peachtree city she says the region could see one did three inches of rain\nHowever that track of Michael shifts a little further east well less rainfall if he tracks a little further west we may have a little bit more rainfall\nList ... says metro Atlanta could also see wind gusts of up to twenty five miles an hour because of the storm\nMeanwhile Atlanta based Delta Airlines has kept fares to some Florida and Alabama cities in advance of hurricane Michael the airline also issued waivers for flights to the Florida Panhandle to Thursday that allows travelers to change their reservations at no cost\nAirlines says flights could be canceled later in the week as the storm makes landfall\nThe nation's housing agency is figuring out how to get more in landlords to accept section eight at the subsidy for low income tenants some cities have passed laws making it illegal for landlords to reject section ... vouchers\nBut the U.S department of housing and urban development is looking for a different approach Denise Cleveland Leggett heads the southeastern office we're\nAs one of the church groups saying a Palestinian watched on he was Palestinian Americans that Korea has year at the embassy for relatives visa interview I asked him what he thought the idea of these visitors have that moving the U.S embassy to Jerusalem reflects God's Plan\nEverybody can seem like got to this is my land\nGod's Plan for me is this is buddies thing\nThe other Palestinians I met here we're not interested in talking politics they were trying to get visas to go live in the U.S\nNew on the side of that law there's more freedom and us in the west bank we can't take our kids out for fun you need Israeli permits for everything and I want to keep my children protected\nThat's jak lean Rafiq who came to the embassy from her home in the Israeli occupied West Bank she's with her husband and six children they happen to be Christian for them this embassy represents a possible escape from the realities of the life they live here Daniel Estrin NPR News Jerusalem Mm\nHurricane Michael is forecast to be one of the most destructive storms to hit the Florida Panhandle in decades it could send a life threatening surges of ocean water to coastal areas throughout the state NPR's Emily ... reports state and local governments are preparing for torrential downpours\nHurricane Michael will likely make landfall along the Gulf Coast today as a category three storm according to the national Hurricane Center\nThe agency said the storm steady intensification over the past two days despite shifting westerly wins defies traditional logic to anticipate torrential rains and winds of upwards of a hundred and twenty miles per hour\nHurricane Michael is a massive storm that could bring total devastation parts of our state especially in an adult\nThat Florida governor Rick Scott Scott says he spoke to President Trump on Monday afternoon he's committed to providing any federal resources for it I may need FEMA is already an Floridian ground providing assistance the form of the EPA homeland security and health and Human Services\nThe national Hurricane Center has hurricane tropical storm and storm surge warnings for more than three hundred miles of coats they say these regions can expect eight to twelve feet of storm surge\nThat means water will come miles in shore and could easily rise over the house\nThe governor has declared a state of emergency and thirty five counties and stressing the need to follow any evacuation orders\nThis storm surge is absolutely definitely do not think you can survive\nAnd local authorities are stressing timely evacuation to David ... is the deputy director of emergency management and levy county which faces the Gulf of Mexico he spoke to W. F. T.\nStorm surge is another problem that you could see from the storms and sort of a lot of water that come on shore\nRight now he's working to get county residents protective measures before the hurricane makes landfall today meteorologist predict that by Wednesday night or Thursday morning Michael's rains\nOn the older shows glee\nRetired ... and his wife Maria the song by heart he worked at the port of Piraeus for thirty five years\nWe're going to be able to but that was going through their vision Marjorie but this is my father did it go up when I stopped the reporter who didn't have many machines to local cargo into the should reward them we just didn't with our own hands for ... without the bags of groceries leather goods and they were all made in Greece old bound for North America Australia\nHe says pray us took care of its dock workers he made good money\nAnd now has a good pension you flip the string of worry pizzas he reminisced says in his living room underwater color painting of a ship\n... and then you have to ship ... many bureaus using them without looking out the door Ross from the sewage if you want to get some regard little deep enough for big ships that go to everything\nTo be successful but for years when the Greek state owned the port bureaucratic red tape made it hard to attract investment\nThen came the debt crisis which began in twenty ten ravaged the Greek economy he pushed Greece to privatize the board for a U.S only the Chinese showed serious interest [noise] the Chinese\nShipping giant Costco took over the port in twenty sixteen it now owns\nA majority stake and the Port Authority Cosco runs cargo terminals cruise ship ears and the largest passenger ferry Wharf in Europe and the Chinese are not stopping they're\nMeant to expand the car terminals they want to expand or they want to create the logistics center they want to build a new on a cruise terminal\nCan be done by let us advice as of the Greek shipping ministry he's aware of the Chinese lease on the court will run out and about thirty five years\nIf at some point in the future they want to abandon paid as we will have all these investments they will not take them with with them okay they will leave them here\nYou see it as an entirely a win win win win those are the words of captain food chunk she'll costs goes CEO and parade as heard here in twenty Fifteen\n... pull Greece an\n... one of the port union leaders and that's the CFPB ... as another interpretation\nWhen the time he said when when they they mean vaguely life\nOn a Tennessee farm where the music grows wild [noise] lived a pitch fork and a half and is fearless grandchild fold the ruckus they raised one of the work day groove dark with Lorraine\nOn her whistle and path Paul on\nHis harp catch reading some of his book forest there so Lorraine is a little girl and she loves playing music with her grandpa\nOr pap all the songs they sang always lifted their spirits on good days are bad it was\nI flew to hear it joyful until a crow got involved\nWith this mischievous Crowe he likes to visit the farm and suddenly they notice things go missing\n... namely their musical instruments right so the the crow pinch is ... and so they're they are with no instruments when a big storm suddenly roll through the rain gets really scared until ... reminds her that she has the music\nInside of her they start saying and\nThey find the voice within that or pacify them and makes the storms seem a little less frightening\nAnd you know catch when I thought about that\nBasically\nTelling the story of the blues this music where you'd have people with nothing or are close to nothing looking to music within themselves when times are their toughest\nWell I I Know for me that in my darkest hour there's always been a song that has helped me to transcend and certainly the story of country music and the story of the blues which\nI really want in the same the story of hardworking and oftentimes impoverished people looking for that boat across dark waters you\nChose to make your characters African American and the illustrations in this book where and why was that decision made\nWhen I first heard this story I heard it from a woman of Cherokee dissent a woman named Lorraine she had a pet crow and she was a kid on her dad's form and this crow used to steal everything and bury it all around the farm and they find a\nLittle bits of string or or cellophane or tinfoil so in my mind Lorraine was a hillbilly girl of Cherokee descent\nNow it took a long time to get this book finished um but really the big part of the time was getting it published and ah and then finding an illustrator and it wasn't until maybe four years passed before the publisher said sorry catch we can't really find the right illustrator would you like to search\nAnd I've found on the listing of a local art college Higgins bond here in Nashville Higgins is a really important children's illustrator in the Nineteen seventies and eighties and then stops working for a long time Higgins is the reason that Lorraine is African American because Higgins is African American\nFact she's the first African American woman to design a U.S postage stamp\nI was talking to the actress Viola Davis recently about a children's book that you've done she was saying two things one is there is an incredible need for characters of color in children's books that's been avoid that's existed for very long time\nShows is that she loves when you have say characters of color but there doesn't have to be some explanation or reason for it what do you think of that is that something we're seeing in your book\nYes and the thing that was missing and really waited until I discovered Higgins bond\nIs that I I really wanted Lorraine to be an African American girl\nYou know what I Do a lot of volunteer work around communities of color and uh in one of the places where I'm often reading literacy and and mentorship program for kids I'll read any number of books with this book I have the opportunity to now read a story in which the characters looked like the audience\nI'm interested in your volunteering and and I know you also helped found a private school in Nashville right I mean it it sounds like your commitment to education as part of where this terms what came from yeah they all sort\nOf come around the same forces to draw up for me this passion about education as a kid I Lived in all these different towns five pounds by the fifth grade my parents were educators\nSo it turned out that I had it in me to start a school and then these kind of volunteer gigs really helped me to say oh I'm I think I could see a school in this parking lot by the shores of this rushing interstate with the two expressway spurs and the the shoney's in the wake shop\nThat parking lot's got a school growing in it we just need to plant the seeds\nThat what you put the school was a bio wakes up in a zoning yeah that's what I thought what better place to put the newest Episcopal school in the nation [laughter] I'd love it was this a different experience reading a book compared to writing San\nI think writing songs and writing a children's book are really kind of one in the same you want to get a tagline or a refrain you want to have language that's easy to remember there's a sing song quality to this book it's in ... ...\nIt makes me want to ask you and I don't know you'd be comfortable or not but if would you sing a page of the book like even the ending if if that's something I don't know if you've you've thought about putting it to music\nI'd love to go ahead and [noise] let's see what should our melody be I'm going to leave it up to you know the expert oh man they broke into song with their heart\nSo global came the ... the crew he was perched on the stump above the old\n... pin dance ... with a mischievous gr in than the clouds parted ways as the music\nRose high and the sunshine sparkling\nGold in the Tennessee sky\nWell what better way to go up in that um judges always such a pleasure talking to you and the best of luck with this new journey of\nHey thank you David piece\nCatch the core children's author of the man in old crow medicine showed ban probably best known for the\nAnd this is MORNING EDITION from NPR News I'm David Greene and I'm Noel King\nPull the murder of ... McDonald prove a turning point for policing in America former Chicago police officer Jason Van Dyke now awaits sentencing for the unlawful death of a black teenager but questions remain over a code of silence and over how we train those who protect and serve\nUpholding the law when enforcement in charge deadly next time on one day\nThis morning at ten on Ninety point one W. A. B. [noise]\n\n\nJust ahead on the marketplace morning report gumbo machines are rare find these days there's only one company in the United states still making them so what does it take to survive in a world where gun bowls are quite as popular as they once were\nWell look at that and just under ten minutes on our place morning report but first the north Atlantic right whale use defeat in large numbers of Maine's coast that so much anymore multiply straight ahead\nI'm Sam Whitehead thanks for joining us on member supported Ninety point wind W. A. B. E. Atlanta\nOr ATM meets NPR\nWith fuel prices climbing you may be rethinking keeping that gas guzzlers why not donated to the W. H. B. E. vehicle donation program it's easy just call one eight six six nine zero one WHAT eat or go on line to W. H. B. E. dot org and thanks\nWhile you're at W. A. B. A. dot org be sure to check out the great ended up local reporting from the W. A. B. newsroom you can also keep up with us on Twitter rat W. A. B. C. news and keep up with the station on Facebook at Facebook dot com slash W. A. B. E.\nWeather today a chance of showers and thunderstorms otherwise we'll have mostly cloudy skies ties in the lower eighties Seventy two degrees in her class these guys in Atlanta Seventy ... ville and powder springs\nOur time is nine forty three [noise]\n\n[noise]\nOne of the next closer look martyrs two point five billion dollar transit plan for Atlanta the projects are touted to change the city\nBut how well Marta prioritize the list CEO in general manager Jeffrey Barker joins me also our paycheck to paycheck series continues we'll profile the co-op business model and its economic and employment benefit I'm Rose Scott closer look today at one point Ninety point when WABC\nMhm [noise] do\nNeed facts understanding and contacts and watch what you get from Ninety point one here's something else you can get a one year did you do subscription to the New York times is yours within early donation at ten dollars a month to WABC the wind the member Dr starts later this\nThe New York times thank you gift jumps to get ten dollars a month so please make your early pledge now and she lives in New York Times at W. A. B. E. dot org slash donate thanks\nSupport for NPR comes from this station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from PBS with the circus American Experience explores the rise and fall of the big top end its influence on entertainment in the U.S the circus that tonight event continues tonight at nine eastern on PBS", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Atlanta", "day": "09"}