{"month": "10", "state": "GA", "station": "WABE", "content": "Does go back to our top story the president of Indonesia visiting the city of ... devastated in the earthquake and tsunami James Minnesota is Southeast Asia correspondent for the Sunday Morning Harold in similar ways to wear all your James and what have you been seeing\nA I mean it's like to have me Dan I'm In Palo at the moment I'm One of my main thing that I Would have been a ... a which is one of the area of the hottest by the earthquake as opposed to the ... um we saw straight off the street that had been essentially pot\nGot water to made as a into beecham and I'm happy to have destroyed family huddling on the sides of the road we want to die with Iraq and noodles and aiding want the two meals a day it's a I think the pretty rough on people if\nIt's getting a help to them that's the real issue now we've been talking to somebody from ... who said there's about two weeks of emergency planning but it's the first few hours and days how much is getting through now\nLooking through a positive way we've been sleeping or it's not in the outside the governor's a read on the on the ... about a thousand other people food is starting to get their water is starting to get there there is a shortage of actual steel and that\nImportant because it means people can't get around the clock back to the harm in the next village or two villages alliance search for their loved ones and that's been a big problem of course logistically getting more food and if there's no actual that makes ... actual that makes things more difficult as well\nAnd I guess the aftershocks yet it constantly aftershocks\nI reckon about five or a five point five magnitude quite an hour ago ... two or three of those that wake you up a couple of times um\nUh some of them are are you know a little bit quicker a little bit stronger make you feel them you wake up you kind of get up and run the white everything's fine you got activated yeah it's a constant companion weren't your Internet quite like these stem\nCells and what are you hearing about reaching the remote areas because we used to sing guessing but there are places when nobody's been yet\nYeah look I think that's the case where we where we went to that ... that's ... that's an average ... probably ... kilometers from the center of the city the paper where he was fixing to said that I think one of them said we haven't had so much as a glass of water from the central government yet\nUm you know that district so while in the in a city I mean there are as I say refugee camp to mention that started the man's house even title fixing plummeted way to getting the actual we did see emergency crews though I had a heavy machinery\nStarting to sort of essentially plowed a housing ... that five hundred houses where\nThe damage was so bad you show where one have stopped and the next one shot at it like some of the house in a blender if you can you can picture that it was pretty terrific I must say the estimate day was about\nSixty percent of the papal which would be about three\nHundred or so I Would still buried inside and that just haven't been able to get any of them yeah\nJames Minnesota Oh thank you for the sitting in mourning Harold speaking to us from Palo ... islands in Indonesia lots more reporting from here on the b._b._c. World Service stay with us and joined us from all ... day tomorrow [noise]\n[noise]\nThis is nine point one WABC e Atlanta for a T L meets NPR [noise]\nOn Sunday Brazilians vote for their next president and poll suggest they're not happy with the choices that\nWomen are protesting the leading candidate with the hash tag ... not him that story on the next all things considered from NPR News this afternoon at four on Ninety point one W. A. B. E.\nW. H. B. E. begin serving Atlanta Seventy years ago in the early days we sounded like this\nAnd I'm telling you about this strange bleach cigarettes\nThey're still at the long the way we as long as lays WABC local business report good morning I'm Bruce Jordan\nAnd grew into what you know and love today\nThe resolution is that for the Atlantic city council today\nIt would make you Atlanta this is W. H. B. E. serving Atlanta since Nineteen forty eight\nWho\nMorning President Trump longing and accuser Supreme Court nominee Brett Kavanaugh for not we're calling every detail [noise] he went on to express concern recused\nIt's MORNING edition I'm In\nAtlanta as public schools will start twelve days later next school year we'll have more at six so for\nGood morning I'm Sam Whitehead\nHow has the cabin on site changed the U.S Senate Rachel Martin\nAnd I'm Steve Inskeep not the senators liked each other before but consider what it's like going to work now\nBritain's conservative party tries again to agree on a breakfast land that has a chance to work in Chicago a police officer tried as he defended the shooting of a Seventeen year old and is trying to extend his influence in Africa plans to build an entire new city in Morocco\nWednesday October third the river and Al Sharpton there's\nAnd then the next\nLine from NPR News in Washington on core of the Coleman the Nobel Committee has awarded this year's Nobel Prize in chemistry to three scientists one half goes to American Francis H Arnold she will share the other half of the prize with American George Smith and Britain sir Gregory Winter\nThe Nobel Committee says their work has led to international developments being used to promote a greener chemicals industry new materials and to make items such as sustainable biofuels and pharmaceuticals\nThe White House is rejecting a New York times investigation into President Trump's wealth NPR's Giles Snyder reports the administration is calling the New York times report extremely inaccurate\nHouse spokeswoman Sarah Sanders called the story misleading in a statement and so the IRS reviewed and signed off decades ago on what the times says we're suspect tax Dodgers\nTrump lawyer Charles Harder to all the time so facts at sites are extremely inaccurate the New York state tax department however says it is reviewing the allegations outlined in a lengthy story the paper says it's based on my bass trove of documents\nIncluding tax returns and other confidential documents from the real estate empire the president's late father\nThe times says President Trump and his siblings increased the wealth they receive from there\nParents through questionable financial moves that included a sham corporation used to disguise millions of dollars and gifts trials Snyder NPR News Washington\nMost every one cell phones are going to go off today at two Eighteen pm eastern time in the U.S the federal emergency management agency is testing a national emergency alert famous weighed winter says there are three kinds of alerts\nOne for him and it threats of one for amber alerts and then another category for presidential or ... it alerts that are of national importance or national catastrophic incident says\nHe says people cannot technically opt out of the message you'll have to dismiss it from your phone\nIn Indonesia time is running out for earthquake and tsunami victims still buried under rebel and debris Indonesian disaster officials have increased the death toll to more than one thousand four hundred people Michael Sullivan reports on the Indonesian rescue efforts\nA spokesman for the national disaster mitigation agency said in Jakarta that rescue workers have reached all four of the worst affected areas but he declined to give an estimate on casualties\nThree of the areas had been largely cut off since Friday by roads damaged by the earthquake landslides and down bridges\nOfficials say heavy equipment to clear the rubble are still in short supply and increasingly desperate survivors are still waiting for food and water and medical supplies many still sleeping outside five days after the quake\nMost of the dead reported so far were found in the city of ... where nearly a dozen military flights carrying relief supplies landed Wednesday morning for NPR News I'm Michael Sullivan in the non Vietnam\nThis is NPR support for NPR comes from NPR stations other contributors include T Rowe price offering a strategic investing approach that examines investment opportunities firsthand\nInstitutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nFrom W. A. B. E. news in Atlanta good morning I'm Sam Whitehead\nAtlanta's public schools will start twelve days later next school year city's board of education approved a new calendars earlier this week they run through twenty twenty to all of them push back to start at the school year wall still releasing students before Memorial Day\nNext year students start back August twelfth with shorter breaks and fall and winter a PS says it made the changes after gathering feedback from a community wide survey and talking with parents and teachers and other disclosure W. A. B. east broadcast licenses held by the Atlanta board of education\nControlling the rising costs of Georgia power's nuclear plant Vogel expansion dominated the debate yesterday for the candidates seeking a seat on the Georgia Public Service Commission\nThat commission regulates George power Democrat Lindy Miller said there should be a cap on how much can be spent on the project since ... much of the costs are passed on to rate payers\nIf you're going to build a house you don't go to a contractor and say take as long as you want to spend as much as you need you only do that if your neighbors were paying for it and that's what we've got here with plant vocal\nVocal project as many years behind schedule and billions of dollars over budget incumbent Republican Chuck eaten said that PFC did react when Georgia Power announced its latest price increase for the vocal project\nAnd I did not have good answers for that he said he didn't remember what he said right after the shooting 'cause he was in shock and couldn't explain discrepancies with the video and he was he was combative with prosecutors he seemed almost annoyed that he was being questioned\nIt as initial reports say anything about that look on the suspect's face or the the turn or anything else\nIt didn't say anything about the look but it did actually described in great detail alleged movements five on McDonald's the wave of the night raising the knife and and it describes officer Van Dyke backpedaling from McDonald none of those things are on his asked him video\nPatrick Smith of member station WBFO easy in Chicago is covering this trial and his reporting among other people's reporting can be heard on that stations podcast called sixteen shots Patrick sacks thank you\nFor California men who belong to a white supremacist group have been arrested and charged with rioting at the unite the Right rally in Charlottesville, Virginia last year they could face ten years in prison for member station WBHM ATF Sandy Hausman reports\nOn the night that for a violent white supremacist rally in August of twenty Seventeen several hundred men marched across the University of Virginia ... towards\n\nThe next day four of them allegedly punch and had been in several people including an African American men to women and declared you met us attorney Thomas Collins says the accused belong to a group called the rise above movement\nThis was a group that essentially subscribes to anti Semitic racist ideology and then organizes trains and poised to various political rallies to engage in acts of violence against folks who are taking a contrary point of view\nThis same men are accused of violent behavior and three other rallies in California and Collins says he has plenty of electronic evidence against them including social media posts and video\nSurveillance video phone video journalists video from August eleventh in August twelfth we have more digital electronic evidence and video form that investigators did in connection with the Boston Marathon bombing\nThe U.S attorney said there was strong support from Washington for his Thirteen month investigation\nThere's a clear directive from on high that these cases need to be taken very seriously\nAnd he suggested this week's harass might not be the last\nThe FBI's hard at work the Virginia state police as hard at work I have a prosecutor my office who literally has done nothing else since August twelfth\nUp twenty seventeenth and work on these cases were not finish we're going to follow every lead into war satisfied that we've done all we can do with respect to what happened in Charlottesville\nSpecific charges against the Forman include rioting and conspiracy to riot each of which carries a maximum penalty of five years behind bars Benjamin daily Thomas Galen Michael miss Alison coal white may be arraigned in Charlottesville next week\nAnd the U.S attorney said the case could go to court my years in for NPR News I'm Sandy Hausman in Charlottesville [noise]\nThis is NPR News\n[noise]\n\nJust ahead on MORNING edition we'll check in with the W. A. B. newsroom UPS airline mechanics have rejected a contract with that Atlanta based company will have more in just about twelve minutes but first China has plans to build an entire city from scratch mere Morocco was coast with Europe\nFrom where they hope to export to both African into Europe but that project is facing some challenges will have the latest straight ahead of Sam Whitehead thanks for joining us for MORNING EDITION on member supported Ninety point one W. A. B. E. Atlanta\nSupport for WABC comes from a village theater celebrating ten years of improv comedy in Atlanta old Ford toward October fifth and sixth guess performances by ...\nCameron day fuel from great news ... Jones from Breaking Bad tickets at village comedy dot com and from Georgia Power investing in power and then people currently the plant Vogel project employs more than seven thousand workers once on line that will create more than eight hundred permanent jobs details or Georgia Power dot com slash nuclear\nWe can expect partly sunny skies with high in the upper eighties today that much of a chance of rain we've got sixty seven degrees and are clear skies currently in Atlanta it's sixty foreign Shandling anti road our time is six twenty [noise]\n\n\nNo matter how you listen to W. A. B. eat smart speaker mobile apps for radio we still need your help\nYour donations important he paid for programs like marketplace wait wait don't tell me and fresh air\nAnd this fall you could have more public radio because as soon as we hit our overall membership goal we and the campaign\nAnd your contribution now before the drive starts counts so help us out at W. Amy he dot org slash donating thanks\nSupport for NPR comes from the station and from at last in a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at ... dot com\nFrom gobble a meal kid company that delivers semi perhaps meals to be finished at home in Fifteen minutes with one parent\nGobble Suchet due to prep work like shopping and marinating this week's menu is they're gobbled dot com slash NPR and from Linda ... bell learning process is committed to helping all students learn to their potential [noise] they're learning centers and online private school offer instruction and reading comprehension\nEight hundred three hundred Eighteen Eighteen\nThis is MORNING EDITION from NPR News I'm Rachel\nMartin and I'm Steve Inskeep China is making investments around the world which matters because where China's money goes power may follow our next story takes us to Morocco where China's plans to build an entire city\nFrom scratch it's near miraculous coast the Chinese hoped to export from there to Africa Europe but the project is driven with pitfalls\nPossible evidence of how China's global expansion is not going to be easy NPR's Ruth Sherlock reports [noise]\nSigning ceremony between ... king and the country's new Chinese business partner the audience in the city's tens yeah which is a flashy promotional video for the new city\n... ... also political shares whites tree lined boulevards gleaming skyscraper this estimate lush gardens and an industry hub for everything from our new takes to the latest technologies and renewable energy\nIn old it will be home to some three hundred thousand people in the ceremony shown on local television ... the c._e._o. of a Chinese company to high too great laid out the scale of the company's commitment\nWe have to be able to do you expect to create a hundred thousand jobs and attracted a hundred Chinese companies that will create materials for planes cars textiles and the manufacturing of machinery\nLeast says this marks a new relationship between China and more okay [noise]\nWhen the deal was signed last year the Moroccan government said the ... factory would be built by the spring of two thousand to Nineteen we arrived though to find new construction tool\nIs nothing haven't [noise]\nI don't see that the coon up somebody from the local municipality to check if we even in the right place on the way it is and has got the issues is we've arrived [noise]\nYou can see mile after mile of ... undulating Scott land as sins and the jazz is extremely rural I'm watching a farm I Will kiss to ... field there is some sheep and the distance [noise]\nGoing for us later with heavy Brussels will train children early after the\nFirst the road in a cafe we meet with such a eight year old ... he gets his last name because he worries that talking to us we'll go local officials will so ...\nArea we're looking over is owned by the region now how not the people anymore some people are OK with the situation and others aren't\nIt must have just says he's waiting to see if the project to even happen you know is the question is but it's a sensitive one that's because the project goes beyond business to the highest of political height\nGrand plans to the city were made during a state visit by ... came to\nChina in two thousand and sixteen\nSerenaded on national TV\nBuys full broad spanned China and brokered promise to become partners on everything from the environments to the minute tree and the economy\nAnd today in rural coat it feels as though China is everywhere there are a manager in language centers and the main cities never joined political Institute's\nJapan the former general secretary for the private Moroccan confederation of tourism now runs a travel agency she says the number of Chinese visitors have sky rocketed was started all this month into thousands or tens of thousands do this and we close ...\nAs the country goes into what many stories would say is the biggest challenge making them has faced since World War two ah so that's she's going to be coming on actually very soon and we'll be hearing what she has to say what half her critics said well she has a lot of critics but the probably the most prominent one is a man named Boris Johnson he's the former foreign minister\nHe's frankly seen as widely gunning for a ... job and he gave a big speech yesterday where he trashed her plan to leave the European Union she calls for one for more close relationship with the youth still be able to trade goods seamlessly he\nCalled this a a cheat an outrage not what people voted for back in two thousand and sixteen he'd like to see a sharp break with the European Union a more independent independent Britain and and here's what he said yesterday\nIf we get it wrong army proceed with these undemocratic solution if you may have often offer we will portray these talks the\nTedious isn't toxic tedious business it certainly is toxic how does the prime minister responded\nWell she uh put him down gently uh yesterday on the on the TV he she said Boris and that's not how everybody refers to him he's a major figure here always puts on a good show one of her criticisms is that the plan that I'm Mr Johnson's putting out there\nUh she says doesn't really address the need to avoid a new hard border on the island of Ireland this is a huge issue we've been talking about right now as as you know Steve the borders seamless you can't even see it people and goods flow freely across in the Irish people in Ireland they they want it that way\nUm there's a real concerned that it could change and she one of the reasons she's trying to continue to have good going back and forth with the ...\nIs do avoid a border of any kind\nOf behind these details I have an image Frank Langfitt of an ocean liner I don't know maybe the Titanic had important iceberg and you've got several people jostling for control of the wheels Boris Johnson being one of them what if what we're rank and file conservative thinking this\n[noise] well I I think that for the moment I think they're going to stick with prime minister may it's it's sort of hard to imagine\nGiven the stakes here that they would switch horses in midstream and wall Mr Johnson is a very good performer in terms of speeches there there are concerns that he's not the right guy\nFor such a delicate time I was talking to a man named Anthony Martin he's the chairman of east Hampshire conservative association and and here's how he put it yesterday in Birmingham\nHave would be great to have the big picture break firing people but he would need a vote on they can deal with a D so\nWould you want to see him as a feature hands\nYes and no I'm undecided\nI Am a supporter of or is he he's a ... character\nYou eat a lot in on the um ... character\nHits it's an expression here in the United kingdom Martin ... is this sticky dark brown foods bread and it's probably Britain's most divisive food products [laughter]\nWell I suppose\nThey get on the same page and come up with a plan is there any chance that the Europeans are going to accept the ...\n[noise] well that's that's a very good question and we what was interesting to see it as we haven't seen a new plan they sent her back to the drawing board or the leaders in Brussels\nAnd we're waiting to see what she's going to come up with negotiations right now seems stalled um and we just got to meeting two weeks to go um and the concern is if they don't come up with a deal they could you take a crash out of the you could do a lot of damage the economy here\nNPR's Frank Langfitt always a pleasure talking with his are happy to do it Steve\nThis afternoon at exactly to Eighteen eastern time you can expect to get a presidential alert on your cell phone it's not exactly from President Trump rather it's a test and a new nationwide warning system that a president could use in case of an attack by another country or a cyber attack or a widespread natural disaster\nStill some worry President Trump could abuse the system NPR's Brian Naylor reports\nBack in the days of the Cold War it was pretty common to hear this announcement on TV or radio you know the one this station is conducting a test of the emergency broadcasting system\nThings have gotten a little more sophisticated now but basically the same minute long emergency alert system test is conducted every month or so and broadcast cable and satellite TV and radio\nThere'll be one of those this afternoon to but today you'll also be getting an alert on your cell phone has some of us receive alerts already amber alerts for missing children or flash flood or tornado warnings but this is the first time that you'll be getting a national presidential alert from FEMA\nRuin red letter is director of the national Center for disaster preparedness at Columbia University says testing the system makes sense\nI think having a thing\nOf this new wireless emergency alert system is\nA good idea that you can think about the writing of scenarios where it would be good for the president to be able to speak directly to the war\nBut this is where Dr redlin or has some qualms especially says when it comes to this president\nWe showed her effect that the president might be using such a shift for clinical purposes or create a diversion of the presidency without a threat\nFor whatever reason so I think there are real sure it'd be so what about it but these are not ours that many Americans would want to give to Donald Trump\nRed letter is not alone last week three people filed a suit in New York to block the testing of the system known as wireless emergency alerts or W E s\nThe suit states the plaintiffs are Americans who do not wish to receive text messages of any kind on any topic or subject from President Trump\nThey say the government is violating their privacy and the sanctity of their homes and it wants to turn people cell phones into government loudspeakers that compel listening\nFamous says that accusation is baseless\nBackground briefing for reporters a senior FEMA official conceded while there is no opting out of the alert system is very well governed and you would not have a situation where the president would just wake up one morning as the official put it and attempt to send a personal message\nAnd decides he has Twitter for that Brian Naylor NPR News Washington [noise]\nAnd coming up later today on all things considered we'll hear from one of the beneficiaries of the new NAFTA trade deal President Trump signed this week it was approved by Congress it will spare carmakers from terrorists they feared to listen to that story ask your smart speaker to play NPR or ask for your local member station by name [noise]\nThis is NPR News\n[noise] just ahead on the marketplace morning report will look at my Amazon recent decision to raise the minimum\nWage to Fifteen dollars an hour is the most other things a smart investment move that Anna consideration of all the morning's business do you stop and under ten minutes but first the Nobel Prize in chemistry has been announced well look at the winter and their work straight ahead\nI'm Sam Whitehead thanks for joining us on member supported Ninety finally won W. A. B. E. Atlanta\nFor a T L meets NPR\nSupport for WABC comes from academe of the folks whose rigorous academic and forward thinking programs redefined the high school experience an open house will be held on October twenty fourth\nTo learn more visit academe Atlanta dot org and from booth western art museum offering more than six the original works by the world's best known American western artist in treasures from the Frederick Remington art museum and beyond through January Thirteen more booth museum dot org\nWe can expect partly sunny skies today with ties in the mid eighties not much chance brain currently sixty seven degrees on a clear skies in Atlanta it's sixty four on the street corners and in Douglas so our time is six forty three [noise]\n\nOn Sunday Brazilians vote for their next president and polls suggest many women are not happy with the choice\nWe've had enough and not only women but he ... he can eat any and all minorities in the world and feel like\nThey are not represented in politics\nI'm Ari Shapiro women are protesting Brazil's leading candidate with the hash tag not him\nThat story this afternoon on all things considered from NPR News this afternoon at four on Ninety point one W. A. B. E.\nW. H. B. E. began serving Atlanta Seventy years ago in the early days we\nSounded like this Red Barber and joins us now from Tallahassee, Florida read good morning or good morning colonel come\nAlong the way we have all this is Carl Kasell each weekday morning NPR and W. A. B. E. and\nWe grew into what you know and love today from W. H. B. E. N. Atlanta this close to look for Tuesday them this is double UAB serving Atlanta since Nineteen forty eight\nSupport for NPR comes from this station and from zoom zoom offers cloud video conferencing online meetings that video conference room solution and one platform featuring digital video and audio with screen sharing account registration and more at zoom dot us\nFrom visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide visiting angels America's Choice and senior home care office locations ... visiting angels dot com and from the sustaining members of this NPR station\nSee I'm London is up more tense of a percent Dallas in the ... teachers are up in the two to three ten percent range with about future of fifty seven points the tenure treasury all does it three point zero eight percent\nMarketplace morning report is supported by criminals pay child payroll talent and time keeping in one unified systems designed with a streamlined implementation approach for small and medium size businesses across the globe learn more criminals dot com crash into the workforce innovation networks\nHand by for X. dot com committed to empowering and helping traders seize opportunities in currency markets since Nineteen Ninety nine dot com it's your World Trade it for a training in a significant risk of laws\nAnd my legal soon offering a network of independent attorneys who can provide the advice your business needs more legal assume dot com slash marketplace\nAccording to the Federal Reserve bank of Cleveland nearly half of all workers will at some point get displaced doesn't mean they get fired it means their jobs just disappear through no fault of their own recovering from a displacement can take decades but you know what can help\nLiving near your parents according to a recent study from WC piano Idea Stream in Cleveland ... explains\nA couple of years ago ... mackenzie was working at a pop culture magazine in New York she was there on contract but says she loved it then one day\nIt was very abrupt and I just kinda got an email and the middle of the night thing your contract is no longer going to be continued\nBefore long the now thirty one year old McKenzie says she was pretty much broke so she made a phone call she'd been dreading\nI had in the real is talk with my parents and I was so scared and I was crying but I was like look guys I Need your help\nHer parents in New Mexico started sending our money to cover rent and other expenses but more than a year later she says she's still struggling to find steady work my parents and other people have said why don't you go home wouldn't that help her get back on her feet more quickly\nWell Cleveland fed economist ... actually looked at this question he and his colleagues comb through data on twenty and thirty something's who've lost their jobs\nAnd they found an interesting pattern young adults who lived close to the parents actually do a lot better after displacement event than people who live farther away after an initial job loss he says both groups saw their annual incomes drop about ten grand\nBut those who live near their folks return to their previous level of earnings within a decade well many who live far away never fully recovered is the moral of the story like\nStay close to home no that's not the most of the story Kerlikowske says there's a big ...\nParental proximity mainly benefits displaced workers with kids of their own you know free childcare but also research shows people who move away from home often make more money not that that's much comfort forever McKinsey who's currently working part time as a producer out of New York radio station\nIt's been rough and it's been embarrassing\nBut she says she's fortunate to have parents who can help and she's not alone in a recent bank of America survey roughly a third of millennials said their parents help pay for rent\nIn Cleveland I made three miles from marketplace [noise]\nI'm so we better short with the marketplace morning reports\nFrom eight PM American public media\nLocal support for marketplace comes from Asbury law firm\n... council representing individuals' partnerships and corporations in\nFederal tax controversies and complex federal tax litigation learn more it Ashbury law firm dot com and from Dr roof serving in Atlanta for Thirty years Dr roof offers roof installation roof repairs siding windows ... almost everything you hold dear as under your roof\nWhen you're home needs a house call Dr roof\nStay with us just ahead on MORNING edition Donald Trump's wealth and businesses have been a core part of building his political identity as a leader now major investigations are challenging his narrative that his finances we'll have more on that and under ten minutes after a check up the mornings top stories from the NPR and W. A. B. E. newsrooms\nYou're starting your day in the new with MORNING EDITION here on member supported Ninety point wind W. A. B. E.\nAtlanta I'm Sam Whitehead but have you along this Tuesday Morning or time now it's seven o'clock\nThis morning we know a little more today about President Trump's finances how he acquired much of his money from his father\nA judge in Atlanta today will decide to open whether or not open transcripts from a lynching case from Seventy years ago we'll have more\nTimes reports Trump's father funneled him hundreds of millions of dollars in various ways to avoid some taxes at according to Forbes the president has tried and failed to profit\nPresidents and I'm Steve Inskeep and I'm Rachel Martin that death toll continues to buy\nLike an enormous in Indonesia suffered out after that\nAnd the decades old back story of American like is\nAnd the news cast is coming up next\nLive from NPR News in Washington encore but Coleman to Americans and Britain are the winners of this year's Nobel Prize in chemistry one half of the prize goes to American Francis Arnold she will share the other half of the prize with American George Pete Smith and Britain Gregory Winter\nYou're on Hudson is secretary general of the royal Swedish Academy\nThis year's prize is about harnessing the power of evolution\nHe says the scientists use the same principles of evolution to develop proteins these have led to solutions for chemical problems and include making sustainable fuels and new medicines\nAnd attorney for a woman accusing Supreme Court nominee Brett Kavanaugh of past sexual assault he's condemning President Trump for making fun of his client NPR's Giles Snyder has more reaction to Trump's remarks at a rally in Mississippi\nAttorney Michael Brown which is responding to President Trump's speech and south haven Mississippi and what she was cheered by the crowd when he did his version of the back and forth during Christine Blasey Ford's testimony before the Senate Judiciary committee\nWas it and I don't know\nI'm when I was I don't know but I haven't been\nFollowing Trump's speech problem which took to Twitter saying it was a vicious violent soulless attack on Fort gold for to remarkable profile in courage and President Trump of profiling cowardice\nTrump is planning to appear to more campaign rallies this week as he seeks to boost Republicans November's midterms ... NPR News\nDisaster officials in Indonesia now say more than fourteen hundred people have been killed by last week's earthquake and tsunami on to the west the island NPR's Julie McCarthy has reached the provincial capital Paolo\nIt's been a long journey into ... but once you get here you start to feel and see the effects and the impact of this earthquake you can detect where the roads are cracking\nNPR's Julie McCarthy white Chicago police officer charged with murdering a black teenager testifying on his own behalf on Tuesday NPR's Cheryl Corley reports the officer said the teenager could have stopped the shooting if he had obeyed police orders\nTwenty fourteen Jason Van Dyke joined other police officers answering the call about someone breaking into vehicles Seventeen year old the climate Donald was walking on a busy Chicago street\nHe had a knife and didn't drop it after police ordered him to do so the other officers were waiting for a taser when Van Dyke arrived video shows McDonald walking away but then I testified he thought officers were under attack he shot McDonald sixteen times\nYou could've made a decisive germ and walked in the opposite you rushing anything and all you could have drawn a nice way in his ended it All right and in their\nVan Dyke is the first Chicago police officer to face a murder charge for an on duty shooting in decades Cheryl Corley NPR News Chicago you're listening to NPR\nSupport for NPR comes from I drive maker of remote PC providing real time access to PCs max and servers from anywhere for use when telecommuting or for remote managements learn more at remote PC dot com slash\nNPR Andy any Casey foundation from W. A. B. E. news in Atlanta good morning I'm Sam Whitehead the two major candidates\nFor state school superintendent had similar approaches to classroom safety but they disagree on whether or not to arm teachers\nThose appeared in a debate yesterday sponsored by the Atlanta press club Republican incumbent Richard wood says arming teachers is a local decision that should be made by local officials which says his administration is focused on safety including providing extra support for at risk kids\nSchool safety has received a million dollars and we will also look at the school environment and in the school itself for what goes on\nHis Democratic challenger oh distorting junior is against arming teachers but does support wraparound services he says the current superintendent only recently and praised doing things for students other than just teaching them\nImagine the years that we've wasted and not providing those services to not addressing the mental social emotional needs ... students\nElection day is November sixth\nOf federal appear appeals court judge in Atlanta is set to hear oral arguments today about whether to open courts transcripts from a grand jury lynching proceeding for more than Seventy years ago Disney shopping has more\nI think if you have an issue that concerns women um or liberal politics or even voting cases I think there's a real concern as to whether he can be fair\nIssues concerning women you're saying that you would be making an argument of you were a lawyer before the court that he shouldn't be judging anything concerning women I mean I\n... I don't know that I Would make that argument that far but I was like I think there are certain issues look there were already issues about whether he could fairly judge issues on presidential power and there were lots of discussions about whether he needed to recuse at the beginning of this process\nAll because President Trump might conceivably have some case before the court involving a camera\nI think there are numerous cases that could come before the court involving President Trump and a judge Kavanaugh has made lots of comments about the extent of a presidential power so that was a concern already\nAnd I think his demeanor last week um shows that there are a lot more concerns about his temperament\nJob at the American Constitution Society thanks so much\nAnd get a new State Department visa policy declared that starting this month and diplomats who want to bring their same sex partners to the U.S will have to be married Here's NPR's Michele kill them in\nA State Department official says marriage equality is the love the land here in the U.S so when it comes to granting visas the U.S is now ... same sex couples the same as heterosexual couples with limited exceptions diplomatic visas will now only be granted you legal spouses\nOn the face of it this sounds fair says ... Kamara of human rights watch but she worries the U.S is ignoring reality\nSame sex marriages only legal in twenty five countries\nAnd perhaps more concerning in over Seventy countries around the world they conduct is illegal it criminalize it's been ... by throwing people in jail by beating like eating a lot of countries how can we ignore that when we make policy here in the United states\nShe's expecting a lot of shot gun weddings which he fears could but some diplomats at risk back home\nDiplomats and un officials are already here have until the end of the year to produce a marriage certificate if they want their partners to maintain their visa status\nThey could be exempted if the country they represent respect the rights of Americans at embassies abroad but as ... points out staff at international organizations or in a different category\nWhat's really inequitable I think is that the U.S in a World Bank or other international organization that don't have that option because there is nothing that those organizations can offer the Trump Administration and return\nState Department officials who only spoke on background said they will work with individuals on a case by case basis\nThey say there are only a hundred and five families in the U.S it will be impacted by this at fifty five of them at international organizations and the officials at most are from countries that do recognize same sex marriage Michele ... NPR News the state department [noise]\n\n[noise]\n\nAnd you're listening to NPR News\n[noise]\nJust ahead on MORNING edition we'll check in with a W. A. B. E. newsroom carmakers in Georgia may have to buy more domestic parts to avoid tariffs under the new agreement that will replace NAFTA all I Believe it's on that and hundred twelve minutes\nBut first if during the Korean War a U.S Marine Division was surrounded and out numbered in the dead of winter\nIn five percent of these men suffer from frostbite many died of exposure none of these troops were prepared for fighting in these kinds of conditions\nWill take a closer look at that brutal battle straight ahead I'm Sam Whitehead thanks for joining us for MORNING EDITION of member supported Ninety point one W. A. B. Atlanta\nSupport for WNBA he comes from Georgia states Robinson college presuming its top ranked Seventeen months executive m._b._a. program or you ready for what's next in your career applications are now being accepted for the next book club cohort incoming E. M. B. A. students can burn lean six sigma\nGreenville certification plus ... user to participate in change leadership took or data analytics well was reading an MBA Gmail waivers or available more information at the NBA dot genius you dot edu\nWill have partly sunny skies with high in the upper eighties today so much of chance of rain we've got sixty seven degrees that are clear skies in Atlanta it's sixty dream Conyers and fill a record our time is seven twenty\n[noise]\nYou listen to the W. A. B. E. because public radio is important to you so why not give members are important to us as the programs are to you but we're trying something new for the fall Dr will end the campaign when we reached the overall goal of seven thousand Seventy donations and contributions coming now before the dry begins account\nSo given now at W. A. B. E. dot org slash donate\nDetails you Amy ... dot org slash Seventy sanity\nSupport for NPR comes from this station and from little passports a monthly subscription service for kids each package includes games souvenirs and activities from a new country designed to spark curiosity and cultures around the globe at little passports dot com slash radio\nFrom west in hotels and resorts west and is committed to the wellbeing of travelers with offerings like heavenly bags a super foods are ex menu and gear lending for winning workout gear is left behind it home west and let's rise learn more at West in dot com\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nThis is MORNING EDITION from NPR News I'm Rachel\nMartin and I'm Steve Inskeep the historian Hampton Sides has been exploring the origins of the U. S. conflict with North Korea he's written the history of Americans in a brutal battle in the dead of winter which happened when Americans try to unify north and South Korea\nShift and she still has\nA radio announcer giving the news of the U.S military landing at a port city near Seoul in Nineteen fifty [noise] North Korea that started the war invading the U.S back south the United states and its allies struck\nBack with this landing commanded by one of the ... most famous general\nDouglas MacArthur his landing works as this old movie newsreel proclaimed\nThe war and read the turning point I was a fire started and certainly move on the north Koreans\nSeemingly Hampton Sides says MacArthur is forces recaptured South Korea's capital\nAnd he began to get kind of greedy\nThe new book on desperate ground examines the plan that MacArthur devised next\nWhy stop there why not go all the way to retake all of Korea unite the peninsula under one democratic government\nMick Arthur's troops crossed the famous thirty eighth parallel dividing north and south\nBut what U.S forces did not quite know as they moved into North Korea was the neighboring communist China considered the Americans the threat and a huge Chinese army was soon crossing the border to oppose them you're a landmark called the chosen reservoir\nIt was initially and intelligence failure we simply didn't know at first because the Chinese were expert at camouflage they moved only at night um they never used roads they were a foot army but then intelligence did begin to trickle in crystal clear and MacArthur didn't want to believe this because\nHe wanted to finish the job by Thanksgiving get the war over with and so he sweat this information under the rug\nWhat was the landscape and the situation in which a U.S Marine Division found themselves around a reservoir in North Korea in the winter of Nineteen fifty fifty one\nMacArthur ordered the first Marine Division to advance to this reservoir up in the mountains of North Korea to take it and to keep on going to the Yalu but the commander of the first Marine Division whose name is general Oliver Smith\nRealize that this was a perfect scenario foreign circle meant he was very precious and he seemed to know that a big battle was going to happen\nOn the shores of this frozen lake in the mountains of North Korea sounds like it was pretty cold eighty five percent of these men suffered from frostbite many died of exposure\nNone of these troops were prepared for fighting in these kinds of conditions\nYou given incredible detail of an American marine who is attacked with the rest of his unit by the Chinese it's the middle of the night it's incredibly cold he leaps out of his sleeping bag and only realizes after fighting for hours that he had never managed to put his boots on you\nKnow this is Hector calf Retta to receive the Congressional Medal of honor for his exploits that night\nYou may have killed over a hundred Chinese soldiers who came wave after wave after wave at him and his position the Marines in parts of the battle were outnumbered tend to one by the Chinese and he never killed a man before I've never been in combat and suddenly her he was surrounded\nThen some of the other areas like a ... which has been very very badly hit and still being explored as to the extent of\nOf the damage there but you approach this and you see obviously you know the the marks of\nDestruction along the coast or the houses are destroyed on both sides of the road and then as you move into Paul do you see along the bay\nJust nothing but houses that have been snapped like twigs UC\nCement homes that are leaning in into the bay and every part of human existence is strewn among the debris so you know something very powerful came through here have you had a chance to talk with survivors yet\nYou know I did and I of course you ask them what was that like um and generally you knew they look at you and they said we were just panicked\nAnd there was no time to act\nIn fact one man said I my sense is just went blank and I turned and I I felt the quake and I turned and almost immediately he said he saw a wall of water\nAnd he said you may think we sounds selfish I sound selfish to say this but all I could think of was to run I didn't even think of how I was going to save my father in this disaster and his father indeed has ... has perished his\nHouse is gone and his livelihood is gone and he goes and he sits there with his friends and they figure out how they're going to rebuild their lives for people who lived along the beach you know they had cafes along the beach and now they have absolutely nothing and they go from area to area trying to find food and water\nHow are they coping with that I mean is aid getting through to these people who need it most\nWill aid is slowly making its way into this devastated region the central government is putting a priority it says on transportation and and waste treatment and a\nA tense and and and generators you know there seems to be a disconnect you see it as disconnect where the government will talk about how it has reached out and to the international community and and and that they are responding and a lot of international communities will say yes but\nWe're burdened by a bureaucracy and in some cases we have not been invited but the Hercules transports the own Indonesians are flying twice a day care and food and clothes and volunteers NPR's Julie McCarthy\nSpeaking to us from the city of ... on the Indonesian island of ... wasting thanks so much Julie thank you [noise]\n\nJust days ago President Trump said testimony against his Supreme Court nominee was credible in a political speech last night in Mississippi the president shifted to mocking Christine Blasey Ford who accused Brett Kavanaugh sexual assault but didn't recall every detail\nHow did you get home I don't remember how'd you get there I don't remember where is the place I don't remember how many years ago was that I don't know [noise] for the mockery\nCame at the same time that the FBI was trying to corroborate those charges if possible the agency has been given no more than a week to look into the allegation about the Nineteen eighties how's that possible to do NPR's Martin Kaste reports on what this FBI background check is and it's not\nIf you're following the breathless coverage on cable news you get the impression this investigation is pretty serious\nBreaking news comprehensive pro but listen carefully to how it's being described president\nUs with sexual assault allegations against Supreme Court nominee Brett Kavanaugh to catch\nThat this is an investigation into sexual assault allegations but it's not as a criminal sexual assault investigation and that's pretty parents are the people who usually do does the local police\nWere falling at a little bit ah some more than others\nThat Steven Cooper commander of the criminal investigation division for the police department in ... Texas outside Dallas he's done a lot of sex crime investigations but he's glad that he's not doing the Kavanaugh case\nWe wouldn't want to have any part of that given the the nature of how public that investigation is because anybody with any social me or who's watched it on TV has turned his arm so any potential witness for victim is um let's say painting\nIf Cooper did have this case he'd probably approach it differently from what the FBI is doing\nThat because in recent years police have been moving toward a model called trauma informed interviewing Rebecca Campbell is a research psychologist at Michigan State who's helped to promote the new standard which takes into account that it's normal for victims to sometimes get their facts wrong\nWhat trauma informed interviewing saying just because they might have difficulty answering the question or they might have some inconsistencies it doesn't necessarily mean that they're lying it doesn't necessarily mean that there's a problem and the case it means keep an open mind and continue the investigation\nThat kind of slow non confrontational style is not what FBI background checks are usually like background checks focus on the inconsistencies as agents ferret out signs that someone is lying or compromise door hiding something\nThe FBI is just gathering information for prospective employer and the standard of proof is lower still Tom ... says you could do an actual criminal investigation into case such as Kavanaugh's assuming the state statute of limitations allowed it\nThere are clearly hurdles to delayed recording but that doesn't mean we shouldn't investigate thoroughly\nTrump believes the retired police chief of Burlington, Vermont where he both worked in oversaw sex crime cases and now he helps to train sex crime investigators while it's hard to build a criminal case when the alleged attack happened decades ago when there is no DNA evidence he says you should still try\nLooking at the circumstances hearing from any outcry witnesses that the victim ... through the years looking for other victims of this offender becomes a big piece of this ... but\nThat kind of approach especially when you start looking for similar tax but at the same person takes time weeks sometimes months when the police do it and that kind of time is not a luxury that the Senate has allowed the FBI Martin Kaste NPR News [noise]\n\nIt's MORNING EDITION from NPR News\n[noise] ah [noise]\nStay with us just ahead on the marketplace morning report when it comes to high speed broadband Internet rural areas tend to lag behind their urban counterparts look at how this digital divide is creating notice\nDisadvantages for businesses working out of America's farm country look at that with the consideration of the rest of the morning's business news and just under ten minutes but first we'll look at hotly contested Supreme Court nominations throughout history that straight ahead I'm Sam Whitehead thanks for joining us on member supportive Ninety point one W. A. B. E. Atlanta\nWhere a tale meets NPR\nSupport for WABC comes from fernbank museum where the science exhibits extend to be outdoors with Seventy five acres of nature trails a can of the walk and adventure for an childrens play areas tickets at fernbank museum dot org\nAnd from flat iron school coding boot camp with the curriculum and career support designed to help students get jobs once they graduate applications for flat aren't Smithtown campus or now open more at flat iron school dot com\nWeather today will have partly sunny skies but hide in the upper eighties not much of a chance of rain it's currently sixty Seventy degrees and a clear skies in Atlanta sixty six in ... in Kennesaw our time is seven forty three\n\n[noise] finally October and this weekend to land a syllabus with lots of awesome live music\nWe have Atlanta as premier hip hop festival on like the south by southwest of hip hop with a three day festival and why your server in a restaurant could be the next big thing singer songwriter it happened to me they have to do for fun\nMary's music mix tomorrow six forty five and eight forty five AM and just after three thirty PM Ninety point one W. A. V. E.\nW. eighty began serving the community Seventy years ago at the start or mission was to educate schools you'll\nAlways gives us the lives of joy [noise]\nAlong the way we ...\nWe'll keep all the\nAnd we grew into what you know and love today Ninety One if em being W. A. B. thank you Atlanta and\nThis is double UAB serving Atlanta since Nineteen forty eight\nSupport for NPR comes from the station and from Charles Schwab when it comes to wealth management ... believes in asking questions and being engaged so investors can better own there tomorrow learn more at Schwab dot com\nFrom Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security healthcare and science and technology leadership brown dot edu slash NPR\nThe foot the unlimited up six tenths of a percent Dallas and the NASDAQ teachers are up in the three to four ten percent range with the Dow future up Seventy six points\nMorning report is supported by Krohn owes HR payroll talented timekeeping in one unified system designed with history\nAnd implementation approach for small and medium sized businesses across the globe\nLearn more at ... dot com Corona's workforce innovation networks can buy for X. dot com committed to empowering and helping traders seize opportunities and currency markets since Nineteen Ninety nine\nFor X. dot com it's your world traded for X trading involves significant risk of laws and by legal zoom offering a network of independent attorneys who can provide the advice your business needs more legal zoom dot com slash marketplace\nA slow Internet is a drag on a business that is just as true for rural businesses as it is for urban once but high speed broadband access flags in certain rural areas the Federal Communications commission reports more than twenty four million people\nDon't have an Internet connection fast enough to for example stream a movie on the phone and the computer at the same time\nIllinois newsrooms Mary Hansen reports on the challenges of doing business across the digital divide\nGary Smith sits in front of two computer screens and an office next to grain elevators that can hold nearly two hundred million pounds of corn he works for the call farmers' co op and we're all living in Illinois\nPart of his job is tracking corn soybean and wheat prices on line at the Chicago Board of trade he says trade moves fast\nBam bam bam bam within a few seconds good change of medical or die you know in your favor\nThose nickels and dimes can up to hundreds of last dollars for farmers and other businesses and less populated places and that is a\nPart of rural America that really has the danger of being left behind\nThat surely Bloomfield she works with small Internet providers as the head of the rural broadband association she says one challenge is that a large telecom companies don't have the incentive to build our infrastructure to serve small towns it won't get and the return on investment that building up the more populated areas would\nThe costs are the same regardless of where you're putting that infrastructure the federal government has spent billions of dollars over the last decade to connect many outlined communities by Bloomfield says it still hasn't been enough I proposed new grant program and money earmarked and the twenty Eighteen farm bill\nCould funnel more funds to help build broadband in rural areas [noise]\nBack in Livingston shiny communications a local Internet provider Elaine fiber optic cables with help from federal loans to improve connections for five hundred customers they're the co op where Gary networks benefited from similar upgrades when they got fiber optic Internet a year ago\nCan save us a lot of money and also the farmers and that's what we're after\nBut despite these steps rural broadband surely Bloomfield says there are still millions who need to get up to speed\nIn Springfield, Illinois I'm Mary Hansen for marketplace\nIn in New York Times to prevent a short with the marketplace morning report [noise]\nFrom eight PM American public media support for WABC he comes from Emory Healthcare Emory Healthcare welcome\nStruck out medical to the family together every health care and the cab medical will deliver stronger more accessible high quality care close to home more at Emory Healthcare dot org slash the cab medical\nAnd from Jim desk its customer service and engagement platform connects companies with customers through email lived trip and phone support all from one interpretation read the company or customers want you to be more and more at ... dot com\nJust ahead on MORNING edition as senators or wait a new background investigation into Brett Kavanaugh the debate over his nomination is roiling the Senate\nWill have the latest in just about ten minutes back after a check of the mornings top stories on NPR WKBD newsrooms you're starting your day in the new with MORNING EDITION here on member supported Ninety point one W. A. B. E. Atlanta where each ... meets NPR\nI'm Sam Whitehead things so much for joining us this morning because you can check out our website W. A. B. eat outward from war ended up local coverage it's eight o'clock\nMorning President Trump longing and accuser of Supreme Court nominee Brett Kavanaugh for not we're calling every detail you went on to express concern or excuse men\nIt's MORNING EDITION from NPR News Atlanta\nSchools will start a bit later next year we'll have more than I Do for\nGood morning I'm Sam Whitehead\nHow has the Kavanaugh site changed the U.S Senate I'm Rachel Martin\nAnd I'm Steve Inskeep not the senators liked each other before but consider what it's like going to work now\nBritain's conservative party tries to get into a ... planet of jobs were in Chicago a police officer right as he defended the shooting of a Seventeen year old and is trying to extend its influence in Africa plans to build an entire new city in Morocco\nWednesday October third the Reverend Al Sharpton there's\nLoses next\nLine from NPR News in Washington I'm core of a Coleman the White House is sharply denouncing published report the details the wealth of President Trump's family the New York times reports President Trump and his siblings inherited sizable fortunes times reporter David Barstow till CNN the newspaper reviewed more than one hundred thousand pages of documents\nWe were able to track the Trump Trump parish frozen Mary ... transfer well over one billion dollars in wealth to the Trump children\nAnd that under the fifty five percent they just ... at the time turns translates tax bill of about five hundred and fifty million dollars tax records that we're paying ... ... children with family open we've heard just about to\nA lawyer for President Trump says the allegations are one hundred percent faults and defamatory and there was no fraud or tax evasion by anyone in the Trump family\nPresident Trump made fun of the woman who alleges she was sexually assaulted by Supreme Court nominee Brett Kavanaugh speaking last night at a rally in South even Mississippi Trump mocked professor Christine Blasey Ford for not remembering all details of the alleged attack in the Nineteen eighties people in the crowd clapped and left\nCabin on denies the accusation Ford's attorney says Trump is engaging in a quote vicious violent and soulless attack\nThis year's Nobel Prize in chemistry has been awarded to Americans and researcher in the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines Francis\nArnold works at Cal Tech but early this morning she was in a hotel room in Dallas texas sound asleep\nAt the phone rang and at first of course I thought it was one of my sons were the\nProblems nope it was the royals Swedish Academy of Sciences she'd been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can pick the best one for use in say an industrial process or a pharmaceutical\nShe shares the award with George Smith of the University of Missouri in Colombia and Gregory Winter at the end Marcy laboratory of molecular biology in the United kingdom Nell Greenfieldboyce NPR News\nNew government is taking shape in Iraq in ... Iraq reports there's a new president and likely a new prime minister\nKurdish politician bar ... Iraq's new president he was elected by parliament Tuesday night and he's chosen the politician likely to be the next prime minister it's Adel Abdul ... French educated economist who was previously in Iraqi vice president and Iraqi oil minister\nHe's believed to have the support of both Iran and the United states parliament needs to approve a new government within thirty days\nNPR's Jane Iraq you're listening to NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring or employers can post jobs and use greener questions to build their short list a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\nFrom W. A. B. E. news in Atlanta the morning I'm Sam Whitehead controlling the rising costs of Georgia power's nuclear plant and Bogle expansion dominated a debate yesterday for the candidates seeking a seat on the Georgia Public Service Commission a commission regulate storage power Democrat Lindy Miller\nThere should be a cap on how much can be spent on the project since much of the costs are passed on to consumers\nIf you're going to build a house you don't go to a contractor and say take as long as you want to spend as much as you need you only do that if your neighbors for paying for it and that's what we've got here with plant Vogel\nThe project is many years behind schedule and billions of dollars over budget incumbent Republican Chuck eaten said the ... seat and did react when Georgia Power announced its latest priced increase for the vocal project\n... during the last set of overrides we didn't allow one dime to go to George power rate payer went all to the southern companies' shareholders seven hundred million did\nThe total estimated costs for the project now stands at twenty five billion dollars\nAtlanta public schools will start twelve days later next school year the city's board of education approve new calendars earlier this week through the year twenty twenty to all of which push back distorted the school year all still releasing students before Memorial Day\nVan Dyke to not have good answers for that he said he didn't remember what he said right after the shooting because he was in shock and couldn't explain discrepancies with a video and he was he was combative with prosecutors he seemed almost annoyed that he was being questioned\nIs initial reports say anything about that look on the suspect space or the the turn or anything else\nIt didn't say anything about the look but it did actually describe in great detail alleged movements by requiring McDonald the wave of the knife raising the knife and and it described officer Van Dyke backpedaling from McDonald none of those things are on the dashcam video\nPatrick Smith member station WBFO easy in Chicago is covering this trial and his reporting among other people's reporting can be heard on that stations podcast called sixteen shots Patrick sacks thank you\nFor California men who belong to a white supremacist group have been arrested and charged with rioting at the unite the Right rally in Charlottesville, Virginia last year they could face ten years in prison for member station WBUR vps Sandy Hausman reports\nOn the night that for a violent white supremacist rally in August of twenty Seventeen several hundred men marched across the University of Virginia count towards [noise]\n\nThe next day four of them allegedly punch kid and had done it several people including an African American men to women and a clergyman us attorney Thomas colon says the accused belong to a group called the rise above movement\nThis was a group that essentially subscribes to anti Semitic racist ideology and then organizes trains and deploys to various political rallies to engage in acts of violence against folks who are taking a contrary point of view\nThis same men are accused of violent behavior and three other rallies in California and Collins says he has plenty of electronic evidence against them including the social media posts and video\nSurveillance video phone video\nAnd from ... school where the joy of a treatment is balanced with humility and generosity offering coed Catholic education for grade seven to twelve marriage school presents an open house Sunday December second from one to ... him more at ... dot com\nOur next story takes us to Morocco where China's plans to build an entire city\nFrom scratch it's near miraculous coast the Chinese hoped to export from there to Africa Europe but the project has driven with pitfalls possible evidence of how China's global expansion is not going to be easy NPR's Ruth Sherlock reports [noise]\nGrand signing ceremony between ... king and the country's new Chinese business partner the audience in the city of tangy watches a flashy promotional video for the new city ... ... also\nPolitical move it shares whites tree lined boulevards gleaming skyscraper this estimate lush gardens and an industry hub for everything from our new ticks to the latest technologies and renewable energy\nIn ... it will be home to some three hundred thousand people in the ceremony shown on local television lead the hour the c._e._o. of a Chinese company that high too great laid out the scale of the company's commitment\nWe have to be able to do you expect to create a hundred thousand jobs and attracted a hundred Chinese companies that will create materials for planes cars textiles and the manufacturing of machinery\nLeast says this marks a new relationship between China and moral code [noise]\nWhen the deal was signed last year the Moroccan government said the first factory would be built by the spring of two thousand to Nineteen we arrive though to find no construction tool\nIs nothing haven't [noise]\nBike on the moon up somebody from the local municipality to check if we're even in\nThe right place at the weather because it is an ass got done with the issues is\nWe've arrived [noise] you can see a mile after mile of gently undulating Scott land as some villages it's extremely rural I'm watching a farm I Will kiss to ... field there is some sheep and the distance [noise]\nThat don't keep growing fast Laden with heavy Brussels will train children on the off\nThe road in a cafe we meet ... year old ... he gets his last name because he worries that talking to us we'll go local officials with the idea of ...\nTech area we're looking over is owned by the region now how not but people any more than some people are OK with the situation and others aren't\nMr says he's waiting to see if the project to even happen this is the question but it's a sensitive one that's because the project goes beyond business to the highest of political height [noise]\nGrand plans to the city were made during a state visit by ... came to China in two thousand and sixteen\nSerenaded on national TV\nBuys full broad spanned China and grow up they promise to become partners on everything from the environments to the minute tree and the economy\nAnd today in rural ... it feels as though China is everywhere there are a manager in language centers in the main cities there we're joined by political Institute's\nJapan the former general secretary for the private Moroccan confederation of tourism now runs a travel agency she says the number of Chinese visited has sky rocketed\nStarted all this month in two thousand or ... thousand students and we close left you what you thought that was in ...\nThat would allow tower free trade on goods with the EU which of course the giant market over five hundred million consumers but would stop the free flow of ... workers coming here and no longer would you be subject to laws made in Brussels is this is the way that she put it\nTaking back control of awful and has no money good job good for the union ... stay with the British people in the national interests [noise]\nA Frank I suppose it must seem to be in Britain's national interest since she's demanding such good terms that there's no indication she can get them as the European Union already said it won't accept this deal\nWell they have and that's why I think domestically this sounds good but it doesn't seem to fully recognize what the European Union has said on the other challenge that she faces ears that\nShe may have trouble getting a deal like this through parliament given that there were a lot of people in our own party who are against it now she got a couple more weeks these uh before there's this other meeting in Brussels to hammer out an agreement [noise]\nUm and you've got to wonder if there might be a compromise down the line although that would be embarrassing given the kind of speech that she just gave the was adamant that you can have the free movement of goods without accepting you workers that would break the rules of the club and eventually people ... think it would lead to this integration of the union\nFor I can just tell you something that I hear from people here as we talk to your periodically you tell us essentially the same story that the British are proposing unrealistic terms that they can get and they go back to square one again and somebody will be listening to that story and say to me have they thought of maybe just voting again on whether they really want to do breakfast\nYeah that that comes up here as well and that is in the newspapers in the conversation there are some polls that have shown a small change\nBut also if you look at the polls actually people are more entrenched in some ways than they were back in two thousand and sixteen I was out in Liverpool last week talked more than eighty people I found only one person who has shifted their opinion\nAnd today is before a prime minister may she was adamant that there's going to be no reruns of two thousand and sixteen this is what she said\nI second referendum would be a politician and politicians handing people getting on the fifth time and to try again thanks for the moment they would do just say in all of\nIt is really interesting the conservative party leaders including the likes of may have said all along there not total fans of this Brexit thing but they want to respect the will of the people and that's what I guess you said again what else did she say in the speech\nWell it's interesting ... it was actually the smallest part of the speech it mostly was focusing on a domestic agenda jobs the confidence of the conservative party which previously it's definitely been known for as well just even the diversity of her own cabinet\nAnd that's because breakfast has been really divisive for the party it's been a mill stone around the neck of conservatives in last week I was the Labour Party conference up in Liverpool and they were very they seem pretty United they felt like a government party and waiting and may and the other conservative I think they know they need to stick together\nTheir worst nightmare is being forced into a general election and losing to the Labour Party and that would put labor's leader Jeremy Corbyn he's a socialist in number ... Downing Street and that's something they absolutely don't want to say\nFrank thanks very much happy to do it Steve NPR's Frank Langfitt\nAfternoon at exactly to Eighteen eastern time you can expect to get a presidential alert on your cell phone it's not exactly from President Trump rather it's uh\nThe new nationwide warning system that a president could use in case of an attack by another country or a cyber attack or a widespread natural disaster still some worry President Trump could abuse the system NPR's Brian Naylor reports\nBack in the days of the Cold War was pretty common to hear this announcement on TV or radio you know the one this station is conducting a test of the emergency broadcasting system\nThings have gotten a little more sophisticated now but basically the same minute long emergency alert system test is conducted every month or so on broadcast cable and satellite TV and radio there'll be one of those this afternoon to but today you'll also be getting an alert on your cell phone\nHas some of us receive alerts already amber alerts for missing children or flash flood or tornado warnings but this is the first time that you'll be getting a national presidential alert from FEMA\nRuin red letter is director of the national Center for disaster preparedness at Columbia University he says testing the system makes sense\nI mean the thing of this new wireless emergency shift\nIs a good idea that you can think about all righty of scenarios will be good for the president will speak directly to\nBut this is where Dr redlin or has some qualms especially he says when it comes to this president\nWe think that the president might be using such as political purposes or trade version of the presidency was a threat\nFor whatever reason so sure I Will be so what about it but these are not ours that many Americans would want to give to Donald Trump\nRed letter is not alone last week three people filed suit in New York to block the testing of the system known as wireless emergency alerts or W E a\nThe suit states the plaintiffs are Americans who do not wish to receive text messages of any kind on any topic or subject from President Trump\nThey say the government is violating their privacy and the sanctity of their homes and that wants to turn people cell phones into government loudspeakers that compel listening\nFEMA says that accusation is baseless\nIn a background briefing for reporters a senior FEMA official conceded while there is no opting out of the alert system is very well governed and you would not have a situation where the president would just wake up one morning as the official put it and attempt to send a personal message and besides he has Twitter for that\nBrian Naylor NPR News Washington\nAnd coming up later today on all things considered we'll hear from one of the beneficiaries of the new NAFTA trade deal President Trump signed this week it was approved by Congress will fare carmakers from terrorists here to listen to that story and ask your smart speaker to play NPR or ask for your local member station by name [noise]\nThis is NPR News\n[noise]\nJust ahead on the marketplace morning report look at why Amazon's recent decision to raises minimum wage to Fifteen dollars an hour is among other things a smart investment moves like at that and all the mornings other business news and under ten minutes for the Nobel Prize in chemistry has been announced look at the winters and that works for the heck\nI'm Sam Whitehead thanks for joining us on member supported Ninety point wind W. A. B. E. Atlanta where ATM meets NPR\nSupport for WABC comes from his in desk its customer service and engagement platform connects companies with customers through email live chat and phone support all from one interface to be the company or customers want you to be learned more as an desk dot com\nAnd from Asbury law firms tax counsel representing individuals' partnerships and corporations in federal tax controversies and complex federal tax litigation learn more at Asbury law firm dot com\nWe can expect partly sunny skies with high in the mid eighties today not much chance of rain tonight it'll be\nHardy with Lowes in the upper sixties currently sixty eight degrees that are clear skies in Atlanta it's sixty five and Lawrence film and powder springs our times to the forty three [noise]\n\n[noise] ah on the next closer look we continue our election coverage leading up to the midterms this November and while national interest is on Georgia's gubernatorial race between Stacey Abrams and secretary of state Brian Kemp\nWho will succeed Kent it's a live debate among the three candidates vying to be Georgia's next secretary of state I'm Rose Scott closer look today at one Ninety point one WABC [noise]\nWith everything going on in the world you listen to W. A. B. E. because you're trying to stay informed\nSo why not support it [noise] and on this or Seventy eighth anniversary we'd like you to have our limited edition Seventy eighth anniversary T shirt\nIt's yours within early sustaining donation of ten dollars a month\nThe shirt features radios from the last\nSeven decades and our seventies anniversary love to stay informed show your support\nAnd help us and the member Dr early at W. A. B. E. dot org slash donate\nSupport for NPR comes from this station and from the John D and to Catherine the MacArthur Foundation supporting creative people and effective institutions committed to building a more just verdant and peaceful world more information as a Mac found dot org\n[noise] from the ... foundation committed to improving lives through invention in the U.S send in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org and from the any each case the foundation\nWhile she adds keeping debt levels down it marks a major shift for the conservative party\n[noise] marketplace morning report is supported by pro knows HR payroll talent in timekeeping in one unified system designed with a streamlined implementation approach for small and medium size businesses across the globe\nLearn more in krona dot com criminals workforce innovation networks\nAnd buy for X. dot com committed to empowering and helping traders seize opportunities and currency markets since Nineteen Ninety nine for X. dot com it's your World Trade it for X trading involve significant risk of lost and by legal zoom offering a network of independent attorneys who can provide they advise your business needs\nMore is legal assume dot com slash marketplace\nAccording to the Federal Reserve bank of Cleveland nearly half of all workers will at some point get displaced doesn't mean they get fired demeans their jobs just disappear through no fault of their own recovering from a displacement often takes years decades even but you know what can help make that recovery a lot faster\nLiving near your parents according\nA recent study from WCBS and Idea Stream in Cleveland Adrian ... explains a couple of years ago ... was working at a pop culture magazine in New York she was there on contract but says she loved it then one day\nIs very abrupt and I just kinda got an email and the middle of the night thing your contract is no longer going to be continued\nBefore long the now thirty one year old McKenzie says she was pretty much broke so she made a phone call she'd been dreading\nI had in the real is talk with my parents and I was so scared and I was crying but I was like look guys I Need your help\nHer parents in New Mexico started sending our money to cover rent and other expenses but more than a year later she says she's still struggling to find steady work my parents and other people have said why don't you go home wouldn't that help her get back on her feet more quickly\nWell Cleveland fed economist ... actually looked at this question he and his colleagues comb through data on twenty and thirty something's who've lost their jobs\nAnd they found an interesting pattern young adults who lived close to their parents actually do a lot better after displacement of and then people who live farther away after an initial job loss he says both groups saw their annual incomes drop about ten grand\nBut those who live near their folks returned to their previous level of earnings within a decade well many who live far away never fully recovered is the moral of the story like\nStay close to home no that's not the moral of the story Kerlikowske says there's a big ...\nParental proximity mainly benefits displaced workers with kids have their own you know free childcare but also research shows people who move away from home often make more money not that that's much comfort forever McKinsey who's currently working part time as a producer at a New York radio station\nIt's been rough and it's been embarrassing\nBut she says she's fortunate to have parents who can help and she's not alone in a recent bank of America survey roughly a third of millennials said their parents help pay for rent\nIn Cleveland I may dream offer marketplace [noise]\nAnd in New York I'm somebody Bennett shore with the marketplace morning report\nFrom ATM American public media [noise]\nJust ahead on MORNING edition Donald Trump's wealth in business and it's been a core part of building his political identity now a major investigation is challenging his narrative without his finances and more on that and after ten minutes\nYou're starting your day in the new with MORNING EDITION of member supported Ninety point one W. A. B. E. Atlanta I'm Sam Whitehead but have you lost hope you're Wednesday morning is off to a great start [noise]\nSupport for WABC comes from ... pest\nManagement protecting Georgia homes for half a century from termites mosquitoes roaches and all critters if it ... or ... or do you stop them inside and out B. R. E. D. A. write a pest dot com and from the Atlanta symphony orchestra presenting rebels love letter to Greek mythology\nThe ballet deafness and Chloe Thursday and Saturday October eleventh and thirteenth details at a U.S oh dot org classical series presented by Delta Airlines who\nGood morning primaries in Georgia may have to buy more domestic parts to avoid a terrorists under the new deal that would replace NAFTA\nWill have more later this hour [noise]\n\nIt's MORNING EDITION on member support it Ninety point one W. A. B. Atlanta where ATM meets NPR I'm Sam Whitehead thanks for joining us this Wednesday morning for days off to a great start off of this hour a judge in Atlanta is set to hear arguments today about whether to open court transcripts from a lynching proceeding from more than Seventy years ago\nLast later aside from concerns over sexual misconduct the debate over Supreme Court nominee Brett Kavanaugh also centers on questions about his ability to reject partisanship\nConsider the implications there and here Mike Pesca offers his take on the NFL playing\nPersonal check on the morning talk national and local\nFrom the NPR W. A. B. user [noise] sixty eight degrees and the guys in Atlanta our time is not a one\nFrom NPR News in Washington on core of the Coleman at a political rally in Mississippi\nLast night President Trump mocked the research psychology professor who was accusing Supreme Court nominee Brett Kavanaugh sexually assaulting her when they were in high school NPR's Miles parks reports the crowd laughed and cheered when Trump pretended to act out Christine Blasey Ford's testimony\nChristine Blasey Ford said last week that she can remember that she had only one beer the nights you Supreme Court nominee Brett Kavanaugh assaulted her President Trump seized on that fact at a rally in South even Mississippi knowing me she couldn't remember other details Trump acted out both sides of Ford's congressional testimony to last and applause from the crowd\nHow did you get home I don't remember how did you get there I don't remember where is the place I don't remember how many years ago was [noise] after\nFour testified last week however Trump called or a quote very credible witness the president also said Tuesday that it's a very scary time for young men in America Miles Parks NPR News\nAnd attorney representing for describes the president's comments last night as vicious and vile meanwhile cabinet has strongly denied the accusation\nThe White House is rejecting and New York times investigation into President Trump's wealth NPR's Giles Snyder reports the administration is calling the times report extremely inaccurate\nWhite House spokeswoman Sarah Sanders called the story misleading in a statement and so the IRS reviewed and signed off decades ago on what the times says we're suspect tax Dodgers\nTrump lawyer Charles Harder to all the times the facts that sites are extremely inaccurate the New York state tax department however says it is reviewing the allegations outlined in a lengthy stories of paper says is based on a vast trove of documents including\nTax returns and other confidential documents from the real estate empire the president's late father the times says President Trump and his siblings who increased the wealth they receive from their parents through questionable financial moves that included a sham corporation used to disguise millions of dollars and gifts trials later NPR News Washington\nDisaster officials in Indonesia have raised the death toll from last week's earthquake and tsunami to more than fourteen hundred people teams are still finding bodies under heavy debris on the island is still the last eight NPR's Julie McCarthy has reached the provincial capital and says Indonesians are increasingly desperate for aid\nBut there are people on the ground you know the red cross is on the ground World Vision is on the ground but these are very tiny teams and in a disaster like this organizations like that on likes to come in with very big operations because they know they will be needed\nAnd so those operations really have been curtailed so far they're very slow in getting up\nAnd running meanwhile Indonesian officials say a volcano has a route than on the same island no evacuations yet It's NPR\nSupport for NPR comes from NPR's Beijing's other contributors include T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nFrom W. A. B. E. news in Atlanta good morning I'm Sam Whitehead\nThe two major candidates for state school superintendent have similar approaches to classroom safety but they disagree on whether or not to arm teachers both appeared in a debate yesterday sponsored by the press club Republican incumbent Richard wood says arming teachers is a local decision should be made by local officials\nWould says his administration is focused on safety including adding extra support for at risk kids\nSchool safety is received a million dollars and we will also look at the school environment and in the school itself for what goes on\nMeanwhile his Democratic challenger oh the store and junior is against arming teachers but does support wraparound services he says woods only recently embrace doing things for students other than just teaching them\nImagine the years that we've wasted and not providing those services and some not addressing the mental social emotional nice about students\nElection day is November ... a federal appeals court judge in Atlanta is set to hear oral arguments today about whether to open court transcripts from a grand jury lynching proceeding for more than Seventy years ago\nDisney shopping has more historian\nI think if you have an issue that concerns women um or liberal politics or even voting cases I think there's a real concern as to whether he can be fair\nIssues concerning women you're saying but you would be making an argument or if you were a lawyer before the court that he shouldn't be judging anything concerning women\nI mean I ... I don't know that I Would make that argument that far but I was like I think there are certain issues look there were already issues about whether he could fairly judge issues on presidential power and there were lots of discussions about whether he needed to recuse at the beginning of this process\nBecause President Trump might conceivably have some case before the court involving ...\nDo I think there are numerous cases that could come before the court involving President Trump and a judge Kavanaugh has made lots of comments about the extent of a presidential power so that was a concern already and I think his demeanor last week um shows that there are a lot more concerns about his temperament\n... she'll be American Constitution society reflects on march thank\nYou a new State Department visa policy declared that starting this month and diplomats who want to bring their same sex partners to the U.S will have to be married Here's NPR's Michele kill them in\nA State Department official says marriage equality is the law the land here in the U. S. so when it comes to granting visas the U.S is now treating same sex couples the same as heterosexual couples with some limited exceptions diplomatic visas will now only be granted you legal spouses\nOn the face of it this sounds fair says that shed Kamara human rights watch but she worries the U.S is ignoring reality\nSame sex marriages only legal in twenty five countries\nAnd perhaps more concerning in over Seventy countries around the world same sex conduct is illegal it criminalized it's been ... by throwing people in jail by beating like painting a law country how can we ignore that when we make policy here in the United states\nShe's expecting a lot of shot gun weddings which she fears could but some diplomats at risk back home\nDiplomats and un officials are already here have until the end of the year to produce a marriage certificate if they want their partners to maintain their visa status\nThey could be exempted if the country they represent respect the rights of Americans at embassies abroad but as ... points out staff at international organizations or in a different category\nWhat's really inequitable I think is that the U.S in a World Bank or other international organization that don't have that option because there is nothing that those organizations can offer the Trump Administration and return\nState Department officials who only spoke on background say they will work with individuals on a case by case basis they say there are only a hundred and five families in the U.S will be impacted\nBy this at fifty five of them\nInternational organizations and the officials at most are from countries that do recognize same sex marriage Michele ... NPR News the state department\n[noise]\n[noise]\n[noise]\n\nAnd you're listening to NPR News [noise]\nJust ahead on MORNING edition we'll check in with the W. A. B. E. newsroom carmakers in Georgia may have to buy more domestic parts to avoid taxes under the new agreement that will replace the north American free trade agreement on the latest on that and just about twelve minutes but first during the Korean War a U.S Marine Division was surrounded and out\nNumbered and the dead of winter eighty five percent of these men suffered from frostbite many died of exposure none of these troops were prepared for fighting in these kinds of conditions will take a closer look at that brutal battle straight ahead I'm Sam Whitehead thanks for joining us for MORNING EDITION on member supported\nDining point one W. A. B. E. Atlanta\nSupport for WABC comes from Leslie hind Dimon auctioneers a global fine art auction house now open in Atlanta offering auction appraisals October tenth eleventh for jewelry fine art and more you can scheduling appointments at Leslie Heineman dot com slash a deal\nWe can expect sunny skies with hides in the upper eighties today about much chance of rain currently sixty seven degrees in a clear skies in Atlanta sixty six in Sandy Springs and Peachtree city\nOur time is nine twenty [noise]\n\nHe learned something every day on W. A. B. E. here's something you might not know W. A. B. E. pays NPR over a million dollars a year just to broadcast MORNING EDITION and all things considered and the member guide help pay for it so this fall and we're doing something new\nWhen we get our goal of Seventy thousand Seventy donations that Dr Atkins and donations now will count so let's get back to learning something new contribute now at W. A. B. E. dot org slash donate\nSupport for NPR comes from this session and from at less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at ... dot com\nFrom gobble a meal kid company that delivers semi ... meals to be finished at home in Fifteen minutes with one parent ... do the prep work by shopping and marinating\nThis week's menu is at ... dot com slash NPR and from Linda ... battle learning processors committed to helping all students learn to their potential they're learning centers and online private school offer instruction and reading comprehension eight hundred three hundred Eighteen Eighteen\nThis is MORNING EDITION from NPR News I'm Rachel\nMartin and I'm Steve Inskeep the historian Hampton Sides has been exploring the origins of the u._s. conflict with North Korea he's written a history of Americans in a brutal battle in the dead of winter which happened when Americans try to unify north and South Korea\n[noise] that's\nA radio announcer giving the news of the U.S military landing at a port city near Seoul in Nineteen fifty [noise] North Korea had started the war invading the U.S back so the United states and its allies struck back\nWith this landing commanded by one of the arrows most famous general\nDouglas MacArthur is landing works as this old movie newsreel proclaimed\nThe war and reads the turning point I was a fire started and certainly move all the north Koreans\nSeemingly Hampton Sides says MacArthur is forces recaptured South Korea's capital\nAnd he began to get kind of greedy\nThe new book on desperate ground examines the plan that because they're devised next\nWhy stop there why not go all the way to retake all of Korea unite the peninsula under one democratic government\nMick Arthur's troops crossed the famous thirty eighth parallel dividing north and south\nBut what U.S forces did not quite know as they moved into North Korea was the neighboring communist China considered the Americans the threat and a huge Chinese army was soon crossing the border to oppose them you're a landmark called the chosen reservoir\nIt was initially and intelligence failure we simply didn't know at first because the Chinese were expert at camouflage they moved only at night um they never used roads they were a foot army but then intelligence did begin to trickle in crystal clear and MacArthur didn't want to believe this because\nHe wanted to finish the job by Thanksgiving get the war over with and so he swept this information under the rug\nWhat was the landscape and the situation in which a U.S Marine Division found themselves around a reservoir in North Korea in the winter of Nineteen fifty fifty one\nMacArthur ordered the first Marine Division to advance to this reservoir up in the mountains of North Korea to take it and to keep on going to the Yalu but the commander of the first Marine Division whose name is general Oliver Smith\nRealize that this was a perfect scenario foreign circle meant he was very fresh and he seemed to know that a big battle was going to happen\nOn the shores of this frozen lake in the mountains of North Korea sounds like it was pretty cold eighty five percent of these men suffered from frostbite many died of exposure\nNone of these troops were prepared for fighting in these kinds of conditions\nYou given incredible detail of an American marine who is attacked with the rest of his unit by the Chinese it's the middle of the night it's incredibly cold he leaps out of his sleeping bag and only realizes after fighting for hours that he had never managed to put his boots\nOn you know this is Hector calf Retta\nTo receive the Congressional Medal of honor for his exploits that night he may have killed over a hundred Chinese soldiers who came wave after wave after wave at him and his position\nThe Marines in parts of the battle were outnumbered tend to one by the Chinese and he never killed a man before he'd never been in combat and suddenly her he was surrounded\nThere's not a doctor [noise]\nKind of girl isn't it [noise] the underlying\nMessage of these stereotypes there's something weird about a man who's ... long says this might be why some patients get on easy to\nIt somewhat hypocritical when you have a the doctor is a male then that's very intimate but somehow as a nurse I'm male and that's the problem is that it doesn't make sense I mean you could wait a minute the doctors mail to somehow you have no issue with him\nNurse you have an issue ... it's contradictory\nThere is a lot of things that are off limits for men\nUniversity of South Florida psychologist Jennifer Boston has studied why men are often reluctant to engage in activities traditionally dominated by women in one of the inning experiment a team gathered a group of nearly two hundred men and women and sat them in front of computers\nWe just kind of let them right for you know a few minutes about a time when they violated their gender role in in public\nSome women talked about being a tomboy others mentioned walking in male dominated fields and feeling harassed by co workers but men\nMen say things like ... I wore a pink shirt to work or I I held my girlfriend's per se while she ran into the bank\nOr I ordered a drink at a restaurant and when it came out to me it had a little cocktail umbrella in it and my you know my friends tease me so it's like it's just mundane things like women don't say oh I wore the wrong shirt\n[noise]\nWhy would men make such a big deal over trivial thing the familiar explanation is massage any or homophobia that is what Boston talked to she began to think about the different messages that boys received from a very young age are you a real man or they say man up\nBoston built on his inside and conducted a series of research experiment into why men behave the way they do a conclusion\nMy collaborators and I argue that the male gender role itself is kind of conceptualize it as a more precarious status so manhood is something that hard to earn and easy to lose relative to womanhood\n\nManhood is something that's hard to earn and easy to do [noise] many fewer pink shirts and pushes because the defending something fragile\nIn terms of why this would be the case or why\nWould you have one sex essentially have more limited repertoire we'll have more policing around us boundaries or why do women take that femininity for granted in ways that men do not take them asking handy for granted\nThat's really hard question to answer but I think it has to do with um [noise]\nHow men their social status is more hierarchy Akeley organized than women's is\nSo men are kind of more interested in or motivated to attain social status and that kind of then translates into what we propose is kind of a chronic anxiety about their status and that translates into a concern about whether once seen as a real man or not\nMen worry about what other men was saying what women will think what they themselves might think Boston has some ideas on how to get more men into nursing she argues that the way to do it is to come up with a new set of stereotypes\nYou could spin nursing as a very masculine occupation it's dangerous to physically grueling our stereotype of the nurse you know you could modify that stereotype and turn nursing into a profession that does seem masculine or male appropriate [noise]\nSomething along these lines happened to Robert Vaughn when he was considering whether to become a nurse at twenty three he just finished for years in the navy\nHe wanted to go back to school his wife's dad had a suggestion\nMy father in law who's a respiratory therapist\nSaid hey you know you should really look into nursing\nVon didn't immediately take his father in law's advice\nLike a lot of guys I think the first thing that went through my head was with us of a woman's job\nBut I'm On did get a job at a hospital working as a security guard\nAnd one day something happened that up to and has stereotypes about nursing we had a couple\nGuys who came in to the emergency room and they were just very belligerent fighting there was blood all over the place and the nurses in us and the sheriffs were holding them down and it's a dating and and restraining him all the man is is this is pretty cool [laughter] the action the nurses were saying was pretty exciting for me [noise]\nYou know you think of nursing do you think of someone sitting at a [noise]\nA bedside and let me hold on\nAnd you see what it is realistically day to day\nFor me it was\nWhen it comes to fighting stereotypes we often imagined that the right approach is to explain why stereotypes are wrong [noise]\nBut Robin Williams lives and Jennifer Boston's experiments suggest a different solution and perhaps a more effective one\nStereotypes are powerful because the stories we tell about ourselves how powerful the shape how we see the world and how ... but in the end [noise]\nThey're only stories stories we can rewrite them\nShankar Vedantam NPR News\nIn shock or is the host of NPR's hidden brain podcast and radio show you can hear more research about masculinity on the latest episode support\nFor hidden brain comes from zoom zoom offers cloud video conferencing online meetings and a video conference room solution in one platform featuring digital video and audio screen sharing the count registration and more at zoom dot US\nComing up later today on all things considered freelance workers also called contingent workers to rise up to a third of the U. S. workforce by some estimates will investigate them any financial challenges those workers face\nTo listen to that story ask your smart speaker to play NPR or your local member station by name but listening to MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep\nI'm Sam Whitehead and if you enjoy that story from shocker bed on time you can catch hidden brain right here on any point one W. A. B. E. at air Saturday said to\nHim the next city life him holes preparatory theater it's this Texas against\nOne another for all that\nAnd taming of true love and Marie said number attack from their hitch coffee films theory you can learn everything you need to know about what goes on some of the film by watching you know what to look\nFor I've lowered rights and joined a lesson am um W. H. B. E. [noise]\n[noise]\nJust ahead on the marketplace morning report when it comes to high speed broadband Internet rural areas tend to lag behind their urban counterparts\nWell look at how the digital divide is creating noticeable disadvantages for businesses working in America's farm country that and under ten minutes but first we'll look at some hotly contested Supreme Court nominations throughout us history that straight ahead\nI'm Sam Whitehead thanks for joining us from MORNING EDITION on never supported Ninety point one W. A. B. E. Atlanta\nWhere ... meets NPR\nSupport for WABC eat comes from Comcast Business providing a gig speed network that helps business get done Comcast Business beyond fast learn more at Comcast Business dot com\nWe can expect partly sunny skies today with highest in the upper eighties not much of a chance of rain tonight will that partly cloudy skies loews right around Seventy it's currently sixty eight degrees in clear skies in Atlanta sixty eight also in Stockbridge and Carter's fill our time was nine forty three [noise]\n\n\nOn the next fresh air camera Jenkins tax about writing and directing her new movie private life staring Catherine hunt and ... as a couple in their forties trying to have a baby do any means necessary adoption ivy s egg donor\nLiar van turtle a my old eggs\nJoined us this afternoon it to ... point one W. A. B. E.\nWith everything going on in the world you listen uh W. A. B. E. because you're trying to stay informed\nSo why not support it and on this our seventies anniversary we'd like you to have a limited edition Seventy eighth anniversary T shirt\nIt's yours within early sustaining donation of ten dollars a month\nThe shirt features radios from the last seven decades and our seventies anniversary love to stay informed show your support\nHelp us and the member Dr early at W. maybe eat that or slashed donate\nSupport for NPR comes from this station and from zoom zoom offers cloud video conferencing online meetings that video conference room solution and one platform featuring digital video and audio were screened sharing account registration and more at zoom dot us\nFrom visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide\nVisiting angels America's Choice and senior home care office locations are at visiting angels dot com and from the sustaining members of this NPR station this is MORNING EDITION from NPR News I'm Rachel Martin", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Atlanta", "day": "03"}