{"month": "10", "state": "TX", "station": "KTDH", "content": "Support comes from panhandle planes historical museum celebrating archeology month with dine all day Saturday October thirteenth from one to four kids can excavate make fossils and more panhandle planes dot org\n[noise]\nThis was Ninety One point five ... eighty nine point three ... Ninety One point seven ... news service of high plains public radio\nThe availability of age PBR Web stream is due to the long term financial support of individuals' all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nHigh plains public radio as a source that keeps you in touch with the world well at home on the high plains the service is a direct result of listener contributions gay knowledge grow community give today at H. P. P. R. dot org\nEr this was much for joining me Saturday Night which was seven central for what the whole two hours of music from all kinds of genres rock and pop and blues in world in ... and bluegrass you never know\nBefore [noise] two hours of music from all kinds of genres rock and pop and beans and rules and regulations and bluegrass you never know what you're going to hear all tied together was single thing about what the phone and Saturday nights with seven central right here on high plains public radio [noise]\n\n\nLive from NPR News in Washington on Barbara climb the Senate is due to vote this hour on confirming Brett Kavanaugh Supreme Court justice even though he's all but certain to be confirmed demonstrators remain outside the Supreme Court and the U.S Capitol NPR Shannon van sent is their\nPolice have arrested dozens of protesters at squirting them from the capital of the U.S Capitol the vast majority of the crowd is protesting\nAgainst Kavanaugh's confirmation that there are a few demonstrators here in support of having a conversation between some of the protesters both pouring again [noise] had devolved into shouting with both sides saying that their perspective it or not being hurt\nSecurity outside the Capitol building it's tighter than usual the Senate is set to begin the roll call vote at three thirty eastern time and it'll bring weeks of rancor it's debate to a close\nSecretary of state Mike Pompeo has met with Japan Japanese prime minister Shinzo Abe's in Tokyo he says he wants to ensure the two allies are on the same page before\nHe heads to Pyongyang to meet with North Korean leader Kim Jong on\n[noise] or if you're [noise] you're are you [noise] uh [noise]\nUm pay a will also try to make progress arranging a second summit between President Trump and Kim the Pentagon is identifying the American soldiers who was killed in Afghanistan this week the seventh American combat casualty in Afghanistan this year NPRs Amy held reports\nGene sleep with just five years old when the war began on October seventh two thousand and one on Thursday the twenty three year old died in an improvised explosive device attack in southern Helmand Province his National Guard unit had deployed in April the Pentagon says an investigation is ongoing\nThe specialists from Morehead City North Carolina was posthumously promoted to the rank of sergeant he died in a region where the Taliban continues to wage attacks around fourteen thousand American troops remain in the country as part of NATO's mission to train Afghanistan's own security forces\nThat's down from a peak of more than one hundred thousand President Trump has said ground conditions and not timetables will determine when the U.S leaves Amy held NPR News\nI'm named French officials say the head of the international police organization Interpol is being detained in China on suspicion of financial fraud and other charges\nMain hung waves wife said she didn't hear from him after he flew from France to his native China at the end of September now the south China Morning post reports on\nWay is was picked up by Chinese authorities when he arrived in Hong Kong this is NPR\nWorkers on Indonesia's all the way say island are searching for bodies buried in fields of debris and mud more than a week after a powerful earthquake and tsunami that\nBuried in fields of debris and mud more than a week after a powerful earthquake and tsunami the death toll there has risen to more than sixteen hundred\nScreenwriter Audrey well who wrote the critically acclaimed new movie the hate you give has died the day before this week's release of the film will will was fifty eight NPR's Mandalit del Barco reports\nAudrey wealth adapted the script for the heat you get from a best selling why a novel the story of a black sixteen year old girl who becomes an activist\n[noise] that black people or people everybody the body needs to say\nWell have you with her screenplay for the Nineteen Ninety six rom com the truth about cats and dogs\nShe pen screen plays for the Disney film the kid the live action Georgia the jungle and a dog purpose she also adapted demand more for under the Tuscan sun the two thousand three films she also directed well with developing several film projects before she died\nIn statements her husband and her agents preacher courage and said she empowered women with strong determine female characters she brought to life\nMotherly than buckle NPR News\nThe food and Drug Administration is banning seven synthetic food flavorings that are used in a variety of foods and beverages and even gum environmental and other groups argued lab tests on animals than the additives both cancer risks I'm Barbara Klein NPR News\nSupport for NPR comes from walkman maker would go to meeting proud sponsor Rebecca how I built this entrepreneur summit taking place in San Francisco ... cents or October sixteenth more about the summit at NPR dot org slash summit and be any EKG foundation\n\n\nGood afternoon welcome to open range I'm Steve Johnson and we're going to start to show off right away today with their psychedelic for the ... string you [laughter]\n[noise]\nKnow when does it feel like they may\nOr\n\nBe a law called me\nA tumor cells in the right\n[noise] we are\n\n\nYou\n[noise]\nMoby which when step Bonnie south side that causes our first set on open range public enemy bring on the noise with our right before that\nAnd psychedelic birds with the go to a new openness and I'm Steve Johnson welcome to open range on member supportive mentioned driven high ... high plains public radio\nOkay I [laughter]\nYou'd think there was a cat wandering around in the studio here this afternoon\nThere there isn't blossom will be with me next week Bob Davis will be with me next week even more exciting I he will be guest host you need done the show once before he's our new executive director\nAnd a bad show where he's going to feature music from Bob's home state of Alabama which the music is rich and buried from Alabama as it is on the open range itself so I'm looking forward to that be sure to tune in next Saturday and\nTwo pm central time let's continue our music from Phoebe smell\n[noise] [noise]\n[noise]\nDon't\nKnow\nYou know [noise]\nOh\nLeading\nThe\n[noise]\nYou're\nLet's see\nI Know you've got\n\n... ...\n... ...\n... they're given a Nobel\nWhen she did when\nKnow who did not ... to ... the sugar yeah in ...\nGood thing we are we're not very good at anything else anymore [noise]\nCan't make a TV set or a VCR [noise] under the Web\nCan get healthcare old people can educate our young people but we can bomb your country alright [noise]\n\nEspecially if your country is full of brown people like that that's our hobby [noise] that's our new job in the world bombing Iraq Panama grenade Olivia you got some people in your country tell them to watch [noise]\nI don't\nOf white people you to remember that we both can you remember the last one thing to remember any white people we've ever bomb the Germans the Germans are the only one reason for that is because they were trying to cut in on our action [noise]\nTo dominate the world that SARS [noise]\n\n\nNow we only bomb brown people not because they're trying to cut interaction\nJust because they're brown [noise]\nOr you might be noticing I don't feel about that war the way we were told we were supposed to feel about that\n[noise] I just dropped\nBy the United states government do feel about that war she my mind doesn't work that way I got this real Lauren thing I Do it's called fame game [noise] and I'm not a really good American because I like to form my own opinion [noise]\nI don't just roll over when I'm told too sad to say most Americans just roll around command\nNot me but\nIt's sad to say most Americans just roll around here man it's\nNot that\nMy first rule I don't believe anything the government tells me [noise]\nVery seriously the media or the press in this country go in the case of the Persian Gulf War where nothing more than an unpaid employees of the department of defense and\nWho most of the time function as kind of an unofficial public relations agency for the United states government so I don't listen to them\nI don't really believe in my country and I got to tell you folks I don't get all choked up about yellow ribbons and American flags I\nInto these symbols and I leave symbols to the symbol minded\n... ...\nWho are down the road\nMust have they go ...\nBecause of your surroundings\nSo they go by\nThem on your dream\nSo laid down by\nTime on your dream\nBack\n\nGod\nThe next\n\nDe\n[noise]\n\nI Would want Bob rolling one very hot\nSummer day and what I thought I lay down and read the ... you know they can be tall grass on late that day and the about ... rather than like baked\nBy fellow at least to that dream to do too I Dreamed up words in Hollywood movie\nThat I Would stop the ... really do by money in the back that to me\nAnd that I Would stop them to do [noise] it's really blew my mind to the bags that to me and the noble fed lonely\nAnd being known [noise] should be involved in [noise] in there I was in\nOur day and get it will blades and [noise] all\nOf them out there and then\nTop of that so [noise]\nIn front of the [noise]\nBrandon tune in for ... and her brain to the restaurants\nKhomeini and there will be there with our new music director Mike ... argues against a team with are now in America correspondent Tom path I don't miss\nSaturday evening it's five central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... Ninety One point seven KGAN Hayes a service the high plains public radio\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details\n\nWelcome back to the second hour of open range I'm Steve Johnson\nLet's begin this hour with them a rather interesting historical recording this is one of the I I'm One of the old Edison's cylinder records but we've made in Nineteen oh seven it's uh the Edison mixed quartet and and the him is work for the night it's coming\n\n[noise] work are an idea of coming by the up and make our head [noise]\nAugust on\nA farm along the oh why why would a man man no luck\nMan de Gaulle a well then I go oh\nNo no no no\nNo uh\nWell I'm well I'm\nWell I'm\nA little bit longer you know\nWhat I saw a law\nThat um you know\nOh\nYeah that well you know I'm going to be\nOh what a man and I'm not\nNo oh\nNo no no\nA man\nI'm about Islam that uh\nThat long ago a lot well man\nI Know a damn about being\nIn that and I thank God I Know\nOh well\nThat's why we buy a four\nAnd um well [noise]\nOh [noise]\n\n\n\n\nNeed in\nTo Mm Mm [noise]\n\n\n\nYou know\nA\nMore you know so\nYou know the plane [noise]\nUm [noise]\nThe um\nDo ...\n[noise]\n\n\n\n\nMy lord willing and we'll be\nThe\nMinute and a\n[noise]\n\n\n\n\n\nTo\nThe point is run the girls young\n[noise] the odds down to the people\nWho do\nYou win\nTitans and has done yarns into winning streak\nSo I'm\nTo a new\nWay of dealing in Venice or or just to see people you see are not\nAs serious ratio\nOf flowers and ... the term trend [noise]\nI'm campaigning for [noise]\nBreathing Kate Bush is that's a strange cat I I've always loved to do it it's sort of this post a lot apocalyptic scene that I'm picturing when I hear that and it was\nKind of cool makes me next to work for the night is coming and that is a historic recording from\nA ... Thomas edits no cylinder did report on there were flat records kids there were there will be be cylinders use you'll see them once in awhile an antique shop today than they if you find a working one grab it\nAnd are\nAll that's all I have to say about that you're listening to open range on member supported high plains public radio be sure to join me next week when executive director Bob Davis joins me and we'll be featuring music from Bob's home state of Alabama it's going to be a great show\n\nHigh plains Public Radio's fall membership campaign is right around the corner\nH. P. P. R. realizes that program such as MORNING EDITION and all things considered are an important part of your day\nAnd we ask that you please remember that you are an important part of this service listener contributions or the driving force behind public radio in the high plains please consider joining the mission today at H. P. P. R. dot org thank you\n[noise]\n\n[noise]\nIs\n\n\n\n\n[noise]\n[noise]\n\nOh\nTwo or\n...\n...\nIntroduce\nTo ...\nTo ...\n\n\n... oh\n\n\n\nMm\nNo\n... oh Mm Mm\n\n\n\n...\n\n... ... ...\nUm well\nI'm One [noise]\nWe [noise]\nYou're not really no\nNo\nThen when I was\nThat helps too was thinking when they\nDon't need to stay in the\n[noise]\n\n\n\n\nThey already know this is why and I think it should so\nHave to uh uh they have to go\nThe news\nLa Hi Sheryl ...\nTo visit them set out to a ...\n... you know this and then he said oh well paying me or that\nBring in\nDo who bring in day to\nRuler I share of\nDo that I can only do they do a\nWhere let's let's say you do that my parents paid I don't understand when they land\n\nTo be that you're ... years old to go all the dangers of paying\nYour bills on line and we'll be the one now but\nWay a lot I can\nDied in and I'll be doggone math\nDay\nWhere they were um do do\nIt in bed or in a\n... not trying to do a lot of friends who you are\nWearing black their feet tall and asked him to the ... like that and then um do you read\nIn\nRain you know I I Do ... de da de da na\nVe to a federal\nBe named about being in a statement to attend\nWay a lot less than\nDo that I they are paid I mean they end up paying rent and\nBy you know a young man do that or\nA new manual\nNew job\nWhen I Lived there a\nThey're already guy ...\nDe la ... de la ... those are the ball and by\nThey're gone farther than\nAre a mandate and you know the problem\nAnd um when they're gone down in band\nA main aim all the problems that\nThey can\nThe ...\n... ... ...\n... ... knees\nBees and the\n...\n\n\nMatched and where the rose\nAn existing been on the\nGood any say in some way\nThe train tracks have gone\nIt same bug day oh\nHe ran with may mono\n\nThey out\nWilson from Maryland right in their head during\nAnd it may have been making Harrisburg died in a hole\nThe spring day the plan is the root of all evil another say ... right\nAnd I'm the man is the root of all the others say Dodger drunkard in pain and\nNow may I Believe in the garden\nOf Eden Verna may ways\nIs orange rain or in the rain in the long\nJosh Ritter Harrisburg from his golden age or radio album right before him poor Lazarus from in and Sylvia sport strong winds and talking at the Texaco James ... Marjorie too long and the waste land I'm Steve Johnson this is open range on member supported high plains public radio\n\nGoes to sleep people on the other side of the world are waking up fear searches in Beijing are quite insecure and signal which costs to news never sleeps so this station brings you BBC News and analysis through\nThe night on Julian marshal on James Kamara saw me with news on the BBC keeps you connected to the world should listen tonight\nUnprepared for tomorrow's\nOvernight on H. P. P. R. [noise]\n", "show_name": "Open Range", "year": "2018", "city": "Dalhart", "day": "06"}