{"month": "10", "state": "TX", "station": "KTDH", "content": "October as an important fundraising month for high plains public radio because it's the first month of H. P. P. ours fiscal year and sets the tone for the rest of the year support your public radio station today by visiting H. P. P. R. dot org\n[noise]\nWho's who's Ninety One point five ... eighty nine point three ... of service of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of age PBR Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nHi Arne Johnson bigger a news curator here at age PBR and we take so much pride and bringing you news stories that you can't find anywhere else but we can't do it without your help go to age ... P. R. dot org today to pledge your support\nMore than a week after one of the most destructive hurricane ever recorded hit the Florida Panhandle survivors are still looking for missing relatives I called\nI called the medical examiner's office thinking the worst kind of exhausted all options I think we\nAlso have the latest on the caravan of would be migrants from Central America that's next time on all things considered from NPR News\nWe'll also have the latest on the caravan of would be migrants from Central America that's next time on all things considered from NPR News [noise]\nSaturday afternoon at for central\nIf your car is having trouble holding up now is a great time to donate it to the H. P. P. R. vehicle donation program you'll make extra space in your garage for that new car you've been thinking about it started today at H. P. P. R. dot org\nLive from NPR News in Washington on Barbara climb a procession of Guatemalan migrants attempting to flee to Mexico has shrunk to about a thousand people earlier this week an estimated three thousand we're attempting to cross over the border\nNPR Shannon van central port hundreds made it across others return to Guatemala for food and water\nThe migrants attempting to travel over Guatemala's border with many using ropes and rafts to track across in nearby river Mexico says only though caring valid passports and beat says are allowed to enter and according to you as secretary of state my palm pale for Mexican police officers have been injured in a border standoff\nPompeo within Mexico on friday to meet with President and foreign relation secretary where he emphasize the importance of preventing the migrants from reaching the United states Trump has tweeted that he will send us troops to close the border of Mexico does not stop the caravan Shannon ... NPR News Washington\nTurkish media are saying turkey is continuing it's criminal investigation\nInto the case surrounding Washington Post contributor Jamal ... G despite Saudi Arabia's admission that the journalists died at its consulate in Istanbul and despite ... claim the matter is under its jurisdiction NPR's Peter Kenyon reports\nA pro government Turkish papers is any Saudi claim of jurisdiction over to show your case is false arguing that in Nineteen sixty three treaty grants jurisdiction to the host country in this case turkey like friday to Saudi ... died in the consulate after a fight broke out critics in a new show true story doesn't match the evidence\nThat President Trump says he finds the Saudi explanation credible he also praises the kingdom which denied because she'll jeeze death for two weeks for acting quickly Republican Senator Lindsey Graham disagreed saying he's more than skeptical as his Democratic Congressman Adam Schiff\nAnd German Chancellor Angela Merkel calls the Saudi claim inadequate\nHundreds of thousands of protesters packed into central London today demanding another referendum on the u._k. pulling out of the European Union NPR's Frank Langfitt reports many Britain's are deeply unhappy with Brexit negotiations which are at a stalemate and running out of time\nWith emergency the crux of the problem is which included pledges of extra money for health care turning into a disaster the United kingdom the European Union's rejected prime minister Theresa May's plans to leaving the u._s. have many in room ...\nNew case now at risk of crashing out of the European Union with no deal for a future relationship the protestors want to stay in the EU others hope there will be a deal but want to see the details before signing off prime minister may however has rejected holding another public vote\nWhich breakfast here say would be anti democratic Frank Langfitt NPR News London this is NPR\nBombers have carried out an attack in Kabul as Afghanistan holds parliamentary elections the first in eight years officials say several people are dead ISIS and Taliban militants had threatened violence\nFear or over fake news and its influence on elections is engulfing Brazil ahead of oppressed\nTens had threatened violence [noise] you're over the news and its influence on election is engulfed in Brazil ahead\nOf the presidential election a week from tomorrow as NPR's Philip Reeves reports from Rio de Janeiro the messaging platform WhatsApp says it's taking immediate action to stop companies from sending mass messages to influence voters\nJust over a week remains before an election run all the ... a retired army captain from the far right is expected to win by a landslide\nThe country but she's being triggered by newspaper report in Brazil sang business executives of bankrolled ... messages spreading fake news about both now those leftist opponent but ...\nAlso now does denying and both of\nThe scandals cause I think the boss quantity of Hadiya ... misleading election related materials spread all walks up which has more than a hundred and twenty million Brazilian uses well chops it has ... misinformation by closing accounts in using fact checkers\nAnd it says it's sending cease and desist letters to companies sending out about much juice Reeves NPR News ... NATO\nBaseball's National League pennant will be decided tonight when the Milwaukee Brewers again take on the less Los Angeles Dodgers the winner will move on to the world series against American League champion the Boston Red Sox I'm Barbara climb NPR News in Washington\nSupport for NPR comes from NPR's Beijing other contributors include Baird of financial partner guiding families businesses communities and institutions since Nineteen Nineteen are W Baird dot com parents more information and the corporation for public broadcasting\n\n\nDo you not only on one way and that's where the U.S marshals on [noise]\n\n\n\n\n\n\nEveryone\nAlong the offer was going to go to one of his aren't going to do and I don't know [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n...\nAh [noise] regular [noise] [noise] [noise]\n\nWe monitor Morgan's Redmond man [noise]\n\n\nOh\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nGood afternoon welcome to open range today we're going to be comfort radio for the mind and I'm Steve Johnson we have argued Fiedler in Boston Pops leading in San ... from picnic\n\n\n\n\n\nKnow I Need to do when you\nPass the man who bears mine ...\nTree in the ... the ... and all of them were ... you know live in the end and there's no sign yeah her campaign\nHave to choose the\nMany or will no\n... she was one million ...\nA man named ...\nWe read in the mid ...\nVery lonely ...\nTo ring\n... since June and meaning in the ... my bag and\nOn the prairie entertaining to me the ... I've\nWhere do you do to be done and where\nNew Jersey\nMany more will always be known\n... ... ... ... ... what do they do\n\nAround\nAgain\nMaybe lay o\nDa da\nDa da da da\nDa da da da da\nDa da da di di di di\nDi\nDi maybe\nNot\nOut my name\nMind the\nBe able to bring my baby to me\nLine man and I think it\n\n\n[noise]\n\n\n\nOkay we have I'm Joan Baez and Paul Simon doing ramblers gambler in whispering bells and it's interesting because both of those folks are on their farewell tours and they're sort of traveling each other\nAcross the country anyway where are we getting old [laughter]\n[noise] going back to the beginning of the SAT we heard a moon glow in the theme from picnic that was the Boston Pops conducted by archer Fiedler followed by a cut from the ... track that was kissed me goodbye if you haven't seen ... now is a great time to watch it\nJimmy Web during his composition Wichita Lineman match for me CD Kenny easy pizzas and after that Sharon Anderson with the other side of life I'm Steve Johnson you found open range of member supported mission driven high plains public radio\nAnd as many of you know we just finished our fall membership campaign I have a lot of thank you\nThank you to my fellow H. P. P. R. staff members for coping with me\nThank you Bob Davis for that marvelous show last week we bought brought in a music from his home state of Alabama that was a great show thank you Bob thank you to all who called in and pledged your support and renewed your membership or became new members it's great to have you on board\n\nMe\nThe name of\nMean do they [noise]\nThey're\nThey're good assumes yeah da\n\n\nDa\n[noise]\n\n\n[noise]\nEvery morning when I open the kitchen cabinet and and I see all the message that I collected to the years that's a good reminder to many of the\nPerks that I enjoy being a member of the I think that'd be cranky\nI Am cherish and I'm a proud member as high plains of the great [noise]\n\nI'm Eric ... couples the guy over 'cause his vantage where being across the road\nStanding next to the man was a chimpanzee the man\nHe was doing really well and then he lost control of the band and I'm like [noise] lost control of an play at what point was the chimpanzee really in charge of the snake\nStumped joins just jumped out of the daily news shows this American Life Sunday afternoon at three central\n\nOkay during that last set we began with the main title that never on Sunday I was followed by Sylvester with down down down that's a great relic from the disco era and new music from ... boss Skaggs rock and stick let's continue our music from the record company this is likely to fix\n\nThe ...\nOut on the road and down when I got I'm Leo the manual\nLindy and ... them mostly time alone\nAnd they didn't have them all the time alone\nThey they are weighing on the day as I understand they do then you're damn right\nNow and go where they gonna lay\nThe um all alone at all I Know they get along with the radio\nAnd I'm\n\nShoo through it all out and did broken down where in our backyard\nBrick God then landers they're\nDoing that job is on them and\nAnd I do now in our ... back up and my friends are\nNo\nKnow around\n... it's going to be there to be bothered\nMe that ... goal and may not be ... the main\nWhoa whoa whoa whoa\nYou know but those do not modest goal that may be\nLow low low well\nYou know the the the moment when you're on the ball will boom\nYou're low low well\nYou know they they they moan and when they show that they didn't run around\nAnd you know John in Donetsk\nWhat I'm saying\nThinking the worst I think that they\nWill also have the latest on the caravan of would be migrants from Central America that's next time on all things considered from NPR News [noise]\nSaturday afternoon at for central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie DHL heart a service the high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support tablet H. P. P. R. dot org for details\nWe\nAlways do the biggies oh to be some people think it gives me a boat with some glassy but he is more than than\nThe ... the first it'd be becoming it'd be used to really be this can be particularly if you're a girl funding by we should remember these important rule the well this is still the big\nBang out on the climate lines health food stores but most of all in coffee held the seat and he joined has lots of atmosphere but it's usually too dark\nTo the coffee tea or coffee OJ's coffee got sports guy and this is ... so we could be five teams cappuccino eighty by you can't go eat me feel when you go I think a lot of film that theory to buy but I get the middle of caffeine me new to what\nExtent [noise] especially if you don't see what [noise]\nOh you should things bad\nWeek is often fall there will be poised to jazz bug me id spring you name you follow the school she peas move for a loan goes oh man man that was cool\n[noise] [noise]\n\n... ... ... ...\n\n... ...\n\n... ... Mm [noise]\n...\nNo ... Mm ...\nMm [noise]\nMm\nNa\nNa na na na na\n\nAnd\nTo find things\nSo she was [noise]\n\n\nTo the man who [noise]\n\n\nThe ...\nNo\nReally no [noise]\nNo [noise]\nKnow\n\n\n\nBarrel down the highway is the best journey to each other's\nWatch or Irving I'm\nIncarnation drove cross country Seventy two hours to find out if\nI had a vision or you are the vision or you lose it to find out during the early ... journey to endure who died there were who came back to Denver and waited\nAnd they\nWere really low then then it was widely what a way to find out the joy or no Denver is room saying we're or heroes\n\nOh\nMan the man\n[noise]\nHe might\nEver\n\nFeel oh\n\nOh [noise]\nSlash\nIs the\nEver oh\n\n...\nSee\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n\nNa na na na\nNa ve they hide your\nSavings\nCan\nOnly ... would do I\nNeed you know he loaded on my show should\nDie in my heart and some ... well\nI don't\nKnow\nWhere the home team than the one I\nWas going to\nDie ... another nice song\nFor the cost to die on my hot and some young\nGuy\n\nAnd he did and I'm saying why did I Do\nWatch golf when the\nRuling then loaded on my\nWatch when the through was then play harden some hills home\nShe gave me\n\nAny one gene I'm saying well I did I\n\nLose a loaded on my\nWay home no way home and told me oh\nMan\nHauling tea and she was\n\nTo lose by the by\nWhat have you on\nHold on your\n\n\nTeam and they would need\nTo\nPut those who'd gone\nTo\nBring it home to you\n\nHow long you know\nI mean\n\nThe\nTo be a\n...\n... ...\n\n... and ...\nAnd ...\nAnd\nOn about it so they will do the energy\nMe\nGod\nTo wean them in the train man saying\n\n... and wild\nIn blood and they come down and down\nAnd you\nUse\nAnd the jury and I drove me out\n\n\nAnd maybe a\n[laughter]\nYork\nAnd do\n\nShe and\nAnd don't\nThere was\nSo\n\nMuch for the loser ...\nDa da da da da da da da da\nDa da da da and always do\nThen the rain I damn\nMy mom was born and don't you buy when you say I'm gone in there ain't no all my daughter and I met down I just got\nBy saying it rains ... May Day today and then on\nSide a ...\nRain may not always been allowed to read that in your brain or\nOther and no body and the old one where\nJumped up and rambling men same body can you spare a dime and the air make fun at the\nJust don't manage ... dime a giant and\n[laughter] I'm not a [noise]\nFor a huge\n\nDown and have now and\nRaining rain than they are in there I don't\nKnees now\n\nNow\nI find a job and [noise]\nShall I\nShall [noise]\nGuess [noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]", "show_name": "Open Range", "year": "2018", "city": "Dalhart", "day": "20"}