{"month": "10", "state": "TX", "station": "KTDH", "content": "Support comes from Fort Hayes State University encore series announcing Russians drink orchestra under the direction of ... on Tuesday October thirtieth\n... H. S. U. dot edu slash encore\n[noise]\nThis is Ninety One point five ... eighty nine point three ... of service of high plains public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream then please thank him patronize the community sponsors you hear mentioned on the air who helped cover the direct cost of operation thank you\nI'm Jonathan Baker and every weekday I bring you stories about the high plains I Love doing it it's what we do here at age PBR and we take so much pride in it but we can't do it without your help good age PBR dot org today to pledge or support\nHurricane Michael cut a trail of destruction do the Florida Panhandle this week many people are without electricity and deaths have been reported in multiple states I'm sure ...\nTrail of destruction do the Florida Panhandle this week many people are without electricity and deaths have been reported in multiple states ... will keep you updated on storm recovery efforts plus the latest news next time on all things considered from NPR News\n[noise]\nSaturday afternoon it for central\nAnd\nThis is Gloria Goodwin from liberal Kansas and I listen to MORNING EDITION not high plains public radio [noise]\n\nLive from NPR News in Culver City California I'm Barbara fine\nPresident Trump is congratulating American pastor Andrew Brunson for his face and strength as the to me that the White House is our\nTurkey free Bronson yesterday after detaining him for nearly two years and after intense lobbying later today the president heads to eastern Kentucky university as he campaigns for Republican candidates Cheri Lawson of member station W. E. K. U. reports\nThe president is expected to top the economy and job creation he's also expected to rally support for six district congressman Andy Barr bars in a hotly contested race with democratic nominee and retired Marine pilot lieutenant colonel Amy McGrath\nJosh narratives Madison County Republican chairman he says Trump coming to Richmond is a huge play for Andy bar it's going to really\nCause those conservative voters that red wave to show up to the polls in November\nFormer vice president Joe Biden stumped for McGrath yesterday at a fish fry about an hour away from Richmond Trump stripped of the blue grass state comes at a time Democrats are hoping for a blue wait for NPR News I'm Cheri Lawson in Richmond, Kentucky\nEmergency workers in Florida are still sifting through the wreckage from hurricane Michael which is blamed for at least fourteen deaths NPRs Amy held reports officials say that number will likely rise as crews reach hard hit areas\nSearch and rescue team found a body in Mexico Beach Florida a small town which has now been mostly flat and Michael made landfall near there as a monster category for hurricane wonder if the strongest to hit the country ever\nMichael weekend as it moves north but it kept leveling neighborhoods toppling trees and power lines and causing flooding in Georgia and North Carolina and Virginia\nEmergency officials in Florida say they finish the initial rapid search phase now they're beginning more intensive inspections of collapse structures officials say the recovery process will be extensive any health NPR News\nPope Francis today ... up to more Chilean priests accused of sexually abusing minors and in an apparent effort to show greater transparency he publicly explained why they were moved NPR's Philip Reeves reports\nThe two bishops of religious clerics to fold in a scandal that's engulfed the Catholic Church and ... the Vatican says Francisco Jose ... Marco Antonio Dennis Fernandez was stripped of the priesthood for overt acts of abuse the scandal so far to the resignation of a handful of bishops a prominent priest was the ... last month\nAnd prosecutors say they're investigating over one hundred cases of alleged clerical abuse going back to Nineteen sixty\n... long been accused by victims of covering up the issue and then being slow to respond when the pope eventually sent a team to relate to investigate it identified the culture of abuse\nConcealment Reeves NPR News this is NPR\nGlobal financial leaders are urging countries to brace for potential risks from trade disputes another economic tensions\nGlobal financial leaders are urging countries to brace for potential risks from trade disputes and other economic tensions they made the warning today is they wrapped up in annual IMF and World Bank meeting which is dominated by U.S China trade dispute\nFacebook is revising the number of accounts that were affected in a cyber attack at disclosed a couple of weeks ago it now says thirty million accounts were exposed rather than fifty million\nStill it's a huge breach and NPR's Jasmine Garsd reports Facebook says it's reaching out to users who may have been compromised\nThe FBI is investigating who was behind the attack which exposed the birth dates locations phone numbers and search histories of millions of Facebook users guy Rosen overseas safety and security at the social networking giant he says affected users will\nGet a customize message from us in the coming days we'll be explaining what information the attackers may have access\nAnd what the ramifications might be Jasmine Garsd NPR News New York the Pentagon\nSays a contractor that handle some of its travel services was asked earlier this month and some personal data was breached officials say no classified information was stolen [noise]\nFootball Hall of famer Jim Taylor has died the full back played in the national football league for ten seasons most of them with the Green Bay Packers he played with the Packers when they won the first ever Super Bowl Taylor was eighty three I'm Barbara climb NPR News in Culver City California\nSupport for NPR comes from law may or may corrupt bill to meeting proud sponsor about how I built this summit taking place in San Francisco every year but boy metrics or October exchange learn more or go to meeting dot com and the listeners support is NPR's very true\n\n[noise] stand by open range on the air [noise]\nMarshall [noise]\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise] they were in the land\n\n\n[noise]\n\n\n\n\nI Would afternoon\nWelcome to open range we're going to start off with the Alabama stop by red Nichols Venice by pennies\nExecutive director Bob Davis will be joining me in a short while here and his home state of Alabama will be sprinkling today show with some music from Bob from state to state June [noise]\n\n\nWeek plead the\n[noise]\nDark shadows over the re\nA\nThe yeah go ride\nKnow with the [noise]\nThey need a black\nMovie that he can\nAnswer\nMuch for the day\n\n\nWell\n\n[noise]\n[noise]\n[noise] I\n[noise]\n[noise]\n[noise]\nTrying to find your way [noise] what\nDo you use your your your your\nMiddle\nAll the way [noise]\nAnd\nTrying to [noise]\n\n[noise]\nAn an an an an an an an an an an an an an an an an an an an [noise]\n\n\n\n\n\n\n\n[noise]\nAnd thank you yes the Alabama Shakes that's what you were just listening to it so about twenty eight minutes after the hour don't want to fight no more by the Alabama Shakes\nThat can't be Brittany they're doing a little screaming you are listening to open range on high plains public radio this is not the voice you would normally hear it's not the lovely and talented Steven Johnson he is here in the studio with me but he is\nA let me pick a few songs and so what we heard before the Alabama Shakes we heard the comment doors Lionel Richie and the and the boys in the band from the comet orders from Tuskegee, Alabama singing about sweet love what a wonderful wonderful time it is to hear that and before that we got it all started off\nWith Percy Sledge and when a man loves a woman I got to make a few picks this afternoon for a for open range and I have to tell you it is a thrill it was a thrill Wednesday when asked me because this is one of my favorite programs even this is a this is the one of those shows where you go\nYou\nOh honey you turn me I'm I'm the\nCountry staging little did Carney I'm a\nCan\nIt and didn't\nKnow he doesn't\nAny land and how do we do get a quick\nAnd then you know strong when they hit the chance to do\nThat on the line don't you come\nTo New York times\nThis\nIt's funny then to me because I Need to do this again and again\nI mean you know crack in and then they go do some\nLive close to the\nLetter savvy cities you can do and\nI'm going to be\nGame\nKnow again come man station\n[noise]\nMan\nCheese [noise]\nGoing\nWay back to Nineteen Seventy two from her for the roses album that was Joni Mitchell you turned me on I'm a radio and right before her blind Willie Johnson with\nNobody's fault but my own I'm Steve Johnson is open range on member supported mission driven high plains public radio with me I'm happy to have a H. P. P. R. executive director Bob Davis good afternoon Bob\nGood afternoon Stephen and thank you for letting me invade the a luxurious open range studios ah this is a thrill for me and I I Know your show was a thrill for listeners that's what they tell me they absolutely love it because\nIt is this fantastic sort of gumbo I'm southern right we know gumbo or Brunswick stew whatever you call it you just mix it all up together and it tastes so good and that is what open range it it's just this great eclectic mix\nOf music so and it's even said you're listening to it on member supported put her to underline their members supported and that's why we are breaking into this wonderful music to\nMake a request to request that you would become one of those members one of those supporters of high\nPlains public radio or if you already with us as a sustaining member you might add a little bit more to your pledge by doing so you can read some wonderful benefits those benefits include\nEnsuring that this sort of musical program remains on the air ensuring that the ... the news programs that you hear the regional news casts a year roommate on the air\nAnd there's a little bit of a sweetener during our full membership dropped there is a calendar on offer it is a twenty and I think ...\nI don't think the uh twenty eight game would do is too much more good bit of twenty Nineteen counter which is just absolutely wonderful photographs from across the high plains scenes of the region that I've only been living here for a few months but it's it just strikes me is just this beautiful place and [noise]\nThe photographers Fifteen local artist who are members and listeners the fireplace public radio themselves are the ones who have a\nSubmitted these photographs and we've assembled they look great\nAnd so again for as little as five dollars a month or just sixty dollar one time you can lay claim to account or if you're a sustaining member already an additional thirty dollars will get you one of these wonderful calendars\nAnd doing so would support the radio and then you know what else doing so would do it would get us one little step closer\nTo our goal this hour of two hundred and fifty dollars so as you're going around your day you're grabbing you're grabbing a uh the kids at a wreck league game or you're a guy out going to the grocery store every you're sitting at home already about ready to watch the big game\nThan to be a great time to uh to step up\nAnd to ah to do your part so we need one called or we we have people sitting out waiting for those phones to ring and uh we want them to have a good time you want them to visit with each other but we also want them to be so busy\nThat they have to pick up the phone to wait for you to do that is to call the number one eight hundred six seven eight seven four\nYou have to pick up the phone to wait for you to do that is to call the number one eight hundred six seven eight seven four four four\nGain knowledge grow community give now and now I think we are ready to give equal time you know I hate my friend K. Kennedy is a\nIs a native of the volunteer state a native of Tennessee and ah you know we we sometimes have a little bit of a rivalry but that's okay and she wanted a little equal time by hearing the Tennessee well I found\nThat it was quite appropriate at the University of Tennessee this afternoon has beaten Auburn University in football\nWe might even call that a little bit of an upset thirty to twenty four and because he's my friend anyway I wanted to give some equal time so we get to hear little Tennessee music Steven are we ready to play\nA I Believe so okay well there we are famous last words okay here here's a tendency well this is by the ... cold three oh and in addition to Kay I'm a space cowboys probably listening in with his mom's favorite song so to double purpose here\n... ...\n\nI was well the thing\n\nWhen\nI and to\nMy family\nAnd\nFriends know\nWell I [noise]\nThe\nOnly you\nOnly\n[noise] Mm\n\nSee oh\nNo I\nUm\nSee well\nNo I\nThat\n\nWay in hell\nNo\n... ...\nAnd so uh it is something that is quite a special thing Stephen and so we're about to go into a little break and then yeah yeah we'll be back with\nYou in one minute don't don't miss is too much\nHurricane Michael cut a trail of destruction do the Florida Panhandle that many people are without electricity and deaths have been reported in multiple states I'm Shereen Marisol Meraji will keep you updated on strong recovery efforts plus the latest news next time on all things considered from NPR News\n[noise]\nSaturday afternoon it for central\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\n[noise]\nWelcome back to the second hour of open range where we're starting off with Ben fabrics alley cat cave\nKennedy who they just joined us this week I'm from Amarillo is hearing all about the push he galore ranch my my home so we um decided to start this off with a little thing for the kiddies back home on the ranch [noise]\nOkay kids were who were entering the second hour of open range make those phones ring or get on line H. P. P. R. dot org or one eight hundred six seven eight seven four four four but I don't get a lot of calls it might feel so bad [noise]\n\n\n\nVent fabric was a classic instrumental that's alley cats that's for the\nVent fabric with that classic instrumental that alley cats that's for the the kitty that are that are roaming my home right now blossom\nSometimes comes to the studio with us and its complete pandemonium she has found she's one of the I forget what they call those\nBut she's a cat with thousands and and and ... Collins who does underwriting discovered that when she was in here and Sunday came in and said she has ... and I thought that's why she she climbs curtains and launches herself and I guess\nThis is probably why that she's able to do your phone and also user a use your credit cards I'm sure to do that I had a digit yeah my my own country I added to my own membership [laughter] very hey that what a great idea\nWhat a great idea sure we [laughter] editing your membership is part of the reason that a\nSteven his so gracious I'm Bob Davis by the way of H. P. P. R. and are adding to your membership is part of the reason Steven has graciously allowed me to sit in on this fantastic program open range um\n[noise] we have a ... brings he brings you an opportunity to support public radio on the high plains and uh\nUh you know whatever you pick as as a level of giving is is to ride them out and uh\nOne of the sweeteners that we have during our phone membership campaign is a calendar a wonderful twenty Nineteen counter the photographs are a from a taken from a spots across the region it is absolutely beautiful Fifteen local artists who are who have a\nQuiet vi quite the how they all do and so you can make that calendar your own for as little as five dollars a month\nOr if you're a sustaining memory you can do in an additional thirty dollars and you can claim one of those for your own it's a great way to mark the days it's a great way to be reminded of the beauty the great natural beauty has a place that we live\nAnd also equally important Lee a great way to a show your support for community radio on the high plains so\nWe are got a we've got some music that where I think we're ready to play we're going to play that are just about he's he's given me giving me the full signed a ... guys to Stephen is just a master of this I'm I I kind of I don't think I could do this for a I'd be I'd be in a ditch as they say that day\nHe's a master of this and I think we are going to start off with St Paul and the broken bones is that right or yeah and\nI had to tell you about we did that show um a few months ago and this one at you brought so much to the table and quite a few of these is my first time hearing like Vince Gill song we'll be playing later threatened me with having that's beautiful\nAnd that wonderful yeah so there's a lot of great music coming up this hour one eight hundred six seven eight seven four four four or online at H. P. P. R. dot org\nAll right so make make the phones rain keep people busy support public radio on the high plains and or the next door to St Paul and the broken bones from Birmingham, Alabama so pleasing please enjoy it and give us a call let us know what you think\nAre we ready we're ready All right thank you\nIsn't that wonderful yeah yeah so there's a lot of great music coming up this hour one eight hundred six seven eight seven four or four or online at H. P. P. R. dot org\nAll right so make make the phone's ringing keep people busy support public radio on the high plains and the next door to St Paul and the broken bones from Birmingham, Alabama so a pleasing or plead enjoy it no give us a call let us know what you think are we ready we're ready All right thank you\nAnd and and\nThe hall\n... ... you\nKnow\n\nThe recall and but I don't\n\n\n... and\n... cheese here and\n\n\n\n\nChat you up just a little bit ask you what's going on ask you about the kind of music that you like uh\nChat you up just a little bit ask you what's going on ask you about the kind of music that you like a you know\nAnd ask you what you do it on this Saturday what uh what's your\nWhat's your plans are we know that this part of a Saturday routine is part of my Saturday routine is to have a high a open range on high plains public radio tuned in\nBecause it's a it's a great way to move in and out got the car got the got stereo on when I'm at home doing chores or cleaning house or what not and uh what are you doing out there while you're listening to open range give us a call at one eight\nHundred six seven eight seven four four four and tell us tell us to tell us about your afternoon Steven thank\nYou again for letting me come on to your show man this is great I'm loving it\nOh I I Am too well the the ... the first show we did was was really really well um so I thought wow you know and and he has to buy a car [laughter]\nIt though so ah no I I Love the music we we got a lot of feedback I think some people gave you grief for the beastie boys but that's okay I've gotten\nGreece for ... I Believe there was at least one kind gentleman from Amarillo who then I met ... not long after and he said you seem a lot nicer than some of the music that was played or something to that effect and uh\nI took I took that as a complement and I said we're breaking down barriers and frankly Steven that's isn't that would open range is about you break it down some berries me don't want to get trapped in a little bubble of music you love\nAbsolutely the the original model of the show was was a no boundaries just great music you know\nSometimes we get crazy and throw in some spoken word and comedy I I had to clean up at George Carlin skipped last week for the show and boy that'll keep you busy oh you mean your knitting clouded by editing one of those puppies\nOkay one eight hundred six seven eight seven four four four or online at H. P. P. R. dot org\nI'm going to do something now because I trust my listeners I trust you guys to call and we're going to do a three songs set so we'll spare you are just slapping for for a few extra minutes yeah we'll do our we normally do we're going to start off with Mary Blige mighty river\nOne eight hundred six seven eight seven four four four or online H. P. P. R. dot org okay now you get to hear a ... a whole three songs together now here we go\nI\nLack of them\nHe told\nThem on\n\n\nRead the mom\nWell the mom\n...\nChanging the chicken ...\nWhen I\n\n\nAnd I mean\nOh ooh\nOooh oooh oooh\nOooh oooh\nOooh\nOooh\nOooh\n\nGoing\nWhen the rule and cold\nRead it and when the rover to grow\nPeople go on\nTo judge the rules are now and they're like do they\nAnd I go my history she lived in the ... not going to work their lives\nAnd not only are the ones on the sand and died jobs trying to live and breathe easy [noise]\nBowl\nThe men get them but then when the when the role is go to Andrew any good whether or not when the rules are school\nJames Chaney knew the window roll and go like pushed one of the men the men to deal with the war\nThe good within the ruling couple\nJames Chaney the window roads that go I pushed one of the many admitted to deal with the cost or\nAnd um it really captures the high plains in the Nineteen thirties\nAnd uh\nShe loves the music the programming and what it does for the region a man and thank you thank you so much Judy and Bob you have a thank\nYou I have a very special thank you Steven and it goes out to a certain person who I share the same last name and kinship with a\nCharles Davis Charles and Robin Davis of Alex ... Alabama have called in\nA sense to me it's because that's my mom and my dad and uh they have a pledge their support too high plains public radio and we'd like to thank them and we'd like to let them be an example to other\nListeners out there who are listening to us they're listening to us on line this afternoon and that's certainly a an avenue or that I often like to choose as well and so a thank you so much to mom and dad are we've all got parents so why why don't you encourage all our parents to call high plains public radio and uh\nAnd that you know pick up that phone one eight hundred\nSix seven eight seven four four\nFour or as Steven has said go to W. W. W. dot H. P. P. R. dot org and make your pledge and we will uh as Stevens going to do was daredevil act and I don't want to hold him up anymore\nWe had a request all the way from Alice ... Alabama or you can see where I get all my funky taste in music somebody a ... whose last name is David ... lives in ... one of the here's a Commodore is brick house they started this whole requesting [laughter] I don't I don't blame them [laughter]\n[noise] [noise] [noise]\n\n\n\n\n[noise]\nAn\nOkay we're not going to go into another song right away I'm I'm going to interrupt that should check with Bob needs a we have we gotten anything yet\nI've not had anything yeah All right how are you still got your shot you got to hurry and I were good yeah I did it one minute kids come on [laughter] one eight hundred six seven eight seven four four four let us know what you want to hear ... said I don't want to put words in his mouth but\nIf you can't get to this ah this last Fifteen minutes he will try to get to it to the next episode next Saturday\nI Do have an encourage word encouraging word Bob I heard from 'em my pal Abby and good when she's the executive director at the good on art center up there and she's loving the show and she said she literally turning up the volume now that's what we encourage\nWhile I was dancing in the city I just now so I'm happy to hear I have a fellow traveler in Abby thank you Abby\nI Wonder if I ever caused listeners neighbors to complain I had plenty\nOf ...\nAll right let's\nMove ahead with Dr by truck or is this is Carl Perkins Cadillac it's another one from Bob's last and uh if you haven't heard the drive by truckers before they they rock\n\n\nThe here I have a fellow traveler in Abby thank you Abby I Wonder if I were cause with his neighbors to complain I have plenty of ... ... ...\nAll right let's move ahead with Dr by truck or is this is Carl Perkins Cadillac another one from Bob the way I don't know if you haven't heard the drive by truckers before they they rock\n\n[noise]\nOkay I I'm not hard was three if you have to read that needs to make your request\n\nAnd ...\nMan\nAnd [noise]\nI\n\nHave a\n\nOne man [noise]\nYou\nMan\nAnd\n\n\nAnd\nOr\n\n[noise]", "year": "2018", "show_name": "Open Range", "city": "Dalhart", "day": "13"}