{"month": "10", "state": "NY", "station": "WRUR", "content": "\n\nDa da da\n\n\n\n\nDa\nDa\nDa da\n\nDa and\nRain and\nWind it down to the end of another edition of the world are going to hear an eighty eight points a W are you are at an age the Rochester\nWe think what it is been a time with the people they bicker time they would do with time we'll go to the next time we share a time\nAnd if you keep them without a smile on your some God loves him and we do to it as you continue to work for us we can take you to pray for you reminding you at a helping hand said no three job of avenues four o'clock this afternoon the appreciation of service for mother worked their hair is going on\nA hill fifty one thirty king street in each Williams and four o'clock this afternoon they close out there doing why ... [noise]\nYou know the early evening at the house for God's church six before north good men [noise]\nEvening of praise and worship with the other day that you got for church was hardly bright cloud pilot favorite and many many others rooted in all the great gospel program we have here in the city the answer Sunday Morning gospel\nGospel our power golden got what training or the gospel program and our twenty four hour Rochester based Internet girls were programming or gospel television with gospel profile and go down for our weekday mornings you're gonna open tuning which got Reagan\nWe friday evening\nRejuvenation with Scott while as a black and blue with the current [noise]\nFor a full schedule for regular\nOr just the listener I go to WWW dot W. are you are\nDone or\n[noise]\nIn the background music from those of you and I've always\nWill leave or music from this older or\nHave a boss when my trouble to you know every birthday happy anniversary celebrate birthdays and anniversaries all day and throughout this week is your your your day every birthday to murder\nCollector\nYour nearly police should know\nThat the average age real jak in\nAnd get into\nWilliams junior and\nAndre Baker at home like Jane to make our ...\nAnd they're very very very special happy birthday to\nMy little sister\nMary Elizabeth your [noise]\nHappy birthday to you baby dirtier so proud of you to\n\nTake care because everyone your weather service if you go to the same church I'm going to see us service if you don't plan on going to church today [noise] think about it on behalf of the ... the needs and the rest of the world look out for your whole way that they take care of a prayer for\nState and the way\nWe love you [noise]\n\nAnd then when you\nBy God\nNot\nThere and the two best you're happy birthday\nTo little\nHappy birthday to you all the way love your baby\nWhen I\n[noise]\nBig for a moment where else would you turn if one day public radio wasn't here for you\nWill soon have a chance to help make sure that they never caught joined us a new member Monday when you can do your part to keep this resource alive and well whatever you decide to invest will be doubled thanks to do a matching grant you had you could end up winning an Amazon smart speaker\nIf you've ever thought about supporting us will resource new member Monday is your day just step up and be part of it\n\nIn our ... will be joined by Nick heroin in the book where the middle ... that this weekend\n[noise]\nThis afternoon the one that we are you are ... the Rochester\n[noise]\nYou're listening to different radio ... FM an HD Rochester also W. I. T. H. at them and H. D. in Ithaca were aligned it W. R. U. R. dot org or W. I. T. H. dot org I'm Maureen rich him were heading down the road to joy\nGlad to have you with me how petty and heartbreak airs tonight to start us off\nFrom the echo album her request\nThis one called room at the time\n[noise]\nDo now around on our own money [noise] big in the news\n[noise] ... now and I I'm going\nOn [noise] drying no\n[noise] do we do a [noise]\n\n\nA good man on law and ah [noise] well we [noise] should be [noise] you know kill ya man Don guy [noise] ...\n[noise] do y'all\n\n[noise]\n[laughter] [noise]\n\n[laughter]\nOn our on our mom read [noise]\n\n\nIf you are now man I'm drama\nAnd all [noise] all\n[noise] big we do [noise] do do they all around drama and all [noise] all the [noise] big and we did do judge out man I Know no [noise] no\n[laughter] so\n[laughter]\n\n\n... ... ... ... ... ... ...\nTo get me to ... ... ... ... ... ...\n... ...\n... ... ... ... ... ...\n... ... ... ... [laughter]\n[noise] [laughter]\n... ... ...\n... ...\n... ... ...\n... ...\n... ... ... ... ... ...\n\nHe\nSaid he had\n\nThe\nThe ...\nThe only you know the\n[noise] [noise]\nWe wonder\n\nWell let's see\nHe he he\n\n[noise]\n\n\n\nHe\n\nReady car lot from her new album by the way I forgive you with the joke\nJammed town in there with who and love\nFrom their E. pi at the same name in the wild flower with hand me down started off the night tonight with Tom Petty and the heartbreak and too cold room at the top from the ethical album would brothers coming up next when the paradise album hearing different radio\n... ... ... ... ... ... ... ... ...\nIt all out in the rural\nBe gone away all the bad old\nGod do love to live\nOn Monday and ... them all the time alone is all about God\nAbout long in the bar\nEvery day I'm just waiting on the days I understand they you know when you're never going to be gone away\nA ball that goes that do you um all alone at all I Know it was they get along with the radio\nWherever they go back\nAway now been downloaded apps okay we'll look back on you\nThey no longer\n\nYeah to plow through through it all out in the dead broke down when I was the backup brick\nBy brick by ...\nJohn\nMammograms on on the news I don't see them\nOut and do a song and down on the back of my friends\nNo\nNo no no no\nI had no time\nRead just saying from Barbary\nCoast ...\nI'm\n... now\nDown down John was\nI\n... I\nOr worse\nCall them body\n\n... ...\n... just would move\nHere to do\nA\n[noise] [noise] [noise] [noise] [noise]\nWell ... ... email me and\nMade a turn it again\nAnd now my kids are\nAnd\nYeah and then\nWhen I Walk in the car\nBomb\nOh\n[noise] [noise]\nYeah yeah yeah ... ... ... ... no\nBut ah you know black man\nI've got to get down to write [noise] and\nYou know the draft\n... made out of\nA name ma'am I'm not by\n... or\n[noise]\n\n[noise]\nThey make you do them money man the\n... and last year and\nDown you know then\nKnow that he he now new\nAfter\n[noise] still\nThat on line\nSaying yeah and uh\n[noise]\n[laughter]", "year": "2018", "show_name": "10,000 Good Songs", "city": "Rochester", "day": "14"}