{"month": "10", "state": "NY", "station": "WRUR", "content": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm winding down to the end of another edition of the world of gospel here on\nAny point five [noise] W. R. E. R. S. H. the word right now\nWe've made you more tuned in\nMinnesota I Would love to love your party they become time spent time\nWell spent go to the next time we shared time we see someone with a smile give us some God love them and we do too and I should get you to\nWork for us we continue praying for you [noise] reminding you tune into all the great gospel program we have in and around the Rochester area he asked her Sunday Morning gospel gospel hours about going into\nGospel training and our other great gospel programming our Roger debate Internet [noise]\nProgram and our um gospel television what God's will profile and a gold and the gospel our\n[noise]\nWeekday mornings here on W. are you are you doing in a car where are you going with open tuning friday and neither you and Asians would got wallet and black and blue with the great [noise]\nFor full schedule play live comments [noise] or just delivered ally go to W. W. W. dot W. are you are\nReminding you there did evening\nAmong holiday one forty one and a street that passer anniversary concert with what you see these nice Dixie wonder the boys right grow\nAnd river time it's Ryan on this afternoon five o'clock good gospel angels powerhouse of brain maybe some help on St ... paid highly favored transition and many\nMany other [noise]\nYou bet you more than going out to the rigor\nSo but when you're in our prayer\nAs always we will music row whistles birds\nJesus washed away Montreal losing male dominated\nBy every birthday or versus all those other worry birthdays anniversaries on today and do all this week every birthday to ... ... ... ... you write\nYour mate yet but that's where my parents are and baby Robert way nor would I be worth it to remove from ... to ... a little girl take your ... your way out the service will be boys that are going to judge I'm going through all the U.S surveys have you don't plan on going to church do they\nThink about it on behalf of the Reagan Denise interested up there for the world\nThe old way and after the daycare they were all day and the way we love you\n...\n\nAlready\n\nDo well by doing good become an underwriter to learn more about connecting your business is different radio audience send an email underwriting W. R. U. R. dot org [noise]\n[noise]\n[noise]\n\n\nMhm\nAnd I and I said well let me play on each ... solar powered stage the music conversation community involvement mean hundred percent of machinery this week in Egypt\n[noise] men do damage to know why do we are your ... D Rochester\n[noise] Mm [noise]\nYou're listening to W. are you are up I'm an HD Rochester W I teach at them and H. D. in its ago or online at W. R. U. R. dot org or W. I. T. H. dot org I'm Maureen rich in this this road to joy glad to have you with me\nHope your day's going good and we got a lot of music coming up so I'm going to\nGet started right at the heart of the matter with this first two\nAnd a ... [noise] [noise] [noise]\n\n[noise]\n\n\nNo [laughter]\nBack on the phone and they're not looking for my job at all and end the novel\nAnd Vermont ill and listen to your head and boom I John\nJohn at\nThe back of\n\n\nDown and looked at me and I went down a member of the mind your memory\nLandmines oh\nGod\nHope you don't do much when\n[noise]\n\n\n\n\n[noise] [noise]\n\nWhat a\n\nMy do cause no with the title cut to watch the whole jar William covering the pink Floyd dealing with comfortably numb and that's on her my better self self\n... moon dance and starting a saw was buddy love and joy from her um I've got my own health terrain that set loose in the Williams too um they both do yeah an awesome rendition of it\nBut I heard venue let's first and then than are listening to Williams do it they're both great in different now than your weight lift coming up next with the night sweats Iran different radio [noise]\n[noise] [noise]\nNow I'm On [noise] on the [noise] big reviews\n[noise] you know now I'm going on [noise] crime no\n[noise] do we do um [noise]\n\n[noise] [noise]\nYeah [noise] well we [noise] maybe [noise] ... yeah man Don guy [noise] bond on dry [noise] y'all\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\nYou know around drama\nAnd all [noise] all\n[noise] big we do [noise] do you do man I'm drawing on [noise] on\n[noise] big we do [noise] do judge out man I Know [noise] oh\n[noise] to New York\n[noise]\n[noise]\n\n\nI see you know\nThey do what it is oh yeah well do\nYou do see me I Know it was the duty so let's see [noise]\n\n[noise]\n\n\n\nRobert Plant in his latest album carry fire and that to go both the same ...\nBefore that with creatures like me from his I Love everybody album and super organism with everybody wants to be seen new music\nWe heard Maggie Rogers before that with Alaska and starting off that that was that they know right live and the night with looking here ... coming up here a different radio with who and love\nThe um\n[noise] from day\nAnd I'm way and in our\nI'm just a\nBit glow\nOn the grill on a shovel bomber\nInto the allow them to do after\n... ... and\nAnd all the shale much you got me at all to be something that\nThe way I'm dreaming that I'm slave labor day do you\nHalf times after nine\n\n[noise] [noise] [noise]\nMm\n...\nMm\n...\n\n...\n... the ...\nTo ... the\nGuy to give it to you know and if men known\nAnd I only chicken\n... even do\nSearch and\n\nWe do not think it's been ... may grow\nIt was on the street and under those ...\nLois men tend to think that the ...\n... ... ...\nGot to give it to\n\nNa na na\n\nNa na na\nNa looking into some snow\n...\n\n...\n... ... ... ... ...\nAnd I just want to play\n\nWith me and I'm not a given to get in on\nNa\n\nNa na ...\nBeen looking into the building a new snow\n\n[laughter]\n\nYou know the the ... ...\n... no no\nStay on the line and they\nThey do a lot and then killed gone to nine oh\nD a and a bit of a ... and still stay in\nThe\nMay just being mean and then the other day saying then that I Do and then but we're\nThose she she meant\n\n\n...", "year": "2018", "show_name": "10,000 Good Songs", "city": "Rochester", "day": "28"}