{"month": "10", "state": "NY", "station": "WRUR", "content": "[noise]\n\n[noise]\n[noise] oh oh\nOh oh\n\n\nEnjoy that you're looking at the top of mind for kids makers in our region become a W are you are under later to learn more sending emails to underwriting at W. R. U. R. dot born [noise]\n[noise]\n[noise]\n\nMm\nMm Mm Hi I'm Nicky made up in a wailing Jenny will be playing from each county solar powered teenage music conversation community involvement in a hundred percent emission free in the ... you can\nThe afternoon at one end up we are you are a ... D Rochester ...\n\nYou're listening to a different radio W. R. U. R. S. I'm an HD Rochester W. I. T. H. F. M. an HD an ethical we're in line at W. R. U. R. dot org or W. I. D. H. dot org I'm Maureen rich and I'm headed down the road to joy I Hope you'll take a ride with me\nI'll be with you for the next couple of hours playing lots of GOOD Music and uh I Know you know that we're in a membership drive this week I Hope you'll take a chance and a hole in or go on line and put your support for the programs that you hear each day all year long\nWe're going to start out the night tonight with a birthday tribute there's lots of birthdays this week so I thought I'd take the next to a wish you happy birthday to some of them starting off with the red hot chili peppers\n[noise]\nDoing now I'm On my own money [noise] big in the news or [noise] you know I'm going on [noise] ... know\n[noise] do you do oh [noise]\n\n\nOh yeah man I'm off and on [noise] well we [noise] maybe [noise] go down and they're gone [noise] [noise]\n\n[noise] [laughter]\n[noise] [laughter]\n\n[noise] um [noise]\n\n\nYou know around drama\nAnd all [noise] all money\n[noise] big we do [noise] good man I'm drawing on [noise] on on the [noise] big we don't know man I Know no [noise] no\nAnd that's from the album I'm with you up next Elizabeth from the welder I'll go with el camino\n... ... ... ... ... ... ... ... ... ... ...\nThrough it all out there in the world can down we're now they got away or the bad old brick by brick\nDo laugh a little bit and all\nYou know the broken down we're in our new guy\nDay and then the only time alone you know like\nIn a bar in a day a week to weigh in on the day is I've just been a ... game where they gonna lay\nOut of a ball that goes that deal I'm all alone at all I Know it was thinking along with the radio dream about\nEvery day and go\nNot download that okay we all look back on the\nWho\nYeah I Do love to go through it all out and did broken down where now was the man back\nBreak down the line to do\nOut or you know do do you do it now\nWant to say there are other bad go way down to come down to ... and early\nAnd on and I'm now in Las Vegas Nevada Mad Men by trying to\n...\nLand you know I'm trying\nReally just saying Barbary\nI go to the bus ... a\nDown down John\n... than I\nA ban on\nAnd then the\nWhen do they they called you body\nWhere does rain from their Barbary\nDo buy them from the dead man and ah\n... in in a\nUp in Ohio\nNa na na na na\nGiant then and then walk in the sand\n...\nUm [noise] [noise]\nYeah and yeah ... ... tanks my brand new way\nIt but you know like that\nGot to being down praying [noise] man\nYou know the draft\nWhere I mean I\nOn the man I'm\nA I'm\n\nKick you do them money man that\nAnd plus you and [noise]\nDown you know ... van and\nKnow that you know no new\n\n[noise] oh\nThat go on line\nI Am yeah and um\n[noise]\n\nKnow lots of songs tonight Leon Bridges we just heard from his coming home album that one is called better man before that it was lake street die from their latest release for yourself with good kissing\nAnd great Potter was empty heart started off with the annual rate lives in the night sweats and I never get a ...\n... getting coming up next year on different radio\nOh\nI see you know\nThey do what I Do oh yeah well do\nYou well know me I I Know they won the duty so\n\n[noise] [laughter]\n\n... good luck in the beginning you know well\n\nWhat do you know I don't know me\n\nBeing na\nDa da da\n[noise]", "show_name": "10,000 Good Songs", "year": "2018", "city": "Rochester", "day": "21"}