{"month": "10", "state": "FL", "station": "WFLA", "content": "If he's approved by the cloture motion tomorrow or the Senate would end debate and move on to the final confirmation vote that scheduling September ... up to McConnell\nBut it could take place as quickly as Saturday although now again because you have a potential Republican senator who won't be there on Saturday because of his daughter's wedding that could really change the schedule\nI I just don't know that Republicans are going to have a vote or to spare it just could be way too close\nSo that's where we are at at\nEight forty eight on October fourth when it comes to the Kavanaugh nomination I definitely think a smart move on the part of the cabinet team to put out that Wall Street journal or editorial and and again the paragraph that really is going to get the most play\nAnd I'm quoting here I was very emotional last Thursday more so than I have ever been I might have been too emotional at times I Know that much on was sharp and I said a few things I should not have said\nRight there\nPersonally I'd feel a little bit better if he threw in and I apologize for that but he didn't instead he said I Hope everyone can understand that I was there was a son husband and dad\nAttest by with five people foremost in my mind my mom my dad my wife and most of all my daughter's eight hundred nine six nine Ninety three fifty two is the number I I Want to make sure that before we wrap up this year we get to Alex trip back\nWho wall a fantastic coast on Jeopardy is apparently a horrible horrible debate moderator\nWhy he was even moderating debate in the first place is beyond me can you give out but he did and it\nDid not do well so we've got that and a couple other final stories for your next here on P. M.\nM. S. R. P. envoys list\nPrice dealer price to be happier if your car shop and you've probably heard these terms of\nWhat they mean it's so confusing well it was confusing not anymore and tell you about true price from true car it's a price it actually means something because it's the exact price you pay for the car you want including season accessories and basketball you'll know if you're a true prices competitive because true car shows you what other people are paying\nFor the way our heads six past the hour\nWFL a alligators don't compromise on the field and gators fans don't have to compromise when it comes to diamonds engagement rings by July\nYou always get more international diamonds in her mind easiest lowered is leading jeweler recognize statewide for excellence in every category selection value and trust and that's why we've been named official Jupiter, Florida gators again this year so come visit one of our age over across the state or twenty four seven ... dot com\nBubble rape or cry when did it become OK for men to be lazier softer fatter we need to bring the better of his country back to grade this and it's easier than ever with aids lists male Macs a patent pending formula within a greeting if that helps boost your total testosterone\nPromoting greater increases and mussels size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric\nOxide him here next chance to win a thousand bucks coming up at six pass the top of the hour on nine Seventy W. F. LA\nHere this new show at its new time\nNights from nine to midnight on news radio nine Seventy LA and\nFinal segment of the em in Tampa Bay I'm here hosts drying Norman with me in Studio my producers Morgan lash and James Berlin or the phone number is eight hundred Ninety nine Ninety three fifty two I'm getting a lot of emails about the uh FBI agent the former FBI agent who we had on\nIn the six o'clock hour uh Stewart Kaplan is his name he used to handle background investigations on nominees and I thought he was\nFantastic he life he really broke it down because I think I Know myself and so many other people have so many questions about the process\nYeah he he stayed on with us for a really long time and we we step through everything how the background investigations normally work\nHow this supplemental won a war so it was a really fascinating interview I'm getting a lot of emails from people who who missed that want to hear it we're going to have that are free on the website I promise it'll be up there tonight\nUh nine Seventy W. F. L. A. dot com just go to the PM Tampa Bay page and we'll have a blog post with it also you can find it on our podcast and also I have our weekend event segment\nWith Tampa Bay times entertainment and events reporter Sharon when a that will be up there too I I've been wanting to get to this story tonight\nAlex ... back of course the host of jeopardy has apologized for his performance as the moderator\n[noise] of uh Pennsylvania gubernatorial debates earlier this week saying he misunderstood his role [noise] [laughter]\nSaid I thought that as moderator I was to provide a certain lighthearted approach while still being able to challenge\nAnd it's on their record it positions I didn't realize I was to ask\nA simple question and then let the gentlemen go at each other has he never watched the debate before\nThe game even\nWhat did he think he was supposed to do according to a watchdog dot org analysis a trip back spoke for more time than either the two candidates [laughter]\nHeated forty one percent of the talking\nWhile or one of the other candidates spoke for thirty two percent of the time and the other one twenty seven percent of the time to back off and provided his own opinions on topics\nEven getting involved in the debate itself [noise] and at one point he joked that the only thing with the lower approval rating than the Pennsylvania legislature\nWasn't the Catholic Church even doing stand\nOut while this was all going on [noise] see I think you do have to set up the debate differently if alec trip back is moderating it he should have been giving the answer is [noise] and then the candidates\n[noise] provide the question\nI'll take governor Tom Wolfe's policies for five hundred dollars [noise]\nThe answer is I'm against it and then the response would be what is the death penalty that's how this whole thing should have worked if you're going to do it right\nThen that's that they can it really capitalize on that\nI guess he got really carried away so much so that he had to apologize for it go figure I I don't know how we wound up getting involved in it in the first place I we've got a couple of things for you on the website this I'm sure our audience is\nGoing to love and eat it up Hollywood liberals getting arrested for protesting cabinet or\nAmy Schumer was arrested today she was protesting Brett Kavanaugh's nomination at the heart Senate office building we've got a video of her are out there she says he's filming ... she's at the building\nA and she says I think we're going to get arrested\nAnd then you see a law enforcement official asking her a and other demonstrators that they want to be arrested and in Schumer says yes you do that point you know I don't really feel sorry for him to get arrested and then do you know how to pronounce your name the supermodel an actress Emily Rapp reddish ...\nManaged ... that she yeah\nShe was in the Robin thick blurred lines music video I think that was where she first became famous a what a model\nAlex ... what was that saying alec okay got it wrong it's late we've been doing this show for three hours now my my my my ... my my apologies to listen to the cult complain about that\nThis information was known by Feinstein in July and the wasn't trotted out until the eleventh hour\nAnd here we are the delay the nearly weeks later we have the conclusion of the FBI investigation\nWe have the report now being viewed that listed if if I'm going to criticize something here and I think this is fair to criticize one element here is the fact that only one copy has been available for the senators to see both Republicans\nAnd Democrats and what has happened is a little bit of a log jam in the senators that want to go view this in this skiff this a sensitive information room or in a in in the Senate building\n[noise] it's uh I I Want to suggest have multiple copies inside the skiff\nSo there's one copy and there are some ... complains that the time slots the viewer filled up and\nUh you know some of the senators might not even get to see them till tomorrow afternoon or whatever the story is I I think that I Would have provided multiple copies to get this and again not to leave the skiff and to have a full accountability for all of the pages\nSo nothing is take it as phony civil one of the senators were to steal information take it out or I mean I\n... that would be floating us if I'm not mistaken so that would be one criticism shouldn't been multiple copies to get this thing uh in the hands or in the eyes in the hands but you can't take with you are in this a secret facility\nThe sensitive facility or that that's one thing I Would suggest a oh this I thought this was a very and I brought up the voice of Dr Ford and I\nReally do on this program that I was pretty shocked that when Dr Ford showed up one week ago today it was one week ago today\nThat Dr Ford came around to say uh that she testified in the capital of course was testifying right about now\nUh because we took a lot of the testimony a lot of the questioning live here on the show so that was one week ago and then of course the FBI investigation which began a the supplemental investigation began a or we can go tomorrow on on friday so I got\nAn interesting email today and we've talked to my doctor Ford's voice that I was I was kinda shocked and I not only the sort of the baby is sounding voice the jihad going on but also the vocal fry which I commented on immediately that ...\nThat day and I want to know that that's called vocal fry that's the the sound that the girl that price sounding ... that's what it's actually called I had a listener\nSent me an email and again I there are multiple ways to contact me you can call the show and eight hundred eight zero one eighty nine Ninety nine will grab some calls here just a bit so you can call me on this program we're on live three oh six to six pm eastern time\nEvery Monday through friday of course radio is three hours Newsmax TV you guys get the first hour it's my understanding though today is the fourth or fifth tomorrow I Believe that show is going to be on all three hours on Newsmax TV tomorrow so our one two\nAnd three I think we're going to be filling in for how we cars time or tomorrow so all three hours the Schmidt\nOn Newsmax so you can call me anytime eight hundred eight zero one eighty nine Ninety nine during the show you can email me if you go to my website which is ... showed dot com and by the way we were on something called the ... list on my website\nAnd it grows as the show goes on because I have a a plethora of information and you know the breaking news that happens that we uh we we we deal with on the show but the ... grows as the show goes on to everything we cover on the show\nAnd this is the lead a living breathing show every day uh we add to the ... so it's a great compendium it's a great a synopsis of you know the world according to ... what I find important and it's on my Web site at all\n... dot com and then of course the short list build as the show goes on all three hours radio\nSo uh on my website you can also email me you'll see a contact ... email me and that's how I got this ... course on winter I'm Todd Schmidt ... T. O. D. D. S. C. H. N. I. T. T. at Taj ... give me a follow so I got this email and it came in from Lynn Cullins from Tampa\nAnd ... wrote and I I've retweeted his wife took the email and actually ... this out\nAnd buy ... listener email regarding Cavanaugh circus\nLittle rights hey Todd when Dr. Ford lecture tour college students in her psychology classes did she talk like a baby wish one of her students would calling ... show and respond to this question\nAgain from Tampa that limb with his even fair question I'm I like to know\nDid she presents herself but she talking that same type of uh correctly vocal fry a small child voice I'm just I think it's a very fair question\nAll you've got questions for me you can call you can tweet ... you can email simple as that as we make the observations of today and again the Republicans just spoke a little while ago I\nMade a couple of notes here on that just apply for of observations on how we've gotten too right now and free sixteen eastern time here on a Thursday so let me go down a couple of notes here ... the vote tomorrow morning the cloture vote\nFor capital is looming\nThe senators as I mentioned are viewing this this FBI report the supplemental background check ... essentially\nAnd beginning ... N. A. M. this morning the first Republicans were able to view than the Democrats are nine and the Republicans have been very clear ... already that there's just nothing there there's nothing new there's nothing ... corroborating and remember\nDoctor for herself who provided these names of a P. J. Smith and mark judge and even her good friend this this ... Kaiser none of them are corroborate ... even the one that you would suggest this ... ...\nIs what Collins and of course college just relying on a lot of her staffers and\nAnd you know her other colleagues etc flake\nJeff Flake said we asked the FBI to investigate current credible allegations that's what they've done I plan to vote for him before but I certainly wanted the FBI the professionals to look at it and they have and I think they've been thorough\n[noise] ah so all you need you don't need the Democrats you don't meet Joe Manchin don't need Heidi Heitkamp Heidi Heitkamp told a TV station in Fargo North Dakota earlier today that she's an oval so mention is still on the side\nUh so if you get Collins and you get flake then it's a done deal or you don't even need Murkowski by the way Murkowski this just out in the last that thirty minutes or so from the Anchorage daily news and\nThey write the Murkowski told reporters that she did not yet know whether the FBI had been thorough enough that its investigation or spoken to enough witnesses asked whether she felt that she had been given enough time to consider the decision before voting this weekend Murkowski added\nI certainly hope so yes so that's what we're getting now from Murkowski but they don't need Murkowski flights Collins eight hundred eight zero one eighty nine Ninety nine more ... and your calls coming up [noise]\nYour consciousness live\nWe will be do you wait to see him ... radio\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith Rachel you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with ratio we really have you covered here are more reasons why you want to work with America's largest mortgage lender\nFor eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin right where he said in comparison to the records Rachel approval only about one thirty thirty approaches transactions call for confirmation conditions equal housing wonder licensing office he said and watch them or thirty thirty additional conditions are excluded may apply\nTraffic and whether hard radios nine Seventy doubt on your Web LA [noise]\nFrom the train traffic center powered by millions air on west bound for approaching highway five fifty seven ... he's still a slight delay wall units work a crash that is off the right side of the road we're also on the interstates south bound to Seventy five the offer after north ... Seventy five and Paul Maeder oh shut down the road work\nIf you're going to be a Bush boulevard and Florida Avenue there is a car doors and blocking the roadway that also east about rented boulevard block before Dover road with a collision speed foster news radio nine Seventy WFL way [noise] there has been a\nBit drier little less humid so as a result it feels a little cooler on friday reach for anything after a hot summer\nNinety two for a high in the afternoon warm afternoons plenty of sunshine rain chances pop about twenty percent afternoon evening hours they fall to ten percent chance later in the day on Saturday with loads of sun Ninety three for a high\nSeventy four degrees to start the day on Sunday Ninety two for a high with a twenty percent chance of late rain each wins ten nuts sees one or two a light choppy waters I knew generally cheapen relatives Steve derby for news radio nine Seventy WFL a [noise]\nAnd I'm Steve Rapaport a rare rally in a traditionally blue state\nBecause of that policy that Democrats are truly the party of crime because that's what happened\nWhat a\nPresident from firing up his base in Minnesota the president narrowly lost the state in twenty sixteen\nSupreme Court nominee Brett Kavanaugh admits he may have been too emotional during testimony last week cabin on the wall Street Journal op ed also saying he can be counted on to be an even keel judge Republican senators who have seen the supplemental FBI reports that there is no new information to corroborate sexual misconduct allegations made against Supreme Court nominee Brett Kavanaugh\nDemocrats however question scope of the FBI reporting minority leader Chuck Schumer says the results are not\nConclusive Fox's ... on on Capitol Hill Senate Republicans scheduling a procedural vote for Kavanaugh's confirmation tomorrow this is Fox News [noise]\nAnd save songs from the radio directly to your play list with a single tap available now in the heart radio ads in at heart radio dot com downloading open the aisle radio at and try it for free and of course use it to listen to nine Seventy WFL a anywhere\nRight across Tampa Bay\nToday's until you can find\nThe odd about hearing aids studios Ninety six seven FM Pashto went over to nine that Im south Tampa nine Seventy W. F. L. A. all over Tampa Bay\n[noise]\nHeavy fog here in just a minute have hungry they have zero one eighty nine Ninety nine of the nation wide number here on this if you're on hold and every single line is jammed here eight hundred eight zero one eighty nine Ninety nine is nationwide number will grab some calls momentarily [noise]\nThat where where does this actually and that does cabinet and get confirmed was at at this juncture right here right now it looks like Kavanaugh is confirmed but again\nWho knows in the world in which we live and how things turn on a dime sometimes you just you know but [laughter] as as I said here\nRight now yeah it looks like he's going to get by because it looks like flake is going to be a yes and that Susan Collins is going to be a yes and if that's the case you don't need Murkowski you don't need the Alaska senators vote you don't need a Heidi Heitkamp which by the way\nHer constituents are out there are not happy I you know last I saw a high camp was eight or nine points behind in the polling in her reelection race or Joe mansion and mentioned could be a yes\nOr red state uh Joe Manchin could be a yes he is pulling a hand I think last I saw on mansion he was I Want to say [noise]\nLet's see uh Heitkamp ten points behind so high camp about ten points wind up in North Dakota\nAnd it looks like a mansion is about eight or nine points ahead in West Virginia so it could be a good one democratic vote here it could be maybe just Joe mansion but again I don't need all if you have ... you have columns you got to cover [noise] ah oh\nMy wife said to me hey you know I heard your earlier this week and you were talking about this mark judge this Kavanaugh friends from years gone by who has become\nA central figure here this is a book that he wrote this wasted tales of Gen x drunk and the problems that he has had personally his demons of of alcoholism he also had some medical issues a cancer survivor of fighting cancer\nAnd I made a mention earlier in the week that this book that he published back in Nineteen Ninety seven is wasted tales of a teenage or are tales of a Gen x drunk and I said hey I went on to Amazon and see if the book was available and\nWhen I first picked on it earlier this week and I talked about it on the show in fact I think I opened the show and our one of what a Tuesday Monday This week\nAnd the book originally when I looked at it was a one thousand nine hundred Ninety nine dollars so Nineteen Ninety nine dollars was the price of the book and then by Showtime\nIt was down to Nineteen forty nine so it was whoa yeah big big huge fifty dollars savings I I just checked Amazon again and the book is now\nAt Eighteen forty nine so it's not a hundred dollars less than the last time we checked and it's one copy is still available from a private cellar on\nAmazon and in my ... my wife said to me hey I have you noticed that a a bunch of operations are doing a story on the the book available on Amazon a and a on E. bay\nAnd my wife said hey I heard you do that earlier in the week so my wife was give me a little pat on the back that she says I think you were the first to talk about the book on Amazon and now there are multiple stories on for multiple sources are also on E. bay\nThere is a copy there's an actual hard copy that is on E. bay now for three hundred dollars that are zero beards\nOr or the opening is three hundred and you can buy now for four hundred dollars\nAnd [noise]\nAh oh there are a bunch of PDF version so if you want to spend just nine bucks oh here's four bucks as well so if you want to read this this mark judge book where a there's a character named bart\nOh Kevin all\nIf you want to read it you can go to ... you can get the PDF or download version here's one for eight dollars Ninety nine cents here's one for four dollars Ninety nine cents oh here's a hardcover\nOh billions plan by the Democrats they want to take over the country and make it a communist state it all started back good or not but I'm going right and then they go through all these years\nAnd then we don't have any jobs and they had these people to keep the government is the Democrats right now they're paying people to attack our Republican senators\nAnd I don't want to have them ... total watched stills too because we can turn on them like they turned on us or not or not\nBy God they're going to get much of a job because the cook [noise]\nAnd so my question is what what's coming to them or you make threatened against Democrats\n[noise] it ... like the Boeing plant all which attack we're starting to reduce the shot or two in Denver God's or Joe the public [noise] get\nTo know what's going on and do well listen obviously you know with with the\nRand Paul and that that not a neighbor attacking him on the the lawnmower\nOr you know I I don't I don't know if that is essentially a indicative of the battles that are occurring between Democrats and Republicans these days I think that was the Rand Paul case was just a nut bag neighbor who's had trouble for a while now as far as Steve ...\nA and Republicans being targeted at that that baseball practice I mean clearly they were a target Republicans weren't target and I don't discount that at all I take that very seriously and yet there are certainly a liberal progressive that have targeted\nA Republicans I just don't know the Rand Paul thing I think it's beyond politics I I think they just had a personal issue Clifton thanks for the call let's go to Alan in New York City hello al you're on Schmidt welcome\nTo talk or I'm going to ... when I Do real quick yeah why people didn't give each time some places because maybe Kevin could buy them so and that's what they're doing so I'll hang up and wait for you in fact\nMy facts out so I mean ... years serving here is that by being general\nThat it was tougher for Kavanaugh to refute if they specifically had exact instances are dates that maybe it would be easier\nFor the judge to counter and refute those claims they got what you're saying oh we've got a a time for more calls eight hundred eight zero one eighty nine Ninety nine or ... you want to try to squeeze in folks it's eight hundred eight zero one\nEighty nine Ninety nine will ah go back to the ... lines and\nYou're listening to nine Seventy WFL a [noise]\n\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender\nToday's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith the rate shield you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part\nIf rates go down you get the lower rate with ratio we really have you covered here are more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row\nThey've also ranked is highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin rock and words date in comparison to obey the records Rachel approval only balance turned thirty or just turned ... information and conditions equal housing wonder licensing office he said and unless they were thirty thirty additional conditions ...\nIndividuals and businesses with tax problems listen carefully if you owe over ten thousand dollars in back taxes or I have\nAn file tax returns us tax she can help you take back control the IRS ... is your paycheck closure business and filed criminal charges our team of tax attorneys getting stuck elections and gets you protected us to actually offers a price protection guaranteed to get you protected today\nUs to act shield is a plus rated with the BBC socal eight hundred for six six Ninety six twenty five us to actually build eight hundred for sex acts Ninety six twenty five attention\nAll authors page publishing is looking for authors have you written a book and want to get it published page publishing we'll get your book into bookstores and for sale on line at Amazon apple I do in other outlets\nThey handle all aspects of the publishing process for you printing ... publicity copyright and editing go eat under advisor or one thirty six eighty nine now for your free author ... should get that seat hunger advisor or one thirty six eighty nine for your free author certainly should get again eight hundred buys zero one thirty six eighty nine\nThat's all\nFrom ... to be the case may be your next chance to win a thousand bond Marley am Nineteen Seventy WFL\nCouple saying hey I Smith on your comments on you wish there was more than one report will I Do I I Wish that in this ah this room is sensitive compartment information facility I Wish that there was you know multiple copies so that um the senators could see it\nA little more freely and a little more quickly because so many of the senators are claiming that\nAh that they might not even get to see it today because of the time slots to see the FBI supplemental report were being shoot up and yeah I mean I Wish there were multiple copies inside the skiff a\nAnd folks have said uh well those are the Senate rules and yeah I mean I I I\nI realize that the Senate there can be rules that were made but also rules can be change I'm just observing then it'd be a probably a little better\nWith a thousand page report if there was more than one copy not to leave the facility but to stay in the facility to double or triple or quadruple the number of senators that can view it\nAnd one given time especially since it's about a thousand pages long\nAnd I I guess there was an arrangement that goes back to two thousand nine between the judiciary chair\nPatrick Leahy\nAnd Obama that laid out some of these rules including the one copy but the Senate can also I'm sure moved to change that it just one of\nA expedited am allowed more to see the report quicker simple as that let's grab my how about Richard in Fort Worth Texas Richard you're on ... welcome to the program Hi\nYes sir thank you for taking my call you got one hundred percent right\nWhen she was questions by Democrats she was a professional educated woman when she returned all actually turn it to five year old kid you hit the ... and then when her attorneys would grab the microphone like she's going to say some ... wizardry you could tell was all staged and coach one hundred percent\n[noise] rent you thanks for the call Joe is in Lubbock, Texas Joe I've got a minute joke go\n[noise] ha ha ha\nOne hundred percent gray a ... a ... an American ... I'm trying to get all my ... Democrats the jump over the Republicans 'cause this fight uh from the Democrats against a a kind of an inch tall only backfired on them it's backfired I have not been voting for\nYou know it has prompted our top security officials here in the United states\nAnd I can even see the video in my head in the last six months or maybe last year of a top military officials being questioned on Capitol Hill asking will\nYou own a Z. T. E. or a hallway device in just down the line they all said nope nope nope no absolutely not\n[noise] and now we have a new company to add to the mix here by the way oh wow way or the team makes a cell phones and there was even a Porsche at some of the pie acts of some of the the the military exchanges\nWhere some of these phones are Huawei or Z. T. summers equipment is being sold there was a move to get those phones out of the bases\nOut of the exchanges so ah they were sold to military officers are enlisted a at the naval exchanges are military changed the PX is a a around the country and and or even overseas\nBut this story from Bloomberg is just really amazing and it has to do\nWith a mother board specialist called super micro and the details here are are really just riveting so the Bloomberg reports that this us based server mother board company called super micro\nWas apparently\nInfiltrated in China with some of these more so all of a U.S based these mother boards were being produced in China\nAnd you had governments by connected groups that was able to interject interfere infiltrate the manufacturing process of these mother boards\nAnd put a tiny little chip in to the circuit into the mother board I mean this is this it can't just do this overnight just had a a you know they had to be engineering here and ended ability to do this so they infiltrated the supply chain of super micro\nAnd the Chinese production facilities and this little Biddy chip was being put on to these ah these boards these mother boards for the service now the chip they said was the size of a grain of rice or a pencil tip\nAnd those mother boards ended up in servers here in the United states so with that the Bloomberg report says that the Chinese military spy agencies government they were able to have an access point\nIn two companies systems that have these servers and they were able to potentially steal intellectual property anything confidential\nI mean there's just shows the extent that the Chinese will go\nTo steal from us\nThey are decades ahead that's why they've advance so quickly or a technology wise military wise because they rip the world off\nThey didn't do it on their own they stole the Chinese government they are the haves and they have stolen I'm sure hundreds and hundreds of billions in intellectual property\nAnd this is just another example\nOf having a tiny little Biddy chip the size of a of a grain of rice or a pencil tip installed on these mother boards for servers and then being used in here in the United states and around the world and in major corporations\nWow a stealth doorway that would allow these China operatives to control these devices or have a back door to get whatever information they wanted\nSo once the program with these little chips once this was discovered our government we spied on the spies\nThat were behind the placement of the chips\nThat's how this thing and I started to unravel a the story also talks about the chips are were discovered and\nReported to our fans to the FBI by Amazon and this is also and then we'll we'll wrap it up and grab some calls you so Amazon Amazon dot com they're the ones that initially\nHad discovered that a whole bunch of their servers or compromise with these chips and the way this thing was found out this is incredible and ... and the reason why this is important is because Amazon it's not just ordering crap on line that shows up in a prime box and your doorstep in two days it's not just\nAmazon also provides\nA they have these data centers and they they supply a cloud computing storage for a major corporations for the federal government our agencies are using Amazon so Amazon discovered they had an Amazon figure it out and this is what also to me it's fascinating\nSo Amazon\nThey alerted the FBI why because\nAmazon was looking to acquire a streaming video company so Amazon with all of their uh expansion into streaming video\nThey were looking at a company called elemental technologies\nAs a possible acquisition because Amazon was expanding obviously it's streaming video services and Amazon Prime video et cetera so\nElemental national security contracts one of the main reason for the proposed accusation because of this nice fit Amazon's governmental business and just their their technology et cetera\nAnd you know the the the clown in the Amazon Services a and a ... in the ... says to help with due diligence or\nAmazon or eight dollars us which was overseeing the perspective acquisition hired a third party company to scrutinize elemental security\nAnd up elemental apparently\nThis elemental they're based in Portland, Oregon Oregon they\nHad some special software for impressing huge video files they help stream the Olympic Games online so that's part of on multiple levels why Amazon fault that acquiring this elemental might have been a very good fit so here's what happened\nWith due diligence on Amazon hired a third party to look at this elemental companies\nSo under we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked but you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about when I turned thirty year fixed rate loan scholar crossing conditioning condition Segal housing let her license and I'm thirty six and I'm less number three thirty visual conditioned art school just may play results made very not a solicitation for legal services if you owe the IRS back taxes payroll taxes for them not\nFiled you return the IRS will get you they can take your property take you to court even put you in jail with one call to wall\nYou'll never need to talk to the IRS again our average\nClients settles for about ten percent of what is owed we offer free face to face consultations in your local area call eight hundred Seventy seven zero for three three that's eight hundred Seventy seven zero for three three\n\nYears of traffic and whether hard radios dying Seventy WFL a [noise]\nWith aiming for the Florida central credit union free checking traffic center where we've got a couple of problems in the Brandon area causing delays first we shut down in the east bound direction a state road sixty approaching Dover road and his ability to work in an earlier accident ended the Bloomingdale area west bound Bloomingdale to shut down but then kings\nAvenue in Providence burst serious crash definitely want to keep those accidents in mind that is causing some slow down for folks in that area ... problems on two Seventy five but we do have high wind warnings on the\nSunshine skyway bridge I'm AJ Springer news radio nine Seventy WFL like\n[noise] there has been a bit\nDrier little less humid so as a result it feels a little cooler on friday reach for anything after a hot summer\nNinety two for a high in the afternoon warm afternoon plenty of sunshine rain chances pop about twenty percent afternoon evening hours they fall to ten percent chance later in the day on Saturday with loads of sun Ninety three for a high Seventy four degrees to start the day on Sunday Ninety two for a high with a twenty percent chance of late rain\nEast wins ten nuts sees one or two a light choppy waters I knew generally cheapen relatives Steve derby for news radio nine Seventy WFL a [noise]\nFox News I'm Carmen Robert words of support in the Senate for judge Brett Kavanaugh from Republican Senator Chuck Grassley\nThis person is very well qualified a person that believes in the principles of due process the presumption of innocence and readiness to serve are recognized\nBut that's not how retired Supreme Court Justice John Paul Stevens feels Stevens who previously supported capping off in the high court down says the nominees combative and political performance in the hearing changed his mind charges continue to pile up following the bus of a massive Philadelphia drug ring\nThe three top members of the infamous drug trafficking organization or now facing a whopping six hundred and eight nine charges it all fifty seven people have been arrested to date as part of the so called Alameda drug ring that allegedly dealt in heroin fence and all and cocaine success Tom grams this Fox News [noise]\nSt Petersburg from the auto bailout hearing aids studios Ninety six seven FM Pashto went up to nine ... nine Seventy telling you eh ballet all over Tampa Bay [noise]\nTo the polls Iran Smith eight hundred eight zero one eighty nine Ninety nine if you want to get in and we do a lot of calls in this a half hour to Iran Smith eight hundred eight zero one we had one drop off during the break\nDuring the bottom of the outbreak so on that ... can be squeezed in eight hundred eight zero one eighty nine\nNinety nine gets you to me here on that let's go to Alaska and Juno and al is on Schmidt Hi al welcome\nI thank you for having me a a a appreciate it my player I like to express my feelings about a leash or Murkowski that hopefully\nShe'll be voting for Brett Kavanaugh to go to the Supreme Court um there has been no corporation with a you know the this forego and all the other ... shoes or\nYou know hopefully she'll vote yes\nAll right well out as an Alaskan and of course your constituents of Senator Murkowski have you called her office either in the last in Alaska or the call her office in Washington DC to express your thoughts as in Alaska\nVoter that you want her to vote yes have you called her offices\nYes I have and the tragedy but ah there was no answer a my could get through anyway\nWhich office did you call you call her last officer did you call the Washington office\nI called the Washington DC office\nMaybe try calling her last office now\nYeah I'll I'll probably do that after I hang up but ah anyway I you know she's up for election year and a couple years\nYeah and less than I Would I Would stress for all of our listeners right now listening in Alaska\nOr out of Anchorage and I I was I visited the the facility and I I had lunch with a bunch of the sales folks as I was up in Alaska you know a couple of summers ago and I I stopped through Anchorage and I met the team of my local affiliate in Anchorage a great folks and uh I uh I\nI think it's it ... all the listeners all of those listening right now the log cabin all confirmed you need to call Murkowski's officers so try the Washington on it's all online just look up or Lisa Murkowski contact information a\nSenate offices you'll get you'll get her Alaska offices and you'll get the the number for a D.C office and call up tell them your constituent and they'll ask for some details some data and\nAh you know they'll ask probably for your name address and tell them you want Lisa Murkowski to vote yes on camera so I'll make sure you you call when you hang up with me okay\nI sure will I appreciate it and just a little more before I go back to falls you're just a little more background on Murkowski and this is where things get a little complicated because remember Murkowski was a write him she defeated the odds after she\nHad you know was primary and she lost you know then there was a write in campaign and Murkowski\nOne and a lot of that was at the hands of a lot of native Alaskans now\nI don't know if ... ever going to get to a yes\nHer native Alaskan and Native American constituents are not fans of Kavanaugh\nAnd many have been vocal about it you know the rates of of sexual violence against women are higher in Alaska than any other state in the country most of the victims are Native American and Alaska Native women\nNearly half experienced sexual violence a nearly one third experience rape or attempted rape\nAnd that's much much higher than the national averages so that's one problem now\nThose issues exist but it is unfair and here here's here's an asterisk here's the caviar it is unfair to apply this smeared job to Kavanaugh to the plight\nOf women in Alaska that are facing these problems so it is just grossly negligent it's just unfair to just glom onto this democratic smear campaign to absolutely shred the name of Kavanaugh and to apply it\nTwenty five years and anybody worth their thought would look at her and said she didn't want\n'em around what kind of an attorney are you what what do you practice\nI'm litigator uh so I Do a lot of jury work a\nLittle you study people you you do jury so like you do jury selection correct yeah and what is it more dire right\nYeah why deer whatever whatever they call it ... you know how to read people you get that vibe and you you as a civil litigator when you look at Dr Ford your thoughts immediately worse she's not credible not telling the truth\nI deeply deeply offend someone with sexual harassment insects discrimination in her path and I've overcome it\nAnd become a highly successful woman not because within a sexual abuse is very serious and if something does happen to you I Believe you have a personal responsibility\nTo tell someone that hold people accountable that's number one\nUm but you know she came forward and and she came forward in a way that\nIf it were me standing in front of ... in front of a group of people that I didn't know and that form and I had to disclose some of the things that happened to me that weren't nearly as bad as what she was ... were bad enough\nI Would have trouble speaking I Would it there were tears I'm I don't even know that I could have\nDone what she did so Maria it's it's run the gamut here you're a lawyer your professional you read people for a living what's amazing to me and I brought this point to the table numerous times in the in the last a week plus on this program or\nThe number of women that just don't believe these allegations it is it's Ninety nine to one or essentially the women the coldest show from all walks of life that just don't believe\nDr Ford Maria great coal thank you for checking in I appreciate you listening what sort of Beverly in Cleveland, Ohio Beverly you're on Schmidt welcome\nHi thanks for putting me on yeah I I too was a victim and I I don't believe I I think she was coached they coach try to talk like that too I there's nobody that can tell me that they didn't do that and you know frankly\nI've been thinking a lot about this with all this talking of people from the left you know they're talking people into our into airports in restaurants\nI like Mitch Mitch McConnell was stalked and he was a tormented you had Ted Cruz and his wife a restaurant in DC their meal was ruined go ahead\nYeah but not only that we got to remember there have been people who have died at the hands of it at least I Believe there at the hands of some of these people on the left and you know I could name Hillary I could name Obama I could name a few people\nHomeless in and it goes both ways I mean mostly it seems that it's the left attacking but you know you got Eric Rudolph and he targeted he was a conservative the targeted or the liberal side I mean but this day and age and certainly with the cabinet case it appears that the the stalking and\nThe victory all the threats of violence because of this cabinet case it's reached a new chemical it's it's totally out of control I think you're right Beverly thanks for the call back\nThe\nWake up for it to say Alexa set my alarm to play nine Seventy del Webb LA every day at six AM\nThanks for calling consolidated credit counseling services can I help you\nI sure hope so I mean that is a credit card bills yes I have to credit cards that are making minimum payments on and another that I'm behind on Iowa about five thousand dollars in interest rates have hanging between Eighteen and twenty two percent that rape it'll take like Twenty years to\nWhy Twenty years consolidated credit can do is work with your credit at Columbia payments and reduce or even eliminate your interest charge that he should be able to pay everything I can tell you for years what do I have to do ... get ready to celebrate your freedom from\nDown we're consolidated credit we're here to give you freedom from de Gaulle know where you're ... if I had known it was easy I Would have called years ago only\nDone written by bus to sixty seven [noise] let's see tempered by by sixty seven fifty eight hundred and five five to six to seven fifty\nReading on the surface of the other one was a much more than we are pretty much by the by the\nMiddle of the MIT organ damage there was the only one licensed by the corporation commission says number D.C thirty to what a day for tennis you ready to play is everything All right this site is pressure elect redeem knows that allergy congestion can get in a way of enjoying the moment go ahead and practice without\nMe celebrity helps you breakthrough congestion ... buys a non drowsy anti histamine plus a powerful decongestant for twenty four hours of congestion free\nAnd that that's the I for a quarter and a lot of elections you know on a national basis and it said that this could be the ... are deciding factor in some of these elections are as far as how the electric goes so this uh this poll county is one of the areas in Polk County I you'd recognize Lakeland\nIs a big area in Polk County you know winter haven\nYou know the old cypress gardens area and a lego land Florida locate listeners\nPolk man arrested for threatening to kill members of Congress if Kavanaugh knocking from nothing no no no you can't do this now I Want Kammen ought to get confirmed but I'm not gonna threatened to kill members of Congress\nIf they don't vote for him or if he's not going from nothing no no no no no no no no no no I hear the details we get the story from ABC action news which is the Tampa ABC\nChannel [noise] deputies\nHave arrested a winter haven man after he threatened to kill members of Congress and their families on Facebook if Brett Kavanaugh wasn't confirmed to the Supreme\nCourt [noise] James James James drip drip drip drip drip game kept ... not not not good James Patrick fifty three I might\nPoint out that is the exact same age as a judge Kavanaugh he's also fifty three James Patrick fifty three was arrested today Thursday by the Polk County sheriff's office after they received tips about his threatening posts\nOnline and uh [noise]\nA boy or James you you can't threatened to kill members of Congress and their families no no no no no no no no within five hours are receiving an email about the post our detectives investigated it\nObtain that arrest warrant and search warrant and took the suspect into custody without incident\nThat's according to the ... county sheriff Grady Judd he said people need to calm down and stop making threats of violence we will not tolerated\nAnyone who threatens to shoot or kill any public servant or law enforcement officer will go to jail immediately right on share of Grady Johnson\nI can not disagree with you I I have to whole heartedly\nAgree here along with threatening members of Congress Petra threatened to shoot any local or federal law enforcement officer that try to stop him\nAnd he made these threats apparently alongside a picture of a bullet on social media [noise] ah hello\nMr Patrick I'm not smart them is this guy\nOkay there's a need to check up from the neck up by did he think he can possibly make these public threats on social media and not have the cops come a call in\nThere's a pad for his numerous other threats along with pictures of guns on his Facebook he posted about selling his home in his car along with having someone look after his dogs so he can carry out his plan\nCharged with writing a threat to kill or injure according to the poll county sheriff's office\nPatrick's bell said and five a hundred thousand dollars according to the sheriff's office website I Would imagine that uh the Capitol Hill police or maybe even the secret service or whomever\nAre also probably going to be in contact with the pope can be for the sheriff's office or to enquire and maybe a question this individual I mean we'll see what was he was he was he really got to carry out these threats I mean it says here that he was\nHe was talking about selling his home in his car and\nHaving someone look look after his dog so he did kill members of Congress if Kavanaugh was rejected oh\nMy God and just say you know I you know grainy judge or you know the conservative a share of ah I'm sure ... is is for the cabinet confirmation but you can't threatened lawmakers I don't care what side of the aisle you're on you can't do it\nYou shouldn't go to jail for that ridiculous uh an MBA sell like an illegal behavior\nTo the phones oh\n[laughter] so [laughter] so wants to do you think he gets to keep his gun after this you know there might be some issues here but I I'm going to guess who's going to be locked up for a bit but yeah let's let's secure and I'm a I'm a Second Amendment guy but I can of a guy armed after he's you know making threats to kill people\nOver the cabinet confirmation to the phones grab John and see for New York Hello John you're on Schmidt\nThanks for having me on the phone but ah this is not what I'm my call before but I just want to mention what you said about this guy in Florida yeah what about Madonna blowing up the White House she gets a free pass [laughter] nothing happened to her\nI think Rosie Rosie O'Donnell make some also some crazy threats or what they get they get free passes but what I'm saying\nWell they should they should be investigated I listen to do I really think McDonald's going to blow up the White House or do I think that then Rosie o'donald idled however if you make a threat you ought to be investigated by law enforcement\nExactly but what I'm saying is I think the Halloween costume I think the guy in Frankenstein [laughter]\nOn that\nBut what I get that I think I'm the grace of God I Hope you get sick and I've watched everything she's a compulsive liar or a Dianne Feinstein lied about everything with her body language okay her colleagues behind huh the movements that they were making when the questions were asked was just so\nRidiculously guilty and um get get get to 'em or sexual acts well whatever happens I could tell you one thing I was about five years old\nAnd I was sexually molested okay I was about six years old\nAnd I could tell you the the two the person's name I could tell you the street that they walk down the and I could give you the destination I'm fifty five years old okay back then it didn't make a big deal I came back my mom saw the expression on my face and everything and she said what happened\nI told her what happened and my mom being you know strong willed did she went over and she can prompted them and drilled into him but nothing happened but what I'm getting as\nYou know she's talking thirty six years ago I'm Talking maybe more than thirty six years ago and I was about five six years old and like I said I Know the street I walked down I Know that you eat what did it\nAnd the other person that accused them about the punch she about the punch oh well not it was a punch bowl it was a container well what was it\nCalled again all all of these these stories have been back track you know from the accusations that the sweat ... it went from one that Brett Kavanaugh on his body they would fight the punch with one called ... and\nAnd and and whatever the heck and then it's all well don't know if he really spiked it but he was hanging around I mean give me a break hey John thanks for the call I appreciate it let's go to Jackson, Missouri and Joe you're next on Schmidt hello Joe\nHi Schmidt hey the blaze euphoric cost you just wouldn't work um everybody think your guards from ...\nWell yeah that's the there was that named going around that list and I know this is kind of a cheap shot I get it I ... and then a button there was a mean going around where people were comparing\nAnd they took a freeze frame of Dr Ford from the testimony and then they put her next to a guard at the Dana Carvin Wayne's World so\nYou know I I was just curious is my job to observe it's my job to opine talk about the world's events the nation's events pop culture and I'm just curious if the lousy for Halloween costumes going to be famous year\nI'd word a\nWord [laughter] that's for the call I appreciate it a sumo uh where do you want me to go next year or a let's go to Florida let's go to Janice in Port Charlotte Florida Janice you're on Schmidt welcome\nHigh ... thanks for taking my call first of all I Want to say how much I agree with the lady attorney that called everything she said was right at\nMy next point is why are we even talking about this when Keith Ellison has allegations against him and the Democrats are bringing that to the forefront my third point is how many of the left wing senators that R B rating\nKavanaugh have allegations of sexual abuse against them that the congressional slush fund has paid to these women to keep them quiet\nWell as soon as we have numerous fronts here even the president even Trump Pence said earlier in the week that was what was the one of the rallies and\nThe president had said that you know there are even some Democrats or there's a Democrat on the other side of the aisle who he knows things about who's a alluding to the fact is has certainly misbehaved and I was wondering if the president was ever going to bring that up I I think at the event he said that he'll save it for a book\nPanthers Saturday Night at six thirty nine Seventy valet\nLadies and gentlemen we take pride in presenting\n\nThis has come up on multiple occasions about this double standard him you know here's a story that the allegations very recent against a member of the United States House of representatives\nWho is a democratic candidate for attorney general in Minnesota [noise]\nTalking about Keith Ellison a versus an allegation from thirty six years ago where you can't get witnesses to corroborate evil in their names were given the story it can't get straight a and then you have again the Keith Ellison case and the latest that I saw yesterday and I had to dig up\nThe story from the Minneapolis Star Tribune is that\nThe Minneapolis police are are not going to investigate yeah that says the DFL parties attempt to\n[noise] and this again this is a published or what time this was last night so this is published last night\nThe DFL party attempt to find a law enforcement agency willing to investigate the domestic abuse claim against us representative Keith Ellison was mired in uncertainty Wednesday after the Minneapolis police department said it would seek to refer the case to other jurisdictions\nA Allison's former girlfriend Karen Monaghan alleges that the Democratic candidate for attorney general in Minnesota tried to drag her off of bad during a fight in August of twenty sixteen Alison denies it [noise]\nI get a look look at what's going on I realized Supreme Court versus you know here zealous in leaving Congress wanting to\nBecome the attorney general for a Minnesota but which now I you know this has been like guys like news blackout on on this particular story line a lot of ground to cover ... final half our next\n\nTime and live every weekday afternoon from ... will be that when you went to see him ... radio\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith the rate shield you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with ratio that we really have you covered you're more reasons why you want to work with America's\nLargest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio another way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nIt's a rock and words date in comparison to all the data records ritual approval only about I'm thirty three year project transactions called the confirmation conditions equal housing wonder licensing office he said and I'm watching for thirty thirty additional conditions or lose his ...\nYears traffic and whether hard radios nine Seventy WFL a [noise]\nFrom the train tracks that are powered by Burgess heating and air well authorities continue to work the accident which is shut down the east bound lanes of state road sixty get strawberry rich boulevards that's right by Dover roads or want to be sure to use them extra caution age are moving through that area and expect some delays and we're still work in an accident on MLK a little bit west to fall convert wrote it watching road\nBut no delays on the Seventy five ... says you're moving across the Howard Franklin bridge in what you wrote the bridges cleared the downtown Tampa fall clear one Seventy five an eye for somebody just Springer news radio nine Seventy WFL lay there has been a bit\nDrier little less humid so as a result it feels a little cooler on friday reach for anything after a hot summer\nNinety two for a high in the afternoon warm afternoon plenty of sunshine rain chances pop about twenty percent afternoon evening hours they fall to ten percent chance later in the day on Saturday with loads of sun Ninety three for a high Seventy four degrees the start the day on Sunday Ninety two for a high with a twenty percent chance of late rain\nEast wins ten nuts sees one or two a light job bay waters news channel a cheap relatives Steve derby for news radio nine Seventy W. F. L. A. [noise]\nFox News I'm Carmen Robert\nPresident Trump expressing confident the Senate will confirm judge Brett Kavanaugh to the Supreme Court yet as the Senate prepares to vote Republicans and Democrats are far apart\nThere's no way anything we did would satisfy the Democrats\nMe [noise]\nIdea that there should be useful and sorrow and open\nIs once again be lie by the pettiness of are the Republican side and the White House Republican\nSenator Mitch McConnell and democratic Senator Chuck Schumer the confirmation may still hinge on three Republican senators Susan Collins Jeff Flake enlist Murkowski\nMoscow pushes back against new evidence from the U.S Senate western allies that Russian military spies engaged in hacking and disinformation operations and the Dow snapped a five day record winning streak dropping two hundred\nThe auto about hearing aids studios Ninety six seven FM Pascoal went over to nine ... nine Seventy\nW. F. LA all over Tampa Bay\n[noise]\nPlace called office AI Smith hears you might have been lights [laughter] as it stands now remember what I said [noise] a week ago\nMy what I said last friday [noise] remember a after we had the hearing this is a supplemental\nSpecial hearing with Dr Ford and judge Kavanaugh and Jeff Flake in committee Jeff Flake said I Will vote\nTo send the\nJudge Kavanaugh out of this committee voted yes however my full vote on the Senate\nFloor for confirmation will be held up until there's a one week FBI investigation street that's when I remember the story last week when the ... kind of scary that are there with a Chris Coons\nHis Democratic counterpart and many wanted to say oh gee their egos again he's closing up to the Democrats and I said you know what that is the easy [noise]\nTalk radio attack mode and I'm sure some of my fellow talk radio colleagues and well not really colleagues but just you know fellow ah individuals in the same type of work as far as me I'm sure that many attack Jeff Flake 'cause that's the easy\nLess educated thing to do is just going to attack him he's a ... that disgusting Jeff like he's not a concern about but what I said was you know what stop stop look listen here it looks like Jeff Flake\nAnd I sat in his last week I said there's a week ago folks I said flakes maneuver actually look at the bigger picture could be the saving grace so I flat out said that Jeff Flake might've just saved this Kavanaugh's nomination\nAnd it's looking at this point more and more like it did wasn't anywhere if there were no pause and FBI investigation this additional supplemental investigation\nCapital would have been toaster centrally\nBiggest flake would have been a no vote and uh Susan Collins would have been a no vote and Murkowski uh probably vote but it wouldn't have got it wouldn't have passed the ... he was probably done he was probably a garner and I said last week\nKay Jeff Flake you gotta look at the big picture folks Jeff Flake and I of course that were yelling at me that while you're talking about you got to attack Jeff Flake unbelievable what he did and as I was trained as well as I mean folks were yelling at least their view on on what you're talking about Bob blah blah blah blah blah blah and I'm like whoa wait a minute\nStep back if they don't have the votes they don't have the votes if the pause and this special supplemental investigation is going to give a no Jews\nTo our Collins to a\nA a flake in which no vote yes in the big Senate vote then how low it's a no freaking brainer\nSo up right here less and less so this is just out this afternoon\nFrom the Weekly Standard how Jeff flakes one way to lay helped clear Brett Kavanaugh's\nName so there's just published from the Weekly Standard says the same thing I've been saying\nWhen Arizona Republican Senator Jeff flake insisted on an additional one way to lay of the cabinet confirmation vote in order to allow the FBI to conduct the supplemental background check investigation into allegations of sexual assault many Republicans feel that it would accomplish nothing other than provide time for more people\nTo smear Kavanaugh with new false allegations and was and that certainly was a possibility but what\nOther play did you have this was the Hail Mary and I said folks\nThat flake could be the one to save Kavanaugh and ... this was the best possible shocked you want to just wall was me and play the martyr game and oh my God they're out to get an order you want to see capital confirmed or at least have the best possible damn shot a confirmation\nEver made up your mind on who to vote for based on a TV ad I never have\nNot I don't watch local TV that much but I Know that I Am not\nA good example of a cross section of the country a lot of people watch local TV and as such are inundated with political ads and we keep hearing that people are tired of them but they keep running them because of the political consultants believe that they work\nBut this is an area where I don't\nHave a lot in common with with the\nPeople in this regard and it it leads to being a constant frustration for me I Am never influenced by the money spent on the campaign particularly campaign ads it and that doesn't affect me I\nKnow who I'm going to vote for before I see an ad and there's not an ad in the world but it's going to make me change my mind\nBut I have to keep in mind how rare badly as most people watch local TV they can avoid all those ads and a lot of people are not\nImmersed than this stuff like I Am and maybe you too and so they are influenced by these ads I have to keep reminding myself\nThat these ads and the the spending of a voluminous amounts of money does matter\nI just I have a tough time I see how people who pay attention to things could even think about voting Democrat right now I I books I really mean it I think given what we've seen since Trump was elected\nA Democrat Party and the deep state deserve the biggest electoral landslide loss ever\nThis country needs to rise up and reject these people I Know their voters are not going to reject them but\nI don't believe that the majority I think these people need to be skunk their behavior\nJust in terms of decency common decency these people must not be rewarded for what they're doing destroying people destroying institutions destroying concepts in our\nRule of law I shudder to think of them being rewarded for this stuff\nYou know it used to be that you know the economy was great just by living through it but now you apparently have to be told that it's good\nYou have to be watching TV and then somebody on TV has to tell you the economy's good then you have to believe it well I remember a time where when the economy was roaring along and people were doing well did you didn't need to be told you know it\nBut now we got the Democratic party out there saying it's not a great economy tax cuts are ruining everything\n[noise] and some don't cost you believe this stuff\n[noise]\nYou you reject what you're living and believe what you're being told by people\n[noise]\nSo I just I Am I have yet to be influenced by a political ad now I realize I'm very firm in like infections and I know what I Believe but there's not an ad in the world is going to change my mind\nAbout a candidate one other thing I get along the lines of what are the Democrats going to do if Kavanaugh gets confirmed\nI told you they're going to double down and they're going to keep harassing and they're not going to stop trying to get rid of this guy I have just a little bit of anecdotal evidence to back it up I have a tweet here actually to\nPromote a woman who works at the nation she is adoption journalists no she was she does there but the nation as a over left\nMagazine her tweet her name is anti shields I'll go ahead and make her famous I Am starting a national at Democrats socialist working group\nThe followed Jeff Flake around do every restaurant cafe store et cetera he goes to for the rest of his life and yell at them you want to see the mob outside Susan Collins is office right now\nIn the in a set of building were offices and then the Emmy shields as next week if people like flake knew that they would get yelled at for the rest of their lives maybe they would act right\nShe sounds like everybody's first ex wife\nIf they knew they would get yelled at for the rest of their lives and maybe they would act right [noise] these people are going to get hounded [noise] I think they're going to happen no matter what they do if they're not Democrats they're going to get a how to no matter what they're doing man up back after this\nMakes it easy on Russia only I mean\nWhen you add ballet one or two point\nVeterans active duty military military spouses if you are in search of new home financing I Want to tell you about American finance things v a home loan it offers you exclusive access to some of the industry's most competitive mortgage rates and\nThere is no downpayment required no monthly mortgage insurance if you already are a homeowner would it be a home loan refinance\nYou can take out one hundred percent of your home value as cash it's money that could be spent on college tuition remodeling projects or your other priorities\nIt just takes a ten minute call to get started you'll work with salary base mortgage consultant so there's never any pressure just solutions that meet your financial goals\nYou could start saving today eight hundred seven nine five twelve that's eight hundred seven nine five twelve ten eight hundred seven nine five twelve ten or online at American financing dot net\nAmerican financing and in the last one to three three four WWW dot in MLS consumer access dot org\nAnd paying your taxes when in doubt my other half half of the hour nine Seventy got the last ...\nOkay one final reminder little special this weekend on many of the Rush Limbaugh show store Rush Limbaugh dot com by one item get fifty percent off another [noise]\nAlso the money Democrats are spending is being spent on people to go door to door to pretend to be neighbors and say we really like such and such you got to join us there\nMay be spending more on that than they are TV a lot more on this next week to see them\nOn the radio I Seventy ... LA Times when you went to the two Clearwater\nRadio station [noise] good afternoon I'm\nDana males are top story at three another day of high drama on Capitol Hill as senators took a key procedural vote that started the count down to the final decision on Supreme Court nominee Brett Kavanaugh before the roll call began majority leader Mitch McConnell summed up the turmoil of the past two weeks\nThey famously row [noise]\nThat they oppose John trying nomination up acts\nTo the Supreme Court of the night and day\nA number of senators joined them re too and now they're up and says and but they were me to the punch by one of our colleagues who actually and now the up and says and the fourth and now I'm In the age the identity was even know [noise]\nSince that time we had seen special interest groups with their followers in to a friend say by spreading misrepresentation and our rights falls hood about\nJudge Kavanaugh's judicial record\nOver the top rhetoric\nAnd does Georgian up his record and testimony edits first airing produced short lived heads lives which also did by ... hours later continue to live on and the spread through social media\nInterest groups that ball so bad and unprecedented amount of dark money oppose thing this nomination [noise]\nOur Supreme Court confirmation process\nHas been steady climb for more than Thirty years one can only hold that\nCabinet or ... and it's where the process\nHas finally hit rock bottom\nAgainst this backdrop that it is that to each individual senator to the side\nWhat the constitution that advice and consent duty main informed by Alexander Hamilton federalist Seventy six [noise]\nI happen to her for ... says to me that the president has broad just scratching considerate nominees philosophy whereas my duty yet says senator is to focus on the nominees qualifications as long\nAs that nominees for law and the is within the mainstream of judicial by\n[noise] I have always opposed Lippmann has for judicial nominees with respect to their personal views or politics\nBut I fully expect them to be able to put a side any and all personal preferences in deciding the case the sec come before them\nI never considered the president the density for hard and wet enough value waiting Supreme Court nomination as the result\nI voted in favor of justices Roberts and Alito who were nominated by President Bush\nJust since the soda my or end its cage and who weren't nominated by President Obama and justice Gorsuch was nominated by President Trump [noise]\nSo I began my evaluation of judge Kavanaugh's nomination by reviewing hits twelve year record\nOn the DC circuit court of appeals including has more than three hundred opinions and his many speeches and law review article nice chain is turning\nIncluding lawyers from the non partisan congressional Research Service\nFreaks me many times each week and it says to me in the value waiting the judges extensive record\nI met with judge Kavanaugh for more than two hours in my uh 'cause I listen carefully to the testimony at the committee Harry I spoke with people who knew him personally such as ... civil rights\nAnd many out there and I talked to when judge cabinet or a second time by phones for another hour\nTo ask him very specific additional questions [noise] I also have met with thousands and to my constituents spoke the advocates and many opponents regarding judge Kavanaugh\nWind concern that I frequently heard what set the judge would be likely to a lemonade the Affordable care act's vital protections for people with preexisting conditions\nI just to grieve ... contention in just send in seven sky beholder judge Kavanaugh rejected that challenge to be a C a\nR narrow procedural grounds per serving the law in full\nMany experts have said that his dissent in foreign Justice Roberts' opinion up holding the A. C. A. at the Supreme Court [noise] furthermore judge Kavanaugh approach toward the doctrine\nOf separate belote is narrow wind up part of the statute is challenged on constitutional grounds he has argued for separating\nThe in Balad laws\nAs ... as possible while allowing the overall law to remain in Chad\nFits what's his approach and his says ten in the case that involved a challenge\nTo the structure of the consumer financial Protection Bureau in his since then jets cabinet I argued for quote severing any problematic portion wells and leaving the remainder\nIntact and quote given the current challenge is to be a TA proponents including my cell phone protections for people with preexisting conditions should want to adjust his who would take just this kind of approach\nAnother surge tend to that I heard often is that judge Kavanaugh cannot be trusted if the case then balding alleged wrongdoing by the president were to come before the court\nThe basis for defense argument seems to be two fold first judge Kavanaugh has written that he believes said Congress should enact legislation to protect presidents from criminal prosecution\nOr civil liability while in up\nTo ... I Believe opponents miss the mark on the issue [noise]\nThe fact that judge Kavanaugh I offered Vince legislative proposal suggests that the print he believes that the president does not have such protection current play\nSecond there are some who argued that given the current special counsel investigation\nPresident Trump should not even be allowed to nominate adjust to that argument ignores our recent history\nPresident Clinton in Nineteen Ninety three nominated Justice Ginsburg after the whitewater investigation was already underway and she was come first served Ninety six to three\nThat next year just three months after independent counsel Robert ... was named to lead the whitewater investigation President Clinton nominated justice briar he was confirmed\nCarpet stations along with Sean Hannity show network we are going to stay with the brew our first break a continuous coverage\nCourt justice since have not hesitated to rule against the president to if nominated them perhaps\nMost notably in the United states versus neck then three next send up point he who heard the case and joins the ... opinion against him\nJudge cabinet I had been unequivocal in his belief that no president it's above the law he is stated that ... first to Madison\nYoungstown failed versus Sawyer and the United states for the next ... arts three of the four greatest Supreme Court cases and the history\nWhy do they happen calm and each of them\nIs to caged where Congress served as the check on presidential power and I would note that the fourth case the judge Kavanaugh has pointed to as some of the greatest in history was brown versus the board of education [noise]\nVoted the same way in Ninety three percent of the cases that they heard together in the chief judge Garland joined him more than Ninety six\nPercent of the majority opinion authored by judge Kavanaugh dissenting only one [noise]\nDid fight at all then after we separate viewing judge Kavanaugh's record and listening to thirty two hours up his testimony\nSanta's sit by and consent role was thrown into a tailspin following the allegations of sexual assault by professor Christine ... for\nThe confirmation process now when the fall of the value of waiting\nWhether or not judge Kavanaugh committed sexual assault and lied about it to the Judiciary Committee [noise]\nSome argue that because since since a lifetime appointment to our highest court court the public interest requires that doubts the reef all to\nGet the nominees others see\nThe public interest as embodied in our long established tradition of a forwarding to those accused of misconduct\nA presumption of innocence in cases sandwich the facts are unclear they would argue that the question should be resolved in favor of the nominees\nMr President I understand both viewpoint this debate is complicated further by the fact that the Senate confirmation process is not a trial\nBut certain fundamental\nLegal print a poll about due process\nThe presumption of innocence and fair that do bear\nOn my thinking and I cannot abandon them in the value waiting any given his claim of\nMisconduct we will be ill served in the long run\nIf we a band and the ... in ... and fairness can thing though it may be we must always\nRemember that it is when passions are most in planes that fair and that is most in jeopardy\n[noise] lied\nAbout it to the Judiciary Committee [noise]\nSome argue that because since it's a lifetime appointment to our highest court court the public interest requires that ... the revolt began\nThe nominees others see\nThe public interest as embodied in our longest tablets tradition of a boarding to those accused of misconduct\nA presumption of innocence in case the sandwich the facts are unclear they would argue that the question should be resolved in favor of the nominees\nMr President I understand both viewpoint this debate it's complicated further by the fact that the Senate confirmation process it's not a trial\nBut third and final ...\nLegal principle of battle you press that\nThe presumption of innocence and fair and that do beer\nOn my thinking and I cannot abandon them ended up value waiting\nAny given his claim by best contact we will be ill served in the long run\nIf we banned in the ... in ... and they earn it tempting though it may be we must always\nRemember that it is when passions\nAre most in plain that fair and that is most in jeopardy [noise]\nThe ... Senate Bennett's since since relevant to the advice and consent function when she accusations her\nFrom a nominees otherwise exemplary record\nI worry that just hurting from this for lunch and could lead to a lack of public faith and the judiciary and with the huge flea damaging to the confirmation process moving forward [noise]\nSome of the allegations levied against judge cabinet illustrate why the per ... of the innocence to solve one\nPort and\nI Am thinking in particular not of the allegations raised by professor pork\nBut if the allegations that when he was a teenager judge Kavanaugh drugs multiple girls and use their week and they kept the satellites have gang re\nSpin out last ditch\nAlec cage was put forward without any credible supporting evidence and simply parachuted public statements of bother\nThat such an allegation can find his way into the Supreme Court confirmation proud says it's a stark reminder about why the PR some ... of innocence is so ingrained in our American\nConscious now Mr President I listen carefully to Christine ... seats for testimony before the Judiciary Committee I found her testimony to these sincere\nPainful and can ... I\nBelieve that she is a survivor of sexual assault and that fits trauma has up and did her life [noise] never at the lab\nThe poor when that she named could not corroborate\nAny up the advance some bad evening gathering where she says the is solved occur none of the individuals professor poured fads were at the party has\nRecollection at all of that night [noise]\nJudge cabinet sports fully denied the allegations under penalty of perjury mark\nJudge denied under penalty of felony that he had witness and the salt PJ Smith another person allegedly ate at\nDenied that he was fair\nUnder penalty of fell in the ... fad surfboards from lifelong friend liaison Kaiser indicated that under penalty of felony she does not remembered that party\nAnd ms Kaiser went further\nShe indicated that not only does she not remember and I like that but also that she's just not even know Brett Kavanaugh in addition to Alaska\nEvidence we also learned some facts have raised more questions for in some\nSense these allegations have become public professor Ford testify\nThat not a single person\nHas contacted her to say I was that the party that night [noise] furthermore the PR\nFaster testified that all those she does not remember how she got home that evening she knew that because of that discussion she would have needed or bright\nYet not a single person has come forward to say that they were the one who drove her home or wherever in the car with her than snow\nAnd professor Ford also indicated that even though he's less that small gathering of six or so people looked at ... am without saying goodbye and to try [noise]\nNone of them call during the next day or effort\nThat's why she left is she okay\nNot even her closest friends ms Kaiser [noise]\nMr President the constitution does not provide guidance on how we are supposed to evaluate these competing claims it leads to that because they're showing up to each senator\nVisits not a criminal trial and I do not believe that the claims such as these need to be prove beyond a reasonable doubt [noise]\nNever at the lab\nFairness would dictate that the claims at least should made a threshold of more likely than not as our standards\nGiving a heads up again to the affiliates are the Sean Hannity show network Susan Collins this historic speech from the center poor we will continue our coverage\nAnd cater to our views we can only expect\nOur differences to intensify\nThat's why the ... the draft or up our constitution who were\nAcutely aware that different values and interests\nCould prevent Americans from becoming and remaining of single people and the have the thick\nObjective they invoked in the preamble choose the constitution the one that they put for\nWhat the formation of a more perfect union [noise] their vision of a more perfect union does not exist today\nAnd if anything we appear to be moving farther away from that it is pre K. currently worries\nThat the Supreme Court the situation that most Americans see as the principle of guardian up our shared\nConstitutional heritage is viewed as part of the problem through a political\nMr President we've heard a lot of charges and counter charges a bad judge Kavanaugh but as those who have known him that\nHave a test that he has been\nAn exemplary public servants judge teacher cos husband\nJust by the turbulent bitter fight surrounding his nomination my fervent hope\nIs that Brett Kavanaugh will work\nTo less than that division in the Supreme Court so that we have far fewer five for just says and and so that the public confidence\nIn our judiciary and our highest court is to restart Mr President\nI Will vote to\nCome from judge Kavanaugh [noise]\nThey give it to ... [noise]\nI think one of the more amazing speeches and I I Am now it's actually interesting because I was a tomorrow I Begin my twenty third year on the Fox news channel\nAnd my Thirty years on radio that was one of the most thoughtful speeches I think I've ever heard and I'm frankly shocked I'm\nSusan Collins over the years was frustrated the living daylights out of me were opinion so I think what's bans out more than anything else\nIs the the students here ... how ... amount of gravity that she gave to her decision\nAnd her speech and the gravity of the moment and and the un bringing literally a sense of sanity\nTo what has become an absolute so she said circus around the country\nAnd systematically went over every single aspect of her decision making process from judge Kavanaugh his judicial temperament the questions that he's specifically answered are passionate about\nOf especially didn't I disagree with her on on roe v Wade but on the issue of constitutional precedence the role of advice and consent\nAnd the respect that she is showing the constitution the process and the whole process of a role of what it means\nJust to give advice and consent now with Susan Collins a yes and Jeff Flake saying he is a yes on Kavanaugh that now brings us to well Lisa Murkowski stimulate use ... know that brings those two fifty\nA what forty nine fifty one forty nine yeah so\nThat brings us to forty nine so really all comes down to I guess at this point Joe mansion\nAnd Lisa Murkowski and Lisa Murkowski appears to be a no and I guess mansion could be the yes is our math right on this who else is outstanding at this point 'cause everybody else I think is on record\nNo I've got to believe I think Joe Manchin and by the way I don't think it'll be a surprise he voted just two\nTwo and a to start the debate the thirty hours final vote a that'll happen mansion well here we go we just broke mentioned is voting yesterday confirmed judge capital the votes of their pores the\nDanes as that is supposed to walk his daughter down the aisle tomorrow in the middle of this vote I don't know how they're going to work that out somebody better lend them up a private plane has some kind of get them over\nThere [noise] um what I did mired I think the most about this speech\nIs the pressure under which Susan Collins has been\nThere is literally a main going on now and by the way Maine is not exactly one of the most expensive media markets but she talked in the beginning\nAt length about the\nProcess and what this has now become a and talk about it being a a gutter political campaign and millions of dollars and people in groups of people pledging to destroy her and to feed her an upcoming elections et cetera\nAnd hum wow this is pretty amazing\nI was just an amazing speech eight hundred nine four one showing us auto for telephone number Lindsey Graham is going to join us now at the bottom of the hour or I mentioned voting yes like voting yes and now Susan Collins voting yes which means the votes are there to confirmed judge Kavanaugh\nI Want to remind you if you have any sunspots over the summer I mean and flame patches aged ... sunspots well we've got the answer do you can't get it in any store course it comes from our great friends of trauma me I mean they're the ones that are created genuine sell to get rid of bags and puffing is under your eyes now they have their gender so sunspot correct her\nAnd by the way you could literally watch the sunspots disappear right before your eyes and it's guaranteed now if you purchase genuine sell to get rid of bags and pumping there's look to your best every morning\nWell they're going to give you a genuine sunspot correct or absolutely free sunspots will vanish before you rise guaranteed results or you get your money back no questions asked right Terry ingredients they a pet natural peptides plants them so they're a therapy January ... hundred skin five zero nine\nThey'll also give you their micro dome abrasion also free\nHi Michelle mocking here if you follow my work you know the one of the biggest outrageous I reported on was the trial of abortion doctor Kermit cause now\nI'll be woman goes into a clinic comes out there there's no police report\nI helped expose the crime the mainstream media tried to cover up\nWe had instructions directly from governor regions office not inspected worse\nWhen the producers of the gods numbers he came to me for help I jumped at the chance I personally donated to make sure this film got main God smell movie opens October you're well the main thing ...\nPerhaps the most ... American\nDean king and the entire cast was superb job bringing this powerful storing up good versus evil too they clean nothing that man did protect women\nOr children and you don't have to be a proactive as you might be worried movies too scary it's not the mother of two I promise you you can and should bring your teenage children bring friends and family do not want to pass something unique opportunity to change hearts and minds about abortion guts though rated PG\n[noise] news radio seventies ballet ... two Clearwater\nRadio station [noise] good afternoon\nI'm Dana meals our top story for as you have heard more high drama on Capitol Hill as Maine Republican Senator Susan Collins took to the Senate floor and just announced her decision on the confirmation of Brett Kavanaugh to the Supreme Court\nDespite the turbulent bitter fight surrounding his nomination\nOr Murkowski voting no in fact your decision on creating my person I'm ...\nI'm very very very very dear friend of mine very very dear friend of mine and I she did everything he crossed everything ... died she went to the same process we all did she come to a different conclusion I came to my ... and really this morning when I went to another hour and a half\n... allegation believe Dr ... I Believe Dr Ford something\nI don't believe facts show that it was a cat and all but I Believe something happened\nTo you or someone else who didn't know I think something happened to her I was there was no way no way all the ... what do you say to women who watched this process unfold her doctor for a story\nI have it on anything anyway even though they kept and the Senate if I've had people\nCome forward I mean just so that is the lead her trauma they want\nAnd I mean I Am sympathy\nAnd they are her life to have\nAdequate FBI investigation\nIn the cabinet and for the for me to be somewhat using it for the FBI was do you enjoy it I think there's always when I'm done I get I looked at me and I make\nA decision based on what you see that and that follow investigation but there it was for her that there was\nA lot of people that I was concerned about how they said what they say how they did it by many places Democratic Party for you after this I'm just a worse for us to do with what you're up for reelection a difficult race are you concerned debates\nAbout in this one\nMinute on Thursday you bother to provide the law\n[noise]\nAll right that is the uh [noise]\nWell that's the party of Nancy Pelosi if it's thirty two day she's the speaker of the house screaming in the background and all the protesting that we have seen in the party of Chuck Schumer and and\nNow we know party that is willing to put all due process aside fundamental core values constitutional protections like the presumption of innocence aside that will go along with the guilt by it\nAnd ... blasted the most egregious accusation that Kavanaugh had drug girls so they could be gang raped at high school parties\nThat's such an allegation\nCan find its way into the Supreme Court confirmation press has is a stark reminder about why the percentage of innocence is so ingrained in our American consciousness\nIn the end calling said that presumption and Kavanaugh's judicial record or the reason she will vote to confirm with Arizona's Jeff Flake and West Virginia Democrat Joe Manchin cannot appears to have the votes needed to sit on the high court [noise]\nFrom the photo central credit union free checking traffic center south on two Seventy five remains closed in South St peanut twenty eighth street south traffic is currently being diverted off the interstate therapists canceled traffic in the north bound direction so consider Nineteen for an alternative supported sponsored by maximum smart security life at Costco imagine getting HDTV off\nAll activity at your door from your smartphone that is what Maxwell smart security lights do plus much more talk life with visitors from anywhere better than a video doorbell and so easy to install get maximum security lights at your local Cosco page current news radio nine Seventy WFL a\nNews service of the ... Institute Clearwater police are asking for help to find the killer or killers of David ... won the elderly couple was found shot to death in their home on flushing avenue over the weekend\nPolice are asking anyone who saw something last Thursday or friday to come forward anything that seems suspicious and to check home security\nCEO to see if anything jumps out they say they believe the couple he was eighty eight she was eighty were targeted and they do not believe that the murders were random\nA poll county school bus drivers on paid administrative leave after a mix up that left a little boy in danger and his mother furious the driver dropped a six year old at the wrong bus stop on Tuesday without knowing what else to do the little boy stuck out his thumb and hitched a ride home\nThe district is apologizing with the boys mom wants some new protections put in place to keep mistakes like that from happening again [noise]\nOpposite scattered showers and storms into the evening and more comfortable Seventy four tonight and then just to ten percent rain chance tomorrow and back up into the low nineties Ninety One degrees now at your severe weather station our next update at five I'm Dana Milbank\n... one of those two nine that Im south Tampa nine Seventy W. F. LA all over Tampa Bay\n[noise]\nNa barking\nEvery day to remember the forgotten man Sean Hannity show\nIn addition to the laughter\nEvidence we also learned some facts have raised more questions for instance says these allegations have become public professor poured testified\nThat not a single person has contacted her\nTo say I would that parties that now and furthermore it that her pets have testified\nThat although he does not remember how she got home that evening she knew that peace has something just since she went if needed arrive yet not a single person has come forward to say that they were the ones\nWho drove her home or where in the car with her than nine and professor Ford also indicated that even though he's lab that small gathering of six to ... people up rats and without saying goodbye and to try nine of them\nCalled to the next day or ever to ask why she left is she okay not even her closest friends ms Kaiser\nMy birth and tall\nIs that Brett Kavanaugh will work\nLess than ... ... in the Supreme Court so that we had far fewer five or ... says and and so that public confidence in our judiciary and our highest\nCourt is reduced or Mr President\nI Will vote chicken for judge cabins\nAnd with that Susan Collins announcing I think one of the well I'm going to be honest I thought it was the most powerful speech\nIn recent memory on the Senate floor that I've ever seen it was Thoreau it was sober it was smart it was bought full it was comprehensive she went through everything from judicial temperament and philosophy\nTo her own belief system how she came to her decisions are constitutional view on the Supreme Court\nOn the role of advice and consent\nOn the madness and the circus that has broken out in this country and um I I have I I'm frankly we never run an entire commercial free our unless it's really important news\nAnd we did that for you to our beloved audience because it was something that I wanted everybody to hear\nThis is a moment in history what has happened\nIn the last Eighteen days camp continue to happen in this country you cannot bludgeon people without any corroborating evidence weighed judge Kavanaugh and his family have been bludgeoned you can have political differences and I've had my share with\nSenator Collins over the years\nWhere really realize today is I don't know her well she doesn't do a lot of television she's not somebody of interviewed a lot like the most impressive thing that I took away from this is the seriousness the intellect the\nThe systematic she walked every American through her decision making process and frankly it was ...\nIt was spectacular nothing shorter spectacular now I Know a lot of people are spending a lot of money then it's probably only going to get worse for her because she clearly followed her conscience on this issue and she had it ... it was\nObvious she missed nothing she followed every single solitary detail of this process did all the work you would ever want or expect from a representative\nAnd and now I guess the left is about as unhinged they've been I don't even think it's safe to walk the Senate halls at this point\nSenator Lindsey Graham of South Carolina I Would argue it would not have happened but for him\nAnd he joins us on our news maker line um you know you told me something when I was in Washington earlier this week\nAnd I asked us at ... well what are you know about Susan Collins and you'd you basically describe what I learned about her today I was blown away and I don't get blown away very often I really I'm too cynical I'm from New York I've been in radio Thirty years I'm a\nUm tell us about management mentioned it yes to\nWhat mansions ESL light Joe and um you know he was a yes but Susan was the center of the storm and I'll say something about like we've had our differences I Know the president said their differences but Jeff Flake also is that yes\nJeff Flake or is on the other side of a lot of things with Trump but he rose to the occasion and say listen\nI Want to hear more but I'm inclined to believe what I Believe\nI Want to hear from Dr Ford he listened to you also listen to ... and the process her and Susan ... and crazy is going to make Kevin ... a better nominee more legitimate nominee so I Want to thank him too but in the end of the day this is about\nA person a single person who is sort of the odd person out in politics\nRising to the ... and being that giant and to the extent I did my part thank you I wanted to stand up for a good man 'cause I've known him for Twenty years uh I wanted to let everybody in the country now have despicable and my eyes he was being treated and that they are had\nSenator here finest moment and all the way I was on your good\nGood and I don't know yet as we'll have more or ... or if I'm going to\nYou're going to join us on Hannity tonight will for reaction it looks like the boat take place to ... five a thank you Senator Lindsey Graham I wouldn't have happened without you in my humble opinion and you had I again I think you find this moment ever and uh and you've had other great moments as well [noise]\nUh eight hundred nine four one Sean toll free telephone number\nBut this process\nThis blood joining\nNeeds to and we'll talk about that and more and the election on the other side [noise]\nAnd I had to listen to AM Tampa Bay on your Amazon Echo Alexa nice of you to see\nAll right folks you and I both know that off year mid term elections are about one thing that you showing up now this election is the most important midterm election in our lifetime\nYour tax savings is on the ballot the American economy is on the ballot your jobs are on the ballot and your kid's futures\nAnd their jobs on the ballot or wages for one cage all of this is on the ballot and if you're a small business owner well your tax cuts are on the ballot also and here's the biggest political issue on the ballot who's in charge of America's future if you want to preserve the victories in the past two years\nI urge you right now to get involved this November go to this website tax cuts work dot com\nYou can make calls you can send emails and tax to knock on doors and of course take a neighbor to the polls go to tax cuts work dot com because the only way we're losing twenty Eighteen is if we don't show up tax cuts work dot com do your part let's not get out worked in November tax cuts work dot com check them out now\n\nElection ... I'm an shown mansion yes on Kavanaugh Susan Collins a yes Jeff Flake a yes\nWe haven't got a definitive know yet as it relates to work if you want it looks like now for judge capital of the vote tomorrow well the latest details more coming up short ... [noise] [noise]\n\nHi Michelle I'm often hear one of the biggest outrageous I reported on was the trial of abortion doctor Kermit cause now I'll be woman goes into a recording comes out that there's no police report I helped expose crimes the mainstream media tried to cover up we had instructions not respect abortion because no movie opens October twelfth it's amazing\n... was perhaps the most prolific surreal to American bring\nFriends and family you do not want to pass up the unique opportunity to change hearts and minds about abortion drugs though really PG Thirteen\nYour brain is an amazing thing but as you get older it naturally begins to change causing a lack of sharpness or even trouble with recall thankfully the breakthrough in private and helps your brain and actually improve memory the secret is an ingredient originally discovered in jellyfish\nIn clinical trials ... has been shown to improve short term memory coverage and healthier brain better life and now of animal in stores everywhere\nStatements have not been evaluated by the FDA this product is not intended to treat shore or prevent any goodbyes are\nNews radio nine seven that when you have family or you ... to clear water you two seven five easy Wesley Chappelle's Show\nDo you do for being branded\nGood afternoon I'm Dana males are top story at five [noise]\nGood afternoon I'm Dana males are top story at five thirty in a speech being hailed by her fellow Republicans and the White House Maine Senator Susan Collins took to the Senate floor today and offered a compelling and comprehensive defensive Supreme Court nominee Brett Kavanaugh she cried when she called the circus that has unfolded over the last two weeks\nOur step praying Court confirmation process\nHas been steady decline for more than Thirty Years' war I can only hope that the cabin a non ... and it's where the press that had finally hit rock bottom\nCollins went on to detail and defend Kevin us judicial record and said she hoped all the emotions in anger surrounding his nomination can bring much needed reforms to the nominating process and the way sexual assault victims are treated\nSo with Collins Jeff Flake and Democrat Joe Manchin on board it appears Kavanaugh has the fifty one votes needed for confirmation tomorrow [noise]\nFrom the Florida central partying in a free checking traffic center taken a look at south on two Seventy\nFive at twenty eighth street south that looks like\nOne lane is able to get by on the far right area it's still backed up through the stretch than you might want to use us Nineteen is an alternate north down as a solid ride to through here is supportive sponsored by Hillsborough County public works plastic bags plastic wrapping hoses don't belonging\nRecycling he's tankers damage sorting machines at her recycling efforts throughout Tampa Bay rays your plastic bags return them to the store\nI'm In the trash learn more about keeping your recycling tank where Fran hit they recycle dot or hatred career and nice radio nine Seventy WFL legs\nThe traffic problems called the injury from Abraham Senate your which rather to blind Hillsborough eight six six five four or five Ninety five Ninety five\nNews at the surface of the ... Institute Clearwater police say they believe whoever shot an elderly couple in their home went there with the intention to kill and then it was not a random crime eighty eight year old David swan and his eighty year old life Nina were found dead over the weekend at least ask anyone who saw anything suspicious to contact them\nA path Cook County man it's been arrested for stealing his neighbors electricity thirty eight year old David Smith of Newport Ritchie told deputy she didn't think they would mind because they're both US Marines he's been charged with burglary and the September jobless rate they'll do three point seven percent the lowest it's been in almost fifty years\nPartly cloudy a little more comfortable with the low Seventy four tonight but hot again tomorrow just to ten percent rain chance and a high of Ninety to Ninety degrees now at your severe weather station news radio nine Seventy WFL like our next up day coming up at six ...\nFrom the auto bailout hearing aids studio somebody six jeopardy up ambassador went over to nine ... nine Seventy W. F. ballet all over Tampa Bay\n[noise]\nDriving liberals crazy [noise] three hours a day every day the Sean Hannity show is back on the air by three hours a day or\nWe asked one hour a night what is four hours a day among friends thirty two days away from the single most important mid term election in our lifetime so much hanging in the balance what a week the ... and we'll be Coleman aiding hopefully with the boat or justice Kavanaugh but the U.S Supreme\nCourt orders America has been a reward these tactics anyway before we get to that bind to put your party light on our friday Florida Georgia Line background concerts theories what ...\n...\n... was\nBell jar bottom bottom Bloch Bauer\nMood um read or re boom\nA man\nNamed ... where the party that\nHang around\nDon't we know and I\nKnow we\nThan that\nMy own everything\nWe\nAnd the wind the K ... only bring a right to know man all broken hearted\nDay I'd be alone\nBeing the\nOf the ...\nThe only\nAdd a little bit of Jake and Dr\nJobs\nThe radio a\nYour\nNow at the bank bin Laden and\nMeans I got\nDown down", "year": "2018", "show_name": "The Sean Hannity Show", "city": "Tampa", "day": "05"}