{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nBy you and Greenfield savings bank with offices throughout Franklin and half your counties including their new Hadley location across from town hall on line at Greenfield savings dot com\nWeak on American Idol some more or less you know in American music from the west coast Mexican American rockers most Lobos to the east coast now some of us are ... Spanish Harlem\nWas a performance by San Antonio's queen of good will do a forty in every bar I mixed pitcher joined me for American route VR in\nAmerican roots tomorrow afternoon or evening at six year round New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst added and E. P. R. dot net jazz safari embark snacks with Jerry and Jerry good evening at eight o'clock [noise]\n\n\n\n\nStreaming up the ... public radio was funded by you had Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gene CVS dot org na\nNa\n\n\n\n\n\n\n\nNa\n\nNa\n\n\n\n\n\n\nStreaming of New England public radio was funded by un cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\nDown\n\n\n\n\n\nStreaming of New England public radio was funded by un cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [laughter]\nThe music of Duke Ellington I Want to use all that's Carol ... spoke formed by ... and ... ghetto Jared Gonzales I've taken from Nineteen eighty two recording called ... could featuring the likes of money or that are on the tennis saxophone Steve to round trombone\nMore than ... eleven hundred listeners joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime they making a contribution at our website any P. R. dot net thank you very much\nOn this secession Jerry died earlier this week in Madrid, Spain where he had been living there since the early to thousands [noise] he was a just sixty nine years of age he died\nNa na\nMhm mhm Mm mhm mhm and\nHe\nNew ... mhm\nStreaming of New England public radio was funded by you and cute little architect or forty year legacy of commitment to community I design celebrating the next generation of leadership a cute little dot com that is\nBig\n\n\n\nBang bang\nAnd is not as not shy young young\nThe the letters ease the loans I did did he have\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nWhat does that then some of them lose\nWhen you know\nThen then you the most ... don't last long jump budget he gives me some young young\nThat's Duke Ellington additives orchestra along with the ivy ... singing jumping for joy recorded in July of Nineteen forty one\nAnd concluding a set of four selections from the Nineteen forty I'm forty one\nOr the band that was known as the plant in ... band a name for Jimmy ... on bass and Ben Webster on the tenor saxophone their presidents are so powerful that uh uh the uh the Ellington orchestra was nicknamed well\nYeah even more so as the blackout in ... during this era as we celebrate the one hundred but the anniversary of the basis to Jimmy Blanton yesterday we heard before jumping for joy a song that incidentally also featured up\nStreaming of New England public radio is funded by you and cute little architects or forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\nReview of that um that Ellington composed music for we heard CPS panorama from July of Nineteen forty before that\nAnd from May of that year we heard a performance of ... tribute to bill Robinson and you begin Jimmy Blanton and Duke Ellington together performing bitter panther pat from the first of October Nineteen forty\nJimmy ... was a widow Ellington orchestra for just two years from Nineteen thirty nine too late to Nineteen forty one he left the band because of a poor healthy ah suffered from tuberculosis and he was to die from that a disease in July of Nineteen forty two he was just twenty three years of age\nBut so profound was his influence on the orchestra as I mentioned it became to be known as the Blanton ... banned\nDuring that time\nA Jimmy Blanton who is one hundred but the anniversary was observed yesterday\n[noise] if you're just joining us welcome and bought a jazz safari for this Saturday evening on ... and I'm so happy to have you on board as we traveled through the jazz world and beyond until eleven o'clock it's a journey funded has always by you thank you so much\nBy ... Center for the performing arts in stores presenting ... with the counter ten an aunt in Iraq because down so uh this coming Wednesday October tenth at seven thirty\nAnd by Deerfield Academy proudly supporting New England public radio devil U ... U. N. N. Z. Deerfield dot edu\n[noise] we have a music from up it's the other us shall we say celebrating birthday birthdays embraced anniversaries of Sammy Price\nAnd guitarist mark wood field\nOr send me price who has left us it's a today marks is one hundred tenth birthday anniversary it's the fifty second but the of the towers to mock would field we have music by them\nComing up and just a moment we end also music from Madeleine payroll she is performing this coming Tuesday at the\nStreaming of New England public radio is funded by un bay path university graduate schools MS and applied data ... enrolling for October twenty second applications at bay paths dot edu\nAlso ahead music from calypso rose and burning sphere and shadow too shall we say commemorate Columbus Day\nWeekend or indigenous people's day\nThat's coming up a little later on also means that from the great afro beat drummer Tony Alan and much much more coming away so please stay on board won't you as we continue\nA speaking of ... also mentioned a more from the trumpeter income ghetto Jeremy Gonzales who died earlier this week on Monday or in Spain as a result of a fire in his home\nUnfortunately had smoke inhalation and went into cardiac arrest according to a [noise] a sources in Madrid where he had been living a since early two thousand we have music by him coming up we also heard of the passing\n[noise] yeah\n\n\nAnd\nMm Mm\nStreaming of New England public radio is funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences psychology a C. dot edu and\nDay and bang\nBang bang bang bang bang\n\n...\nAnd ...\nUncle\nAnd\n\nAnd [noise]\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences psychology a ice sheet dot edu\n... on the\nBe more than\nAnd ... and and\nAnd and ... and ...\nAnd and and and\nAnd\nAnd and ...\nAnd ...\nNa\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ...\n\n\n\nMm\n\n[noise]\n[noise] that's the baritone sax ... blew it\nWith a song called hang in there composed by Ted Dunbar who's had their on guitar with Clinton eastern on base and Ben Riley after drawn this recorded in October of Nineteen Ninety to a section called sent Cofer reared God\nBy hand me a blue it and uh before that we heard\nWonderful performance in that same year with a ... joining the well saxophone quartets along with ... bass singing and suffering\nWith the blues ... head of the piano as well with Donald Smith at the Oregon and yet on the baritone saxophone solo dad joining the will saxophone quartet with the likes of all of the lake and author of life and on the outs\nStreaming of New England public radio was funded by Ewan Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nAnd recording of the world by the world's saxophone quartet of night train Jimmy forests classic [noise] fun on a section called rhythm and blues with the late Julius ... feet to the on Alto along with\nDavid Murray and and\nAs well how many blew it on the baritone saxophone Oliver Lake also on Alto sax the session called rhythm and blues by the wolf saxophone quartets are we heard of the passing of hand me a blue eyes to this past Thursday he was a he was Seventy eight years of age\nOne of the uh one of the founders of the world's saxophone court tacked my soul rest in peace [noise]\nAs we are also feature music from Trump at the end ... ghetto Jerry Gonzales who also died this past week he was sixty nine years of age he died as a result of a house fire at his home in Madrid is suffering from smoke inhalation and apparently cause a heart attack\nWe have means from him as well as from a Madeleine pay rule Sammy Price Coney Island and burning spear [noise]\nAnd speaking of Madeleine payroll she is coming to the area a performing well she is performed tonight in Hartford she's coming to the Academy of music in Northampton this coming Tuesday night show sponsored co sponsored by New England public radio\nThat's Tiffany Austin singing on now\nStreaming of New England public radio is funded by un bay path university graduate schools MS and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\n[noise] almost a spaced out there it's taken from her recording unbroken\nAnd it's on a recording called called alma records we also heard that wind chase on before that with the bossa nova Scotia interesting title of from his record in court tests the vibrio ...\nWho is appealing this coming Tuesday night with the green street trio at the city's sports where that's at the spare time moaning lean in Manhattan starting at seven thirty part of the Northampton jazz workshop series orange Jason\nI'm ... and we're on a jazz safari on you England Public radio WFCR in Amherst to Springfield heart fit in partnership with the UMass Amherst and it N. E. P. R. dot net\nKathy from ... Connecticut call to support New England public radio because she appreciates the balanced a points of view and the Cecilia from North Hampton said grass yes when she went to our website to make a contribution\nAnd she feels fortunate to have a ... on the air so she wanted to support it and you can hear it every Sunday evening beginning at eight o'clock\nThanks to all those whatever you'll reason thank you so much for supporting stepping up during New England public radio is false fund drive which concluded yesterday we could not do it without you and your generosity if you still haven't made\nA contribution to an A. P. R. and you're procrastinating while here a little late but you can still go on line T. N. E. P. R. dot net and support your public radio station that brings you to earlier and jazz\nSafari and all that jazz and classical and news programming each and every day again thank you a scientist on as we have more music to celebrate this evening this Saturday nights on you England Public radio\nWith the\nAhead from Madeleine pay rude she is coming to the Academy of music in North Hampton this coming Tuesday also music from burning sphere and Tony Alan and more from lake trumpet the ankle and get it\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at a vet spaces from board room to ballroom with a the equipment and the house catering hotel north Hampton dot com\nThe pianist and sing John ...\nWho is for those that don't know is the leader of the ensemble steak human that the musical director for\nA the Late Show with Stephen cold there he has a brand new recording called Hollywood African next checkup ... don't stop on your way Clint public radio\nDang ain't no guarantee\nThis key was shaking while we can\nWinning near to clone a tiny\n\nNa\nStreaming of New England public radio was funded by you June ... architects a forty year legacy of combat but to community design celebrating the next generation of leadership a cute little dot com Mm\nIs rain had lemonade things you\nLove is for the day came\nNa\nNa na\nNa\n\nDon't know\n\n[noise]\n... the ... the new to me\nI'm with the new technology\nWhen I get in the mall and mom brought\nFor them in the end but it ended I mean when you\nIs going to get his ...\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall gee CVS dot org\nI'm not sure how can they\nYou know the last days ... and clay more\nFor alleged planners\n...\nAnd do Roman name\nLay give me a mole it and I go\nAnd\n\nI win a violation employment\nShy\nHigh wind banish over time\nMe but they get to work this time\nWe need I go on a day of love and ... and we need every now\nAnd\nCame here to\nGet a\nLot of time with her husband last time I thought it was\nEducating and\nPaying much\nMuch time but I\nKnow\nTo\n\nMethod to contend\nDreaming of New England public radio was funded by June ... architects of the year legacy of combat but to community design celebrating the next generation of leadership a cute little dog call\n\nIt was very very hard\nYour ... your ...\nScanners and going to be able to\nAnd\nDamaged [laughter]\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\nAnd again when\nDone [laughter]\nNot [laughter]\n\nThey're a little\nThan that [laughter]\nYou don't\nWant to marry [laughter]\n\nAnd he\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\n[noise]\n\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AS each certifying technicians Massachusetts state inspections she keeps garage dot com\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n[noise]\n\nSki doo doo doo doo doo doo doo\nIndependent written\nInto the\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n[noise] and\n\nStreaming of New England public radio was funded by un cute little architect oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see ... D\nAnd\n\nAnd and and\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology hey I see ... D\n\n\n\nFrom the legendary afro be drama Tony Allen with push and pull it's taken from east recording the source\nConcluding this extended set of music that traveled from Spain to the Caribbean to mother Africa he on New England public radio we heard before that I should have gone out of her go deep why would I mean not that Latino we heard\nAbout keeping the bed with the phone call\nStreaming of New England public radio is funded by you and cute little architects or forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\nAs meets the classics and we started off the set with Jerry Gonzales and the low speed at that data flamenco performing obsessed show\nThis taken from a recording I'm Ruth made in Spain and featuring Diego as he got on the vocals alongside Jerry on the trumpet and on Congress [noise]\nJerry Gonzales one of the great innovators of Latin jazz died early this week on Monday at the age of sixty nine from a cardiac arrest caused by smoke inhalation from a fire at his home in Madrid\nAnd getting back to ... or did he better he is going to be headlining this year's north Hampton jazz festival two weeks from tonight that Saturday the twentieth of October ... performing at the Academy of music in North Hampton\nI'm ... and there's more music from other Africa and beyond as I jak safari continues on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst at N. E. P. R. dot net\nWeak on American roots of similar you know in American music from the west coast Mexican American rockers most local to the east coast south of author Mendez Spanish Harlem workers was the performance for San Antonio's queen of what's over forty in every bar\n... joined me for American Ruth ... [noise] American roots\nCome joy tomorrow evening at six it is followed that age ... to deal with the host ... presenting great music from Latin America and this region and that's followed that ten by Latino USA\nThat is part of our we can line up all supported by your generous contributions thank you for supporting you went to public radio joined I'd just concluded fall fund drive\nYou or the fuel that powers\nNew England public radio so scientists on again thank you very much [noise]\nOr some other events that led to tell you about coming up tomorrow include the final day of celebrate Holyoke featuring music from a bomb but a key he's from Brazil\nStreaming of New England public radio is funded by you and cute little architects or forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nAnd the big bad ball is all part of a celebrate Holyoke at the heritage state park\nFrom noon until nine Michael ... spearhead a perform at the paramount theatre in Rockland Vermont tomorrow evening guitarist Joe Montana has experienced before um and hawks and read was special guest some evidence starting at six\nAnd the T's jazz project featuring pianos Christopher back urges and violinist ... Brock\nAlong with Peter ... on ... and ... providing narration ... for music inspired by the jazz art of all the Matisse at the ... in Middletown tomorrow evening at six\nOn Monday Night Albert ... brings his quintet his quartet rather to blackout ... in Hartford and on Thursday the messenger legacy bad or at scale is Jessica in Boston and then friday and Saturday there will be at the side door in old line Connecticut\nAnd also on friday Veronica swift perform as as part of the books ... pardon me these Pittsfield city jazz festival along with the books are jazz all start trio at the legion hall in Pittsfield\nAlso on a friday Christian McBride and his new John quartet or at the Vermont jak center in ...\nAnd then on Saturday they'll be in Pittsfield at the colonial theater along with the book should jazz youth ensemble opening up for them and also on Saturday how Melvin blue notes our city stage in Springfield\nYou can find links to these and other events so many to mention that over the next few weeks on our justify calendar that is that the jazz safari page at N. E. P. R. dot net where you can also check out\nThe best a valley voices story slam next Saturday at the Academy of music in North Hampton joined New England public radio and twelve of the best\nTell us from a story slam series sharing their truth tales you can crowned the winner with the biggest in the biggest slam of the year we're expecting this\nStreaming of New England public radio is made possible by you and by sea keys garage in Williamsburg offering foreign and domestic ... AS Easter defined technicians Massachusetts state inspections seek he's garage dot com\nHad from burning spirit and Sammy Price calypso role is that in the English Beat la performing next Thursday in Holyoke\nLet's continue with the guitarist mark which field who celebrates it but it today turned fifty two\nFrom us they call a seventh avenue stroll with it too on samples say clothing atomic Flanagan at the piano Dave Holland on base and our foster on the jobs here to mark performing Harlem knocked on you England Public radio Mm ...\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\nAll right that's music from Sammy Price sent his rock band featuring a king Curtis on the saxophone and Mickey Baker on the guitar with after our swing this recorded back in Nineteen fifty fifty six fifty seven\n\nA taken from a recording Cal ... joint roots of rock and roll Sammy Price with the king Curtis yes Mickey Baker otherwise well he's a saint Mickey Baker that went on to create that wonderful song with a cell vehicle with Mickey I'm Sylvia and love a strange\nA double dose of Sammy Price we heard before that he's the west and buggy [noise] from Nineteen Seventy five date in Paris that feature doc cheat among trumpet around with a gene ... trombone and a tad ... I'm a saxophone called ...\nMore than ... eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\nI mean price one of the more underrated stars of\nJazz piano in boogie woogie and rhythm and blues from Nineteen thirties forties fifties and through actually until the late eighties had to be a fortunate distinction of being able to see him in concert at UMass back in the day\nWhat a wonderful and powerful pianist Sammy Price who's one hundred attempt but the anniversary is observed today\nHe left us a back in April of Nineteen Ninety two\nWe started off the separate guitars to mark which field and company ... market celebrating his fifty second birthday today we heard all of knocked turn with autonomy Flanagan Dave Holland and our foster accompany him on this session cold seventh avenue stroll\nIs that jazz safari continues with the music ahead from the likes of English beach who are coming to the area they're performing Thursday at the gate which city hearts in Holyoke\nBut on this holiday weekend some of us are celebrating Columbus weekend some of us celebrating indigenous peoples weekend well\nHere's a rather interesting take on Christopher Columbus from the likes of burning ... and uh let's see calypso rows and coming your way next from an ensemble called Kelly conscious on you England Public radio\n\nOn them even name oh come on and he charged that\nThe first time just to\nDreaming of New England public radio was funded by you ed Greenfield commonwealth virtual school public online cage which will school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\nDing da ding da ding da ding da\nYou so yeah\nThey're not my\n\nDa\n\n\n\nStreaming of New England public radio was funded by you and they have university graduate schools and asset applied laboratory science at operations that rolling no for August twenty seven applications that they pass dot edu\n\nKnow [noise] [noise] [noise]\n[noise] the\nMain\n\n\n\nThing that\nHe\nDid\n\nIf\nI didn't I didn't\nMind if\nRead\nIn the evening\n\n[noise] [noise] [noise]\n\nThe\nDrain yeah he's a\nGreat\nGuy\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writer enrolling no for August twenty seven applications that they pass dot edu\nDon't bother\nMe\nIn ...\nI didn't\nStreaming in New England Public radio was funded by you and valleys solar a local company install like Ruth ground amounts and do all access trackers helping household live carbon free and the poor one three valleys solar dot solar\nTo be\nDreaming of New England public radio it's been possible lung you and by the keys garage in Williamsburg offering foreign and domestic ... s e certifying technicians Massachusetts state inspections seek he's garage dot com her\nWins didn't Bailey better known as shadow\nWell expressing his feelings about the legacy of Christopher Columbus Columbus lived we heard a Winston Rodney before that are burning spirit with his take on Columbus\nAlso music from a college so rose and colleague conscious to start off this set of music\nExploring the legacy of Christopher Columbus on this Columbus weekend or indigenous peoples weekend\nAs our jazz safari continues he on you wouldn't go into public radio I'm Korean cheery a scientist on it thank you for joining me tonight as we traveled through the jazz world and beyond and we're about to conclude and mother Africa but first\nHere's music from the English Beat who are coming to the area they're performing Thursday night a gateway city art scene Holyoke he's music from one of the great bands out of the u._k. on you England Public radio [noise]\n\nAnd [noise]\nCame\nIn and do all the\nAnd [noise] and and you can really do anything I mean she's your your your your\n[laughter]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online eight to twelve school personalizing education for Massachusetts students now would rolling fall Gees easy S. dot org right\nAnd she didn't\n\nDying and then come in and out of time to time\nAnd they chase each\nOr\nGet\n\n\nJohn and John's on the\nGrid and Don\nWhat is your job go\nDown\n\nThere\nThe game\nStreaming up the wait was public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts doable now would rolling for fall Gees easy yes dot org\n\n\n\n[noise]\nDuring the spring\nFamily might come to get\nRegular wherever you're\nAnd [noise]\n[noise]\n[noise]", "show_name": "Jazz Safari", "year": "2018", "city": "Amherst", "day": "07"}