{"month": "10", "state": "TX", "station": "KTDH", "content": "And I'm proud to be a member supporter\nSupport comes from key office products a phone line commercial office solutions company currently serving sixty Kansas county with locations in Garden City dodge city ... injunction city more information at key office products dot com\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ...\nUh service of high plains public radio available everywhere at H. P. P. R. dot org\n\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\nRain Saturday three pm central time repeated midnight\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ...\nUh service of high plains public radio available everywhere at H. P. P. R. dot org\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air\nWe thank them for their support and hope that you will patronize support and thanked him as well live\nFrom NPR News in Washington I'm Barbara Klein after two weeks of denials Saudi Arabia is admitting that journalists Jamal could show gee whiz killed inside its consulate in Istanbul the BBC's Martin patients report\nSaudi Arabia claims ... broke hog between ... and the people waiting for them inside the ... which led staff\nBut many will question Saudi Arabia's ration of Iran's which suggests this was some kind of kidnapping operation that went wrong that's in stark contrast to Turkish media reports which they missed the show she was tortured march towards a ... just men Bert\nTurkish authorities say they're searching for could show genes body and will reveal the findings of their investigation President Trump meanwhile calls the Saudi explanation credible and it's praised the kingdom for acting quickly but several lawmakers on Capitol Hill say they disagree\nPresident Trump leads a rally in El cone of that ad today the last stop and a three day campaign swing for Republican candidates in the upcoming midterm elections Trump was in Arizona last night and NPR's Don Gonyea was there\nThe president is highlighting news reports of a caravan of thousands of migrants heading toward the U.S border from Central America to warn of dire consequences if Democrats are elected it is signature Trump political rhetoric as sledgehammer\nBecause Democrats evil and wanting open borders do allow criminal elements into the country\nThis is a new Trump campaign slogan from last night in Mesa, Arizona\nDemocrats produce Bob's Republicans produce job the president is trying to boost voter\nTurnout among his strongest supporters this trip was to Montana Arizona and today Nevada all places with very close US Senate daunting\nAmong his strongest supporters this trip was to Montana Arizona and today Nevada all places with very close us Janet contest Don Gonyea NPR News Scottsdale, Arizona\nViolence has disrupted Afghanistan's long delayed parliamentary elections several people are dead after a suicide bomber attacked a polling station in Kabul today Jennifer glasses in Kabul\nThe suicide bomber was trying to get into a polling station when he detonated explosives killing and wounding police and civilians it is so far the biggest single attack on the election there's been a number of bombings and attacks around the country\nBoth the Taliban at Islamic state warned voters to stay away from the polls but Afghans have been defiant standing in long lines to cast their votes in a parliamentary contest that was supposed to be held three years ago it was far from perfect\nProblems with technology and logistics at polling stations opened late or not at all to the voting has been extended through Sunday\nAt nearly four hundred voting sites for NPR News I'm Jennifer glass in Kabul this is NPR what\nYou're about to hear it not the fault of high plains public radio think of it as expressionism gone awry or rather what happens when a cowboy has control of a radio show but not necessarily his own commonsense ladies and gentlemen be forewarned here's Marshall Allen Bailey\nAnimal move tonnes of head on down and swinging gay range for western swing you know the things\n\nWe now go live remote to marshal Bailey at the swinging gay ranch\nOr good morning friends and welcome to the ranch it's always good to\nSee a live broadcast to western swing another thing is governor here from the swearing in ridge located at the gym move a little\nBit foot and they would ... where are the good so where does\nThe golf resort his own and the cattle and music is always Kelly [noise]\nIt's time again or western swing and other things [noise]\n[noise] from Joe Barton is a swing in branch in our thirtieth year we're waiting\nWaiting ... years out of the worst way to find anywhere else right here over\nOne year old can be done really Marshall Allen Bailey and I'm Down the drain and we are back\nGoing to have a loan from Lauren we\nWhole bunch of each of lying to us\nSo we need you to\nDo real run on the brink of you say whatever they would just\nTell them that what they're doing and other things on the line yeah\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\nGreat old tune in this particular\nUh playing the song rendition came off of a sixteen sided CD [noise]\nDo you have a job as a name the label they in is produced by her husband Dave you can learn more about this and all the ... music by going to Carolyn Martin music dot com find out what she's got for you\nThan rap or that we had way too soon Bob ... swing band off of their CD\nAbout time this was western swing and other things with dodge city Marshall Allen Bailey and count girl ...\nSupport is provided by the Arkansas valley diesel service easily located on highway fifty in the Marco Loretta and service and all the HBO or listening area\nThere technicians and extensive in Dora keep equipment operating at its maximum boat to angel A. B. diesel dot com\nDining New York ... website featuring go with Nouri dip recipes and specialty items combining the study or French cuisine and years of cooking experience to share with amateurs and burrows\nAt tiny New York kitchen dot com\nWill kill girl Jeannie it's been another week around the ranch\nHands not yeah we had snow yeah yeah we had snow we ended up\nWith a big fat wet snow after all the rain we've been having and how many inches a ... year did we have within a week\nIn a week is twelve point seven\n... seven yeah yeah I wouldn't doubt that I think that that's the number they're still water ... is home really in it interesting\nYeah doesn't drive that no no no yeah\nLet's see here we've been out today uh\nFat to no no no yeah let's\nSee here we've been out today a patch and reduce yeah\nYeah well I had a hole in the roof and we went up that was after garage and a\nMental health keep marine out that there are all through the rain we had a boy now that we know when I get in a hurry up her right now these these stupid was how much they are yeah easy\nYou know a this time of year those things they start to turn\nBlack you know yeah and they get halfway blind uh-huh\nYou know 'cause her skin so sick over their eyes and they're just crazy\nOh yeah and so there I'm up there trying to patch I own em dumplings warm ...\nDidn't get stung no no so I was lucky that way but uh\nAnyway we got her all patched up and uh we're still got arrested in up from a trip out west right we took a\nWhile we were out there at the Garden City doing the fund drive after that we took a trip from Garden City down to date Oklahoma yes where I took a big painting it's thirty by forty\nAnd it's called the boss of the big base and so you're down around\nGate Oklahoma yeah that Laurie cafe Laurie cafe they'll look a say in the yeah yeah and they have some good too they have the bad actually been this and that in an advertisement that is a firehouse\nFat man\nOh man but they're only on friday night yeah yeah but anyway if you're ever down that way and you want to you on a good state and you want to look that big ... uh\nWe did that and then we were after we left gate would come back you up simmer on and seen my sister lowers and her husband but and eight separate\nThan we are as we drove home home and that\nWas why a day and see what it takes two days to recover yeah that's a you know that's there's something to that getting old I were sitting in the whole time\nYeah I Know but I don't know yeah well let's play something that'll make us feel a little bit younger okay uh this is an old tune originally yeah it was\nOne of the mill in Brownsville tunes but there's been redoing up Bob hot clubs down near they are with deed I Do right here\nAt western swing and they're saying [noise]\nDo you know\nOf my de la\nI mean\nOn my own view I\nUm God that I\nFound [noise]\nThat's why I'm always hanging around [laughter]\nOh my do lie\nFrom a de la\nOr do you do [laughter]\n\n\n[noise]\n\n[laughter]\n\n\nFor a long commute my de la\nOr do you do have you know many years\nOf my de la\nI'm Glad that the one\n... do you\nThink that's why I'm always hanging around\nHanging around do alone or you\nDon't lie on the line\nMean I\n\n\nDo my\n\n[noise]\nMy\n\nMom\n\n\n[noise]\nI Want to\nSee\n[noise]\n\n\n[noise]\n\nKill girls we got a new CD and from a Jack ... who's the amount of ... and it is a CD gold the collection no kidding and from that we're going to listen to ...\nI never lost you ride here at western\nSwing and their main [noise]\n\nRead tree smiled butch and review monologue slow down them on my fingers and\nI don't search\nTell them on my fingers and\nI don't search ma'am and it never go to\nUm bang\nMobster ... ... no way to know\nNah\nBergdahl's near you\nYour never that far from my mind and\nWherever I Need you to ... to turn around what\nYour love is the easy to you but as I think\n... low bombs at the time I go ... or ... days [noise]\n[noise] I Know\nAn inch on the coast\nWhere and when I Do today\nTo use\nWhere there ever\n\nThe vine\nDo on\nIs the the two\n\nHello ms job soon\nYou smell prior to some woman [noise]\nSunday school teacher [noise] brings you a slum in\nDo you reckon creature [noise]\n... where you are [noise] standing\nHere the thing with a bang slide and it's been in a neighborhood bar [noise]\nWell yeah that's my\nAnd yet that's my glasses and I see you're up all in\nLives are pretty young Lance\nIt ain't no your business\nYes cheese with me\nAnd we don't need no sermon self righteous\nJust letters to the [noise]\nOh no no I'm\nRunning around\nAny me here last time\nAnd man\nThose times in a\nSenate in front of me and\nThen a cry for me and the problem\nSelf prior to really [noise] I Know\nYou're preaching [noise]\nAnd I don't mean you're hitting\nMy body ever [noise]\nYears have been printed [noise]\nWhen I talk to him and be nine\nFor you [noise] oh lord no ... no no\nLennon or oh\nDidn't know me here ... miles\nHour man and a\nLot of times in a\nThat in a dry dry\nEven in the world\nIt is no to gum ...\nAbout you know who the ... the main drive the man and a little\nAnd then through the beer will we go\nBeyond that there are no\nMagic low\nAbout they knew they were a little bit sweeter than the whip ... who's been in the ... big in the ...\nIt on a large red blue\n\nNot been to a year and a bit in the judge ... years old she comes down to me but there's been gay or do we\nCannot be hard to beat him\nRead the bill\nThat low low it'll\nLoad the music or a three and the Web when there was\nA day or the\nOn my rent\nA bomb that them\nMaintenance on there at the well below is not in my ear and I'm In the gym no\nMan it may very well known around those down below\nThe day the live long\n\nAll the music scene that we can go ahead Beau in that in the world\nSaying the crime\nThe ... pro\n[noise]\n\n\n\n\nMob tell you on a bus by very far from town you marry me\nWhen Muslims settle\nA little while and then\nBring\nMe out the guy\n\nRunning and\n\n\n... nurse job Burgess Tom\nBerg rather seen you know all about telephone girl\nOut yeah hello hello [laughter]\nThat just go show you that no matter what you do for living somebody's in love with the ... you know we are when I was growing up we had a central phone system ... and\nThat's what you picked it up a new Gallup the and said number believes yes yeah yeah and our number was won five oh five one five oh that was it that was years before the\nI won't go hunting and we need you know women make up for that and the body but I Do the western swing another thing that does to you while they wait and counter we're going to turn it off and related but I'll be back on the\nWestern swing and saying well we I\nAm doing 'em down when\nGave them a women [noise]\n\nTune in on Saturday afternoons for an excuse to go is this a singer songwriter America\nFull in just down to earth good to some hosted by yours truly Mallory Smith\nLet's forget about our cares for an hour and let's just enjoy embrace\nAnd let the song speak\nFeaturing caustic music from our region and beyond joined me for songbirds Saturdays that ... only on high plains public radio [noise]\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie de ... uh service supply planes public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nLive from NPR News in Washington on Barbara climb a procession of hundreds of Central American migrants is headed toward the U.S hundreds or held up on a bridge along the Guatemala Mexico border as American as Mexican police refused to let them pass reporter James Frederick is there\nI'm On the bank of the river that divides Mexico in Guatemala right next to the border bridge that the caravan tried to cross most of the Caribbean it's still on the bridge they stayed there overnight it was raining they have very little food and water but they are still there\nThere are still Mexican police blocking the entrance to Mexico over the bridge that's some of the migrants have gone down to the banks of the boredom on site and tried to cross in rats or walk across the river but most are still on top of the bridge\nJames Frederick reporting from the Mexican side of the border with Guatemala\nThe presidents of Honduras and Guatemala are due to meet today to deal with the crisis President Trump is demanding the group be stopped before it reaches the U.S and he's using the issue as he campaigns for Republican candidates in next month's midterm elections today Trump leads a rally in\nHe's using the issue as he campaigns for Republican candidates in next month's midterm elections today Trump leads a rally in El loco Nevada [noise]\nTurkish media say the investigation into the disappearance of journalists Jamal ... G at the Saudi conflict\nIs ongoing and rejects the claim from Riyadh that the cases under Saturday jurisdiction as NPR's Peter Kenyon reports the Saudis are now acknowledging could show these deaths but claim it was accidental\nAn article in the pro government doing to bond newspapers they claimed by crown prince Mohammed bin Salman of Saudi jurisdiction over the kingdom's consulate in Istanbul was wrong and that I Need to be in a convention of Nineteen sixty three the host country retains jurisdiction\nAfter more than two weeks of denial the Saudis acknowledge ... death thing it occurred after a fight broke out Eighteen people were arrested\nThe new show these three drew immediate criticism on social media with critics born into a forensics expert brought into the ... disappeared as evidence debris meditation Peter Kenyon NPR News is double\nAfghanistan is holding its first parliamentary elections in eight years turnout is higher than expected despite violence and parents do you have a deed reports several people are dead and a suicide bombing in Kabul\nThe bomber struck a polling station that we've kept open to accommodate voters we hadn't been able to ... because ... off hadn't turned up in the morning fearing attacks\nVoted so did turn up in defiance of the Taliban and ISIS he's talking to a campaign rally in the lead up to these elections mountains also try to opt to inviting and Scott a deadly attacks around the country\nSome Seventy thousand Afghan security forces are deployed to protect voters Afghan officials are extending voting hours and allowing voters to cast ballots tomorrow this is NPR\nOh see can you see\nThe Lees\nSo\nWe found\n\nMain ...\nWho's ...\n\n\nWay\nYou\nKnow ...\nMe [noise]\n\n\n[noise]\n\n\nOh\nGod no\n\n[laughter] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nThan\nThere's Dave Alexander with eighty to from dictator and that is a very ms album Alexander's good a band\nOr more information they've Alexander dot gum Gore's we started to set out as we always do every new now or with the ... doing the work they're wonderful rendition of the star Spangled Banner our national and um\n[noise] well howdy folks than welcome to the noon hour of western swing and other things ... marsh allowing Bailey and I'm ... and we are so glad to have you\nAs we roll alone now in our second week of our thirtieth year now\nOf broaden gas right here\nFor the exciting Marshall is by selling any many many many young\nBut it was a taxi nation charges that finally stuck and landed Capone in prison in Nineteen teens or he when\nHe was just missed others yeah on a lover oh I'm sure he was on a new one doctor as you know\nYeah he did he didn't start out there but he ended up\nEnded up here so is that where he died do you remember um I don't look it up on ... radio through no no no\nNo no I'm I'm how we got to show to do I mean yeah I mean ... yeah he might have I don't know I don't know where he was there\nYeah but he got moved to Alcatraz because um the public was complaining they were treating him nice at the other prison wherever he was absolutely loved him there will be\n... ... that oh it's been a while as we heard from Bing Crosby so we're going to do one here so and here's a recording of Bing Crosby along with Bob Hope\nOh goody if I knew you were coming out of ... a ride here at western swing and other things\n\nThe western swing and others say [noise]\nYemen\nAnd grab the end of this carpet gonna roll out the welcome mat for your uncle Bob Bob down to try to here they are very nice arrangement of but I Know you were coming out of bake a cake just to show you that there's a lot of your pal no biggie hog things round this trap I'm gonna let using it wasn't\nThat doesn't prove anything but if I [laughter] I think your ... your dogs\n[noise] [noise]\nIf you work on ... bay the Cape may the big bad if I knew was ... okay\nHow do you do how do you do how do\nWe\nAdded ... fired a band I got the greatest badly you know Don lay out a drive through a letter word your prior to ban same as the welcome mat for me\nNow I don't know where you came from 'cause I don't know where you've\nBeen about it really does matter and getting chair for their flattering big big big ride and\nNow if you knew who I was ... you had a meal ever harder to mostly harder now to Tom and humid amount of new ... how do I do [noise]\n\nGet rid of that on your way to make that came back they don't get a new way to pay that gang you've got that da da da da da da da da da da\nDa da da da da da\nDa da da da da da na na ... long stay\nYou know they gave me one and I don't I'm not saying this morning and not Don and the other way\nYou do I was common you'd have to go to who knew somebody who was asked you to I was ... to ...\nHow do you how to do it in a jam\n[noise]\n\n... for\nThose little things\nAnd the ... oh\n[noise]\nI'm also a time when you were\nA\nLot of ...\nAlone alone alone\nAlone ...\n... [noise] I'm In Brooklyn\nOwn little new\nUm [noise] I'm In\n[noise]\nTo the bottom line ranch Bob the ball see in this\nUh\n\nWhat ... found when I ran that they're going\nTo a\nLittle too I'm In a\n\nIt'll be Buffalo Bills with these ...\n\nAh their\n... s\n[noise]\n[noise]\nOh right in the\nRoom\n\nGet a loan to get a loan [noise] you\nKnow we you\nKnow again you know\n[noise] I'm heading for the\nAnd uh [noise]\nGoing inside a new piece for the last time and\nA\n\nA a ...\nA a a\n[noise] I'm In a\nAnd ah [noise]\nYeah no we are\nNow there is no ... mistaken that\nBoy now I Know burl lives heading for the last round that we're not ... Hi my name is my guest has said\nThis was western swing and other things with dodge city Marshall Allen bailing out girl changes while like oh we were talking about that song blue berry and not blueberry mild mocking bird mocking bird blueberry hill is another old yeah then yeah\nBut anyway anyway mocking bird hill that I had made in the old timers that was playing that and I thought it was right around the turn of the century I probably wouldn't far off because I met when she was playing that it was made right oh yeah yeah it was a new thing out\nAnd that's probably why they were you know yeah that had to sheet music out for the record or should kids and everything but tell I'm a little bit about that already well what I\nAnd that's probably why they were you know yeah the had the sheet music out further recorders for the kids and everything but\nStill I'm a little bit about an hour early well what I found is it's based closely on a Swedish walls called life\nIn that's in wood and it was recorded by Carl your bar in Nineteen teens so obviously it was written a little bit before the end\nUm George R.R Martin is I'm given credit for the lyrics so\nWe had a good job yeah yeah so to me some\nUse me yes we do so narrow pretty nice\nOkay uh you know I talked about this before on here but a lot of folks did realize no deal is quite a bit of both go work for a Bob oils and ... yeah yeah it's kind of where he got his notoriety got his uh his kick start\nAnyway here's male tell us along with Bob wells do and I wished I felt this way at home right here at western swing and they're saying [noise]\nI Can't figure that out we got maybe somebody knows more about chickens with me you know but I don't know why we got feathers all over the hour we got we got one check and she looked like she'd been over inflated or something and just all of the top without er\nAnd I just don't know maybe ... maybe chickens that I'm that way to go ... sticking out here I have no why do maybe we're supposed to get a little ... or so well I don't know chicken goats yeah\nWell it is about that time you know we're ... the chicken ... yeah I'll keep keep more men and I\n... up next to Robert Joe Randy Graf ... this is off is um album ms LA's golf favorites when we'll get to heaven right here at western swing and others saying\n\nWon ... love love Jesus saying his mercy can do\nBless it to be ... in\nBritain where I'm\nGetting there was a day or jogging that will be when we are\nSaying jeez a\nThe men's shelter which we\nDays are all over\nThat are not a\nGetting a\nNo way a\nFan\nOf seeing shot\nWhen the trees the rents are saying\nSaw him in\nGet there\nWas a a regional thing that will be\nWhen we uh\nSaid jeeze\nSame shouts how big do they\nWe're going\nAnd gangs Lou\nHe um\nWas day or rent judging that will be\nWhen we uh\nJeeze was the men's shelter\nJeez\nAre seeing Michelle\nTo me than those jobs are a big\n...\nBig lean\n\n\n[noise]\nI got a gal who might eat we\nBig blue eyes just dying you'd be her name is rose up about money and you know we all agree or not but in a grand I have a guy out the big bad no when you go to ... you don't know where you're at you have to take the lead the job and your hats\nAnd hug always in ... where you began one about the gun and a dog and and the jargon and ... when I met another bell or wisdom jogging\nAnd I've gone around the other way over the mountain I've gone around the other way\n[noise] [noise]\n\nNo body and then we ... my ... my you know read but I wrote the oil and\nI Lived there\nIs Amy ... or a buddy in Grand I haven't gotten to be a good man though when you know the hunger\nYou don't do the job and I ended up being in shock I like to see one\nDay I was a hug and a jargon and a bag and her to be my Brian\nLamb I met them talk and\nOkay I'm going to allow the yeah the dye mom and a common around the other side\n[noise] the the mile wide\nAnd a man I met another mellow in jogging man\nI've gone around the other die mom and a lot of them\n\nAre already there is none other than ... Michael\nHogan and the chalk it on my team on the ... election go Mr music mountain under new rubber were that were out Robert Joel Randy Graf when we all get the heavens Bernice collection called miss LA's golf favorites\nAnd he'd be glad to hear from you if you'd like in like a drop in an email a no no no let me give you a website That's even better cowboy ain't dead yet\nDot com cowboy ain't dead yet dot com and go find out what RJ have Andy Griffith is God for you you will be this boy that each quite a guy is a western swing and other things with dodge city Marshall Allen Bailey and cats\nFor you you won't be disappointed each quite a guy there is a western swing and other things with dodge city Marshall Allen Bailey and cow girl Jane supports provided by four days state universities encore series announcing Russian Spring orchestra\nUnder the direction of Michele ... fee on Tuesday October the thirtieth more information at W.\nH. O. W. H. S. U. dot edu slash\nOn Gore commerce buying with convenient locations route Garden City local Stabenow down decision makers will ask listen and solve the help you find your financial solutions member FDIC\nO. H. M. S. cafe in bar downtown Amarillo for twenty six years offering fine dining Tuesday through Saturday and catering for any size event or H M A s cafe dot com\nMarshall I have news what do you have news outlets old news but\nThe world record for a giant pumpkin has been um [noise] let's see [noise]\nWeighed in at two thousand six hundred twenty four point six pounds wow that was in ninth team two thousand six team in Germany suck yeah so these kind of grown issue I guess I can\nSee that the go are gonna chalk it around\nThat you share that [laughter] that probably what they did yeah but yeah that guy who who raised this one uh\nOne at well there's been three years he's had a giant pumpkin and went to out of the three in Germany so they go on the have you been to the Syrian kids is they have a giant and\nYeah and yeah and I don't think they've ever had one guy I Know\nThat's like that's as big as a sphere oh he's huge\nWell around the L normally around town tooth out do I think they can get to that\nMale now we're while they had to have a crane the moves that Iran\nI guess yeah well thank you know where she that airs a beautiful old tune and we're gonna have Elvis Presley saying it here for you one called wouldn't heart\nRight here at western swing and they're saying [noise]", "show_name": "Western Swing & Other Things", "year": "2018", "city": "Dalhart", "day": "20"}