{"month": "10", "state": "NY", "station": "WAMC", "content": "Oh\nThis is Northeast Public radio WAMC up ... points we Albany W. R. UNH the Ninety point three ramps and Utica W ... Ninety point nine Kingston W O ... Ninety One seven Middletown WC EL HD Ninety One night Plattsburgh W ... Ninety three three character Harry ...\nWAMC wage the one by one great Barrington W. W. E. S. H. D. eighty eight nine my kids go it'll be ... Ninety point one Stanford W ANR eighty eight by\nBrewster WAMC yang I'm fourteen hundred Albany\n[noise]\n\n[noise] [noise] Mm\n[noise] from the prehistoric days musical instruments we have the flu to the\nLater primitive trumpet\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nYears ago early members of the quarter for families ... string liars 'cause there are those are empty ...\nString instruments have come a long ways to ban\nIn Europe boats strings were signed into the violin family we know today while loops devolved into the guitar\nMusic for strings developed along with the instruments and western classical music is rich with variation\nAmong string instruments perhaps the most versatile was the cello a virtual solo string orchestra\nOn this transmission of hard to space contemporary music purse strings with a focus on the cello on the program called\nWe begin with two pieces by Santa Fe New Mexico based checklist Jamie seeberger for my title inspiring album\nFrom England where music by Charles John ...\nLater music by keyboard is composer Michael\nFeaturing Swiss chard was smart until mid\nIn the deep south in Connecticut jealous David darling selections from prayer for compassion and does he see I'm classic dark wood all back plus more by Jamie ...\nThis spacious contemplative sounded time a strain\n\n\n\nStreaming support for WAMC comes from Albany in bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. U.\n\n\nStreaming support for WAMC comes from Albany in bed now will be in the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu Mm\nStreaming support for WAMC comes from Albany bed now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. U. [noise]\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. U. Mm\n\n\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\n\nMhm mhm\nMhm\nMm mhm\nMm mhm\n\n\nMhm\n\nMhm [noise] mhm mhm\nMm mhm\n\n\n\n\n\n\n...\n\n\n[noise]\nStreaming support for WAMC comes from Albany bed now will be the mastery family children's emergency center a place for ill and injured children more information at AMC dot E. D.\n\n[noise]\n\n\nMm [noise]\nMm\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. U.\n\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. U. na", "show_name": "Music from the Hearts of Space", "year": "2018", "city": "Albany", "day": "08"}