{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\nOther children can quite fascinating shown to ... to ... to medieval times but talk to literally trucked in music from an anonymous medieval shores\nPlayed for you there on the bagpipes and don't only average does it contribute to the period but the bombers of the rules on some bull leaving ... this morning here at northwest public broadcasting\nOr you're conversing with Trump horn\nWith us from Sean\nSarah Schneider joined me for a survey of some of the more unusual member of the early ... instrument ...\nWe'll get to know the hurting dirty filtering and whether you work in\nThe whole luau of windows instrumental next time on early music now\nThere was an W. P. B.\nProudly serving Leavenworth and Ellensburg and when that she most of the slick into free to Ninety point seven I'm very good morning to you and they're Happy Friday is the fifth day of October I'm the reader your host until one this afternoon now let's make good on that promise of raw money off\nThe list of his works for piano one door construct his Rob city on a theme of bug in any\nWay uploaded go a bottle conducting the Berlin Philharmonic orchestra here with me but you know at the piano\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nNah\n\n\nBravo to all concerned the pianist Mikhail said the\nConductor Claudio a bottle and the Berlin Philharmonic lit up city on a theme of plug in any composed in Nineteen thirty four by Sergei Ross money off the theme being the twenty fourth and less to boost solo violin to preach just by plugging any\nWhich has inspired many a composer to write many as\nIf you enjoy the performance along with us this morning ten twenty seven on a friday here at northwest public broadcasting heard on N. W. P. B. dot org and by means of our downloadable up so that smartphone will also keeps you in touch with a full range of programming tonight at seven bill McLaughlin returns exploring music\nFocusing in particular on subjects of awesome and tumbled competitions such tonight at seven but after all things considered from NPR\nThere's always a lot going on at N. W. P. B. get the skinny and our monthly e newsletter you'll find out about upcoming programs and what's happening behind the scenes at northwest public broadcasting sign up for your free copy at N. W. P. B. dot org look for the link to sign up for our monthly newsletter\nIncreasingly cloudy today ... from the mid fifties low sixties pulling in Moscow fifty six sixty one in Lewiston\nWith the cloud cover numerous rain showers overnight lows in the mid thirties to low forties here Saturday looks to be mostly cloudy scattered rain showers by tomorrow afternoon ... back in the mid fifties low sixties\nHere we have an original ... or entertainment for two guitars\nAnd we'll look on ... ...\n... ... ... ... ...\n... ... ... ...\n\n\n...\n... [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\nAnd [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nYou do [noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n", "show_name": "On Point (NPR)", "year": "2018", "city": "Moscow", "day": "05"}