{"month": "10", "state": "ID", "station": "KRFA", "content": "Northwest public broadcasting\nOr if a Ninety One point seven Moscow Pullman K n double you'll be Ninety point five coached in Lewiston until you W O Ninety point one cotton wood Greenville NPR when the classical music community service of the Edward or moral College of communication at Washington state university [noise]\nElection from the heart of the ... period in France that ruined do ... you played for you today by the trumpeter Wynton Marsalis Anthony Newman the conductor of the English chamber orchestra\nWashington fifth congressional district has been represented by Republican Cathy McMorris Rodgers since two thousand for\nNow the question becomes Ken Lisa Brown unseat her in a district that has not elected a Democrat since Nineteen Ninety to\nWatch or listen to the candidates in debate live this coming Wednesday evening on northwest Public Broadcasting's TV and radio stations also to be hurt on N. W. P. B. dot org Cathy McMorris Rodgers debating Lisa Brown lived this Wednesday evening from six to seven\nOn all of the stations of northwest public broadcasting\nBeethoven for we in snow this ... if I made sure with members of consortium classical [noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise] [laughter] [laughter]\n[laughter]\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\nEarlier this morning it was a wind the court sent by Bruce Jeanie and there are such tests for wins by Beethoven an original work by him cast and the key is if I made sure members of consumer classical or birthday composer Franz Liszt return the spotlight next to this morning\nOne of his ... just ahead hero northwest public broadcasting\nHerded N. W. P. B. dot org ... when you go to our website you'll find links to all of her social media platforms Facebook and Instagram Twitter and simpler you'll also find more detailed information about all of these individual musical selections and the complete weekly arc of our programming schedule\nN. W. P. B. dot org\n... classic when you hear it it's music that's like comfort food music you're glad to return to again and again your station is open all night Serena perfect musical snacks your favorites chest if you want them\nRight here on the NPR and classical music service of northwest public broadcasting\nStore to your week\nLow forties your Tuesday and Wednesday also looked to be mostly sunny slight chance of a shower tomorrow afternoon around Lewiston high is in the mid sixties to low seventies\nSo let's return now to the world of Franz Liszt\nBorn on this date back in Eighteen eleven uh most remarkable personality apparently not only quite brilliant but a brilliantly charismatic as a keyboard artist in fact had he lived in to the era of social media\nAnd viral load videos and all the rest he might have been even more of a sudden ... nowadays but he proved to be back in the nineteenth century in any event here as list again pioneering in a way even as he writes for his own instrument\nMaking use of cyclical technique which is to say introducing themes here that actually date back to his late teens and then transforming them recycling them through variations throughout the course of this work\nHe actually put together this first piano concerto over the course of a quarter century\nEventually giving the world premiere in Germany in Eighteen fifty five with a good friend and fellow famous composer act or apparently it was on the podium in this case we have a quite brilliant cast of her own time pianist murdered to argue rich conductor cloudy all about\n\n[noise]\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\nWith murder to argue with each one of the most brilliant ... of our time is the ... and with Claudio ... was the conductor of the London symphony orchestra the piano concerto number one in ... made sure by Franz Liszt\nWhen I made my first trip to Hungary I had to make a pilgrimage to listen to funnel home\nOn the ... side of the river den you've been the Hungarian capital you could see all kinds of memorabilia including plaster cast of his enormous hands especially those fingers my goodness no wonder he could spend those chords\nBut also various kinds support for sure and and other personal effects of course is\nHis favorite channels including his mission and had one from Boston\nBut you could also see the plaque he had a first floor apartment in the old academy of music in patched and you could see the brass plaque the hung outside the front door to his home and it read Hungarian on top German on the bottom federal ...\nMany of domestic schedule at least in his later years Franz Liszt honoring him on his birthday anniversary born on this twenty second day of October eight team of eleven moralistic Romania tacoma's the day progress is sure a northwest public broadcasting herded\nN. W. P. B. dot org a very good morning to you Steve leader ... will join you this afternoon from one to four\nTerms are counting NPR rolled out to the minute report and write an ally and never rape that critical election then he'll have rights NPR nan\nTheorists sensual reporting every day on MORNING edition all things considered and weekend edition right here on northwest public broadcasting\nWill complete this hour with another romantic of the nineteenth century than a\nThis is the first of the six symphonic players which comprise his that's\nKnown as much of last or my homeland by the way\nSpent than it was also a very good friends of friends list who championed his music this is called the shit out or the hike Kasell referring to the castle on the outskirts of Prague which served as the earliest seat of the ... kings ... high capital by about ... ...\n[noise]\nMm\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "On Point (NPR)", "year": "2018", "city": "Moscow", "day": "22"}