{"month": "10", "state": "ID", "station": "KRFA", "content": "If you're promoting an art to then let our website help you at N. W. P. B. dot org click on events and right there on our community calendar you can submit the details about your concert or exhibits which will be seen by anyone looking for things to do in the community again that's an W. P. B. dot org under events\nNorthwest public broadcasting or if a muggy one point shoveling most go Pullman trillion W. B. muggy portfolio coached in Lewiston until you're W O W port on cotton wood Greenville NPR with classical music or community service she'll be aboard or rural cultural communication at Washington state university\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\nOh still little so you still ... run with them in the scene but ... but damn well I guess she bought a ... ... ...\nMaking a return visit to the northwest right now two minutes past ten on a Monday morning or good morning to use the radio here continuing to host the classical music until ... arrival at one this afternoon here at northwest public broadcasting with a major romantic symphony coming next\n\nWell sometimes you love short short cake\nShort ribs short cuts short meetings will have about short fund drives\nYou got it the one day drive is this Thursday but you don't have a short weight\nIn fact there is no waiting you can donate right now at the end W. P. B. dot org if it's time for you to become a first time donor or renew your support pleased to it now\nDonate right now at N. W. P. B. dot org and have your pledge counted toward the goal of twenty five hundred and what's more your early pledge will keep short fund drives the standard here at northwest public broadcasting thank you so much\nNow onto our major work in this ten o'clock hour the first of the three symphonies by the German romantic and friend to Brahms much proof\nThis performance given by the ... under court most tourists direction\n\n\n\n\n\nMm\n\n\n[noise]\n\nMm\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n... [noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n[laughter]\n\n\nLiving\n\nThose little by\nLittle [noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n\nThe ... come beanie his window quintet number three in al fest performed by the Avalon wind ...\nEleven minutes though before eleven a Monday morning the eighth day of October here at northwest public broadcasting herded N. W. P. B. dot org and by means of our downloadable apso a smartphone of yours is also a useful tool for staying in touch with a full range of programming a very good morning to you", "year": "2018", "show_name": "On Point (NPR)", "city": "Moscow", "day": "08"}