{"month": "10", "state": "ID", "station": "KRFA", "content": "'til you are as a Ninety One point seven Moscow Pullman ... n double you'll be like the point five clerks didn't Lewiston until you W O Ninety point one cotton wood Greenville NPR on classical music or community service of the Edward our world College of communication at Washington state university [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\nI think just the darn sure for Chrysler tour musical mix where are you this morning ... Singh ... with the violinist ... ... ... ... and ... ...\nThe English composer and scholar so versatile so talented and so quotable born on this date one hundred forty six years to go back in Eighteen Seventy two\nHe once wrote that art for art's sake has never flourished in England we're often called in artistic because our art is unconscious or drama and poetry like our laws and our constitution have evolved by accident while we thought we were doing something else\nAnd so it will be with music\nComposer must not shot himself up and think about art he must live with his fellows and make you start an expression of the whole life of the community if we seek for art we shall not find that\nThis is Juan Williams working in Nineteen fifty right at the heart of the ... century crafting a beautiful piece of music emulating a form and the style perfected by quarterly and his famous people handle back in the Eighteenth century from Nineteen fifty know herb roasted composed a refund Williams\nAnd his very own concerto gross so\n[noise]\n\n\n\n\nConducted by the group's founder William ...\nExactly twenty minutes now past ten o'clock on this anniversary of the birth of refund Williams in England back on the twelfth of October Eighteen Seventy two much more still to come today and ... and I are going to be sharing with his fantasia on a theme by Thomas tells\nHis serenade to music and more Vaughan Williams saluting him on this Friday here at northwest public broadcasting\nWell if you're among the more than fourteen hundred listeners to generously donated on super Thursday thank you very much\nYour gift will help to bring another year of the programming that you value including all of this classical music now if you're meant to pledge but didn't quite get around to it yesterday no worries you can still give it N. W. P. B. dot org much N. W. P. B. dot org thank you for doing your part\nEighty nine\nMusic for the wedding thirty nine debating the Lorraine\nPerformed by the\nNext time I really you know [noise]\nEarly music no no come your way every Friday evening at eight and Sunday afternoon it to your on the NPR in classical music service to N. W. P. B.\nOr Mr key border stunned composure not to mention cleric of Eighteenth century Spain the good ... on Tony Little sillier represented here by his keyboard quintet number two in the Chicago area ensemble lead here from the heart to court by David Schrader\n[noise]\nMm\n\n\n[noise]\n\nThe keyboard quintet number two when asked me to buy the Eighteenth century Spanish composer and cleric poetry and Tony ... who wrote a lot of keyboard music he's quintet number two with the ... David Schrader\nSupport for northwest public broadcasting comes from ... engineering laboratories one hundred percent employee owned located in Pullman, Washington\nInventing designing and building systems to protect power grids around the world on line at S. E. L. I. N. C. dot com or there are a good morning to you on this Friday this twelfth day of October T. G. I. F. indeed\nThe waiter your host until one this afternoon great to be sharing oldest glories music with you more of it coming momentarily\nFunny bringing romantic favorites from Roosevelt risque across the ... and ... to the stage Saturday October twentieth at home in high school the twenty first than Clark's in high school ticket information at W. A. dash id symphony dot org\nAnd extended stretch mostly sunny weather ahead with the blue skies today's highs and the sixties wins coasting to twenty five miles per hour into the evening pulling sixty two sixty nine in Lewiston\nMostly clear overnight lows in the thirties widespread frost on Saturday morning suddenly tomorrow afternoon hives in the mid fifties low sixties\nWould come to the nineteenth century Belgian French masters faced off from work\nBest known perhaps for his Oregon music but if you're running for symphony orchestra his some funny pull him cold ... to ... or the person has been cursed because he actually dared indeed he actually stand\nBy going on the hunt on a Sunday\n... ...\n... ...\nYeah\n", "show_name": "On Point (NPR)", "year": "2018", "city": "Moscow", "day": "12"}