{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n\nA selection associated with the musical culture of the Iowa loose men but banks coughing song\nA traditional melody played for you there on ... to ... by any rules a company don't bend Elyn accordion and percussion\nA gentle quite beautiful start toward ten o'clock hour this morning thank you for joining us here at northwest public broadcasting approaches to oral female would want to point three in Greenville at Ninety point one ... your host until one this afternoon\nWith the artistry of is Lena gr often our she plays the solo part of the next performance\nAlong with certain double Mariner that'd be Academy of sit marked in the fields\nThat she's moved towards flu concerto number to Indy\n\n\n\n\n[noise]\n\n\n\nYou just heard the second to the to flute can share to you by Mozart that ensured a number to indeed you say not crossing our as the flute soloist certain level Mariner the conductor of his Academy of St Martin in the fields\nTen twenty four now on this Wednesday morning October twenty fourth\nHere at northwest public broadcasting you can always get more detailed information about the ... elections that we play for you everyday the names of these ... and the titles of their pieces recording labels performance ensembles at all the rest\nBy going to our website N. W. P. B. dot org searching under radio and classical music playlist you can also get a complete overview of our weekly schedule\nAt northwest public broadcasting in N. W. P. B. dont Oregon next hour we're going to bring you a heavy dose of nineteenth century German Romanticism the last of the symphonies Schumann that's coming your way next door\nIf you're writing an article that at our website\nThat's at our exhibit which will be seen by anyone looking for things to do in the community again at N. W. P. B. dot org under events\nPart at least some of these guys for your Wednesday highest today in the upper fifties to lower sixties Pullman in Moscow fifty eight sixty one degrees in Lewiston\nMore cloud ... overnight loose in the upper thirties to mid forties you can look forward to a mostly sunny day tomorrow well highs reaching the upper fifties to mid sixties then rain on friday\nAnd do some Russian chamber music for you on this Wednesday morning\nA student of ... course to cough and a friend and colleague of ... in St Petersburg and Moscow respectively until ... here represented by string quartet number one in ... and by this performance of it featuring the getting quartet\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\nAnd [noise]\nAnd\n\nThe the kids you know [noise]\nMm\n\nAnd\n... ...\n\n...\n\nMm\n\nMm [noise]\n\n\nWith those passages in which the players to imitate the trauma of above a like a lead string quartet number one in ... by the Russian on tone out in ski but performance given by the ... court tip\nHere at northwest public broadcasting herded N. W. P. B. dot org proud to serve Tacoma Seattle and Olympia on Ninety point nine a very good morning to you\nAnd happy Wednesday I'm steep leader Cathy McMorris Rodgers is the highest ranking Republican woman in the U.S house of representatives\nDemocrat Lisa Brown is hoping to unseat her next month the candidates are going to the beat each other this evening in Walla Walla and you can watch or hear that debate live on northwest Public Broadcasting's radio and TV stations also available to you on N. W. P. B. dot org and on the app\nIn the northwest public broadcasting [noise]\nWho's keeping you company while you do those weeknight dinner dishes is it just you and still held that some Chopin a little divorce shot while you check in those leftovers simply go via to go with that Spanish rice\nGigi yelling you're hooked for weeknight classical music inviting you detect some classical music into that apron pocket if yours on your phone download the northwest public broadcasting\nAt that end up to Oregon help yourself an after hours company is only good taste [noise]\nTreat you will rejoin you with another entertaining program of classical music this evening from eight until midnight\nAnd know the less serious side of the ... legend do you remember the poet and musician who dared to travel to the underworld to try to rescue his beloved wife you really do see well many composers indeed most\nHave treated that subject matter seriously even river in ... in many cases but not in the one that proved to be one of the biggest box office success just\nFor shock often buff back in the middle part of the nineteenth century embarrassed\nThe overtures to his operatic cold or for you in the underworld\n\n", "show_name": "On Point (NPR)", "year": "2018", "city": "Moscow", "day": "24"}