{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n\nOh yes quite figure to run around with a performance therapy traditional classic of each call I did namely the clarinet pogo Robert most\nOn this Tuesday Morning here at northwest public broadcasting herded N. W. P. B. dot org hurt in Tacoma Seattle and Olympia on Ninety point nine\nTo ... D once commented that this is the opera with which my artistic career really begins\nA reference to his Eighteen forty one up ... or ... partly inspired by episodes in the Bible\nOr worked at also began a longstanding association between the theatrical productions of ... and the popular movement in his native Italy for unification and independence from France and Austria\nAnd data would lead Verde this notable artist musician composer to become an elected member however hesitantly an elected member of the Italian Parliament\nWell this is the best known passage from ... Eighteen forty one year certainly a passage that had great meeting for those first audiences von ... or the course of the Hebrew slaves\n[noise]\n[noise]\n[noise]\n\n\n[noise]\nUh\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\nThe composer they're expressing a universal feeling like you're running for freedom the chorus of the Hebrew slaves from his early ... successful upper ...\nIntroduced to the world out less scholar lawn in Eighteen forty two via ... from ... a performance there that featured the resident orchestra and chorus of la scala under Ricardo motifs direction bear in mind that book go put him on the world's artistic an operatic map\nHe considered his career to begin with ... go and yet he was still just in his late twenties\nAs a composer for the theater and fed or do you born in this state\nIn Eighteen Thirteen our other composer giant of the nineteenth century ... also celebrating the birthday today\nAnd we'll get to one of his best known and best loved works in just a moment here what northwest public broadcasting herded N. W. P. B. dot org and by means of our downloadable app thank you so much for joining us today\nOf reporting and music that elevate your day this is your station if northwest public broadcasting is important to you then\nMake sure it's here for you now and in the future by giving it your support during the super Thursday fall pledge drive on October eleventh in these times of increasingly fractured information you can make sure that this trustworthy source of news indoors\nMom and a\n\n\n[noise] [noise]\n\n\n\n\n[noise]\nMm and and um Mm\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nAnd [noise]\n\nUm oh\nAll\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\nMm\nMm [noise]\n\n\nMm\n[noise]\n\n\n[noise]\n\nOh [noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\nMm\nMm\n\n[noise]", "show_name": "On Point (NPR)", "year": "2018", "city": "Moscow", "day": "09"}