{"month": "10", "state": "ID", "station": "KRFA", "content": "If you were a sustaining member who makes an automatic monthly donation to northwest public broadcasting what the credit card thank you that credit card do expire so if your bank sends you an update the card please take a moment to give us a new details call one eight hundred eight four to eight nine nine one to update and thanks again for your support\nNorthwest public broadcasting today are of a Ninety One point seven Moscow Pullman K n double you'll be Ninety point five clerks didn't Lewiston until you W O Ninety point one cotton wood Greenville NPR on classical music community service of the Edward or moral College of communication at Washington state university\n\n\n\n\n[noise]\n\nA little selection from Italy yet the turn of the seventeenth century that gal yard based upon the tune from another source music by Giovanni buddy you got for about ...\nAn organist and composer and quite prolific one to more than three hundred surviving\nManuscripts in his pen and in his penmanship\nAndrew Lawrence king performing there on a double harp I'd gone yard by ... beginning our ten o'clock hour here at northwest public broadcasting herded N. W. P. B. dot org like to invite you to find and follow us on Twitter as well another excellent way to stay in touch with our classical side at N. W. P. B. classical [noise]\nSpeaking of music are next composer once famously declared what a beautiful art\nBut what a Richard profession yes that would be George you say the French composer the composer of carbon and so many other works born on this date\nIn Eighteen thirty eight we're going to hear some of his most famous pages now they come from the Eighteenth sixty three upper the Pearl fissures and specifically from its first act the friendship to involving the two men the to fishermen that year\nYou know a beautiful young priest named ... this is the famous ... to ... to ... the composer short speech say oh\nNo no we're not a modern man for man oh\nMan I [noise] ah Gulf\nWar or the soccer ball\nOff or\n\nYou know I'm up there on the\n\nNo no no I'm not in\nThe mirror ball [noise] why don't\nWe don't want to\n\n\n\nUp\n\n\nOn\nA cell\nPhone\n\n\n\nAnd all of us [noise] we're all\nCars all all\nOf a man on\nNon Bobby saw on the\n\n\nRun up that's been [noise]\nSomeone when it all up ... Australian goes on in the middle of the federal law is\nSpent on your record\nThat\n\n\n\n\n\n\n\n... ...\n\n\n\n\n\n\n\nThe name that\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\nThe dual a violinist Moshe Hummer and guitarists Norbert Croft collaborating in that original work for the combination of instruments by ... by getting any his ... Eighteen and see you at northwest public broadcasting\nWell congresswoman Cathy McMorris Rodgers debated her democratic challenger Lisa Brown in Walla Walla last night\nIf you missed our live broadcast a heads up here you can still catch tomorrow evening at seven on the NPR News service you can also watched the debate anytime at N. W. P. B. dot org and on the northwest public broadcasting up again that rebroadcast McMorris Rogers brown debate\nIs tomorrow evening from seven to eight on the NPR News ... N. W. P. B.\nOf folk music which exerted a powerful influence on western reporters from hiding promised me throughout\nExploring the role of this makes my yard I used to say my ... years\nThis week when exploring music [noise]", "year": "2018", "show_name": "On Point (NPR)", "city": "Moscow", "day": "25"}