{"month": "10", "state": "ID", "station": "KRFA", "content": "\nThe main theme from Richard ... still score for the Nineteen fifty eight British traumatic feature film a tale of two cities\nBased upon the novel by Charles Dickens the b._b._c. concert orchestra conducted for you today by Ken of old when the musical tales to many different kinds and the seller and buyer at least indirectly by the titles on the great American read one of which happens to be Dickens book as a matter of fact his ...\nAnd then the winter America's favorite novel America's Best loved single book\nOr novel franchises the case may be will be announced in a public television specials this coming Monday October twenty second in the meantime we're going to embed more great American read inspired music into our classical music programming for you today here at northwest public broadcasting\nAnd ... will have a kind of musical bouquet\nMusic inspired by flowers and plants this afternoon and about two forty five and then beginning it ate tonight from our studios Gigi yelling is going to share with you to music inspired by the great American read and it's concepts of time and space in the seasons including complete performances of also ... by\n... and the first symphony winter day dreams by ... that's from eight o'clock this evening thank you so much for joining us today and every day for our version of a great American listen right here on the NPR in classical music service of northwest public broadcasting\nNorthwest public broadcasting received program support from listeners like you and the auditorium chamber music series presenting to London handled players dance and music of the baroque era featuring period instruments and costumes Tuesday October twenty thirty seven\nTell you are as a Ninety One point seven Moscow Pullman K n double you'll be Ninety point five coached in Lewiston until you W O Ninety point one cotton wood Greenville in the yard classical music community service of the Edward our world College of communication at Washington state university\n[noise]\nUm\nOvertures to Mozart shop ... in that performance given by Toronto's tough will move seek baroque orchestra conducted by Bruno vile\nIt takes me back that's for sure I have a special fund those for that approved by Mozart the first ... I ever attended in person while a student in Geneva\nIt was extraordinary and it took beyond live opera forever more hope you enjoy the over the curtain raiser the Mozart wrote for ... leading off our ten o'clock hour this morning\nHere with northwest public broadcasting an N. W. P. B. dot org ... bill McLaughlin returns to the thing it's seven exploring music focusing all week long on the symphony as a form of expression\nTonight he's going to delve into twentieth century symphonies by the English when will you\nTo our musical tales last hour all associated with the great American read\nWhich as you can readily gather by just reviewing the roster of one hundred titles their ranges from entirely real stories or realistic tales to the surreal the fence of full from the worldly and the visceral to the other worldly\nAnd from stories that are rooted in direct kinds of personal experience to stories that have a kind of universality and inspired you know not only a curiosity and the fascination but perhaps tend to some of the emotions\nBut we didn't necessarily know we had or could feel or could muster that's what a great read will do you'll see the full roster and have a chance to vote through this evening at N. W. P. B. dot org slash G. A. R. and with that in mind in that range in mind\nHere we have a work by ... titled a fairy tale his music now with the London symphony conducted by Donnie ...\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nMm [noise]\n\n\n[noise]\n\n[noise]\nTail in music for you today\nThe London symphony orchestra led by the former longtime conductor of the Victoria international festival and are part of the world\nYou own Donny port northwest public broadcasting herded N. W. P. B. dot org I trust you're more than familiar with the work of Nina Totenberg NPR's long term legal affairs correspondent and U.S Supreme court reporter well she has written a piece that we've posted to our music and culture blog at our website\nHaving to deal with the tail of that stolen Totenberg shroud you know the one that belong to her father for so many years well it ends with a new legacy thanks to Nina enter sisters\nShe runs a wonderful piece you can read about it get her perspective on the entire story by going for music and culture blog at N. W. P. B. dot Oregon it's your home and resource for all kinds of things northwest public broadcasting and of course\nClassical music which continues momentarily with a string quartet by a Mozart contemporary\nSupport comes from the Washington Idaho symphony performing romantic favorites and creating musical storytelling of coffee at the Romeo and Juliet fried and psych ops he's Sleeping Beauty Saturday October twenty twenty first in collecting ticket\nAnd Lewiston of sixty five and expect to clear evening tonight to be in the mid thirties low forties for tomorrow a repeat of sunshine with temperatures in the mid to upper sixties and expect the same for your weekend\n\nNo Luigi ... the Italian born master cellist and older contemporary of Mozart ... we all through the string quartet number four in ... whose performance given bonded totally get on stumble quarter to border Johnny\n\nMm\n\nWon the\n\n\n\n\n\n\n\n\n\n\nCourt tend to show me the Italian ensemble with music by their country ... an older contemporary of Mozart ... known that challenged in his day that string quartet number four in the ...\nHere at northwest public broadcasting proud to serve Tacoma Seattle and Olympia on Ninety nine point nine good morning to you in a very happy Thursday on this October Eighteenth I'm Steve leader you can get a complete program schedule and more detailed information about all of our individual lifting some selections\nAt our website N. W. P. B. dot org [noise]\nWashington's fifth congressional district has been represented by Republican Cathy McMorris Rodgers since two thousand four\nCan lead to run and seen her in a district that has not elected a Democrat since Nineteen Ninety two well watch or listen to the candidates as the debate live next Wednesday on northwest Public Broadcasting's TV and radio stations\nIt will also be carried on N. W. P. B. dot org Cathy McMorris Rodgers debating Lisa Brown live next Wednesday evening from six to seven on all the stations radio and TV of northwest public broadcasting\nFor young musician sometimes just", "show_name": "On Point (NPR)", "year": "2018", "city": "Moscow", "day": "18"}