{"month": "10", "state": "OH", "station": "WKBN", "content": "And your your opponent is a woman named to listen to a slot can correct correct yes it didn't light urge her supporters to boycott local businesses that have signs that support you\nShe just moved into town uh she never lived here before she never property or before she never pay taxes you're before first time she voted was the last time on this last primary for herself\nAnd you're right she came to town for the first time met with a bunch of my uh my neighbors and told them that if if businesses don't come Rochester and my little hometown I had\nHad signed up for me that they should boycott and a and not give them business and and these businesses have been hit by phone calls and threats and and and intimidation for weeks now just because they\nHad no idea what might happen really angers me let me tell you how I Am where I live\nI Know everybody that runs a business there is a deli in my town I go to my local deli they act like there's a meat market in my town I go to my local meat guy there's a local grocery store I go to the local grocery store I go to the local pharmacy\nOr I go to the local gas stations whenever I can\nI I I Want and by the way I don't ask if you're a Republican or Democrat I I I Want to keep you know ... these businesses serve their community by being there and that's why I Try to I Try to do I go to my local restaurants when I can you know I've really go to three places so it's not like\nI go to that because I it's just ridiculous if you've been through what I've been through it restaurants where now you just can't believe the crap that goes on if you're in public in the public eye but well anybody that's going to say and everybody in the eighth district of Michigan\nIf you have a Democrat thing don't support local businesses if they don't vote for me that is exactly like Hillary saying we can't be civil ... the exact what's the difference\nThere certainly is no different from most of these people are supporting me not necessarily because of my politics but because they know me my entire life there we went to school together\nI I frequent their places of business from this person has come from out of town doesn't know any but for me that's that's just a an attack on my community and it's a it's a statement as to what what she thinks about all of us and\nUh and she's ... pay taxes in our local community it's unbelievable\nNo she's not here for that she's here to take power and that's all she watched\nLet me tell everybody ... if you cannot hold a business owner hostage to vote either my way or I'm not going to patronize replace now if somebody has a radical view very extreme that might be a circumstance\nWhere you just say I'm just not that those values are so antithetical to my own personal values I'm not I'm not going to reward this with my\nMy my dollars but most business owners like man that they're fighting to stay alive every day and it's just it's expensive to rent the expense of the employees are expensive then you've got to pay for benefit plans all sorts of stuff\nIs I Want to wish you luck um and I just want to tell the people it's Rochester area correct\nRochester Oakland County Livingston County ... County Michigan\nAlright listen we really wish you the best Mike bishop I'm Sorry you obviously have a big bull's eye target on you I'm In terms of Democrats wanting you to lose we wish you the best in your race and uh uh will follow very closely okay\nThank you for your great support I really appreciate\nGlad to do it or don't forget about our friends at the U. S. C. C. A. now they believe in the second amendment they believe you have the ability to protect yourself and your family is a very dangerous times\nAnd all you have to do I want you to pick up your cell phone right now and ... the word protect\nTo the number eight seven to two two now for twenty four days straight they're going to give a free gone away to a responsible gun owners Second Amendment lover\nAnd you get to reveal which one you want to take home but it doesn't last for long every day well that one offer ends at midnight right so the U. S. C. C. there's little group that wants to get more guns into the hands of responsibly armed Americans\nThey also helped train and protect the people that want to protect their families they want you to be responsible I Want you to be responsible\nBut anyway you can when it's gone every day just text the word protect from your cell phone P R O T E C T to eight seven to two to Texas award protect\nTo the number eight seven to two two from your cell phone I remember you have until midnight tonight to win for today's contests twenty four and all tax protect eight seven to two to\nI Will take a break we'll come back we had amazing Hannity tonight nine eastern Fox News channel all the breaking news Rosie o'donald insanity and much more [noise]\n\nBreaking where you you have or a single day\nIs Sean Hannity show\nRon verb Monday through friday every news radio five seven [noise] W. J. B. and [noise]\nIf you suffer from E. D. and you've seen your doctor about the little blue pill you know it can be expensive and seeing the doctor and waiting at the pharmacy can be a hassle\nWhat if I told you that a certain little blue pill just came off patent December eleventh in that scene the active ingredient that's in the little blue pill is now available in generic form available to you from just thirty dollars for a month supply that's a big discount no more getting ripped\nOff by the big pharma companies with four hymns dot com you can bypass the doctor's office pharmacy visit and see huge money on your prescription ... just go to for hymns dot com slash big consult with a licensed physician ad following their confidential medical review you can have the\nProper prescription deliver directly to your door for a fraction of the price and today will supplies last you can get started with a trial month for just five bucks that's right five dollars here's\nWhat you do just go to Fort hymns dot com F. O. R. H. I. M. S. dot com slash big today and get started for just five dollars while supplies last visit for him ... dot com slash big right now for ... dot com slash big\nSea website for full details mental services to the platform are available to the states I use the [noise]\n[noise]\n\n\n\nI was going to\nWrap things up but then I look forward to seeing many of view in Houston tomorrow eleven AM Rick Perry Ted Cruz\nAnd in ... although we go ... go and Beaumont, Texas Louis will be there too\nAnd I'm looking forward albeit um are you doing interviews town hall is going to be fun it's free all details on Hannity dot com for Houston in Beaumont used an eleven Beaumont at three thirty details Hannity dot com Ted Cruz as it up on his website I have a great weekend see many of you in Houston in Beaumont this weekend [noise]\n\n\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty\nIt's called ... and here's how it works with rate she'll you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with ratio we really have you covered\nHere are more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage rich nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin right and what you said in comparison to all the data records which will prove only about I'm thirty three year project transactions call for confirmation edition equal housing wonder licensing office he said and I'm watching for thirty thirty additional conditions are losing\nESPN what people live for and onto the show for\nAnd usually there except the reality is more or less what the consensus exceptions reality I mean yeah it's really easy to go with the crowd\nBut doing something that a may give a a jar make jar the mind that's that's courageous now\nTakes a lot of courage to speak the truth takes a lot of courage to like break out from this normalcy in ... I mean there's no challenging opinion or challenging thought from those where rigid thinking and so\nThere are a lot of things that they miss out on would their negative in uncomfortable way of some help believing that they are the reality police and always leading to explain that those who believe in what they feel is nonsense purely delusional its embassy sound like it's more authentic\nAnd so the Halloween season\nWe're almost there but what they are now I mean I'm getting at Halloween feeling uh the reason why I'm getting the Halloween feelings today for the first time\nI actually felt a chill why\nBecause when I got up this morning there was foggy everywhere and it was cooler than it usually is\nAnd you know I got to stop wearing my sandals means I got to start putting out she was all summer long and I were the saddle there were other out just wherever 'cause it's comfortable wear sandals you're not used to be the cool guy on the street just wear slippers\nI got the idea from watching Bing Crosby and David Bowie singing Christmas [laughter] together that I wanted his word slippers\n\nJust flip on these flip on slippers and I wear them everywhere you look so casual and your slippers like oh no I don't want to take 'em off\nMy feet to be nice and warm and my slippers\nBut today I actually started thinking ... no matter where my heated socks and shoes and I saw pumpkins at the store by where I went and got copy of this morning got a little cup of coffee to Republicans are perfect shape pumpkins\nAnd the guy who got to start carving the pumpkins get out the candles put out the the skeletons it's time for Halloween\nBut see what you're doing Halloween and you're thinking about all of a scary Halloween stuff you know you get those emails while you're talking about that stop bar it's scary it's called Jesus doesn't like it well you know what yeah it's a challenge to me it's a challenge to your mind it's a challenge to everything because\nThis is a time Halloween Halloween is the time we open our minds to be a cult\n... literally all things that are hidden you know that's what he called me is they all the cold I don't want to join in a cult that's no no that's not what it called me well you're part of in a cold aren't you know that's not what a cult means cold actually means\nThat which is hidden\nMysteries mysteries of the world or the cold\nSo diving into mysteries diving into the hidden diving into those things that are taboo a cold is one of those magical words\nThat can scare people enough to have them hiding their closets or under their beds or provokes\nThe reaction of intriguing certainly something where most people want to get in on the secrets and find out what big things are being planned in the shadows\n\nWhat we're talking about as we're talking about real honest to goodness magic now you can spell magic M. A. G. I. C. right that's the regular was about or you can spot like the culture stew M. A. G. I. K.\nYeah and if you felt that way than you know that's pretty evil that's as evil as you get right restart magic with a K. so um\nIt's uh it's pretty amazing some of the things that ah you know when you're in conspiracy circles there's those dots but you need to connect and when you do you start digging deeper and you know\nHalloween covers a lot of things but digging deep all the time see for me every day's April Fool's day and every night is Halloween so and so I'm connecting those dots\nAnd I get into\nThe great can spiritual ... the conspiratorial orders but dark orders that have all their secrets it's about who's in charge of the planet\nAnd who are the magicians that run the synergy or the center you know there are theories about dark Brotherhood's received their information my challenge the power of demons and there are other investigators that have shown that for millennia mankind has been directed by over towards that can only be compared\nTo honor no divine or perhaps profane beings\nSome even believe are being controlled by extraterrestrial I mean we're not a point in time\nWhere so many weird things are going on that\nYou have to in good conscience weighing possibilities inevitability he's ... never ending paradox the world at the moment seems unreal\nAs we now understand\nThat uncertainty is a certain day and the change can cause great upheavals that can affect us for\nYears or even lifetimes\nHeard the old saying in magic as above so below something we should be remembered that even if our\nIs ... is decided to adhere to all kinds of crazy stuff there's a lot of crazy stuff\nSigns and wonders in the sky and they continue to be here to the average Joe and there's always a number of secrets that are being revealed by religious orders and others that are being put on the back burner\nAnd of course all we hear about is how there is a world order and that world orders going to be led by anointed elders\nAnointed magicians and anointed successor looked sharman right I mean this is what a monarchy is true the monarchies are run by kings and queens\nAnd kings and queens or annoyed ones they think that their bloodline goes all the way back to Jesus Christ\nOr do you all the way back to God and we all know that blasphemy right but yet we still give honor to kings and queens the 'cause like giving you the queen of England and you'll get all the families that the bloodlines and with the bloodlines mean\nAnd it's just so strange that were so fascinated with blood and blood line makes you wonder if vampires or or you know if there's some sort of a\nA ... type order and it certainly uses all kinds of powers the power in the\nMagic in the blood the power of the magic of conscience the consciousness and the so this is why\nIt's so important to realize that now is the time where the consciousness is being analyzed because they know that there is a spark a divine sparked founding the consciousness and they can use the consciousness as a way to perform acts\nOf alchemy seriously\nIt's all about being magical it's all about the magic you can call it whatever you want drawing from the dark\nPowers some people drop from the lighter powers some people claim they have a priesthood\nOh priesthood is similar to magic except they officiate saying that they have the power through oh I don't know God maybe or Jesus Christ or some people call down the power of the angels but then there are other darker powers darker\nPriesthood and representations of those dark appreciates that are being practice now she used to be the satanism never was\nSerious satanism just a bunch of people who are what\nFashion victims you go to goodwill and we're all kinds of strange close\nPaint their faces all white look a little scary you know the ... kids hanging out of the love craft festival and they're all happy to be there but no this is something a lot darker and a lot deeper [noise] music satanism is taking basically ... the United states it's spreading all over the world and contractors and magicians and magic men\nMagic women are now taking over there is of interest to be\nThe millennium the new millennium generation heck I suppose they're all coming together and they're certainly wanting to have more than what religion gives them today they're relying on old pagan\nRituals and say panic rituals and all kinds of black magic because the same power\nWelcome to the dark side triple eight\nSix have been three thirty seven hundred extra but wait six seven three thirty seven hundred\nI'm quite Lewis you are listening to ground zero\n[noise]\nHere's what's coming up on the next edition guy sports running down on it any\nWe get our annual hunting season more cast in some cases rabbits is that some some of the show join in on the buckeyes word human radio affiliate are online\nGuys sportsmen Saturday mornings and they find Youngstown Warren life to jogging five Seventy doubled you Katie in\n\nRaleigh inside its consulate in Istanbul led to the death of journalists ... it's also announced Eighteen arrested in connection with the case and the dismissal of the ... of intelligence\nWe haven't finished show reviews or investigation but it's a\nI think it's a very important first step and it happened sooner than people thought it would happen\nIn the Washington Post columnist or the U.S resident President Trump said the U.S will respond appropriately but he wants to preserve a purchase deal that was made between Saudi Arabia anyway I guess\nIf you add the whole thing off because just for the military was six hundred thousand jobs so now we're talking about that was a hundred and ten billion you know you're talking about over a million jobs you know I'd rather keep the million jobs and I'd rather find another solution\nSome lawmakers on both sides of the political aisle doubt the kingdom's explanation for ... ... your ABC News [noise]\nOur next job Jay how do you love and just to add more stimulating talk from the old Charlie's digital studios nine Ninety nine menu not great meals one great price oh Charlie spoke\nFurnished checkup called mass uh heating and cooling and Gerard your factory authorized Brian dealer\nShowers developing later this evening to name breezy over nine showers likely through morning as lows fall into the number four days of rain showers likely for your Saturday gusty winds at times chance for thunderstorms late in the day toward evening highest in the middle fifties when you're starting twenty seven forecast started\nMeteorologist Paul what\nFive Seventy\nW. J. B. N. dot com powered by Don al ... cells scars and re service chiefs customers\n\n\n\nOh\n\nWhy\nSays there are things that I\nThings so [laughter] oh man\nHe wants me Robert on the line [laughter] soon poll by\nWay [laughter]\n[noise]\n[laughter]\nOh\nThis is\n\nNot a\nWhole monkey [noise]\n[noise] in in in\n\nAmy [noise]\nOh\n\n\nSomeone who is trying to show the world and that they're doing this that and it's based on the other hand I think oh this is\nWhat they've done way of differences aside and\nThis is how I found this [laughter]\nBeen here for two wars\n[noise]\n\nI'm quite\nYou are listening to ground zero [noise]\nKind of in the mood to Halloween alone early [noise] live a magical mystery tour [noise] you know it's not all that fun when the darkness Israel the reality is there some sort of member station\nThat has plagued us and perhaps this is why does eyed guy seems to be bleak and rancor is\nSeen all of our protest in anger negativity we may be building and creating a strongman entity or a shadow intelligence the complete our dreams with darkness see we make means on the Internet like last night we talked about the NBC\nBut we can make them in our mind we make them with words when we when we weaponized where your house your Crowley once commented that magic is just a disease of language and thought Crowley\nAlso saw magic in quantum sort of you know he's starting to quantum sort of way\nProbably rally crow if you're lowly cruelly Crowley\nAnd somebody told me you're saying wrong well Crowley crowing\nAlister crow the\nState of that magic was the science and art of causing changed to occur in conformity with will just some of everything that Crowell we had profess\nSimply magic is just the manipulation of words as the Sherman was simply a story tell her in the past writers today are like the shovel their ability to create very frightening characters is form of magic\nAnd when he's frightening characters leap from books TV shows movies and even if the leap from the Internet like slender man did its magic\nIt's a science an artist causing ... into conformity with will\nYou're able to conjure you're able to manifest\nIn the Nineteen seventies there was a group of Canadian per psychologist to aim to conduct an experiment it would create a ghost in doing so it would prove their theory that those unexplained bumps in the night or actually products of the human mind\nThere was a poster guys the expert by the name of Dr Allen Robert George over and they'd be created a group called the Toronto society for ... a ... a ... a cyclical research and um\nThere are about eight people in the group and Dr Owens wife was involved there was an industrial designer to counter housewife a bookkeeper and associate sociology student and so ah there was a psychologist named Dr Joel Wit and who also tend to many of the experiments has an observer\nWell this experiment was known as the Philip experiment and it was a film I Believe that uh did this experiment happened in Nineteen Seventy two what had happened is they created a fictional historical character or\nThrough Christian fundamentalists wants to defend the political and spirituality of the neo called aspects the United states\nThey often refer to America's a Judeo Christian nation basically nation build on Judeo Christian principles but they tend to forget\nThat when America was being established when the colonies were being founded by a puritan pilgrims at Plymouth or secrets decided this from James down or whatever Judeo Christian values were just barely being defined and the Bible that most Christians believed in hadn't even been written yet\nSo the old time conception of what\nMay have happened didn't happen the way we think\nAnd there was a lot of magic and a lot of myth in a lot of conjuring in a lot of powers that were being\nUtilized in order to establish the United states of America [noise]\nSo we are a country that's deep rooted in conspiracy deep rooted in prayer deep rooted in the supernatural and deep rooted in magic\nWhether it be good and bad orthodoxy urine orthodoxy we are what America is and our forefathers did a lot of magical workings in order to make this country happen and it still happens today so when you're warned of a dark\nQuarter within the government or thin or sinners spin around ever since the Puritans and the pilgrims and all the other settlers came to America from Europe [noise]\nTripoli six seven three thirty seven hundred that's AAA fix every three thirty seven hundred\nI'm quite Louis you're listening to ground zero and we'll be back\nRon verb Monday through friday at three news radio five Seventy doubled you Katie and [noise]\nThis story is called the ugly truth about timeshare if you think you've done your family of five are by buying a timeshare you need my help hello I'm Chuck McDowell CEO and founder of Wesley financial group ten years ago I started helping votes cancel their timeshare contracts and then the process started what's now called\nThe Tom shared cancellation industry\nTime shares the only thing that you can buy that you can't tell me how much is going to cost or when it's going to end what are you my timeshare\nYou gave them a blank check to fill out any amount they want for annual maintenance and assessment face sound crazy\nThe crazy thing is there's never ends even when you die your family is now going to be stuck with this burden stop the insanity to stay calm office now I guarantee if we can't cancer timeshare contract you'll pay nothing\nCalling for your free information kid eight hundred eighty five forty eight eighty four that's eight hundred eighty five forty eight eighty four eight hundred eighty five forty eight eighty four\nWhen I was in ... when did it become OK for men to be lazier softer fatter we need to bring the men of his country back to greatness as easier than ever with aids list male Macs a patent pending formula with an ingredient that helps boost your total testosterone promoting greater increases in muscle size\nAnd twice the reduction of body fat percentage that exercise alone plus and amazing sixty four percent increase in nitric oxide which can be handy in the gym\nAnd in the bedroom take your manhood to the max by try your first thirty day bottle free shipping and handling not ten days not Fifteen days for the full thirty days supply free when you text the word jolt\nTo Seventy nine Seventy nine Seventy not filing a formula that boost total testosterone if you'll results with ageless male Macs are too intense please decrease use for your free bottle tax jolt to Seventy nine Seventy nine Seventy nine text J. O. L. T. to Seventy nine Seventy nine Seventy nine this [noise]\n\n\n[noise] I'm Lewis who was the grounds there we go to the calls are no good Andrew in Florida Hi Andrew you're on the ground zero [noise]\nAre you doing it and um you know I've been doing that than better but you know that was the time just live life and be happy what's going on\nSo far so far the first time that I've lived with this very light and a lot of choice as it somehow and a cult all\nExistence somehow she able to communicate with somebody else or whether or not she's aware of this a lot out of ... but I stay up all of it as a as well you know I Know how she acts of all what she does every day I Know\nA little orange particular day where she just acted completely different and she was talking to somebody else I was all upset show of it as a some sort of technology but I was able to locate ... as\nIf somehow I'm a ... that is that there's people she's collected lists\nAlso have disability and it's got a freakish or early understanding it and watch\nSo there are there communicating with some strange interviews returns there's some strange for all\nIts almost she can teach called it me myself and I that's what she said she said to me and myself a user intellect about it\nBut this person or this ... whatever it is that as speaking with her that's helping her ... oh\nIt's much ... she's being told what to say is extremely ... you know I'm a philosopher in whatever way a scholar I study social dynamics psychology astrology et cetera I'm very well versed in all these elections usually\nPlenty of years I've always wanted to be able to speak with you I'm Glad you're automatic at all about right\nAnyways all she had the ability to do this now I don't think that she's aware of it and if she is she hides it very well but it was almost like the first time I noticed it was like she had this new toy and she couldn't wait to use it and she was very excited and she was kind of\nClumsy and let me know there was some or all all [noise] and then it was just it's almost as\nIf I was speaking to somebody else all understand [noise]\nAre there any symbols are signals that she uses or they're aiming because I'm thinking if you ... me myself and I she's talking about\nThe trial courtroom he's talking about the triangular three\nOthers a song actually called my echo my shouted when me me myself in a high there's also the double the anti Christ false prophet [noise] ah everything\nIs in threes be being verse three is the\nDevil may cry football's problem but of course his godfather God the sun and God only goes down to ... go ahead [noise] [noise]\nYeah there's just a little deeper it it does all the way to Adam and Eve on the daughters of eve all trying to all are trying to discredit Adam and Eve stranger again are so flu\nAmong on your you're going to you know what I'm Sorry we're going we're running out of time they listening to the program but I think we're going to cover what you need to hear [noise] okay I promise me but I mean if you lose me it was on the ground zero dot com listen to ground zero dot com who might have got [noise]\nBush definitely thank you so much\nThank you for calling I'm going to be here we're talking a lot about this and I ... I mean he's writing to go\nRight back with more ground zero\nMessaging data ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more text prepare to seven nine six four or five\nThat's P. R. E. P. A. R. E. to seven nine six four or five star\nTo your online MBA information management or business analytics master's program from the W. peak carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line text prepare to seven nine six four or five\nThat's P. R. E. P. A. R. E. to seven nine six four or five\nNews radio five Seventy W ... young south [noise]\nFrom ABC News [noise]\nOntario holding our how long has he been dead that's one of the many questions U.S officials have now that the Saudi Government has admitted that journalists ... giant and its consulate in Istanbul and that takes another question how the U.S response just\nAnd that'd be attempt to solidify eight victim providing a solid\n... medical backdrop or a solid religious or spiritual back drop but it's all encompassing and strong and so the agenda\nIs to bring about a global spirituality one that has the same familiar feelings the same familiar spiritual trappings but what he does is it ... what is known as the loose the ferry and he may not us concepts the idea of a woman should\nSee the old time conception that is still held today university among Christians is that the Bible is the very word of God verbally dictated by the lord himself and infallible and every statement therefore\nWhich consistency I Want to propose exit is twenty two Eighteen that says thou shalt not suffer a which to live and that was made the basis\nOf the persecution of which is with all of its horrors and burning a mistake and things I read this scripture was the chief authority for the execution of which is everywhere\nAround the times the Puritans and round the times the pilgrims and it is only a modified conception of the Bible that can released the church from the obligation of which I think the day to the Catholics had the ... and eat it could change the meeting over time to the word\nOf the big change which it was replaced by source wrist in hopes that it would affect the authority\nOf the commandment into some it's not changed and the meeting at all is just some\nIt just partly why witchcraft I think it's become a send them you guys are most Christians however today we're seeing a mix of both religion and which trapping practiced openly by women and men and a few hints that perhaps some of the old pagan imagery\nHave not left some of the major churches and\nAnd so tonight I thought it'd be interesting to explore\nSome of these themes and and the reason why is because well I mean last night I think kind of a tip a hat to it when we were discussing the ... the un PC and how means in vigils means something in how they're being used to it kind of a ... a form of I guess rich ... kind of form of witchcraft or new form\nOf witchcraft which I think a is most certainly a prevalent today so\nA new book that I have in my possession a fantastic book called sorcery indication of strange this\nIs written by Thomas shirt and now we've had Thomas shirt and on the on the show before he lives in Ireland these amazing we've had him on the show to comment on all things called all things bizarre and I think it's really a pleasure in our ... ... it's an awesome opportunity for us to kick off the season to talk with Thomas about his new book about some of the things that are changing\nUh within the scope of spirituality mainly leaning towards the cold spirituality Thomas shirt as an author artist and filmmaker from Dublin\nA dumb in Ireland you came to international a recognition twenty eleven with the book\nPuzzling people the labyrinth of a psychopath years since he's written several more books that has made films on topics such as social engineering political and corporate pathology and on the called ... surrounding the emerging years of the third Reich in recent times his work\nIn the ancient mysteries and sacred or locations has been featured in some of the world's largest media outlets and he's a highly sought after public speaker around the world we have him tonight so I'm a shirt and welcome to ground zero\n\nI I'd like to be here again it's good to have you and like I said ah it it's it's just amazing to be able to have you in such a time I mean\nAs I was explaining there seems to be like this shift in attitudes towards I guess you could call it conjuring attitudes towards what would be considered darker magic or some of the darker arts why do you think that this is starting up now why do you think there's a newfound interest in this\n\nI think people will be brought these ideas for for all kinds\nOf reasons I think you'll have people who will be drawn to choose things like social fears there is a a sense that there's an insecurity within society you see that happening in Brooklyn tomorrow at these these wages are going to bind cabinet there's other people\nWill look at things like you know\nQuantum physics and these ideas that reality is malleable to a certain extent and that\nThey want they let you want to test these ideas and they want to say well you know is you know is the five cents reality is that Malia bill is it\nKind of change it cannot ultra towards my will and still the only effective mechanism out they had to do this as things like magic and so people are drawn to us for that reason as well I think also there's ... there's a kind of the maturing going off the ... that it's almost living in the age where\nYou know people look the especially in recent years we've seen like the behavior of the major religions in the crimes of\nThe Catholic Church and other organizations have been exposed quite readily and people have set themselves with these guys are on the polling things and here they are telling us that you know which ... evil so\nIt'd evil really concerned a source it's coming from and then I I think that's got a lot to do it I think a lot of people have a kind of a hunger now to see if they can test the boundaries of reality using their will\nAnd it's becoming more apparent that they can uh I was just talking last night\nWith Chris Jones Riggio we were talking about this new medium that is on the Internet right now but uh certainly is causing the the left wing of the United states to be disturbed because they say it's humanizing it it's certainly\nA it's called the NBC or the bid on playing character meaning they did the symbol of those who sound like they are repetitive Lee speaking from a script and it's very effective and I was saying to ah Chris last night I said isn't that interesting that this character\nKind of resembles ... me and it seems to be very powerful it's just a simple silk like looking character grand color very simple way drawn but it's supposed to be there is some sort of a a I guess you could call it a ... or some sort of ... that is spreading and certainly going viral and this is a form of magic\n\nI been taking a great interest in this as soon as it came to fruition on the electromagnetic spectrum last weekend I knew this was going to be something special\nThe like I I've been watching this whole thing around for ... the the way these people have been using them ethics or a few years now and we are in a different world there's a basically\nA a generation of\nInstinctual chaos magicians who are using things like ... to actually mold reality in terms of the political structure now there Sam ... is ... is quite fascinating and not so much in its was putting out there but the reaction to it\nIt's it's it's tapped into something very visceral and frightening in deep within the people it's been it's been aimed act it's almost like the you know that that the judgment is the mirror and the mirror has been held up to these ... these kind of like get\nCultural relaxes repeaters or whether you want to call them and ... they're not happy they're not happy because they wanted to believe they were special and suddenly they're realizing that the only thing special about them is that they're probably just like androids\nYeah and that's the thing is that\nSaying oh the humanizing it hurts us but you're right it's like putting a mirror up to them and say look at what you're saying look at what you're doing look at what you're acting upon\nAnd it just reminded me when I saw that as a you know a several characters that have just been ... characters that have been effective in the past like the ... that was discovered\nA that was actually created that are probably a a created the among kill it but he had a uh the uh the one\nWizards at the time holding the staying with the ... but I saw the nail ... I thought oh my God this is a representation of the founders penetrating\nAh basically it's about ... it's about uh the male or female divine feminine being pushed by the mail and and what we're seeing now and as you said earlier about the witches and the rising of which is the feminine nature power if for some reason politically we have this gender fight\nBetween the power there's even a TV show called up American\nHorror story we're right now the ... the fight happening in the TV show is between witches and war locks and whether or not a character by the name of Michael he's the Supreme which or the anti Christ said it's amazing fight because the witches are fighting amongst each other as to who is about to lead and we have the same problem now with\nThe which is they want to curse Kavanaugh and we have the Catholic Church coming forward and say well we're going to reverse this person it's like\nA a huge a Cold War or or cyber war but it's going on right now we're going to talk more about this thing that the pope had and or some other things that are most certainly are showing themselves as ritual is typical symbolism said Joe and also manifestation\nComing up on ground zero Thomas shared with us tonight Tripoli six seven three thirty seven hundred extremely six seven three thirty seven hundred I'm like Louis you're listening to ground zero and we'll be back [noise]\n[noise]\nHere's what's coming up on them next to the Buckeye for ... for the ban on it and\nWe get our annual hunting season more cash than some typical taking rather than some of the show joined on the book I worked in radio affiliate are online at ...\nGuys sportsmen Saturday mornings and they find Youngstown Warren place to walk five Seventy doubled you Katie and I'm\n\nA Saudi Arabian government is now admitting Washington Post columnist or mocha showed he died inside its consulate in Turkey now Eighteen people including high ranking Saudi officials have been taken into custody\nIt was only about an hour before the Saudi announcement that President Trump said there was not yet enough information about what happened to ... to decide whether sanctions on Saudi Arabia where appropriate\nBut he said hey if they were that he would not act alone will have Congress involved the president indicated he's reluctant on sanctions because impacting the U.S Saudi relationship could hurt the U.S economy and like stoning ABC ...\nPresident Trump commenting on the caravan of migrants that's been pushing its way toward the U.S warning that a Mexican authorities don't stop them heal some of US military to the border\nHe says some bad people coming through there these are babies are little angels coming into our country Trump\nBy the defense round table friday evening Luke air force base in Arizona the mega millions jackpot numbers were drawn waiting to see if there are any winning tickets taught and ABC News [noise]\nNext up data twelve [noise] just to hand more stimulating talk from the old Charlie's digital studios nine Ninety nine menu nine great meals one great price oh Charlie's [noise]\nDon't feel left out in the cold this winter called Massey heating in Gerard your factory authorized Brian dealer\nShowers and developing later this evening snake breezy over nine showers and likely through morning and lows fall into the number four days ... hours likely for your Saturday gusty winds times chance for thunderstorms late in the day toward\nEvening highest in the middle fifties when you're Seventeen twenty seven forecast and meteorologist Paul what's now forty eight\nFive Seventy telling you Katie N. dot com written by John ... and Don al ... dot com telling American best selling rat [noise]\nThat are way too awful my which way in the room and rice and beans will have to World Bank [noise]\nCome to that now or something\nI Believe I dont future [laughter] [noise]\nNow burning flashing [noise]\nFrom what I [noise]\nA\nWins\nOh oh\n\nI was going on with my grandma and grandpa transformed salt from North Korea [laughter]\nHarm [noise]\nAround more heart\nHarm [noise]\n\nStrong aren't [noise]\n\nOptimal [noise]\nOr [noise] there's more or less\nThat was I was on that side of the time engineer on the other day in the making of an illness [laughter]\n\nI'm like Louis [noise]\nYou are listening to ground zero the numbers calls and I believe six Seventy three thirty seven hundred that's AAA fix every three thirty seven hundred but I Thomas shared it is with us we're so glad to have him [noise] I used to be with us today from Ireland as we talk\nAbout what's going on of course a what we were talking about earlier where the pope apparently a was at a Senate and uh he pulled out the staff it was a very familiar staff to those who are pagan to those who are which is a staff is\nCalled the staying and a conservative Catholics were appalled\nAnd the post choices staff as evidence that something scary something diabolical something which she was going on at the Vatican\nAnd so you know while most folks do use a what is called the ... a pastoral staff that uh has across the top um\nThis one was different this one uh looked they is Thomas committed it or is it it seems to be the staff that represents a the the nail support staff was there to the pope had nail going through it and when you look at the iron nail in the staying\nIt symbolizes a lot of things uh Thomas was saying that a ... that includes if ours\nAnd that it it basically unites the part in bloom is the triple motif of a threefold serpent teen to lurk came Nick uh and uh we were hearing earlier\nThis ban a book called the first hour saying that his wife\nWas involved with some sort of a a serpent teen or women rising up against against the men or were rising up against avenue serving Jean represents the devil the garden\nThe gifting Adam and Eve were deliberating illuminating words no you shall not by the death for God's ... know that in what they saw however you show eat the forbidden fruit theorized shall be open and you should be as God's doing good and evil so you look at the ... which refers to earthly power\nWho sourcing symbol is the serpent but it's deep in the earth's when you're talking about Canucks power that comes from Cain and so um\nWe have a Thomas shirt and back you know it seems to me that and this was said uh this has been said I Can't remember where I heard it\nThey wouldn't Donald Trump was elected president\nAnd Hillary Clinton was not elected president United States this\nBasically jarred or at least\nA peak the rage of the feminine power and so the feminine power had to regain a a place and so now they're fighting for that power again is this why you think or is this could be why a witchcraft now is is being a actually is having a renaissance\n\nThomas that's a good point I never thought about that one can you hear me okay I can hear you fine thank you yeah go ahead can you hear me uh-huh yeah\nYeah I never yeah that's an interesting point I never thought about that at the thing is that this witchcraft that we're seeing like in Brooklyn tomorrow so on it's not\nIt doesn't come from a healthy place it doesn't come from a desire to restore power it doesn't come from ... in much the same way that Hillary Clinton wasn't particularly email press the A R in terms of how she operated herself thing", "show_name": "Ground Zero with Clyde Lewis", "year": "2018", "city": "Youngstown", "day": "20"}