{"month": "10", "state": "GA", "station": "WNGH", "content": "And beyond fishes GB radio online at ... news dot org I'm Tom Barclay it's eight fifty nine coming up next it's the green\n... and beyond fishes G. P. B. radio on line a G. P. B. news dot org I'm Tom Barclay it's eight fifty nine coming up next it's the green island radio show with area down who followed it ten by the A. S. O. N. G. P. B.\nC. D. inspired this piece by Atlanta composer Michael Curtis everything last forever\nIt's an ironic title [noise]\nWell here the Atlanta symphony perform this plus Leonard Bernstein's Jeremiah symphony Beethoven's emperor piano concerto tonight at ten [noise]\nI'm Sarah that's joining the ads on TV [noise]\n[noise]\nWas Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nGood evening a welcome to the green island radio show\nHost Terry oh don't our producer is done get it works on the green island is a production of Georgia Public broadcasting quarter here in Savannah Georgia nice to\nBe with you this evening we got quite a variety of music for you so we invite you to sit back in Europe ... get your beverage does your I'm enjoying the next hour with us here on the green island\nWe kick things off with a tune from Eileen I ever as I was the lead fiddle player with the original river times back in the nineties\nAnd this is from her album wild blue it's titled the rights of mad they want to hear from the Scottish bond ... the lovely voice of camera Matheson and she was saying grace and pride\nFrom England was half airport convention the crowd revisited from the album Nineteen sixty seven to ... to ... to ... be thirty fifth anniversary albums obviously and then we finish off once again with Eileen Irish actually brings us model bone chapel but first up\nHere's the rights of mine\n\nHere's the rights of by\nOh oh\n\n[noise]\n[noise]\n\n\nOh\n\n\nOh\nI Am honored\nDing da ding ding Monday risk in\nThing that caught my\nOn the phone and was going\n\n\n\n... ... ...\nAnd the\nYou know in a ...\nSugar James ...\n\n\n\n[noise] [noise]\nAre not all Hallows ... make a key piece takes\nLowered the brand\nThem on ...\nMonday Night on it for\nTiming Don Young\nThe green\nNews ...\n\nCapra Kaylee there with the song the America of being a little gym before that there was titled the ... his ...\nWe had the group paid I with the trip we took over the mountain beautiful piece unless you have to underscore our ... our blessing of the week Halloween blessing from Maureen McKay but of course it is coming up to Halloween we hope everybody has a wonderful Halloween safe and happy\nThey sound before that from ... that was big on these pipe appeared on the war Eileen Irish with two digs cronies and Jackson's and of the top of that said ... convention with willow creek\nAnd we continue to do with another short piece the first is very suitable for this time of year ... very haunting haunting I don't know we are just\nSubliminal messaging right there it's called dear Irish boy performed by I mean I Wish they would hear a song tied to the islands and the short June the youngest daughter\nYeah it's called dear Irish boy for but I I didn't hear a song tied to the island on the shore to the youngest daughter both from Saint Paul ...\n...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n... Mm\nMm Mm\nMm\n\n\n\n... ...\n\n...", "show_name": "Green Island Radio Show", "year": "2018", "city": "Chatsworth", "day": "29"}