{"month": "10", "state": "GA", "station": "WNGH", "content": "Serbian court dealer beyond this is Dee Dee Dee radio on line a gp be news dot org I'm Tom Barclay\nSerbian court deal and beyond this is GB radio online at ... news dot org I'm Tom Barclay it's eight fifty nine coming next the green island radio show with Harry ... who followed a ten by the A. S. O. N. G. P. B.\nHe said in art in life I Am at the mercy of spontaneity\nHad to compose not would come\nTo happen one summer when he was trying to complete it seven symphony was stuck until he got into a real them\nFirst stroke or the or the rhythm and character at the introduction of the spring into his had a few weeks the whole thing\nHere in the Atlanta symphony say to finish the work tonight at ... ... [noise] [noise]\nOf Ninety seven point seven FM W. A. G. P. B. and WG Bebe HD rural part of Georgia Public broadcasting radio network [noise]\nGood evening in ... this is the green island radio show\nMe a host Terry owed on our producer is done get reports on the green island is a production of Georgia Public broadcasting recorded right here in Savannah Georgia\nGreat to be with you once again this evening on on Tonight Show we're going to hear some music from Scotland would hear the polling McKenna band and Brian McNeil from Ireland with your donor country I'm from England the beautiful voice of Kate roast beef so sit back and enjoy the next are with us here on the green island\nLet's begin tonight up and she got a new one of my favorite traditional binds the polling McKenna bend\nOregon here three piece is the first is a song called terror time to second an instrument or Darcy an errands\nAnd the third another song again for Greenland a poll has got such a wonderful wonderful voice was a pretty heavy Scottish accent so some of the words might not be as clear as one would expect but\nIt's one of those cultures things we go on and don't to England where the song from Kate rush to be called the good men and we finish off back up in Scotland would primate need one of the founding members of the battlefield band and a multi instrumentalist\nThey called the good mine and we finish off the backup and got in with Brian McNeil one of the founding members of the battlefield band and mostly instrumentalist is going to pay Jamie come try me but first up here's Paul McKenna no ...\nWell yeah\nKnow but I can well\n... Ron ... ...\nI'm ...\nI'm On that then you\nWell we know for a way\nThat the data ... and ... na\nHe\nOn a green beans\nNo what got me in jail\nA air ... well see I don't\nJust pushing swelled on\nSmall bombs world will be ...\nA standing you\nWell being for ...\n... ...\nTina\nMm\n\nNa\n\nNa\n\n\nFrom his album the road never questions that was Scotland's Brian me neither\nAnd the piece was called Jamie come try and me before that case was beside the good ... and other top of the show called the kind of a bind with again for Greenland Darcy an errands and Tara time and you are listening to the green island radio show here on G. P. B.\nBut Ted over to Ireland now with a couple of pieces from donors plenty of course he's part of the famous plenty musical family touched Brooklyn Tommy make them who made it very very big in New York back in the sixties and do all of a play two two inch shorter Guerra Diana\nWhich is a translator shown or Dwyer of the lens ... barn dads\nThey want to hear another song from Kate rugby underneath the stars Brian McNeil played heroin and we finished off with an unusual an interesting song which some social commentary performed by the poll McKenna band it's called silent majority but first here's darn touchy what's shown over here in Atlanta\nOn ... ...\nMm Mm\nMm\n\nMm\n\n\n\n...\nThe ... ...\n... ...\n... ...\n\n...\n...\n\n\n... ...\nThe\nGrade in\nThey did a\n\n\n\nStreet\n...\n... a\n...\nThe ... by\n... my father\n\nAnd then you read in the\n... ... ... ... ...\n... do\nHave you know ...\n... a genius unlike peak pay light headed band\n... a genius on peak tales quite headed ban could know of aged ages speak that mocks the story in Japan die long duration makes our lives team\nBut so many hours I'd like it to the bees prayer highlight a most stupendous towers those towers that was the it to be gone you create new concourse sway\nLike their shadows in the San I've seen that swept away by steadfast stomach having a light on like life's liquor span looked down\nAnd mentor on the pride of perishable Matt\n... Mm ... Mm Mm Mm\n... Mm\nNa\n[noise]", "year": "2018", "show_name": "Green Island Radio Show", "city": "Chatsworth", "day": "08"}