{"month": "10", "state": "PA", "station": "WVYA", "content": "Made a gene just last\nDo not\nSee him saying\nRanger mayor\nThat is Nick swells from Canada the um called worker\nAnd we heard St ... first of all one shot followed by before the summer's says goodbye and just now one more round the bend music from Nick swelled up and I see that's W A L E S\nA currently living in a court Edward in Canada and uh when he's not playing music he works as an electrician I guess hence the name worker\nOn the album next whales you're on WB I eh his website as an I. C.\nS. W. A. L. E. S. dot com\nAnd um you could find in more information that we can actually it's ... it's about a twenty eight minutes\nShort legs record it and that's our sampling of new recordings will have more new\nMusic tomorrow night between eight and eight thirty a mixed bag your program of musical discovery introducing you to new music every day we got some new music coming up at the moment its homegrown music the debut of the band called mammoth indigo recorders here at the w._b. out a studio so stay with us for that\nThis is W. B. I. eighty nine point nine up M. W. B. I. H. one scratching Wilkes Barre his [noise] we're in Williamsport WTY eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm pop back a WPN a United at one point five about them streaming live at W. B. I ain't got\nWe have a translator and collect summit at Ninety three I found\nYour arts any information station listener supported public radio W. V. I. S. [noise]\n[noise] Hi I'm Chris daily host of life from here\nYou know they say this country is more divided than ever but there's one thing we can all agree on that the people just a little bit mentally I Hope you'll join us for a glorious evening of music and comedy that just might bring us a little closer together\nDuring the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with the ... the war in treaty Mr Gabriel ...\nSaturday Night at six Sunday night at eight and a W. V. I. A. F. N.\n[noise] [noise]\nWilliamsport simply or to conduct by my store Edelstein opens October sixteenth with works by rush ... and Brian\nGrammy nominated and chart topping violinist Caroline Golding plays Chuck ...\nThat'll Stein opens October sixteenth with works by Racine each ... and bronze\nGrammy nominated in chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nClaims for symphony October sixteenth at the humidity outsider five seven zero three to six twenty four twenty four or Williamsport symphony dot\nOrg [noise] sponsors who the capital group at my coming college\nHere is the weather forecast for northeastern Pennsylvania mostly clear skies tonight with ... and the upper thirties\nFor Wednesday partly sunny with a chance of showers in the afternoon hides in the upper forties\nA chance of rain forty percent for Wednesday night partly cloudy load in the lower thirties Thursday mostly sunny with hides in the mid forties Thursday nights mostly clear lows\nIn the lower thirties on Saturday or friday rather sunny with hides in the mid fifties friday night mostly cloudy and fifty percent chance of showers lows in the lower forties Saturday mostly cloudy at fifty percent chance of showers hides in the mid fifties\nSaturday nights mostly cloudy with a chance of rain or snow showers would lows in the mid thirties chance of precipitation forty percent and for Sunday partly sunny was hides in the mid forties\nAt Wilkes Barre Scranton airport forty six degrees thirty nine in ... in the amount Pocono forty eight in Allentown in forty seven in Williamsport [noise] this is mixed bags\nGeorge Graham time once again for homegrown music the exclusive feature we bring each Tuesday at this time spotlight in the ... regional artists in performances from the w._b. out a studio tonight we're going to feature a band we've who's recording we've been playing for some time now since April on the show the band is called mammoth indigo\nThere are a kind of alternative band are actually quite progressive in terms of their sophisticated arrangements\nUm they're from various locations uh Richmond, Virginia they're touring all around the country paid a visit and I guess they're kind of\nIn the process of relocating to the west coast so it's a good thing we got a chance to work with them before they uh they left our area\nUm the group called mammoth him to go and uh the group consists of ... hours on the guitar and lead vocal Dan McDonough on the guitar keyboards vocals and percussion Andrew vogue and is featured on base and backing vocals and Eric Singer\nIs on drums Cody is the lyricist for the band and the rest of the band\nA combined to write the compositions that you'll be hearing in this session has mentioned they have an album out called Wilton some of his songs up here and somewhat different form on the album so here they are recording era WB I ate\nWe'll start with a piece called Palin Jerome than one called whiskey king than undertow than flowers in the basement then deep blue\nThen its own with a Cody Bowers performing solo called country and then with the full band again a track called full bloom so here is a band called mammoth indigo recorded here at the w._b. ice studios\nWith the debut of the band on our series and we'll start off with a tune called Palin drone [noise]\nJohn ...\nDamn jobs ... jobs in and out of ...\n... no no\n\n... na\nNa\nNa on and on and\nAnd ...\n\nNa na na\nOn John ...\n\nAnd\nMaybe\nAnd maybe\n\n\n\n[noise]\nShould be\n...\nA\n\n\nAnd why not\nWhy not\nWhy don't they are in the eyes out and [noise]\n\nIs\n\nA\n\n\n...\n\n\n\n\n\nShe doesn't\nAnd then she started\n[noise] [noise] [noise] to\nBe a\nAnd ...\n\n\n[laughter] [noise]\n\nToday that said they\nJust you know she said she she she\nShould ...\nShips\n[noise] when\nYou're older than her yellow\n\n\n\n\n\n... ...\n... ... ...\n...\n... do you\nWatch the new\n...\nFrom ... to your\nOr ... no\n... ...\n...\nReally ...\n...\n...\n...\n...\n\n... do you know ...\n... ... your ... your\nBrain your ... your ... to\n... ...\n\n... ... ... ...\n\n... ... ... ... ... ... ... ...\n... what\nOr ...\n... ... ... ... where are you\nWhat to\n\nDo a lot of the the the ... year old ... ... ...\nWrong own mouth and\nMay not allowed to do\nAnd you\nWhen I went out on the show\nAnd mind your own\nThe\nAnd your training\nAnd\nAnd try\nAnd what to do and\nThat should\nBe the\nNa na na na na na\nNa na na na na na na na\nNa na na na\n\nNa na na\nNa na na na na na na\nNa na na na na na and\n[laughter] and she said\nAnd\nFrom\n\n... age ...\n\nShe she speaks shoo shoo shoo shoo\nShoo shoo shoo shoo shoo shoo\n...\n...\n... and\n...\nAnd ...\nAround and do you need\nHuge as they get too long\nBe there for a run in to get\nLimb I ... a long\nTime\n\nThe and\n\nThere\nBe\nTo\n\nThe ...\nWe", "year": "2018", "show_name": "Homegrown Music", "city": "Williamsport", "day": "17"}