{"month": "10", "state": "PA", "station": "WVYA", "content": "[noise]\n[noise]\nThe\nScanner\nNo\nYou can't you do your thing and I'm\n...\nDo I want to\nThat it seems like from a band called mutual benefits\nYeah one of the one person projects Jordan Lee from New York City or the new album is called thunder follows the lights and we heard three ... first of all written enlightening followed by storm cellar hearts\nAnd just now shedding skin I knew album from mutual benefits yup some dirt followed the light at San highest records P. I. S. record that's are tackling a new release it more new recordings tomorrow between eight and thirty a mixed bag your program of\nMusical discovery introducing you to new music every day but coming up we've got our music segments of the week the time it's an attack mar recorded here at the w._b. I studios back in two thousand nine so stay with us for that\n\nYou know nearly ... ... even ... ... ... again you know their mind within range in less than ... not going to hand and rain and [noise]\nAll mania layer and\nLike I knew in in your ... and I mean we are now in American Pie by Saturday Night Monday Night today on ... I\nAm that this is W.\nV. I. eighty nine point nine FM W. V. I. H. D. one slanted we'll screen building in Williamsport WTY eight eighty nine points that I Am in Mansfield W TI eighty eight point three I found out at like while I'm pop back\nWPN you Ninety One point five FM stream live at W. B. A. dot org we're in Allentown in Ninety nine point three any Bethlehem at one of five point seven member supportive public radio W. V. I. okay\n\nHere's the weather forecast for northeastern Pennsylvania from WBAI\nTonight showers with a slight chance of thunder storms in the evening than showers are likely after midnight patchy fog after midnight some thunderstorms may produce gusty winds and heavy rainfall\nOh there was some flash flood watches and warnings in effect earlier\nThis evening a Los tonight will be in the upper fifties chance of rain near one hundred percent for Wednesday patchy fog in the morning mostly sunny with high in the upper sixties on Wednesday nights partly cloudy lows in the upper fifty on Thursday partly sunny with the chance of showers and hide in the mid seventies\nChance of rain forty percent Thursday nights mostly cloud in the evening than becoming partly cloudy with Lowes and the upper forties\nFriday partly sunny with dogs in the upper sixties\nFriday night mostly cloudy with Lowes around fifty and on Saturday mostly sunny skies with hides in the mid sixties nine PM at the Wilkes Barre Scranton airport sixty six degrees sixty in the Poconos Seventy four in Allentown and sixty nine in Williamsport\n... mixed bags of George Graham time once again for homegrown music the exclusive future we bring each Tuesday at this time\nOutlining the town to regional artists and performances from the w._b. I studios until I could go into our archive for a nice section from two thousand nine with a a classically trained singer songwriter and a dad mark\nI'm I'm a ... at the time released a um an album um let the waves come in threes at around this this time and later she recorded another album which featured some of the songs that she did for this session I'm a on that are in different versions\nUm she was a attended the a ... school of music are headed rigorous classical program there but also a a her piano teacher when she was growing up daughter jazz standard so she appreciated that then she was a big fan of ah of um a Billy Joel\nAnd I'm not a lot of instrumental music but she said it was from age twenty that she began to write some lyrics to go with or\nA melodic pieces and er so she's been a writing songs lately uh she hasn't had any recordings out much sense but she's been busy on Broadway she is a pianist in the I'm a working uh with the musical waitress featuring syrup or relatives\nFrom um the schools\n\n[noise] [noise]\nMm Mm\n\n\nJake my body and you know\nThat just\nYou always think oh this century um they said to me to see\nAgain\nOh me too me me to see\n... ...\nMe see to\nMe to see\n\nA\n\nIt is just the one of my mother on the top notch\nThe wind come in\nFor\nA week Scott you're changing the link to find something on the ... the no match\nFor you\nTo be nice to meet when she\nWas she in an era where any chance to see matrix\n\n\nWhere no one you know that's going to\nThat you don't want to put in the book bags you know what to\nDo so much money they make\nThat we should do when you're trying to do some ...\n...\n... ...\nIn\n\n\n\n...\n\n... ... ... ...\n...\n... ... ... ... ... ... ... ...\n... ...\n... to me being mean yeah\nThey don't know ...\n... ...\n... to me being mean yeah Mm Mm\nMm ...\n... when they need not lead Mm\nMm Mm\nMm Mm Mm\nMm Mm Mm [noise]\n...\n...\n...\n...\n... named ...\n... ...\nAnd the ...\nThen you may have been\n\nMm\nMm\nMm Mm\n\nThank you and the ...\nAnd I mean in ...\nThank you for the main ...\nAnd ...\n\n\n\n...\n...\nThe numbers ...\n\nI began to make\nThen again\nWe\nMake make cream\nIn training\nCan we be oh ... I'm\nLike no I'm In\n\nA with young close who was our guest on homegrown music also a few years ago he has just released new album which is called in tandem are going to play the track from the moment but ah we featuring his two thousand eight ... music session young close then on the sixteenth of October in all new segment with\nThe band called mammoth indigo ...\n... are also making their debut on homegrown music no good to alternative rock band\nOctober the sixteenth mammoth indigo then is blue grass on the twenty third of October with the coal town round hers and an encore from two thousand Fifteen underground hunger music exclusively spotlight in the town was the regional artist and performances\nFrom the W. B. I. A. studios you're doing to WPRI ... eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre hazel tune WTY eight eighty nine point seven if in Williamsport\nDouble duty I oh eighty eight point three FM means ... Mansfield N. W. P. A. U. Ninety One point five FM palm I return trip with a translator in ... three point five and Bethlehem at one of those five point seven and on the Web at W. B. I. A. dot org\nSupport comes from customs container solutions a manufacturer of customers standard roll off front in dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com human beings I made up of just\nFour letters a G G T the same four letter that every speech on the planet has billions of letters of code if you had every page filled with ease g's and T's you'd have eight hundred dictionaries worth of genetic code\nAnd that code decides who we are guy Raj at story next time on the Ted radio hour from NPR Saturday at noon or W.\nB. A. up at this is mixed bags George Graham coming up tomorrow night on the program we have our weekly album resume and Sunni recording from Madeleine Peru\nWho's now kind of a veteran actually her first album came out to twenty two years ago uh she's out with a new one called and some and it's mostly original songs and that's tomorrow night at night on mixed back\nWell let's get into our closing said with the artists who ah have been on homegrown music and here's the gentleman who's session will be running next week on the show young close who was just released a new album called intend to ... and this is a piece called win this fight music from beyond close you're on WB on a [noise]\n... ways to [noise]\nCome on me\nI Know this being there [noise]\nI can get in there and [noise]\nAh Jay Lynn ...\n...\n\nKnow do\n\n\nNa you go and be no way\n... a game called law and now the way that\n\n\n\n[noise] [noise]\n[noise]\n...\n\n\nDo as much\nWe speak candy corn\nNice to meet you can", "year": "2018", "show_name": "Homegrown Music", "city": "Williamsport", "day": "03"}