{"month": "10", "state": "CO", "station": "KRCC", "content": "Moscow pay the price for targeting an elderly retired spy with a deadly nerve agents but what does Russia up to ... and who's next I'm Joshua Johnson the screen Paul fires next time on one day from W. A. M. U. at NPR\nOne today at nine AM Ninety One point five feet or she\nLived election year you can count on to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsroom we bring you insightful reporting to help you understand the issues and the candidates you make it possible by donating at K. R. C. C. dot org thank you\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. la hunter ... am K W C. C. F. M. woodland park streaming a day or C. C. dot org\n... good morning who said pipe bombs to prominent figures three we're central locations in New York for suspicious package was discovered this morning to New York governor Andrew Cuomo on MORNING EDITION from\nMany times we have to unify those are the words of President Trump as the bomb scare unfolded later at a rally in Wisconsin He again took aim at the news of the\nAnd I'm Noel King also this hour in New York attorney general is suing Exxon Mobil claiming that oil giant mix\nYou took aim at the new ... and I'm Noel King also this hour in New York paternity generally suing Exxon Mobil claiming the oil giant misled investors about the costs of climate change\nAnd it's super typhoon swept across the northern Mariano islands to devastating effect\nWill take you to manila for the latest news\nIt's their job or twenty fifth\nHappy birthday to sing or Katy Perry thirty four years old today and the news is next\nLive from NPR News in Washington on corporate Coleman since Monday at least seven suspicious packages containing pipe bombs have been sent to several democratic figures and to CNN's bureau in New York and here's Emily Sullivan reports\nPackages were addressed to big time democratic donor George Soros us representative Maxine Waters former attorney general Eric Holder and former CIA director John Brennan care of CNN [noise] they were also sent to former secretary of State Hillary Clinton and former president Brock Obama\nThe packages were similar in appearance and all had to return address of the office of us representative Debbie Wasserman Schultz the former Democratic National Committee chairwoman the FBI says it's possible more packages were mailed to other locations\nThe agency is testing the packages in Quantico, Virginia laboratory and called it an investigation of the highest priority\nEmily Sullivan NPR News Washington\nMeanwhile the New York city police department confirms to NPR that a new suspicious package has been discovered in lower Manhattan it's now under investigation\nStock markets in Asia closed mostly lower today NPR's Rob Schmitz reports from Shanghai they followed a bad day on Wall street Wednesday when the Dow Jones industrial tumbled more than six hundred points Japan's\nNikkei index fell nearly four percent and Hong Kong's hung song index dropped two percentage points led by declined and semiconductor makers and other tech shares\nThe Shanghai composite ended the day up slightly despite being down thirty percent from beginning of the year ... in us markets has weighed in Asia for some time as trade tensions between the U.S and China rise\nNPR's Rob Schmitz in Shanghai\nHealth officials in New Jersey are working to contain of viral outbreak that's claimed the lives of seven children\nFrom member station WNYC Rachel holiday Smith reports Eighteen cases of the virus had been confirmed medical officials say the ... virus is not much of a risk for healthy people as it might only bring on a cough or paint guy\nBut for pediatric patients at the ... Center for nursing\nMuch of a risk for healthy people as it might only bring on a cough or paint guy\nBut for pediatric patients at the ... Center for nursing and rehabilitation the virus has proven deadly the facility provides long term care to chronically ill and disabled children New Jersey's health commissioner Dr Sharif el in the hall says his agency is working closely with the facility that specializes in treating fragile patience\nSad reality is there aren't that many so it is better able to care for\n... says the health department will be on site until the outbreak and for NPR News I'm Rachel holiday Smith\nThe joint typhoon warning center says super typhoon YouTube has crossed over the Mariano islands us territory in the Pacific ocean\nIt's current top sustained winds are one hundred sixty six miles per hour although there were reports the winds were much stronger when they passed over the islands reports say there is catastrophic damage although there are no reports of deaths or injuries storm is now moving toward Japan\n[noise] this is NPR\nThousands of Central American migrants arresting in southern Mexico and many of them plan to resume walking today toward the southern border of the U.S\nPresident Trump has vowed to close the border against them some migrants have applied for asylum in Mexico it's believed a few hundred others have accepted Mexican Government offers to return them home by month's\nBoston is taken game to the world series at home in Fenway Park the red Sox defeated the Los Angeles Dodgers forwarded to from member station W. B. U. R. Shira Springer says Boston hold two games to none lead\nThe gains big hit with a single to right field by the red Sox JD Martinez the hit with the home team ahead for good and because it came with two outs and the fifth inning and kept a three run rally Martinez said it showcase the red Sox relentless off and\nShe ... she previews and be on your back you know finally get guys on and just keeping the London\nMeanwhile on the mound Red Sox started David Price got the when he grounded his way out of the bases loaded ... in the fourth and pitch six solid innings allowing only two runs on three heads game three takes place friday at Dodger Stadium in Los Angeles for NPR News I'm Shira Springer in Boston\nThe Cleveland Orchestra his fire to musicians after an investigation said the men committed sexual misconduct against female colleagues and some students one of those dismissed is the concert master William provable he held a position for more than Twenty years\nFemale colleagues and some students one of those dismissed is the concert master William proof so he'd held the position for more than Twenty years in a statement the executive director of the Cleveland Orchestra apologized to victims on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future or below where books are sold\n\nSupport for Ninety One point five K. R. C. C. comes from local organizations who want to reach a well connected audience then discerning about noon and culture\nAnd how they spend their money becoming a corporate sponsor of Ninety One point five care the mean your brand stand\nOut from the ground for more information about underwriting called Jeanette seven one nine four seven three for a\nWhen folks come up and tell us they heard is on the radio my first reaction is hey we should hang out\nIn a way it's a filter and it puts us in contact with people that we would probably want to do business with and it's a very effective way of doing that [noise] my name is avenue Barker I'm the c._e._o. is now the guy\nFor more information on underwriting with Ninety One point five care cc please call Jeanette for seven three for eight zero on and mentioned my name's I can always use the brownie points\nNinety One point five cares DC is dedicated to covering southern Colorado and the Rocky Mountain west your membership to directly funds are journalism thanks for supporting Ninety One point five K. R. C. C.\nProgramming on Ninety One point five kill your cc is supported by cottonwood Center for the arts kicking off the holiday season with workshops markets and creative activities for all ages starting November seventeenth more information available at cottonwood Center for the arts dot com\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California President Trump's political career is in part defined by his willingness to openly mocked people he disagrees with\nA very dishonest first a look at ... I guess I don't get paid by Soros or somebody\nHave no confidence and a guy like brother and I think is a total loss of life remember what President Obama\nI don't get paid by Soros or somebody\nI have no confidence and a guy like bread and I think is a total loss of life remember\nWhat President Obama said you can't have manufacturing jobs they don't know what's going on\nWhen you listen to Eric Holder talk about kicking Mack say low IQ individual\nNow though he is calling for civility after at least seven apparent pipe bombs were mailed to his political opponents at a rally in Wisconsin last night President Trump condemned these incidents\nThe full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice we will spare no resources are expense in this effort\nAnd speaking yesterday at a campaign event in Florida former secretary of State Hillary Clinton said much the same thing is it time a\nDeep divisions\nAnd we have to do everything we can to bring our country together\nOkay so what we know at this point suspicious packages were sent to at least three destinations in New York including the offices of Hillary Clinton also the home of billionaire philanthropist George Soros one address the John Brennan the former CIA director under President Obama ended up at CNN New York offices\nIt's too small it doesn't fit any more an old film pushes back against the one dimension analogy that black filmmakers have been fighting for decades and now it's getting a new life that's next time on the take away from WNYC NPR I\nToday at ... am on Ninety One point five to your cc southern Colorado's NPR station\nMore and more people are getting their news on mobile devices and through social media in Ninety One point five he ... he doesn't have to be any different miss this morning newscast find it on our website getting out of your current one to keep listening to all things considered download the mobile apps\nNeed info on a local story impacting your community followers on Twitter feel like passing along that NPR story like us on Facebook the news never stop neither do we Ninety One point five pay our TV news\nNPR story like us on Facebook the news never stop neither do we I knew when we find pay our CD news\nEither this is my age who is this is Jonathan from your the dominant goalie for the most\nAmusing seven and nine nine Ninety One point five K. are the the\nThe Ninety One point five to your cc news team the meeting was the third for scheduled around the corner in the end the ban passed on a six to to vote over the past five years officials say the jail recognized for excellence by Colorado broadcasters association\nProgramming on Ninety One point five through your cc is supported by e G presenting an acoustic evening with\n... and John Prime February eleventh pikes peak sooner more information is available at access dot com that's a ex S. dot com [noise]\nAnd you as permanent exhibit at the Colorado Springs pioneers museum titled a whole of one's own the life of Helen Hunt Jackson\nOpens October twenty seventh\nOr information on the community counter Lincoln care cc death ORG\nSupport for NPR comes from this station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no ally ally Christina Hendricks and Andrew rentals and new episode every Friday on prime video\nFrom his Cox insurance providing customized insurance for small and medium businesses so they can do more and being more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nAnd from Subaru featuring the all new three row ascent with seating for up to eight at a choice of second row captain's chairs love it's what makes us Subaru was Subaru learn more at Subaru dot com\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning some of the most troubled parts of this country our rural areas and in those places disdain for government typically runs pretty high\nBut this summer NPR along with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health surveyed abroad group of rural Americans\nAnd that turned up some surprises about how many rural people want government help Frank Morris of member station K. C. U. R. has the story\nRural America can sometimes feel like a country apart dirty\nMorris of member station K. C. U. R. has the story\nRural America can sometimes feel like a country apart thirty two years ago Ronald Reagan summed it up with this clip\nI've always felt the nine most terrifying words in the English language are I'm from the government and I'm here to help\nRural Americans since since come across some even scarier words like opioid epidemic\nSo what you have a very serious problems particularly around the economy and opioid drug abuse that really worried people\nAnd Robert Blendon at Harvard's th Chan School of public health system of Thirteen hundred rule adults surveyed by NPR fifty eight percent said their towns need outside help\nI think that's a surprise for a lot of people that there is a willingness by most NATO to reach out for outside help\nTake the little town of ... in central Missouri there's a big struggle going on in a small town right now\nThe Stanfield feisty compact woman pushing Seventy looks up from a front porch of the town of Fifteen hundred corralled fight green rolling hills and farm fields and split by opposing view of outside involvement\nPeople wanting it to grow and wanting it to me the best they can be [noise] and people that would prefer that everyone back off and let them do what they want\nIt's pressing here because this town is struggling with the same issues plugging much of rural America money\nYou don't have a tax base anymore that you used to have the shoe\nFactory in ... a big employer and many local shops closed decades ago career options for scares\nSome petty crimes go unpunished and like in much of rural America drug abuse is widespread\nEven though we're we're all all the idea that we're safe\nIsn't really there anymore\nRock seat Murphy covers bell for the Mary's county advocate newspaper\nThere's no way that this community will be able to fix that drug problem by themselves in order to do that they would need more money and more resources that they don't have\nThat it's not like bills getting up and that's another thing that popped out in NPR's rural poll Robert Blendon says ... half of those surveyed say their community problems can be sold within five years\nIt is not all a world of hopelessness or many others are described here is a great deal of the optimism that we can deal with these issues if we can get outside help\nAnd blended says that those looking for\nHere's a great deal of miserable that we can deal with these issues if we can get outside help\n... says that those looking for outside help three out of five expected to come from government especially\nState government [noise]\nProblem is state money is getting harder to come this is the\nThe ...\nGet the Stanfield again standing on a grassy right of way cutting straight through ten where she says the state's once promised to build a major prostate\nBike trip to pay for that one at this trail that goes through\nSee so many possibilities for this town growing by having people from out of the city coming in here and spending their money here and ... and now\nWith basic they can tell us no it's it's a big disappointment it really is the state does spent\nQuite a bit in paying public school salaries providing grants that mostly cover things like new sidewalks\nDrainage projects hopefully any water tower the buck Showalter city hall says the city is often turned down\nBecause it's so competitive and a lot of communities a lot of places will need help\nSome times it's pretty slim\nJonathan ... a lot of the center for rural affairs this state budget cuts are taking a heavy toll on small towns that depend on government funding more than the residents tend to realize and he says that with state funding drying up appreciation for it may be growing\nThis is symptomatic of a country that is reevaluating itself in reevaluating its decisions and realizing the importance of civic infrastructure and the importance of being part of a community and part of a state where we're all put them in the same direction I think this could be a positive sign\nA lotta says that if real hostility toward government is in fact easing the optimism that many rural residents feel about solving persistent drug in economic problems may be justified for NPR News I'm Frank Morris in belle Missouri\nA super typhoon name due to blasted across the U.S commonwealth of northern Mary on islands today devastating winds tore off roofs and level small building now there has been no reports\nOf debts on the Pacific island chain but the national weather service called you to the strongest storm to hit any part of the United states this year and we're more now from NPR's Julie McCarthy in manila\nResidents described the wins that how old over the northern Mary on us\nPart of the United states this year and we have more now from NPR's Julie McCarthy in manila\nResidence described the wins that how old over the northern Mary on us\nAs horrifying [noise] to breathe became shrapnel would you choose when seeds to sustaining a hundred and eighty miles per hour according to satellite readings that's well in excess of any hurricane\nThat has struck the United states this year\nI went shopping oil\nThat's meteorologist Michael's yo bro with the national weather service\nYou chew is being compared to typhoon men coot that range to to the Philippines last month ... says the intensity of you chew was so great\nThat the wind instruments gave out along with the ... the Mary on his or the western most territories of the United states with a population of fifty four thousand the Mary on his lie about sixteen hundred miles east of the Philippines\nUnder grey skies residents of the typhoon torn islands can be seen on social media today sifting through what is left of their homes searching for their belongings\nThe storms I crossed directly over a teeny an island and scraped sigh pan the largest in the chain of fourteen volcanic islands the mayor of ... Joey Patrick's on Nicholas assess the damage\nBut we're still without power you're still is without water which is the last few days here she 'cause it was a\nGenerator some residents expected outages to last week's the mayor said the power plant has been compromised and the distribution system\nCompletely destroyed Julie McCarthy NPR News manila\nThis is NPR News I'm Randy price I'm the owner of Rocky Mountain restaurant group there was a law that address to the city the outdoor recreational opportunities grade schools great\nIn the prison doesn't say anything directly about the people who were targeted have any of them said anything\nThat's right he didn't say any of the names of the people\nAnd and you just don't know when it's going to happen and if they didn't say anything directly about the people who were targeted have any of them said anything yeah that's right he didn't say any of the names of the people who've been targeted often they are features of his rally at a Hillary Clinton speaking yesterday at\nAn event and she said that she is fine thanks to the secret service she tells me that troubling time at deep divisions in the country and parents tend to keep in mind because thanks you guys\nYou're welcome thank you and we will of course the following this story throughout the morning Mm\nOr the energy giant Exxon Mobil is accused of misleading investors and shareholders an analyst about the cost of climate change to the company's bottom line New York's attorney general Barbara Underwood is suing the company for ... shareholders and NPR's Wade Goodwyn has the story\nThe lawsuit doesn't hold Exxon Mobil liable for helping to create climate change it accuses the energy giant of misleading the investing public about how global warming was affecting the value of the company's fossil fuel assets around the world\nWhat the attorney general is essentially saying as you kept two sets of books\nTom ... the director of finance for the Institute for energy economics and financial analysis and former New York state comptroller ... says the allegations are about Exxon refusing to write down the value of its fossil fuel assets that are still in the ground\nTwo sets of books one internally that they were um keeping so that they understood what reality was and another more nuanced reality if you will for the investment public\nThe allegation really is that the company is not as big as it says it is and it's not worth as much as it says it is\nExxon declined to comment to NPR but released a statement that said in part\nThese baseless allegations or a product of closed door lobbying by special interests political opportunism and the attorney general's inability to admit that a three year investigation has uncovered no wrongdoing\nExxon Mobil is moved toward the investigation by attorneys general in three states alleging it's a conspiracy involving the Rockefeller Foundation tort lawyers environmentalists than democratic gay jeeze\nMichael Berger is a professor at Columbia Law school who specializes in climate change law\nBurger doubts axons conspiracy theories are going to hold up\nColumbia Law school who specializes a climate change law burger doubts axons conspiracy theories are going to hold up in court this is\nClimate change it's about the risks that regulation poses to the\nFuel industry over the next half century or more but this particular complaint is about corporate fraud\nAt the end of Wednesday's trading on Wall street shares of Exxon Mobil were down about three percent Wade Goodwyn NPR News Dallas [noise]\n\n\n\nThis is NPR News\n\nWhen one size does not fit all this sort of box that pun intended black box that we've often been put in\nIt's too small it doesn't fit any more\nAn old film pushing back against the one dimension analogy that black filmmakers had been fighting for decades and now it's getting a new life that's next time on the take away from WNYC NPR I\nToday at eleven AM on Ninety One point five K. or CDC southern Colorado's NPR station\nMy very first car was VW\nChi tea I Am Janet I'm Rhonda radiolab always really lust after this ... this is a perfect ... they just love the shape of it and it gave me nothing but grief I broke down on the\nBrooklyn Bridge pushed to sing across many lanes of traffic it was just freaking piece of junk it's\nCool to think that even that car can be turned into an episode of radio lab attorney or car into the programs that you love card\nDonation information at your C. C. dot org\nWhen folks come up and tell us they heard is on the radio my first reaction is hey we should hang out in a way it's a filter\nAnd it puts us in contact with people that we would probably want to do business with and it's a very effective way of doing that [noise] my name is avenue locker I and the c._e._o. is now the guy\nFor more information on underwriting with Ninety One point five care cc please call Jeanette for seven three for eight zero on and mentioned my name I can always use the brownie points\nNow you can tune in to Ninety One point five K. R. C. C. without lifting a singer who just ask your smart speakers like chaos\n\nNow you can tune into Ninety One point five care cc without lifting a finger just ask your smart speaker ...\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado Springs philharmonic presenting monster mensch this Friday and Saturday pikes peak center Thomas Wilson conducting the sperm calculator evening of music costumes encouraged the U.S feel harmonic dot org [noise]\nMorning I'm Noel King today we take a moment to remember a woman who chain Thanksgiving menu for generations\nIn Nineteen fifty five ... Riley a supervisor and the gamble company put together a recipe that calls for more\nGreen beans and fried onions that casserole became a\nThanksgiving staple among her other creations a tuna noodle casserole and sloppy Joes super burgers she passed away earlier this month at age Ninety two It's MORNING edition\nSupport for NPR comes from this station and from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Harvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot Emmy slash executive\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King in Nineteen forty five an American leader met a king from Saudi Arabia here's a newsreel report from that time [noise]\nAmerican destroyer comes along side of the crews are in great better like on the Suez Canal and each\nOf the five million people of Saudi Arabia to a conference was funded and wrote about [noise]\nThat was the first time the Saudi monarch had left his home country now Seventy three years later the relationship between the U.S and Saudi Arabia is challenged by the killing of journalists Jim all cause show gee at the Saudi consulate in Istanbul a lot of our listeners had questions about our relationship with Saudi Arabia here Steve Inskeep\nPut your questions to commentator Cokie Roberts who answers your inquiries each week about how politics and government work either Cokie high fever and it certainly a big question now this relationship works and here's our first question\n... ... each week about how politics and government work either Cokie high fever and it's certainly a big question now this relationship works and here's our first question\nThis is Nicole ... from Nashville, Tennessee in the U.S Saudi Arabia special relationship really based primarily on an oil arms arrangement or is there something more to it\nWas not oil for arms is oil and arms\nOf recent years the United states has become much more self sufficient in terms of energy but Saudi Arabia remains a huge producer of oil and more important incredibly influential in the international setting of oil prices\nBut it's also a purchaser as President Trump has repeatedly said\nOf arms made by U.S companies but there's something more and that is mainly Iran the United states is saying Saudi Arabia is a check on Iran both in the region internationally and to the extent that it's a live issue the U.S also thinks that Saudi Arabia or could be helpful and then the elusive Israeli Palestinian peace agreement\nThat oil is also on the minds of our next listener hello my name is Sean ... Morris I'm from New Orleans Louisiana how did the U.S view Saudi Arabia before oil was affecting thank you\nBasically there was no view before oil was a thing a Saudi Arabia as we know it was became a country in Nineteen thirty to the very next year and signed an agreement with standard oil of California to form aramco the Arabian American oil company which is now on by the Saudi state\nAnd that happened even before it was clear\nHow oil rich the country would be\nThe leader for a unified the country and started a relationship with the U.S\nWas Abdulazeez evens out he had forty five sons Steve and all the king's since his death in Nineteen fifty three of them one of those sons the crown prince Mohammed bin Salman we've been hearing so much about lately would be the first of the next generation if he becomes king\nThe next question is whether us being so close to the Saudis can get them to do anything\nEither just out of the south from Upton, Massachusetts how much influence as the United states have over Saudi Arabia's foreign policy\nWell I'd say the question is more how much the U.S has chosen to exert\nA the biggest case in point at the moment is the civil war in Yemen\nWhere the Saudis have been accused of bombing civilians and closing off access to a humanitarian aid so that now there's an enormous food crisis taking place but because Iran is involved with the facts and the Saudis are fighting the United states has sided with the Saudis but they're ... and Congress which showed up in the last defense bill of trying to ...\nLove with the facts and the Saudis are fighting the United states has sided with the Saudis but they're staring in Congress which showed up in the last defense bill of trying to protect civilians\nAnd there's talk of sanctioning Saudi Arabia in some way because of the journalist killing as well go see thanks as always good to talk to you stay in commentator Cokie Roberts you can ask Cokie your questions about our politics from the government work by emailing us at ask Cokie at NPR dot org or tweeting us with the hashtag askcokie [noise]\nLee retired spy with a deadly nerve agent but what does Russia up to ... and who's next I'm Joshua Johnson who's ... fires next time on one day from W. A. M. U. and NPR\nNow is this morning at nine o'clock hope you can join us for one hey good\nMorning this is southern Colorado was NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. the hunter Casey cs stark ... W CCF than woodland park streaming it K. R. C. C. dot O. R. G.\nHow'd you find this morning in Pueblo county in San Luis valley that should clear up by about eight am expect partly cloudy skies across the region today I'd mostly in the fifties and sixties sunny and warm for your friday and into the weekend the news is next it's six o'clock\nGood morning President Trump replace some of his usual attacks on Democrats and to call the big news CNN with a call for civility Latin\nMore on MORNING EDITION from NPR News [noise]\nPresidents still got in some things that Democrats his call for civility came after packages containing pipe bombs were sent democratic leader I knew a king\nAnd I'm David Greene Alaska former FBI official how the investigation into packages going to play out later we'll meet a pastor who wants to give evangelical voters turning away from President from home and the Saudi crown prince amid allegations over the killing of a journalist for more than\nIt deserves the October twenty fifth birthday party determine when Darrell from your office Dr Craig Robinson forty seven years in his\nMind from NPR News in Washington on corporate Coleman believes in New York City are investigating another suspicious package that's been found in lower Manhattan New York state governor Andrew Cuomo told NPR's MORNING EDITION the latest package was discovered at the business address of actor and liberal activist Robert De Niro\nIt is a similar looking package or we don't know yet or if it is the same as the fact that we've seen thus far\nAppears to be the eighth suspicious package sent this week to several democratic leaders are liberal activist law enforcement ... authority said those were pipe bombs one was addressed to former CIA director John Brennan but was delivered to the New York\nLaw enforcement of for authority said those were pipe bombs one was addressed to former CIA director John Brennan but was delivered to the New York offices of CNN\nPresident Trump is tweeting this morning that the anger today in our society is caused by the media he demanded that the media quote clean up its act fast exclamation point he was more subdued on Wednesday at a campaign rally as NPR's Tamara Keith reports\nAt a campaign rally in Wisconsin President Trump's skipped over his usual attacks on Hillary Clinton and congresswoman Maxine Waters instead saying those engaged in politics should stop treating their opponents as being morally defective\nTrump also pointed out that he was maintaining a comment even town in contrast with is typical rally performances\nYour arms are trying to say that very nicely in front of [noise] she normally I scream or they want a socialist takeover dollars wants a socialist took over [noise] I'm trying to be nice\nFor all the having very well he said it's not clear how long it will last Trump's next rally is friday with several more in the works before the midterm elections camera Keith NPR News\nProsecutors in Saudi Arabia now say the killing of dissident journalist ... was premeditated this this latest story change by the Saudi Government about ... death an Istanbul NPR's Peter Kenyon reports Turkey's president has spoken with Saudi crown prince Mohammed bin Salman\nTurkey's state news agency quoted president all officials are saying the phone conversation between president ... and the crown prince included a discussion of what step should be taken in the ... case\nSeparately the Washington Post reports CIA director Gina Haspel heard audio evidence related to ... killing which president aired on this week called the ... in premeditated murder\nThe journalist was last seen entering the Saudi conflict on October second it took more than two weeks to Riyadh do acknowledge he died in the consulate calling it an accident an explanation aired on dismissed after a lengthy delay the Saudis granted permission Wednesday for investigators to search will on the consulate grounds Peter Kenyon NPR News ...\nThe national weather service says the east coast may see a nor'easter this weekend a storm system will combined with the remnants of hurricane Wilma\nIt's NPR\nThe world famous Cleveland Orchestra his fired two musicians and investigation found the men engaged in multiple instances of sexual harassment and\nThe world famous Cleveland Orchestra has fired two musicians an investigation found that men engaged in multiple instances of sexual harassment against female colleagues and some students from member station WBUR C. P. and Idea Stream in Cleveland Adrian mom reports\nThe firings were announced three months after a Washington Post story brought to light sexual assault allegations involving William crucial for over two decades producer was the orchestras concert master the ensemble leader after the conductor but after the post story came out the orchestra suspended him and hired an outside law firm to investigate\nThat inquiry resulted in another suspension of its lead trombone player ... Rosa based on dozens of interviews and documentary evidence the investigators concluded the two men engaged in numerous instances of sexual misconduct\nIn a statement the executive director of the orchestra apologize to the victims and announced it would be implementing a new sexual harassment policy and a confidential hotline\nFor NPR News I'm Adrian ... in Cleveland\nThe joint type in warnings that are says super typhoon YouTube has crashed over the Marianna islands in the Pacific Michael Sullivan reports from Thailand the storms top sustained winds were one hundred eighty miles per hour\nThe Mariano are used to tie phones but this storm ... Penn resident Glenn hunter told the Associated Press was different we knew it was going to be big you said but while\nThe island of ... and was the hardest hit its medical center badly damaged and many of the commonwealth population abruptly fifty five thousand people are hunkered down in shelters waiting for the storm to pass\nMichael Sullivan reporting on corporate Coleman NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more and go to meeting dot com\n[noise]\nHi this is Andy ... executive director of the cultural officer the pikes peak region inviting you to tune into Ninety One point five K. R. C. C. on Thursdays for the peak radar minute at six thirty in eleven AM and two PM\nMade possible by the team in foundation and the peak radar minute is just about twenty minutes away that is that six thirty this morning you're listening to MORNING EDITION on Ninety One point five K. R. C. C.\nAbigail Batman [noise] there's a lot of buzz about how big data and now block chain will solve climate change\nFive K. R. C. C.\nAbigail Batman [noise] there's a lot of buzz about how big data and now blocked chain will solve climate change scientists are concerned about the hype plays into a dangerous idea that there's a technological magic bullet all the details coming up at six twenty [noise]\nIn woodland park it is thirty four degrees mostly sunny skies expected today highest fifty two well below it forty sevens and patchy fog this morning throughout ... county\nHigh of sixty six and mostly sunny today and in Colorado Springs we have forty five degrees to hire a sixty two mostly sunny skies expected temperatures will warm up just a bit tomorrow and through the weekend should be a beautiful sunny weekend [noise]\nProgramming or Ninety One point five through your cc is supported by e G presenting Chris Isaac's holiday tour November twenty six or ... or more information\nIs available online access dot com that's ... s dot com\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC police in New York City are investigating another suspicious package it was found early this morning in Manhattan's Tribeca neighborhood New York governor Andrew Cuomo told NPR this morning it was sent to the home of actor Robert De Niro who is a prominent critic of President Trump\nNow that package It's MORNING follows at least seven packages containing what are described as pipe bombs\nSent to senior democratic leaders yesterday including former president Brock Obama and former secretary of State Hillary Clinton CNN's office in New York also got one of these packages and two days earlier and explosive device was founded the home of billionaire philanthropist George Soros\nNow these individuals and CNN of all been critical of the Trump administration's\nThis is now in the hands of federal investigators including the FBI so we reached out to former FBI deputy director John Pistole to find out what they'll be looking for going sir\nGood morning Noel All right so we have a situation involving live explosive devices apparently intended to do harm what are the FBI and other federal investigators trying to determine at this stage\nWill surely the key is trying to do to fight the perpetrator or the individuals who are responsible for marijuana devices and they're really looking at it from a two perspectives one is the forensics the involved\nThat is involved in each of the devices and the fact that there are multiple devices is actually very helpful to the investigators because they can compare and contrast and and just get a a richer picture if you will of that forensic data set\nCorruption scandal and greed in college basketball we talk with Michael Sacco love about what he calls the buying and selling of basketball players some as young as eleven\nIt involves sports apparel companies scouts coaches parents financial concessions and billions of dollars his new book at the last temptation of rip Pitino join us\nFresh air in today at noon on Ninety One point five K. R. C. C. things for making us that part of your Thursday morning I'm Abigail Batman and you're listening to MORNING EDITION\nVoters in four states including here in Colorado are set to decide whether they should take the power to drop political boundaries away from politicians coming up we'll hear from an expert who says Michigan's congressional maps are among the most skewed in the country\nIt's very clear that their number one goal was to maximize Republican political power\nA new proposal in the state would take the power to draw those districts away from politicians more is coming up at six thirty\nIn West cliff it is thirty four degrees partly cloudy today Hi I'm fifty eight in Trinidad its forty four should be mostly sunny a high of sixty three degrees and in Colorado Springs we have forty five degrees mostly sunny skies expected for your Thursday\nIt's six Twenty one and this is Ninety One point five K. R. C. C.\nNPR on Ninety One point five through your cc is supported locally by Kaiser Permanente with pediatric care for the tiniest members at two locations in Colorado Springs Kaiser Permanente you aims to save time with pharmacy lab and medical imaging under one roof G. P. dot org Kaiser Permanente brought\nForth for NPR comes from this station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wylie ...\nThis station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks into Andrew rentals that new episode every Friday on prime video\nFrom it less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at ... dot com\n[noise] from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that helps them thrive ... verified dot Gov slash go and from the listeners who support this NPR station\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning the u._s. stock market looks ready to recover some of yesterday's\nDramatic losses when Wall Street opens this morning most Asian markets were down overnight the Nikkei that hangs saying but the Shanghai stock exchange was stable which was unexpected because China stock market has fallen thirty percent since January and its currency is falling to its lowest level against the dollar in nearly two years\nNPR's Rob Schmitz is with us from Shanghai good morning Rob you more into our what thirty percent drop for China's stock market sounds pretty darn bad what's going on [noise]\nWe'll try this kind of me has been lagging for the last few years the government's dealing with a lot of problems you've got public debt Sparling out of control you've got a fairly significant property bubble\nAnd through all of this Beijing's making painful changes in how China's economy runs moving from an economy based on building things to one based on buying things and the downturn in China stock market this year reflects that\nBut as important to remember here that when China stock market drops by thirty percent like this year it isn't going to have\nBig an impact on the economy like if the dog the Dow fell by the same percentage and that's because in the U.S much of the country's retirement plans are invested into the stock market but not in China it's still relatively young market and it isn't a great indicator of the overall economy of say the value of China's currency\nAnd let me ask you about China's currency the UN is edited weakest level against the dollar and nearly two years and President Trump says Beijing is keeping its currency low to make exports cheaper which could give China an edge in a trade war is China manipulating its currency\nWas interesting hearing well is that China is likely many blending of currency what it's doing so in the opposite direction of what President Trump is accused\nCurrency [noise] well what's interesting here is that China is likely manipulating its currency but it's doing so in the opposite direction of what President Trump is accused China of doing [noise]\nYears ago China used to weaken its currency to make exports cheaper but that's not what's happening now what's happening now is that the u._s. dollar is stronger and this is putting pressure on the un to weaken and Beijing has stepped in to try and prevent it from weakening too fast\nChina is doing a China doesn't want its currency to depreciating too quickly because it can lead to inflation and that's the last thing China needs right now so if China should get out of the way and start managing its currency like the UN would likely we can much faster which is what Trump does not want because that could lead to an even bigger trade deficit between the U.S and China\nAre these terrorists that President Trump is imposed on Chinese goods having a a big impact on the economy there\nWell from a kind of speaking to it's a little early to tell us tariffs are certainly having a deep psychological impact on the movers and shakers here in China's economy\nIn my conversations with business owners here I keep hearing stories of how companies are making plans to move parts are sometimes all of their supply chains to countries in Southeast Asia to avoid this trade war and that of course does not bode well for China's economic future\nBut it's important to note here that even without the trade war with the U. S. China's economy was already vulnerable from a host of economic problems that are finally coming home to roost\nNPR's Rob Schmitz in Shanghai thanks out ...\nAccording to a un climate report that was released earlier this month the world has only about twelve years to roll back carbon emissions and avoid the worst impacts of climate change\nSilicon Valley has been at work on a solution for years often promising quick fixes blocks chain the technology behind crypto currency like bitcoin is the latest solution coming from big tech\nMember station KCUR December net has more\nUntil about a year ago hardly anyone in climate science was talking about watching but at the recent global climate action some in San Francisco it was all over the place they were panels papers people were talking about how he can help mitigate climate change in all sorts of\nLand use agriculture\nPart of its oil so frustration our sometime\nAnd coaches the climate change coalition he came to the conference to spread awareness about blocking [noise] so what is it\nA long chain or distributed electric technology really references a larger system of technology\nOkay [noise] they give it like the ... is like an accounting book everyone can see a distributed ledger\nSure go system of technology [noise] okay [noise]\nThink of it like the ... is like an accounting book everyone can see a distributed ledger it's a record of transactions that isn't held by a central authority like a bank but instead on the computers of everyone on the block chain\nTransparency is its main advantage and tons of new companies are springing up saying that they will use the transparency block chain to solve all sorts of problems and everything from curing cancer to ending human trafficking and now even climate change\nFits it's our intention to build the infrastructure to make it possible to reverse climate change\nBall gamble used to be a software product manager he's working on climate change now but he's still makes the grand tech world pitches he's the CEO of a new Silicon Valley company called ...\n... is a black chain based marketplace that makes it easier for people to pay for removing carbon dioxide from the atmosphere\nRight now California parts of the U.S and Canada the European Union and the number of other countries are participating in cap and trade carbon credit systems the total number of carbon possible to admit is kept and then companies can buy carbon credits that let them in more\nEconomists love this market based solution but there's a problem when it comes to counting the carbon\nCarbon markets in the past have been plagued with issues of fraud and double counting\nNobody wants to use block chain to verify the accounting and to go one step further to create a market for people taking carbon out of the environment\nNot a company has been launched yet but that isn't limiting the ambition of the sales pitch you want to make the whole climate change problem just go away so do scientists like Douglass McCauley yeah I Wish it was that easy\nBecause a researcher at UC Santa Barbara you said the danger of Silicon Valley is big promise disrupt everything eat those is that it suggests there's a quick and easy solution\nThe things that the climate change are going to be really hard\nLike getting countries to cut emissions or people to stop driving cars the pollute because I said before it was blocked Jane artificial intelligence in big data were the hot new things and these are proven to be valuable tools for climate research but in each case it took scientists a few years to cut through all the hype\nWe need to look past the shiny thing and started talking about exactly how to apply it usefully\nIs launching could help with things like counting carbon credits or keeping track of say how many trees a company is planting to suck carbon out of the air Katherine mock and a climate scientist at Stanford agrees but she says it's dangerous to believe block Jane will be some kind of a miracle cure\nEssentially Ken kicking ethics where we won't be putting into place the solutions that are actually more important to make the ...\nMiracle cure it since they can kicking ethics where we won't be putting into place the solutions that are actually more important to make the entirety of the problem something not solvable\nWith a clock ticking on climate change and ... there's no time to waste\nSorting facts from\nPrint PR News I'm Sam Harnett\nThis is NPR News [noise]\nTie this is Andy ... executive director of the cultural officer the pikes peak region with your peak radar minutes between a couple of ... for the coming weeks tomorrow night at the end Center for the arts NASA engineer Kobe boy can provide an informative update about what curiosity and other Mars rovers have discovered on the red planet\nThat says well please let me know smiley face\nThat Katie Faye he the organizer of voters not politicians she had put up a similar post ... years ago and nobody even liked it but this time people were clicking the like button and they actually wanted to health\nAnd then out here is where we have higher printer fanciest printers that our campaign has\nSaid he is showing off voters not politicians newest field office the redistricting initiative she launched has amassed hundreds of volunteers and raised more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names tape to the bottom so that they can get their chairs and tables back\nI'm hoping to find a coffee maker that can be donated that some food and stuff like that and\nRight now lawmakers in power a get together and draw district lines before getting them approved by the governor Michael ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear that their number one goal above protecting communities ethnic geographic otherwise er Michigan it's very clear that their number one goal was to maximize Republican political power\nHave taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten far more votes overall the redistricting proposal would create a commission made up of foreign policy\nSeats nine out of fourteen even in years when Democrats have gotten this far more votes overall\nThe redistricting proposal would create a commission made up of four Republicans four Democrats and five independence a majority that includes a mix of all three would have to agree on the map\nBut the opposition calls the proposal an expensive way to change your system that already works when delete harbor is a Republican and has worked for for secretary of state she says the whole thing is skewed to help Democrats a gimmick and its bypasses are elected official in our democracy\nAnd if they want to have the pen they need to win elections the initiative comes at a time when voters are frustrated with politics and government Bernie porn as president of epic Emory appalling and research firm\nThat has been something that has been building for years\nHe says that frustration came to a head and twenty sixteen\nPeople were dissatisfied with the government the federal level is really looking for members of Congress should or donors corporations and their lift all the\nCool pulls looking at the redistricting proposal show it's been gaining popularity over the last few weeks but it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal one\nWhy should the parts in an office get to decide like who gets to vote in that area\nWhen I actually I have a right to choose in and it just makes me wonder well how much rights do we really have\nEven if the redistricting measure passes that's not the end of the road legal challenges to the commission's decisions seem all but certain for NPR News I'm Shana raw in Lansing, Michigan [noise]\nThis\nIs NPR News\nWhen one size does not fit all the sort of box that pun intended black box that we often been put in\nIt's too small doesn't fit any more an old film pushes back against the one dimension analogy that black filmmakers had been fighting for decades and now it's getting a new life that's next time on the take away from WNYC NPR I\nFor decades and now it's getting a new life that's next time on the take away from WNYC NPR I\nDidn't catch the take away this morning at eleven o'clock on Ninety One point five K. R. C. C.\nThe magnitude springs heritage center presents the twenty fourth and you will go stories of old managed to walking tours October twenty seven more formation on this and other public service announcements can be for them and became overly\n... or G.\nGood morning I'm Abigail back then it is six forty five on Thursday October twenty fifth hope you're doing well this morning [noise] this is a southern Colorado ... NPR station Ninety One point five K. R. C. C. [noise]\nComing up on the marketplace morning report healthcare will be on the minds of many voters heading to the polls next month this morning a look at how voters decisions could be a matter of life and death that plus all the morning's business news coming up at six fifty one [noise]\nAnd ... it is thirty six degrees partly cloudy today a high of safety sticks in Raton it's twenty six degrees a little bit of fog in the area right now [noise] cloudy skies expected today at high of forty nine and in Colorado Springs we have forty four degrees mostly sunny today into high of sixty two\nProgramming on Ninety One point five through your cc is supported by the Colorado Springs school hosting a pre K. through twelfth grade open house in school showcase featuring the arts sciences and family entertainment Saturday November ... wonder for pm more at CSS dot org\n[noise]\nGood morning I'm David Greene with a warning to the people of Oklahoma City on the\nBorder to McDonald's and have your cheeseburger we ignore that three dogs will be a long way are you hoping for a bike that is\nNo stray princess who's owner caught her in the act in and out viral video she leaves home walks to Mickey D's puts on her sad face and gets people to give her chunks of cheeseburger we will not be smarter by this dog take a stand Oklahoma City It's MORNING edition\n\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities and education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more on line at Kaufman dot org [noise]\nFrom the Pew Charitable trust celebrating Seventy years of serving the public\nSuccessful more online at ... dot org [noise] from the Pew Charitable trust celebrating Seventy years of serving the public learn more at Pew trust started work slash Seventy\nAnd from the John F. and James Alan nice foundation helping NPR advanced journalistic excellence in the digital age\nIt's MORNING EDITION from NPR News I'm Noel\nKing and I'm David Greene a federal jury in New York has found three people guilty of fraud\nThey were convicted yesterday of paying tens of thousands of dollars to the families of top flight basketball recruits one of those convicted James gotcha worked for Adidas\nAnd steered certain students to Adidas sponsored colleges schools with storied basketball programs such as University of Kansas and little for among them\n... longtime coach Rick Pitino was forced out of a job over all this but he was not even brought on trial\nNow joining us to talk about this case and what the NC double a can do to clean up corruption and college athletics is Washington Post sports columnist Kevin Blackistone also a familiar voice on our program had their Kevin hey how you doing to I'm good thank you so what does all this mean for college basketball as a whole what happened yesterday you know I'm not sure it means\nAnything for college basketball um in in total because what happened here was a pretty isolated incident um but what it does is it exposes the recruiting practices have been going on in a big time college athletics and football and particularly in basketball\nFor as long as I can remember and that is basically the channeling of money from a one source um to the families of talent um to ensure that that talent goes to a particular school\nAnd what has happened over the years is that the uh manufacturers of of basketball shoes Adidas\nTo Nike or those those uh operations\nHas gotten people in the middle of them um to help transfer the money\nSo that will surprise here is that it has been criminalize or by the federal government as opposed to be policed by uh the NC double A. as it's been done for years and it used to be that the worst thing that would happen in the situation is that a someone would be banned from\nThe NC double a coach who was who was caught um funneling money or or some middle man\nIt's like ... which is which is a step I Am absolutely\nCoach who was who was caught um funneling money or or some middle man\nNow there's like ... which is which is a step ...\nNow you could possibly go behind bars which is uh what these uh these three men are facing\nWhat you have these three men facing that you say um but I Want to your colleague at the Washington Post Sally Jenkins room recently that the real defended here should be a university but the universities are actually considered victims and all of this did you see at the same way that she does\nI I don't see it that way but that was the way that the federal government decided to get involved in this basically they said that the ... universes were being defrauded 'em by this system a because by funneling this money um\nTwo players are are players families um these people knew that they were making these players in eligible under NC double a rules and therefore that at some point\nIt would all be found out and they wouldn't be allowed to play to the universities that have given them scholarships\nAnd therefore they had to fraud at the universities of of value\nWhich is a very strange thing to me because I still don't know\nHow that's fraud I mean universities or the University of basketball programs in football programs are still going to get these talented players under they're very um a low level of remuneration a for athletic talented brings them um tens of million dollars in revenue every year\nMoscow pay the price for targeting an elderly retired spy with a deadly nerve agent what what is rushing up to a friend who's next I'm Joshua Johnson who's ... who's next on on one from W. A. M. U. and NPR\nA weekday mornings at nine o'clock that is right after MORNING EDITION\nThis is southern Colorado was NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs ... hunter Casey cs stark veil and decay W CCF andme woodland park streaming at K. R. C. C. dot ORG\nWarmer and dryer today patchy fog this morning in ... county in the San Luis valley that should clear up in the next hour or so partly cloudy skies\n[noise] warmer and dryer today Patty thought this morning in ... county in the San Luis valley that should clear up in the next hour or so partly cloudy skies across the region with temperatures topping out in the fifties and sixties news from NPR and K. R. C. C. is coming up next it's seven o'clock\nThis morning who said pipe bombs to prominent figures three we're central locations in New York I'm more suspicious package was discovered this morning we'll pick the New York governor Andrew Cuomo and MORNING EDITION from [noise]\nIn these times we have to unify those were the words of President Trump has been bomb scare unfolded later at a rally in Wisconsin He again took aim at the news of the immigrant\nAnd I'm Noel King also this hour New York's attorney general is suing Exxon Mobil claiming the oil giant misled investors about the costs climate change and it's super typhoon swept across the northern Mariano islands to devastating effect\nWill take you to manila for the latest news did serve to over twenty fifth\nHappy birthday to sing or Katy Perry she's thirty four years old today and the news is next\nLive from NPR News in Washington I'm core of a Coleman news reports say yet another suspicious package has been intercepted in Delaware mail facility it's apparently addressed a former vice president Joe Biden the Democrat has a home in the area\nMeanwhile law enforcement officers in New York are investigating a suspicious package found earlier today at an address associated with the actor Robert Deniro NPR's Hansi Lo Wang reports similar packages with explosive devices were recovered by authorities from the addresses a top Democrats and the New York office of CNN\nA spokesperson for the New York city police department says the package was sent to an address linked to a restaurant owned by Robert De Niro it was discovered early Thursday morning in Manhattan try Becca neighborhood be and why pd says look similar to a package that police recovered from CNN to New York offices that package contain an explosive device\nNear governor Andrew Cuomo told NPR's MORNING EDITION that law enforcement are trying to find out more about the package sent to the nearest business and dress user\nGreat New Yorker he's also has a political voice and he's also spoken out on his political opinions\nThis week authorities had intercepted bump Center for President Obama and former secretary of State Hillary Clinton ... along NPR News New York\nThe Dow Jones industrial average in the\nHave intercepted bum Center for President Obama and former secretary of State Hillary Clinton owns you along NPR News New York\nThe Dow Jones industrial average in the U.S and the five hundred are poised for some gains when stock markets open in about half an hour stock futures are trading up despite a sell off and most Asian markets as NPR's Yuki Noguchi reports\nYesterday us sell off brought both the doubt an S. and P. back down to the same level where they started a year those declines were led by technology companies and the losses continue to ripple through Asian stocks overnight\nMost of the Asian markets closed down with Japan's Nikkei taking the toughest hit losing three point seven percent\nEuropean tech stocks started their days in a down as well but markets there have mostly rebounded dimmer forecast from corporate earnings and concerns about a slower global economy have made investors jittery and the world's markets volatile ... NPR News Washington\nA Saudi Arabian prosecutor says the killing of dissident journalist democracy job jeep was premeditated that reverses the earlier claimed by the Saudi Government that his death was an accident NPR's Peter Kenyon says the latest shift came in a statement from the Saudi foreign ministry\nAfter insisting for two weeks that showed you left the Saudi consulate in Istanbul freely Saudi officials acknowledged his death saying it was an accident during a fight now that story has also been abandoned in the face of growing evidence the killing was premeditated Eighteen people are under arrest in President ... they should be tried in Turkey\nNPR's Peter Kenyon automaker Ford says it's recalling about one point three million of its focus Compaq models there is a problem with the fuel system that could cause engine to stall affected Ford Focus models were produced from twenty twelve to twenty Eighteen It's NPR\nIt's seven oh four I'm Abigail that come in with Ninety One point five ... news\nInterior secretary Ryan Zinke he just announced a grant program to help big game animals in the west by protecting their migration routes through public and private lands\nThat nearly three million dollar grant is funded by federal agencies and ... Philips it's aimed at clearing and restoring lands across the west that animals like el ... antelope\nNeed for an annual migration Paul ... is with the Colorado based conservation nonprofit Rocky Mountain wild he says it's not a huge grant given what it aims to accomplish but it's a start at a time when the top\nThe nonprofit Rocky Mountain wild he says it's not a huge grant given what it aims to accomplish but it's a start\nAt the time when the total amount of habitat is shrinking into smaller units it's even more important for them to be able to move from\nOne area to another especially in the face of threats like climate change\nMill Hauser says protecting these animals could also be an economic boost for our region which is home to large hunting and outdoor recreation industries\nClimatologist say conditions are right for development of an El Nino weather pattern that could bring water than normal conditions this winter to the southwestern part of the country but even if an El Nino occurs researchers say that doesn't guarantee that parched sections of the region will receive more rain and snow\nThey also say higher than average ... precipitation is not likely to make up for rainfall deficits over the past year\nAccording to the U.S drought monitor parts of the southwest are experiencing extreme to exceptional drought especially the four corners region\nYou're listening to Ninety One point five K. R. C. C. News I'm Abigail Batman\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes that modern approach to wealth management starts with asking questions and providing straightforward answers\nCharles Schwab own your tomorrow learn more Schwab dot com and the Amy Casey foundation\nSouthern Colorado's NPR smashing Ninety One point five to ... you can be with you wherever you go all you needed your smartphone or download the free Ninety One point five through you're using mobile ah with the flu or the ... to a store [noise]\nThursday or listening to MORNING EDITION on southern Colorado NPR station Ninety One point five K. R. C. C. [noise]\nA new poll shows that many people who live in rural areas want government help to tackle problems facing their community\nI think that this prize that there is a willingness by most model to reach out for a guy though\nDisdain for the government often runs deep in rural America\nMore on that story coming up at seven twenty and also ahead this morning at seven forty five will have an interview with income incumbent congressman Republican Doug land born\nWe heard from his challenger Democrat stephany rose Spaulding yesterday you can find that interview on our website and interview with Doug Lamborn is ahead today at seven forty\nYou can find that interview on our website an interview with Doug Lamborn is ahead today at seven forty five [noise]\nIn canyon city it is forty three degrees mostly sunny today high at sixty eight in Pueblo at forty three a high a sixty six partly cloudy today\nIn Colorado Springs it's forty five degrees high temperature of sixty two mostly sunny skies expected a little bit warmer and more sun for your friday leading to a beautiful sunny dry weekend\n\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California President Trump's political career is in part defined by his willingness to openly mock people he disagrees with\nA very dishonest version crooked Hillary Clinton gets paid by Soros or somebody if\nI have no confidence in a guy like bread and I think is a total loss of life remember\nWhat President Obama said you cannot manufacturing jobs they don't know what's going on\nWhen you listen to Eric Holder talk about kicking max image will\nNow though he is calling for civility after at least seven apparent pipe bombs were mailed to his political opponents at a rally in Wisconsin last night President Trump condemned these incidents\nThe full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice we will spare no resources are expense in this effort\nAnd speaking yesterday at a campaign event in Florida former secretary of State Hillary Clinton said much the same thing\nIt's a time of\nDeep divisions\nAnd we have to do everything we can to bring our country together\nOkay so what we know at this point suspicious packages were sent to at least three destinations in New York including the offices of Hillary Clinton also the home of billionaire philanthropist George Soros one addressed a John Brennan the former CIA director under President Obama ended up at CNN New York offices\nIt involved in sports apparel companies scouts coaches parents financial concessions and billions of dollars his new book is the last temptation of Rick Pitino join us\nToday at noon hope you can catch fresh air right here on Ninety One point five K. R. C.\nC. southern Colorado's NPR station\nInstilled to come in this next bit of MORNING EDITION will have the latest on the investigation into the suspicious packages containing potential explosive devices sent to democratic political figures this week stay with us for that story as MORNING EDITION continue [noise]\nIn woodland park it's thirty four degrees the height of fifty to enter the dad\nForty four sixty three for the high today and in Colorado Springs we have forty five degrees [noise] Hi I'm sixty two should be mostly sunny to partly cloudy across the region today\nI Will be mostly in the fifties and sixties there's some patchy fog in ... county in the San Luis valley right now that's expected to clear up by about eight am it's seven Twenty one and you're listening to southern Colorado NPR station [noise] Ninety One point five K. R. C. C.\nProgramming on Ninety One point five ... or so you see is supported by e G presenting Chris ours which holiday tour November twenty six or ... or more information is available online at access dot com that's a ... S.\nDot com or the Rocky Mountain women's film festival November ninth through the eleventh for thirty one years presenting films through the female loans from documentaries to shorts and features the animated films full schedule it R. M. W. film fest dot org\n\nSupport for NPR comes from the station and from log me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learned more if I go to meeting dot com\n[noise] from the F P certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org and from Amazon\nTo retirement an estate planning in the client's best interest let's make a plan dot org\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah widely Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene eight out of ten white evangelicals voted for President Trump and twenty sixteen and poll suggests they continue to strongly support him\nBut ahead of the mid term elections new group is trying to carve out a space for evangelicals who find themselves at odds with the president's rhetoric and policies as NPR's Sarah McCammon reports they're asking conservative Christians to think differently about issues like abortion it sounds a little bit like a church service\n[noise]\nAnd a bit like a campaign\nRally you murdered says you must vote Republican we're here to remind users\nOn a recent evening under the heavy branches of live oak trees Doug Padgett stood before a couple dozen people gathered on folding chairs on the Rice University campus in Houston\nBack home in Minneapolis patch it is a pastor and he describes himself as a progressive evangelical but right now he's traveling the country by bus preaching a message that juxtapose is Trump campaign slogans against quotes from the Bible\nFor we're here to be reminded versus the kingdom of God on behalf of all of them were [noise]\nWe must not before we're here to be reminded that you're doing the whole world is very little\nPatches organization is called the common good and their focus is evangelicals and other Christian voters who feel out of place in President Trump's Republican Party\nHad it that the group has about a million dollars in private donations their touring the country ahead of the midterms visiting more than thirty congressional districts chosen in part based on their religious makeup\nCongressman Ted Lieu of the Democratic congressional campaign committee has informally advised the group\nAnd event in San Antonio this week Tracy Goodrich who is still home schooling two of her for kids that she and her husband quietly left their evangelical church soon after the election\nThat kind of feel like I'm In the base where I grew up in the evangelical homes\nLeft their evangelical church soon\nAfter the election that kind of feel like I'm In the base where I grew up in the evangelical home\nAnd with the\nSeveral years has kind of not having feeling like I have a home as the things that I was about representing pricing Christ likeness had been completely the opposite things I see has been supported by family and friends and community\nCoverage says she voted for Republicans until twenty sixteen but she doesn't like the way Trump talks about vulnerable people she says like immigrants women and the poor she says many ever even ... friends initially opposed Trump until it became clear he would be the Republican nominee\nLike literally all of a sudden Donald Trump you know we couldn't see anything wrong with Donald Trump it was just like [noise]\nNow were blind to everything Donald Trump but it was all on the abortion issue could reach describes\nHerself as pro life but says a lot of other issues like helping the poor should be just as important to a Christian that's in line with the message boat common good is preaching as the group tours the country\nSinger me up have been traveling with the group performing him\nDo\nHe's grew up in a predominantly black Baptist church unlike their white\nEvangelical counterparts black Christians overwhelmingly vote for Democrats have said people who faced a history of disenfranchisement often see the abortion debate\nWhen you are fighting to keep your family together when you fighting to keep your children face from criminals and some ... when you don't know if someone's going to pick up your resume because of your name\nLike this is something that we feel we can leave in God's hands\nGot padded says since the bus began visiting parks in churches in early October the issue has come up again and again\nI've not thought or talked about abortion in Fifteen Years as much as I have the last three weeks\nIt published an op ed in USA Today this week arguing that evangelicals should put more energy into reducing abortions and trying to criminalize them and should vote against politician to support Trump's agenda\nChristian hocking who runs the anti abortion rights group students for life is a former evangelical who converted to Catholicism she says she's heard this argument\nA Christian Hawkins who runs the anti abortion rights groups students for life is a former evangelical who converted to Catholicism she says she's heard this argument before and doesn't think most conservative Christian voters will buy it because of how they view abortion\nThere are certainly a lot of issues that Christian care about when they go to vote by the end of the day we know that there is a human rights atrocity happening inside of our country and I trust me is abortion\nHowever the issues are framed poster Robin Jones of the public religion research Institute says moving white evangelicals away from the G O P would be an uphill battle\nYou know once you have several generations that are voting eighty percent Republican I'm it's left that they're doing that because of one particular issue and more than it has become in many ways a kind of tribal identity that's just inextricably tied to evangelical identity I think that that is the tie that binds much more than any single issue\nThe common good is trying to push beyond those identities talking to small groups have Christian voters almost daily in the weeks leading up to the midterms they say they're planning more events for the twenty twenty presidential cycle Sarah McCammon NPR News San Antonio [noise] um [noise]\nHere to some real and very edible evidence of something we've been reporting on NPR high interest in the midterm elections election day is still twelve days away but in many states voters are lining up at the polls for early voting\nYeah and one organization is helping them stay motivated to stay in line by sending pizzas it's a group called pizzas to the polls and it delivers free pizzas too crowded voting stations\nWe spoke to one of the founders of pizza to the polls his name is no among gr he says they started in the twenty sixth election to even\nBy the end of the election and Tony ... and we had raised over forty thousand dollars and cents or she doesn't get the country\nThe project founders use social media to make sure that those thousands of pizzas had hungry voters that real actual polling locations\nWe are for some sort of picture or report from social media to verify that there is a long line or a crowd at the place and when we do that for you to look up verify the actual polling place to make sure it's a real place\nNow it's important to note that they are a nonpartisan organization and anyone at the polling station is welcome to the pizzas they deliver\nCoworkers volunteers waiting in line to vote their kids you know\nAnyone can participate and you can donate today by going to the website pulls dot pizza there according to the\nThose are kids you know\nAnyone can participate and you can donate today by going to the website pulls dot pizza there according to the site you can help feed democracy and feed some hungry\nThis is NPR News\nThe Democratic nominee for governor in Illinois has contributed more money to his own campaign than any other\nCandidate in history and voters don't like that it's\nWell I think first and foremost what this morning has made clear is that there may still be more packages out there um this is not something that is a done deal at this point\nI'm that's in fact something that the FBI warned about yesterday when it came out with the statement about what it knew at that point in time what the FBI is doing is they've collected all of the uh the materials that they have so far all of these suspicious packages\nUm the ones that they had yesterday had been taken to a lab at Quantico, Virginia for analysis to look at the types of material used for fingerprints or other evidence but this is very much the early stages of this investigation\nNPR's Ryan Lucas and camera key thanks you guys You're welcome to keep ...\nOr the energy giant Exxon Mobil is accused of misleading investors and shareholders an analyst about the cost of climate change to the company's bottom line New York's attorney general Barbara Underwood is suing the company for ... shareholders and NPR's Wade Goodwyn has the story\nThe lawsuit doesn't hold Exxon Mobil liable for helping to create climate change it accuses the energy giant of misleading the investing public about how global warming was affecting the value of the company's fossil fuel assets around the world\nWhat the attorney general is essentially saying as you kept two sets of books\nThompson Zillow is the director of finance for the Institute for energy economics and financial analysis and former New York state comptroller ... says the allegations are about Exxon refusing to write down the value of its fossil fuel assets that are still in the ground\nTwo sets of books one internally that they were um keeping so that they on this\nFuel assets that are still in the ground\nTwo sets of books one internally that they were um keeping so that they understood what reality was and another more nuanced reality if you will for the investment public\nThe allegation really is that the company is not as big as it says it is and it's not worth as much as it says it is\nExxon declined to comment to NPR but released a statement that said in part\nThese baseless allegations or a product of closed door lobbying by special interest political opportunism and the attorney general's inability to admit that a three year investigation has uncovered no wrongdoing\nExxon Mobil is moved toward the investigation by attorneys general and three states alleging it's a conspiracy involving the Rockefeller Foundation tort lawyers environmentalist and democratic gay jeeze\nMichael Berger is a professor at Columbia Law school who specializes in climate change law\nBurger doubts axons conspiracy theories are going to hold up in court\nThis is about climate change it's about the risks that regulation hoses to the fossil fuel industry\nOver the next half century or more but this particular complaint is about corporate fraud\nAt the end of Wednesday's trading on Wall street shares of Exxon Mobil were down about three percent Wade Goodwyn NPR News Dallas [noise]\n\nThis is NPR News outstanding\nAchievements of young professionals age forty and under who live or work in Colorado Springs and we recognized that Daniel mayors young leader awards ceremony October thirtieth at the Colorado Springs plain news museum or information on the community counter link care C. C. dot ORG\nWhen one size does not fit all this sort of box that pun intended black box that we've often been put in\nIt's too small it doesn't fit any more of an old\nFilm pushing back against the one dimension analogy that black filmmakers had been fighting for decades now it's getting a new life that's next time on the take away from WNYC NPR I\nAt eleven o'clock you're listening to MORNING EDITION and the Senate in Colorado NPR station Ninety One point five ... the the\nIs this morning at eleven o'clock\nYou're listening to MORNING EDITION is as southern Colorado's NPR station Ninety One point five K. R. C. C.\nI'm Abigail Batman wishing you a happy Thursday morning the date is October twenty coming up at seven fifty one conversation was actress Robin Wright\nAnd show producers of house of cards about making the final season of the show without Kevin Spacey in the universe is that it is thirty six degrees of high today a fifty six partly cloudy\nIn hunter it's forty six should be some fog today clearing up for sunny skies this afternoon and highest sixty nine and in Colorado Springs it's forty five degrees mostly sunny today a high of sixty two\nProgramming on Ninety One point five ... or so you see is supported by springs community acupuncture at twenty eight twenty eight west Colorado on a mission to help listeners suffering from digestive issues allergies migraines and more fun more information about acupuncture out springs community acupuncture\nDot com bust Colorado Springs real harmonic presenting monster mensch this Friday and Saturday ... Thomas Wilson conducting\nSpooked calculator evening of music costumes encouraged view of real harmonic God or\n\nGood morning I'm Noel King today we take a moment to remember a woman would change Thanksgiving menu for generations\nIn Nineteen fifty five Newark is Riley a supervisor in the gamble company put together a recipe that calls and more\nGreen beans and fried onions\nThat casserole became a Thanksgiving staple among her other creations a tuna noodle casserole and sloppy Joes super burgers she passed away earlier this month at age Ninety two It's MORNING edition\nSupport for NPR comes from this station and from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a dragon drop email editor and twenty four seven customer service more ad campaign monitored dot com\nIt's seven forty five ... southern Colorado's NPR station Ninety One point five K. R. C. C. Republican congressman Doug Lamborn has represented color\nColorado's NPR station Ninety One point five K. R. C. C.\nRepublican congressman Doug land born has represented Colorado's fifth congressional district since two thousand seven and his bid for reelection this year he's facing a challenge from Democrats stephany rose Spaulding\nWe heard from balding yesterday and today we hear from land born about why he's running and what he hopes to accomplish is re elected he spoke by phone with Ninety One point five K. R. cc's Jake ground now\nWhy are you running for reelection and the ... congressional district\nShould I be fortunate enough to be reelected there are some things I really want to go back to Washington and work on I've been working on but we're not done yet I really want to make sure that the economy\nComes out even stronger\nThan before under Donald Trump and with the tax cuts that we've done the economy is just really booming right now and getting stronger and stronger we got to keep up this economic growth I'd say that that's number one number two is strengthening\nOur military and as you know I'm On the armed Services Committee and I have a senior position on that committee and that's a real opportunity for me to make sure that the\nMilitary is properly funded you know we have such a strong defense presence here in the ... congressional district in Colorado we we have a lot going on and I've been so involved in it\nBut the jobs not done yet and then I guess last Lee my third priority would be to help Donald Trump was immigration\nYou know we have a a border situation that's really not where it should be and I in a way I Know why people want to come to America um it's the land of opportunity but we have to have a reasonable and rational\nImmigration policy and we have to have some\nEffective border security as well\nSo you mentioned the economy and the tax cuts one aspect of that that you didn't mention is the deficit you know the congressional budget office has said that the tax cut bill has already increase the deficit and this most recent fiscal year are you concerned about that and and what do you think needs to be done\nJake I'm absolutely concerned about that and then we all should be concerned about it now let me say this the best long term solution which is getting spending under control and entitlements under control but we have to have gross\nLong term solution which is getting spending under control and entitlements under control but we have to have growth as a country the better gross we have as a country the easier it is to pay our debts\nAnother issue that you've been involved with is the repeal of the Affordable CARE Act you supported that in the past what are your thoughts on that issue at the moment obviously efforts to repeal the Affordable CARE Act to fail do think it's time to move on from that issue\nI Would still like to a repeal of Obamacare now we did repeal the individual mandate and that was a good thing the Republican plans did address preexisting conditions and I think did so in a very clear sided and\nHonest way by addressing people who have\nPre existing conditions as opposed to the Obamacare remedy which was to raise expenses for everybody require them to have insurance whether they wanted it or not or whether that was the best for them or not and then\nMoscow pay the price for targeting an elderly retired spy with a deadly nerve agents but what does Russia up to a friend who's next I'm Joshua Johnson who was recalled fires mix on on one from W. A. M. U. at NPR\nWhen a stark at nine o'clock that is in one hour here on southern Colorado was NPR station K. R. C. C.\nK. R. C. C. H. D. Colorado Springs Kate ... hunter K. C. C. S. stark veil and decay WTC than woodland park streaming at K. R. C. C. dot ORG good morning I'm Abigail ... looks like it should be warmer and dryer today\nPartly cloudy skies across the region with temperatures topping out in the fifties and sixties a bit warmer and sunny for your friday leading to a beautiful weekend temperatures in the sixties with these guys it's eight o'clock\nThis morning President Trump replace some of his usual attacks on Democrats in so called the fake news CNN with a call for civility let more and MORNING EDITION from NPR News\nAnd so called fake news CNN with a call for civility let more and MORNING EDITION from NPR News\nPresidents still got in some things that Democrat and his call for civility came after packages containing pipe bombs were sent to democratic leaders I knew well\nKing and I'm David Greene Alaska former FBI official how the investigation into those packages is going to play out in the Saudi crown prince limit allegations over the killing of a journalist actively courts foreign investors Thursday October twenty fifth birthday party when Darrell from the office after ... Robin turns forty seven\n\nLine from NPR News in Washington on corporate Coleman additional suspicious packages have been found today in New York City and in Delaware and one in Delaware was addressed a former Democratic vice president Joe Biden the one in New York was sent a liberal activist and actor Robert Deniro\nBoth are similar to several others suspicious packages sent it to democratic officials are supporters this week\nNew York state governor Andrew Cuomo told NPR's MORNING EDITION investigations are underway\nTo have the actual at least she goes to gauge who sent the packages trigger prince song to pay a postal inspection inspecting the devices themselves then you have a second level of investigation borders the motivation\nPresident Trump is also set a robust federal investigation is underway this morning he tweeted that some of the anger in the U.S is the fault of the media he demanded that the media quote must clean up its act fast exclamation point\nGeorgia election officials have until noon today to file a response to a judge's order to accept absentee ballots with questionable signatures from member station WBUR a B. E. and Atlanta ... Sharma reports\nA federal judge in Atlanta and says absentee ballots signatures that don't match what's on file must be accepted provisional ballots Sean Young of the ACLU Georgia represents one group of plaintiffs and says there were special concern for elderly and disabled voters\nI think the judge will recognize that for many absentee voters whose ballots are retracted because if a signature mismatched many of them will be permanently disenfranchised because they\nGuys that for many absolutely voters ballots are retracted because if a signature mismatch many of them will be permanently disenfranchised because they cannot vote in person to cure that ballot\nIn total more than twenty two hundred absentee ballots have been rejected so far civil rights groups have filed lawsuits suing secretary of state Brian Kemp over the rejections Kemp oversees elections and is the Republican candidate for Georgia governor for NPR News I'm this name ... in Atlanta\nTexas based ExxonMobil has been sued by New York's attorney general in his alleged the energy giant defrauded shareholders by miss dating the risk of greenhouse gas emissions to the company from Dallas NPR's Wade Goodwyn reports\nThe legal action is the result of a four year investigation by attorneys general first or New York and then other stage or whether Exxon Mobil engaged in a long running fraudulent scheme what was the village game\nEssentially the company claim that the cost of combating carbon emissions would be so high that no meaningful government restrictions could or would ever be implemented therefore investors didn't have anything to worry about and the company could pull as much oil out of the ground as it could procure\nExxon called the legal action against that ... type of blaming Al Gore Democrats and environmentalists Wade Goodwyn NPR News Dallas\nOn Wall street the Dow Jones industrial average is up more than one percent the NASDAQ is up more than two percent this is NPR\nIt's eight oh four I'm Abigail Batman with Ninety One point five K. R. C. C. news\nA master plan presented to the board of education for ... district sixty this week says the district needs nearly seven hundred eighty five million dollars in repairs the chief in reports the plant painted a quote dismal picture of age and failing buildings severely underutilized square footage in continual declining enrollment\nThe paper says two hundred Eighteen million dollars of the total cost would be used to fix critical issues that could lead to the closure of a school\nThe Denver based architectural firm that conducted the study suggested consolidating schools in boundary modifications as potential solutions\nThat series of town hall meetings on the master plan will be held in November and December to allow public input\nHealth officials are encouraging residents to get their flu shots Ninety One point five Kara K. R. cc's Caroline Williams has more to hospitalizations due to the flu have already occurred in El Paso county health officials recommend anyone\n... Williams has more to hospitalization due to the ... have already occurred in El Paso county health officials recommend anyone six months of age or older get vaccinated especially children the elderly and those with respiratory conditions\nThe flu season tens to peek in January or February that can begin as early as October and continue through may\nNearly five hundred people in El Paso county were hospitalized with flu related symptoms last year in addition to getting the vaccine El Paso county public health also recommends people wash hands cough into tissues and stay home if sick with symptoms\nFor Ninety One point five K. R. C. C. News I'm Caroline Williams ... Ninety One point five K. R. C. C. new support\nFor NPR comes from NPR stations or their contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future or variable where books are sold\nNinety One point five care cc is dedicated to covering a changing southern Colorado your membership dollars direct refund our local reporter brick you for your system and membership\nIt's six minutes after eight o'clock\n... and thank you for making us a part of your\nThe u._s. stock market opened higher this morning after an intense sell off wiped out this year games\nAnd there's a lot of buzz about how big data and now blocked Jane will quote solve climate change scientists are concerned that the hype plays into a dangerous idea that there's a technological magic bullet those stories and more at MORNING EDITION continue on Ninety One point five\nIn light of it is forty one degrees cloudy today a high of sixty in canyon city it's forty five should be mostly sunny today hide eighty and in Colorado Springs we have forty five degrees a high today I'm sixty two\nAnd ... he is actually sixty eight not going to be eighty degrees today my apologies my apologies\nNPR oh Ninety One point five through your she she supported locally by the Colorado Springs fine arts center at Colorado College resented Virgil or teams revolution Roger densely ambrosia reimagining which they knew the Pueblo Revolt five hundred years later on you know Colorado College dot edu slush [noise]\nA deep level of rubble five hundred years later on you know Colorado College dot edu slash FCC [noise]\n[noise] It's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California we have confirmation now of two more suspicious packages that were found this morning a law enforcement official says a suspicious package addressed to former vice president Joe Biden was found in Newcastle county Delaware\nAnd a spokesperson for the New York city police department confirms to NPR that another suspicious package was sent to the actor Robert De Niro who has a prominent critic of President Trump\nNPR's Hansi Lo Wang is in New York reporting on this story Hi there Hansi during David All right let's go through these let's start with the package that was apparently sent to for a vice president Biden what do we know at this point\nWe'll details are really still coming in but what we know for sure is that as you mentioned it it did was sent to Newcastle county Delaware and Delaware scores his home state of former vice president Joe Biden and that was confirmed by law enforcement source who spoke to our colleague Ryan Lucas\nAnd do we know anything about whether this is similar connected to these other packages that were sent a prominent Democrats um like Hillary Clinton yesterday that we've been we've been speaking about this morning\nWell this force with a source who spoke to our colleague Ryan Lucas did confirmed that it does resemble other suspicious packages that have been discovered this week and just already there really still investigating exactly uh what can within side of it and and what we may learn a the the motives here\nThat the governor of New York Andrew Cuomo we spoke to him this morning um he was telling us about this package that was sent to Robert De Niro his home in Tribeca he said that that is another one seems to be similar to the other ones we've been talking about um what so far or police in New York saying about that one\nIt involves sports apparel companies scouts coaches parents financial concessions and billions of dollars in his new book at the last temptation of rip Pitino join us [noise]\nFresh air every weekday at noon here on Ninety One point five yards D.C\nSouthern Colorado's NPR station it is eight twenty or listening to MORNING EDITION\nIn Ninety One point five ... southern Colorado's NPR station it is each twenty or listening to MORNING EDITION [noise]\nComing up voters in four states including here in Colorado are set to decide whether they should take the power to drop political boundaries away from politicians we'll we'll hear about a proposal in Michigan that is coming up at eight thirty\nIn woodland park it's thirty four degrees the height of fifty two and ... below forty three sixty six for the high today and in Colorado Springs it's forty five degrees a high of sixty two\nShould be partly cloudy to mostly sunny across the region today warming up a few degrees for your friday leading to a sunny warm and dry weekend [noise]\nProgramming\nOn Ninety One point five ... or cc is supported by wolf creek ski area open for the season on weekends with the ... and nine inches of loose do for the latest storm will freak lodge features a full menu and the ... school and rental shop are also open details of wolf creek skied dot com\nBust Colorado Springs philharmonic presenting monster mensch this Friday and Saturday\nOf pikes peak center Thomas Wilson conducting ... evening of music costumes encouraged us feel harmonic dot org\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no ally ally Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nFrom his Cox insurance providing customized insurance for small and medium businesses so they can do more and being more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nAnd from Subaru featuring the all new three row ascent with feeding for up to eight had a choice of second row captain's chairs love it's what makes us Subaru was Subaru learn more at Subaru dot com\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning us markets opened up this morning after a rough day yesterday the Dow is ...\nFrom NPR News I'm David Greene and I'm Noel King good morning\nUs markets opened up this morning after a rough day yesterday the Dow was trading up about point eight percent this hour\nBut I don't think the market volatility we've been seeing in the past couple of weeks is not over NPR's Yuki Noguchi joins us now to discuss some of these markets swings can morning ... good morning oh All right so it has been a choppy October yesterday markets closed down and the Dow innocent people basically erased all their gains for the year what has been going on\nIt's because investors are conflicted and one of their biggest underlying concerns is the global economy you know how the trade war will play out and how higher terrorists might effects it might affect U.S companies\nAre you're starting to see some of that already a caterpillar which makes farm equipment and three M which is a huge conglomerate that makes everything from sponges to car parts\nAh this we talked about how that's starting to affect their bottom line now on the plus side the economy and labor market are and\nHave been chugging along so there are no clear indications that that's going to hit a wall or some companies are beating expectations and although interest rates are heading up there still historically low\nAll right so some good factors some bad factors one of those sectors that's been hardest hit in recent days is the tech sector yesterday the NASDAQ which is made up of a lot of tech stocks I had one of the worst days in seven years and this morning we should say it is trading up but what is going on in the technology sector\n... well the technology sector has been on an even steadier and stronger Bull Run in recent years I'm apple this summer or you might recall became the first company to reach a trillion dollars in market value so basically ... tech stocks have already risen very high end of a lot\nFurther to fall on and when you have a ... few companies talking as you saw this week about week sales or miss profits\nOn that makes investors nervous that perhaps those stocks are overvalued and tech is a great example actually of how the volatility kind of spreads around the world yesterday you had some us tech firms including Texas Instruments and\nAT and T. reporting some weaker earnings which then prompted the Asian tech stocks including Sony and Samsung to fall overnight\nBut then by the morning you had stronger results out of European tech firms in some U.S companies including Microsoft and Twitter this morning and that's helping shore up some of those losses\nSo it kind of good contagion\nEuropean tech firms and send U.S companies including Microsoft and Twitter this morning and\nThat's helping shore up some of those losses so it kind of good contagion they're eating nerve wracking though to see the markets lose like six hundred points in a day and analysts say this could continue for a while really quickly why is that\nIt's largely because we don't have clarity on some of the questions that I outlined at the outset where's the global economy had it how much of a trade war is going to affect companies\nUm and into investors feel they have a clearer picture on that you are likely to see strong reactions to any kind of news that could be interpreted as a significant development and we'll get another chance a later today with Amazon and Google alphabet reporting their earnings NPR's Yuki Noguchi thanks so much thinking well\nAccording to a un climate report that was released earlier this month the world has only about twelve years to roll back carbon emissions and avoid the worst impacts of climate change\nSilicon Valley has been at work on a solution for years often promising quick fixes block chain the technology behind crypto currency like bitcoin is the latest solution coming from big tech\nMember station KCUR December net has more\nUntil about a year ago hardly anyone in climate science was talking about watching but at the recent global climate action some in San Francisco it was all over the place there were panels papers people were talking about how he can help mitigate climate change in all\nSorts of ways in agriculture part of its oil sorcery show\nOur ... climate change coalition he came to the conference to spread awareness about plunging so what is it\nA long chain or distributed electric technology really references a larger system of technology\nOkay [noise] think of it like the ... is like an accounting\nBook everyone can see a distributed ledger it's a record of transactions that isn't held by a central authority like a bank but it said on the computers of everyone on the block chain\nTransparency is its main advantage tons of new companies are springing up saying that they will use the transparency block Jane to solve all sorts of problems everything from curing cancer to ending human trafficking and now even climate change\nIts it's our intention to build the infrastructure to make it possible to reverse climate change\nBall gamble used to be a software product manager he's working on climate change now but he's still makes the grand tech world pitches he's the CEO of a new Silicon Valley company called ...\n... the black chain based marketplace that makes it easier for people to pay for it\nBrand tech world pitches he's a CEO of a new Silicon Valley company called ...\n... the black chain based marketplace that makes it easier for people to pay for removing carbon dioxide from the atmosphere\nRight now California parts of the U.S and Canada the European Union and the number of other countries are participating in cap and trade carbon credits systems the total number of carbon possible to admit it kept and then companies can buy carbon credits that let them in more\nEconomists love this market based solution but there's a problem when it comes to counting the carbon\nCarbon markets in the past have been plagued with issues of fraud and double counting\nNobody wants to use block chain to verify the accounting end to go one step further to create a market for people taking carbon out of the environment\nAnd then the company has been launched yet but that isn't limiting the ambition of the sales pitch you want to make the whole climate change problem just go away so do scientists like Douglass McCauley yeah I Wish it was that easy\nBecause he's a researcher at UC Santa Barbara you said the danger of Silicon Valley is big promise disrupt everything eat those is that it suggests there's a quick and easy solution\nThe things that the climate change are going to be really hard\nLike getting countries to cut emissions or people to stop driving cars the pollute because I said before it was blocked Jane artificial intelligence in big data were the hot new things and these are proven to be valuable tools for climate research but in each case it took scientists a few years to cut through all the hype\nWe need to look past the shiny thing and start talking about exactly how to apply it usefully\nBecause it could help with things like counting carbon credits or keeping track of say how many trees the company is planting to suck carbon out of the air Katherine mocking a climate scientist at Stanford agrees but she says it's dangerous to believe block chain will be some kind of a miracle cure\nIt's essentially can kicking ethics where we won't be putting into place the solutions that are actually more important to make the entirety of the problem something that's how people\nWith a clock ticking on climate change there ... there is no time to waste sorting facts from high\nFor NPR News I'm Sam honey [noise]\nThis is NPR News\nThe Democratic nominee for governor in Illinois has contributed more money to his own campaign any other candidate in\nHistory and the owners don't like that\nHistory and voters don't like that\nThis as well please let me know smiley face\nThat's Katie Faye he the organizer of voters not politicians she had put up a similar post ... years ago and nobody even liked it but this time people were clicking the like button and they actually wanted to health\nAnd then here's where we have our printer fanciest printers that our campaign has said he\nIs showing off voters not politicians newest field office the redistricting initiative she launched has amassed hundreds of volunteers and raised more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names tape to the bottom so that they can get their chairs and tables back\nI'm hoping to find a coffee maker that can be donated [laughter] um but some food and stuff like that and\nRight now lawmakers in power a get together and draw district lines before getting them approved by the governor Michael ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear that their number one goal above protecting communities of the geographic otherwise er Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten far more votes overall\nThe redistricting proposal would create a commission made up of four Republicans four Democrats and five independence a majority that includes a mix of all three would have to agree on the maps\nBut the opposition calls the proposal an expensive way to change your system that already works when delete harbor is a Republican and has worked for for secretary of state she says this whole thing is skewed to help\nDemocrats a gimmick and its bypasses are elected official in our democracy and if they want to have the pen they need to win elections\nThe initiative comes at a time when voters are frustrated with politics and government Bernie porn is president of ethics MRI appalling and research firm\n... building for years\nHe says that frustration came to a head in twenty sixteen\nPeople were just show to trade for the government to the federal level\nBuilding for years he says that frustration came to a head and twenty six ten\nPeople were dissatisfied with the government the federal level is really what you know four members of Congress should their donors and corporations they're left out in the\nCoal polls looking at the redistricting proposal show it's been gaining popularity over the last few weeks but it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal one\nWhy should the parts in an office get to decide like who gets to vote in that area\nWhen I have a right to choose and and it just makes me wonder well how much rights do we really have\nEven if the redistricting measure passes that's not the end of the road legal challenges to the commission's decisions seem all but certain for NPR News I'm Shana raw in Lansing, Michigan [noise]\n\nThis is NPR News engineer from NASA at the forefront of Mars exploration will share his for unraveling the mysteries of space and Mars over twenty six in the center for the arts formation on the community ... K. R. C. C. dot ORG\nWhen one size does not fit all this sort of box that pun intended black box that we've often been put in\nIt's too small doesn't fit any more an old film pushes back against the one dimension analogy that black filmmakers have been fighting for decades and now it's getting a new life that's next time on the take away from WNYC NPR eyes\nYou can listen to the take away this morning at eleven o'clock on Ninety One point five K. R. C. C. or on our free mobile app it's available in the eye to the store and Google Play you can always live stream us on our website as well that is K. R. C. C. dot O. R. G.\nIt's eight forty four I'm Abigail back then and you're listening to MORNING EDITION\nComing up on the marketplace morning report online retail giant Amazon is putting its own name on a few new brick and mortar retail stores and they're skipping the cashiers that plus all the morning's business news coming up at eight fifty one\nYou knew brick and mortar retail stores and they're skipping the cashiers that plus all the morning's business news coming up at eight fifty one [noise]\nImmunity stats thirty nine degrees partly cloudy today highest fifty six in Raton it's thirty five forty nine cloudy today and in Colorado Springs at forty six degrees most me sunny with a high at sixty to\nNPR on Ninety One point five to your cc is supported locally by the Colorado Springs independent newspaper featuring the twenty eight team best audition available October twenty fourth through November six foot newsstands or at sea as indeed dot com\nBust springs homes dot com where realtors Joe and Jennifer boiling leverage their team myriad social media and the tools with technology to reach buyers is they start looking for their new details or online at springs homes dot com [noise]\nGood morning I'm David Greene with a warning to the people of Oklahoma City don't be fooled\nOrdered at McDonald's and have your cheeseburger\nLeaned ignore that for a dog will be a long way are you hoping for a bike that is no stray that it's princess\nWho's owner caught her in the act in and out viral video she leaves home walks to Mickey D's puts on her sad face and gets people to give her chunks of cheeseburger we will not be out smarter by this dog take a stand Oklahoma City It's MORNING edition\nSupport for NPR comes from this station and from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Harvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot Emmy slash executive\n\nMORNING EDITION from NPR News I'm Noel King and I'm David Greene a federal jury in New York has found three people guilty of fraud\nThey were convicted yesterday of paying tens of thousands of dollars to the families of top flight basketball recruits one of those convicted James gotcha worked for Adidas and steered certain students to Adidas sponsored colleges schools with storied basketball programs such as the University of Kansas and\nLow for among them ... longtime coach Rick Pitino was forced out of a job over all this but he was not even brought to us\nGraham's such as the University of Kansas and little for among them\n... longtime coach Rick Pitino was forced out of a job over all this but he was not even brought on trial\nNow joining us to talk about this case and what the NC double a can do to clean up corruption and college athletics is Washington Post sports commentator Kevin Blackistone also a familiar voice on our program had their Kevin hey how you doing to I'm good thank you so what does all this mean for college basketball as a whole what happened yesterday\nYou know I'm not sure it means anything for college basketball um in in total because what happened here it was a pretty isolated incident um but what it does is it exposes the recruiting practices have been going on in a big time college athletics and football and particularly in basketball\nFor as long as I can remember and that is basically the channeling of money from a one source\nUm to the families of talent um to ensure that that talent goes to a particular school and what has happened over the years is that the uh manufacturers of of basketball shoes Adidas\nTo Nike ah those those uh operations\nHas gotten people in the middle of them\nUm to help transfer that money\nSo that the surprise here is that it has been criminalize 'em by the federal government as opposed to be policed by uh the NC double A. as it's been done for years and it used to be that the worst thing that would happen in the situation is that a someone would be banned from\nThe NC double a coach who was who was caught\nFunneling money or or some middle man\nNow it's like going out Iowa which is which is a step I Am\nAbsolutely now you could possibly go behind bars which is uh what these uh these three men are facing\nWhat you have these three men facing that you'd say um but I Wonder your colleague at the Washington Post Sally Jenkins room recently that the real defended here should be a university but the universities are actually considered victims and all of this do you see at the same way that she does I\nDon't see it that way but that was the way that the federal government decided to get involved in this basically they said that the ... universes were being defrauded 'em by this system\nAh because by funneling this money on two players are are players families um these people knew that they would\nBecause by funneling this money um two players are are players families um these people knew that they were making these players in eligible under instead you double A. rules and therefore that at some point\nIt would all be found out and they wouldn't be allowed to play to the universities that he'd given them scholarships\nAnd therefore they had to fraud at the universities of of value\nWhich is a very strange thing to me because I still don't know\nHow that's fraud I mean universities or a university basketball programs and football programs are still going to get these talented players under they're very um a low level of remuneration a for athletic talented brings them um tens of million dollars in revenue every year", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Colorado Springs", "day": "25"}