{"month": "10", "state": "CO", "station": "KRCC", "content": "\nNot from this edition of assignment on San coax the producer was pulled grant table from the series go to the b._b._c. will ... dot com forward slash assignments\n\nNot so from this addiction that assignment on Simon coax the producer was pulled grunt table from the series gets a BBC will ... dot com forward slash assignments you can\nSum up dirt Raymond caissons activism in forwards show up dive in we have to be on the inside can't just be an out that only strategy and that is very different than it was before Trump won since Michael Brown was shot dead in Ferguson, Missouri McCutcheon has become\nA leading voice and the lightning rod in the black lives matter movement now he's telling his own story next time on one hand\nOne a day nine AM when we drive the or these [noise]\nIf you are looking for something to do in the Ninety One point five care cc listening area check out the community calendar link care C. C. dot ORG and you can submit your event there as well [noise]\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. A. C. C. la hunter KCBS ... n K W C. C. F. M. woodland park streaming a day or C. C. dot org\nWho\nMorning the governor of Florida for the weather channel ... cook scared to death for people in the panhandle decided not to evacuate entered the latest on MORNING edition some\nAds are again Michael made landfall in the storm ripped job and blue how her from their foundation I'm Rachel Martin\nAnd I'm David Greene in Germany a far right anti immigrant party may be gaining more around ... signal a deal on Britain's departure from the ... you would be close\nRosa marketing and sixtieth anniversary of NASA of a government agency so did you have that moment watching third Iraq when you realized ... Audrey cut them Vicki and national lampoon vacation okay I did\nThanks again for ... boat and a happy fifty it's on the Thursday after overloaded\nGives the news\nAnd as hurricane Michael made landfall this storm written roof top and blue held her from their foundation I'm Rachel Martin\nAnd I'm David Greene in Germany a far right anti immigrant party may be gaining ground ready to go see it or signal a deal on Britain's departure from the ... you would be close Rosa marking the anniversary of NASA and the government agency so did you at that moment watching thirty rod when you ... some odd reason cut them\nVicki and national lampoon vacation okay I think the ... vote happy fifty it's on a Thursday after eleven years in his\n\nLife from NPR News in Washington on corporate Coleman a Russian rocket carrying astronauts to the international space station experienced a critical steal your during lunch today it forced the two men brushing American crew to make an emergency landing they survive and are tend to be in good condition Matthew Bodner reports from Moscow\nWhat started as a routine based shot for most of the historic biking or causing a drum quickly turned into a nightmare today when it's all use rocket failed midway through its launch Russia space program deep in crisis as experienced the series of high profile launch failures over the past decade\nBut never in the twenty year history of the IOC that program has a man who use rocket experience the problem on march the failure followed the discovery last month of a mysterious hole in his ... spacecraft currently talk to the international space station\nThat has raised sharp questions about quality control for NPR News I'm Matthew Bodner in Moscow\nWhat was hurricane Michael continues to weaken over Georgia it now a tropical storm with ... wins fifty miles per hour Michael continues to move east and it's projected to reach South Carolina this morning\nI mean all the damage estimates are beginning to come in Georgia Public broadcasting Steven salary reports Georgia's agriculture industry could be badly affected\nMost of the state's cotton peanuts and pecan farmers were in the storm's path and losses could be widespread many crops are in the early stages of being harvested a process not helped by high winds and heavy rains former Georgia governor and current agriculture secretary Sonny Perdue says the U.S da is ready to help farmers recover\nSteven Fowler reporting authorities\nSay the storm has killed two people a girl in Georgia and demand in Florida stock markets in Asia fell sharply overnight with stock exchanges in Shanghai in ... boat tumbling more than five percent\nNPR's Rob Schmitz reports on Wednesday the Dow Jones industrial dropped more than eight hundred point it was the third day\nOf being harvested a process not helped by high winds and heavy rains former Georgia governor and current agriculture secretary Sonny Perdue says the USDA is ready to help farmers recover\nSteven Fowler reporting authorities say the storm has killed two people a girl in Georgia and demand in Florida stock markets in Asia fell sharply overnight with stock exchanges in both Shanghai in Shenzhen both tumbling more than five percent\nNPR's Rob Schmitz reports on Wednesday the Dow Jones industrial dropped more than eight hundred point\nIt was the third biggest single day drop and the Dallas history and Asian markets followed suit Hong Kong counseling index was down nearly four percent on the mainland the Shanghai composite for more than five percent and the ... composite plunged nearly six and a half percent\nIn Taiwan the tech heavy ... dropped more than six percent which shares of lens maker and apple supplier log on precision tumbling nearly ten percent\nMarkets elsewhere in Asia also fell sharply meanwhile the price of major crypto currencies including bitcoin plunged with Thirteen billion dollars worth of value being wiped out and just a matter of hours\nOn Wednesday President Trump blamed the Federal Reserve for raising interest rates despite market turbulence calling Wall Street fell off a long awaited correction Rob Schmitz NPR News Shanghai\nDisaster officials in Indonesia said the official search and rescue effort for victims of the earthquake and tsunami will end today in the provincial capital Paolo the death toll is more than two thousand people feared five thousand others are still missing you're listening to NPR\nFederal authorities say they arrested and charged demand in New York with making a huge bomb in his home federal prosecutors and the FBI alleged poll Rosenfeld plan to bomb the national mall in Washington D. C. authorities say they found that two hundred pound bomb in his basement\nThe officials allege Rosenfeld intended to kill himself in any random politician he happened to strike along with civilian\nThe U.S Forest Service is finally getting an official by NPR's Kirk Siegler reports the Trump Administration has tapped interim chief Vicki Christians in to lead the agency Vicki\nIn his overseeing state forest in Washington in Arizona and spent the past seven years in Washington DC with the federal Forest Service\nShe's also been a wild land firefighter and has worked extensively and fire management that is one of the biggest and most important roles of the modern day Forest Service that is a highly scrutinized position she'll ever see a hundred and fifty for national forest in twenty nine\nAnd to strike along with civilian the U.S Forest Service is finally getting unofficial bard NPR's Kirk Siegler reports the Trump Administration has tapped interim chief Vicki christiansen to lead the agency\nVicki christiansen is overseeing state forest in Washington in Arizona and spent the past seven years in Washington DC with the federal Forest Service\nShe's also been a wild land firefighter and has worked extensively and fire management that's one of the biggest and most important roles of the modern day Forest Service this is a highly scrutinized position she'll oversee a hundred and fifty for national forest than twenty national grassland\nChristians and also takes over the agency at a time of turmoil her predecessor resigned earlier this year I met a sexual harassment investigation\nThe agency is still grappling with numerous complaints and lawsuits many in California over alleged sexual misconduct by supervisors Kirk Siegler NPR News\nThe U.S energy administration says it will cost more to heat homes this winter that's because fuel prices are going up not because it's colder homes that you'd heating oil will pay on average twenty percent more about Seventy dollars\nAbout half of us household use natural gas and those prices are expected to increase about five percent more this winter or about thirty dollars It's NPR\nSupport for NPR comments from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nWas well loved well you [noise] Nineteen Ninety seven quieted down [noise] absolutely no bells and whistles we had tried to sell it my teenage daughter thought\nThey would get money out of it and I'm like no no one's going to buy it and probably about six months ago I was like okay we're down there and it's the simplest thing I've done\nIn the hotel guy was one so\nI'm Susan I live in Colorado Springs and I was okay I see the [noise] to your cc dog or did you work hard to imagine information\n[noise] my name is enjoyment Sharma president and owner of monument occupational medicine and money was Colorado are targeted audience are owners will companies HR professionals safety managers and injured workers go to the medical care that they need to get\nBack to work or CC's helped us quite a bit and we were able to obtain a lot of access to individual we normally wouldn't have access to through other means of advertising\nIf you'd like to become an underwriter like me who's called Jeanette\nAnd I was ... to your cc dot org jeep or car during this information\n[noise] my name is Andrew in charm president and owner of monument occupational medicine and money was Colorado for target audience are owners of companies HR professionals safety managers and injured workers go to medical care that they need to get\nBack to work really cares he's he's helped us quite a bit and we were able to obtain a lot of access to individual we normally wouldn't have access to through other means of advertising\nIf you'd like to become an underwriter like me please call genetic seven when nine four seven three for eight zero one\nHey everybody does it through the foster this is Krista hello this is Michael from spirit we seem\nTo Ninety One point five K. or see the music seven pm get made Ninety seven Ninety two we\nProgramming on Ninety One point five kill your cc is supported by Colorado Springs philharmonic presenting ... Patricia with Joseph ... Dominican conducting this Saturday and Sunday and probably speak center more at the U.S philharmonic dot org\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Rachel Martin in Washington DC officials in Florida and Georgia are surveying the damage caused by a historically powerful storm hurricane Michael struck the Florida Panhandle yesterday as a category ... storm one of the strongest to hit the region since records began being kept in the mid ... century\nIt tore through the panhandle into Georgia whipping trees from the ground and roofs from home\nIt is now been downgraded to a tropical storm at that point but that still means a lot of rain and wind as it moves north and east into the Carolinas\nJoining us now NPR's Tom Gjelten from ... North Carolina tons of money when Rachel before we get to the conditions where you are what can you tell us about the extent of the damage in the Florida Panhandle\nWell from what I'm saying you said historically powerful it appears that the impact of the hurricane was more like a bomb than a than a hurricane I mean buildings literally exploded from the force of the ... so it's just I mean around Panama City Florida that pictures\nThat we've seen are just spectacular I mean it was it was truly power [noise]\nAppears that the impact of the hurricane was more like a bomb than a than a hurricane I mean buildings literally exploded from the force of the win so it's just I mean around Panama City Florida the pictures\nThat we've seen are just spectacular I mean it was it was truly power\n\n\n\n\nThis is NPR News\nFor who they are [noise]\nShe was murdered in her new home\nShe should've said [noise]\nShe should've little\nMurders of transgender women and men of color are on the rise\nWe've for why they're being targeted and what's being done to protect them that conversation next time on the take away from WNYC NPR I\nTake away the data Lebanon am on Ninety One point five to your cc southern Colorado's NPR station\nThis is the case for the Laurie calling charitable trust\nMy good friend Dr lord Cohen asked me to help finish them task for her lawyers gift to the care cc legacy fund helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... legacy fund can be found at our website K. R. C. C. dot award gee\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\nThis election year you can count on not to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsroom we bring you insightful reporting to help you understand the issues and the candidates you make it possible by donating at K. R. C. C. dot org thank you\nProgramming on Ninety One point five to your cc is supported by ... hospice and palliative care committed to helping raise awareness of the power of palliative care to help people live their lives to the fullest with the time they have details at ... dot org\nEngineer from NASA at the forefront of Mars exploration will share his enthusiasm for unraveling the mysteries of space and Mars in particular in October twenty six at the epicenter\nThe candidates you make it possible like donating at K. R. C. C. dot org thank you\nProgramming on Ninety One point five to your cc is supported by pikes peak hospice and palliative care committed to helping raise awareness of the power of palliative care to help people live their lives to the fullest with the time they have details of pikes peak hospitals dot org\nEngineer from NASA at the forefront of Mars exploration will share his enthusiasm for unraveling the mysteries of space and Mars in particular over twenty six at the center for the arts for information on the calendar linked cameras to see that a large\nE\nSupport for NPR comes from this station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and beer styles that visit\nMain dot com [noise] from capital one\nOffering a variety of credit card options with features for a range of customers from foodies to travelers capital one what's in your wallet credit approval required capital one bank usa an a\nFrom Amazon Prime video presenting the return of the man in the high capital where America's history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nAnd from listeners like you who donate to this NPR station\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene the European Union considers itself a haven for journalists who were persecuted in other countries but in the last year the twenty eight member block has faced the murders of two investigative journalist with in its own borders\nSo when the host of a TV show spot letting corruption was found raped and murdered in Bulgaria last weekend you leaders demanded an investigation Joanna Kakissis reports from roots of Bulgaria where the murder took place [noise]\nTV host the ... by pulled friends last Saturday that she was going jogging\nA few hours later her body was found in a wooded park along the Dan River she had been beaten raped and suffocated retired iron worker ... told police he'd seen a man running away from the scene that day we'll huddle much of this\nWould not have been looted placed on most days of the people here every day now that the away because of her murder\nMy you know though was well known in the slush\nTV host Victoria ... told friends last Saturday that she was going jogging\nA few hours later her body was found in the wooded park along the Dan River she had been beaten raped and suffocated retired iron worker George ... told police he'd seen a man running away from the scene that day you know little about you just\nPut in place on most days people here every day now that the away because of her murder\nMoney though was well known in the slush scenic city of about a hundred and fifty thousand people she was young driven starve a local private channels run by her ex husband spilling moxie ... she wouldn't be satisfied\nJust to just to find out the truth or bring it to the public she wanted to change much seem of had wanted her to host the fashion programs but she refused she was interested in social inequality\nAnd corruption so she created an in depth news program called the pet store and it will take the flu is the first story she featured was about Bulgarian politicians and businessmen misusing European Union funds it was a joint report by independent\nJournalists in Romania and Bulgaria [noise]\nHer producer Yvonne Stefano anticipated backlash ... photos of\nThe two on two reasons when money no that turned out murdered Stefano says an international press group offered to evacuate him out of Bulgaria\nOr ... or or will not\nGo all those things you are because we must smoke free\nPress group said journalists are vilified everywhere Ernest Gaga over the international federation for journalists told a TV network euro news that they're increasingly targeted and murdered all over the world\nAnd doing the difference between the other parts of the war in the middle of you who don't try to find a true political we interview for five or go to this kind of problems and it'll be a bit of two or three of us goods from authorities\nIn a new member states are currently investigating too high profile murder of journalists\nBoth were investigating corruption Slovak journalist young ... and his fiance were both shot dead in February in their home in southwestern Slovakia\nThree people were recently charged and the murders and almost a year ago in the ... smallest member state the island nation of Malta investigative reporter Daphne kind of want to\nSo we're in the U ... kind of problems and also the ability to all day I was investigated this from\nAuthorities in a new member states are currently investigating too high profile murder of journalists both were investigating corruption Slovak journalist young ... and his fiance were both shot dead in February in their home in southwestern Slovakia\nThree people were recently charged and the murders and almost a year ago in the ... smallest member state the island nation of Malta investigative reporter Daphne kind of want to go to let's see I was blown up in a car bomb the mastermind is still at large\nKind of want a glitzy a son Matthew who is also an investigative journalist describes the dangerous in reporting on corruption\nEvery ... years investigating corruption over long periods of time I'm just really deep into a story they all feel all their lives just ongoing everyone\nIn the most dangerous things over and ... [noise] it's still\nNot clear why the Bulgarian TV host Victoria ... was murdered though police say the evidence so far indicates she just may have been in the wrong place at the wrong time\nThey say they haven't proved to charge a Twenty one year old voter Gary and man with a criminal record for the murder he fled to Germany and was arrested their money and all of us ex husband spilling mock seem of lights the candle at a memorial for her near a fountain he says he trust the authorities\nFrom the ... the right now with the with the clues for this but it's also a view that journalists in Europe have been murdered and the un and there's a problem and we have to deal with it\nHe wants to European leaders to keep pushing for press freedom for NPR News I'm Joanna Kakissis in Russa Bulgaria\n[noise]\nStock prices had their worst day since February on Wednesday with the Dow Jones industrial average losing more than three point one percent of its value\nAnd it still has continued today in international markets stocks were down in Asia and Europe and China is most important index fell by more than five percent at NPR's Jim Zarroli reports investors are coming to grips with with rising interest rates and worries about the trade fight with China\nPrices were down for much of the day then late in the afternoon they seem to fall off a cliff with tech stocks such as Facebook and Amazon\nStock prices had their worst day since February on Wednesday with the Dow Jones industrial average losing more than three point one percent of its value\nAnd it still has continued today in international market stocks were down in Asia and Europe and China is most important index fell by more than five percent at NPR's Jim Zarroli reports investors are coming to grips with with rising interest rates and worries about the trade fight with China\nPrices were down for much of the day then late in the afternoon they seem to fall off a cliff with tech stocks such as Facebook and Amazon hit especially hard among the catalyst was a profit warning from specialty chemicals company P. P. G. industries which said it was being hurt by higher costs and softer demand in China\nScott Anderson chief economist at bank of the west says investors are realizing that trade fight with Beijing won't end soon\nGiven the rhetoric returning on both sides between us and China looks like both sides are selling for a long term trade fight you're\nAmong the big losers yesterday were Boeing and caterpillar which do a lot of exporting but yesterday's route had other causes as well jak apple and chief investment officer at crass wealth advisors says in recent years the Federal Reserve and other central banks have kept interest rates low now they're rising again\nIt will mean mortgage rates are up financing costs are up so we'll take some of the boost that we've had in the economy and tone it down\nAnd ... says it will probably take a while before interest rates find their natural level so expect them to keep rising\nI view the this is really part of this movement in these tectonic plates that are going on underneath the surface\nAllen says there are other reasons stocks are falling such as uncertainty about the midterms in what they will mean for President Trump's economic agenda\nThe good news he says is that the economy remains basically healthy overall\nThat is the message that Trump himself is trying to stand after yesterday's big drop in prices the White House put out a statement saying the economic fundamentals are incredibly strong\nAnd it said President Trump's economic policies have created a solid base for continued growth Trump also once again attacked the fed for raising interest rates saying I think the fed has gone crazy\nThat is the message that Trump himself is trying to stand after\nYesterday's big drop in prices the White House put out a statement saying the economic fundamentals are incredibly strong\nAnd it said President Trump's economic policies have created a solid base for continued growth Trump also once again it attacked the fed for raising interest rates saying I think the fed and gone crazy\nHe'll Hernandez from member station W H y y report\nMenendez was fired up as he spoke to a crowd in Princeton New Jersey last month he's kept himself as a foil to President Trump whose approval ratings in the Garden State or in the thirties Jersey and I\nDon't need someone who will stand with Donald Trump they need someone who will stand up to Donald Trump\nContrast that with the Bob Menendez of ten months earlier last November he had just walked out of a federal courthouse in Newark a free man after a judge declared a mistrial and his corruption case those\nNew Jersey you gave me the benefit of that [noise] I think justice\nDepartment prosecutors had accused Menendez of taking gifts and trips from a wealthy friend in exchange for political favors\nBut then there's a scape legal trouble but he was officially admonished by the Senate and his poll numbers in New Jersey took a hit and it wasn't long after he announced he would run for reelection that attack ads like ... started appearing on member would\nBy Obama jak department for taking hundreds\nThousands of dollars in improper again and campaign contributions\nNew Jersey deserves better\nThat that ad comes from and then there's his opponent Republican Bob ... a wealthy businessman who's funding his own campaign\n... as a marine veteran and a political newcomer who says New Jersey you should be embarrassed by Mendez earlier this year she can step down as the head of cell gene uh New Jersey based pharmaceutical company he touts cell gene as an example of a drug company that identify the patient need and satisfy to\nSell gene is an amazing thing for cancer patients turning multiple cancer from a terminal diagnosis chronic disease but\nCritics say sell gene is more like a poster child for high drug costs and shady marketing tactics Menendez has seized on that issue to discredit\nVeteran and a political newcomer who says New Jersey should be embarrassed by Mendez earlier this year she stepped down as the head of cell gene uh New Jersey based pharmaceutical company he ... cell gene as an example of a drug company that identified the patient need and satisfy to\nSell gene is an amazing thing for cancer patients turning multiple cancer from a terminal diagnosis chronic disease but\nCritics say sell gene is more like a poster child for high drug costs and shady marketing tactics Menendez has seized on that issue to discredit\nHuge corporate greed on my own company now ... about he said the more people needed dry\nMarking charge Cuban\nIs running as a moderate Republican he supports abortion rights and gay marriage he is also supported President Trump and donated tens of thousands of dollars to elect Trump and twenty sixteen\nIn a state where no Republican has been elected to the Senate since Nineteen Seventy two you might think you can support for Trump would tank his chances to victory in fact to recent polls show Menendez in the lead\nBut two other public polls have Menendez and you get in a dead heat confirming with some Democrats had feared that Menendez is corruption trial even though it didn't end in a conviction is turning off voters\nBend working runs Rowan Institute for public policy and citizenship\nIf you're watching these ads you'd think Bob Menendez was convicted a and for some reason it's not in jail\nThe question is which Bob Menendez democratic voters will be thinking about when they show up to the polls the one who's skated on federal bribery charges weren't the one who will oppose president Donald Trump for NPR News I'm Joe Hernandez\n\nAnd later today on all things considered some people have been mailing away for their genetic information and then post it on line to try to track down long lost relatives here three about why that is probably in very bad idea to listen to that after your smart speaker to play NPR\nOr ask for your local member station\n... in the audience\n[noise]\nTargeted for who they are [noise]\nShe was murdered in her new home\nShe says\nShe should've\nMurders of transgender women and men of color are on the rise\nWe've for why they're being targeted and what's being done to protect them that conversation next time on the take away from WNYC NPR\nProbably in very bad idea to listen to that asked your smart speaker to play NPR\nOr ask for your local member station by name\nIs NPR News\n\nTargeted for who they are [noise] she was murdered in her new home\nShe should've been safe [noise]\nShe should've been the\nMurders of transgender women and men of color are on the rise\nWe explore why they're being targeted and what's being done to protect them in that conversation next time on the take away from WNYC NPR I\nTake away today to Lebanon am on Ninety One point five to your cc southern Colorado's NPR station\nSupport for Ninety One point five K. R. C. C. comes from our listeners and from local organizations who wants to reach a discerning audience that values quality\nMarketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop in their businesses support their nonprofit and buy tickets to their shows [noise] to learn more about corporate support and culture now seven one nine four seven\nOr eight zero one\nMore and more people are getting their news on mobile devices and through social media in Ninety One point five K. R. C. C. doesn't have to be any different missed this morning news can't find it on our website getting out of your car went to keep listening to all things considered download the mobile apps\nNeed info on a local story impacting your community followers on Twitter feel like passing along that NPR story like us on Facebook the news never stop [noise] neither do we Ninety One we find pay our TV news\nEither this is my age who is this is Jonathan from your water is the dominant ... from the motion\nMusic that they tend to do now you find any one point five hey our teeth the\nProgramming on Ninety One point five K. R. C. C. is supported by Kaiser Permanente were members can get flexible care whether in person by phone or on line members can visit with the Kaiser Permanente doctor and get care on their schedule more KP dot org Kaiser Permanente fraud [noise]\nGood morning I'm David Greene so your parents you feel like dressing up on Halloween your kid dressing up guy Walker and so you did buy for fun you're going to go as Princess Leia will I Will just not do that in Chesapeake, Virginia city law there\nSays anyone over age twelve who engages in quote the activity commonly known as trick or treat could face a hundred dollar fine or a ...\nIt flexible care whether in person by phone or on line members can visit with the Kaiser Permanente doctor and get care on their schedule more KP dot org Kaiser Permanente thrive [noise]\nGood morning I'm David Greene Europe parents who feel like dressing up on Halloween your kid dressing up as a guy Walker and so you decide for fun you're going to go as Princess Leia well I Would just not do that in Chesapeake, Virginia a city law there says\nAnyone over age twelve who engages in quote the activity commonly known as trick or treat\nCould face a hundred dollar fine or if the six months in jail maybe I'd be okay with this if they let me take my candy with me you're listening to MORNING EDITION\nSupport for NPR comes from the station and from the log me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com [noise]\nFrom exact science is offering color guard for average risk it all over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard attached dot com\nAnd from the listeners to support that NPR station\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene it was a hot dry summer this year and the American southwest and farming communities and the four corners region where Colorado Utah Arizona and New Mexico share a border water supplies\nHas been scarce and drink dry times like these some people are willing to do just about anything\nTo get more water including\nStealing it from member station K. you in the Luke Runyon has more on a local man who's known as the water cop\nOne morning a few years ago David Hume got a call the woman on the other end was frantic screaming as she watched her eighty two year old husband in the yard and he was being beaten with a shovel by as eighty six year old neighbor the fight was over water\nOne of the men accused the other of taking more than his share from their irrigation ditch leaving less for everyone else\nOr you had to old timers that were very stubborn and very hard headed and there were bound and determined to do it their way and the other party was saying no you won't\nHear is a sheriff's deputy in ... County Colorado and the four corners tasked with enforcing the state's complex water laws he's probably the only deputy in the state with this kind of job making sure water goes where it\nThe fight was over water one of the men accused the other of taking more than his share from their irrigation ditch leaving less for everyone else\nAnd you had to old timers that were very stubborn and very hard headed and there were bound and determined to do it their way and the other party was saying no you won't\nYou and is a sheriff's deputy and monitoring my County Colorado and the four corners tasked with enforcing the state's complex water law he's probably the only deputy in the state with this kind of job making sure water goes where it's supposed to\nWe've seen some really inventive ways this year\nFor stealing water so how did they do it well one method drop all pumped into an irrigation ditch turn it on and if you don't have the water rights to do that it's a crime\nMethod number two you have rights to water but not a lot so you take more than you're allowed court has MC design inside as black Ford pickup human says when he started handing out tickets for water theft it didn't go over well\nFirst ah people were shocked they were like getting me right you're going to cite me over water it was like yes it's a valuable commodity in this day alone they're\nSeventy six year old farmer Bob Schuster knows all about water the he grows wine grapes and hay and runs up plumbing supply store and the county's biggest city of Cortez he's dressed in denim overalls sporting a black and gray beard Schuster says drought make people desperate\nPeople are basically and these are good people basically dishonest\nShooters farm is at the end of an irrigation ditch with several users upstream if they're taking more water than they're entitled to it dries up before it reaches his crops\nThey look out their building she they need water and take the water going through is not there\nAnd it's common for emotions to run high in these dispute he said he had guns pointed out M shovels swung in his head and been sucker punched in fights with neighbors over water happy\nBack at the office humans says violent skirmishes have declined since the county started enforcing water law but it's the fragile peace\nHistorically we've had people killed over water in the state of Colorado and we have in this county\nIn the dispute he said he had guns pointed out M shovels swung it hadn't been sucker punched in fights with neighbors over water\nBack at the office Cuban says violent skirmishes have declined since the county started in forcing water law but it the fragile peace\nHistorically we've had people killed over water in the state of Colorado we have in this county\nIt is MORNING EDITION from NPR News I'm Eighteen\nThis is MORNING EDITION from NPR News I'm Rachel Martin\nYou can sum up dream of caissons activism in forwards show up dive in we have\nTo be on the inside can't just be an out that only strategy and that is very different than it was before Trump won since Michael Brown was shot dead in Ferguson, Missouri McCutcheon has become a leading voice and the lightning rod and the black lives matter movement now selling his own story next time on one day\nIs coming up this morning at nine o'clock [noise]\nThis is southern Colorado was NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... hunter Casey ... W CCF in woodland park streaming at K. R. C. C. dot O. R. G.\nChili this morning with temps currently in the high twenties and thirties warming up to forties and fifties today clouds and a chance for rain and the lower elevations no as possible in the light appointed vista Andhra tone\nAnd there is dense fog and several parts of Colorado Springs this morning so plan your commute accordingly it is six o'clock who\nHurricane Michael has devastated parts of the Florida Panhandle and now the storm even aimed at the Carolinas where people are still recovering from Hurricane Florence was the latest on MORNING edition [noise]\nBecause our how residents along the Gulf Coast are hoping at what more damage this storm could cause as it moves in way up David\nAnd I'm Rachel Martin will also have the latest on the disappearance of the Saudi journal new reporting says the Saudi crown prince himself ordered an operation\nTo get the journalist Saudi Arabia and he was in college and even in the mail to NPR's Mara Liasson takes a closer look at what's at stake for Democrats in upcoming election\n\nLive from NPR News in Washington I'm ... and the national Hurricane Center says what was hurricane Michael we use a tropical storm now moving through South Carolina with top sustained winds of fifty miles per hour from member station WBUR a bee in Atlanta has named Sharma reports hundreds of thousands\nNPR's Mara Liasson takes a closer look at what's at stake for Democrats pending election\nPortugal explores the dark chapter\nParty when they knew the text\n[noise]\nLive from NPR News in Washington I'm ... and the national Hurricane Center says what was hurricane Michael we use a tropical storm now moving through South Carolina with top sustained winds of fifty miles per hour\nFrom member station WBUR a B. E. and Atlanta ... Sharma reports hundreds of thousands of customers in Georgia are without power\nThe group that represents the state's electric cooperative Georgia EMT says more than a hundred and six thousand customers are without power mostly in middle and south west Georgia, Georgia power of the state's largest electric utility says about twenty five hundred customer skilled faith outages Michelle as well as with the national weather service\nI guess he will continue to monitor for any treatment sick down there's definitely power outages across portions of south Georgia say you want to stay safe\nGeorgia powered says more than four thousand employees across Georgia and neighboring states are working to restore electricity about two thirds of the state will remain under emergency declaration through next week for NPR News I'm ... Sharma in Atlanta\nStock markets in Asia plunged today following yesterday's fell off on Wall street Chinese markets plunged by five percent of Japan's Nikkei was down nearly four percent markets in Europe continued to slide and Wall Street is expected to open lower and beers or he Berliner says there are several reasons for the global sell off\nAmong them a technology stocks which are really propped up the market which aboard the market for so long\nUh they've started to fall I'm as well as there were higher interest rates for all kinds of things you'll on treasury bonds are up that could make them more attractive in stocks and hanging over all these are the trade tensions between us and China they're real and they're not going away and this could be making the mood in the mortgage darker\nNPR's Uri Berliner police have arrested the operator of the limousine company involved in a deadly crash last weekend that killed twenty people in upstate New York he faces negligent homicide charges NPR's Camila Domonoske reports there's new attention on the limo loophole for safety standards\nNew cars and buses have to meet federal safety standards but if you take a car cut in half and stretch it out to the size of a bust you don't have to prove that it meets either set a standard those stretch limo can be\nGoing away and this could be making the mood in the mortgage darker\nNPR's Uri Berliner police have arrested the operator of a limousine company involved in a deadly crash last weekend that killed twenty people in upstate New York he faces negligent homicide charges and bears ... reports there's new attention on the limo loophole for safety standards\nNew cars and buses have to meet federal safety standards but if you take a car cut in half and stretch it out to the size of a bust you don't have to prove that it meets either set a standard\nThose stretch limo can be dangerous in crashes because they may lack structural features such as side impact protections sometimes they're short on seatbelt someone other safer than others but rose Mary Shay hand the president of consumers for auto reliability and safety says it shouldn't be up to individuals to find safe limos\nNo no no you know up to the limit thing companies provide save transportation\nAnd it's up to state and local governments to enforce that in the absence of federal regulations ... NPR News\nTo astronaut to adjust launch toward the international space station made an emergency returned to earth today that says that you are in good condition you're listening to NPR\nCatholic bishops in Texas are promising to release a list of all priests accused of sexual abuse as Laurie Johnson of Houston Public media reports parishes are expected to release the names early next year\nThe Texas Catholic conference of bishops says to lift will date back to at least Nineteen fifty and will include names of priests who have been credibly accused of sexually abusing a minor\nCardinal Daniel ... the archbishop of Galveston Houston set in a statement the decision as a response to calls from Catholic laypeople for greater accountability and transparency\nDenaro also leads the U.S conference of Catholic bishops and has been meeting with Pope Francis at the Vatican to discuss the nationwide sex abuse scandal\nAll Thirteen hundred twenty parishes in Texas say they will publish the names of accused clergy by January thirty first the bishops also pledged to update the list when new accusations are made for NPR News I'm Laurie Johnson in Houston\nIn Indonesia search teams are still digging for victims of the earthquake and tsunami that struck nearly two weeks ago the death toll stands at more than two thousand people but Indonesian officials fear as many as five thousand people may be missing a Canadian pipeline operator says it has put out a fire on a natural gas line\nHundred twenty parishes in Texas say they will publish the names of accused clergy by January thirty first the bishops also pledged to update the list when new accusations are made for NPR News I'm Laurie Johnson in Houston\nIn Indonesia search teams are still digging for victims of the earthquake and tsunami that struck nearly two weeks ago the death toll stands at more than two thousand people but Indonesian officials fear as many as five thousand people may be missing\nA Canadian pipeline operator says it has put out a fire on a natural gas line in northern British Columbia Reuters news service says this cause disruptions that refineries in Washington state\nThe pipeline carried gap to markets in the Pacific northwest operator Enbridge incorporated says it has permission to restart a nearby separate gas line\nAnd we'll work to repair the affected line on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nI this is Andy ... executive director of the cultural officer the pikes peak region inviting you to tune into Ninety One point five K. R. C. C. on Thursdays for the peak radar minute at six thirty in Lebanon and two PM\nMade possible by the team and foundation joined us for the peak radar minute that is the head and just about twenty five minutes it's six minutes after six o'clock I'm Abigail Batman and you're listening to MORNING EDITION on southern Colorado's NPR station Ninety One point five K. R. C. C. [noise]\nComing up crew members had to abort the launch of a Soyuz rocket today abandoning a mission to the international space station that stories coming up just around six twenty\nIn woodland park it's twenty nine degrees a high today of forty eight like rain this afternoon in Pueblo it's thirty eight a high of fifty five at foggy with a slight chance for showers and in Colorado Springs thirty four degrees a high of forty four dense fog across the city this morning and a slight chance for showers\nProgramming Ninety One point five through your cc is supported by Colorado State university global Campbell\nAn online university offering career development through bachelor's degrees master's degrees answer to produce a completion Morrisey of ... dot EDU\nForty eight light rain this afternoon in Pueblo it's thirty eight and a high ... with a slight chance for showers in in Colorado Springs thirty forty agreed to high forty four dense fog across the city this morning and if I can push our\nProgramming on Ninety One point five K. or cc is supported by Colorado State university global campus\nIn online State University offering career development through bachelor's degrees master's degrees an certificates completion Morrissey as you local dot edu by silver key\nProviding freshly prepared home deliver meals for any one eight six ... helps family members who are working out of town or unable to be there\nFor their loved ones every day more silver key dot org yeah News I'm Rachel Martin in Washington DC\nAnd I'm David Greene in Culver City California this morning Floridians who rode out hurricane Michael are waking up to view the devastation that has been left behind Panama City resident advance you've described the experience at this massive storm came through\nJust terrifying oddly a of a lot of noise I mean a weed out the windows are going to break on any any time we had the we had the inside windows kinda barricaded in with mattresses I mean who did whatever we could just kind of hunker down and tried to wait it out\nTrees were toppled roofs were ripped off home literally came off their foundations at least two people\nSo far that we know of were killed in this storm when it turned out to Jeff Goldberg he's the emergency management director in Walton County Florida which is one county over from Panama City with a voice that was that we just heard Mr Goldberg\nThanks for taking the time for us so I Know this must be a rough morning for your guys\nWell yeah it's you know between trying to get our stuff the mobilized because we did have some shelters opened and then trying to get out there and and it's just our uh uh my fellow ... and ... and colleagues that you know we're obviously very very close with\nYesterday's arrest won't help her case for NPR News I'm Michael Sullivan in Chiang Rai Thailand [noise]\nThis is NPR News\nHearings and confirmation raise the question again how do we decide who to believe when a woman said she was sexually assaulted by someone she knows behind closed door and a man denies that\nThat's an issue universities have been dealing with\nYesterday's arrest will help her case for NPR News I'm Michael Sullivan in Chiang Rai Thailand [noise]\nThis is NPR News\nThe Kavanaugh hearings and confirmation raise the question again how do we decide who to believe when a woman says she was sexually assaulted by someone she knows behind closed door\nThat's an issue universities have been dealing with on the next fresh air we talk with Vanessa ... author of blurred lines sex power and consent on campus joined us\nFresh air is today at noon on Ninety One point five K. R. C. C. it is Thursday October eleventh good morning I'm ... glad to have you with us for MORNING EDITION yesterday President Trump addressed the disappearance of a Saudi Arabian journal and we can that life is\nTo reporters to anybody we can't let this\nAnd we're going to get to the bottom of\nTrump said he had also spoken to the Saudi Government about the situation more on that story coming up at six thirty in West cliff is twenty eight degrees a high today of fifty three partly cloudy skies expected in Trinidad thirty seven highest sixty three\nSaudi this morning then partly sunny for the day and in Colorado Springs it's thirty four degrees higher of forty four slight chance for some rain showers there is dense fog and several parts of Colorado Springs this morning so please plan your commute accordingly it's six Twenty one [noise]\nNPR on Ninety One point five through your cc is supported locally by monument occupational medicine working was injured workers and employers dedicated to helping employees returned to work with comprehensive medical care drug screening and beauty exams and pre employment physicals monument OCC med dot com\nBy Patterson plumbing and heating committed to customer service since Nineteen eighty four providing repairs for homeowners in Pueblo Fremont county and the surrounding area from draining sewer issues do each rocket installation and repair Patterson plumbing dot com\n\nSupport for NPR comes from this station and from progressive insurance offering a way to buy a home insurance with their home quote explorer tool custom quotes and rates are available online learn more progressive dot com or one eight hundred progressive\n... ... dot com by Patterson plumbing in heating committed to a customer service since Nineteen eighty four providing repairs for homeowners in Pueblo Fremont county and the surrounding area from drain and sewer issues to each rocket installation and repair Patterson plumbing dot com\n\nSupport for NPR comes from this station and from progressive insurance offering a way to buy a home insurance with their home quote explorer tool custom quotes and rates are available online learn more progressive dot com or one eight hundred progressive now that's progressive\nFrom battle a language at that teaches real life conversations and a new language including Spanish French and German babble ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot com\nAnd from the three I O T providing a software platform that enabled organizations to deploy artificial intelligence predictive analytics and diabetes solutions that industrial scale learn more in the three I O T dot AI\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin crew members were forced to abort the launch of a ... rocket today the American astronaut and Russian cosmonauts are reported to be in good condition but the rockets mission to the international space station failed and Russia space agency says the program is now suspended\nJoining us now with more reporter Matthew Bodner he is in Moscow and on the line Matthew can you go to the degree that you know explain what went wrong [noise]\nShirt so about two minutes to launch the first stage boosters ... rocket the couple and the astronauts aboard the rocket reported vibrations are weightless at one point five\nThis was evidence from the footage that we could see on the wife broadcast\nI'm clearly not something you want to have happen what happened over the next few minutes is not entirely clear yet I'm the angel shut off the crew separated from the rocket and they began with that so called a ballistic landing essentially a very high speed flight on powered through the atmosphere to what ended up being there landing site\nUm during this time it wasn't exactly clear what happened to the crude out of communication for a walk for for a few minutes um the rescue teams have now recovered them and they're on the way back to the College of\nI mean it's correct me if I'm wrong but it's my understanding that um that that vessel for lack of a better word rockets shuttles are going up to ...\nIt's highly clear yet I'm the angel shut off the crew separated from the rocket and they began what it calls a full estate landing\nEssentially a very high speed flight powered through the atmosphere to what ended up being there landing site um during this time it wasn't exactly clear what happened to the cruelty of out of communication for ... for for a few minutes um the rescue teams that now recovered them and they're on the way back to the cause of job\nI mean the correct me if I'm wrong but it's my understanding that um that that that sold for lack of a better word rockets shuttles are going up to the international space station on a ... fairly regular basis on a ventilator what this a routine mission\nWas very much for the mission for the past few years I'm ... years rocket as it's called it's been the only way to reach theatre so stay sending fights go up every every few months huh\nHum what the problem is is that while this has been going on I'm Russian rockets a different different types have been seeing an increasing frequency of various failure and official for for a while now and said that the man so you go through a special certification process special care was given\nTo ensure that they that they remain man rated safe prevent flight\nRelated to let me just ask you in seconds remaining on the program it's now been suspended do we know for how long\nThat that's a good question three ... three months at least a ... well see there is a coup there right now that only has if that's all they can return 'em no later than December so they need to find a solution before December or the future of the program is probably temporarily in jeopardy\nFile okay reporter Matthew Bodner on the line from Moscow talking about that aborted so he is rocket mission to the international space station thanks so much that the we present I think you\nPortugal has a rich history of exploring once uncharted land like Brazil and Africa but with that history comes the shame of the slave trade in Lisbon to separate public projects of slavery memorial and museum celebrating Portuguese exploration have become lightning rods for debate about the country's colonial past\nJake's again or report [noise]\nThese into rolling way once carried African slaves from listening to the new world memorial recognizing Portugal's role in the colonial slave trade will be rented any grassy square steps away the memorial was approved in a public vote the controversy about the country's history a colonization in slavery\nTrade in Lisbon to separate public projects of slavery memorial and museum celebrating Portuguese exploration have become lightning rod for debate about the country's colonial past Jake's together a report [noise]\nThese gentle rolling wave once carried African slaves\nFrom listening to the new world for a memorial recognizing Portugal's role in the colonial slave trade will be erected in a grassy square steps away from the memorial was approved in a public vote the controversy about the country's history of colonization and slavery still continues\nDescendants from former colonies like Angola and Mozambique stay up until now they have been denied a place in Portugal history Beatrice go mashed yet is the president of just the anti racism association that proposal slavery memorial\nSometimes I remember me being a child and leaving in Lisbon and having no reference is looking at the majority of portrayed people end up being like them and not having a place\nFor me in front of people like her\nGroup wants to honor slave she says are often portrayed in Portuguese history as no more than good for trade\nPoliticians here often claim Portugal is one of the least racist countries in Europe the ds said many black Portuguese don't agree\nNot recognize as Portuguese because that all laid relating black Portuguese to the countries in Africa there were occupied by ... yet it's\nAlso a critic of the other historic project to plan for a loop and the tentatively named museum of discovery which would tell the story of the amazing wages of exploration carried out by Portuguese navigators who first charted roots around Africa India in South America\nThe S. and other critics say the museums theme would whitewash the violence of Portugal's colonial history but in turn the supporters of the museum accused their detractors of denying the trial of Portuguese explorers\nOr other issues like scientific discoveries ... the ... the only question no flavor for us to perform well you're wrong\nWe're not too at the ... the president of the international Luther phone movement which promotes Portuguese language and culture around the world at the funniest says the Portuguese didn't invent slavery\nBut it was part of their history he says the slavery memorial and the museum of discoveries would complement each other in the right context but that counts\nFor other issues like scientific discoveries culture relationships they knocked exists only the question of slavery for us [noise] fused profoundly wrong\nThat's we're not too at the ... the president of the international Luther phone movement which promotes Portuguese language and culture around the world at the ... says the Portuguese didn't invent slavery\nBut it was part of their history he says the slavery memorial and the museum of discoveries would complement each other in the right context but that context doesn't exist in Portugal according to anthropologist Bruno saying I'm are tens\nPartial as a self rivers and passion in which the violent history off one reason is not far from St\nMartins lectures that Portuguese high schools about slavery and colonial violent he says there's a clear resistance to talking about slavery and the official history curriculum down plays this subject\nIgnoring racism or colonial history too fast on Kenyan violence arthritis in our society\nFor lumber yes Hi this is not a new debate\nFor Portugal Fernando wrote that a historian and former parliamentarian says the different today is that researchers of African descent are changing how Portugal talks about it passed that's why he says the museum will need a different name\nDiscovered in Michigan we didn't discuss that anything because people was there and the people that bought it at least covered and also the budget is the right name is ... a multiple of nearly is because you feel about that that you speaking [noise]\nWhen the slavery memorial is unveiled next year frozen says it will be a milestone in the fight between Portugal past\nAnd future for NPR News I'm Jake sully Ghana rope and lives in [noise]\nYeah [noise] Mm [noise] yeah [noise] yeah [noise] Mm [noise] yeah [noise] [noise] yeah [noise] yeah [noise]\n[noise] yeah yeah yeah yeah [noise] yeah this is NPR News\nWell as you remember the first trip to ... made outside the United states wasn't to Canada or Mexico traditionally what the US President do but a uniquely to Saudi Arabia where he was treated\nLiterally like a king and of all the relations he has around the world perhaps only Israel is closure of both to Trump a and a and Jared Kushner and Mohammed bin Salman the crown prince I'm In Saudi Arabia so it it wouldn't really be\nWell as you remember the first trip that Trump made outside the United states wasn't to Canada or Mexico a traditionally what the US President do but a uniquely to Saudi Arabia where he was treated\nLiterally like a king and of all the relations he has around the world perhaps only Israel is closer or both to Trump a and a and Jared Kushner and Mohammed bin Salman the crown prince I'm In Saudi Arabia or so it it would really be tough for Trump personally uh to do anything that would want to damage\nThis relationship with is one thing we know from Trump or it would really be confusing for him to allow human rights abuses at a in another country to stop him from trying to take advantage of a pretty good relationship\nUm UC what he's been saying about the north Korea and Supreme leader for example in the same interview that you are earlier a presented Trump also said that he wouldn't want to reduce arms sales to Saudi Arabia because that would hurt the United states\nBut this is not just a a human rights abuses if this turns out to be true in Saudi Arabia actually killed a journalist on Turkish soil or I mean Lindsey Graham Republican senators saying they would have to be held to pay isn't that going to increase pressure on President Trump to to do something here\nWell I'm not sure well I mean you know the the the media was more outraged I think about Trump's\nIndividual meeting with President pollutant in Helsinki and the press conference afterwards I mean even Fox News and a number of the Republicans were on the defensive around it but we're not talking about that anymore\nUm look I mean you and I can say that it is horrific\nFor the most popular Saudi journalist to be what looks like pretty clearly um killed 'em in a consulate abroad in not in American allies conflict abroad by the way but I don't think that means that Trump is going to be pressured it what what is interesting of course is the ability of the Senate\nAnd others to constrain Trump's foreign policy when they feel that he's acting beyond the pale in significant in in the same way that we've seen I'm assuming it increases in sanctions against the Russians that Trump has attempted to slow walk\n'em I think the same thing is likely to occur these heavy Saudi Arabia and and that's going to be very interesting to watch over the coming months especially because Trump is putting so much pressure on Iran\nI don't think that means that Trump is going to be pressured what what is interesting of course has the ability of the Senate\nAnd others to constrain Trump's foreign policy when they feel that he's acting beyond the pale in significant it on the same way that we've seen 'em a sick it increases in sanctions against the Russians that Trump has attempted to slow walk\n'em I think the same thing is likely to occur\nThese heavy Saudi Arabia and and that's going to be very interesting to watch over the coming months especially because Trump is putting so much pressure on Iran after pulling out of the nuclear deal the about enemy of Saudi Arabia and Congress has been quite on board with that so these two things are going to come together\nThe government known for intimidating their citizens who live abroad that the surprising in some way\nUm it it again it's it's gotten worse certainly um but he's been threatened before\nUm you know he was forced out of his job um he was defending a lot of his friends who are opponents of the Saudi regime\nOr he has a lot of friends in the United states in high places but there's no question that he was considered to be a real problem for the Saudis the Saudis overreacted to the Canadians on the Canadian government took umbrage at a Saudi behavior you will remember of course a just a year ago all of those Saudi princes that were\nDetained or in the Ritz Carlton there were some reports of torture when that occurred\nDidn't stop the U.S Saudi relationship from being extremely strong and again I just point you to North Korea I mean Trump expressing his love for Kim Jong loon who is by far the most criminal behavior we've seen in the world\nBremmer will have to stop their thanks so much for joining us [noise] he is founder of the global political risk to console him the the Eurasia Group [noise] this is NPR News\nVoters can register and currently registered voters can update their records that they moved to change names to make sure they get the mail in ballot and or correct the record students who are seen as voting at the polls go to W. W. W. dot go vote Colorado dot com for more information\nFor who they are\nYou in Law Order over new home\nShe says\nShe hit a ball\nMurders of transgender women and men of color are on the rise\nWe've or why they're being targeted and what's being done to protect them that conversation next time on the take away some WNYC NPR eyes\nTo take away we came morning at eleven o'clock southern color\nRecords to ensure seems voting that people go to W. W. W. dot go vote Colorado dot com for more information\nTargeted for who they are [noise]\nShe was murdered in her new home\nShe should've been state [noise]\nShe should've been a little\nMurders of transgender women and men of color are on the rise\nWe explore why they're being targeted and what's being done to protect them that conversation next time on the take away from WNYC NPR I\nDid take away weekday morning at eleven o'clock this is southern Colorado's NPR station Ninety One point five K. R. C. C. [noise]\nComing up on the marketplace morning report big American banks will report profits tomorrow after windfall from the tax cut and an overall healthy economy how our American they doing that plus all the morning's business news coming up at six fifty one on the market late morning report [noise]\nIn Buena Vista is thirty degrees high today a fifty a chance for snow this morning and rain this afternoon in Raton it is thirty one degrees a high of forty four chance for rain and snow there as well and in Colorado Springs it's thirty four degrees unexpected high of forty four\nSlight chance for showers there is still dense fog and patches across Colorado Springs playing your commute accordingly makes you have the lights on\nAnd please Dr slow this morning a current temperatures across the region are in the twenties and thirties warming up the forties and fifties throughout the day\nProgramming on Ninety One point five through your cc is supported by Colorado Springs philharmonic presenting ... with Joseph ... Dominican conducting this Saturday and Sunday or ... or more of the spill are Monica dot org [noise]\nYes you can have a great music seven nights a week from seven to midnight on Ninety One point five K. R. C. C. [noise]\n\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities and education and entrepreneurship to create uncommon solutions tend to empower people just\nYes you can have great music seven nights a week from seven to midnight and Ninety One point five K. I. C. C. [noise]\n\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solution and empower people to shape their lives and be more successful more online at Kaufman dot org [noise]\nFrom the Pew Charitable trusts celebrating Seventy years of serving the public learn more at ... dot org slash Seventy\nAnd from the Jonathan James L night foundation helping NPR advance journalistic excellent in the digital age\n\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene let's remember this morning how Havana founded back in the Nineteen fifties in Nineteen sixty something\nMusic you're hearing here is part of a new box set that really captures the golden age of afro Cuban music it contains five legendary albums between some of Cuba's finest musicians these recordings were made in Havana pan art studios between Nineteen\nFifty six Nineteen sixty four that's the period just before communist leader Fidel Castro nationalize the recording industry and since then these albums have become extremely hard to come by\nUntil now that is that is called the complete Cuban jam sessions volumes one through five and here to talk about it is Felix Contreras host of NPR's all but you know podcast they'd be like Hey David what's happening\n[noise] will I'm enjoying the music I there's very little Cuban music he claims that I don't I don't know what I got a threshold [noise] first of all the studio\nTo pet art studio would agreed best do yoga Cuba so that virtually every major Cuban artist technically direct some point or another and these sessions or from after hours Jeff Sessions after the musicians who have their gigs or places like the hotel ... and the really opulent Tropicana nightclubs\nThese are the best musicians gathered together to experiment with that mixture of afro Cuban music and\n[noise] [noise] so this was like the after our stuff yeah\nStudio would be best to young Cuban so that virtually every major Cuban artist had played by some point or another and these sessions or from after hours jam sessions after the musicians played their gigs or places like the hotel gym now and the really opulent Tropicana nightclubs\nThese are the best musicians gathered together to experiment with that mixture of afro Cuban music and\nJack [noise]\nSo this was like the after our stuff yeah they pick up all those shirts and the little jackets and they would just go into the room and just started playing and the owner of a studio rent tapes the whole time sometimes between ten PM and fix a a\nWhile 'til the sun would come up there you go so what happened exactly when Castro came to power\nOkay eventually he nationalized the recording industry and the bureaucrats takeover right and the free wheeling bohemian suffered a little bit because the government felt there was a reflection of the decade or to the United states\nSo the owners of the studio were concerned about what was going to happen with the masters and what was going to happen to the style of music so they started taking be masters\nAnd smuggling them out of the country and depositing them in different Latin American countries along the way so what happened to those recordings over the years in hiding eventually they were sold the different labels in Latin America over the years\nSome shoddy reproductions were produced along the way but most of the albums became incredibly hard to find\nSo finally a couple of years ago California label craft recordings Baucus Mexican label that was holding on to these tapes and they've figured out what they were holding and he decided to put something like this together [noise]\nTo some of the highlights here with himself okay there's one in particular that I call the crown jewel of the of the collection is called jam sessions in miniature it's by the famous basis Israel Lopez for a child and you got to pick this up because of the music is just [noise] it's right there [noise]\nYou\n[noise] you\nIn twenty twenty five in Orlando I'm Danielle prior for\nIn in New York ... with the marketplace morning report [noise]\n... pm American public media you can sum up the ... activism in forwards show up dive in\nHave to be on the inside can't just be an out that only strategy and that is very different than it was\nAnd in New York I'm Sabrina shore within marketplace morning report\nFrom ... pm American public media you can sum up to Raymond caissons activism in forwards show up dive in\nWe have to be on the inside can't just be an out that only strategy and that is very different than it was before Trump won since Michael Brown was shot dead in Ferguson, Missouri McCutcheon has become a leading voice and the lightning rod in the black lives matter movement you know he's selling his own story next time on one day [noise]\nJoined us one day this morning at nine o'clock that is right after MORNING EDITION on southern Colorado's NPR station care cc care C. C. H. D. Colorado Springs K. E. C. C. the hunter K. C. C. S. stark veil and K W CCF him woodland park\nChili this morning with temperatures currently in the upper twenties and thirties warming up to forties and fifties clouds and a chance for rain and the lower elevations snow as possible and some light up you know the ... and Raton and keep an eye out for heavy fog this morning it's seven o'clock\nThis morning the governor of Florida until the weather channel he's quote scared to death for people in the panhandle\nDecided not to evacuate as hurricane Michael ... at the latest on MORNING EDITION from NPR News\nAs hurricane Michael made landfall the storm ripped roof top and blue houses from their foundations I'm Rachel Martin\nAnd I'm David Greene in Germany a far right anti immigrant party may be gaining more ground ... signal a deal at Britain's departure from the ... you could be close so did you have that moment watching thirty rod when you realized ... cousin Vicki and\nNational lampoon vacation next to Jacob ... both and happy fiftieth on this Thursday I'm overloading [noise]\n\nLive from NPR News in Washington on corporate Coleman Wall Street will open in about half an hour and stock prices are expected to drop following yesterday's big so\nRex go jihad or signal a deal on Britain's departure from the ... you would be close so did you have that moment watching thirty rod when you realized ... Audrey cousin ... international\nEveryone vacation I'd like to drink or go deeper point both having fifty as long as they're overloading [noise]\n\nLive from NPR News in Washington encore of a Coleman Wall Street will open in about half an hour and stock prices are expected to drop following yesterday's big sell off\nThe plunge stretched to Asia where stock prices in China were down five percent today European stocks are lower and beer Stacey Samuel says sell office felt nice areas to crypto currency is were hit such as bitcoin\nWhy Wall Street react over the ... plunge into ... market one day the cryptic currency market had a significant drop of its own\nNearly Thirteen million dollars in value were wiped out over the course of just a few hours virtual currency the theory I'm an ex are pared down nine and nine point nine percent respectively well big clean had fallen nearly five percent and bitcoin cash has dropped more than ten and a half percent in the last twenty four hours\nA crash comes amid recent report from the international Monetary Fund warning that the rapid growth of crypto at it as a potential threat to the economy and international financial system for NPR News I'm Stacey Samuel in Washington\nThe national weather service says tropical storm Michael is now over South Carolina talked to said Windsor fifty miles per hour the storm roared ashore in the Florida Panhandle is a major hurricane it's killed a man and Florida and a girl in Georgia from Georgia Public broadcasting Taylor grant report\nHundreds of thousands of Georgians are waking up without power the national weather service has issued a flash flood watch for large sections of Georgia in the south west corner of the state recovery efforts are already underway Candace ... is a public information officer for ... county\nWe do have public safety and emergency responders out um the body called trying to make sure that as citizens are okay\nFor NPR News I'm ... and it when\nNASA says they still use booster rocket carrying an American astronaut on a Russian cosmonauts failed during lunch today the crew was forced to make an emergency landing in Kazakhstan NASA commentator brandy dean was tracking the capsule a NASA mission control in Houston sheet of the crews landing was the balloons\nCandace ... is a public information officer for ... county\nWe do have public safety and emergency responders out um is binding called trying to make sure that our citizens are okay\nFor NPR News I'm Taylor ... in Atlanta now that says they\nStill use booster rocket carrying an American astronaut a Russian cosmonauts failed during lunch today the crew was forced to make an emergency landing in Kazakhstan\nNow the commentator brandy dean was tracking the capsule and NASA mission control in Houston she does the cruise landing was eight ballistic descent and it was hard\nBallistic dissent says mean that the Phillies module comes in a more deeply than it would on a normal landing trajectory\nWhich means that the crew and are subject to hire G forces during the descent\nBut it is a known mode of dissent than to members have gone through but for\nNow ... says the two astronauts are in good condition photographs have shown them sitting up on ... having your blood pressure taken\nPeople who get Social Security benefits can likely expect the cost of living adjustment next year the Associated Press estimates the government will increase benefits by about two point eight percent that's an extra thirty nine dollars a month for the average retired worker you're listening to NPR\nIt's seven oh four I'm Abigail back then with Ninety One point five K. R. see the news some areas of the mountain west are seeing their first snow fall of the season this week it's an optimistic sign for the region's ski resort says the industry worries about the long term effects of a warming world Dan Boyce reports\nIt's that time of year when western ski resorts are posting their obligatory who's ready for winter pictures showing white dusting the slopes snow machines hard at work or dogs wearing goggles Jed human status of senior forecaster with the national weather service in Boulder, Colorado\nHe says it's very early but storms the last week have put much of the mountain states at a hundred and fifty or two hundred percent of normal snowpack totals some parts of Idaho in Utah or even three or four times normal snowfall amounts\nIn a few of the winter it's not much but it is a good start Android racial purpose of the people that are waiting ski areas and ... waiting for that so back to arrive starting to get there\nThis is an El Nino year which usually means relatively normal snow fall for more southern states like Colorado in Utah and typically drier winters for northern states\nIt's very early but storms in the last week have put much of the mountain states at a hundred and fifty or two hundred percent of normal snowpack totals some parts of Idaho in Utah or even three or four times normal snowfall amounts\nIn a few of the winter it's not much but it is a good start and racial purpose or the people that are waiting scare is back under skiers gutters waiting for that so back to arrive starting to get there\nThis is an El Nino year which usually means relatively normal snow fall for more southern states like Colorado in Utah and typically drier winters for northern states like Idaho Wyoming and Montana for the mountain west news bureau I'm Dan Boyce\nA man accused of killing his Thirteen year old son and southwest Colorado was scheduled to go to trial in February fifty seven year old mark red wine has pleaded not guilty to second degree murder and child abuse resulting in the death of his son Dylan he\nSuspected of killing Dylan in November twenty twelve shortly after the boy arrived for a court order to visit from Colorado Springs this is Ninety One point five K. R. see the news\nSupport for NPR comes from NPR stations\nOther contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video [noise]\nNow you can tune in to Ninety One point five K. R. C. C. without lifting a finger just down your smart speaker to noon in ... [noise] and you\nCan also listen anytime on our website the live stream and K. R. C. C. dot ORG\nI'm Abigail back then you are listening to MORNING EDITION on Ninety One point five K. R. C. C.\nStock prices had their worst day since February with the Dow Jones industrial average using more losing more than three point one percent of its value\nComing up investors confront rising interest rates and worries about the trade fight with China that story is just ahead at seven twenty [noise] in saliva is thirty one degrees a high of fifty five a chance for rain and snow this morning a\nShowers this afternoon in the hunter is thirty eight high of fifty six mostly cloudy today in in Colorado Springs to thirty four degrees a high of forty four maybe some rain and the dense fog advisory until eleven o'clock this morning programming\nOn Ninety One point five ... or so you see is supported by monument occupational medicine working was injured workers and employers dedicated to helping him\nNow that story is just ahead at seven twenty in light of it is thirty one degrees a high of fifty five a chance for rain and snow this morning a\nShowers this afternoon in the hunt and it is thirty eight high as fifty six mostly cloudy today in in Colorado Springs to thirty four degrees are high asked forty four maybe some rain in a dense fog advisory until eleven o'clock this morning programming\nOn Ninety One point five ... or so you see is supported by monument occupational medicine working was injured workers and employers dedicated to helping employees return to work with comprehensive medical care drug screening and beauty exams and pre employment physicals monument OCC med dot com\nBy Patterson plumbing and heating committed to a customer service since Nineteen eighty four providing repairs for homeowners in Pueblo Fremont county and the surrounding area from draining sewer\nIssues to a track installation and repair Patterson plumbing dot com David Greene in Culver City California\nAnd I'm Rachel Martin in Washington DC officials in Florida in Georgia are surveying the damage caused by a historically powerful storm hurricane Michael struck the Florida Panhandle yesterday as a category for storm one of the strongest to hit the region\nSince they started keeping records back in the mid nineteenth century it toward to the panhandle into Georgia ripping trees from the ground rules from homes\nIt has now been downgraded to a tropical storm but that still means a lot of rain and wind as it moves north and east into the Carolinas Mario get hurt in the city manager of Panama City beach and I reached him earlier has he been surveying the damage\nRachel one of the biggest problems we have right now is one of the issues that you and your station and I have been dealing with all morning and that's communication we have\nNo lines of communication and when I say almost no I mean my police chief cannot communicate with my share of right now shall lines are down radio towers are down\nUm and we have we have things that we can offer here on the beach because we did not get the damage that was done over into Panama City\nAnd we have we have things that we can offer here on the beach because we did not get the damage that was um done over into Panama City\n\nThis is NPR News\nKavanaugh hearings and confirmation raise the question again how do we decide who to believe when a woman said she was sexually assaulted\n\nThis is NPR News\nThe Kavanaugh hearings and confirmation\nRaised the question again how\nDo we decide who to believe when a woman says she was sexually assaulted by someone she knows behind closed door and the man denies that that's an issue universities have been dealing with on the next fresh air would talk with Vanessa ... author of blurred lines sex power and consent on campus joined us\nToday at noon on Ninety One point five K. R. cc\nSouthern Colorado's NPR station it is seven twenty hope you're having a great Thursday morning so far I'm Abigail Batman Senate Democrat Bob Menendez is running for re election in a reliably blue state\nSomeone who will stand with Donald Trump they need someone who will stand up to Donald Trump\nThe race is surprisingly tight however and to see his party can't afford to lose that stories coming up at seven thirty\nIn canyon city it's thirty seven degrees clouds this morning meeting to stunned this afternoon highest fifty one degrees\nIn Pueblo thirty eight a high of fifty five foggy with a slight chance for showers and in Colorado Springs we have thirty four degrees a high of forty four slight chance for some rain and we do have a dense fog advisory until eleven o'clock\nThis morning it was causing some delays and collisions on the roadway so keep your eyes open as you drive\nProgramming on Ninety One point five three or cc is supported by bingo burger featuring the signature bingo burger made with far roasted Pueblo chilies to pair with a selection of Colorado beers on trial from goat patch up slope field house more bingo burger in downtown Colorado Springs input blow\nBy the Colorado Springs school hosting a pre K. through twelfth grade open house in school showcase\nFeaturing the arts sciences and family entertainment Saturday November temp wonder for pm more at CSS dot org\nStation and from universal pictures presenting the new film first man from Damien\nFeaturing the signature bingo burger made with far roasted Pueblo chilies to pair with a selection of Colorado beers on trial from goat patch up slope field house more bingo burger in downtown Colorado Springs and Pueblo by the Colorado Springs school hosting a pre K. through twelfth grade open house and school showcase\nFeaturing the arts sciences and family entertainment Saturday November temp one to four pm more at CSS dot org\nStation and from universal pictures presenting the new film first man from Damien ... director of la la land and whiplash and starring Ryan Gosling and Claire foie in theaters and IMAX tomorrow\nFrom T. I. A. T. I Am committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more AT T I Am a dot org\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template that dragon drop email editor and twenty four seven customer service [noise] more ad campaign monitor dot com\nThis is MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm David Greene the European Union considers itself a haven for journalists who are persecuted in other countries but in the last year the twenty eight member block has faced the murders of two investigative journalist with in its own borders\nSo when the host of a TV show spot letting corruption was found raped and murdered in Bulgaria last weekend you leaders demanded an investigation joined a kisses reports from roots of Bulgaria where the murder took place [noise]\nTV host the ... by pulled friends last Saturday that she was going jogging\nA few hours later her body was found in the wooded park along the Dan River she had been beaten raped and suffocated retired iron worker ... told police he had seen a man running away from the scene that day he was all about to Sicily\nGluten lay on most days to see I see people here every day now that they away because of her murder\nThough was well known in the slush scenic city of about a hundred and fifty thousand people she was with the young driven starve a local private channels run by her ex husband spilling moxie ... she wouldn't be satisfied just to just the ...\nHad been beaten raped and suffocated retired iron workers are ... told police he'd seen a man running away from the scene that day but you\nJust play on most days of the people here every day now that the away because of her murder\nMoney no though was well known in the slush scenic city of about a hundred and fifty thousand people she was young driven starve a local private channel run by her ex husband spilling moxie ... she wouldn't be satisfied\nJust to just to find out the truth or you can get through the public she wanted to change much seem up had wanted her to host the fashion program that she refused she was interested in\nSocial inequality and corruption so she created an in depth news program called the ... and it will take the food is the first story she featured was about Bulgarian politicians and businessmen misusing European Union funds\nIt was a joint report by independent journalists in Romania and Bulgaria [noise]\nHer producer Yvonne Stefano anticipated backlash are Fifteen photos\n... reviews when money and all that turned out murdered to find out who says an international press group offered to evacuate him out of Bulgaria or food or or will not go all out here because we must smoke free press group said journalists are vilified\nEverywhere Ernest ... of the international federation for journalists told the TV network euro news that they're increasingly targeted and murdered all over the world\nAnd doing it for doing the other parts of the war in Iraq is that you don't try to find a ... interview for five or go to this kind of problems and also be a bit of two or three invoked of just from\nIn a new member states are currently investigating too high profile murder of journalists both\nWere investigating corruption Slovak journalists young ... and his fiance were both shot dead in February in their home in southwestern Slovakia\nThree people were recently charged in the murders and almost a year ago in the ... smallest member state the island nation of Malta investigative reporter Daphne kind of want to go to let's see I was blown up in a car bomb the mastermind is still at large\nKind of want a glitzy a son Matthew who is also an investigative journalist describes the dangerous in reporting on corruption\nBoth were investigating corruption Slovak journalists young ... and his fiance were both shot dead in February in their home in southwestern Slovakia\nThree people were recently charged and the murders and almost a year ago in the ... smallest member state the island nation of Malta investigative reporter Daphne kind of want to go to let's see I was blown up in a car bomb the mastermind is still at large kind of want to glitzy a son Matthew who is also an investigative journalist\nDescribes the dangerous in reporting on corruption\nIn the region to investigating corruption over long periods of time I'm just really deep into his story they all feel all their lives just ongoing everyone\nIn the most dangerous things will go ... [noise] it's still\nNot clear why the Bulgarian TV host Victoria ... by with murder the police say the evidence so far indicates she just may have been in the wrong place at the wrong time\nThey say they haven't proved to charge a Twenty one year old voter Gary and man with a criminal record for the murder he fled to Germany and was arrested their money and all of us ex husband spilling my seem of light the candle at a memorial for her near a fountain he says he trust the authorities\nFrom the ... the right now it was a group of those but it's also a view that journalists in Europe have been murder and the ... and there's a problem and we have to deal with it\nHe wants to European leaders to keep pushing for press freedom for NPR News I'm Joanna Kakissis in Russa Bulgaria\n[noise]\nStock prices had their worst days since February on Wednesday with the Dow Jones industrial average losing more than three point one percent of its value\nAnd it still has continued today in international markets stocks were down in Asia and Europe and China's most important index fell by more than five percent as NPR's Jim Zarroli reports investors are coming to grips with rising interest rates and worries about the trade fight with China\nPrices were down for much of the day then late in the afternoon they seem to fall off a cliff with tech stocks such as Facebook and Amazon hit especially hard\nAmong the catalyst was a profit warning from specialty chemicals company P. P. G. industries which said it was being hurt by higher cost and softer demand in China\nAsia and Europe and China is most important index fell by more than five percent at NPR's Jim Zarroli reports investors are coming to grips with rising interest rates and worries about the trade fight with China\nPrices were down for much of the day then late in the afternoon and they seem to fall off a cliff with tech stocks such as Facebook and Amazon hit especially hard\nAmong the catalyst was a profit warning from specialty chemicals company P. P. G. industries which said it was being hurt by higher costs and softer demand in China\nScott Anderson chief economist at bank of the west says investors are realizing that trade fight with Beijing won't end soon\nGiven the rhetoric red herring on both sides between us and China looks like both sides are showing for a long term trade fight you're\nAmong the big losers yesterday were Boeing and caterpillar which do a lot of exporting but yesterday's route had other causes as well jak apple and chief investment officer at crass wealth advisors says in recent years the Federal Reserve and other central banks have kept interest rates low now they're rising again\nIt will mean mortgage rates that are up financing costs that are up so we'll take some of the boost that we've had in economy and tone it down\nAnd ... says it will probably take a while before interest rates find their natural level so expect them to keep rising\nI view the this is really part of this movement in these tectonic plates that are going on underneath the surface\nAllen says there are other reasons stocks are falling such as uncertainty about the midterms in what they will mean for President Trump's economic agenda\nThe good news he says is that the economy remains basically healthy overall that is the message that Trump himself is trying to stand after yesterday's big drop in prices the White House put out a statement saying the economic fundamentals are incredibly strong\nAnd it said President Trump's economic policies have created a solid base for continued growth Trump also once again attacked the fed for raising interest rates saying I think the fed has gone crazy\nCreated a solid base for continued growth Trump also once again attack the fed for raising interest rates saying I think the fed has gone crazy\nJoe Hernandez from member station W H y y report\nMenendez was fired up as he spoke to a crowd in Princeton New Jersey last month he's kept himself as a foil to President Trump whose approval ratings in the Garden State or in the thirties\nDo Hernandez from member station WHYY report\nMenendez was fired up as he spoke to a crowd in Princeton New Jersey last month he's cast himself as a foil to President Trump whose approval ratings in the Garden State or in the thirties Jersey and I\nDon't need someone who will stand with Donald Trump they need someone who stand up to Donald Trump\nContrast that with the Bob Menendez of ten months earlier last November he had just walked out of a federal courthouse in Newark a free man after a judge declared a mistrial and his corruption case those\nNew Jersey you gave me the benefit of that [noise] I think justice\nDepartment prosecutors had accused Menendez of taking gifts trips from a wealthy friend in exchange for political favors Menendez survived a legal trouble but he was officially admonished by the Senate and his poll numbers in New Jersey took a hit\nAnd it wasn't long after he announced he would run for reelection that attack ads like these started appear al members\nBy Obama jak department for taking hundreds\nThousands of dollars in improper again and campaign contributions\nIt's a great New Jersey deserves\nThat ad comes from and then there's his opponent Republican Bob ... a wealthy businessman who's funding his own campaign\nYou can as a marine veteran and a political newcomer who says New Jersey you should be embarrassed by Mendez earlier this year she stepped down as the head of cell gene uh New Jersey based pharmaceutical company he touts cell gene as an example of a drug company that identified the patient need and satisfied it\nSounds as an amazing thing for cancer patients turning multiple cancer from a terminal diagnosis chronic disease but\nCritics say sell gene is more like a poster child for high drug costs and shady marketing tactics Menendez has seized on that issue to discredit\nHuge corporate greed look like company and now she's not hearing said the more people needed more charge Cuban\nIs running as a moderate Republican he supports abortion rights and gay marriage he is also supported President Trump and donated tens of\nAnd as an amazing thing for cancer patients turning multiple cancers from a terminal diagnosis to chronic disease but\nCritics say sell gene is more like a poster child for high drug costs and shady marketing tactics Menendez has seized on that issue to discredit\nCorporate greed look like drug companies now ... about he said the more people needed drugs that are in charge of Cuban\nIs running as a moderate Republican he supports abortion rights and gay marriage he is also supported President Trump and donated tens of thousands of dollars to elect Trump and twenty sixteen\nAnd if they were no Republican has been elected to the Senate since Nineteen Seventy two\nYou might think you can support for Trump would taint his chances that victory in fact to recent polls show Menendez in the lead but two other public polls have Menendez and you get in a dead heat confirming with some Democrats had feared that Menendez is corruption trial even though it didn't end in a conviction is turning off voters\nBeen working runs Rowan Institute for public policy and citizenship\nIf you're watching these ads you'd think Bob Menendez was convicted a and for some reason it's not in jail\nThe question is which Bob Menendez democratic voters will be thinking about when they show up to the polls the one who's skated on federal bribery charges weren't the one who will opposed president Donald Trump\nFor NPR News I'm Joe Hernandez\n\nAnd later today on all things considered some people have been mailing away for their genetic information and then hosting it on line to try to track down long lost relatives here at three about why that is probably very bad idea\nTo listen to that ask your smart speaker to play NPR\nOr ask for your local member station\nIt is NPR News for Waldo\nWaldo five grand finale happens October twentieth in downtown in Colorado Springs\nMoney raised benefits while the Kenyan restoration and trail maintenance information on the community counter link and tears you see that or gee [noise]\nTargeted for who they are [noise]\nShe was murdered in her new home\nShe should've said\nShe said it from the\nMurders of transgender women and men of color are on the rise\nWe've for why they're being targeted and what's being done to protect them that conversation next time on the take away from WBUR\nAnd Ali happens October twentieth in downtown in Colorado Springs\nMoney raised benefits while the Kenyan restoration and trail maintenance information on the community counter link at ... dot ORG\nTargeted for who they are [noise]\nShe was murdered in her new home\nShe should've said [noise]\nShe should have ...\nMurders of transgender women and men of color are on the rise\nWe've for why they're being targeted and what's being done to protect them that conversation next time on the take away from WNYC NPR eyes\nTo take away this morning at eleven o'clock hope you can join us for that program on southern Colorado's NPR station Ninety One point five K. R. C. C. is seven forty four I'm Abigail back then and you're listening to MORNING EDITION\nThe constitution gives Congress the power to declare war but presidents have gradually chipped away at that power\nThe result is a modern president nowadays can start a war almost singlehandedly and most of them are testing\nA new book examines how this shift took place from Eighteen twelve to recent times more on that coming up at seven fifty one in woodland park it's twenty nine degrees and high today of forty eight\nLight rain expected this afternoon and in Colorado Springs it's thirty four degrees uh Hi I'm forty four slight chance for rain showers instill some dense fog\nProgramming on Ninety One point five K. R. C. C. is supported by ill but you know would even pizza pleased to support quality programming on Ninety One point five to your cc ill between of features fresh baked streets a pasta Mike Rowe brood ales and more downtown and university village\nBy silver key providing freshly prepared home deliver meals for any one age sixty plus\nMeals are delivered to your home at lunchtime by volunteers silver key dot org or seven one nine eighty four to three zero for\nGood morning I'm David Greene so you're a parent you feel like dressing up on Halloween kids dressing up as guy Walker and so you decide for fun you're going to go as Princess Leia well I Would just not do that in Chesapeake, Virginia a city law there says anyone over age twelve who engages in quote the activity commonly\nKnown as trick or treat could face a hundred dollar fine or up to six months in jail\nMaybe I'd be okay with this if they let me take my candy with me you're listening to MORNING EDITION\nSupport for NPR comes from this station and from indeed used by over ...\nThey are a parent you feel like dressing up on Halloween your kid dressing up as a guy Walker and so you did lie for fun you're going to go as Princess Leia while I Would just not do that in Chesapeake, Virginia a city law there says anyone over age twelve who engages in quote the activity commonly\nKnown as trick or treat could face a hundred dollar fine or up to six months in jail\nMaybe I'd be okay with this if they let me take my candy with me you're listening to MORNING EDITION\nSupport for NPR comes from this station and from indeed used by over three million businesses for hiring where employers can post jobs and use screener questions to build their short list at preferred candidate learn more and indeed dot com slash higher\nFrom Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more learn more H. I. S. T. O. X. dot com or from an agent Hitchcock's insurance encourage courage and from Americans for the ...\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene it was a hot dry summer this year and the American southwest and farming communities and the four corners region were Colorado Utah Arizona and New Mexico share a border water supplies\nHas been scarce and drink dry times like these some people are willing to do just about anything to get more water including\nStealing it from member station K. you in the Luke Runyon has more on a local man who's known as the water cop\nOne morning a few years ago David Hume got a call the woman on the other end was frantic screaming as she watched her eighty two year old husband in the yard\nAnd he was being beaten with a shovel by as eighty six year old neighbor the fight was over water\nOne of the men accused the other of taking more than his share from their irrigation ditch leaving less for everyone else\nOr you had to old timers that were very stubborn and very hard headed and there were bound and determined to do it their way and the other party was saying no you won't\nHear is the sheriff's deputy and monitors human County Colorado in the four corners tasked with enforcing the state's complex water law he's probably the only deputy in the state with this kind of job making sure water goes where it's supposed to\nWe've seen some really inventive ways this year\nSo how do they do it well one method drop all pumped into an irrigation ditch turned it on and if you don't have the water rights to do that\nTheir way and the other party was saying no you won't\nHear is a sheriff's deputy and monitoring my County Colorado in the four corners tasked with enforcing the state's complex water law he's probably the only deputy in the state with this kind of job making sure water goes where it's supposed to\nWe've seen some really inventive ways this year\nFor stealing water so how do they do it well one method drop all pumped into an irrigation ditch turn it on and if you don't have the water rights to do that it's a crime\nMethod number two you have rights to water but not a lot so you take more than you're allowed court has on the design inside as black Ford pickup human says when he started handing out tickets for water that it didn't go over well\nFirst of people were shocked\nThey were like getting me right you're going to like me over water it was like yes it's a valuable commodity in this day they're\nSeventy six year old farmer Bob Schuster knows all about water the he grows wine grapes and hay and runs up plumbing supply store and the county's biggest city of Cortez he's dressed in denim overalls sporting a black and gray beard she says drought make people desperate\nPeople are basically and these are good people basically dishonest\nShooters farm is at the end of an irrigation ditch with several users upstream if they're taking more water than they are entitled to it dries up before it reaches his crops\nThey look out their bills or see the need water and they take the water going through is not there's\nEnded common for emotions to run high in these disputes he said he's had guns pointed out M shovels swung it hadn't been sucker punched in fights with neighbors over water happy\nBack at the office heun says violent skirmishes have declined since the county started in forcing water law but it's the fragile peace\nHistorically we've had people killed over water and the state of Colorado we have in this county\nHuman is on patrol in a part of the country where climate change is likely to make water even more scarce than it is now\nThe law but it's the fragile peace historically\nWe've had people killed over water in the state of Colorado we have in this county\nCute is on patrol in a part of the country where climate change is likely to make water even more scarce than it is now\nIt is MORNING EDITION from NPR News I'm Rachel Martin\nYou can sum up ... caissons activism in forwards show up dive in we have to be\nThis is MORNING EDITION from NPR News I'm Rachel Martin\nYou can sum up to Raymond caissons activism in forwards show up dive in we have\nTo be on the inside can't just be an outside only strategy and that is very different than it was before Trump won since Michael Brown was shot dead in Ferguson, Missouri McCutcheon has become a leading voice and the lightning rod in the black lives matter movement you know he's selling his own story next time on one day\nYou can catch one day and just about an hour that's at nine o'clock on Ninety One point five K. R. C. C. southern Colorado was NPR station K. R. C. C. H. D. Colorado Springs\nKate ISI see the hunter Casey ... K W CCF in woodland park streaming at K. R. C. C. dot O. R. G.\nDense fog unlimited visibility throughout El Paso county and the pikes peak region this morning please be cautious as you hit the roadway chili with temperatures in the twenties and thirties warming up to the forties and fifties it's eight o'clock in the news this next\nHurricane Michael has devastated parts of the Florida Panhandle and now the storm even aimed at the Carolinas where people are still recovering from Hurricane Florence was the latest on MORNING edition\nWith our how residents along Florida's Gulf Coast are you hoping and what more damage this storm could cause as it moves inland top David\nAnd I'm Rachel Martin will also have the latest on the disappearance of the Saudis are new reporting says the Saudi crown prince himself ordered an operation\nTo get the journalist that Saudi Arabia and he was in college in the mail to NPR's Mara Liasson takes a closer look at what's at stake for Democrats\nPortugal explores the dark chapter\n\nLine from NPR News in Washington on corporate Coleman the national Hurricane Center\nI'm David Greene and I'm Rachel Martin will also have the latest on the disappearance of Saudi journalist new reporting says the Saudi crown prince himself border to an operation\nAgainst journalists that Saudi Arabia and intelligence agencies males NPR's Mara Liasson takes a closer look at what they were Democrats\nPortugal explores the dark chapter\n\nLine from NPR News in Washington I'm more of a Coleman the national Hurricane Center says tropical storm Michael is now over central South Carolina\nIt tops Dana Windsor at fifty miles per hour he continues to move east and will strike North Carolina and parts of southern Virginia leader in the afternoon\nIt will move into the Atlantic ocean later tonight Michael and crashed into the Florida Panhandle yesterday as a major hurricane with wind speeds of one hundred and fifty five miles per hour catastrophic damage is feared\nStephanie Brandon is with the red cross staged in Tallahassee, Florida\nWe've mobilized hundreds of volunteers around the country in even in the states affected and they're ready to roll up their sleeves and help those affected in these communities\nAt least two people have been killed in Florida and Georgia\nAnd hundreds of thousands of customers do not have power\nThe Russian space agency has suspended all flights of its ... rocket program following a dramatic launch failure today an astronaut ... had to make a hard emergency landing Matthew bother reports from Moscow the crew has been safely recovered in remote context on\nThe Russian space agency so that it is investigating the cause of the failure but will hold no press conferences today\nWhat is clear that the soil you will not fly again until the cause of the failure is identified a live broadcast that the launch showed that the Russian American crew experience that sensation of weightlessness and spinning a booster separation signaling that a serious problem had occurred\nRussian space program deep in crisis has experienced a series of high profile launch failures over the past decade\nBut never in the twenty year history of the ice has program has a man so he's rocket experience they problem on launch the failure follows the discovery last month of mysterious hole in the store you spacecraft currently dog to the international space station which has raised sharp questions about quality control for NPR News I'm Matthew Bodner in Moscow\nStock markets in Asia plunged today following yesterday's sell off on Wall street Chinese markets plunged by five percent\nKurt Russian space program deep in crisis has experienced a series of high profile launch failures over the past decade\nBut never in the twenty year history of the ice a program has a man so he's rocket experience they problem on launch the failure follows the discovery last month of mysterious hole in the store you spacecraft currently dog to the international space station this has raised questions about quality control for NPR News I'm Matthew Bodner in Moscow\nStock markets in Asia plunged today following yesterday's sell off on Wall street Chinese markets plunged by five percent while Japan's Nikkei average with down nearly four percent markets in Europe continue to live and beers or he Berliner says there are several reasons for the global sell off\nAmong them a technology stocks which are really propped up the market which of blew the market for so long\nUh they've started to fall I'm as well as there are higher interest rates for all kinds of things you'll on treasury bonds are up that could make them more attractive ... thoughts and hanging over all of this or the trade tensions between us and China they're real they're not going away and this could be making the mood in the mortgage darker and\nBears around Berlin or in Washington meanwhile stock market seemed to be recovering a little bit today on Wall street the Dow Jones industrial disrupt forty eight point twenty five thousand six hundred and forty seven the NASDAQ eased up about fifty points the U.S and the five hundred is up five [noise] this is NPR\nIt's a you know for I'm Abigail back then with Ninety One point five K. R. C. C. news early winter weather across Colorado might help draw the year's dizzy fire season to a close freezing\nTemperatures and early snow hit the mountains this week dampening one of the state's worst wildfire season record breaking heat and limited moisture last month help to keep the season going the cold is expected to stick around throughout this week in through the weekend across the state\nA promise of increased funding earlier this year is anticipated to expedite clean up at the Colorado smelter Superfund site in Pueblo and a new contractor is taking over the work Ninety One point five K. R. cc's Shawna Lewis reports\nSoil has already been removed and replaced in forty seven yards in South well blow to address toxic lead and arsenic left behind by long gone silver smelter the environmental protection agency Sabrina forest anticipates a yard clean ups will begin again with the new contractor and early twenty Nineteen were really pushing to make it happen as quickly as ...\nAt the Colorado smelter Superfund site in Pueblo and a new contract or is taking over the work Ninety One point five K. R. cc's Shawna Lewis reports\nContaminated soil has already been removed and replaced in forty seven yards in South will blow to address toxic lead in arsenic left behind by long gone silver smelter the environmental protection agency Sabrina forest anticipates a yard clean ups will begin again with the new contractor and early twenty Nineteen\nOr really pushing to make it happen as quickly as possible recognizing that people want to continue to see clean up continue we do as well\nSoil sampling is complete and more than half of the Seventeen hundred residential properties in the area and testing is ongoing the EPA expects preliminary air quality monitoring results next month for Ninety One point five ... News I'm Shauna Lewis\nYou are listening to Ninety One point five K. R. C. C. News I'm Abigail Batman it is eight six MORNING EDITION continues entail nine o'clock when we will bring you won a stay with us\nSupport for NPR terms from NPR station other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\n[noise]\nLet me one point five ... has been southern Colorado's NPR station since Nineteen eighty four discover more ... dot org and follow us on Facebook and Twitter [noise]\nSix minutes after eight o'clock you're listening to MORNING EDITION this is southern Colorado was NPR station Ninety One point five K. R. C. C. crew members had to abort the launch of a Soyuz rocket today abandoning a mission to the international space station\nDetails coming up at eight twenty and Buner vista is thirty degrees and the hunter thirty nine and in Colorado Springs it's thirty four degrees limited visibility thanks to dense fog throughout the region\nHigh temperatures today in the forties and fifties rain as possible for the planes you know in the forecast for ... universe don't and Raton\nProgramming on Ninety One point five through your cc is supported by monument occupational medicine working was injured workers and employers dedicated to helping employs return to work with comprehensive medical care drug screening and view to you\n[noise] ... it is thirty degrees and the hunter thirty nine and in Colorado Springs it's thirty four degrees limited visibility things to dense fog throughout the region high temperatures today in the forties and fifties rain is possible for the planes you know and the forecast for ... you know the stand and Raton\nProgramming on Ninety One point five to your cc is supported by monument occupational medicine working was injured workers and employers dedicated to helping employees return to work with comprehensive medical care drug screening and beauty exams in pre employment physicals monument OCC med dot com [noise]\nWhy Colorado Springs philharmonic\nPresenting ... for true SCA with Joseph ... Dominican conducting this Saturday and Sunday and probably speaks center\nMore as the U.S philharmonic God or\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California and I'm Rachel Martin in Washington DC officials in Florida in Georgia are surveying the damage caused by a historically powerful storm\nHurricane Michael struck the Florida Panhandle yesterday as a category for storm one of the strongest to hit the region\nSince they started keeping records back in the mid nineteenth century it toward to the panhandle into Georgia ripping trees from the ground rules from homes\nIt has now been downgraded to a tropical storm but that still means a lot of rain and wind as it moves north and east end of the Carolinas Mario gets bird in the city manager of Panama City beach and I reached him earlier has he been surveying the damage\nRacial one of the biggest problems we have right now is one of the issues that you and your station and I have been dealing with all morning and that's communication we have almost no lines of communication and when I say almost no I mean my\nPolice chief cannot communicate with my share of right now cell lines are down radio towers are down um and we have we have things that we can offer here on the beach because we did not get the damage that was a gun over into Panama City\nUm and we have we have things that we can offer here on the beach because we did not get the damage that was um done over into Panama City\nIt's MORNING EDITION from NPR News\nThe Kavanaugh hearings and confirmation raised the question again how do we decide who to believe when a woman said she was sexually assaulted\nIt's MORNING EDITION from NPR News\nThe Kavanaugh hearings and confirmation raise the question again how do we decide who to believe when a woman says she was sexually assaulted by someone she knows behind closed the door\nAnd the men denies it\nThat's an issue universities have been dealing with on the next fresh air we talked with Vanessa ... author of blurred lines sex power and consent on campus joined us\nFresh air is today at noon and every weekday at noon on southern Colorado's NPR station Ninety One point five K. R. C. C. news yesterday President Trump addressed the disappearance of a Saudi Arabian journalists\nRegion that life is to reporters to anybody we can't let this uh [noise]\nAnd we're here to get to the bottom of\nTrump said he had also spoken to the Saudi Government about the situation\nMore on the latest in that story coming up just after eight thirty\nUntil I die it's thirty one degree the height of fifty five a chance for rain and snow this morning in canyon city thirty seven high as at fifty one clouds this morning breaking way for sun this afternoon and in Colorado Springs it's thirty four degrees a high of fifty five forty five excuse me\nMaybe some rain this morning and there are still patches of dense fog across the city I the roads maybe some hazardous conditions throughout the region\nSo plan your commute accordingly it's eight Twenty one\nNPR oh Ninety One point five through your cc is supported locally by into credit union and business banking is committed to comprehensive solutions to help solve small business challenges including business trucking details that ended dot com slash was misjudging federally insured by and the U.S what the Colorado Springs\nFine arts center at Colorado College presenting Virgil or tease revolution rise against the invasion reimagining the sixteen ... five hundred years later on you know Colorado College dot edu slash if they see\nThis station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original\nSong small business challenges including business trucking details at ... dot com slash business checking federally insured by ...\nBy the Colorado Springs fine arts center at Colorado College presenting Virgil or tease revolution runs against the invasion reimagining the sixteen ... ruled five hundred years later on you know Colorado College dot edu swaths of the sea\nFrom this station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself at visit main dot com\nFrom capital one offering a variety of credit card options with features for a range of customers from foodies to travelers capital one what's in your wallet credit approval required capital one bank usa NA\nFrom Amazon Prime video presenting the return of the man in the high capital where America's history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nAnd from listeners like you who donate to this same PR station\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin crew members were forced to abort the launch of a ... rocket today the American astronaut and Russian cosmonauts are reported to be in good condition but the rockets mission to the international space station failed and Russia space agency says the program is now suspended\nJoining us out with more reporter Matthew Bodner he is in Moscow and on the line Matthew can you to the degree that you know explain what went wrong [noise]\nShirt so about two minutes and could launch the first stage boosters ... rocket the couple and the astronauts aboard the rocket reported vibrations waitlisted at one point five\nThis was evidence from the footage that we could see on the wife broadcast\nI'm clearly not something you want to have happen what happened over the next few minutes is not entirely clear yet I'm the angel shut off the crew separated from the rocket and they began with that so called a foolish landing\nEssentially a very high speed flight on powered through the atmosphere to what ended up being the landing site um during this time it wasn't exactly clear what happened to the cruelty of out of communication for ... for for a few minutes um for the rescue teams that now recovered them and they're on the way back to the bike and will cause a job\nMean the correct me if I'm wrong but it's my understanding that um that with that\nHappened what happened over the next few minutes is not entirely clear yet I'm the angel shut off the crew separated from the rocket and they began with that so called a ballistic landing\nEssentially a very high speed flight on powered through the atmosphere to what ended up being there landing site um during this time it wasn't exactly clear what happened to the crude out of communication for a walk for for a few minutes of the rescue teams that now recovered them and they're on the way back to the bike and will cause a job\nI mean the correct me if I'm wrong but it's my understanding that um that that that sold for lack of a better word rockets shuttles are going up to the international space station on a fairly regular basis on a ventilator what is this a routine mission\nAnd this was a very long should rethink mission for the past few years of this so we use rocket as it's called it's been the only way to reach their face station and fights go up every every few months huh\nUm what the problem is is that while there has been going on I'm Russian rockets a different different types have been seeing an increasing frequency of various failure and official you have for for a while now and said that the man so you go through a special certification process special care is given\nTo ensure that they that they remain man rated safer event flight\nWell and in many related ... let me just ask you in in seconds remaining on the program has now been suspended do we know for how long\nThat that's a good question three ... three months at least a ... we'll see there's a crew up there right now that only has if that's all they can return 'em no later than December so they need to find a solution before December or the future of the ice has programs probably temporarily in jeopardy\nFile okay reporter Matthew Bodner on the line from Moscow talking about that a boarded so he is rocket mission to the international space station thanks so much that you we appreciate it I think you\nPortugal has a rich history of exploring once on charted land like Brazil and Africa but with that history comes the shame of the slave trade\nIn Lisbon to separate public projects of slavery memorial and museum celebrating Portuguese exploration have become lightning rod for debate about the country's colonial past Jake's again or reports [noise]\nThese into rolling waves once carried African slaves from listening to the new world a memorial recognizing Portugal's role in the colonial slave trade will be erected in a grassy square steps away the memorial was approved in a public vote the controversy about the ...\nBill and Africa but with that history comes the shame of the slave trade in Lisbon to separate public projects of slavery memorial and museum celebrating Portuguese exploration have become lightning rod for debate about the country's colonial past Jake beginner a report [noise]\nThese gentle rolling wave once carried African slaves from listening\nTo the new world for memorial recognizing Portugal's role in the colonial slave trade for erected in a grassy square steps away from the memorial was approved in a public vote the controversy about the country's history of colonization and slavery still continues\nDescendants from former colonies like Angola and Mozambique up until now they have been denied a place in Portugal history Beatrice go ... ... the president of just the anti racism association that propose the slavery memorial\nSometimes I remember me being a child in living in Lisbon and having no reference is looking at the majority of ... the pilot and not be like them and not having a place for me in front of people like me her\nGroup wants to honor slave she says are often portrayed in Portuguese history as no more than good for trade\nPoliticians here often claim Portugal is one of the least racist countries in Europe the D. S. said many black Portuguese don't agree\nAre not recognized as Portuguese because that fall late relating black Portuguese to the countries in Africa there were occupied by force without yet\nIt's also a critic of the other historic project to plan for ... the tentatively named museum of discovery which would tell the story of the amazing voyages of exploration carried out by Portuguese navigators who first charted roots around Africa India in South America\nThe U.S and other critics say the museums theme would whitewash the violence of Portugal's colonial history but in turn the supporters of the museum accused their detractors of denying the trial of Portuguese explorers\nFull other issues like scientific discoveries cultural relations which they ... only ... should know flavor for us it's used for fondly wrong\nThat we're not too at the ... the president of the international Luther phone movement which promotes Portuguese language and culture around the world at the ... says the Portuguese didn't invent slavery but it was part of their history he said the slavery memorial and the museum of discoveries\nDenying the trial of Portuguese explorers\nFull other issues like scientific discoveries culture relations which they're not ... it's only the question of slavery for us it's used for fondly wrong\nThat we're not at the ... the president of the international Luther phone movement which promotes Portuguese language and culture around the world at the ... says the Portuguese didn't invent slavery but it was part of their history he says the slavery memorial and the museum of discoveries would complement each other\nIn the right context but that context doesn't exist in Portugal according to anthropologist Bruno saying I'm are tens\nPartial as a self rivers and passion in which the violence history of what it is not far preferred\nMartin's lectures that Portuguese high school about slavery in colonial violence he says there's a clear resistance to talking about slavery and the official history curriculum down places subject\nIgnoring racism or a long history to pass the quarantine and violence or prices in our society\nFor long enough yes Hi this is not\nA new debate for Portugal Fernando wrote that a historian and former parliamentarian says the different today is that researchers of African descent are changing how Portugal talks about it passed that's why he says the museum will need a different name\nDiscovered in Michigan we didn't discuss anything because people was there and the people that bought it at least cover it was also the budget is the right name is openly GMO flow nearly as because he's a bump that that you actually speaking [noise]\nWhen the slavery memorial is unveiled next year frozen says it will be a milestone in the fight between\nPortugal passed and its future for NPR News I'm Jake scanner rope and lives in [noise]\nYeah [noise] yeah [noise] yeah [noise] yeah [noise] [noise] yeah [noise] yeah\nYeah [noise] yeah [noise] yeah [noise] yeah [noise] yeah [noise] yeah this is NPR\nWell as you remember the first trip the Trump made outside the United states wasn't to Canada or Mexico traditionally what the US President do but a uniquely to Saudi Arabia where he was treated\nLiterally like a king and of all the relations he has around the world perhaps only Israel is closure of both to Trump a and a and Jared Kushner and mom I've been following the crown prince\nI'm In Saudi Arabia or so it it would really be tough for Trump personally uh to do anything that would\nWhat is President Trump and his administration's relationship with Saudi crown prince\nWell as you remember the first trip that Trump made outside the United states wasn't to Canada or Mexico a traditionally what the US President do but a uniquely to Saudi Arabia where he was treated\nLiterally like a king and of all the relations he has around the world perhaps only Israel is closer or both to Trump a and a and Jared Kushner and Mohammed bin Salman the crown prince I'm In Saudi Arabia or so it ... it would really be tough for Trump personally to do anything that would want to damage\nThis relationship with is one thing we know from Trump or it would really be confusing for him\nTo allow a human rights abuses at uh in in another country to stop him from trying to take advantage of a pretty good relationship\nUm UC what he's been saying about the north Korea and Supreme leader for example in the same interview that you are earlier are presented Trump also said that he wouldn't want to reduce arms sales to Saudi Arabia because that would hurt the United states\nBut this is not just a a human rights abuses if this turns out to be true in Saudi Arabia actually killed a journalist and Turkish soil or I mean Lindsey Graham Republican senators saying they would have to be held to pay isn't that going to increase the pressure on President Trump to to do something here\nWell I'm not sure it will I mean you know the the the media was more outraged I think about Trump's individual meeting with President pollutant in Helsinki and the press conference afterwards I mean even Fox News and a number of the Republicans were on the defensive around it but we're not talking about that anymore\nUm look I mean you and I can say that it is horrific um\nFor the most popular Saudi journalist to be what looks like pretty clearly um killed 'em in a consulate abroad in not in the American allies conflict abroad by the way but I don't think that means that Trump is going to be pressured what what is it interesting of course is the ability of the Senate\nAnd others to constrain Trump's foreign policy when they feel that he's acting beyond the pale is significant it in the same way that we've seen I'm assuming that increases in sanctions against the Russians that Trump has attempted to slow walk\n'em I think the same thing is likely to occur these heavy Saudi Arabia and and that's going to be very interesting to watch over the coming months especially because Trump is putting so much pressure on Iran after pulling out of the nuclear deal the about the enemy of Saudi Arabia\nThe ability of the Senate\nAnd others to constrain Trump's foreign policy when they feel that he's acting beyond the pale is significant and on the same way that we've seen 'em sit it increases in sanctions against the Russians that Trump has attempted to slow walk\n'em I think the same thing is likely to occur these heavy Saudi Arabia and and that's going to be very interesting to watch over the coming months especially\nBecause Trump is putting so much pressure on Iran after pulling out of the nuclear deal the about enemy of Saudi Arabia and Congress has been quite on board with that so these two things are going to come together\nThe government known for intimidating their citizens who live abroad that the surprising in some way\nUm it it again it's it's gotten worse certainly um but he's been threatened before um you know he was forced out of his job um he was defending a lot of his friends who are opponents of the Saudi regime or he has a lot of friends in the United states in high places but there's no question that he was considered to be\nA real problem for the Saudis the Saudis overreacted to the Canadians on the Canadian government took umbrage at a Saudi behavior you will remember of course a just a year ago all of those Saudi princes that were detained\nIn the Ritz Carlton there were some reports of torture when that occurred\nDidn't stop the U.S Saudi relationship from being extremely strong and again I just point you to North Korea I mean Trump expressing his love for Kim Jong il and who's by far the most criminal behavior we've seen in the world\nBremmer will have to stop their thanks so much for joining us [noise] he is founder of the global political risk ... the the Eurasia Group [noise] this is NPR News\nNear from NASA at the forefront of Mars exploration was here he is he has been for unraveling the mysteries of space and Mars and twenty six incentive for the most amazing on the calendar linked team or CBC\nDot ORG\nTargeted for who they are\nShe was murdered over new home\nShe says\nShe set a ball murders of\nTransgender women and men of color are on the rise\nWe've or why they're being targeted and what's being done to protect them that conversation next time on the take away some WNYC NPR I\nJoined in the ... coming up this morning at eleven o'clock followed by fresh air at noon on southern Colorado ... NPR station\nTargeted for who they are [noise]\nShe was murdered in her new home\nShe should've been safe [noise]\nShe should have done the\nMurders of transgender women and men of color are on the rise\nWe've for why they're being targeted and what's being done to protect them that conversation next time on the take away from WNYC NPR I\nJoined it's where the takeaway coming up this\nMorning at eleven o'clock followed by fresh air at noon on southern Colorado's NPR station Ninety One point five K. R. C. C.\nComing up on the marketplace morning report the consumer price index a measure of the price of goods and America is out this morning we'll the news sous quickly declining markets that plus all the morning's business news coming up at\nEight fifty one on the marketplace morning report [noise]\nIn woodland park it's thirty three degrees of high today of forty eight light rain expected this afternoon in Pueblo thirty eight a high a fifty five soggy with a slight chance for some rain showers and in Colorado Springs it's thirty five degrees higher of forty five cloudy with a slight chance for rain\nProgramming on Ninety One point five to your cc is supported by the Colorado Springs school hosting a pre K. through twelfth grade open house in school showcase\nFeaturing the arts sciences and family entertainment Saturday November temp wonder for pm more at fiercer S. dot org\nDistillery do Ninety One small ... remaking whiskey in the foothills of the Rocky Mountains and founded package stores throughout Colorado open Wednesday through Sunday would live blues Wednesday night distillery to Ninety One switch dream forty seven self doing [noise]\nGood morning I'm Rachel Martin and if you're eating breakfast right now I'm Sorry to things are about to get growth there's a new museum opening in Sweden which will take you on a tour of the world's most disgusting food\nFermented soybeans bam monkey brains and maggots museum founder of Samuel ... told the Washington Post he wants people to realize\nThis is always in the eye of the beholder but he realizes that visitors might still\nGet queasy the museum ticket is actually a vomit back It's MORNING edition\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com [noise] from it\nAlways in the eye of the beholder but he realizes that visitors might still get queasy the museum ticket is actually a vomit back It's MORNING edition\nSupport for NPR comes from the station and from log me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\nFrom exact science is offering color guard for average risk it all over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information I call a guard test dot com\nAnd from the listeners to support that NPR station\nThis is MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm David Greene let's remember this morning how Havana founded back in the Nineteen fifties in Nineteen sixty\nMusic you're hearing here is part of a new box set that really captures the golden age of afro Cuban music it contains five legendary albums between some of Cuba's finest musicians these recordings were made in Havana pan art studios between Nineteen fifty six and Nineteen sixty\nFour that's the period just before communist leader Fidel Castro nationalized the recording industry and since then these albums have become extremely hard to come by\nUntil now that is that is called the complete Cuban jam sessions volumes one through five and here to talk about it is Felix Contreras host of NPR's all but you know podcast they'd be like Hey David what's happening [noise]\nWill I'm enjoying the music I there's very little Cuban music you play with that I don't know what I Will [noise] first of all the studio\nPet arts studio was the best deal in Cuba so that virtually every major Cuban artist headed leader at some point or another and these sessions or from after hours Jeff Sessions after the musicians played their gigs or places like the hotel mouse you know and they're really opulent Tropicana nightclubs\nThese are the best musicians gathered together to experiment with that mixture of afro Cuban music and\n... [noise] [noise] [noise] so this was like the after our stuff yeah to pick our focus is a shirt\nAnd the little jackets and they would just go into the room and just started playing and the owner of a studio ran tape the whole time sometimes between ten PM and fixing them while till ...\nSessions after the musicians played their gigs or places like the hotel not you know and they're really opulent Tropicana nightclubs these are the best musicians gather together to experiment with that mixture of afro Cuban music\nAnd ... [noise] so this was like the after our stuff yeah to take off all the civil shirts and the little jackets\nAnd they would just go into the room and just started playing and the owner of the studio ran tape the whole time sometimes between ten PM in six AM\nWhile 'til the sun would come up there you go so what happened exactly when Castro came to power\nOkay eventually he nationalized the recording industry and the bureaucrats takeover right and the free wheeling bohemian themed suffered a little bit because the government felt there was a reflection of the decade next to the United states\nSo the owners of the studio were concerned about what was going to happen with the masters of what was going to happen to the style of music so they started taking be masters and smuggling them out of the country and depositing them in different Latin American countries along the way so what happened to those recordings over the years in hiding\nEventually they were sold the different labels in Latin America over the years some shoddy reproductions were produced along the way but most of the albums became incredibly hard to find\nSo finally a couple of years ago California label craft recordings Baucus Mexican label that was holding on to these tapes and they've figured out what they were holding and he decided to put something like this together [noise]\nSo what are some of the highlights what ends up okay there's one in particular that I call the crown jewel of the of the collection is called jam sessions in miniature it's by the famous basis Israel Lopez for a child and you got to check this stuff because the the music is it is right there [noise]\nYou", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Colorado Springs", "day": "11"}