{"month": "10", "state": "CO", "station": "KRCC", "content": "We'll be back next week and to learn about [noise]\n\nWe'll be back next week until then [noise]\n\nAlso media companies may be unprepared to support their growing role as providers as nice\nA lot of these platforms were not built for you to get good objective information\nAnd with midterm elections approaching experts are expecting a spike in foreign this information we're going to have an October surprise how can American voters identify fake information on the next MORNING EDITION from NPR News\nThis morning starting at five AM on Ninety One point five to your cc\n[noise] I'm Scott Simon Peters egg will here because they're a glass to the American my hello I'm Robert Krulwich ... Ross and I'm John ... using entertainment Saturdays and Sundays on Ninety One point five heresy [noise]\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. la hunter KCBS ... n K W C. C. F. M. woodland park streaming a tea or C. C. dot org\nWho good morning the FBI is moving forward with a ... that's the gay shouldn't into sexual misconduct allegations against Brett Kavanaugh but Democrats the White House limiting\nYou know coming up we question Delaware's Chris Coons one of the senators who pushed for an FBI pro I'm Steve Inskeep\nI'm Rachel Martin President Trump told the un last week that he would support the pollution and with Israel and the Palestinians are\nWe asked Israel's prime minister to respond and NPR's Allison Aubrey on why so few college to get vaccinated for the flu it is Monday October first Matt Damon play Brett Kavanaugh on Saturday Night live over the\nComing up with a question Delaware's Chris Coons one of the senators who pushed for an FBI pro I'm Steve Inskeep\nAnd I'm Rachel Martin President Trump pulled the un last week that he would support at the solution with Israel and the Palestinians we asked Israel's prime minister to respond and NPR's Allison Aubrey on why so few colleges get vaccinated for the flu\nIt is Monday October first Matt Damon play right cabin on Saturday Night live on the\nThe newscasters coming up next\nLife from NPR News in Washington encore of a Coleman the Nobel Committee has awarded this year's prize in physiology or medicine to ... is the committee's secretary general the Nobel family\nInstitute to have to ... to ... the the two thousand a Nobel Prize in physiology or medicine jointly to James P on how school home job\nFor their discovery of cancer therapy bite inhibition of negative immune regulation\nThe Nobel Committee says Allison from the U.S and ... of Japan discovered methods to use the body's immune system in such a way as to arrest the development of cancer their work led to advances in cancer therapy and several such drugs have been approved for use in the United states\nCanada and the U.S have reached agreement for candidate to join a revamped North American free trade agreement or NAFTA talks have dragged on for weeks NPR's Uri Berliner explains what each side conceded\nBoth sides gave up some ground from positions that they were pretty entrenched on Canada said it's going to pry open it's dairy market which has been very protected open it up more to us farmers\nUs backed away from this demand they wanted to get rid of these independent dispute resolution panels that deal with complaints about unfair trade the administration didn't like them at all thought they stepped all over American sovereignty\nUs gave gave up there um and also significantly in the U.S agreed a rich and understand with candidates not going to go ahead and slap tariffs on autos imported from Canada President Trump is threatened that a bunch of times\nHenri Berliner the Justice Department is suing the state of California Ryan levy of member station KCPW key weedy says the suit has over the state's new net neutrality rules signed into law by the governor over the weekend the regulations prohibit Internet providers\nI didn't like them at all ... all over American sovereignty us gave gave up there um and also significantly in the U.S agreed a return to understand with candidates not going to go ahead and slap tariffs on autos imported from Canada President Trump and threatened that a bunch of times\nAnd fears or a Berliner the Justice Department is suing the state of California and Ryan levy of member station KCPW ... says the sued is over the state's new net neutrality rules signed into law by the governor over the weekend\nThe regulations prohibit Internet providers from blocking speeding up or slowing down Internet traffic and from charging more for faster service\nThey mirror Obama era rules that the Federal Communications commission voted to repeal last December within hours of the bill being signed into law the U.S Justice Department announced it would suit California over the new rules state senator Scott Wiener who wrote the bill says he's confident it will stand up to legal challenges\nEarthly or attorney general strong supporter of\nLeader says he hopes to work with other states to strengthen neutrality laws for NPR News I'm Ryan levy\nDisaster officials in Indonesia say at least eight hundred forty four people have died because of last week's powerful earthquake and tsunami on the island to sue Lewinsky the Associated Press says about fifty thousand people have been displaced\nOfficials fear the death toll could climb steeply possibly end of the thousands\nYou're listening to NPR\nIt's many years in the gunman opened fire from an upper floor of a Las Vegas hotel killing fifty eight people attending a country music festival another for hundreds Thirteen people were wounded in the gunfire and dozens more were injured fleeing from the shooting investigator still don't know why the gum and attack the crowd\nThe city is planning a day of reflection and we'll dim the lights along Vegas strip in honor of the victims\nThe jury in Chicago police officers murder trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from member station WBHM easy chip Mitchell reports\nPolice dash cam video shows Jason Van Dyke opening fire is lukewarm McDonald walked away from officers police reports say ... a Seventeen year old who's trying to kill them with a knife in his hand now the officers attorneys are planning to put Florida based police psychologist Laurence Miller\nAnd we'll dim the lights along Vegas strip in honor of the victims the jury in Chicago police officers murder trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from member station WBHM easy chip Mitchell reports\nOf police dash cam video shows Jason Van Dyke opening fire is look one McDonald walked away from officers police reports say ... Seventeen year old who's trying to kill them with a knife in his hand\nNow the officers' attorneys are planning to put Florida base police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing and time perception when cops shoot\nIn twenty sixteen he gave Van Dyke a psych exam\nThe prosecutor wanted Miller barred from the trial he argued only Van Dyke knows what was going through his mind when he fired for NPR News I'm chip Mitchell in Chicago\nThe national Hurricane Center says hurricane Rosa in the Pacific ocean is now a tropical storm but it's expected to make landfall soon in Baja California and then plow north into the United states\nThe national weather service has posted flood watches from the Arizona border with Mexico north through southern Idaho\nI'm core of a Coleman NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include Jones Day and integrated partnership collaboratively providing legal services for more than a century forty three officers five continents serving clients as one from worldwide learn more at Jones Day dot com\nNinety One point five K. R. C. C. and Dr Laura ... have created the legacy find to help thoughtful generous listener to fill their philanthropic goals of ensuring public radio for future generations please consider the K. R. C. C. legacy find when thinking about your state planning\nYour legacy gift will help Ninety One point five K. R. C. C. provide programming that informs educates entertains ended Rich's southern Colorado for years to come more at K. R. C. C. dot org\nWere used the congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative trend among the states and what they tell us about the nation's political direction [noise]\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where it next time on one day from W. A. and you end NPR\nOne a day and I am\nProgramming that informs educates entertains and didn't riches southern Colorado for years to come more at K. R. C. C. dot org [noise]\nWho use the congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative trend among the states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where at next time on one a firm W. A. and you and then\nOne day at nine AM on Ninety One point five to your cc southern Colorado's NPR station\nMemberships or the largest source of funding it Ninety One point five care cc allowing us to bring you local stories NPR News and music thanks for your generous support\nProgramming on Ninety One point five kill your cc is supported by also bravo now serving menu items featuring locally sourced ingredients from the Colorado tortilla company and savory spy shop to the polar dory sausage company and Schmidt ab aries menu and more and it's also bravo Colorado dot com\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep the pause in the Supreme Court confirmation of Brett Kavanaugh amounts to an opportunity it's an opportunity for the Senate to make its confirmation process seem more credible\nTo those who felt it was not the FBI is taking a week to examine allegations that the nominee committed sexual assault and other misconduct decades ago now comes the question of whether the investigation itself will be seen as credible\nThe FBI is acting at the direction of the White House where presidential counselor Kellyanne Conway insisted the White House is not restricting the investigation\nThey probably think very much respect for all the panels that they actually I found that they had last night that they show up at ... that they think it's kind of on with her go\nWe've called Senator Chris Coons of Delaware he as a member of the Senate Judiciary committee he worked with Republican Jeff Flake who is request for a delay on friday ensured that had happened to senator welcome to the program\nThank Steve great to be on with your household is this investigation have to be to satisfy you\n... it's got to be well beyond the initial very narrow scope of four witnesses for individuals being interviewed\nCommittee he worked with Republican Jeff Flake who's request for a delay on friday ensured that had happened to senator welcome to the program\nThanks Dave great to be on with your household is this investigation have to be to satisfy you\nIt's got to be well beyond the initial very narrow scope of four witnesses for individuals being interviewed\nTim Mak NPR News Washington [noise]\nTim Mak NPR News Washington [noise]\nThis is NPR News\nNational news affects the whole country today I'm defending America's national security\nBy placing tariffs on foreign imports steel [noise]\nI don't know it can also affect the places closest to you from big cities to small town\nIt's all about protecting jobs and saving jobs but we're not even making whose job or you're saving when we're not doing it you're\nListening to all things considered here the bigger picture every afternoon from NPR News [noise]\nWeekday afternoons at three thirty\nWere used the congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative trends among the states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where at next time on one day from W. A. M. U. and NPR\nOne a day nine AM on Ninety One point five to your cc southern Colorado's NPR station\nNot\nArmed group Thomas skiing and you're listening to Ninety One point in time on our movie Mm\nIf you're in your area or just a little forgetful and you'd like to know when your favorite program marathon Ninety One point five parakeets the visit our website you'll find daily\nAnd we haven't got much more they are the things that are working\nProgramming on Ninety One point five kill your cc is supported by the Colorado Springs fine arts center at Colorado College presenting Shakespeare in love a comedic Rob filled with adventure Elizabethan England September twenty seven through October twenty first tickets at Colorado College dot edu slash face the\nLeague of women voters review the measures on Colorado's November sixth ballot and present the pros and cons of each question public is invited to the meeting October\nWeekly program you guys are the things that are working\nProgramming on Ninety One point five kill your cc is supported by the Colorado Springs fine arts center at Colorado College presenting Shakespeare in love a comedic romp filled with adventure Elizabethan England September twenty seventh through October twenty first tickets at Colorado College dot edu slash yet but he's the\nLeague of women voters will view the measures on Colorado's November sixth ballot and present the pros and cons of this question public has invited who's reading October six rock from the library or information on the community calendar Lincoln ...\nSupport for NPR comes from the station and from the main office of tourism offering travel there is an opportunity to explore and discover their very own main thing to be inspired be original and be yourself and visit main God come\nFrom T I Am a tea I Am a is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at C. I. A. dot org\nAnd from dream wave maker of luxury massage chairs from Japan with ... point detection and sixteen program to massages including morning night and stretch sessions retailers nationwide more a dream wave shared dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep if you had any doubt that the flu is a serious disease consider this last winter some eighty thousand people died from the flu and its complications\nYet fewer than half of Americans get vaccinated each year and NPR's Allison Aubrey found a place where vaccination rates are often lower college campuses\nIt's no surprise when young adults think they're invincible and when it comes to the flu shot survey data backs this up I talked to students at George Washington university you guys have had the flu shot\nThat are not yet not addressing other athletes have gone in a\nSurvey data shows one of the top reasons young adults opt out they say they're healthy they don't think they'll get the flu jak roast end at Iraq to saying they've heard this\nYeah I think that's definitely think people really don't get it 'cause I don't see a need for it so they're like oh I haven't gone on before so I don't need to get the flu shot another\nObstacle getting a flu shot can be a hassle miles\nSurvey data backs this up I talked to students at George Washington university\nYou guys have you've had the flu shot this year and not yet I just wish I had gone to know\nSurvey data shows one of the top reasons young adults opt out they say they're healthy they don't think they'll get the flu jak gross and ... say they've heard\nThis yeah I think people really don't get it because I don't see a need for it or what are we going before so I don't want me to get the flu shot another\nObstacle getting the flu shot can be a hassle miles ... and Christian joins say it's just not top of mind\nLike if your class and work here do unto you know I feel like flu shots not very harmless priorities yeah something of a huge portion other day and trying to get it\nThese students say they plan to get a flu shot if they haven't already and one factor that may motivate them as last winter death toll with eighty thousand flu related deaths it was the highest death toll and more than forty years and hundreds of thousands of people were hospitalized\nWilliam Schaffner is medical director at the national foundation for infectious diseases\nWill it wasn't an extraordinary season and we had a very vicious virus the so called H three and two influenza strain\nSchaffner says it's too soon to say if this will be severe flu season but he says that's no reason to wait to get vaccinated Schaffner says it's true that people sixty five and older are at higher risk but he says young adults are vulnerable to\nThe flu can even on occasion take a young healthy person to put them in the intensive care unit in forty eight hours we can't pick you out in advance so let's all get protected\nOn the George Washington campus that student health center is going all out to get students vaccinated Isabel golden bird gets the medical director she's organized to pop up clinics in students' favorite hangout spot we don't wait for them to come to us today she's giving shots in the library Peter opened a freshman walk then\nAre definitely not a big fan of noodles but you know sickness can spread really fast on campus and I just wanted to prevent myself from getting sick and from anyone else with him or her own\nTheatre whatever you want to write to let the famous short I promise one two three hours\nAfter such a bad flu season last year many people know the vaccine is not a hundred percent effective but what many people don't realize is if you get the flu shot and still end up catching\nShe's getting shots in the library Peter open the freshman walks in\nA definitely I'm not a big fan of noodles but you know these are just can spread really fast on campus and I just wanted to prevent myself from getting sick and from anyone else with him or her own\nTheater what do you want the right to left the famous shot from this one two three hours\nAfter such a bad flu season last year many people know the vaccine is not a hundred percent effective but what many people don't realize is if you get the flu shot and still end up catching the virus your sickness is likely to be significantly less severe student max ... says he'll\nTake some protection over no protection I've had the flu which was horrible and so after that experience but\nI don't see a reason why even riskier without getting back to the Web says he thinks one way to motivate young people to get the flu shot it would be a social media campaign where people share their flu stories I asked him what he calls the camp\nThey moved to the flu I don't know if\nYou came up with that now I I like I said it's got a good ring and maybe it's a reminder to get that shot\nBefore Halloween Allison Aubrey NPR News okay if you're looking for a\nCheaper health insurance then you can currently find on the individual market a whole host of new options will become available starting tomorrow this is due to a change the Trump Administration is making to insurance regulations but buyer beware with lower prices come fewer benefits Here's NPR's Alison Kodjak\nThey're known as short term limited to ration health plans and the idea is to give people who think Affordable Care act policies are too expensive or don't think they're worth it a different option\nThese are a niche product always have been\nThat's Doug ... a visiting fellow at the conservative Heritage Foundation in Washington\nIt's simply another choice for consumers that for many ah is more affordable than the other products with them on the individual marketplace\nShort term health insurance isn't new it's there for many years that stopgap coverage for people who are say between jobs are just out of college but during the Obama administration the plans were limited to just Ninety Days\nNow the Trump Administration is expanding access so that people who don't want to pay for insurance that meets Affordable Care act standards or who don't qualify for subsidies can find coverage [noise]\nMore than ... eighty percent of people who buy insurance on the a C a exchanges get subsidies to help pay for it but there's no government help for short term plans the new rules\nWith them on the individual marketplace short term health insurance isn't new it's there for many years is stopgap coverage for people who are say between jobs are just out of college but they're Obama administration the plans were limited to just Ninety Days\nNow the Trump Administration is expanding access so that people who don't want to pay for insurance that meets Affordable Care act standards or who don't qualify for subsidies confined coverage\nMore than eighty percent of people who buy insurance on the a C a exchanges get subsidies to help pay for it but there's no government help for short term plans\nThe new rules allow people to buy a policy that last year and they can renew two times which badger says is a good option\nInstead of remaining uninsured to have a product that makes sense for them\nBut Alison Hofmann with the University of Pennsylvania law school says this insurance may have a role but it comes with a risk people who think\nThat they're healthy they're unlikely to need to use much medical care they may still want a backstop they may want something and they made by these plans thinking that they're going to get them what they want and for some people that could be true and for others when they actually go to use medical care or if they get sick or if they're in an accident they'll find that they don't really have very much health insurance coverage\nThat's because the short term policies don't have to meet the Affordable CARE Act rules they don't have to cover people with ongoing health problems and usually cover fewer services than required under the CIA\nPolicies may cost as little as Seventy five dollars a month but they often carry big deductibles more than ten thousand dollars on some and they may not cover things like prescriptions or mental health care and generally they only pay about half of any medical bill after that deductible has met\nSo people have something called health insurance um but it doesn't necessarily pay for all of their health needs\nThese policies are regulated at the state level and some states have banned them altogether so your options will look different depending on where you live\nIn the new rules say insurance companies have to be very clear about what the policies cover and what they leave out the government estimates about six hundred thousand people may buy short term insurance next year and after five years that market could grow to about one point two million people\nAlison Kodjak NPR News\nSupport for your health comes from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home\nSix hundred thousand people may buy short term insurance next year and after five years that market could grow to about one point two million people\nAllison Kojak NPR NATO\nSupport for your health comes from exact scientists offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home\nEqual rights civil rights full rights that are equal to those of any Jewish Israelis citizen and what form of that tank\nWell they would have those rights in their own territory in other words they have their own parliament they have their own government to have their own flag they have their own\nWell they have any of them back now but they have very very little writes compared to the average Israeli I Would think\nWell if you go we don't govern the Palestinians that we don't administer Ramallah origin in or not loose governed by the Palestinians but you can extend that governance but not to the point where you would ah endanger ISIL\nNeither this is a very odd or with the Palestinians are actually demanding something that would collapse their own authority and their own government but it's not the first time but they do so so I think we have to be realistic as long as the you know we have the middle east and reformed and\nPockmarked with so much violence so much radicalism so much terrorism this is the best of angel we could we could have a lot and\nYou you believe in any circumstance that Israel should be able not only that security control but to arrest people to bring them into Israeli courts you want that to stay with Israel\n[noise] uh yes I Want to have that overriding power and I'll tell you why you don't see this is an interesting question\nHow come you don't see that much terrorism in a in the west bank well first of all we have security cooperation with the Palestinian authority that's good\nUm we don't have it with Hamas in Gaza but the bulk of the\nSecurity operation was a it was done by us but here's how it's done we have say intelligence about of them are terrorists in um one of the Palestinian towns\nAnd we would call up typically the Palestinian security authorities and say why don't you take care of it 'cause I don't want to send our soldiers there if we don't have to why should we\nAnd that was back well first of all we have security cooperation with the Palestinian authority that is good um we don't have it with Hamas in Gaza but the bulk of the\nSecurity operation was a it was done by off but here's how it's done we have say intelligence about I'm a terrorist so in a one of the Palestinian towns\nAnd we would call up typically the Palestinian security authorities and say why don't you take care of it because I don't want to send our soldiers there if we don't have to why should we you know and often we have to do because because we're willing to take the risk within attack as we weren't at\nThe un by President Abbas so they want us to take care of their security but they also you know attack us\nInternationally final thing prime minister because I Know your time is very ... I Hope you got the irony of what I said I understand I Do final thing you have been very closely aligned with President Trump that has carried certain great benefits for you\nIs there also a risk in being so closely aligned with such a polarizing president because he would rather as Israel historically has has bipartisan support in the United states\nIsrael values is bipartisan support in Israel is had a bipartisan support in I Believe will have a ... in in the future it's a very powerful bond\nThere there's no risk with being so close to Trump\nWell I think that uh you know you've seen that we could have agreements and disagreements with ministers was for example we had a you know it's no secret of added\nDisagree with President Obama on Iran but at the same time\nWe signed an animal you are in the animal you are the memorandum of understanding guaranteed Israel a very important American security assistance for the coming decade and and I appreciate that uh so we can have disagreements and you have a basic agreement about the importance of our lives\nPrime minister Netanyahu it's always a pleasure talking with you thank you very much\nFactors do good to talk to in\nIsrael Benjamin Netanyahu we also invited Palestinian leader Mahmoud Abbas to join us and that invitation remains open It's MORNING EDITION from NPR News\nI'm my name is Benjamin chairman president and owner of monument occupational medicine and money was Colorado target audience are owners of companies each are professionals managers and injured workers\nThemselves medical care that they need to get back to where you can see the help is quite a bit team a lot of\nVery much for your good to talk to\nIsrael's Benjamin Netanyahu we also invited Palestinian leader Mahmoud Abbas and joined us that invitation remains open It's MORNING EDITION from NPR News\nI'm my name is ... president and owner of monument occupational medicine in monument Colorado targeted audience are owners of companies HR professionals safety managers and\nInjured workers the tone of the medical care that they need to get back to work really cares he's he's helped us quite a bit and we are able to obtain a lot of access to individuals we normally wouldn't have access to through other means of advertising\nYou would like to become an underwriter like me please call genetic seven one nine four seven three for eight zero one\nWill use the congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative trends among the states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where at next time on one day from W. A. M. U. and NPR\nOne a day at ... am\nOn Ninety One point five to your cc southern Colorado's NPR station\nSupport for Ninety One point five K. R. D. C. comes from our listeners and from local organizations who wanted to reach a discerning audience that values quality\nMarketing on Ninety One point five K. R. D. C. underwriters reached the people most likely to shop in their business support their nonprofit and buy tickets there has to learn more about corporate important culture now seven one nine four seven three for a year oh why oh\nNPR on Ninety One point five K. or CC's supported locally programming on Ninety One point five K. R. C. C. is supported\nBy planet granite remodeling southern Colorado was kitchens bathrooms in bars for Twenty years marble courtside and more on display in the show room at thirty twenty north stone\nMore information at planet granted dot US\nMm [noise]\nHe was on the other day and age that chatting without backing out in hobbies at the top of the show you that time to add kids go Maria sitting in the audience a big\nTo say have\nRooms in bars for Twenty years marble courtside and more on display in the show room at thirty twenty north stone more information at planet granted dot US\nMm [noise]\nYou're learning I'm Rachel Martin Michael ... he was a contestant on Jeopardy the other day and chatting with allergies are backing him out of his hobbies at the top of the show you that time to ask is going and Maria sitting in the audience a big\nFor me I have a commercial break\nMurray then answered again this time in the form of the question what is yeah It's MORNING edition\nSupport for NPR comes from the station and from the alliance for a lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Trader Joe's offering new products in every store and new episodes of the original pod cast series inside Trader Joe's\nAt apple pod cast or where pod cast are available more at Trader Joe's dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin voters in Iraq's three Kurdish region's went to the polls yesterday to elect a new regional parliament\nThis part of Iraq has been semi autonomous since the U.S led a no fly zone there in the Nineteen nineties to protect the Kurds from former Iraqi President Saddam Hussein and posting arrived joins us now from the Kurdish city of ...\nGene I understand there are no official results yet but any indication as to what a new Kurdish parliament could look like\nWell for the most part Rachel it's gonna be the status quo you know there are two main parties here that have existed for decades and they will continue their control but the interesting thing is their opposition parties including one that didn't even exist in the last elections five years ago it seemed that young people\nAnd it looks like that party at least will do well here's an election observer named ... from the opposition ... party and older party explaining why he thought voters were rejecting those traditional parties\nThe democracy not just one of the way you have to be\nImplemented in reality but unfortunately for using democracy is to make these ...\nInside of the most so much\nOpposition parties including one that didn't even exist in the last elections five years ago it's aimed at young people and it looks like that party at least will do well here's an election observer named ... from the opposition ... party and older party explaining why he thought voters were rejecting those traditional parties\nWith most of the fun of people you have to be\nImplemented in reality but fortunately for using the walkers and make it the ... and\nInside the multi almost lost\nAnd by then he means that he and a lot of voters I talked to frankly are frustrated over the lack of opportunity the fact that the party's control of the jobs lack of freedom for people not connected with those big parties\nSo what does that mean do people was turn out good as a result of this frustration you were at polling stations right\nYeah that was a really interesting thing because we went early in the morning and we stayed and we did not see a lot of people but the results that they're citing are actually pretty high I'm One of the big fears has always been fears of fraud there were allegations of widespread fraud in federal elections here in may\nIn fact one of the party headquarters was attacked after\nSo one of the biggest parties the u._k. immediately said it was rejecting all the results but then they rescinded that\nSo here's one of the problems media were only allowed in the very few polling stations we got in one one of the approved polling stations and\nWe were able to watch them start to count some of the ballots so there is an election officials taking out each paper ballots [noise] because they decided not to do the automated ballot counting because I think that leads to fraud\nAnd he's reading of the names of each party's very laborious process so even a disapproved polling station which you'd think would be like supers clean or people trying to get in with fake IDs huh but really the question is whether the violations or serious enough to put the results in question\nRight so I mean we've heard for generations of how the Kurds have been wanting their own state right so there's an ... an innate tension between\nThe Kurdish regional government and the central government in Baghdad so what how how could the new government in essentially Kurdistan affects the the relationship with Baghdad\nAbsolutely you've hit the nail on the head because they had a referendum last year saying do you want independence and the vast majority of Kurds said yes\nViolations or serious enough to put the result in question right\nSo I mean we've heard for generations uh how the Kurds have been wanting their own state right so there is an ... an innate tension between\nThe Kurdish regional government and the central government in Baghdad so what uh how how could the new government in essentially Kurdistan affect the the relationship with Baghdad\nAbsolutely you've hit the nail on the head because they had a referendum last year saying do you want independence and the vast majority of Kurds said yes so the U.S says of course that it warned them not to hold this and there were serious repercussions after that\n... and her longtime producer Kenny Laguna the documentary is called\nJones yet and her longtime producer Kenny look up the documentary is called bad reputation It's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep [noise]\n[noise]\nWe use the congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative trends among the states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where it next time on one day from W. A. anew and NPR\nJoin a poor one age It's MORNING at nine o'clock\nThis is a southern Colorado was NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. hunter key CCS stark ... W CCF than woodland park dreaming at K. R. C. C. dot O. R. G.\nGood morning it is Monday October first I'm Abigail back then\nIt looks like there's a chance for rain today over the mountains and in the mountain valleys slight possibility of showers over the planes as well heights will be mostly in the sixties and seventies today\nThe news is coming up next it's six o'clock ...\nGood morning Canada has joined Mexico and the United states in an updated version of now done other different from the free trade agreement president It's MORNING EDITION from NPR News\nComing out the aftermath of ... and I'm Rachel Martin and I'm Steve Inskeep our colleague Julie McCarthy is on the Indonesian island struck by massive away an\nPeople in Uganda have found a subtle way to show their distaste for their autocratic or\nCalifornia to impose\nNeutrality ordering Internet providers customers equal or hours later the Justice Department gets over first birthday of a model\nOne hundred ten years ago and now you know where you're rewarded reduces\nAs long as it was black you're gonna\n\nLive from NPR News in Washington on corporate Coleman Indonesia will accept international aid after last week's earthquake and tsunami on the island of ... the disaster officials say at least eight hundred forty four people have been killed and expect the death toll to rise and beer is Julie McCarthy is on\nLater the Justice Department it's hardly October first birthday model\nOne hundred ten years ago and now you know we boarded loses\nAs long as it was black you're gonna\nLive from NPR News in Washington on core of the Coleman Indonesia will accept international aid after last week's earthquake and tsunami on the island of ... Lewinsky disaster officials say at least eight hundred forty four people have been killed and expect the death toll to Ryan's NPR's Julie McCarthy is on ...\nThe international aid organization world division says potable water is a huge need because a water pipe line broke in the city of poodle up population three hundred and thirty five thousand many locals have built makeshift shelters in the hills\nCiting the ears of another sue nominee anxious families gather at airports in the hopes up hitching a ride on military transports to learn the fate of their loved ones shortages of food and gasoline have touched off looting\nChaotic scene at the airport in pool up as quake victims rushed a military aid transport prompted the government to suspend flights today and the army has been deployed to restore order Julie McCarthy NPR News on the island of ...\nJust hours before a deadline Sunday night Canadian and American negotiators struck a deal on a new free trade agreement for North America and carpet check reports it's being described as a win for the U.S Canada and Mexico it's now the\nUs MCA the United states and Mexico Canada agreement replacing be old enough to at its heart the deal trades off more U.S access to Canada's dairy sector for Canadian demands that an independent dispute resolution process remains intact\nCandidate always insisted that without that there would be no deal President Trump is also given Canada tariffs exemption on auto imports to the U.S but it's still not clear what will happen to the tariffs on Canada's steel and aluminum\nThe deal is still subject to review by Congress an approval by the federal cabinet in auto walk a U.S official says the leaders of the three countries are expected to sign the agreement at the end of November for NPR News I'm Dan Carpenter in\nThe U.S Supreme Court opens a new term today well across the street at the U.S Capitol the battle over Brett Kavanaugh's nomination rages on NPR's\nNina Totenberg says that while the FBI is conducting interviews the justice is will be on the bench although the Supreme Court has already accepted forty four new cases for the term the subject\nSteel and aluminum the deal is still subject to a review by Congress an approval by the federal cabinet in order to walk a U.S official says the leaders of the three countries are expected to sign the agreement at the end of November for NPR News I'm done carpenter in Toronto\nThe U.S Supreme Court opens a new term today well across the street at the U.S Capitol the battle over Brett Kavanaugh's nomination rages on NPR's Nina Totenberg says that while the FBI is conducting interviews the justice is will be on the bench although the Supreme\nCourt has already accepted forty four new cases for the term the subject matter is pretty esoteric except for lawyers covering everything from the endangered species act to whether it's cruel and unusual punishment to execute a convicted murderer who's dementia is so severe that he can no longer remember his crime\nNPR's Nina Totenberg the Nobel Committee is awarded this year's prize in physiology or medicine to American genes pie Allison ... of Japan they're being honored jointly for discoveries that led to work using the body's immune system in a way to slow or stop the development of cancer\nResearch has led to major advances in cancer therapy drugs\nYou're listening to NPR\nOfficials in Allentown, Pennsylvania are trying to learn what triggered an enormous car explosion downtown on Saturday Night\nThree meals were killed and police say the blast was part of a criminal incident it's believed to be an isolated event with no ongoing public threat authorities have not said what caused the explosion\nIn Macedonia voters have overwhelmingly approved a weekend referendum on changing the name of their country to North Macedonia as you went accuses reports from scope yet Macedonia voter turnout was low\n[noise] those who oppose the name change or cheering only about ... percent of registered voters turned out retired lawyer Vladimir called the dark hole says this shows there's not much support for the name change\nAnd do a whole lot [noise]\nBut those who did go to the polls voted overwhelmingly for the name change which is tied to Macedonia is entry into NATO and the European Union its neighbor Greece has long block that entry because it claimed to the name Macedonia is Greek both countries that used to be part of the ancient kingdom of Macedonia\nBy Alexander the great for NPR News I'm Joanna Kakissis\n... says this shows there's not much support for the name change\nTo do a ... you know the blood [noise]\nBut those who did go to the polls voted overwhelmingly for the name change which is tied to Macedonia is entry into NATO and the European Union its neighbor Greece has long blocked that entry because it claimed to the name Macedonia is Greek\nBoth countries that used to be part of the ancient kingdom of Macedonia led by Alexander the great\nFor NPR News I'm Joanna Kakissis in scope yeah Macedonia\nReports in South Korea say that north and South Korea have started to remove some landmines from their heavily guarded mutual border the ... news agency says this stems from the most recent summit between these countries to leaders they agreed to halt\nHall hostile acts against each other countries [noise] I'm ... NPR News\nSupport for NPR comments from NPR stations or their contributors include the law firm Cooley O L P with officers and the U.S Europe and China cooling advisors entrepreneur as investors financial institutions ... companies around the world where innovation meets the law\n[noise]\n[noise] Hi I'm ... membership manager here in Ninety One point five years on behalf of all of us are decision I think you support all members would not do the surgery [noise]\nGood morning ... is six oh six and ... and you're listening to MORNING EDITION on Ninety One point five K. R. C. C.\nComing up does the neighborhood you grow up in determine how far you move up the economic ladder a new online data tool finds a strong correlation between where people are raised\nAnd their chances of achieving the American dream stay with us for that story coming up in Fifteen minutes as MORNING EDITION continue\nIn woodland park it is fifty four degree the high today of sixty eight with a very likely chance of afternoon thunder storms in Pueblo fifty degrees right now will be partly sunny today at high of Seventy six\nAnd in Colorado Springs we have forty six degrees looks like we'll have mostly cloudy skies today slight chance of afternoon thunder storms and a high of Seventy three degrees [noise]\nIn woodland park it is fifty four degrees a high today I'm sixty eight with a very likely chance of afternoon thunder storms in Pueblo fifty degrees right now will be partly sunny today at high of Seventy six\nAnd in Colorado Springs we have forty six degrees looks like we'll have mostly cloudy skies today slight chance of afternoon thunder storms and a high of Seventy three degrees [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin good morning after weeks of intense negotiations Canada has joined the new NAFTA the U.S and Mexico broker changes to the trade deal back in August and the Trump Administration gave Canada until midnight to agree to the deal\nThe White House says it's a win for the Trump playbook on trade forcing even America's closest allies to reexamine trade agreements to win better terms for us workers\nWhether or not Congress will agree and ratified the deal is another matter Christoph von ... is on the line to talk to us about what we know so far he was Canada senior counsel in the trade deal Canada signed with you last year thanks so much for being with us\nThanks God to be here last night prime minister Justin Trudeau spoke briefly to reporters after a late night cabinet meeting this is what he said\nWhat\nA good day for Canada Trudeau said is it do you agree\nYes I think so I mean in the first place it removes a great deal of uncertainty that's been floating over the NAFTA which is a fundamental trade agreement for the U.S Canada and Mexico are floating over that agreement for the last two years\nAnd based upon early reports of what's been agreed ah Canada got it pretty much what it was looking for in terms of his update\nThis is NPR News\nAnd the next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talked with Washington Post reporter Greg Miller who's broken several related stories and shared a Pulitzer Prize this year\nNow he has a new book called The Apprentice Trump Russia and the ... version of American democracy\nThis is NPR News\nOr the next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talked with Washington Post reporter Greg Miller who's broken several related stories and shared a Pulitzer Prize this year\nAnd now he has a new book called The Apprentice Trump Russia and the ... version of American democracy join us\nThat is today at noon hope you can join us for fresh air on southern Colorado's NPR station Ninety One point five K. R. C. C.\nComing up on MORNING edition and the number of people confirmed killed after friday's earthquake and tsunami in Indonesia rose dramatically yesterday to more than eight hundred thirty officials warn the number could ride into the thousand as rescuers reach more affected area\nAnd voters in Macedonia were asked whether the country's name should be changed to North Macedonia it appears voter turnout for the referendum fell short of what is required those stories both coming up with in the next ten minutes here on Ninety One point five K. R. C. C. [noise]\nIn West cliff aid is fifty five degrees and high today of Seventy two afternoon thunder storms are likely in Trinidad forty eight to hire a Seventy seven partly sunny skies\nAnd in Colorado Springs we have forty six degrees of high today of Seventy three she'll be mostly cloudy there's a slight chance for some afternoon thunder storms [noise]\nChances for precipitation continue into your Tuesday temperatures will be a little bit warmer tomorrow it is six Twenty one and you're listening to MORNING EDITION\nProgramming on Ninety One point five through your cc is supported by Colorado Ballard presenting the blood clots which Sleeping Beauty October fifth through the fourteen but the only Caulkins opera house with live music by the Colorado belly orchestra Colorado ballot dot org\nSupport for NPR comes from this version and from zoom zoom offers cloud video conferencing online meetings and a video conference rooms illusion and one platform featuring digital video and audio with ... account registration and more ... to us\nFrom tire wreck offering a tired\nLA presenting the ... classic Sleeping Beauty October fifth through the fourteenth the the L E Caulkins opera house with live music by the Colorado belly orchestra Colorado bally dot org\nSupport for NPR comes from this station ... zoom offers cloud video conferencing online meetings and a video conference room solution in one platform featuring digital video and audio with screen sharing account registration and more eggs zone dot to us\nFrom tire rack offering a tire decision guide to help customers find a tires that fit their car and driving conditions with a network of more than seven thousand independent installers tire racket dot com helping drivers find deliver install\nAn from Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin and we'd like to think America is the land of equal opportunity but that depends on exactly where in America you live it's often said that you can predict the future as as many kids by finding the ZIP Code where they grow up\nAnd online data to all being made public today let you see for yourself the link between where you are on the American dream Here's NPR's John Ydstie\nEconomists dries chatty has been worried about the fading American Dream for years he's crunched the numbers and they're troubling if you were born in the Nineteen forties or fifties he says you were virtually guaranteed to achieve the American dream of earning more than your parents did but you\nSee that for kids turning thirty today who were born in the mid Nineteen eighties only fifty percent of them go on to earn more than their parents to that is it's a coin flip as to whether you are now going to achieve the American dream\nShadi and his colleagues that opportunity insights a research and Policy Institute located at Harvard why to improve those thoughts so they've partnered with the U.S Census Bureau to develop an online program it works a lot like a Google Map\nYou can see the whole country or you can zoom in to local neighborhoods and you can click on a neighborhood and get an immense amount of data from incomes and racial makeup to marriage figures\nWe are able to pinpoint you know what are the places where we're seeing lots of kids climbing the income let our border of the places where the outcomes don't look as good and we put this\nThe insights a research and Policy Institute located at Harvard why to improve those odds so they've partnered with the U.S Census Bureau to develop an online program it works a lot like a Google Map\nYou can see the whole country or you can zoom in to local neighborhoods and you can click on a neighborhood and get an immense amount of data from incomes and racial makeup to marriage figures\nWe are able to pinpoint you know what are the places where we're seeing lots of kids climbing the income ladder of what are the places where the outcomes\nDon't look as good and we put this all out in the form of a publicly available interactive tool called the opportunity outlets that we hope citizens local policymakers nonprofits people working on these issues can use to make better decisions\nChatty founded moving out of a neighborhood with poor upward mobility to a better one increases lifetime earnings for low income kids by an average of two hundred thousand dollars of course moving a lot of people these impractical so the focus is on helping low performing areas improve\nCharlotte North Carolina has gotten a head start on this effort back in twenty fourteen shed he and his colleagues found Charlotte was dead last out of fifty cities at providing upward mobility for low income kids that shocked many residents\nIf you knew anything about Charlotte Charlotte wants to be number one\nOphelia ... brown a prominent Charlotte physician says that ranking ran counter to Charlotte image of itself as a thriving banking center with an expanding high tech sector and a city that's been a leader in job creation and wage growth over the past two decades\nOutlast sent surprised that we had done poorly I've been a physician for a lot of years work with people who live in poverty so\nI saw what she saw was a segregated city where a low income black residents especially faced a little chance of moving up the economic ladder\nCarmen brown joined an effort by the foundation for the Carolinas to address the problem\nThe group identified early childhood development college and career readiness families stability and strong social networks as key factors that enhance upward mobility it singled out segregation as a key obstacle\nAnd now Charlotte officials are learning to use the opportunity atlas to effectively targets some remedies things like pre K programs and affordable housing so I had up here right now it's just kind of uh\nMick ladder Carmen brown joined an effort by the foundation for the Carolinas to address the problem\nThe group identified early childhood development college and career readiness families stability and strong social networks as key factors that enhanced upward mobility it singled out segregation as a key obstacle\nAnd now Charlotte officials are learning to use the opportunity at less to effectively target some remedies things like pre K programs and affordable housing\nSo I have that here right now it's just kind of care math median income in Charlotte said\nA lot of Williams from the chat each team is demonstrating the opportunity outlets for a group that includes the local officials she's zooms into Charlotte in clicks on neighborhoods if the area is reddish brown it signals low levels of upward mobility if it's green or blue it has higher opportunity\nFor the outcomes for children who grew up in different tracks in Charlotte Frank\nBarnes is the chief equity officer for Charlotte Mecklenburg schools he says the tool has already exceeded his expectations I think the key thing that has happened is\nThe fathers for the Carolinas brought a lot of partners to the table to think about how to act on these data and I think that's the power it's in the community collaboration in the community partnership\nCharlotte's effort to improve upward mobility is already taking shape at ... field middle school it's located in a majority white neighborhood not far from downtown Charlotte but it's just in principle Eric ... says the schools students are mostly black\nAnd Hispanic so we got forty eight point nine percent are Hispanic forty four point five percent are African American four percent are white it's not unusual\nFor a public school in Charlotte to have a student body this largely minority that's because many white students attend private schools or public schools outside their neighborhoods that segregation hinders upward mobility\nJames e for the former North Carolina teacher of the year is working with such fields administration to make the school more racially balanced\nFor now an education consultant says to local elementary schools have already emerged for that reason\nEventually something similar is going to pay the demographics you're going to shift quite a bit this majority black and brown now\nBut when in the coming years it changes it started to look more like the neighborhood\nThere's another challenge here beyond segregation it's the lack of social networks minority children need to succeed the ...\nThe teacher of the year is working with such fields administration to make the school more racially balanced for now in an education consultant says to local elementary schools have already emerged for that reason\nEventually something similar is going to pay the demographics you're going to shift quite a bit this majority black and brown now\nIn the coming years at a change that started to look more like the neighborhood\nBut there's another challenge here beyond segregation it's the lack of social networks minority children need to succeed\nThis hedge field neighborhood is more affluent than a nearby majority black neighborhood called south side park but the opportunity outlets shows African American boys growing up and said field in the Nineteen eighties and nineties are now doing worse than their counterparts from South side park\nFord says that might surprise some people\nWe may soon because the areas of flu like that's a high opportunity area when the truth is that may not be a high opportunity area according to the metrics that we're looking at\nIn this case it may be that the majority black neighborhood of south side park offers young black man the social networks friends extended family churches that help them get ahead those kinds of networks might not be accessible to them in a majority white neighborhood\nFord says the opportunity at least should help reduce misconceptions about economic mobility\nThis permits us making really smart really intentional decisions so that twenty Thirty years not allowed to look and say it was the right call\nCharlotte is already taking significant steps in that direction Mecklenburg county which encompasses Charlotte has committed to providing pre K for all children the city of Charlotte has a fifty million dollar bond issue for affordable housing on November ballot\nRoss chatty says he hopes the opportunity at less will help communities across the country revive the American dream in their local neighborhoods\nIs oh so do you know I Know that we don't like [noise]\nHow dark hop has joined dozens camping out for months next to a statue of the Greek got fired for me the U.S they boycotted Sundays name change referendum despite pressure from European and even American leader\nWe like going to be on the bus and why don't we don't\nFeel like his life can be a NATO in Europe boycotting\nSo do you like [noise]\nHow about ... his joined dozens camping out for months next to a statue of the Greek got fired for me the U.S they boycotted Sundays name change referendum despite pressure from European and even American leader\nWe like to go and you don't really need to repair it up and nobody knew what don't we don't\nFeel like you love your chance to be in NATO in the European Union boycotting\nThe argument that if they don't know if we can if I were to do a ...\nOut on your age or Russia or China India you don't see myself with all of them big name [noise]\nAnd he claims most Macedonia and support his views since only about thirty seven percent of voters even bother casting\nMacedonian prime ministers or and die of offered a different view his supporters cheered when he arrived in the ballroom of a luxury hotel to declare victory pointed out Ninety percent of those who cast ballots support the name change his government worked out with three [noise]\nLearn was easier I Know the political opposition and the citizens now that there cannot be any better agreement there cannot be any alternative Macedonia membership in NATO you [noise]\nOthers also have hope political analyst ... called ... watches a group of boys play soccer outside his office he says he still expects Macedonia and politicians to back the deal\nIt's going to be more difficult than expected but it's still going to happen\nHe says Macedonia and politicians want strong ties with the west and the west wants to protect Macedonia from the Kremlin\nRussia does not have no clear course here in foreign policy beautiful but they have football as CEO of destruction they want to be up to the political dynamics of the political ...\nRussian meddling was blamed for the referendum low turnout but a but elevated who runs the Macedonia\nOffice of the Germans think tank also senses fatigue with the EU which sometimes send some mixed signals on membership for Balkan countries\nThere were many people just\nTired and frustrated with the past disappointments and just not believing in the process anymore\nTania ... ski a forty year old\nWe're hearing for enforcers beautiful but they have football as fuel destruction they want to put up to the political dynamics of the political but for the\nRussian meddling was blamed for the referendum low turnout but a but elevated who runs the Macedonia\nOffice of a German think tank also census fatigue with the EU which sometimes send some mixed signals on membership for Balkan countries\nThere were many people just\nTired and frustrated with the past disappointments and just not believing in the process anymore\nTania ... forty year old nurse is still a believer she voted yes in the name change our precinct for school named after ... Tito the former leader of Yugoslavia\nMaybe you can help Macedonia develop its economy she says people can make more than four hundred dollars a month the average wage here I'm angry with ... with you and I don't care so much about a name she says oh my name is Milan young but I don't want to be a turning him without money for prospects\nFor NPR News I'm Joanna Kakissis in scope yes Macedonia\nToday we're also remembering the dozens of people who've died one year ago at an outdoor concert in Las Vegas [noise] later on all things considered one of the survivors talks about using her own harrowing experiences to start a support group to listen to that story by asking your smart speaker to play NPR or you can ask for your local member station ...\nIn that local member station is Ninety One pointed biases and hey are cc\nAll pikes peak reads presents together at the table community meal and discussions celebrating the ... of this year's old pikes peak read selections the bad happens\nOctober several library more information on the community on the link here you see that or gee\nThe national sexual assault hotline sees the two hundred percent increase and called the FBI recognizes sexual assault at the second most violent crime the first violent crime as murder as a nation reckon with accusations of sexual assault many victims are reporting their own abused for the\nFirst time I'm ... and that's next time on the take away from WNYC NPR I [noise] you can catch the take\nAway this morning at eleven o'clock on southern Colorado was NPR station Ninety One point five K. R. C. C. but first coming up in about ten minutes on the marketplace morning report the usa and Canada announced a new NAFTA deal\nThe nation reckon with accusations of sexual assault many victims are reporting their own abused for the first time I'm ... and that's next time on the take away from WNYC NPR odd [noise] you can catch the take\nAway this morning at eleven o'clock on southern Colorado with NPR station Ninety One point five K. R. C. C.\nBut first coming up in about ten minutes on the marketplace morning report the usa and Canada announced a new NAFTA deal last night the new deal called the United states Mexico Canada agreement was finalized before the midnight deadline that plus all the morning's business news coming up at\nSix fifty one on the marketplace morning report [noise]\nInto light it's fifty nine degrees a high today of Seventy one it was like it will be mostly cloudy and there is a slight chance for some thunderstorms this afternoon in the hunt a forty nine degrees will be partly sunny today a high of Seventy eight and in Colorado Springs that is forty six degrees a high of Seventy three\nMostly cloudy skies expected and we do have a slight chance for some afternoon thunder storms\nLooks like those chances for precipitation are a little bit better across the region tomorrow for your Tuesday temperatures will be a little bit warmer we're looking for high today\nMostly in the sixties and seventies a few eighties expected tomorrow\nIt is six forty five and this is Ninety One point five K. R. C. C.\nSupport for Ninety One point five K. R. D. C. comes from local organizations who want to reach a well connected audience than discerning about news culture\nAnd how they spend their money [noise] becoming a corporate sponsor of Ninety One point five scares the means your brand will stand out from the crowd\nFor more information about underwriting called Jeanette at seven one nine four seven three for a while\n\n\nSupport for NPR comes from the station and from the any each case the foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at a E. C. F. dot org [noise]\nAnd from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is\n\nSupport for NPR comes from this station and from the ... e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org\nAnd from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is available online at Carnegie dot org\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin this year's Nobel Prize for physiology or medicine will be given to two scientists who's discoveries have led to a revolution in cancer treatment\nThan around the family have either to warn the uh two thousand a Nobel Prize if you lose your medicine jointly to James this home how who home jump\nThese two scientists invented a new kind of cancer treatment called immune checkpoint inhibitors with us in the studio to tell us more NPR science correspondent Richard Harris Corning Richard good morning so who are these two winters\nWell the price of being shared of course by James Allison he's a Seventy year old biologist who's now with the NBA Anderson Cancer center in Houston and by ... at Kyoto University in Japan he's Seventy six now you know how some years a Nobel Prize comes it's a complete surprise ... not this year these names are on just about everybody shortly\nOK so not such a big shock of but what exactly did these two scientists do\nWell I'll start with Jim Allison and back in the Nineteen nineties who was working at UC Berkeley and he was studying the immune system that's the system that keeps us healthy by attacking threats like bacteria viruses and even cancer so I came across a part of the immune system that actually holds the system and check sort of think of them is the brakes on the immune system\nAnd it occurred to him that if he could release the brakes may be the immune system would be more effective in attacking cancer and that indeed turned out to be the case his observations led to infect what's been called the revolution in cancer treatment\nIt would lead to a whole new class of drugs called checkpoint inhibitors you may have heard now that we've talked about them a fair amount on our airplanes and today they're used in melanoma lung cancer a whole bunch of other cancers in the list is growing and growing and growing\nOkay so that's Jim Allison the other scientists who is winning that's word taught school how do you have any you know that him\nOf them is the brakes on the immune system and it occurred to him that if he could release the brakes maybe the immune system would be more effective in attacking cancer and that indeed turned out to be the case his observations led to in fact what's been called the revolution and cancer treatment\nIt led to a whole new class of drugs called checkpoint inhibitors you may her now that we've talked about them a fair amount on our air and today they're used in melanoma lung cancer a whole bunch of other cancers and the list is growing and growing and growing\nOkay so that's Jim Alice and the other scientists who is winning that's the word ... how do you have any now that him\nA hundred or work independently of Jim Alison but he was also exploring the same biology molecules that put the brakes on the immune system response\nAnd he came across another set of molecules that do the same thing in his discovery he discovered these molecules called pd one and ... one of which have become prime targets for these checkpoint inhibitor drugs\nOne example one of these drugs that you may have heard about is a drug called ... true to nuts that goes on a attacks these things so it was a very similar line of reasoning and sort of biology but he found a different set of of of targets to attack and in some ways they're more effective target\nSo fascinating so how did these two independent but related discoveries ended up changing how ... how we think about cancer\nCare well before the scientists made their discoveries cancer treatment was focused not entirely but more or less on killing or removing cancer cells and tumors so that could be with chemotherapy or surgery or radiation\nAnd all these treatments are still used and in many cases are still very effective treatments but there are many instances in which they don't work and these new checkpoint inhibitors have opened up this entire new realm of cancer treatment they are particularly effective\nTo get way to get the body's own defenses to fight back more effectively and this whole world of him into therapy is no really the driving force behind drug development\nUs crude oil futures are up again this morning up slightly in Seventy three forty four barrel\nIn New York I'm David Brancaccio with the marketplace morning [noise]\nFrom eight PM American public media [noise]\nWe're used to congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative\nTrend among the states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where at next time on one day from W. A. anew and NPR\nToday at nine o'clock ... southern Colorado an NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs can't eat these Eli hunter Casey a stark fail in K W the C. F. hand woodland park streaming at K. R. C. C. dot O. R. G. looks like it should be a pretty nice\nThe states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where at [noise] next time on one day from WAMC you and then the [noise]\nToday at nine o'clock this is a southern Colorado NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ISI seen hunter\nKey CCS stark fill in the WTC FM woodland park streaming a K. R. C. C. dot O. R. G.\nLooks like it should be a pretty nice day out mostly cloudy across the region there is a chance for some ... to petition mostly over the mountains and in the mountain valleys although in isolated storm or two as possible for the planes\nNews headlines from NPR an scare cc are coming up next it is seven o'clock\nHe good morning we have the eyes moving forward with its investigation into sexual misconduct allegations against Brett Kavanaugh but Democrats the White House limiting\nComing up with western Delaware's Chris Coons one of the senators who pushed for an FBI pro I've Stevens\nAnd I'm Rachel Martin President Trump told the un last week he'd support a two state solution Israel and Palestinian we asked Israel's prime minister to respond with elections even heating up are you ready distorted fact\nFrom fiction in your social media and NPR's Allison Aubrey on why so\nFew college students get that\nAfter three Larson turning twenty nine [noise]\nUses X\nY from NPR News in Washington I'm corporate Coleman Canada and the United states have reached agreement for candidate to join a revamped North American free trade agreement talks have dragged on for weeks and beers or a Berliner explains what each side conceded\nBoth sides gave up some ground from positions that they were pretty entrenched on Canada said it's going to pry open it's dairy market which has been very protected up more to us farmers\nThe U.S backed away from this demand they wanted to get rid of these independent dispute resolution panels that deal with complaints about unfair trade administration didn't like them at all ... all over American sovereignty us gave gave up there\nJoining revamp North American free trade agreement talks have dragged on for weeks and beers or a Berliner explains what each side conceded\nBoth sides gave up some ground from positions that they were pretty infringed on Canada said it's going to pry open it's dairy market which has been very protected open it up more to us farmers\nThe U.S backed away from this demand they wanted to get rid of these independent dispute resolution panels and deal with complaints about unfair trade the administration didn't like them at all thought they stepped all over American sovereignty\nUs gave gave up there um and also significantly in the U.S agreed a rich and understand with Canada it's not going to go ahead and slap tariffs on autos imported from Canada President Trump and threatened that a bunch of times\nNPR's Uri Berliner today's the first anniversary of the Las Vegas mass shooting a gunman opened fire from hotels upper floor killing fifty eight people and wounding more than four hundred hunters NPR's body Allen reports the city is planning a day of reflection and we'll dim lights on the Las Vegas strip\nAt ... pm the same time that wealthy gambler Stephen Paddock began his shooting rampage the city's famous casino corridor will darken\nAs Markey's dams thousands of residents like lawyer Paulina ... will remember an act that is considered the deadliest mass shooting in modern American history she says the fast moving resilient city is bouncing back from the tragedy\nOr not or let this act of terrorism I think it is if this crazy ... stop our enjoyment of to say\nThat it didn't leave a note he wasn't connected to a terrorist group he had no mental health record a year later investigators say they remain bewildered about his motive Bobby Allyn NPR News\nThe Justice Department is suing the state of California Ryan levy of member station KCPW ... says the suit is over the state's new net neutrality rules signed into law by the governor over the weekend\nThe regulations prohibit Internet providers from blocking speeding up or slowing down Internet traffic and from charging more for faster service\nThey mirror Obama era rules that the Federal Communications commission voted to repeal last December within hours of the bill being signed into law the U.S Justice Department announced it would suit California over the new rules state senator Scott Wiener who wrote the bill says he's confident it will stand up to legal challenges\nWe ... the earthly then attorney general a strong supporter of it as a\nLeader says he hopes to work with other states too ...\nTraffic and from charging more for faster service\nThe mirror Obama era rule that the Federal Communications commission voted to repeal last December within hours of the bill being signed into law the U.S Justice Department announced it would sue California over the new rules state senator Scott Wiener who wrote the bill says he's confident it will stand up to legal challenges\nWe will then or attorney general strong supporter of\nLeader says he hopes to work with other states to strengthen neutrality laws for NPR News I'm Ryan leaving\nFlash flood watches are posted from the Arizona border with Mexico as far north as Idaho tropical storm Rosa approaches Baja California the storm is expected to break up but the rain will get into the U.S [noise] this is NPR\nIt's seven oh four I'm Abigail back with Ninety One point five K. R. C. C. news\nManagers springs is considering changes to an agreement approved over the summer for the rebuilding of the cog railroad\nBecause that reports potential changes to the contract include the removal of a cap on the excise tax the broad more would pay to the city as well as an additional payment to manage two and twenty twenty details we will be discussed during a meeting at five thirty tomorrow evening at managed to city hall\nThe first pharmaceutical containing a can of history additive was recently approved by the federal government as Harvest Public media's Esther Honig reports the move could open the door for further research into the use of CBD or Canada dial\nThe drug EPA dialects which is used to treat epilepsy was approved by the FDA in June but because the drug contains a cannabis derivatives of the da ... sign off to\nIn doing so ever moved some CBD from the most restrictive category for drugs but it currently only applies to EPA dialects Chad ... is the director of the candidates research Institute at Colorado State university Pueblo he said this could have a major ripple affect\nAnybody the student research related to um kind of annoyed candidate was that was a significant to the\nCongress had been working to pass the two thousand Eighteen farm bill which may include legislation that legalize industrial hemp Esther Honig Harvest Public media you're listening\nTo Ninety One point five K. R. C. C. News I'm Abigail back then\n\nResearch Institute at Colorado State university Pueblo he said this could have a major ripple affect\nAnybody the student research related to um kind of annoyed and cannabis that was a significant of that\nCongress had been working to pass the two thousand Eighteen farm bill which may include legislation that legalize industrial hemp Esther Honig Harvest Public media\nYou are listening to Ninety One point five K. R. C. C. News I'm Abigail back then\nSupport for NPR comes from NPR stations other contributors include Baird providing global financial resources and market expertise to clients the world over our W bears dot com has more information and the Robert Wood Johnson Foundation at our W. J. F. dot org\n[noise]\nMaybe one point five ... has been southern Colorado's NPR station since Nineteen eighty four discover more ... dot org and follow us on Facebook and Twitter [noise]\nIt is six minutes after seven o'clock good morning I'm Abigail back men and you're listening to MORNING EDITION on southern Colorado NPR station Ninety One point five K. R. C. C. starting tomorrow many Americans will be able to buy short term limited to ration health insurance\nSimply another choice for consumers that for many is more affordable\nCritics caution however that with lower prices come fewer benefits that story is coming up in Fifteen minutes\nIn woodland park it's fifty five degrees a high of sixty eight with afternoon thunder storms likely\nIn Pueblo fifty one high of Seventy six partly sunny skies expected and in Colorado Springs it's forty six degrees looks like we'll have some afternoon thunder storms for Colorado Springs is well mostly cloudy today and a high of Seventy three [noise]\nProgramming on Ninety One point five tree or cc is supported by your optics the Colorado I wear a gallery in the promenade shops and writer David in Colorado Springs ended\nMetro Denver insurance Rick north Greenwood village at the Aspen grew\nMore at your optics dot net you're up to the order of objects\n\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep the pause in the Supreme Court confirmation of Brett Kavanaugh amounts to an opportunity it's ...\nProgramming on Ninety One point five K. R. C. C. is supported by your optics the Colorado I wear a gallery in the promenade Johnson writer gate in Colorado Springs and and metro Denver in cherry creek north\nGreenwood village and the Aspen grew\nMore at your optics dot net your optics the art of object\n\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep the pause in the Supreme Court confirmation of Brett Kavanaugh amounts to an opportunity it's an opportunity for the Senate to make its confirmation process seem more credible\nTo those who felt it was not the FBI is taking a week to examine allegations that the nominee committed sexual assault and other misconduct decades ago now comes the question of whether the investigation itself will be seen as credible\nThe FBI is acting at the direction of the White House where presidential counselor Kellyanne Conway insisted the White House is not restricting the investigation\nAt five ... said they failed last night that they show up at ... credible\nWe've called Senator Chris Coons of Delaware he as a member of the Senate Judiciary committee he worked with Republican Jeff Flake who is request for a delay on friday ensured that had happened to senator welcome to the program\nThing Steve great to be on with you how full does this investigation have to be to satisfy you\nAnd it's got to be well beyond the initial very narrow scope of four witnesses for individuals being interviewed\nThis is NPR News\nAnd the next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talked with Washington Post reporter Greg Miller who's broken several related stories and shared a Pulitzer Prize this year\nNow he has a new book called The Apprentice Trump Russia and the ... version of American democracy join us fresh air is today at\nNoon on Ninety One point five K. R. cc southern Colorado NPR station you're listening to MORNING EDITION the current time is seven twenty ... Batman still to come on the program Israeli prime minister\n... and the election and connections between the Trump campaign and Russia\nWe talked with Washington Post reporter Greg Miller who's broken several related stories and shared a Pulitzer Prize this year now he has a new book called The Apprentice Trump Russia and the ... version of American democracy join us [noise] fresh air is today at\nNoon on Ninety One point five K. R. cc southern Colorado's NPR station you're listening to MORNING EDITION the current time is seven twenty I'm Abigail Batman\nStill to come on the program Israeli prime minister Benjamin Netanyahu talks about the type of peace deal he'd like to have with the Palestinians\nWho are actual power for sure we'll do all the power struggle with a ... for\nMore on that in our conversation with Netanyahu coming up in ten minutes on Ninety One point five K. R. C. C.\nThere's a chance for thunderstorms across the region today high temperatures will be mostly in the sixties and seventies participation is in the forecast tomorrow to an temperatures will be a little bit warmer for your Tuesday [noise]\n[noise] Hi I'm ... membership manager here in Ninety One point five years on behalf of all of us here at the station thank you for your support for membership drive to not do this without [noise]\nProgramming on Ninety One point five three or CCD is supported by Jackson Greek senior living monument offering independent living assisted living memory cure residences design for many lifestyle choices wellness programs tailored activities in more now scheduling tours more objection creek senior living dot com\nBoom [noise]\nSupport for NPR comes from this station and from Amazon Prime video presenting the return of the men in the high castle were America's history is under siege but the resistance rises to fight for the world today want the new season premiere is this October on prime video\nFrom T Rowe price offering a strategic investing approach that examines investments opportunities firsthand institutions advisors employers and individuals choose T Rowe price to euro price and invest with confidence\nAnd from it less than a collaboration software company power in ...\nFrom Amazon Prime video presenting the return of the men in the high castle were America's history is under siege but the resistance rises to fight for the world today want the new season premiere is this October on prime video\nFrom T Rowe price offering a strategic investing approach that examines investments opportunities firsthand institutions advisors employers and individuals choose T Rowe price to euro price invest with confidence\nAnd from it laughing a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more edited lassie ... dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep if you had any doubt that the flu is a serious disease consider this last winter some eighty thousand people died from the flu and its complications\nGet fewer than half of Americans get vaccinated each year and NPR's Allison Aubrey found a place where vaccination rates are often lower college campuses\nIt's not a surprise when young adults think they're invincible and when it comes to the flu shot survey data backs this up I talked to students at George Washington university\nAfter you guys have you've had the flu shot that they're not yet I just think of it\nWhich I Am a gun and\nSurvey data shows one of the top reasons young adult opt out they say they're healthy they don't think they'll get the flu jak gross and ... Iraq to say they've heard this yeah I\nThink people really don't get it because I don't see a need for it so they're like oh I haven't gone before so I don't need to get the flu shot\nAnother optical getting the flu shot can be a hassle miles ... and Christian joins say it's just not top of mind\nLike if you have class and work the are going to you know I feel like flu shots not very high most the priorities yeah something of a huge portion of their day in trying to get it\nThese students say they plan to get a flu shot if they haven't already and one factor that name motivate them as last winter is death toll with eighty thousand flu related deaths it was the highest death toll and more than forty years and hundreds of thousands of people were hospitalized\nWilliam Schaffner is medical director at the national foundation for infectious diseases\nIt was an extraordinary season and we had a very vicious virus the so called H three and two influenza\nSomething of a huge portion of their day in trying to get to\nThese students say they plan to get a flu shot if they haven't already and one factor that may motivate them as last winter death toll with eighty thousand flu related deaths it was the highest death toll and more than forty years and hundreds of thousands of people were hospitalized\nWilliam Schaffner is medical director at the national foundation for infectious diseases\nWhere it was an extraordinary season and we had a very vicious virus the so called each three and two influenza strain\nSchaffner says it's too soon to say if this will be a severe flu season but he says that's no reason to wait to get vaccinated Schaffner says it's true that people sixty five and older are at higher risk but he says young adults are vulnerable\nTo the flu can even on occasion take a young healthy person to put them in the intensive care unit in forty eight hours we can't pick you out in advance so let's all get protected\nOn the George Washington campus the student health center is going all out to get students vaccinated Isabel golden ... medical director she's organized to pop up clinics in students' favorite hangout spot we don't wait for them to come to us today she's giving shots in the library Peter open a freshman walks in\nAre definitely I'm not a big fan of noodles but you know cigarettes can spread really focus on campus and I just wanted to prevent myself from getting sick and from anyone else with him or her own\nTheatre whatever you want right or left the famous shot at from this one two three hours\nAfter such a bad flu season last year many people know the vaccine is not a hundred percent effective but what many people don't realize is if you get the flu shot and still end up catching the virus your sickness is likely to be significantly less severe student max Web says he'll\nTake some protection over no protection I've had the flu which was horrible and so after that experience but\nI don't see a reason why even risk it without getting the Web says he thinks one way to motivate young people get the flu shot it would be a social media campaign where people share their flu stories I asked him what he called the camp\nThey moved to the flu I don't know that\nJust came up with that now I I like I said it's got a ring and maybe it's a reminder\nTo get the shot the for Halloween Allison Aubrey NPR News okay if you're looking for a cheaper health insurance and\nIt was horrible and so after that experience I\nDon't see a reason why even risk it without getting back to the\nWeb says he thinks one way to motivate young people get the flu shot it would be a social media campaign where people share their flu stories I asked him what he calls the camp\nThey moved to the flu I don't know that\nCame up with that now I like I said it's got the ring and maybe it's a reminder to get that shot\nThe for Halloween Allison Aubrey NPR News\nOkay if you're looking for a cheaper health insurance and you can currently find on the individual market a whole host of new options will become available starting tomorrow this is due to a change the Trump Administration is making to insurance regulations but buyer beware with lower prices come fewer benefits Here's NPR's Alison Kodjak\nThey're known as short term limited to ration health plans and the idea is to give people who think Affordable Care act policies are too expensive or don't think they're worth it a different option these are\nA niche product always have been\nThat started badger a visiting fellow at the conservative Heritage Foundation in Washington\nIt's simply another choice for consumers that for many ah is more affordable than the other products of Illinois and the individual marketplace\nShort term health insurance isn't new it's there for many years is stopgap coverage for people who are say between jobs are just out of college but during the Obama administration the plans were limited to just Ninety Days\nNow the Trump Administration is expanding access so that people who don't want to pay for insurance that meets Affordable Care act standards or who don't qualify for subsidies confined coverage more than eighty percent of people who buy insurance on the a C a exchanges get subsidies to help pay for it but there's no government help for short term plans\nThe new rules allow people to buy a policy that last year and they can renew two times which ... says is a good option\nInstead of remaining uninsured to have a product that makes sense for them\nBut Alison Hofmann with the University of Pennsylvania law school says this insurance may have a role but it comes with a risk people who think\nThat they're healthy they're unlikely to need to use much medical care they may still want to backstop they may want something and they may buy these plans thinking that they're going to get them what they want and for some people that could be true and for others when they actually go to use medical care or if they get sick or if they're in an accident they'll find that they don't really have very much health insurance coverage\nThat's because the short term policies don't have to meet the Affordable CARE Act rules they don't have to cover people with ongoing health problems\nThat makes sense for them but Alison Hofmann with the University of Pennsylvania law school says this insurance may have a role but it comes with a risk people who think\nThat they're healthy they're unlikely to need to use much medical care they may still want a backstop they may want something and they may buy these plans thinking that they're going to get them what they want and for some people that could be true and for others when they actually go to use medical care or if they get sick or if they're in an accident they'll find that they don't really have very much health insurance coverage\nThat's because the short term policies don't have to meet the Affordable CARE Act rules they don't have to cover people with ongoing health problems and usually cover fewer services than required under the CIA policies may cost as little as Seventy five dollars a month but they often carry big deductibles more than ten thousand dollars on some\nAnd they may not cover things like prescriptions or mental health care and generally they only pay about half of any medical bill after that deductible has met\nSo people have something called health insurance um but it doesn't necessarily pay for all of their health needs\nThese policies are regulated at the state level and some states have banned them altogether so your options are look different depending on where you live\nIn the new rules say insurance companies have to be very clear about what the policies cover and what they leave out the government estimates about six hundred thousand people may buy short term insurance next year and after five years that market could grow to about one point two million people\nAlison Kodjak NPR News [noise]\nSupport for your health comes from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home\nRights civil rights full rights that are equal to those of any Jewish Israelis citizen and what form of that tank\nWell they would have those rights and their own territory in other words they have their own parliament they have their own government have their own flag they have their own\nWell they have any of them back now but they have very very little writes compared to the average Israeli I Would think\nWell if you go we don't govern the Palestinians don't administer Ramallah engineering or no blue governed by the Palestinians but you can extend that governance but not to the point where you would endanger Israel now\nRights full rights that are equal to those of any Jewish Israeli citizen and what form of that tank\nWell they would have those rights and their own territory in other words they have their own parliament they have their own government to have their own flag they have their own\nWell they have any of them now but they have very very little writes compared to the average Israeli I Would think\nWell if you go we don't govern the Palestinians that we don't administer Ramallah origin then or now blue it's governed by the Palestinians but you can extend that governance but not to the point where you would ah endanger is\nNot this is a very odd to think where the Palestinians are actual demanding something that would collapse their own authority and their own government but it's not the first time but they do so so I think we have to be realistic as long as the you know we have the middle east on reformed and\nPockmarked with so much violence so much radicalism so much terrorism this is the best we could we could have and\nYou you believe in any circumstance that Israel should be able not only that security control but to arrest people to bring them into Israeli courts you want to stay with Israel [noise]\nUh yes I Want to have an overriding power and I'll tell you why you don't see\nThis is an interesting question how come you don't see that much terrorism in a in the west bank well first of all we have security cooperation with the Palestinian authority that's good um we don't have it with Hamas in Gaza but the bulk of the security operation was a it was done by us\nBut here's how it's done we have say intelligence about of them are terrorists\nOr in a one of the Palestinian towns and we would call up typically\nThe Palestinian security authorities and say why don't you take care of it because I don't want to send our soldiers there if we don't have to why should we you know and often we have to do because because we're willing to to take the risk within attacked because we weren't at the un by President Abbas so\nThey want us to take care of their security but also you know attack us\nInternationally final thing minister because I Know your time is very busy so I Hope you got the irony of what I said I understand I Do final thing you have been very closely aligned with President Trump that is carrying certain great benefits for you\nIs there also a risk in being so closely aligned with such a polarizing president because he would rather as Israel historically has has\nBipartisan support in the United states\nIsrael values is bipartisan support in Israel has had a bipartisan support and and\nThey want us to take care of their security but also you know attack of\nFight internationally final thing prime minister because I Know your time is very ... I Hope you got the irony of what I I understand I Do final thing you have been very closely aligned with President Trump that has carried certain great benefits for you\nIs there also a risk in being so closely allied with such a polarizing president because he would rather as Israel historically has have bipartisan support in the United states\nIsrael values is bipartisan support Israel live on a bipartisan support in I Believe will have a ... in in the future it's a very powerful bond\nThere there's no risk with being so close to Trump\nWell I think that uh you know you feel that we could have agreements and disagreements with ministers was for example we you know it's no secret of out of disagree with\nPresident Obama on Iran but at the same time\nWe signed an animal you are an animal you are the memorandum of understanding going through those are all a very important American security assistance for the coming decade and I appreciate that uh so we can have disagreements and you have a basic agreement about the importance of our live\nPrime minister Netanyahu it's always a pleasure talking with you thank you very much\nFactors do good to talk to\nIsrael's Benjamin Netanyahu we also invited Palestinian leader Mahmoud Abbas has joined us and that invitation remains open It's MORNING EDITION from NPR News\nThe free lecture titled rethinking multi cultural education equity access inclusion hand opportunity will be presented at Colorado College on October third more information on this on the community counter Lincoln T. R. C. C. dot ORG\nThe national sexual assault hotline the the two hundred percent increase in Columbine the FBI recognizing sexual assault at the filing high in the first us by like murder as a nation reckon with accusations of sexual assault many victims are reporting their own abused for the\nFirst time I'm In Vegas and that's next time on the take away from WNYC NPR I\nTake away weekday mornings at eleven o'clock on southern Colorado NPR station Ninety One point five K. R. C. C. I. Madagascar back then you are listening to MORNING EDITION it is Monday October first young jak is one of the most celebrated women in rock and roll and it all began with\nChristmas present I asked my parents are electric guitars specific why in a life\nDozens are reporting their own abuses for the first time I've seen a Vega and that's next time on the take away from WNYC NPR I did\nTake away weekday mornings at eleven o'clock on southern Colorado was NPR station Ninety One point five K. R. C. C. I'm Abigail back then you are listening to MORNING EDITION it is Monday October first [noise] Jones jet is one of the most celebrated women in rock and roll and it all began with\nA Christmas present I asked my parents are electric guitars specific why and electric guitar because I wanted to make those loud noises that I heard on the radio\nNow a new documentary chronicles Jones gets right to same more on that coming up at seven fifty one\nProgramming on Ninety One point five to your cc is supported by never die or Colorado Springs IT company with the return of the ... running club Wednesdays it five five to run led by going to the office dogs since two thousand and one offering Cisco Systems network security consulting and more Nabokov dot com\nBy Colorado Ballet presenting double loving classics Sleeping Beauty October fifth through the fourteenth that the only Caulkins opera house with live music by the Colorado ballot orchestra Colorado belly dot org\n[noise]\nWith the content on the other day and instead of chatting with allergies are back in the top of the show to use that time the kids go memory is sitting in the audience\n\nMaria then answered again this time in the form of the question what is yeah It's MORNING edition\nSupport for NPR comes from this station and from exact science is offering coal to guard for average risk or adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at Cal the guard test dot com\nAnd from babble a language that teaches a real life conversations in a new language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at a battle B a\nB B. E. L. dot com\nSupport for NPR comes from the station and from exact science is offering told a guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information at ... dot com\nAnd from babble a language that teaches a real life conversations in a new language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot com It's MORNING EDITION from\nNPR News I'm Steve Inskeep and I'm Rachel Martin voters in Iraq's three Kurdish region's went to the polls yesterday to elect a new regional parliament\nThis part of Iraq has been semi autonomous since the U.S led a no fly zone there in the Nineteen nineties to protect the Kurds from former Iraqi President Saddam Hussein and posting a raft joins us now from the Kurdish city of ...\nGene I understand there are no official results yet but any indication as to what a new Kurdish parliament could look like\nWell for the most part Rachel it's gonna be the status quo you know there are two main parties here that have existed for decades and they will continue their control\nBut the interesting thing is their opposition parties including one that didn't even exist in the last elections five years ago it's aimed at young people\nAnd it looks like that party at least will do well here's an election observer named ... from the opposition ... party and older party explaining why he thought voters were rejecting those traditional parties\nThe democracy not just on the way you have to be implemented in reality but fortunately sitting in for using the officers who make these ...\nInside it almost [noise]\n[noise] and my dad he means that he and a lot of voters I talked to frankly are frustrated over the lack of opportunity the fact that the party's control of the jobs lack of freedom for people not connected with those big parties\nSo what does that mean to people was turn out good as a result of this frustration you were at polling stations right\nThat was a really interesting thing because we went early in the morning and we stayed and we did not see a lot of people but the results that they're citing are actually pretty high I'm One of the big fears has always been fears of fraud and there were allegations of widespread fraud in central elections here in may\nIn fact one of the party headquarters was attacked after so one of the biggest parties the ...\nLack of freedom for people not connected with those big parties so what does that mean do people was turned out good as a result of this frustration you were at polling stations right\nYeah that was a really interesting thing because we went early in the morning and we stayed and we did not see a lot of people but the results that they're citing are\nActually pretty high I'm One of the big fears has always been fears of fraud there were allegations of widespread fraud in federal elections here in may in fact one of the party headquarters was attacked after\nSo one of the biggest parties the PKK immediately said it was rejecting all the results but then they rescinded that\nSo here's one of the problems media were only allowed in the very few polling stations we got in one one of the proved polling stations and we were able\nTo watch them start to count some of the ballots so there is an election official taking out each paper ballots [noise] because they decided not to do the automated their ballot counting because they think that leads to fraud\nAnd he's reading out the name of each party's very laborious process so even at the polling station which you'd think would be like super squeaky clean people trying to get in with fake IDs huh but really the question is whether the violations or serious enough to put the results in question\nRight so I mean we've heard for generations of how the Kurds have been wanting their own state right so there's an ... an innate tension between\nThe Kurdish regional government and the central government in Baghdad so what how how could the new government in essentially Kurdistan affects the the relationship with Baghdad\nAbsolutely you've hit the nail on the head because they had a referendum last year saying do you want independence and the vast majority of Kurds said yes so the U.S says of course that it warned them not to hold this and there were serious repercussions after that\n... and her longtime producer Kenny Laguna the documentary is called bad reputation It's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep [noise]\n[noise]\nWe use the congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative trend among the states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy important one of our series the state where it next time on one day from W. A. M. U. and NPR\nStay with us for one a starting at nine o'clock that isn't just about an hour this is southern Colorado was NPR station K. R. C. C. K. R. C. C.\n[noise]\nWe use the congressional gridlock but states across the country are getting things done ahead of the midterms were looking at legislative trends among the states and what they tell us about the nation's political direction\nI'm Joshua Johnson we focus on gun policy in part one of our series the state where it next time on one day from W. A. anew and NPR\nStay with us for one a starting at nine o'clock that isn't just about an hour this is southern Colorado was NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. C. C. C. hunter\nCasey cs stark bill and K W cc FM woodland park streaming at K. R. D. C. dot O. R. G.\nIt is eight o'clock I'm Abigail back then and you're listening to MORNING EDITION\nAnd it's like there is some precipitation in the forecast mostly in the mountains and in the mountain valleys high today will be in the sixties and seventies the news is next stay with us who\nGood morning Canada has joined Mexico and the United states in an updated version of now done other different from the free trade agreement president It's MORNING EDITION from\nComing out the aftermath of a ... I'm Rachel Martin and I'm Steve Inskeep our colleague Julie McCarthy is on the Indonesian island struck by massive ways an\nPeople in Uganda have found a subtle way to show their distaste for their autocratic ruler\nAnd California impose\nNeutrality ordering Internet providers read all customers equally hours later the Justice Department says it's Monday October first birthday model\nOne hundred ten years ago and now you know a reward introduces\nAs long as it was black here's the\nLine from NPR News in Washington encore of a Coleman the FBI and spending a week reviewing sexual assault allegations against Supreme Court nominee Brett Kavanaugh Delaware democratic Senator Chris Coons told NPR's MORNING EDITION the FBI investigation needs to be broader and should include more witnesses and documents\nI'm working hard to encourage my colleagues in the Senate principally Jeff Flake from Arizona but others um to speak up and to say the whole point of this week is not to have an ... an open ended\nIn his\nLine from NPR News in Washington encore of a Coleman the FBI and spending a week reviewing sexual assault allegations\nSupreme Court nominee Brett Kavanaugh Delaware democratic Senator Chris Coons told NPR's MORNING EDITION the FBI investigation needs to be broader and should include more witnesses and documents\nI'm working hard to encourage my colleagues in the Senate principally Jeff Flake from Arizona but others\nUm to speak up and to say the whole point of this week is not to have an ... an open ended or an endless investigation but a credible I'm short but purposeful investigation of the sexual assault ago allegations against a judge Kavanaugh that are in front of the Senate now\nSenator Flake a Republican had initially announced he would support Kavanaugh's nomination but friday called for the FBI investigation\nPresident Trump says he'll speaking about an hour at the White House about the new trade agreement reached last night with Canada\nIt will include Mexico and will replace the north American free trade agreement\nThe U.S and already reached agreement with Mexico on a trade deal the negotiations with Canada has dragged on for weeks to scientists will share this year's Nobel Prize in physiology or medicine for discoveries that have led to a revolution in cancer treatment NPR's Richard Harris has the story\nThe prize will be split by James Alison who's currently at the empty Anderson Cancer center in Houston and ... at Kyoto University in Japan the to work independently they were both exploring how the immune system works to ward off diseases including cancer\nThe immune system needs to rev up and it also needs to apply the brakes at times\nAlison and hundred discovered they could interfere with this process and release the breaks that makes the immune system more effective at attacking some cancers and their discoveries lead to a whole new class of drugs called checkpoint inhibitors which are widely used today Richard Harris NPR News\nThe jury in Chicago police officers murder trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from\nMember station WBFO easy ... Mitchell has more\nPolice dash cam video shows Jason Van Dyke opening fire is look one McDonald walked away from officers police reports say ... Seventeen year old who's trying to kill them with a knife in his hand\nNow the officers' attorneys are planning to put Florida base police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing time perception when cops\nOr trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from member station WBFO easy ... Mitchell has more\nPolice dash cam video shows Jason Van Dyke opening fire is lukewarm McDonald walked away from officers police reports say ... a Seventeen year old who's trying to kill them with a knife in his hand\nNow the officers' attorneys are planning to put Florida based police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing time perception when cops shoot\nIn twenty sixteen ... Van Dyke a psych exam\nThe prosecutor wanted Miller barred from the trial he argued only been diagnosed what was going through his mind when he fired for NPR News I'm Luke Mitchell in Chicago\nOn Wall street the Dow Jones industrial average is up two hundred and thirty two points at twenty six thousand six hundred Ninety to the NASDAQ is up more than fifty two point that eight thousand Ninety nine years and the five hundred is up twenty this is NPR\nIt's eight oh four I'm Abigail that come in with Ninety One point five K. R. C. C. news\nWater officials are hoping to finalize agreements between three states to take less water out of Lake Mead providing some relief for the Colorado River the plan calls for cities farmers and tribes in California Arizona and Nevada to share and the cut backs\nWhich aims to prevent water levels in Lake Mead from further declining if officials in Arizona finalize the deal in November as anticipated the state legislature could move forward with a plan in January\nThe federal government has signed off on a camel cannabis derived drug for the first time in doing so the drug Enforcement Administration received some can dial or CBD from the most stringent drug categorization so that doctors can prescribe a drug that treats epilepsy\nHannah Smith was joy organics in Fort Collins said even though the ruling doesn't apply to the CBD products her company makes she hopes it will spur future research\nI think researches and the ... and most of like what how people believe in CBD from the anecdotal evidence\nCongress is working to pass the farm bill which may include legislation that would legalize industrial hemp\nA fire that started over the weekend in park county was fifty percent contained as of last night the Wilkerson fire is just west of lake George the blades had burned Eighteen acres at last report from the U.S Forest Service the cause of the fire is still under investigation\nThanks she hopes it will spur future research\nBut I think research is in the ... and ... like what how people believe in CBD it from the anecdotal evidence\nCongress is working to pass the farm bill which may include legislation that would legalize industrial hemp\nA fire that started over the weekend in park county was fifty percent contained as of last night the Wilkerson fire is just west of lake George the blades had burned Eighteen acres at last report from the U.S Forest Service the cause of the fire is still under investigation\nYou're listening to Ninety One point five K. R. C. C. News I'm Abigail back then\n\nSupport for NPR comes from NPR stations other contributors include Jones Day and integrated partnership collaboratively providing legal services for more than a century forty three officers five continents serving clients as one from worldwide learn more at Jones Day dot com\n[noise]\nIf you are looking for something to do in the Ninety One point five care cc listening area check out the community calendar link care she C. dot ORG and you can submit your event there as well [noise]\nGood morning in is six minutes after eight o'clock the date is Monday October first you're listening to MORNING EDITION on southern Colorado's NPR station Ninety One point five K. R. C. C. [noise]\nComing up does the neighborhood you grow up and determine how far you move up the economic ladder a new online data tool finds a strong correlation between where people are raised in their chances of achieving the American dream stay with us for that story coming up in Fifteen minutes [noise]\nProgramming on Ninety One point five to your cc is supported by fountain valley schools celebrating the new Julie and Spencer prime rose athletic center opening soon deterring a forty foot tall climbing visiting days October the registration is F. B. S. dot edu\nFor the Colorado Springs Brunner center at Colorado College presenting Shakespeare in love ... filled with adventure Elizabethan England September twenty seven through October twenty first tickets at Colorado College dot edu slash if they see [noise]\nIt's MORNING EDITION from NPR News\nCenter opening soon deterring a forty foot tall Corning was being days October the registration is F. B. S. dot edu\nFor the Colorado Springs front and center at Colorado College present and Shakespeare in love the comedic romp filled with adventure Elizabethan England September twenty seventh through October twenty first tickets at Colorado College dot edu swath of the [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin good morning\nWeeks of intense negotiations Canada has joined the new NAFTA the U.S and Mexico broker changes to the trade deal back in August and the Trump Administration gave Canada until midnight to agree to the deal\nPresident Trump is set to deliver remarks about the agreement later today the administration is framing this as a win for the Trump playbook on trade forcing even America's closest allies to reexamine trade agreements to win better terms for us workers\nWhether or not Congress will agree and ratified the deal is another matter Christopher ... is on the line to talk to us about what we know so far he was Canada senior counsel in the trade deal Canada signed with you last year I think so much for being with us\nThanks God to be here last night prime minister Justin Trudeau spoke briefly to reporters after a late night cabinet meeting this is what he said\nWhat is\nA good day for Canada Trudeau said is it do you agree\nI think so I mean in the first place it removes a great deal of uncertainty that's been floating over the NAFTA which is a fundamental trade agreement for the U.S Canada and Mexico ah it's been floating over that agreement for the last two years\nThis is NPR News\n[noise] [noise]\nHi this is helping black host of looking up to nurture on astronomy here on Ninety One point five care so you see we're every Monday at nine AM and nine PM and additional shows are archived at ... dot org and available and I tune remember keep looking up\nThe next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talk with Washington Post reporter Greg Miller who's broken several related\nThis is NPR News [noise]\nHi this is how do black host of looking up to nurture on astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM and additional shows or heart guide to care C. C. dot org and available night tunes remember keep looking up\nOn the next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talked with Washington Post reporter Greg Miller who's broken several related stories and shared a Pulitzer Prize this year\nNow he has a new book called The Apprentice Trump Russia and the ... version of American democracy join us boy\nFresh air weekdays at noon on southern Colorado was NPR station Ninety One point five K. R. C. C. [noise] it is eight twenty or listening to MORNING EDITION I'm Abigail back then hope you're having a great Monday so far the date is October first [noise]\nYesterday voters in Macedonia were asked whether the country's name should be changed to North Macedonia it appears voter turnout for the referendum fell short of what's required details coming up in ten minutes [noise]\nThere's a chance for thunderstorms this afternoon across the region high temperatures will be in the sixties and seventies precipitation is in the forecast tomorrow to temperatures will be a little bit warmer for your Tuesday\n\nNPR on Ninety One point five through your cc is supported locally by never caught hosting after work activities like rooftop parties with her house band anti virus Deeks by day musicians by night since two thousand one offering tech support Cisco Systems network security and consulting never ... dot com [noise]\nNow you can tune in to Ninety One way find care cc without lifting a finger just ... years Martin or didn't do it in ... [noise]\nSupport for NPR comes from the station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself and visit main God come\nFrom T. R. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at CIA\n[noise] [noise]\nSupport for NPR comes from the station and from the main office of tourism offering traveled her as an opportunity to explore and discover their very own main thing to be inspired the original and to be yourself and visit main dot com\nFrom T. I. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at CIA dot org\nAnd from dream wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including morning night and stretch sessions retailers nationwide more a dream wave shared dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin we'd like to think America is the land of equal opportunity but that depends on exactly where in America you live it's often said that you can predict the future as many kids by finding the ZIP Code where they grow up\nAnd online data to all being made public today lets you see for yourself the link between where you are on the American dream Here's NPR's John Ydstie\nEconomists dries Jedi has been worried about the fading American Dream for years he's crunched the numbers and they're troubling if you were born in the Nineteen forties or fifties he says you are virtually guaranteed to achieve the American dream of earning more than your parents did but you\nSee that for kids turning thirty today who were born in the mid Nineteen eighties only fifty percent of them go on to earn more than their parents to that is it's a coin flip as to whether you are now going to achieve the American dream\nShadi and his colleagues that opportunity insights a research and Policy Institute located at Harvard water improve those odds so they've partnered with the U.S Census Bureau to develop an online program it works a lot like a Google Map\nYou can see the whole country or you can zoom in to local neighborhoods and you can click on a neighborhood and get an immense amount of data from incomes and racial makeup to marriage figures\nWe are able to pinpoint you know what are the places where we're seeing lots of kids climbing the income ladder of what are the places where the outcomes don't look as good and we put this all out in the form of the publicly available interactive tool called the opportunity outlets that we hope citizens local policymakers nonprofits people\nIt works a lot like a Google Map you can see the whole country or you can zoom in to local neighborhoods and you can click on a neighborhood and get an immense amount of data from incomes and racial makeup to marriage figures\nWe are able to pinpoint you know what are the places where we're seeing lots of kids climbing the income let our border of the places where the outcomes don't look as good and we put this all out in the form of a publicly available interactive tool called the opportunity outlets that we hope\nLocal policymakers nonprofits people working on these issues can use to make better decisions\nChatty founded moving out of a neighborhood with poor upward mobility to a better one increases lifetime earnings for low income kids by an average of two hundred thousand dollars of course moving a lot of people these impractical so the focus is on helping low performing areas improve\nCharlotte North Carolina has gotten a head start on this effort back in twenty fourteen shed he and his colleagues found Charlotte was dead last out of fifty cities at providing upward mobility for low income kids that shocked many residents\nIf you knew anything about Charlotte Charlotte wants to be number one\nOphelia ... brown a prominent Charlotte physician says that ranking ran counter to Charlotte's image of itself as a thriving banking center with an expanding high tech sector and a city that's been a leader in job creation and wage growth over the past two decades\nOutlast and surprised that we had done poorly I've been a physician for a lot of years work with people who live in poverty so\nI saw what she saw was a segregated city where a low income black residents especially faced a little chance of moving up the economic ladder\nCarmen brown joined an effort by the foundation for the Carolinas to address the problem\nThe group identified early childhood development college and career readiness families stability and strong social networks as key factors that enhance upward mobility it's singled out segregation as a key obstacle\nAnd now Charlotte officials are learning to use the opportunity atlas to effectively target some remedies things like pre K programs and affordable housing\nSo I don't care right now it's just kind of care math median income in Charlotte\nSaid a lot of Williams from the Chinese team is demonstrating the opportunity atlas for a group that includes the local officials she's\nCollege and career readiness families stability and strong social networks as key factors that enhance upward mobility it singled out segregation as a key obstacle\nAnd now Charlotte officials are learning to use the opportunity at less to effectively target some remedies things like pre K programs and affordable\nHousing so I have that here right now it's just kind of care math median income in Charlotte and\nA lotta Williams from the Jedi team is demonstrating the opportunity outlets for a group that includes the local officials she's zooms into Charlotte in clicks on neighborhoods if the area is reddish brown it signals low levels of upward mobility if it's green or blue it has higher opportunity\nFor the outcomes for children who grew up in different tracks in Charlotte Frank\nBarnes is the chief equity officer for Charlotte Mecklenburg schools he says the tool has already exceeded his expectations I think the key thing that has happened is\nThe fathers for the Carolinas brought a lot of partners to the table to think about how to act on these data and I think that's the power it's in the community collaboration that community partnership\nCharlotte's effort to improve upward mobility is already taking shape at such field middle school it's located in a majority white neighborhood not far from downtown Charlotte but assistant principal Eric heartfelt says the schools students are mostly black\nAnd Hispanic so we have forty eight point nine percent are Hispanic forty four point five percent are African American four percent are white it's not unusual for a public\nSchool in Charlotte to have a student body this large minority that's because many white students attend private schools or public schools outside their neighborhoods that segregation hinders upward mobility\nJames e for the former North Carolina teacher of the year is working with such fields administration to make the school more racially balanced\nFor now an education consultant says to local elementary schools have already emerged for that reason\nEventually something similar is going to pay the demographics you're going to shift quite a bit this majority black and brown now\nBut when in the coming years it changes it started to look more like the neighborhood\nThere's another challenge here beyond segregation it's the lack of social networks minority children need to succeed the ... neighborhood is more affluent than a nearby majority black neighborhood called south side park but the opportunity outlets shows African American boys growing\nConsultant says to local elementary schools have already emerged for that reason\nEventually something similar is going to pay the demographics you're going to shift quite a bit this majority black and brown and now\nWe're in the coming years at a change you to start to look more like the neighborhood\nBut there's another challenge here beyond segregation it's the lack of social networks minority children need to succeed\nThe ... neighborhood is more affluent than a nearby majority black neighborhood called south side park but the opportunity outlets shows African American boys growing up and said field in the Nineteen eighties and nineties are now doing worse than their counterparts from South side park\nFord says that might surprise some people\nWe may soon because the areas of flu like that's a high opportunity area when the truth is that may not be a high opportunity area according to the metrics that we're looking at\nIn this case it may be that the majority black neighborhood of south side park offers young black man the social networks friends extended family churches that help them get ahead those kinds of networks might not be accessible to them in a majority white neighborhood\nFord says the opportunity atlas should help reduce misconceptions about economic mobility\nThis permits us to start making really smart and really intentional decisions so that twenty Thirty years and we could look and say yeah that was the right call\nCharlotte is already taking significant steps in that direction Mecklenburg county which encompasses Charlotte has committed to providing pre K for all children the city of Charlotte has a fifty million dollar bond issue for affordable housing on November ballot\nRoss chatty says he hopes the opportunity atlas will help communities across the country revived the American dream in their local neighborhoods\nIs so large [noise]\nHow dark off his joined dozens camping out for months next to a statue of ... they boycotted Sundays name change referendum despite pressure from European and even American leaders\nWe like to go beyond known as we've said and what don't we don't\nFeel like his last chance to be in NATO supply boycotting\nNo I think that if they don't know if I was always\n[noise] [noise]\nHow about ... his joined dozens camping out for months next to a statue of ... they boycotted Sundays name change referendum despite pressure from European and even American leader\nWe like to go you know you don't really know what we do and what we just don't\nFeel like you've lost your chance to be in NATO and the European Union supply boycotting\nThe argument that they don't know if I were to do a ... survey\nOut all the way Russia or China India you don't you're going to do with all of them big name\nAny claims most Macedonia and support his view since only about thirty seven percent of voters even bother casting a ballot on the name change [noise]\nMacedonian prime ministers or and die of offered a different view to supporters cheered when he arrived in the ballroom of a luxury hotel to declare victory pointed out Ninety percent of those who cast ballots support the name change his government worked out with three [noise]\nLearn was easier I Know the political opposition and the citizens now that there cannot be any better agreement there cannot be any alternative Macedonia membership in NATO you [noise]\nOthers also have hope political analyst ... op ed called ski watches a group of boys play soccer outside his office he says he still expects Macedonia and politicians to back the deal\nIt's going to be more difficult than expected but you're still going to happen\nHe says Macedonia and politicians want strong ties with the west and the west wants to protect Macedonia from the Kremlin\nRussia does not have no clear course here in foreign policy beautiful but they have football as CEO of destruction they want to be up to the political dynamics of the political ...\nRussian meddling was blamed for the referendum low turnout but a but elevated who runs the Macedonia\nOffice of the German think tank also census fatigue with the EU which sometimes send some mixed signals on membership for Balkan countries\nThere were many people just\nTired and frustrated with the past disappointments and just not believing in the process anymore\nTania ... ski a forty year old nurse is still a believer\nThey have football as fuel destruction they wanted to get political dynamics of the political but for\nRussian meddling was blamed for the referendum low turnout but a but elevated who runs the Macedonia office of a German think tank also census fatigue with the EU which sometimes send some mixed signals on membership for Balkan countries\nThere were many people just\nTired and frustrated with the past disappointments and just not believing in the process anymore\n[noise] Tania ... ski a forty year old nurse it's still a believer she's voted yes in the name change at a precinct a school named after ... Tito the former leader of Yugoslavia\nMaybe you can help Macedonia develop its economy she says people can make more than four hundred dollars a month the average wage here um they made me ... to do and I don't care so much about a name she says well as my name is on young but I don't want to be a turning him without money for prospects\nFor NPR News I'm Joanna Kakissis in scope yeah Macedonia\nToday we're also remembering the dozens of people who've died one year ago at an outdoor concert in Las Vegas [noise] later on all things considered one of the survivors talked about using her own harrowing experiences to start a support group to listen to that story by asking your smart speaker to play NPR or you can ask for your local member station by name [noise]\nThis is NPR News\nNo more secrets symposium addresses mental health stigma and local communities of color and provides individuals and families with the resources they need you benefit for up to her fifth and sixth and downtown Colorado Springs more information and ...\nThe national sexual assault hotline see the two hundred percent increase and called the FBI recognizes sexual assault at the second most violent crime the first us by like climate murder\nAs a nation reckon with accusations of sexual assault many victims are reporting their own abused for the first time I'm In Vegas and that's next time on the take away from WNYC NPR I [noise]\nThe takeaway starts this morning at eleven o'clock on southern Colorado's NPR station Ninety One point five K. R. C. C. but first coming up in about eight minutes we have the marketplace morning report Iran must step down from his role as the chairman of Tesla he'll still be the c._e._o. but the board of tests\nThe filing cry in the first us by like climate\nMurder as a nation reckon with accusations of sexual assault many victims are reporting their own abused for the first time I'm ... and that's next time on the take away from WNYC NPR ride the takeaway\nStarts this morning at eleven o'clock on southern Colorado's NPR station Ninety One point five K. R. C. C.\nBut first coming up in about eight minutes we have the marketplace morning report on mosque stepped down from his role as the chairman if Tesla he'll still be the c._e._o. but the board of tests and we'll get some new members the move comes as a result of a suit against mosque filed by the securities and Exchange Commission\nThat plus all the morning's business news coming up at eight fifty one on the marketplace morning report\nIn canyon city at fifty five degrees and high today in eighty one a slight chance for rain in Pueblo fifty two partly sunny high of Seventy six in in Colorado Springs is fifty three degrees mostly cloudy today high of Seventy three\nProgramming on Ninety One point five K. R. C. C. is supported by pikes peak center presenting clinical psychologist Dr Jordan Peterson championing his twelve rules for life to her on October eighth\nTickets for the twelve rules for life to her are available now at ... dot com by the Colorado Springs law firm of God or skin heard and cry for forty five years helping navigate through many legal issues that arise when a loved one dies from providing guidance about probate settling the state's more get his skin heard dot com\nI'm Steve Inskeep to football fans are having a baby she's a charger fan\nHe favors the forty niners and according to the places that\nThey agreed that won two teams played each other they bring the kid up as a fan of a team that won\nThe chargers won and parents everywhere now what that means there could be no doubt that when that kid out roses chargers ones he will rebel and follow the Dallas Cowboys for ever It's MORNING edition\nFor NPR comes from this station and from the alliance for a lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Trader Joe's offering new products in every store and new episodes of the original pod cast series ends\nWill rebel and follow the Dallas Cowboys for ever It's MORNING edition\nSupport for NPR comes from this station and from the alliance for a lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nAnd from Trader Joe's offering new products in every store and new episodes of the original pod cast theories inside Trader Joe's at apple pie cast or where pod cast are available more at Trader Joe's dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin this year's Nobel Prize for physiology or medicine will be given to two scientists who's discoveries have led to a revolution in cancer treatment\nThat nobody on the family have today's either to warn the two thousand a Nobel Prize in physiology or medicine jointly to James out of this phone how school home jump\nThese two scientists invented a new kind of cancer treatment called immune checkpoint inhibitors with us in the studio to tell us more NPR science correspondent Richard Harris and Richard good morning so who are these two winters\nWell the prices being shared of course by James Allison he's a Seventy year old biologist who's now with the NBA Anderson Cancer center in Houston and by ... hunt Joe at Kyoto University in Japan he's Seventy six now you know how some years the Nobel Prize comes it's a complete surprise itself not this year these names are on just about everybody shortly OK so\nNot such a big shock uh but what exactly did these two scientists do well\nI'll start with Jim Allison and back in the Nineteen nineties who was working at UC Berkeley and he was studying the immune system that's the system that keeps us healthy by attacking threats like bacteria viruses and even cancer cells they came across a part of the immune system that actually holds the system and check sort of think of them is the brakes on the immune system\nAnd it occurred to him that if he could release the brakes may be the immune system would be more effective and attacking cancer and that indeed turned out to be the case his observations led to infect what's been called the revolution in cancer treatment\nIt would lead to a whole new class of drugs called checkpoint inhibitors you may have heard now that we've talked about them a fair amount on our airplanes and today they're used in melanoma lung cancer a whole bunch of other cancers in the list is growing and growing and growing\nOkay so that's Jim Alice and the other scientists who is winning that's the word ...\n... holds the system and check sort of think of them is the brakes on the immune system\nAnd it occurred to him that if you could release the brakes maybe the immune system would be more effective and attacking cancer and that indeed turned out to be the case his observations led to in fact what's been called the revolution in cancer treatment\nIt would lead to a whole new class of drugs called checkpoint inhibitors you may her now that we've talked about them a fair amount on our air and today they're used in melanoma lung cancer a whole bunch of other cancers in the list is growing and growing and growing\nOkay so that's Jim Alice and the other scientists who is winning that's word ... school how do\nYou have any now that him a hundred work independently of Jim Alison but he was also exploring the same biology molecules that put the brakes on the immune system response\nAnd he came across another set of molecules that do the same thing in his discovery he discovered these molecules called pd one and ... one of which have become prime targets for these checkpoint inhibitor drugs\nOne example one of these drugs that you may have heard about is a drug called ... nuts that goes on a attacks these things so it was a very similar line of reasoning and sort of biology but he found a different set of of of targets to attack and in some ways they're more effective target\nFascinating so how did these two independent but related discovery of changing how how we think about cancer\n... well before the scientist made their discoveries cancer treatment was focused not entirely but more or less on killing or removing cancer cells and tumors so that could be with chemotherapy or surgery or radiation\nAnd all these treatments are still used and in many cases are still very effective treatments but there are many instances in which they don't work and these new checkpoint inhibitors have opened up this entire new realm of cancer treatment they are particularly effective\nTo get way to get the body's own defenses to fight back more effectively and this whole world of immunotherapy is known really the driving force behind drug development", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Colorado Springs", "day": "01"}