{"month": "10", "state": "CO", "station": "KRCC", "content": "I'm calling because Joe Africa's ... produced by Joel ... it's a just read your production for the BBC well stuff is\nThe threat is clear I'm not denying climate change but try explaining that to President Trump\nYou have to show me the scientist because they have a very big political agenda\nExplaining the facts behind climate change is not enough to convince deniers so what would it take I'm Joshua Johnson a reality check on debating climate change next time on one a\nOne day to day at nine AM on Ninety One point five\nK. R. C. C. southern Colorado's NPR station\nIf your duty area or just a little forgetful and you'd like to know when your favorite programming errors Ninety One point five casting the visit our website where you'll find\nDaily and weekly program guy much more are he's he's got to learn to\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. A. C. C. la hunter KCBS ... n K W cc FM woodland park streaming Jay or C. C. dot org who\nMorning secretary of state Mike Pompeo hail me to the leaders suspected of having a journal and Kelly the chief diplomat in meetings Saudi Arabia's king and have friends in the MORNING EDITION from NPR News\nComing out how the reaction to Jamal ... parents is threatening Saudi business I'm Rachel Martin\nSteve Inskeep drug makers face a demand to disclose more information the Trump Administration wants them to put the list prices of their drugs and have also what happened with France received three months of rain in two hours and we have a story of protests during the national anthem to Olympic athletes lost their metal\nComing up how the reaction to Jamal to show genes disappearance is threatening Saudi business I'm Rachel Martin\nAnd I'm Steve Inskeep drug makers base of demand for more information the Trump Administration wants them to the list prices of drugs and have also what happened with France received three months of rain in two hours and we have a story of protests during the national anthem to Olympic athletes who lost their medals for\nRaising their two years ago and I do\nIt's Tuesday October sixteen the singer John Mannes forty one years old and the new shoes next\nLive from NPR News in Washington on corporate Coleman authorities in the U.S south east to say at least Seventeen people have been killed because of hurricane Michael but dozens of others still remain missing there are areas where there is no cell phone service especially in the Florida Panhandle that's where the storm made landfall so people cannot check on their loved ones\nNPR's Quil Lawrence is in the Florida Panhandle\nThey're Eighteen shelters in Florida alone and hundreds of people are still living in those\nOthers are having to start finding contractors or get insurance claims filed or trying to get help from from FEMA trying to get their roofs covered up with ... so that if it rains it will cause more damage than what already happened in the storm NPR's\nQuil Lawrence secretary of state Mike Pompeo has met with Saudi Arabian king Sal men in Riyadh they're discussing the fate of Saudi journalist ... 'cause she feared murdered news reports suggest the Saudi Government is considering saying he died in an interrogation gone wrong\nNPR has not confirmed these reports rural Americans are as concerned about drug addiction as they are about the economy NPR's Alison Kodjak reports on a new poll from NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nThe poll shows that about a quarter of the people living in rural areas said drug addiction or abuse is the biggest problem facing their communities that's about the same share that side of the economy as their biggest worry\nThose two categories overwhelmed all the other responses in the survey of Thirteen hundred people who live in rural areas but even with those worries people say they have a positive outlook about their future\nRobert Blendon is the professor at Harvard's th Chan School who directed the pole\nIn terms of the future at least half of people are quite\nRobert Wood Johnson Foundation and Harvard's th Chan School of public help\nThe poll shows that about a quarter of the people living in rural areas said drug addiction or abuse is the biggest problem facing their communities that's about the same share that side of the economy as their biggest worry\nThose two categories overwhelmed all the other responses in the survey of Thirteen hundred people who live in rural areas but even with those worries people say they have a positive outlook about their future\nRobert Blendon is the professor at Harvard th Chan School who directed the pole\nIn terms of the future at least half of people are quite optimistic\nMost of the people who responded to the survey said they are doing better than their parents and the majority said they expect their kids to do even better Alison Kodjak NPR News\nA federal judge has dismissed a lawsuit against President Trump from adult film actress Stormy Daniels she had claimed the president had the famed earlier this year on Twitter NPR's Jessica Taylor has more\nDean sued over a tweet Trump sent in April thing Daniels was lying about being threatened in twenty eleven not to go public with their story of an alleged sexual encounter with Trump\nBut in his ruling the federal judge wrote that the tweets quote constitutes rhetorical hyperbole normally associated with politics in public discourse in the United states that it's protected by the first amendment in a statement and Trump's attorney called this a total victory for the president\nDaniels' lawyer Michael ... they would appeal the ruling and the other legal action over a nondisclosure agreement Daniels signed would proceed Trump has denied any sexual encounter with Daniels but did finally admit to reimbursing his lawyer for a hundred and thirty thousand dollar payment to Daniel's on the eve of the twenty sixteen election\nJessica Taylor NPR News Washington\nYou're listening to NPR News\nThe co founder of Microsoft Paul Allen has died his company Vulcan Inc says he died Monday in Seattle of non Hodgkin's lymphoma he would sixty five Alan was also a philanthropist tech investor and the owner of several sports teams\nNorth and South Korea have agreed to disarm some of the troops facing each other across their common border and here's Anthony Kuhn reports from Beijing today's deal came at a meeting following last month summit between the two countries leaders\nOne of the last hot spots of the Cold War inside the militarized zone or DMZ between the two Koreas is a joint security area or J. essay where the U.S South Korea and North Korean troops have faced each other's enormous there's ended the fighting in Nineteen fifty three right now soldiers are removing landmines from the ...\nSports teams north and South Korea have agreed to disarm some of the troops facing each other across their common border and here's Anthony Kuhn reports from Beijing today's deal came at a meeting following last month summit between the two countries leaders it's one of the last\nHot spots of the Cold War inside the militarized zone or DMZ between the two Koreas is a joint security area or J. essay where the U.S South Korean and North Korean troops have faced each other since an armistice ended the fighting in Nineteen fifty three\nRight now soldiers are removing landmines from the J I say when that's done no firearms will be allowed in the area\nToday's talks were held among colonel level officers of the two Korean armies and the United nations command which oversees all activity inside the DMZ\nThe two sides will remove guard posts and reduce forces to thirty soldiers and five officers each Anthony Kuhn NPR News Beijing\nDiplomats from the European Union and the United kingdom will hold a meeting tomorrow in Belgium on the future of the u._k. exit from the European Union notice ...\nExpectations are low for a deal and there is concerned the cable crash out of the European Union next march with no agreement in place the big sticking point is over whether to have a hard border between the u._k. and Ireland which will stay part\nOf the European Union on corporate Coleman NPR News in Washington\nSupport for NPR comes from the alliance for a lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nThis week on all things considered here the latest news than an honor in a lifetime to serve\nWhat it means what we have a number of people that would very much like to do is a great position and some things that are so serious was no sort of instructive manual which goes with the songs that tells you to go free or we're going to listen to all things considered\nTo hear the bigger picture every afternoon from NPR News the afternoons at three thirty Ninety One point five ... your cc\nSupport for Ninety One point five K. R. E. C. comes from our listeners and from local organizations who wanted to reach a discerning audience that values quality\nMarketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop in their business\nSome things that aren't so serious ... structure manual which goes with a song that tells us that he killed ... we're going to listen to all things considered we'll hear the bigger picture every afternoon from NPR News ... afternoons at three thirty Ninety One point five ... your cc\nSupport for Ninety One point five K. R. C. C. comes from our listeners and from local organizations who wants to reach a discerning audience that values quality\nMarketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop in their businesses support their nonprofit\nAnd buy tickets to their shows [noise] to learn more about corporate support and culture now seven one nine four seven or eight year old why\nNow you can tune in to Ninety One point five or six feet without lifting a finger\nJust ask her smarts to be like hey RCs\nProgramming on Ninety One point five three or cc is supported by the cultural office of the pikes peak region inviting listeners celebrate arts month this October by having at least one new cultural experience with family or friends details at ... dot com slash arts month\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when journalist ... went missing two weeks ago Saudi Arabia said it knew nothing about it even though ... was last seen walking into the Saudi consulate in Turkey\nTurkish officials are accusing Saudi Arabia of murdering the journalist who was a vocal critic of the Saudi regime\nNow there are several reports suggesting that Saudi Arabia's leaders may have known more than they lead on meanwhile President Trump dispatch secretary of state Mike Pompeo to Riyadh where he is meeting today with king selmont and with crown prince Mohammed bin Salman\nNPR's Michele Kelemen is on that trip traveling with the secretary and joins us now from Riyadh and I will just no we do have a delay on her line Michelle can you just start by explaining what the Saudis believe happened to ... to show you what are they saying\n\nWell you know officially they've um haven't gone they haven't said anything different when what they've said all along you're hearing sources privately I'm floating some other ideas that he was um\nA interrogated and it was interrogation gone wrong there are lots of different versions of events out there um but what the U.S officials who are travelling\nStart by explaining what the Saudis believe happened to ... to show you what are they saying\n\nWell you know officially they've um haven't gone they haven't said anything different when what they've said all along you're hearing sources privately I'm floating some other ideas that he was um\nA interrogated and it was interrogation gone wrong there are lots of different versions of events out there um but what the U.S officials who are traveling with bump into are saying is look we haven't heard this from\n\n\nThis is NPR News\nHurricane Michael leveled entire community in the water ripping nice homes off their foundations and carrying in some cases hundreds of yards in with\nThe expansion of the damage is mind boggling now after the storm the question is who gets to rebuild and that's what caused that next time on the take away from WNYC NPR I\n\nTake away today the Lebanon am on a Ninety One point five to your cc [noise]\nHi I'm Tim every Sunday evening just show on Monday when when you\nJoined me for a journey through may lead to number vocal was above covered also even seven and a new one point but here's the\nNinety One point five K. R. C. C. is dedicated to covering southern Colorado and the Rocky Mountain west your membership to directly funds are journalism thanks for supporting Ninety One point five K. R. C. C.\nThis election year you can count on not to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsroom we bring you insightful reporting to help you understand the issues and the candidate you make it possible by donating at K. R. C. C. dot org thank you\nProgramming on Ninety One point five K. R. C. C. is supported by the Colorado Springs fine arts center at Colorado College presenting Virgil orgies revolution rise against the invasion reimagining the sixteen eighty Pueblo Revolt five hundred years later on you now Colorado College dot edu slash FCC [noise]\nElection year you can count on not to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsroom we bring you insightful reporting to help you understand the issues and the candidates you make it possible by donating at K. R. C. C. dot org thank you\nProgramming on Ninety One point five through your cc is supported by the Colorado Springs fine arts center at Colorado College resenting Virgil orgies revolution rise against the invasion reimagining the sixteen ... five hundred years later on you know Colorado College dot edu slash FCC\n[noise] the borderlands of southern Colorado electorate series continues October twenty fourth at ... history museum with author Emmy for roads more information on this and other public service announcements on the community counseling care she's done more dream\nSupport for NPR comes from this station and from civility investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more it fidelity dot com slash wealth fidelity brokerage services so I'll see\nFrom the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security health care and science and technology leadership\nBrown dot edu slash NPR\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with emails tablets a drag and drop email editor and twenty four seven customer service Morris campaign monitor dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed rivers into raging torrent wiped out roads and bridges even swept people from their houses in the middle of the night Here's NPR's Eleanor Beardsley\nFlying in a helicopter over the O D river in southeastern France a reporter from the F MTV points out villages Roseanne feels underwater you can see cars and trucks floating like toys in a bass\nThe night Sunday to Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun with sweat from our ground floor room when the floodwaters crashed through the confidence front door her furniture was carried out onto a veranda\nThe nuns body was later found in the trees outside\nFlying in a helicopter over the OED river in southeastern France a reporter from the F MTV points out villages Rosen fields underwater you can see cars and trucks floating like toys in a bass\nDuring the night Sunday Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun was sweat from her ground floor room when the floodwaters crashed through the confidence front door her furniture was carried out onto a veranda\nThe nuns body was later found in the trees outside\nThey sound Ninety nine year old ... with ... such a faith because her bedroom is on the second floor and she spoke on French television again to do young people in one did um if I wanted to come downstairs but water was coming up the staircase so I just went back to bed\nYou said and what else could I Do go ... ... says\nNever in her life had she's seen flooding like this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and fear recede anger is rising\nSo not\nWe weren't given any warning that this group of people meeting with a local\nMayor you couldn't have maybe given us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea or regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these ranges increasing Eric ... is the mayor of ... which lost six people he says they did everything they could\nSue them because I was going on up to the rainfall was three times what it was predicted he says and the sudden violence of these waters wouldn't terrified we're dealing with the dream situations brought on by climate change says ...\nAnd no one can be sufficiently prepared Eleanor Beardsley NPR News Paris [noise]\nFifty years ago at the Nineteen sixty eight Olympic Games in Mexico city track firms anticipated a special you're starting to hundred meter rich\nPeople\nBut it was what happened after that race that was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports or Nineteen sixty nineteenth\n... says ... and no one can be sufficiently prepared Eleanor Beardsley NPR News Paris [noise]\nFifty years ago at the Nineteen sixty eight Olympic Games in Mexico city track fans anticipated especially exciting two hundred meter races [noise]\nField\nBut it was what happened after that race that was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports are Nineteen sixty eight\nNineteen sixty eight was a tumultuous year around the globe and Mexico City was new exception the games began in ... because a few days before the army had opened fire on thousands of students protesting in a city square\nSome reports say as many as three hundred were killed their blood was wash from the streets and the games begin soon after\nIt was in the atmosphere that runner's John Carlos and Tommie Smith came to Mexico City\nThey had a plan that we're going to protest racism and injustice on the world stage in an oral history for the library of Congress John Carlos said he'd met Martin Luther king just before king was killed [noise] king's vision of how effective a non violent Olympic protests could be left a lasting impression\nI wanted to do certain there wouldn't be So Paul ... is an hour and you're still in a while\nAt the games Carlos won a bronze medal for the two hundred Smith a gold setting another world record as they walked to the Olympic podium people notice both of them were carrying their sneakers and wearing black Sox symbols of an impoverished black America\nAs a national anthem played in the last weekend arise Smith and Carlos ... their heads and raise their black gloved fists in the air years later talking to ABC Australia TV Australian Peter Norman the silver medalists to share the podium with Smith and Carlos recalled the moment the rise to um [noise]\nWas a symbol of unity with the news coming together and she was spring [noise]\nIt was never on on believe it was even me as a\nExactly how it was taken by many after a shocked silence the stadium filled with booze the photo of the race this loop was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\nRecall the moment the rise to um [noise]\nSymbol of unity with the news coming together in a civil spring [noise]\nIt was never on on believe it was able to me is just too\nExactly how it was taken by many after a shocked silence the stadium filled with a booth the photo of the race fist theloop was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\nSmith in highly were told to leave the Olympic Village I'm Mexico within forty eight hours they were both stunned by the decision but regarding the composure\nBoth men were stripped of their medals they got hate mail and death threats they were ... for decades in the U.S for their silent gesture many black Americans thought Smith and Carlos were heroes though they're up or is this became a symbol of refusal to give in to racial injustice the precursor to taking a knee\nSan jose State University professor Steven known or teaches African American studies now but he was an undergrad at the school in Nineteen sixty eight he vividly remembers the two runners reception when they came back to campus shortly after Mexico City\nHundreds of students there just as soon as they saw Tommy John walking toward the podium and for the rest of the decade the raised just indicated the unity and the determination and the real appreciation for Smith and Carlos\nBut there was a cost to those principles for years both men struggle to find good jobs their marriages suffered their children were bullied at school\nEmployers shied away from them Smith and Carlos were banned from Olympic participation for life to live with that all the way to go to number added talk at the Los Angeles public library in June John Carlos says he realized he lives in Olympic presence even in his absence\nThey fixed it suits showed up in art work at the games in Munich in Melbourne a huge statue of him and Smith at San jose state is a much visited tourist attraction\nEarlier this year Tommie Smith told DWI news higher authority inspired the moment\nWas finally justified in the meetings of a young black athletes who were hopeful for the Olympic movement\nThe gesture that was so misunderstood in Nineteen sixty eight is now better understood even celebrate it and to designate this\nEven though the audacity award for courage\nStep in art work at the games in Munich and Melbourne a huge statue of him and Smith at San jose state is a much visit a tourist attraction earlier this year Tommie Smith told DWI news higher authority inspired the moment\nWas finally justified in the ... of a young black athletes who were hope for the Olympic movement\nThe gesture that was so misunderstood in Nineteen sixty eight is now better understood even celebrate it and it to designate this\nHappened to the recipient of the audacity of war for her and she joined Carlos and Tommie Smith vindication\nThere's no firm indication that the United states will act against Saudi Arabia for the suspected murder of a journalist but the Saudis may already be paying a price NPR's John Ydstie reports on what it means that businesses are backing away\nAnd twenty sixteen crown prince Mohammed bin Solomon Saudi Arabia's affective ruler invited us and global businesses to a conference he unveiled a plan called vision twenty thirty\nHad called for a transition of the Saudi economy away from oil and toward a more diverse market based model and the crown prince invited the companies to participate\nJacob Kirkegaard of the Peterson Institute for international economics says the ... G of fair is undermining the crown princes vision\nNamely that the world's most advanced than competitive companies come and establish themselves in Saudi Arabia\nThat scenario is fading as the CEOs of large us and global companies one after another announced they will not attend the second vision twenty thirty conference scheduled for next week Jamie diamonds C. E. O. J. P. Morgan Chase has said he wanted to end again Jacob Kierkegaard\nI think the fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the ... disappearance means that many other CEOs will probably put out\nTo other prominent Wall Street CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe ... the allegations along with previous\nLinking it to the ... disappearance means that many other CEOs will probably put out to other prominent Wall Street CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe ... the allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard\nHe said remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and business people detain them at the Ritz Carlton and re ad on corruption charges and force them to pay the government as much as a hundred billion dollars I mean he\nBasically sends the signal that the root of law in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst signal you could possibly send them\nBut Karen young a resident scholar at the American Enterprise Institute says U.S companies who ... the Saudis will likely pay a price because the Saudis will take it personally\nThat decision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn it back on the Saudi Government as a partner will not be forgotten by the Saudi\nYoung says it could be two decades before the Saudis will re engage with these companies young also says us sanctions against the Saudis could be tricky\nThere's lots of Saudi money in us tech real estate and stock market she says and the Saudis on lots of US government bonds not to mention the country's key role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington [noise]\nThis is NPR News\nHurricane Michael leveled entire community pool of water ripping nice homes off their foundations and carrying that in some cases hundreds of yards in with the expansion\nThis is NPR News\nHurricane Michael leveled entire communities pull water ripping me ... all their foundations and carrying in some cases hundreds of yards inland\nThe experience of the damage is mind boggling now after the storm the question is who gets to rebuild and at what cost that's next time on the take away from WNYC NPR I\n\nTake away today to Lebanon am on the one point five to your cc\nNinety One point five K. R. C. C. and Dr Laurie calling have created the legacy find to help thoughtful generous listeners to fill their philanthropic goals of ensuring public radio for future generations please consider the K. R. C. C. legacy find when thinking about your state planning\nYour legacy gift will help Ninety One point five K. R. C. C. provide programming that informs educates entertains ended Rich's southern Colorado for years to come more at K. R. C. C. dot org [noise]\nYes [noise] you can have great music seven nights a week from seven to midnight and Ninety One point five K. R. C. C. [noise]\n\nMemberships or the largest source of funding Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News music thanks for your generous support programming\nOn Ninety One point five K. R. C. C. is supported by Ninety One point five to your see see underwriters thank you for helping to fund southern Colorado's NPR station Ninety One point five years so you see more information on how to underwrite that to your cc dot org\nMartin lives to even think of this was the Berlin Airlift\nFor about a hundred cats were flown out of Florida yesterday Jackson paid for this fly\nSchool stories NPR News music thanks for your generous support programming\nOn Ninety One point five K. R. C. C. is supported by Ninety One point five to your see see underwriters thank you for helping to fund southern Colorado's NPR's vision Ninety One point five years so you see more information on how to underwrite that to your C. C. dot org [noise]\nMorning I'm Steve Inskeep think if this is the Berlin Airlift\nFor about a hundred cats were blown out of Florida yesterday militia Jackson paid for this flight to tackle the Jacksonville Jaguars and as a foundation\nMoving catching kittens out of Florida and made room for cats displaced by hurricane\nMichael and if you think one hundred cats are made in their seats just because the seatbelt light was on you were out of your mind It's MORNING edition\nSupport for NPR comes from the station and from log me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\n[noise] from indeed used by over three million businesses for hiring where employers can post jobs and use screener questions to build their short list of preferred candidates learn more it indeed dot com slash higher and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep\nAnd I'm Rachel Martin it's been a year since the most destructive fire in California history the tubs fire destroyed thousands of homes in northern California now despite the risks some are rebuilding in those very same areas from member station KCUR weedy and NPR's energy and environment team\nLauren Sommer reports it was late at night a year ago when ... was called in to work\n[noise]\nHe's assistant fire marshal in Santa Rosa and the Thomas Fire was moving fast it was\nExploding at a rate that I Would never imagine would occur\nHours later he drove past his neighborhood\nYou couldn't actually make out individual homes in heritage is looked like an entire wall of fire and then realized right away that\nMy house John lowenthal has spent the last year picking up the pieces and a crucial question came up for him and thousands of others should they rebuilt in California wildfire it's a fact of life the Thomas Fire with a repeat of a fire that burned\nHerschel in Santa Rosa and the fire was moving fast\nIt was exploding at a rate that I Would have never imagine would occur\nHours later he drove past his neighborhood\nYou couldn't actually make out individual homes and heritage is looked like an entire wall of fire and then realized right away that\nWhile John ... has spent the last year picking up the pieces\nAnd a crucial question came up for him and thousands of others should they rebuilt and California wildfire it's a fact of life the tops fire with a repeat of a fire that burned the same area more than fifty years ago but ... says the housing market was too tight\nQuite honestly it also added a lot to do with my daughter this is where we were before the fires and the sort of want to be after the fire is\nNow the drywall is just about to go up at his new half\nIt appears it's not really moving as quickly as you'd like it too but yeah you do know that we end in sight\nAnd knowing what he knows about fire he's making sure this home will be better protected with fire resistant materials\nWhich when the roof decide and things of that nature um is definitely a stuff that I wanted to\nBut he doesn't have to take that step California building codes require fire resistant materials if you live in a designated wildfires down\nBut loaned those house wasn't technically in that zone before the fire and neither were almost two thousand other housing units and so far they're still not asked Santa Rosa's director of planning David un about that\nWe don't have a an an extra set of rules or or requirements that we put on people um to to rebuild\nGiven says legally city couldn't change of the building codes overnight and it can't stop people from rebuilding\nWe can go in and take somebody's property and that's not in the role of the city\nPlus the seed housing shortage is even worse now\nWe need to walk and chew gum at the same time we're going to rebuild our communities fasting quickly and efficiently as we possibly can but we also have to build new homes as fast as we can\nHe says the city is trying to entice developers to build downtown but one big project is proposed for the health right where the fire swept through\nSo this is the forty acre parcel or are they wanted to put the two hundred and thirty seven homes the trees all around me are are black and almost all the way to the top as I'm standing there after turning off my recorder a man comes up to me because I'm looking at the sign for the development and said\nI definitely wouldn't want to live there [noise]\nHe didn't want me to record that though\nIn February the city council debated this project\nTo public hearing around ... village project\nSome members light at the town home to the fire resistant\nBut one big project is proposed for the hills right where the fire swept through\nSo this is the forty acre parcel of where they want to put the two hundred and thirty seven homes the trees all around me are are black and almost all the way to the top as I'm standing there after turning off my recorder a man comes up to me because I'm looking at the sign for the development and said\nI definitely wouldn't want to live there [noise]\nYou didn't want me to record that though\nIn February the city council debated this project\nTo public hearing well village project\nSome members like at the town home to be fire resistant Emma create much needed housing but one council member Julie combs had doubts\nPosted for the Booker Prize which we find out about today Thanks so much thank you\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin\nThe threat is clear I'm not denying climate change but try explaining that to President Trump\nYou have to show me the scientist because they have a very big political agenda\nExplaining the facts behind climate change is not enough to convince deniers so what would it take I'm Joshua Johnson a reality check on debating climate change next time on one day [noise]\nThat is coming up this morning at nine o'clock this is\nSouthern Colorado's NPR station K. R. C. C. C. C. H. D. Colorado Springs Kate ISI see law hunter key CCS stark ... W CCF in woodland park streaming at K. R. C. C. dot O. R. G.\nWarmer weather returns today with high is mostly in the forties and fifties sixty degrees for hunter sunny through the day with a chance for snow this evening\nFor Trinidad Raton and ... the news is next it's six o'clock he\nGood morning days after hurricane Michael made landfall in Florida many people have no power while others who were evacuated\nComing up we'll Lawrence reports on live for the Florida Panhandle and I'm Steve Inskeep\nAnd I'm Rachel Martin with us secretary of state like Paul pale in Saudi Arabia today the Saudi regime and the kids have been lots of lean murdering journalist ...\nPresident Trump now says it could be real killers this hour we explore the arms deal between us and a new poll says there are two issues motivating rural American voters this year drug addiction an economy\nThat cover sixteenth actor director Tim Robbins turns ...\nOn the news kept coming up next\nFrom NPR News in Washington ... Coleman rescuers in Florida continue to search for dozens of missing people from hurricane Michael cell phone service is down in large areas and people are still trying to reach missing loved ones the storm killed at least Seventeen people secretary of state Mike Pompeo\nHave a seven and a new poll says there are two issues motivating rural American voters this year drug addiction an economy\nThat covers the actor director Tim Robbins turns\nOn the news kept coming up next\nMine from NPR News in Washington encore but Coleman rescuers in Florida continue to search for dozens of missing people from hurricane Michael cell phone service is down in large areas and people are still trying to reach missing loved ones the storm killed at least Seventeen people\nSecretary of state Mike Pompeo has met Saudi Arabian king ... to discuss missing studying journalist ... who's fear dead the Saudi king has denied knowledge of his faint turkey allegedly ... was murdered when he went into a shouting consulate in eastern bull and never came out\nNPR's Peter Kenyon says Turkish and Saudi investigators have now searched the constantly looking for evidence\nTurkish officials say the nine hours surge involved a collection of samples which will be examined further to constantly search with the Saudis permission and with Saudi investigators in attendance turkey says it also wants to search the consul general's residence and possibly diplomatic vehicles as well the Saudis denied any wrongdoing\nNPR's Peter Kenyon there are media reports suggesting the Saudi Government is considering saying ... died in an interrogation gone wrong NPR has not confirmed these reports\nThe Trump Administration is planning to require drug companies to include the retail price of their medications in television or other consumer ads NPR's Alison Kodjak has more\nHealth and Human Services secretary Alex ... says he'll require drug makers to include retail prices in t._v. advertisements for prescription drugs\nPatients deserve to know what a ... who'd cost when they're being told about the benefits and risks that may have\nUnder the proposed rules companies will have to disclose the monthly list price of any medication costs more than thirty five dollars\nThe pharmaceutical industry is already taking steps to preempt the administration's actions\nThe industry group farmer says it's member companies have agreed to include in their ads information about where consumers can look up of medications price but that plan fall short of actually disclosing retail prices Alison Kodjak NPR News Washington\nTop admissions official will face more questions today as the federal trial over the university admissions policies moves into a second day\nThe list price of any medication that costs more than thirty five dollars\nThe pharmaceutical industry is already taking steps to preempt the administration's actions\nThe industry group farmer says it's member companies have agreed to include in their ads information about where consumers can look up of medications price but that plan fall short of actually disclosing retail prices Alison Kodjak NPR News Washington\nHarvard stop admissions official will face more questions today as the federal trial over the university admissions policies moves into a second day from member station WB you are in Boston carry young reports Harvard is accused of discriminating against Asian American applicants\nDeemed Williams at Simmons is the plaintiffs first witness and the trial attorneys with students for fair admissions their group that filed the lawsuit spent most of Monday asking him questions about the schools recruitment tactics\nThat plaintiffs will question fitzsimmons further today as they continue walking through the details of the schools admissions process including its approach to assessing and applicants character traits\nFormer Harvard president drew Foust and other admissions officials are also expected to testify as the trial goes forward\nCarry young reporting you're listening to NPR\nThe national weather service has issued a flash flood emergency warning for parts of West central Texas and covers eastern Kimball county a region that's already seen deadly flash flooding this month water is currently flowing over parts of interstate ten\nThe UN is warning assigned clone has struck Yemen's strong wind and heavy rain have injured several people and affected families in the war ravaged country the Taliban killed more than twenty four Afghan police and security forces across the country overnight the\nFighting comes just days before Afghanistan holds parliamentary elections and ... reports from Islamabad\nRight is reported that Taliban insurgents attacked security checkpoints into off gone provinces\nOne in the north end another near the capital they killed about two dozen men took out a hostage and sees their weapons\nThe fighting wasn't related to upcoming elections but the Taliban have promised to disrupt that process and the multiple civil tiniest attacks demonstrate the country's vulnerabilities even as politicians an ordinary Afghans to vote\nIt also followed a meeting in Qatar last week between Taliban officials and Washington special envoy for peace in Afghanistan that meeting was meant to pave the way for peace talks to end the country's Seventeen year conflict did date NPR News\nProvinces one in the north end another near the capital\nThey killed about two dozen men took out a hostage and sees that weapons the fighting wasn't related to upcoming elections but the Taliban have permits to disrupt that process and the multiple simultaneous attacks demonstrate the country's vulnerabilities even as politicians ordinary Afghans to vote\nIt also followed a meeting in costs are last week between Taliban officials and Washington special on voice for peace in Afghanistan that meeting was meant to pave the way for peace talks to end the country's Seventeen year conflict ... NPR News Islam about\n... prime minister shoveled his cabinet and women now hold half the seats they include Ethiopia's first female defense minister Ayesha Mohammed most are the prime minister has also set up a new ministry of peace headed by another woman from Ethiopia and house speaker was very I have to come out\nOn corporate Goldman NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future are available where books are sold\nNinety One point five ... is dedicated to covering a changing southern Colorado your membership dollars direct refund our local reporting thank you for your since the membership\nGood morning and ends Tuesday October sixteenth I'm Abigail back then and you're listening to MORNING EDITION on Ninety One point five\nWhat's on people's minds in rural America coming up the results of a new poll that shows opioid an economic issues have people worried that many retain an upbeat outlook about the future of their community that story coming up in this next half hour of MORNING EDITION\nStarting at about six twenty [noise]\nIn woodland park it's twenty three degrees and sunny today with a high of forty four in ... below twenty seven Sunday with the highest fifty three and in Colorado Springs it's twenty nine degrees and high today of forty nine and sunny for Colorado Springs\nNinety One point five K. R. C. C. would like to thank the many businesses\nAnd art lovers that market their products and services on our station each year\nBy choosing Ninety One point five care see see they are investing in our community and\nIn woodland park at twenty three degrees and sunny today with a high end at forty four in Pueblo twenty seven Sunday with the highest fifty three Indian Colorado Springs it's twenty nine degrees a high today of forty nine in sunny for Colorado Springs as well [noise]\nNinety One point five care he would like to thank the many businesses\nAnd art for that market their products and services on our Haitian each year\nLike using Ninety One point five here the the they are investing in our community and we recommend support them in return\nInformation on how to become an underwriter that here's the dot org lasts for four continents seven one nine\nOr eight year old one\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings are fine others no longer to exist and NPR's Quil Lawrence has spent days taking it all in either Quil tasty so what have you been seeing well I mean\nThere were a their trees down everywhere these towering pine trees that are just snapped over at the middle in some of the communities along the water and they've been they've been flat and then I Know people so to say that word or they try to describe it mostly people down here to keep using sort of\nChildren's toys metaphors sayings like a kid swept all the houses off the monopoly board\nOr you know a kid snapped his his toy tree I don't think people can really believe that\nUh that if a win could snap at so keep they keep on trying to reduce it to some metaphor they could understand how how this could just get picked up and move to blocks and flipped over at the point where you can't see\nWhat was the house and what was a vacant lot ... um some of those communities there are people are really asking how can you rebuild that's talking about like Mexico yeah\nThis is NPR News\nOn the next fresh air growing up with an absent mother who was addicted to heroin and raised by grandparents who gain legal custody we talked with Jared J. 'cause Oscar about his new graphic memoir for young adults hey you know how I lost my mother found my ...\nThis is NPR News\nOn the next fresh air growing up with an absent mother who was addicted to heroin and raised by grandparents who gain legal custody Metallica Jared J. 'cause Oscar about his new graphic memoir for young adults hey kiddo\nHow I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also does the lunch\nLadies series China [noise]\nFresh air every weekday at noon on Ninety One point five K. R. C. C. southern Colorado's NPR station\nHappy Tuesday hope you're doing well this morning it is October sixteenth I'm Abigail back then and you're listening to MORNING EDITION environmental groups are hoping that the Democrats will win back the house next month\nWe had environmental allies leading the house of representatives they could do badly needed oversight on the Trump administration's efforts to cater to polluters\nMore on what that sort of oversight might look like coming up in ten minutes that is just after six thirty\nIn West cliff it is sixteen degrees and sunny today with a high of forty six in Trinidad it is twenty seven high of fifty today a chance for snow this evening and into tomorrow and in Colorado Springs me have twenty nine degrees and sunny today was a high of forty nine [noise]\nIt is six Twenty one and this is southern Colorado's NPR station Ninety One point five K. R. C. C. [noise]\nYes [noise] you can have great music seven nights a week from seven to midnight on Ninety One point five K. R. C. C. [noise]\n\n\nSupport for NPR comes from the station and from T. I. A. G. I. A. is committed to helping those who are driven by purpose reached their definition of success investing advice spanking retirement\nI can see the [noise]\n\n\nSupport for NPR comes from the station and from T. I. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more AT T I Am a dot org\n[noise] from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from Tara data working to transform how businesses work through the power of data using pervasive data intelligence ... data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy according to a new poll that is what is on the minds of rural voters that they go to the polls this election season the poll was done by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about the future\nIf you want to picture of the troubles that face some rural communities you can call Brenda a self described homemaker from the heart of Appalachia she fifty seven and married to a former coal miner\nAnd his ... black lung and having a real hard time going down for him to commit anyway\nAnd drug addiction has hit her family especially her two grand sons hard\nMy daughter and her husband um got a son and walked off color\nBecause they couldn't give up his truck\nHe's still alive but some of her other relatives aren't including her niece\nThat found her in her home a lie [noise] the timber\n[noise] [noise]\nShe was thirty three years old she left behind three boys\nNPR is not using her last name to shield her grandchildren lived in ... Virginia a town of about too\n... ...\nAnd he walked off color because they couldn't give up his truck I guess\nHe's still alive but some of our other relatives aren't including her niece\nThat found her in her home a lie [noise] September\n[noise] [noise]\nShe was thirty three years old is she left behind three boys\nBrenda NPR's not using her last name to shield her grandchildren lifting Coburn Virginia a town of about two thousand people near the point where Virginia Beach Kentucky and Tennessee\nHer experience fits into the findings are new poll which shows that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis when we asked if they personally know someone who struggled with addiction forty nine percent said yes Brenda said it's worse in her community\nIf he were to approach\nCan family randomly and give them a piece of paper and have you had someone in your immediate family on the road I out of hand would say yes\nBrenda says in Coburn jobs and opportunities of dried up state officials have been promising to bring an economic development but none of it has reached her community yet\nIf you come out of college with a degree or more than likely going to leave this area to find work\nBut experiences in rural America very widely in our poll bears that out the survey of Thirteen hundred adults all living in rural areas should that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done the pulled them out of these economic problems they face\nLost some rural communities are suffering others are thriving says Christopher Thor and burn the founder of beacon economics in Los Angeles\nMight have a cold town and an oil town or the cold on his doing terrible because coal can't compete in this era of cheap natural gas on the other hand because of fracking these rural communities sitting on ... oil are booming and incomes are up dramatically\nChan School directed our poll there are optimistic about about the future and they're also optimistic that things can be done to pull them out of these economic problems they face\nLast summer all communities are suffering others are thriving says Christopher thorn burn the founder of beacon economics in Los Angeles\nWho might have a cold town and an oil town well the whole town is doing terrible because coal can compete in this era of cheap natural gas\nOn the other hand because of fracking these rural community sitting on shale oil are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between Jackson and Memphis, Tennessee is doing well says it killed\nPowell alone hum overtone\nPalestine twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but its economy is growing\nIt's almost like a turban on this starting to expand fall and bigger restaurants are being put her now within the past two years we are really the village\nAnd Brenda says she's seen flickers of hoping Coburn the town's high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids around three way bottom one of them it was twenty six hundred dollars we ... the white wearing all in one year so there's good people hard working people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kojak NPR News\nThe Milwaukee Brewers hold two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win the series and Dodgers fans will insist on the if\nIf they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\nThat is the voice of Bob euchre one of baseball's great voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do is playing career started dairy and sixty too\nLong ago euchre started and had were an usher removes him from his good seat at a ballgame must be on the front row euchre says only to be taken back to the cheapest of cheap seats high up up up\nOne man is celebrating already\nThat is the voice of ... one of baseball's great voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do is playing career started there in sixty too\nLong ago euchre starred in an ad were an usher removed him from his good seated a ball game must be on the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble\nCatching you want to explain to Johnny Carson his technique for handling the knuckleball\nYou just where the catch was to wait until it stopped rolling and just pick it up\n[laughter] it was like ability or number role as a play by play announcer in the film major league in his most famous line of the movie he fades to the radio audience about a wild pitch that misses the strikes down by about a city block\nThe sun this\nSeason though he's been enjoying real brewers success\nThere's video of him in the locker room after one of the teams biggest wins the players crowd around him this man in his eighties dumping beer on his head court here he is reacting tweet Fox Sports Wisconsin for\nMore than any what\nMakes him seem\nWell they're all they're always there is no I wasn't here and [noise] I mean to be treated me treated like one on one of them all the time I think that special for me\nRemember there is no high in euchre Bob ... Milwaukee Brewers face off against the Dodgers once again tonight in Los Angeles\n\n\nYear Mendocino Complex fire in northern California and now the largest in state history already\nThree million people at risk for extreme heat heat index is Hurricane Florence is already making his presence along the Carolina coast\nNo none of us has pushed the environment over issues like health care or immigration in the minds of most voters but it does make for easy messaging in states where the effects of climate change are already being felt [noise]\nThe environment is not typically a top of ticket issue for voters but this has not been a typical\nYear Mendocino Complex fire in northern California and now the largest in state history already\nThree million people at risk for extreme heat heat index is Hurricane Florence is already making his presence felt along the Carolina coast\nNo none of this push the environment over issues like health care or immigration in the minds of most voters but it does make for easy messaging in states where the effects of climate change are already being felt\nCue the role of raging wildfires\nTo getting hotter but won't fire and smoke chokes are air dinner warmonger is radically opposed the effort to fight climate change global warming is a fraud\nAds like this have been appearing throughout California Florida and in swing districts across the country targeting Republican lawmakers it's part of a multimillion dollar effort by the league of conservation voters to flip the house Democrats Tiernan sit and failed is a vice president with a conservation group\nIf we had our allies leading the house of representatives they could do badly needed oversight on the ... efforts to cater to the leaders every day over our communities\nThat word oversight is when you hear a lot from Democrats in part because there's not a whole lot else they can do most of the role backs and environmental policy are happening in the executive branch under Trump appointees a shift in house leadership won't change that\nDemocrats can't force interior secretary Ryan Zinke you to restore Bears Ears national monument for example or to crack down on methane emissions but they can force him to explain himself\nArizona congressman role ... is the ranking Democrat on the house natural resources committee\nI Want to change the narrative of this whole thing where the Resources Committee is not just the past of part of the Trump Administration that they're independent and that they have responsibility as co equals for oversight and accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a setback for the administration\nAnd they would be able to tighten up mercilessly so that they would kinda be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here's Colorado congresswoman Diane and to get the ranking Democrat on the oversight committee for energy and commerce\nThink he will be ... investigations\nAnd accountability translation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a setback for the administration\nAnd they will be able to tighten up mercilessly so that they\nKinda be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here's Colorado congresswoman Diane and to get the ranking Democrat on the oversight committee for energy and commerce\nI think you will be seeing investigations in hearings around the methane rule they clean power plant in the car rules you're going to be seeing us look more in debt\nConflicts of interest in corruption at the EPA\nAnd the list goes on to get says this year's midterms reminder of what happened in two thousand six when Democrats took back the house under President George W. Bush for the following two years Democrats called hearings and investigations and crafted legislation that they knew would not passed under Republican president\nBut that when President Obama was elected in two thousand eight we were able to move up Rebecca legislative agenda because we had spent the last two years developing it\nNo of course Republicans could keep their majority in Congress which would mean continued support for the administration's deregulatory agenda Nathan Rott NPR News\nAnd later today on all things considered the outcome of the mid term elections could also have a major effect on the future of us health policy can listen to that\nStory by asking your smart speaker to play NPR or your local member station\nIn that local member station in Ninety One point five\nThis is NPR News the Ninety\nColorado Springs cool Science Festival is a celebration of all things steam science technology engineering and math dozens of special events to various venues throughout the region October Thirteen to twenty\nInformation that came from the data weren't gee\nHurricane Michael leveled entire communities for water ripping nice homes off their foundations\nAnd carrying that in some cases hundreds of yards in with the expansion of the damage is mind boggling now after the storm the question is who gets to rebuild and that's what caused that next time on the take away from WNYC NPR I\nInto the take away this morning at eleven o'clock followed by fresh\nDozens of special events very has been used to be free cannot do research in the audience\nFrom Asia to care since he died or G.\nHurricane Michael leveled entire communities pull water ripping nice homes all their foundations and carrying in some cases hundreds of yards inland\nThe experience of the damage is mind boggling now after the storm the question is who gets to rebuild and at what cost that's next time on the take away from WNYC NPR I\nTune into the take away this morning at eleven o'clock solid buy fresh air at new I'm Abigail Batman thanks for tuning into Ninety One point five K. R. C. C. for MORNING EDITION it is Tuesday October sixteenth [noise]\nComing up on the marketplace morning report Canadians will be able to buy canvas legally online starting tomorrow how our our neighbors to the north rolling out legalized marijuana that plus all the morning's business news coming up at six fifty one on the marketplace morning report [noise]\nAnd ... it is sixteen degrees and sunny today with a high of forty seven and a tone it's Twenty one sunny a high a forty three a chance for snow this evening and in Colorado Springs it's twenty nine degrees sunny in a high of forty nine\nNPR on Ninety One point five through your cc is supported locally Bush ... offering herbal formula is prepared on site so chose winter rescue OSHA honey and Ella Barry syrup which all balance the respiratory system consultations and plus is available at twenty seven twenty seven north stayed home\nWith a law firm of shook shocked and Gorman reminding listeners to Chuck batteries and carbon monoxide detectors for twelve years handling claims for those suffering from exposure to carbon monoxide more at ... dot com and\nRachel Martin the U.S embassy in Australia sent a bizarre email the other day it looked like an invitation to a meeting with an R in ...\nKnow it was this little annoying how we're planning back holding a plate of chocolate chip cookies wearing a blue cookie monster costume the caption beneath\nRed cat pajama jam or U.S officials sent out an apology and yet the invitation was fake but based on my Twitter feed the world's craving for a cat's pajamas jammed is very real that's going to get\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller is working\nWith an art ...\nKnow is this ... lining back later chocolate chip cookies wearing a blue cookie monster costume the caption\nBeneath red cat pajama jam us official sent out an apology and yet the invitation was fake but based on my Twitter feed the world's craving for a cat pajama jammed is very real that's wanting it\nSupport for NPR comes from this station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work in food health power jobs and resilient cities at rock sound dot org\nAnd from F Jaycee a foundation of donor advised funds working to maximize the impact of charitable giving and to create customized philanthropic solutions learned more it F. J. C. dot org\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep this story starts with a quiz here's your quiz master ...\nIt comes from political scientist John ... at the University of Nebraska he's going to describe two towns and you have to guess which one is liberal and which is conservative here's ten number one\nThe schools would stress you know patriotism and respect and it would be a very rules based uh educational system but how is this would be fairly similar the lawns would be a very nicely kept in a beautifully green and mode of the town of be quiet with lots of churches\nAll right and here is ten number two\nThe schools would be based more on experience are all kinds of things rather than than rote memory people would prefer older houses with wooden floors or rather than wall to wall carpeting um they would keep the yards natural um lots of bars and community theaters and foreign films are more of those than churches\nThis quiz was probably pretty easy for you and to explain why we're joined now by NPR's social science correspondent Shankar Vedantam Hi Shankar I Know so the first time I'm guessing was conservative and the second one with liberal right\nNo hitting is drawing on fairly traditional stereotypes about liberals and conservatives\nConservatives prefer order and rules liberals prefer exponential schools and community theaters now those are stereotypes which means that they're going to be liberals who hate community theaters and conservatives who despised churches but the question that hitting and others are asking is\nHow companies stereotypes are so often accurate if being liberal and conservative is ...\nPR social science correspondent Shankar Vedantam Hi Shankar I Know so the first time I'm guessing was conservative and the second one was liberal right\nExactly not hitting is drawing on fairly traditional stereotypes about liberals and conservatives\nConservatives prefer order and rules liberals prefer experiential schools and community theaters now those are stereotypes which means that they're going to be liberals who hate community theaters and conservatives who despised churches but the question that hitting and others are asking is how companies stereotypes are so often accurate\nIf being liberal and conservative is all about our political views how companies labels describe all kinds of other things about us from the kinds of food we prefer to eat to the kinds of poetry we laugh\nTo where we want to hang out so he is arguing that our political views spring from something deeper than just our beliefs about big government or small government\nPrecisely he's arguing that our political preferences at least in part\nCompromise psychological and biological predispositions\nThe most compelling evidence for this comes from studies involving large numbers of twins some of whom are identical and some of whom are fraternal identical twins share the same genes fraternal twins share fewer genes\nIdentical twins to not to have more political preferences in common than fraternal twins do even though each ... presumably share the same family and upbringing\nHeight for example turns out to be about eighty percent a heritable when you're subject to the same kind of design personality traits are about fifty six percent political views thirty to forty percent\nThirty to forty percent so he's saying some part of our political beliefs come from biology\nYes and of course that conclusion upset a lot of people\nAnd they tended to over interpret those results and make it sound like we were saying that everything was was genetic but you know if it's thirty four percent genetic that obviously is you know fifty sixty Seventy percent that comes from the environment so all we're saying is that that genetic component is not in zero but apparently that was enough that that some people were upset about that\nWhat he and his colleagues are saying is that biology and psychology play a role in our political preferences snow all liberals and conservatives in the United states often accused one another or stupidity or malice but it's ... and his colleagues I'll write one reason we might not see the world the same way is because we simply not lie at the same way\nPlay a role in our political preferences snow all liberals and conservatives in the United states often accused one another or stupidity or malice but if hoping and his colleagues alright one reason we might not see the world the same way is because we simply not why at the same way that is a nice way of looking at it indeed offer some compassion for the other side\nAbout the environment democracy and critiques of the economy most recently Allen funded a forty six million dollar building near Seattle for low income and homeless people\nIn New York I'm David Brancaccio with the marketplace morning\nFrom eight PM American public media\nThe threat is clear I'm not denying climate change but try explaining that to President Trump\nHave to show me the scientist because they have a very big political agenda\nIn New York I'm David Brancaccio with the marketplace more important\nFrom eight PM American public media\nThe threat is clear I'm not denying climate change but try explaining that to President Trump\nYou'd have to show me the scientist because they have a very big political agenda\nExplaining the facts behind climate change is not enough to convince deniers so what would it take I'm Joshua Johnson a reality check on debating climate change next time on one thing\nThat this morning at nine o'clock and this is a southern Colorado was NPR station care cc here C. C. H. D. Colorado Springs Kate ISI the la hunter\nKey CCS stark veil and K W C. C. F. M. woodland park streaming at K. R. C. C. dot O. R. G. should be sunny today a bit warmer with high mostly in the forties and fifties\nSimilar weather is expected for most of the region tomorrow Trinidad Raton in light of will see a chance for snow this evening and into Wednesday the news is next it's seven o'clock\nThis morning secretary of state Mike Pompeo hail me to the leader suspected of having a journalist Kelly the chief diplomat is meeting Saudi Arabia's king and ... It's MORNING EDITION from NPR News\nComing up how the reaction to Jamal because she'll genes disappearance is threatening Saudi business I'm Rachel Martin\nAnd I'm Steve Inskeep drug makers face a demand to dispose more information the Trump Administration wants to put the list prices of drugs and the un has also what happened with France received three months of rain there two hours we have a story of protests during the national anthem to Olympic athletes lost their medals for raising\nTheir fist fifty years ago and I do\nIt's Tuesday October sixteen the singer John mayors\nAnd the new shoes next\nFrom NPR News in Washington encore but Coleman the official death toll from last week's hurricane Michael is Seventeen people but as NPR's Quil Lawrence\nThe Trump Administration wants them to put the list prices of their drugs and have also what happened with France received three months of rain in two hours we have a story of protests during the national anthem to Olympic athletes who lost their medals\nFor raising their fifty years ago and I do\nIt's Tuesday October sixteen the singer John mayors\nAnd the new says next\nLive from NPR News in Washington encore but Coleman the official death toll from last week's hurricane Michael is Seventeen people but as NPR's Quil Lawrence reports the number of missing is believed to be much higher\nHundreds of people who said they were going to ride out the storm may have actually fled inland as the warnings suddenly got worse last week and since then cell phone service and access to Internet has been so bad that family members haven't been able to reconnect if you do have a signal calling someone within the storm's path sounds like this\nThat particular busy signal was from the police department and the town of Mexico beach a place you might normally ask about whether someone has been reported missing were found not to have survived\nA cell phone towers or repaired and electricity is restored the number of people reported missing and feared dead is expected to rise Quil Lawrence NPR News Miramar Beach Florida\nTurkish and Saudi investigators search that Saudi Arabian consulate in Istanbul Monday Night collecting samples for examination NPR's Peter Kenyon reports pressure is growing for an explanation of the disappearance of a journalist who entered the constantly on October second\nNearly two weeks after journalist and government critic Jim ... G disappeared after entering the consulate Turkish investigators searched the premises along with Saudi investigators\nThe journalists family issued a statement calling for an independent international investigation President Trump's mention of rogue killers possibly being involved prompted analysts wonder if an effort is under way to insulate Saudi crown prince Mohammed bin ... from the controversy\nMultiple US News outlets report the Saudis are considering a new explanation that ... died accidentally well being questioned Turkish investigators have said they have evidence he was murdered Peter Kenyon NPR News Istanbul\nSecretary of state Mike Pompeo is in Riyadh Saudi Arabia and has meant the Saudi king about ... case the Saudi king has insisted he has no knowledge of the journalist faint\nA federal judge has dismissed a lawsuit against President Trump by adult film actress Stormy Daniels as NPR's Jessica Taylor reports\nSee multiple US News outlets report the Saudis are considering a new explanation that ... died accidentally well being questioned Turkish investigators have said they have evidence he was murdered Peter Kenyon NPR News Istanbul\nMeanwhile secretary of state Mike Pompeo is in Riyadh Saudi Arabia and has meant the Saudi king about ... case the Saudi king has insisted he has no knowledge of the journalists paint\nA federal judge has dismissed a lawsuit against President Trump by adult film actress Stormy Daniels as NPR's Jessica Taylor report Daniels claimed the president defame her earlier this year on Twitter\nDino sued over its week Trump sent in April ... was lying about being threatened in twenty eleven not to go public with her story of an alleged sexual encounter with Trump which the president has denied\nBut in his ruling the federal judge wrote that the tweet constitutes rhetorical hyperbole normally associated with politics and public discourse in the U.S that is protected by the first amendment NPR's\nJessica tailor the judges ordering Daniels to pay the presidents attorneys means\nThe co founder of Microsoft Paul Allen has died his company Vulcan ... says he died Monday in Seattle of non Hodgkin's lymphoma he was sixty five Alan was also a philanthropist tech investor and owner of several sports teams such as the Seattle Seahawks and Portland TrailBlazers\nYou're listening to NPR News\nIt's seven oh four I'm Abigail that come in with Ninety One point five K. R. C. C. news\nThe University of Colorado Colorado Springs is set to break ground soon on a new sixty one million dollar facility dedicated to sports medicine and performance as Ninety One point five ... Jake Brown our reports the handle center is one of several projects included in the Colorado Springs city for champions initiative\nThe new one hundred and four thousand square foot complex will ... research and classes as well as a clinic operated by center a health university spokesman cheered Vernor says the new facility will enable researchers and doctors to collaborate on treatments for everyone from high performance athletes to people with chronic diseases\nOr looking to really make this a one of the kinds center in the nation to be able to uh look that wide range or in for that academic experience for students as well\nThe center is receiving sixteen million dollars from the ... economic development corporation as part of the city for champions project which also includes funding for the Olympic Museum and other developments heavy construction on the table center is set to begin\nSpokesman cheered Vernor says the new facility will enable researchers and doctors to collaborate on treatments for everyone from high performance athletes to people with chronic diseases\nOr looking to really make the say one of the kinds center and the nation to be able to uh look that wide range or in for that academic experience for students as well\nThe center is receiving sixteen million dollars from the ... economic development corporation as part of the city for champions project\nWhich also includes funding for the Olympic Museum and other developments heavy construction on the ... center is set to begin later this fall and is expected to be done by twenty twenty for Ninety One point five ... news object bronco\nTwo communities solar gardens are now complete in southern Colorado Black Hills energy held a ribbon cutting yesterday to celebrate a five hundred kilowatt in garden in rocky Ford the utility also has a two megawatt facility and Ord way\nAccording to a press release the projects will provide clean energy to local housing authorities schools community colleges and city governments this is Ninety One point five K. R. C. C. news\nSupport for NPR comes from ... a meal could companies that delivers semi perhaps meals to be finished at home in Fifteen minutes would the one paying double sous chefs do the prep work like shopping and marinating this week's menu is at ... dot com slash NPR and Americans for the arts\nNinety One point five care cc is on Facebook and Twitter you'll find news headlines local stories station events canned announcements signed us and follow us on Facebook and Twitter K. R. C. C.\nGood morning I'm Abigail back then hope you're having a wonderful Tuesday it is October sixteenth you're listening to MORNING EDITION on southern Colorado's NPR station Ninety One point five K. R. C. C. [noise]\nAt the Nineteen sixty eight Olympics in Mexico city track fans anticipated and especially exciting two hundred meter race\nBut it was what happened after that became memorable coming up Karen Grigsby Bates of our Code Switch team has the story from the Nineteen sixty eight theories that story is coming up just about seven twenty [noise]\nProgramming on Ninety One point five ... or cc is supported by who gives ... Center for carrying a mix of new and used arts and crafts supplies scrap booking favorite game pieces books and more now with their new location borrowed twenty west Colorado gives us\nRace but it was what happened after that became memorable coming up Karen Grigsby Bates of our Code Switch team has the story from the Nineteen sixty eight series that story is coming up just about seven twenty [noise]\nProgramming on Monday one point five ... or so you see is supported\nBy who gives ... sooner Bruce lured during a mix of new and used arts and crafts supplies scrap booking ... books and more now with the new location foreign twenty west Colorado Springs Colorado dot com\nBust roast coffee bringing Dermot coffee roasted with solar power from ... supersymmetric grocers state wide and to sprout stores throughout the country so roasted low temperature to help create coffee disabled shoulder rose dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when journalist ... went missing two weeks ago Saudi Arabia said it knew nothing about it even though 'cause she'll gee was last seen walking into the Saudi consulate in Turkey\nTurkish officials are accusing Saudi Arabia of murdering the journalist who was a vocal critic of the Saudi regime\nNow there are several reports suggesting that Saudi Arabia's leaders may have known more than they let on meanwhile President Trump dispatch secretary of state Mike Pompeo to Riyadh where he's meeting today with king selmont and with crown prince Mohammed bin Salman\nNPR's Michele Kelemen is on that trip traveling with secretary and joins us now from Riyadh Michelle can you just start by explaining what the Saudis believe happened to ... to show you what are they saying\nWell you know officially they haven't said anything different when what they've said all along or hearing sources privately I'm floating some other ideas that he was um\nA interrogated and it was interrogation gone wrong there are lots of different versions of events out there um but what the U.S officials who were traveling with bombs are saying is look we haven't heard that from\nUm them directly we're waiting for these meetings we want to hear what they say face to face and that's what I'm secretary Pompeo is doing here they've been very tight lipped about what they think about um this changing storyline that seems to be happening from from the Saudis\nBut they are saying is look we haven't heard that from um them directly we're waiting for these meetings we want to hear what they say face to face and that's what I'm secretary Pompeo is doing here they've been very tight lipped about what they think about um this changing storyline that seems to be happening from the from the Saudis\nThat enthusiasm followed him in everything he did in a statement his sister Jody Allen said my brother was a remarkable individual on every level for NPR News I'm Simone ... in Seattle\nIt's MORNING EDITION from NPR News\nNext fresh air growing up with an absent mother who was addicted to heroin and raised by grandparents who gain legal custody\nOn the next fresh air growing up with an absent mother who was addicted to heroin\nAnd raised by grandparents who gain legal custody but talk with Jared J. 'cause Oscar about his new graphic memoir for young adults hey kiddo how I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also does the lunch ladies\nSeries join us [noise]\nYou can catch fresh air today at noon on Ninety One point five K. R. D. C.\nAnd you can also listen at any time on our free mobile apps it's available in the eye tune store or at Google Play just search for K. R. C. C.\nStill to come on MORNING EDITION should TV drug ads be forced to include a price President Trump's team says yes that story ahead at seven thirty\n\nIn woodland park it is twenty three degrees and sunny today was the highest forty four in Trinidad its twenty seven sunny a high of fifty and a chance for snow this evening and into tomorrow and in Colorado Springs it's twenty nine degrees and sunny today a high of forty nine\n\nIt's seven Twenty one and you're listening to MORNING EDITION on southern Colorado the NPR station Ninety One point five K. R. C. C.\nMm\nOh Charlie Rose all the host of marketplace my very first car was in Nineteen Seventy one was for forty two conflicts with red white and blue top one about a thousand miles an hour and a streamlined and I love\nTalk sadly I grew up in LA driving many\nDrone your car into the programs you love your show\nOr donation information or ... or\n\nSupport for NPR comes from the station and from PBS with eugenics crusade American Experience ...\nThe very first car was in Nineteen Seventy one was for forty two can read how to white convertible top one about a thousand miles an hour to streamline man I Love\nPoem sadly I grew up [noise] and now I drive a mini\nDuring your car into the programs you love your show\nGr donation information or to your cc ...\n\nSupport for NPR comes from this station and from PBS with the eugenics crusade American Experience explores the history of the early twentieth century campaign to breed a better American race eugenics crusade tonight at nine eastern on PBS\nFrom west in hotels and resorts Weston is committed to the wellbeing of travelers with offerings like heavenly beds a super foods are ex menu and gear lending for one workout years left behind at home west and let's rise learn more western dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more at Raymond James dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed rivers into raging torrent wiped out roads and bridges\nEven swept people from their houses in the middle of the night Here's NPR's Eleanor Beardsley\nFlying in a helicopter over the old river in southeastern France a reporter from the F MTV points out villages Rosetta feels underwater you can see cars and trucks floating like toys in a bass\nDuring the night Sunday to Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun with sweat from our ground floor room when the floodwaters crashed through the convent front door her furniture was carried out onto a veranda\nThe nuns body was later found in the trees outside\nMovie they sound Ninety nine year old ... look on her bedroom is on the second floor she spoke on French television again do you do ... I wanted to come downstairs but water was coming up the staircase so I just went back to bed\nYou said you know what else could I Do go on ...\nI had an eighty eight year old nun was swept from her ground floor room when the floodwaters crashed through the convent front door her furniture was carried out onto a veranda the nuns body was later found in the trees outside\nMovie they sound Ninety nine year old ... such a fate look on her bedroom is on the second floor and she spoke on French television again to do now but it was just ... I wanted to come downstairs but water was coming up the staircase so I just went back to bed\nYou said and what else could I Do go I'm new to me how many how many ... says\nNever in her life had she's seen flooding like this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and fear recede anger is rising\nI mean\nWe weren't given any warning that this group of people meeting with a local\nMayor you couldn't have maybe given us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea our regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these ranges increasing Eric ... is the mayor of habit which lost six people he says they did everything they could\nSue them little nuclear program going on up to the rainfall was three times what it was ... he says and the sudden violence of these waters wouldn't terrifying we're dealing with the dream situations brought on by climate change says ...\nAnd no one can be sufficiently prepared Eleanor Beardsley NPR News Paris\n[noise]\nFifty years ago at the Nineteen sixty eight Olympic Games in Mexico city track firms anticipated especially you're starting to hundred meter rich\n\nBut it was what happened after the race that was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports or Nineteen sixty year\nNineteen sixty eight was a tumultuous year around the globe and Mexico City was new exception the games began in ... because a few days before the army had opened fire on thousands of students protesting in a city square\nSome reports say as many as three hundred were killed their blood was washed from the streets and the games begin soon after\nThe Olympic [noise]\nBut it was what happened after that race that was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports on Nineteen sixty eight\nNineteen sixty eight was a tumultuous year around the globe and Mexico City was no exception the games began in ... because a few days before the army had opened fire on thousands of students protesting in a city square\nSome reports say as many as three hundred were killed their blood was wash from the streets and the games begin soon after\nIt was in the atmosphere that runner's John Carlos and Tommie Smith came to Mexico City\nThey had a plan that we're going to protest racism and injustice on the world stage in an oral history for the library of Congress John Carlos said he'd met Martin Luther king just before king was killed [noise] king's vision of how effective a non violent Olympic protest could be lifted a lasting impression\nI Want to do and there would be so powerful\nThat were raised and you're the stew ...\nAt the games Carlos won a bronze medal for the two hundred Smith a gold setting another world record as they walked to the Olympic podium people notice both of them were carrying their sneakers and wearing black Sox symbols of an impoverished black America\nAs a national anthem played in the flags began to rise Smith and Carlos ... their heads and raise their black gloved fists in the air\nYears later talking to ABC Australia TV Australian Peter Norman the silver medalists to share the podium what Smith and Carlos recalled the moment the rise to um [noise]\nWas a symbol of new things coming together and assume was spring [noise]\nIt was never on what was it was even made\nExactly how it was taken by many aftershocks silence the stadium filled with booze the photo of the race vis a loop was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\nSmith and highly we're going to leave the Olympic Village I'm Mexico within forty eight hours they were ... the decision but regarding the composure\nBoth men were stripped of their medals they got hate mail in death threats they were ... for decades in the U.S for their silent gesture many black Americans thought Smith and Carlos were heroes though there are braced this became is\nAfter a shocked silence the stadium filled with booze the photo of the race fist theloop was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\nSmith and highly we're going to leave the Olympic Village and Mexico within forty eight hours they were both stunned by the decision but regarding their composure\nBoth men were stripped of their medals they got hate mail and death threats they were showing for decades in the U.S for their silent gesture many black Americans thought Smith and Carlos were heroes though they're up or is this became a symbol of refusal to give in to racial injustice the precursor to taking a knee\nSan jose State University professor Steven ... teaches African American studies now but he was an undergrad at the school in Nineteen sixty eight he vividly remembers the two runners reception when they came back to campus shortly after Mexico City\nHundreds of students there soon as they saw Tommy John walking toward the podium and for the rest of the decade the raised indicated the unity and the determination and the real appreciation for Smith and Carlos\nBut there was a cost to those principles for years both men struggle to find good jobs their marriages suffered their children were bullied at school\nEmployers shied away from them Smith and Carlos were banned from Olympic participation for life to live with that I don't have to go to number added talk at the Los Angeles public library in June John Carlos says he realized he was an Olympic presence even in his absence\nThey're fisted salute showed up in art work at the games in Munich and Melbourne a huge statue of him and Smith at San jose state as much visited tourist attraction\nEarlier this year Tommie Smith told DWI news higher authority inspired the moment\nWas finally justified in the meetings of a young black athletes who were hopeful for the Olympic movement\nThe gesture that was so misunderstood in Nineteen sixty eight is now better understood even celebrated an end to designate this half\nThe recipient of the ash award for courage and tell his\nThe gesture that was so misunderstood in Nineteen sixty eight is now better understood even celebrate it and it to designate this happened\nRecently is that the astronauts encourage joined Carlos and Tommie Smith\nThere is no firm indication that the United states will act or go Saudi Arabia for the suspected murder of a journalist but the Saudis may already be paying a price NPR's John Ydstie reports on what it means the businesses are backing away\nIn twenty sixteen crown prince Mohammed bin showman Saudi Arabia's affective ruler invited\nThere is no firm indication that the United states will act against Saudi Arabia for the suspected murder of a journalist but the Saudis may already be paying a price NPR's John Ydstie reports on what it means that businesses are backing away\nAnd twenty sixteen crown prince Mohammed bin Solomon Saudi Arabia's affective ruler invited us and global businesses to a conference he unveiled a plan called vision twenty thirty\nHad called for a transition of the Saudi economy away from oil and toward a more diverse market based model and the crown prince invited the companies to participate\nJacob Kirkegaard of the Peterson Institute for international economics says the ... G A fair is undermining the crown princes vision\nNamely that the world's most advanced than competitive companies come and establish themselves in Saudi Arabia\nThat scenario is fading as the CEOs of large us and global companies one after another announced they will not attend the second vision twenty thirty conference scheduled for next week Jamie diamonds C. E. O. J. P. Morgan Chase has said he wanted to end again Jacob Kierkegaard\nI think the fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the show the disappearance means that many other CEOs will probably put out\nTo other prominent Wall Street CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe ... the allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard\nHe said remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and businesspeople detained them at the Ritz Carlton in Riyadh on corruption charges and force them to pay the government as much as a hundred billion dollars\nThey used to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe ... the allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard\nHe says remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and businesspeople detained them at the Ritz Carlton and re odd on corruption charges and force them to pay the government as much as a hundred billion dollars I mean he\nBasically sending the signal that the rule of law in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst signal you could possibly send\nThem but Karen young a resident scholar at the American Enterprise Institute says U.S companies who snow but the Saudis will likely pay a price because the Saudis will take it personally\nThat decision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn its back on the Saudi Government as a partner will not be forgotten by the Saudis\nYoung says it could be two decades before the Saudis will re engage with these companies young also says us sanctions against the Saudis could be tricky\nThere's lots of Saudi money in us tech real estate and stock market she says and the Saudis on lots of US government bonds not to mention the country's key role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington [noise]\nThis is NPR News\nA variety of free legal resources will be available at the El Paso county combined courthouse on leaking resource day over twenty six more information on this and other public service announcements\nOn the community counter ...\nHurricane Michael leveled entire communities water ripping nice homes off their foundations and carrying in some cases hundreds of yards in with the expansion of the damage is mind boggling now after the storm the question is who gets to rebuild and at what cost that ...\nA variety of free legal resources will be available at the El Paso county combined courthouse on legal resource day over twenty six more information on this and other public service announcements on the community counterweight ...\nHurricane Michael leveled entire communities the water ripping nice homes off their foundations\nAnd carrying and in some cases hundreds of yards in with the expansion of the damage is mind boggling now after the storm the question is who gets to rebuild and that's what caused that next time on the take away from WNYC NPR I [noise] you can catch the take away this morning at eleven o'clock on\nNinety One point five K. R. C. C. it is it seven forty four you are listening to MORNING EDITION I'm Abigail black men\nComing up and about eight minutes later today we'll find out who receives the man Booker Prize for fiction Steve ... keeps Inskeep talks to author se editor John about her novel Washington Black which made the short list for the price that stories coming up at seven fifty one [noise]\nIn the universe to it is sixteen degrees and sunny with a high of forty seven today in Raton it's Twenty one sunny a high a forty three a chance for snow this evening and in Colorado Springs it's twenty nine degrees and sunny and high of forty nine today\nProgramming on Ninety One point five K. R. C. C. is supported by Jackson Greek senior living monument offering independent living assisted living in memory care residents was designed for many lifestyle choices wellness programs tailored activities in more now scheduling tours more at Jackson creek senior living dot com\nBuy into credit union and business banking is committed to comprehensive solutions to help solve small business challenges including business trucking details that ended dot com slash business judging federally insured by in the usa [noise]\nMorning I'm Steve as you think of this is the Berlin Airlift\nFor about a hundred cats were blown out of Florida yesterday militia\nJackson paid for this flight offensive tackle for the Jacksonville Jaguars and as a foundation\nMoving catching kittens out of Florida made room for cats this place by hurricane\nMichael and if you think one hundred cats are made in their seats just because the seatbelt like was on you were out of your mind It's MORNING edition\nSupport for NPR comes from this station\nCausing her neck and brings me a little girl and editor other looking like lord bastards you know they're all like breaking hard\nBurlingame says the photos are meant to serve as a reminder we've always been here we meaning clear people in here meaning Wyoming Burlingame moved to the state Twenty years ago this fall\nWe moved here in August and Matthews body was found Tobar\nShe's talking about ... shepherd he was a gay student at the University of Wyoming in Nineteen Ninety eight he was beaten and tortured outside of Laramie he died a few days later from severe head injuries and the brutality of his death shocked the nation\nAbout Wyoming and they think about ... Sheppard murder and that is just a reality\nShe wants to put Wyoming on the map for something else she'd like to join a growing number of states that have across the border protections for algae BP to people\nWhen you subvert someone's expectation people pay attention\nAnd Wyoming needs a selling point right now is the last twenty five thousand jobs after its most recent energy bust\nEric ... bridge sees the tech industry as a possible white Knight the beautiful thing about the tech industry is not going away Troy bridge is a shy in local and the founder of the race school of technology and design he says there's a reason cities or doing whatever they can to attract companies like Amazon and Google\nWhat industry has has not yet been touched by technology so if you were able to create a technology hub you literally are putting does like beating heart of people's viewing ideas into every single industry agriculture military a retail\nBut in order for that to happen ... agrees with Sarah Burlingame Wyoming needs to work on his reputation\nPeople know Wyoming for killing days\nHe came face to face with that reality when he established a school in twenty fourteen he was trying to hire instructors and his top candidate with someone he'd worked with three in his time at apple\nI remember calling him up and the first question you know out of his novels or ... community like in Wyoming\nThe candidate was not impressed with his answer\nAnd that's intro beach knew he had a problem he turned to Google to find a local ... advocacy group\nI'm up in the first question you know out of his novels ... community like in Wyoming\nThe candidate was not impressed with his answer and that's an ... knew he had a problem he turned to Google to find a local LDP GQ advocacy group\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin\nThe threat is clear\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin\nThe bread is clear I'm not denying climate change but try explaining that to President Trump\nYou have to show me the scientist because they have a very big political agenda\nExplaining the facts behind climate change is not enough to convince deniers so what would it take I'm Joshua Johnson a reality check on debating climate change next time on one day\nWhen a starts in one hour that is at nine o'clock this is southern Colorado was NPR station here cc ... Colorado Springs Kate ... hunter key CCF start feeling and the WTC than woodland park on line at K. are cc dot ORG\nWarmer weather returns today hides mostly in the forties and fifties sunny throughout the day with a chance for snow this evening and into tomorrow for Trinidad Raton and the lighter NPR headline news is coming up next it's eight o'clock\nHe\nGood morning days after hurricane Michael made landfall in Florida many people have no power while others who were evacuated\nComing up we'll Lawrence reports on life in the Florida Panhandle and I'm Steve Inskeep and I'm Rachel Martin with\nUs secretary of state Mike Pompeo and the Saudi Arabia today the Saudi regime and accused of murdering journalists them all to show the\nPresident Trump now says it could be real killer this hour we explore the arms deal between us and a new poll says there are two issues motivating rural American voters this year drug addiction an economy\nThat covers the actor director Tim Robbins ...\nOn the news kept coming up next\nLine from NPR News\nFlorida Panhandle and I'm Steve Inskeep and I'm Rachel Martin\nUs secretary of state Mike Pompeo is in Saudi Arabia today the Saudi regime and accused of murdering journalists them all to show the President Trump now says it could be real killer this hour we explore the arms deal between us and a new poll says there are\nTwo issues motivating rural American voters this year drug addiction an economy\nThat covers the actor director Tim Robbins ...\nOn the news kept coming up next\nLine from NPR News in Washington I'm corporate Coleman hurricane cleanup continues along the Florida Panhandle the death toll across several states remains at Seventeen people\nBut dozens of other people are still missing and rescue teams and loved ones are continuing to search for them and beer is on the low long reports tens of thousands of homes are still without power\nUtility companies are scrambling to repair downed power lines across the region Florida governor Rick Scott has been sending extra cruise to help by clearing debris from roads officials are warning residents void touching downed wires run Florida's panhandle hundreds of families now without homes are continuing to shelter in schools and community centers\nHundreds of National Guard members from Florida and other states are helping to lead search and rescue efforts and Bain Gulf counties to berries hit hardest by hurricane Michael on July ... NPR News Destin, Florida\nSecretary of state Mike Pompeo is in Riyadh Saudi Arabia he's met king some on to discuss the case of missing Saudi journalist come out ... Turkey's government believes he was murdered inside Saudi consulate in Istanbul NPR's Michel ... is traveling with secretary in Riyadh\nOr State Department spokesperson said that determining what happened to your show is of great importance to this administration they want to sit down face to face in ... in here on their side of events before rushing to judgment about anything um and you'll remember that the president himself has\nBeen very hesitant to to speak out too strongly about the Saudis also he says that you know he doesn't want to upset lucrative arms deals with the Saudis NPR's\nMichel ... and in Riyadh news reports have indicated the Saudi Government is considering saying that ... died during an interrogation gone bad\nNPR has not confirmed those reports talks remain stalled over the United kingdom's exit from the European Union known as Brexit there's fresh speculation UK\nBeen very hesitant to to speak out too strongly about the Saudis also he says that you know he doesn't want to upset lucrative arms deals with this out as NPR's\nMichele ... in Riyadh news reports have indicated the Saudi Government is considering saying that ... died during an interrogation gone bad\nNPR has not confirmed those reports talks remain stalled over the United kingdom's exit from the European Union known as Brexit there's fresh speculation UK and ... negotiators cannot reach of Brexit deal ... reports from Brussels a key meeting is set for tomorrow\nEuropean Council president Donald Tusk ... summit into teaching letter to eat you leaders\nWarned them to prepare for a no deal scenario that future status of the border between a member of Ireland and Britain Northern Ireland remains the biggest sticking point do you prefer keeping Northern Ireland in customs union to avoid setting up checkpoints dear to block traffic and trade\nBut Britain's Brexit minister Martin calling in and says any customs arrangement involving continued you regulations would Only Temporary\nWe lost without you stick to it was on the area\nTalent instilled says Britain does want a deal Latvian foreign minister at grocery cabbage puts the odds of that at just ... fifty for NPR News I'm Teri Schultz in Brussels\nOn Wall street stocks are all up sharply the down as and the five hundred and ... indices are all up more than one percent\nThis is NPR it's eight oh four I'm Abigail back men with Ninety One point five K. R. C. C. news El Paso county commissioners will be looking at the proposed twenty Nineteen budget this week the plan calls for three hundred to point one million dollars which is nearly five point five percent more than the twenty Eighteen budget\nAnd increase the mayor says is largely due to projected growth in sales and use tax revenue the public is invited to give feedback about the budget Thursday from five thirty seven PM at city hall\nKanye West just made news with his hard to follow tweets on the thirteenth amendment meanwhile Colorado is focused on possibly changing the state version of this centuries old law\nNinety One point five K. R. cc's alley button or reports Colorado's version mirrors the one in the U.S constitution as do several other states including Utah the amendment prohibits slavery and involuntary servitude except as a punishment for convicted crime but a Colorado initiative this November would make it the first state to remove\nP. M. at city hall Kanye West just made news with his hard to follow tweets on the thirteenth amendment meanwhile Colorado is focused on possibly changing the state version of this centuries old law Ninety One point five K. R. cc's alley button or reports\nColorado's version mirrors the one in the U.S constitution as do several other states including Utah the amendment prohibits slavery and involuntary servitude except as a punishment for convicted crime but a Colorado initiative this November would make it the first state to remove that exception here's a clip from the amendment a website\nLimited [noise] there's never been to this day I was born rovers or\nRichard Collins is a constitutional law professor at the University of Colorado Boulder he says it's unclear whether this amendment would be symbolic or have real consequences opponents are worried that it would interfere with prison labor for things like fighting wildfires either way Collins says the amendments passage could affect the rest of the country\nOur support of Colorado purposes or for two others for\nThe same amendment went before a Colorado voters and twenty sixteen and failed for the mountain west news bureau I'm Ellie button or\nThis is Ninety One point five K. R. C. C. news\nA nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\n[noise]\nHey there is Joshua Johnson the host of one day this is Terry Gross the host of fresh air orange and Frank's five ... this is marketplace I'm car result so much for so culture news in depth discussion with the afternoons or Ninety One point five years you see\nI'm Abigail back then it is six minutes after eight o'clock hope you're having a great Tuesday Morning you're listening to MORNING EDITION on Ninety One point five K. R. C. C. [noise]\nWhat's on people's minds in rural America\nComing up the results of a new poll that shows opioids and economic issues have people worried\nBut many retain an upbeat outlook about the future of their communities that story is coming up as MORNING EDITION continues\nRight around eight twenty ... Twenty one degrees sunny a high of fifty to snow possible this evening in canyon city it's thirty one Sunday in a high a fifty five and in Colorado Springs it's thirty degrees sunny and a high of forty nine today\nIn your own Ninety One point\nWhat's on people's minds in rural America\nComing up the results of a new poll that shows opioids and economic issue has people worried\nBut many retain an upbeat outlook about the future of their communities that story is coming up as MORNING EDITION continues\nRight around eight twenty ... Twenty one degrees and sunny highest fifty to snow possible this evening in canyon city it's thirty one sunny and highest fifty five and in Colorado Springs it's thirty degrees sunny and ... forty nine today\nNPR on Ninety One point five tea or CC's supportive locally buy seeds consulting ... offering herbal formula is prepared on sites such as an intestinal sued and bell blend which help balance digestion consultations and plan through the villa below twenty seven twenty seven north to hone street\nBy who gives a scrap greed and reuse sooner restore hearing a mix of new and used the arts and crafts supplies scrap booking paper game pieces books and more now with their new location\nFive twenty west Colorado who gives a scrap Colorado dot com\nIs I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings are fine others no longer exist and NPR's Quil Lawrence has spent days taking it all in either Quil tasty so what have you been seeing well I mean\nThere are there trees down everywhere these towering pine trees that are just snapped over at the middle in some of the communities along the water and they've been they've been flat and then I Know people so to say that word or they try to describe it mostly people down here keep using sort of\nChildren's toys metaphor sayings like a kid swept all the houses off the monopoly board\nOr you know a kid snapped his his toy tree I don't think people can really believe that\nUh that if a win could snap that sort of keep they keep on trying to reduce it to some metaphor they could understand how how this could just get picked up and move to blocks and flipped over at the point where you can't see\nWhat was the house and what was a vacant lot ... I'm so in those communities there are people are really asking\nReduce it to some metaphor they could understand how how this could just get picked up and moved to blocks and flipped over and so the point where you can't see uh what was a house in what was a vacant lot Mm I'm so in those communities there are people are really asking\nThis is NPR News on the next fresh air growing up with an absence\nThis is NPR News on the next fresh air growing up with an absent mother who was addicted to heroin and raised by grandparents who gain legal\nCustody but talk with Jared J. 'cause Oscar about his new graphic memoir for young adults hey kiddo how I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also does the lunch ladies\nSeries join us [noise]\nThat is today at noon and fresh air is every weekday at noon on Ninety One point five K. R. C. C. [noise]\nThanks for tuning into MORNING EDITION on this Tuesday Morning I'm Abigail Batman [noise] President Trump says he won't do anything to jeopardize arms deals with Saudi Arabia worth one hundred ten billion dollars experts say that figure is way off\nUnited started from Saudi Arabia for include is less than four billion dollars worth of harm should remove ... from ... Trump has been president\nComing up more on us weapon sales to the Saudis that is coming up in ten minutes just after eight thirty [noise]\nIn woodland park it is twenty three degrees and sunny and high of forty four today in Pueblo it's twenty eight sunshine in a high a fifty three and in Colorado Springs it's thirty degrees will have sunny skies today as well with a high of forty nine\nIt's eight Twenty one and this is Ninety One point five K. R. C. C. southern Colorado's NPR station\nSupport for Ninety One point five K. R. C. C. comes from local organizations who want to reach a well connected audience than discerning about news culture\nAnd how they spend their money becoming a corporate sponsor of Ninety One point five care she's the means your brand will stand out from the ground for more information about underwriting called Jeanette at seven one nine four seven three for a one\nSupport for NPR\nThe port for Ninety One point five K. R. C. C. comes from local organizations who want to reach a well connected audience than discerning about news culture and how they spend their money [noise] becoming a corporate sponsor of Ninety One point five can be mean your brand one\nStand out from the ground for more information about underwriting called Jeanette at seven one nine four seven three more\n\nSupport for NPR comes from this station and from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth civility brokerage services that will see\nFrom the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security healthcare and science and technology leadership brown dot edu slash NPR\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service Morris campaign monitor dot com\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy according to a new poll that is what is on the minds of rural voters as they go to the polls this election season the poll was done by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about the future\nIf you want to picture of the troubles that face some rural communities you can call Brenda a self described homemaker from the heart of Appalachia she fifty seven and married to a former coal miner\nAnd have a step from the black lung and having a real hard on board with down for him to combat anyway\nAnd drug addiction has hit her family especially her two grand sons hard\nMy belt on her head and I'm ... and have walked off color\nBecause they couldn't give up his truck it\nHe's still alive but some of our other relatives aren't including her niece\nThat found her in her home a lie [noise] the timber\n[laughter]\nAnd having a real hard time to worry if I was down for him to come out anyway\nAnd drug addiction has hit her family especially her two grandsons hard\nMy daughter and her husband um got ... and he walked off a couple of 'em\nBecause they couldn't give up his drug that\nHe's still alive but some of her other relatives aren't including her niece\nThat found her in her home a lie [noise] September\n[noise] [noise]\nShe was thirty three years old when she left behind three boys\nBrenda NPR's not using her last name to shield her grandchildren lives in Coburn Virginia a town of about two thousand people near the point where Virginia Beach Kentucky and Tennessee her experience fits into the findings are new poll which shows that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis when we asked if they personally know someone who struggled with addiction forty nine percent said yes Brenda says it's worse in her community\nIf he were to approach\nCan family randomly\nAnd give them a piece of paper and have you have someone in your immediate family owned a road eight out of hand with ...\n... says in Coburn jobs and opportunities have dried up state officials have been promising to bring an economic development but none of it has reached her community yet\nIf you come out of college with a degree or more than likely going to leave this area to find work\nBut experiences in rural America very widely in our poll bears that out the survey of Thirteen hundred adults all living in rural areas should that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done the pulled them out of these economic problems they face\nWhile some rural communities are suffering others are thriving says Christopher Thor and burn the founder beacon economics and Los Angeles\nMight have a cold town and an oil town or\nMost of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still Robert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done the pulled them out of these economic problems they face\nLast summer all communities are suffering others are thriving says Christopher thorn burn the founder of beacon economics in Los Angeles\nWho might have a cold town and an oil town or the cold town is doing terrible because coal can compete in this era of cheap natural gas\nOn the other hand because of fracking these rural community sitting on ... oil are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between Jackson and Memphis, Tennessee is doing well says it killed\nPowell alone hum overtone\nPalace the twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but its economy is growing\nIt's almost like a turban on this starting to expand fall and bigger restaurants are being put her now within the first two years we are really the village\nAnd Brenda says she's seen flickers of hoping Coburn the town's high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids run three way bottom one of them it was twenty six hundred dollars we ... the white wearing all in one year so there's good people hard working people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kodjak NPR News\nThe Milwaukee Brewers hold two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win the series\nAnd Dodgers fans will insist on the yes if they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\nThat is the voice of Bob euchre one of baseball's great voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do was playing career started there in ...\nAnd baseball's National League championship series if the brewers should win the series and Dodgers fans will insist on but yeah if they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\nThat is the voice of ... one of baseball's great voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do is playing career started dairy and sixty too\nLong ago you could start in an ad where an usher removed him from his good seeded a ball game must be on the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble catching you want to explain to Johnny Carson his technique for handling the knuckleball\nEasiest way to catch it was to wait until it stopped rolling and just pick it up\n[laughter] it likeability or number role as a play by play announcer in the film major league in his most famous line of the movie he fades to the radio audience about a wild pitch that misses the strikes down by about a city block\nThe sun this\nSeason though he's been enjoying real brewers success there's\nVideo of him in the locker room after one of the teams biggest wins the players crowd around him this man in his eighties dumping beer on his head of course here is reacting tweet Fox Sports Wisconsin reporter\nMore advanced than any why\nIt may seem\nWell they're all they're all we there's no I wasn't here and [noise]\nI mean to be treated to be treated like one on one of them all the time I think that special for me\nRemember there is no high euchre Bob ... Milwaukee Brewers face off against the Dodgers once again tonight in Los Angeles\n\n\n\n\nThe environment is not typically a top of ticket issue for voters but this has not been a typical\nYear Mendocino Complex fire in northern California and now the largest in state history\nThree million people at risk for extreme heat heat index is Hurricane Florence is already making his presence along the Carolina coast\nYear the Mendocino Complex fire in northern California and now the largest in state history already\nThree million people at risk for extreme heat heat index\nIs Hurricane Florence is already making his presence along the Carolina coast\nNo none of this push the environment over issues like health care or immigration in the minds of most voters but it does make for easy messaging in states where the effects of climate change are already being felt cue B roll of raging wildfires\nGetting hotter but will fire and smoke chokes our hair dinner warmonger is radically imposed efforts to fight climate change global warming is a fraud\nAds like this has been appearing throughout California Florida and in swing districts across the country targeting Republican lawmakers it's part of a multimillion dollar effort by the league of conservation voters to flip the house Democrats Tiernan sit and failed is a vice president with a conservation group\nIf we had in mind our allies leading the house of representatives they can do badly needed oversight on the minister Asians efforts to cater to the leaders every day over our communities\nThat word oversight is one you hear a lot from Democrats in part because there's not a whole lot else they can do most of the role backs and environmental policy are happening in the executive branch under Trump appointees a shift in house leadership won't change that\nDemocrats can't force interior secretary Ryan Zinke you to restore Bears Ears national monument for example or to crack down on methane emissions but they can force him to explain himself\nArizona congressman role ... is the ranking Democrat on the house natural resources committee\nI Want to change the narrative of this whole thing where the Resources Committee is not just the path of part of the Trump Administration that the independent and that they have responsibility as co equals for oversight and accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a setback for the administration\nAnd they would be able to tie them up mercilessly so that they would\nKinda be able to slow walk a lot of the good work that's being done with respect to these issues Democrats already have\nThe Resources Committee is not just the past of part of the Trump Administration that they're independent and that they have responsibility as co equals for oversight and accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a setback for the administration\nAnd they will be able to tighten up mercilessly so that they would\nKinda be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here's Colorado congresswoman Diane and to get the ranking Democrat on the oversight committee for energy and commerce\nI think you will be seeing investigations in hearings around the methane rural and clean power plant and they think car rules you're going to be seeing us look more in debt\nConflicts of interest in corruption at the EPA\nAnd the list goes on to get says this year's midterms reminder of what happened in two thousand six when Democrats took back the house under President George W. Bush for the following two years Democrats called hearings and investigations and crafted legislation that they knew would not pass under a Republican president\nBut that when President Obama was elected in two thousand eight we were able to move a rebellious legislative agenda because we had spent the last two years developing it\nNo of course Republicans could keep their majority in Congress which would mean continued support for the administration's deregulatory agenda Nathan Rott NPR News\nAnd later today on all things considered the outcome of the mid term elections that also have a major effect on the future of us health policy can listen to that story by asking your smart speaker to play NPR or your local member station\nIn that local member station in Ninety One point five K. R. C. C.\nThis is NPR News\nThe Ninety Colorado Springs cool Science Festival is a celebration of all things steam science technology engineering and math dozens of special events various venues throughout the region October Thirteen\nInformation from the data weren't gee\nHurricane Michael leveled entire communities water ripping nice homes off their foundations and carrying them in some cases hundreds of yards in with the expansion of the damage is mind boggling now after the storm the question is who gets\nNews the Ninety\nColorado Springs cool Science Festival is a celebration of all things steam science technology engineering and math dozens of special events to various venues throughout the region or do research in the audience\nFrom Asia ... G\nHurricane Michael leveled entire communities pull water ripping nice homes author foundations and carrying in some cases hundreds of yards in with\nThe spread of the damage is mind boggling now after the storm the question is who gets to rebuild and that's what caused that next time on the take away from WNYC NPR I\nJoined it's where the takeaway coming up this morning at eleven o'clock followed by fresh air and new hope you're having a wonderful Tuesday Morning so far it's October sixteenth I'm Abigail back then and this is MORNING EDITION on Ninety One point five K. R. C. C.\nComing up on the marketplace morning report Canadians will be able to buy canvas legally on line starting tomorrow how our our neighbors to the north rolling out legalized marijuana that plus all the morning's business news coming up at eight fifty one\nIn West cliff it's twenty six degrees and sunny and the height of forty six today in Trinidad twenty nine sunny a high of fifty a chance for snow this evening and in Colorado Springs it's thirty three degrees sunny and a high of forty nine\nNPR on Ninety One point five through your cc is supported locally by planet granted now planning kitchen bar and bathroom remodel to help listeners prepare for the holidays planet granted offers a wide selection of countertops industrial room at thirty twenty north stone and online at planet granite dock us\nBy pikes peak hospice and palliative care who's community volunteers help people live their lives to the fullest with the time the\nVolunteers provide complimentary cure from pets music to aroma therapy ... dot org\nI'm Rachel Martin the U.S embassy in Australia sent a bizarre email the other day it looked like an invitation to a meeting with an R S P lake\nKnow is this photo on when you were planning back holding a plate of chocolate chip cookies wearing a blue cookie monster costume the caption bunnies red cat pajama down a U.S official sent out an apology\nAnd yet the invitation what's fake but based on my Twitter feed the world's craving for a cat's pajamas jammed is very real that's going to get\nSupport for NPR\n... ... dot org [noise]\nI'm Rachel Martin with empathy in Australia sent a bizarre email the other day it looked like an invitation to a meeting with an R S P lake\nKnow is this photo and when you were climbing back holding a leading chocolate chip cookies wearing a blue cookie monster costume the caption beneath red cat pajama jam us official sent out an apology\nAnd yet the invitation what's fake but based on my Twitter feed the world's craving for a cat pajama jammed is very real that's wanting it\nSupport for NPR comes from the station and from log me in makers have go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done and learn more it go to meeting dot com\n[noise] from indeed used by over three million businesses for hiring where employers can post jobs and do you screener questions to build their shortlist preferred candidates learn more it indeed dot com slash higher and from listeners like you who donate to this NPR station\nThis is MORNING EDITION from NPR News\nI'm Rachel Martin and I'm Steve Inskeep this story starts with a quiz here's your quiz master ... it comes from political scientist John ... at the University of Nebraska he's going to describe two towns and you have to guess which one is liberal and which is conservative here's ten number one the schools would stress\nYou know patriotism and respect and it would be a very rules based uh educational system but how is this would be fairly similar the lawns would be a very nicely kept in a beautifully green and mode of the town of be quiet with lots of churches\nAll right and here is town number two\nThe schools would be based more on experience for all kinds of things rather than than rote memory people would prefer older houses with wooden floors or rather than wall to wall carpeting um they would keep the yards natural um lots of bars and community theaters and foreign films are more of those than churches\nMiss quiz was probably pretty easy for you and to explain why we're joined now by NPR's social science correspondent Shankar Vedantam Hi Shankar I Know so the first time I'm guessing was conservative and the second one was liberal right exactly no\nHitting is drawing on fairly traditional stereotypes about liberals and conservatives conservatives prefer order and rules liberals prefer experiential schools and community theaters now those are stereotypes which means that they're going to be liberals who hate community theaters and ...\nCommunity theaters and foreign films are more of those than churches\nThis quiz was probably pretty easy for you and to explain why we're joined now by NPR's social science correspondent Shankar Vedantam Hi Shankar I Know so the first time I'm guessing was conservative and the second one was liberal right\nExactly not hitting is drawing on fairly traditional stereotypes about liberals and conservatives\nConservatives prefer order and rules liberals prefer experiential schools and community theaters now those are stereotypes which means that they're going to be liberals who hate community theaters and conservatives who despised churches but the question that hitting and others are asking is\nHow companies stereotypes are so often accurate\nIf being liberal and conservative is all about our political views how companies labels describe all kinds of other things about us from the kinds of food we prefer to eat to the kinds of poetry we left\nTo where we want to hang out so he is arguing that our political views spring from something deeper than just our beliefs about big government or small government\nPrecisely he's arguing that our political preferences at least in part\nCompromise psychological and biological predispositions\nThe most compelling evidence for this comes from studies involving large numbers of twins some of whom are identical and some of whom are fraternal\nIdentical twins share the same genes fraternal twins share fewer genes identical twins tend not to have more political preferences in common than fraternal twins do even though each ... presumably share the same family and upbringing\nHeight for example turns out to be about eighty percent a heritable when you subject to the same kind of design personality traits are about fifty six percent political views thirty to forty percent\nThirty to forty percent so he's saying some part of our political beliefs come from biology\nYes and of course that conclusion upset a lot of people\nAnd they tended to over interpret those results and make it sound like we were saying that everything was was genetic but you know if it's thirty four percent genetic that obviously is you know fifty sixty Seventy percent that comes from the environment so all we're saying is that that genetic component is not zero but apparently that was enough that that some people were upset about that\nWhat he and his colleagues are saying is that biology and psychology play a role in our political preferences know liberals and conservatives in the United states often accused one another or stupidity or malice but it's ... and his colleagues I'll write one reason we might not see the world the same way is because we simply not lie at the same way\nBut genetic component does not zero but apparently that was enough that that some people were upset about that what you think of his colleagues as soon as our biology and psychology play a role in our political preferences snow all\nLiberals and conservatives in the United states often accused one another or stupidity or malice but if he began his colleagues alright one reason we might not see the world the same way just because we simply not wired the same way", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Colorado Springs", "day": "16"}