{"month": "10", "state": "CO", "station": "KRCC", "content": "\nToday in nine AM on Ninety One point five or ... southern Colorado's NPR station\nIf you're in New Jersey area or just a little forgetful and you'd like to know when your favorite program marathon in Ninety One point five parents teach the kids at our website where you'll find daily\nAnd weekly program guy much are the things that are watching\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. law hunter can you see a stark real n K W cc FM woodland park streaming at your cc dot org who\nGood morning President Trump says there will be severe punishment if it turns out Saudi Arabia is responsible for the murder of a journalist\nPunishment might be on MORNING EDITION from NPR News\nThe president told sixty minutes potential sanctions against the Saudis are complicated because he doesn't want to give up a weapons deal I'm Steve Inskeep\nAnd I'm Rachel Martin Harvard University goes on trial today the school is facing charges that it discriminates against Asian American applicants\nUs holding military exercises in Ukraine for the first time since Russia's power grab in that country\nAnd it will share the story of the man he was turning his near death experiences flew\nInto a public service campaign it is Monday until the\nPenny Marshall turned Seventy five years on the news is next\nLive from NPR News in Washington on corporate Coleman President Trump is scheduled to visit areas and Florida and Georgia today that were ravaged by hurricane Michael the storm is left at least Seventeen people dead across several states and the vast amount of destruction\nDozens of people are still missing especially in the Florida Panhandle cell phone service is spotty ... don't know if people are unable to check in with loved ones\nThe c._e._o. of banking giant J. P. Morgan has canceled plans to attend to Saudi investment conference later this month NPR's Emily Sullivan says this follows the disappearance of well known Saudi journalist ... other leaders throughout the world are grappling with the Turkish government's\nAllegations that 'cause she'll be was killed by Saudi officials in Istanbul this month\nPresident Trump is threatened severe punishment if the Saudi royal court has behind the journalists disappearance and somebody said they'd retaliate with greater action its state run news agency notes that country plates quote an influential and vital role in the global economy J. P. Morgan has a longstanding business relationship with Saudi Arabia\nThe company hasn't elaborated on the reasons for its cancellations others have withdrawn from the conference including over in Ford Motor Emily Sullivan NPR News Washington\nIn Germany conservative parties that are allied with Chancellor Angela Merkel's party have been dealt a major loss in Sunday's regional elections in Bavaria from Berlin NPR's Soraya Sarhaddi Nelson reports of far right party has benefited from voter anger\nThe first time in decades that the Christian social union or see a few is losing its majority rule in Bavaria the reason was a protest the link to anger over a Muslim migration to Germany\nGerman public broadcaster A. R. D. estimated a hundred ...\nThe rule in Bavaria the reason was a protest the link to anger over a Muslim migration to Germany German public broadcaster A. R. D. estimated a hundred and eighty thousand former C. su voters cast ballots for the far right alternative for Germany but not every frustrated Bavarian voter turned right\nThe second biggest winner was a left leaning environmentalist Green Party to see us use expected to partner with that party or with the liberal free Democrats in a conservative coalition called the free voters that way to see is you can continue to govern Germany's most prosperous state psoriasis or how to Nelson NPR News Berlin\nCalifornia utility Pacific gas and electric had switched off the power to about sixty thousand customers in about a dozen northern California counties utility spokeswoman Dana ... says there are extreme fire conditions and the power company does not want it's equipment to trigger any blazes we would only do this\nFor the last resort and extreme weather conditions the utility says that strong winds in the region could gust up to fifty miles per hour\nIconic retailer Sears is filing for bankruptcy the company that supplies everything from watches to washing machines missed a debt payment of one hundred thirty four million dollars it is five and a half billion dollars of debt\nThis is NPR\nDiplomats from North and South Korea have agreed to reopen rail road and highway links between their countries the diplomats say their nations will stage ceremonies next month or the in early December to highlight the agreement\nThe north and South Korean representatives have also agreed to start talking about an effort to co sponsored the twenty thirty two Olympic Games and they'll also start to discuss how to use video cameras to reunite families divided by the Korean War\nThousands of Marriott Hotel workers are on strike and several sites across the country including Hawaii Hawaii Public Radio's Bill Dorman says the workers are seeking improved benefits and wages [noise]\nNearly three films and Marriott Hotel workers in Hawaii you're starting the second week of a strike the hotels involved are among the most famous in the islands the royal Hawaiian the west in Milan a surf riders the Sheraton mowing the properties are owned wind chill young hotels and resorts subsidiary of a Japanese company\nBut they are managed by Mary out while the strike is part of a national action there are local aspects as well or what he has had six years in a row with record ...\nBye Mary out while the strike is part of a national action there are local aspects as well or what he has had six years in a row with record tourism arrivals and maybe on its way was seventh\nLabor organizers say workers deserve to share in more of that financial success for NPR News I'm Bill dormant in ...\nBritish royal officials say that Prince Harry and his wife ... are expecting a child next spring the couple married last may and pomp and pageantry the news was disclosed as Harry and Meghan opened a trip to Australia this is NPR\nSupport for NPR comments from NPR stations other contributors include progressive insurance comparing car insurance rates from multiple insurers so shoppers can evaluate options in one place now bats progressive comparisons available at progressive dot com or one eight hundred progressive\nMy name is ... president and owner of monuments occupational medicine and money was Colorado are targeted audience are owners of companies HR professionals safety\nManagers and injured workers themselves to the medical care that they need to get back to work I Believe or CC's helped us quite a bit and we are able to obtain a lot of access to individual we normally wouldn't have access to through other means of advertising\nYou would like to become an underwriter like me please call genetic seven when nine four seven three for eight zero one\nThere was well loved well you [noise] Nineteen Ninety seven ... absolutely no down with them we had tried to sell it my teenage daughter so that\nThey would get money out of it and I'm like no no I'm In and buy it and then probably about six months ago I was like okay we're down at the simplest thing I've done\nIn the hotel guys when\nI'm Susan I live in Colorado Springs and I can see the tea or CBC dot O. R. G. for cargo nation information\nEither this is my age who is this is Jonathan from your water the dominant wildly from the most at\nSeventy and indeed nine nine Ninety One point five hey I he he\nProgramming on Ninety One point five to your cc is supported by the cultural office of the pikes peak region inviting listeners who celebrate arts month this October by having at least one new cultural experience with family or friends details at peak radar dot com slash arts month\nIs MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep Seventy three years ago president Franklin Roosevelt\n... this is MORNING EDITION\nFrom NPR News I'm Rachel Martin and I'm Steve Inskeep Seventy three years ago president Franklin D Roosevelt Mets Saudi Arabia's king on a U.S navy ship the two nations have been allies ever since despite profoundly different governments and different ideas of human rights\nSo could the alleged Saudi killing of a journalist really in danger that alliance when asked by sixty minutes President Trump emphasized how much the United states has to lose\nThey ordering military globe everybody in the world wanted that order Russia wanted it China wanted and we wanted to we got it so would you cut that off was well I enjoy what I don't want to do\nBoeing lucky and raised here and all these ... I don't wanna hurt jobs I don't want to lose in order like that there are other ways of\nA politician\nTo use a word that's a pretty harsh words on\nHis true but even the president's big talk of possible punishment if he's convinced the Saudis killed journalists ... prompted Saudi threats of retaliation if you're near aye ms reporter for Bloomberg News and she joined us from the capital Riyadh\nWelcome to the program thank you what threats in the Saudis made and response\nWell the Saudi Government issued quite a strong but also vague statement last night that essentially ... and uh you know\nThat they would respond to any measure against them with an even stronger measure now they kept that a bit cryptic as to what that means but obviously the first place that a lot of analysts plan was sort of I guess that that could mean using their\nPower as the world's largest oil exporter so Saudi Arabia obviously can hold a large share of the oil market and there was actually a a article written by a a a Saudi journalist who's ... prominent in one of the state controlled media outlets a lot of media\nOn the cusp of the midterms we take a look at what worked and what is falling flat from candidate Trump's campaign pledges next time on the takeaways politics with Amy Walter from WNYC NPR I [noise]\nToday at ... am on Ninety One point five to your cc southern Colorado's NPR station [noise]\nTwo members just show on Monday when with scares\nMe for a journey above\nMembers from the judge show on Monday when when she\nJoined me for a journey for me to nova vocal was above cover it also the evening of an attack on a new one point of view [noise]\nHey everybody this is Ruthie Foster this is Krista hello this is Michael from listening to Ninety One point five K. R. C. the music seven ... seven nights a week\nHi this is how do black host of looking up the nerd showing astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM and additional shows are archived at ... dot org and available and I tunes remember keep looking up\nProgramming on Ninety One point five Katie Orr cc is supported by Jackson Greek senior living monument offering independent living assisted living memory care residents was designed for many lifestyle choices wellness programs tailored activities in more now scheduling tours more at Jackson creek senior living dot com the magnitude springs\nLibrary invites you to celebrate Halloween when Galen use have been stories over twenty at the community congregation church of managed to springs more information on the elderly care or\nSupport for NPR comes from the station and from Amazon Web services used by millions of customers a W s provide the range of cloud services and functionality from tools to security to compliance more information at build on dot a W s\nFrom Lausanne collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at a loss in dot com\nAnd from capital one offering a variety of credit card options with features for a range of customers from foodies to travelers\nCapital one what's in your wallet credit approval required capital one bank usa ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin maybe this is you you see the signs at work or your pharmacy flu shots available but when are you going to make time and do the shots really work anyway this next story may change the way you think last year was one of the deadliest flu seasons in decades and\nAnd to make time and do the shots really work anyway this next story may change the way you think last year was one of the deadliest flu seasons in decades and estimated eighty thousand Americans died and thirty nine year old St Louis Mandel is almost one of them\nNow he's encouraging everyone to do something he had never done before Bram Sable Smith reports\nCharlie hinder lighter wasn't opposed to the flu shot he's not against vaccinations or anything like that\nI figured this is something that's dangerous to the elderly and the young not to somebody who's healthy and in their thirties\nCharlie is thirty nine he's director of government affairs at the St Louis realtors association in like more than half of Americans he didn't get one he just didn't think he needed a flu shot as it turns out I was wrong\nWrong like fifty eight days in the hospital a week and a medically induced coma two surgeries three weeks in a nursing home that kind of wrong\nNine months after he first came down with the flu Charlie still getting medical checkups like with this nurse practitioner making Salinger\nFish are having grown up and running out time during that\nTime so I Would call but by and large groups don't she was actually the first person to realize something was really wrong back in January\nCharlie came in here do you knew he had the flu actually his wife had it too but Salinger was concerned he looked terrible she recommended Charlie go to the ER by the time he got there he had organ failure Charlie's flu Hitler to pneumonia and then to sepsis a life threatening complication that can cause Oregon's to fail\nCharlie was put in to medically induced coma for over a week his father and brother flew in from out of town and we are told they may need to say good bye I knew when I woke up that I'd been near death his muscles had atrophied the doctors were worried about brain damage he needed a feeding tube to eat\nI basically was bed bound I had to have helped to move to a chair all of\nThis from the flu it's hard to say why it Charlie so hard his doctor Kevin king says sure there are things that can predispose people the complications from the flu a lack of immunity for Charlie was young and healthy\nIt can affect anybody and it doesn't matter how healthy or going in\nAnd that's why king says the flu shot is important for everybody it doesn't offer complete protection but if you get vaccinated and still get the flu you likely get a milder case things to get better for Charlie eventually he left the hospital and spent three weeks rehabbing in a nursing home the same one where his grandmother was being ...\nThese things to get better for Charlie eventually he left the hospital and spent three weeks rehabbing in a nursing home the same one where his grandmother was being treated for advanced dementia\nWhich was not an experience I expected but all the family members that came to visit got a two for you know I got to visit her and me\nOn April sixteenth two days before his thirty ninth birthday he got out of the nursing home and went to his home for the first time in three months he started driving again in may working part time in June got back to the office in August but the experience was still nine at\nHim I was laying awake at night I'm Still kind of trying to process what I'd gone through this year or so I took to Twitter to share that and and use my stories as an example of this is why you should get a flu shot\nSlowly life is returning to normal for Charlie except for one thing in September for the first time he can remember he got a flu shot for NPR News I'm Bram Sable Smith\nIf you step on the sidewalk outside the NPR headquarters you may have to be careful not to trip over an electric scooter sitting there waiting for the next writer\nCompanies have deployed scooters from Washington DC to Milwaukee, Wisconsin to Lubbock, Texas people download a phone up and use it to pay just one question how safe for the ride Deena Prichep reports\nPortland, Oregon is in the middle of a form on scooter pilot program you see them everywhere park on sidewalks taking that foreigners zipping through traffic but one thing you don't see much of\nThat [noise] oh yeah no doubt [laughter] I won't give you my real name because she's not wearing a helmet nor are any of our friends\nThe city of Portland and the company's both require them and with some good reason scooters aren't bikes\nThey accelerate without pedaling and take some getting used to for both writers and cars one of our friends almost got run over the break lights on bears don't work you know\nWe've seen things from broken bones to punctured lawns um\nPelvis Katrin Juilliard as a trauma surgeon ... San Francisco general and an assistant professor at UCF\nCalifornia has welcome de scooters even changing the law so writers don't have to wear helmets\nWhereas other places like the city of Seattle are concerned enough about injuries that they're not allowing them at all when they enter the factor of transportation that's also entering the sector public health so it becomes a different ball game and we need to make sure that we're doing it safely in San Francisco Julie artist\nThat's also entering the sector public health so it becomes a different ball game and we need to make sure that we're doing it safely\nIn San Francisco Juilliard as part of the city's injury prevention collaborative which is collecting data on each other injuries are they happening at particular intersections our people fracturing gold or screening ankles or are some types of scooters more dangerous than others\nSo you have to look at the patterns to see where the the trends are and where the low hanging fruit are\nAs a trauma surgeon Juilliard has seen the dangers but she also sees the potential because San Francisco is a city dealing with a lot of car traffic and so as Portland\nFor many more thousands of jobs and many more thousands of residents were not going to be building many more thousands of St\nJohn ... is a spokesperson for Portland's bureau transportation to continue to have a city that works that moves they want to welcome innovation knowing you can just hop on a scooter for a few bucks might encourage more people to leave their cars at home\nBut Portland wants to make sure these innovations meet all of the city's transportation goals moving people efficiently cutting emissions and making each trip as safe as possible\nIs at the same time we're seeing a rise in injuries but we also see that people are getting out of their car and potentially helping to relieve congestion you know is that a trade off from a public agency standpoint but we think is a good one I don't know we don't know yet\nPortland of course does not want the rise and injuries they're handing out free helmets and doing a public education campaign\nBut you only have to look at the ... going by to see that this is a big change cars and scooters are still learning how to be around each other and not many people are wearing helmets cities and physicians will get a better sense of scooter dangerous as the data come in over the next few months\nIn the meanwhile good safely bore you could always walk for NPR News I'm Deena Prichep\nIn Portland, Oregon\nSupport for your health comes from exact science is suffering color guard for average\nRisk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information on coal a guard pest dot com and this is NPR News\n\nAnd more people are getting their news on mobile devices and through social media in Ninety One point five K. R. C. C. doesn't have to be any different missed this morning's news can't find it on our website getting out of your current one to keep listening to all things considered download the mobile apps\nHearing all the warnings [noise] yeah yeah that's all I\nHave to re run through all the checks [noise] ready to take off [noise]\nPlugged into the internal radio system in your helmet on you can barely hear the war of the plane takes severe [noise]\nFor Ukraine the presence of us air force and more warplanes from NATO members Poland and Romania\nIs a huge deal\nRussia annexed Crimea and twenty fourteen and foment an armed uprising in eastern Ukraine that continues to this day\nAt first Ukrainians received western political support in the confrontation with Russia but now the Trump Administration is supplying Ukraine was lethal weaponry and last month Ukraine's president Petro Poroshenko was in Baltimore receiving two former U.S coast guard vessels\n... also came to chat with the Fifteen pilots at the exercise an ass lieutenant colonel Chris ... whether you had flown in any of Ukraine Soviet era warplanes are heavier feeders to fly\nTo actually talk twenty nine yesterday in the brain training [noise]\nMajor general Clinton garrison is in charge of U.S forces and the exercise I think about it and they're engaged in a conflict right now with the pure competitor\nSo they obviously have things she teaches and plus they're flying equipment that we don't have access to in the United states\nTo us and its NATO allies hold dozens of exercises every year as does Russia but these exercises are growing in size in September Russia held its largest maneuver since Nineteen eighties that included a significant Chinese contingent\nNature was about to hold its biggest exercise since the Cold War in Norway president Poroshenko bristles when asked if training with Americans could provoke Russia\nWe are so many independent states and only Ukrainian people will decide that we do not ... the mission from Russia which we should do and also\nThe commander of the Ukrainian airbase colonel ... says he's happy to be hosting the Americans but he could not have imagined just drilled just a couple of years ago\nBut yesterday I had the chance to fly in an area of teen day it was quite a pleasant experience but my ... twenty four is better\nThat's my plane\nBack in the air with contempt\nHad the chance to fly in and out of teen ... it was quite a pleasant experience but my ... twenty four is better that's my plane\nBack in the year we're contented colonel sport trigger I've just three seven times first gravitational pull of my body of work for us [laughter]\n\nYeah ours are down here are are charged around here to editors factor on [noise]\n[noise]\nWell our mission maybe coming to an end many Ukrainians hope this is just the beginning cranes bit to join NATO was on hold for now but the government believes exercises like this ... for the actual membership\nIn the western alliance Lucian Kim NPR News story because the teen brain [noise]\nThis is NPR News\nWhat is the president's promise worse we going to end terminate repeal Obamacare and replace it I Will build a great great wall\nOn the cusp of the midterms we take a look at what worked in what's falling flat from candidate Trump's campaign pledges next time on the takeaways politics with Amy Walter from WNYC NPR I [noise]\nTo do the Lebanese them on ... to your cc southern Colorado's NPR station [noise]\nYes [noise] you can have great music seven nights a week from seven to midnight and Ninety One point five K. R. C. C. [noise]\n\nIt's critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five K. R. C. C. newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidate\nBut quality cost money at the nonprofit media organization we looked directly to you\nDozens of people are holding in Catholic Mass in the underground basilica of Spain's by should they look I either are valuable to fall and\nIt's a vast complex that includes a monument and a church that leads to the two of the fascist dictator Francisco Franco\nOn this Saturday it's covered in flowers several people kneel down and kiss that to\nBe good ... to be moved to the\nMoney and the guys hold back tears as she tells me that seeing the tomb with emotional for her she was born in Nineteen thirty nine right after Spain's civil war ended and many other family members were killed by the Republican army fighting against the uncle\nBy you know and he thought he gave Jay Street and\nThere's a lot of history behind this monument she says so why ruin it\nFranklin's rain which lasted until his death in Nineteen Seventy five was notorious for them present meant torture and killings of those that spoke out against the regime\nThis September and then move that angered ... family and his supporters to Spanish government passed legislation that will allow them to remove those remains to look at the drill in Madrid [noise]\nGet out so they history professor at the University of by the Sedona says the move is more of a symbolic gesture\nLady she don't want to do and she means more Islam the monument is Patrick vacation of Franco is and you can touch it there so even if they remove Franco it doesn't take away the symbolism of the monument which is very strong\nFrom Nineteen forty two with an operation in Nineteen fifty nine so I'm going to use the slave labor of political prisoners to dig nearly a quarter of a million tons of granted out of the hill outside Madrid to build the basilica\nThey then used the stones to rewrite the five hundred foot cross\nCeleste says the idea was to build a monument for the winner of the civil war but the remains of thousands of Republican soldiers were also buried there some without their families consent select sets up the place much like Franco's regime it's a mixture of ideology and religion\nIs my guess was the oldest and we've been ... it's very serious shut Frank of legacy of little very prevalent and it's a much deeper and difficult change than just removing\n[noise] some supporters have showed up and rose to protest the removal of his remains singing nationalist songs and doing the fascist so [noise] thirty year old I like ... a lot that got me on is one of many visitors at the valley of the follow the Saturday he think\n[noise] thirty year old a ... a lot that got to be on is one of many visitors at the valley as a father and the Saturday he thinks there's an issue with the way Spaniards are educated about the civil war and the resulting dictatorship\n... to ... which one of those I mean that's what we'll do\nIt and that has been covered up on them for a ... I never started richness Barney skis during the school it was something that works for dinner was of course and then we'd never get better\nThat they got to the un says that for him there's no room for a dictator in a public national monument like this one\nBut I'm thinking I'm Joshua Johnson your questions for potential presidential hopeful Julio Castro next time on one a front W. A. M. U. at NPR\nYou can catch one age It's MORNING at nine o'clock this is southern Colorado's NPR station care cc care C. C. H. D. Colorado Springs gate ... hunter\nCasey cs stark veil and key WC see eh than woodland park streaming at K. R. C. C. dot ORG it is Monday October fifteenth good morning I'm Abigail Batman clear skies\nAre expected today across the region\nReally called this morning warming up a bit with highest in the thirties and forties for your Monday headline news is coming up next it's six o'clock\nGood morning when asked about the reality of climate change President Trump refrained skepticism he dropped his claim of hope but said without evidence\nThat climate will change back in the\nSays whatever is happening with the climate he doesn't want to spend too much money to fix it and\nI'm Rachel Martin and I'm Steve Inskeep in this hour we have two stories of trade bourbon makers and the red state of Kentucky prepare for punishing terrorists\nCloser to leaving the European Union without any replacement trade deal also what happens when corporate CEOs take a stand on political issues Monday or over Fifteen ten years ago today there was a presidential debate\nDemocrats Iraq Obama faced\nThe news is next\nLive from NPR News in Washington ... Coleman today President Trump is scheduled to visit parts of Florida and Georgia struck by hurricane Michael the damage there it's severe than the president will review recovery work\nThe storm has killed at least Seventeen people across several states and dozens of others are missing authorities don't know if that's because people cannot check in with a loved one meanwhile electrical crews are working to restore power NPR's Joel Rose reports it will be a couple of weeks before many customers get it back\nThe utility Gulf powers says it's optimistic about restoring electricity to Ninety five percent of customers who are ready to take it by October twenty fourth two weeks after the storm made landfall\nHe says it's optimistic about restoring electricity to Ninety five percent of customers who are ready to take it by October twenty fourth [noise] two weeks after the storm made landfall that includes Panama City and other areas that were battered when hurricane Michael came ashore last week\nElectrical workers across the panhandle of been working to rebuild infrastructure that was destroyed the storm snapped electric polls downed wires and even brought down high voltage transmission lines Joel Rose NPR News Miramar Beach Florida\nPresident Trump says the suspected murder of prominent Saudi Arabian journalists to Jamal ... is terrible and disgusting and a CBS interview he said there wouldn't be severe consequences if that's proven to be true\nNPR's Jackie Northam says the Saudi Arabia is warning other countries against imposing sanctions over the matter\nThe Saudi foreign ministry issued a blistering statement it said it rejects any threats\nOr attempt to undermine the government through what it called political pressures or by repeating false accusations and you know it warned that if any economic sanctions were imposed on the king them than it would respond with what it called greater action and the statement doesn't actually specify what that actually might be [noise]\nUm but you know there are signs that this whole situation is starting to affect Saudi Arabia is a con and me on Sunday the stock market plunged seven percent before rallying likely\nNPR's Jackie Northam Harvard University is going on trial today for alleged discrimination against Asian Americans in its admissions policies from member station WBUR GBH in Boston Kirk Carapezza reports the decision could have consequences for some other colleges\nWould by conservative legal strategist Edward Blum the group students for fair admissions is suing Harvard claiming university broadly ranks Asian Americans lower on intangibles like courage kindness and leadership attorney we'd Chang is with the Asian American legal foundation which is supporting the lawsuit\nHarvard the systematically say that Asian candidates are not likeable and don't have good personalities by orders of magnitude again less than candidates of any other ethnic group which is really nothing but racist\nHarvard denies that charge saying it's admissions process does not discriminate against anybody and pointing out Asian Americans now account for twenty three percent of all admitted students for NPR News I'm Kirk Carapezza in Boston\nYou're listening to NPR iconic retailers Sears is filing for bankruptcy the company missed a debt payment of one hundred thirty four million dollar\nIconic retailers Sears is filing for bankruptcy the company missed a debt payment of one hundred and thirty four million dollars today Sears has been renowned for selling everything from washing machines to closed diamonds and he's in homes\nBut the company has been struggling under debt estimated to be about five and a half billion dollars\nNorth and South Korea have agreed on a project to reconnect railways and roads across their heavily fortified border NPR's Anthony Kuhn reports from Beijing that the two sides reached the agreement at talks following last month inter Korean summit their third\nOfficials from the two Koreas agreed to break ground on the project by year's end it would involve roads and railways going up the east and west sides of the Korean Peninsula\nThe two sides also agreed on further talks between their militaries helping families separated by the Korean War and making a joint bid to host the twenty thirty two summer Olympics\nNorth and South Korea Russia and China have all spoken in favor of rewarding pee on young for its stated intention to abandon its nuclear programs Washington is now a loan and calling for sanctions to remain until the north gives up its nukes Anthony Kuhn NPR News Beijing\nThe national weather service says temperatures will be twenty to thirty five degrees colder than usual and the southern and central plains\nAs well as in the Rockies freeze warnings extend from west Texas to northern Illinois residents of Colorado and Wyoming got an early season snowstorm yesterday parts of the state's got up to a foot of snow I'm more of a Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes that modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more at ... dot com and the any Casey foundation\n[noise] Hi this is how big black host of looking up to nurture on astronomy here on Ninety One point five\nCare so you see we're every Monday at nine AM and nine PM and additional shows are archived at care see see that are available and I do remember keep looking up [noise]\nHe is six minutes after six o'clock hope you're doing well on this Monday morning I'm Abigail back then in ... southern Colorado's NPR station Ninety One point five K. R. C. C.\nIt's still too early for a full accounting the of the ...\nNPR station Ninety One point five K. R. C. C.\nIt's still too early for a full accounting the of the financial fallout from hurricane Michael and insurance adjuster like everyone else have grappled with blocked roads end down communication systems as they tried to quantify the extent of the damage more on that story coming up at six twenty\nIn woodland park it's ten degrees a high a thirty eight sunny today in Pueblo it's Eighteen mostly sunny today a high of forty and in Colorado Springs it's Nineteen degrees and high today of thirty nine\nProgramming on Ninety One point five to your cc is supported by him credit union in business banking is committed to comprehensive solutions to help solve small business challenges including business trucking details dot com slash was instructed federally insured buddy and us\nBy Russia pasta and downtown Colorado Springs since two thousand nine serving\nMood to order Jamaican Italian pasta dishes and solids along with Reagan garlic bread made with fresh garlic answered mature desserts more rock apostrophe S. dot com\nAnd I'm Rachel Martin President Trump says the U.S is trying to figure out exactly who is behind the disappearance and alleged murder of journalists ...\nThe president told sixty minutes that if the top leadership and Saudi Arabia is responsible there will be severe punishment Saudi Arabia continues to deny any involvement and said that if the U.S imposed sanctions it will retaliate\nThis was one subject covered in a wide ranging interview that aired on CBS last night with President Trump\nNPR's White House correspondent Ayesha Rascoe joins us now from morning good morning so Turkish investigators say a democracy Yogi was murdered in their country on the order of the crown prince of Saudi Arabia Mohammad been someone which would prove very complicated for President Trump who has sought to develop closer ties with him\nDid President Trump in this interview outlined what the severe punishment might be if Saudi has proven to have been behind us she\nNot uh and what he did do is outlined what it will not be and that is it will not be any sanctions that limit a arms sales are banned arms sales to Saudi Arabia\nAnd he made clear that he felt like that would be a economically damaging to the U.S and therefore it wouldn't be a good idea to go that route some lawmakers have called for that action\nBut he said that that is not a what he plans to do\nBe a good idea to go that route some lawmakers have caught for that action but he said that that is not a what he plans to do although he did say that he was very upset by this story and that he he said he will take strong action\nAnd he at least open the possibility he said that it could be Saudi Arabia's top leadership so we just don't know what the consequences of that would be yes so this was also in this interview the first time the president has really been pressed on climate change uh since he entered the White House what did he say he did it has his position changed at all\nToday at noon on Ninety One point five K. R. C. C. you're listening to MORNING EDITION so glad to have you with us this morning I'm Abigail back then\nIf Democrats ...\nD Democrats may win back the house next month and that would create problems for the G O P\nIf Republicans are unable to maintain their majority democratic rules will be very much in opposition to the Trump White house\nMore on what's at stake for the Republicans in the midterms that story is coming up just after six thirty\nIn West cliff it is eight degrees but it feels like it's just two degrees should be sunny today high of forty two in Trinidad is Nineteen partly sunny today at highest thirty eight and in Colorado Springs we have Nineteen degrees feels like eleven sunny today with a high as thirty nine\nMORNING EDITION continues until nine o'clock when we will bring you won a stay with us\nProgramming on Ninety One point five three or cc is supported by the Colorado Springs school hosting a pre K. through twelfth grade open house in school showcase featuring the arts sciences and family entertainment Saturday November tenth one to four pm more at CSS dot org\nBy ... kitchen a Colorado company with fresh never frozen three pound family meals in the Safeway meat department like chicken fajitas smoked pulled pork and carbon goulash dinner for for ... minutes Carlin's kitchen dot com\n\nSupport for NPR comes from the station and from PBS\n\nSupport for NPR comes from the station and from PBS with the eugenics crusade American Experience explores the history of the early twentieth century campaign to breed a better American race the eugenics crusade tomorrow at nine eastern on PBS\nFrom Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from Linda mood bell learning process is committed to helping all students learn to their potential they're learning centers and on line private school offer instruction in\nReading and comprehension eight hundred three hundred Eighteen Eighteen\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin it would be understandable if executives and Kentucky bourbon industry said they need a drink bourbon whiskey at the target of tariffs in Europe and elsewhere Europeans imposed a twenty five percent tax as retaliation for President Trump's tariffs on aluminum and steel\nIt's no coincidence that the taxes fall on an industry centered in Kentucky which voted for President Trump and is the home of Senate majority leader Mitch McConnell the Republican congressman from bourbon country Andy Barr faces a hard fight for reelection which President Trump supported with a visit on Saturday\nWe visited the town branch distillery in Lexington where bourbon is made it a giant copper steel and we met Eric Gregory of the Kentucky distillers association who described a product rooted in the United states\nThe same reasons why we have the world's resources or the same reason where the world's greatest bourbon [noise]\nKentucky system lump sum show them I'm show filters out for water takes it all the impurities and um it just became the perfect place to make the world with with how global business is this more and more so now than it ever has been ah we export Kentucky bourbon to about a hundred twenty six\nCenturies so at this point if you looked at a percentage of the industry is the export market a nice little extra\nOr it it it really is the point where it's it's more than fifty percent of of the bigger players um but uh in the past few years you're probably your global sales have been out pacing your domestic sales while\nAnd just to just to be clear on the fact of you said for the larger distillers more than half their market maybe over ... from ... to ...\nSeniors domestic sales as well and just to just to be clear on that fact of you said for the larger distillers more than half their market maybe over\n... from the store to the sealer but yes I Would say they're international sales are starting to pay their domestic sales in the past Fifteen to Twenty years the global markets really increase ever since we started with the free trade agreements in the mid nineties what were the key free trade agreements today well a nap to any you agreements\nSo what have people been thinking about here as those free trade agreements have become under threat will\nVery concerned um a lot of the big players are were able to stockpile overseas and kind of hopefully get through a short term problem uh but at the same time we you know ... they're starting to look at what happens if this starts to escalate and that's a point where we don't want to go\nWhen people game that out what does that look like just your profit a little less or does the market go away and well\nWe don't like the options on the table this the twenty five percent tax increase terrorist attacks there's no doubt about it\nSo you're either going to pass along those costs the consumer and hopefully you have people that you've converting some scotch do remain bourbon drinkers um or you take your profits back or which means less investment back home here in Kentucky and we don't like that option either so do a lot of different ways out of this and we don't like any of them\nSaid in the obvious as a state that voted for president has voted for Republicans a lot could ask 'em when you have conversations with people do you run into people who were having conflicted feelings\nAre I think we all understand that there are no winners or trade war and you know we're we didn't ask for this issue we're kind of caught in the middle of this so that's where the conflict feelings are we don't understand why we know we're kind of collateral damage or you know to be honest with you I'm not but I again I haven't heard much\nUh uh come up as an issue yet you made an issue like an election yeah it had to come up I mean Congress and bar has been very helpful to us in the past few months he said the meeting with the vice President Pence when he came to Kentucky and the spring how did the vice president response he you know being from Indiana he knows what Barbie means you Kentucky or he will\nNote for the non geographically minded right across\nThe river yes and and he told us he understood exactly that this with the sushi could mean for us bourbon is uniquely American Spirit you can't make it anywhere else you can make it in the United states which can make it overseas and called bourbon thanks to Nineteen fifty federal law right as a federal in Nineteen sixty four\nCongress passed a resolution declaring bourbon to be an indigenous spirits United States unlike Harley Davidson which announced they could move some production overseas we can't do that\nCongress passed a resolution declaring bourbon to be an indigenous spirit United States and like you know holy day between what you can move some production overseas we can do that with ... you got to make it here in America if you want to sell you better may take a beginning of next year and you're going to have a problem with exports if this has been\nA I think that's when you can start to see some real long term consequence is one of our greatest fears is that all these scotch drinkers that we've converted a voice for years sadly if they start looking and you point to bourbon is higher price maybe they go back to drink and what they were drinking before\nYou know we might lose people for our industry and if we lose them now than we might lose him for generations Sarah\nGregory of Kentucky distillers association\nNext we turn to the effort to total the damage from hurricane Michael which at Florida's panhandle last week NPR's Camila Domonoske reports since hurricane Michael hit impassable road than non functional phones have made life difficult for residents and rescue teams and for insurance adjuster\nJust ... miles across\n... works in the fraud division of tower hill Florida homeowner's insurance company over the weekend he caught a cell phone signal near Panama City there were still places it wasn't safe for his team to travel\nFor a situation like that ... that aside I got it\nAnd it wasn't just buildings that were devastated by the storm\nA lot of areas have lost a generational timber poultry farm or hit pretty hard and the car industry is devastated\nChris Chandler than adjuster with alpha insurance and Alabama he's been working in Houston county\nGOP debate last week and a sixty Seventy a hundred miles per hour winds just blows it away but\nLast April source of income of ... the\nEarly estimate suggests this hurricane caused billions of dollars of damage Fitch Ratings says that insurance companies will have substantial cost but Fitch also says the industry is quote well positioned to absorb the losses\nAnd yeah that's what insurance companies are supposed to do but in Florida in particular every big storm raises worries that the industry will just fail\nAfter Hurricane Andrew in Nineteen Ninety to many companies went bankrupt or backed away from covering coastal areas so it's good news the analysts say that's not likely to happen now but communities are still facing a long difficult recovery\nThe communities are still facing a long difficult recovery Chandler and Alabama says the damages upsetting\nYou wish that you could just snap your fingers and like everything\nBack to normal obviously that's not going to happen or you know when you're you're talking to people that houses have destroyed all their belongings showed her pictures no amount of money is going to get an image back of your of your parents that are passed away suddenly shout first birthday\nWhile some things are lost forever he says communities are already working together to start to rebuild can you hold on a ... NPR News [noise]\nThis is NPR News\nAcross the country prison discipline comes down harder on winning you can get written up for not closing your door you get written up for jumping on the phone without permission and those low level infractions can have severe consequences like more time\nIf the Republicans are unable to maintain their majority in the house democratic rule no matter who the speaker is will be very much in opposition to a Trump White house\nJust the way the Democrats in Congress President Obama's legislative agenda die the minute canter and his fellow Republicans took over when they won the house in twenty ten\nLike it's no fun to be in perpetual minority I can tell you that and especially in the house where a simple majority gives you almost absolute power\nTo again sets the agenda and get bills across for that will greatly affect their willingness for some who had been at it for a long time and make the decision whether maybe they should retire or not\nCancer things more Republicans will head for the exits if they lose but Karl Rove former top advisor to President George W. Bush has a different prediction about how Republicans will react if they lose the house\nI think there will be miserable and emboldened there'll be miserable because they're in the minority there will be emboldened because what if the Democrats taken by narrow margin they will be deep divisions within the Democratic party\nAnd Republicans who are experts at opposition will do their best to exacerbate those democratic divisions there will be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress\nTo exacerbate those democratic divisions\nThere'll be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress could decide to triangulate he's already talked about making deals with Democrats on infrastructure for instance and that could leave congressional Republicans on the sidelines\nTrump has never hesitated to throw an ally under the bus says Doug high the former communications director for the RMC\nIt could be bad for Republicans if he tries to do that but it could be good for Trump for his own personal political goals I think the challenge for a lot of Republicans is what is good for Republicans and what is good for Trump or not necessarily the same thing\nAnd something else will happen if Republicans lose big in November their ranks in Congress will get smaller but also whiter older more male and much more conservative in other words more like the Trump the base of the party\nFormer house Speaker Newt Gingrich says even if the Republicans lose even if they privately blame Trump for their loss and even if he cast them aside to make deals with the Democrats they'll have no choice but to stand by him\nThe Republican Party first of all is gonna be the Trump party you know he's consistently at forty to forty three forty four forty five percent approval 'cause he's eighty eight or Ninety or Ninety two percent among Republicans\nSo Gingrich says Republicans will have no choice but to become even more committed to Donald Trump after November\nThe first thing they'll say the morning after the election as we are dedicated to the luxury election of Donald Trump and that becomes the overarching goal\nAnd if they managed to hang onto power in Congress Republicans will still have the task of showing the country they can govern that means funding the wall replacing Obamacare overhauling Medicare and Social Security\nAccomplishments that looted them over the past two years and if they keep the house they'll certainly have a narrower majority making it all even harder Mara Liasson NPR News Washington [noise]\nYou're listening to NPR News\n[noise] second any cyber synergy of at Colorado\nCity happens or for\nQuestion is handled scratching and working for some information on the calendar linked to care secede out or G.\nAcross the country prison discipline come down harder on winning you can get written up for not close\nGee\nAcross the country prison discipline comes down harder on women you can get written up for not closing your doors and get written up for jumping on the phone without permission and those low level infractions can have severe consequences like more time\nIt was sad because I miss those is\nOn this who the mole and\nAn NPR investigation this afternoon on all things considered from NPR News [noise]\nThat is this afternoon at three thirty on Ninety One point five K. R. C. C. you are listening to MORNING EDITION on southern Colorado NPR station Ninety One point five K. R. cc\nComing up on the marketplace morning report the housing market is showing signs of low growth in recent months but something higher interest rates on government bonds are to blame\nOthers worry this may be a sign of bigger problems to come that plus all the morning's business news at six fifty one on the marketplace morning report [noise]\nAnd do you notice that it is eight degrees and sunny a high of forty three in Raton at Seventeen partly sunny today into high as thirty five and in Colorado Springs\nIt's Nineteen degrees feels like eleven should be sunny today with a high of thirty nine and canyon city Fremont county are easy one school district has a two hour delay this morning and Fremont are eat to district is also on a two hour delay\nProgramming on Ninety One point five K. R. C. C. is supported by bingo burger featuring the signature bingo burger made with far roasted Pueblo chilies to pair with a selection of Colorado beers on trial from goat patch up slope field house or more bingo burger in downtown Colorado Springs input blow\nHow friendly bars now I have a chance to offer to drink\nIn the long run of orange juice or the Houston Chronicle reports they're making dog friendly beer alcohol free\nThey started making it for their own ... or thinking it would help with digestion they say they're now selling it\nTo more than twenty bars and restaurants the varieties of dark beer include one called mailman malt liquor and I'd be a lot in the yard It's MORNING edition\n\nSupport for NPR comes from the station and from the N E E Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at a E. C. F. dot org\nAnd communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org\nAnd from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is available online at Carnegie dot org\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep and I'm Rachel Martin Newt Gingrich will tell you he saw something and Donald Trump early on that made him believe Trump could win the presidency\nAnd that's something Gingrich saw has a lot to do with how we see themselves the former speaker of the house made a name for himself by breaking a lot of political norms and refusing to compromise with the other side\nMuch like President Trump the Atlantic magazine's McKay coffins spent some time with Newt Gingrich recently for profile he did it is called Newt Gingrich says You're welcome the cake up and says in our studio this morning thanks for coming in thanks for having me so you went to spend some time with Newt Gingrich\nAnd he suggested suggested that you do so at the Philadelphia Zoo\n[laughter] that's right how come well he is a famous uh animal lover ... you know donated disease around the world he loves animals but I think also what became clear to me as I got there\nIs that he sees animals as useful metaphors for him as we were kind of touring the zoo he was you know pointing out the lions and saying you know this is what the lions teach us about gender politics and this was what a crocodiles teach us about uh about the way that we should pursue change\nWhat was most interesting to me though at one point he was talking about chimpanzees or\nAnd kind of how how vicious they are or how aggressive they are and you know I said I didn't really know what to say so I said you know oh there's the viciousness of the animal world a new kind of\nCaught me off and was very stern and said it's not vicious it's natural right and I think that he draws those parallels with how he abused politics and how we've used human affairs in general\nAnd he he likens himself to other conservative leader he basically described to you for waves of contemporary conservative politics a Barry Goldwater responsible for one of 'em Ronald Reagan Gingrich himself and now President Trump does he see each of these waves that connected to to the previous\nWell he does but what's interesting is that when you press them on that you know why why how are all of these connected because you could make a case that philosophically they're all quite different um\nThe thing is that when you press them on that you know why why how are all of these connected because you can make a case that philosophically they're all quite different\nUm what he said to me was you know basically they're all anti liberal [laughter] which I think actually illustrates a broader point about the politics that Gingrich helped create which is\nIt's tribal in nature partisan and nature and driven especially by negative partisanship it's about a desire to beat the other team more than it is accomplished some unified goal\nIt is a zero sum it's out of versus them President Trump did on sixty minutes last night talking about what a nasty place Washington D. C. is the backstabbing do publicity and almost in the same breath he said I feel very comfortable to uh was was Gingrich as comfortable swimming in this one\nHe was I mean a lot of ways he created the swamp that the Trump now says he's trying to drain right\nI'm ... and you know I think that this is actually one of the things that Gingrich like most about Trump when\nYou try to get him to talk about Trump is more or the brand of conservatism that the president stands for what he talks about most is the personality and the larger than life style and how how cutthroat he can be that's what Gingrich likes about Trump and I think that says a lot about his worldview\nTo what end though I mean where Democrats support the idea of what Trump has the right in terms of our political discourse erosion of norms undermining of institutions does Gingrich see all this as a long awaited political break through\nYou know totally I think that in in the big scheme of things she actually likes that our politics have gotten more tribal in more vicious and has kind of shed a lot of these civilized and traits he thinks that it should be two teams you know duking it out and ... and that's how he uh he sees the world and he's happy that it's gotten to where it is\nWhen he started at nine o'clock [noise] this is not in Colorado's NPR station ... care C. C. H. D. Colorado Springs king ISI seem a hunter key CCS stark veil and K W the CFPB than woodland park streaming at K. R. C. C. dot ORG\nClear skies are expected today across the region it is really cold out this morning temperatures in the teens and ...\nSteve done a large e\nClear skies are expected today across the region [noise] it is really cold out this morning temperatures in the teens and twenties feels a little bit colder than that in some places though warming up a bit with highest in the thirties and forties today\nHeadline news from NPR and K. R. C. C. it's coming up next it's seven o'clock\nThis morning President Trump says there will be severe punishment if it turns out Saudi Arabia is responsible for the murder of a journalist\nThat part of what might be on MORNING EDITION from NPR News [noise]\nThe president told sixty minutes potential sanctions against the Saudis are complicated because he doesn't want to give up a weapons deal I'm Steve Inskeep\nAnd I'm Rachel Martin Harvard University he goes on trial today the ... and they think charges that it discriminates against Asian American applicants\nDo asshole military exercises in Ukraine for the first time since Russia's power grab in that country\nAnd we'll share the story of a man who's turning his near death experiences\nInto a public service campaign it is Monday October Fifteen\nPenny Marshall turned Seventy five years on the news is next\nLive from NPR News in Washington I'm ... Coleman President Trump is scheduled to leave the White House this hour for a visit today to parts of Georgia and Florida hit by hurricane Michael\nAt least Seventeen people have died because of the storm in states from Florida to Virginia and dozens of people are missing but authorities don't know if that's because people are unable to check in with their loved ones cell phone service is spotty in some areas especially in Florida's panhandle\nFEMA director Brock Long toward that region on Sunday\nNo doubt about it for a tremendous hit some of the worst damage I've seen in my career\nMeanwhile teams are going through rubble and some Florida coastal towns with heavy equipment and could ever dogs\nSaudi Arabia is vowing to retaliate if the U.S imposing sanctions over a prominent Saudi journalist who was missing and feared dead and beer is calling Dwyer reports there's growing diplomatic tension over ... ... feet\nTrump has warned that Saudi Arabia will face consequences if it is behind him all showed the suspected murder of Trump on CBS is sixty minutes we're going after she\nWas going to get to the bottom of it and there will be severe punishment but Saudi authorities\nThis is Trump on CBS is sixty minutes we're going to have to seize\nWe're going to get to the bottom of it and there will be severe punishment for\nSaudi authorities didn't take long to answer with a warning of their own or government official pulled the kingdom state run news agency but they totally reject any diplomatic threats according to the official quote\nIf Saudi Arabia received any action will respond with greater action at a Saudi said the widespread allegations of murder are nothing more than ... ... they have yet to offer any official information about the whereabouts of the missing journalist college where NPR News\nIn Germany the political coalition partners of chancellor ... America have taken major losses in the very end state elections as me Nicholson reports the poor regional results may have repercussions for miracles federal coalition government\nThe Christian social union that are in ... to Michael's conservatives have such that was the result since Nineteen fifty and using that apps and its majority in the regional parliament\nMichael's other federal commission pot and other Social Democrats also said pony flown in from second position to sit and gaining any half as many voters as they did in the previous stage elections\nWell let's see su is still in pole position the policy will have to fall the coalition to govern does area and they victims with the environmental screens who came second the far right alternative for Germany policy and the state legislature to citizen us time after coming full for NPR News I'm Esme Nicholson in Berlin\nIconic retailers Sears is filing for bankruptcy the company failed to make a debt payment of one hundred thirty four million dollars it's\nKnown for selling appliances clothes and cars Sears is also now known for its dead worth about five and a half billion dollars Sears officials say they plan to stay in business you are listening to NPR\nIt's seven oh four I'm Abigail back then with Ninety One point five K. R. C. C. news county clerks across the state will begin mailing out ballots for the upcoming midterm election today voters who do not receive their ballots my friday should verify their registered address at do vote Colorado dot com\nVoters can register on our website as well to receive a ballot in the mail you must register no later than October twenty ninth\nAfter that registration will take place at polling locations a southern Colorado pioneer ascent to be inducted into the Colorado Latino hall of fame this month as Ninety One point\nPlace at polling locations a southern Colorado pioneers sent to be inducted into the Colorado Latino hall of fame this month as Ninety One point five K. R. C. C. J. Cornel reports Maria ... is being recognized for her role and founding the city of Pablo\nSandoval moved to the area now known as Pueblo in Eighteen forty one she helped to create and run oh poor blow trading post which became an important economic hub for the Arkansas valley in southern Colorado\nAt the time the Mexican American border ran along the Arkansas River Eric ... with history Colorado community museums so Sandoval managed to bridge the divide separating various indigenous and similar groups in the area of the time\nShe was killed at you know that cross cultural communication and establishing the legacy of you know cultures coming together and working together and creating this new culture and you know this borderlands area of southern Colorado\nSend of all we'll be recognized with the annual legacy award from the Latino leadership Institute which highlights Latino and Latina individuals who've made significant contributions to the history of Colorado for Ninety One point five care cc news object parental\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\n[noise]\nHi this is how big black host of looking up to ... joined astronomy here on Ninety One point five care so you see we're every Monday at nine AM and nine PM an additional shows are archived at K. R. C. C. dot org and available and I do remember keep looking up\nIs six minutes after seven o'clock I'm Abigail back then so glad to have you with us for MORNING EDITION on Ninety One point five K. R. C. C.\nWhen Charlie hinder lighter got the flue last January he didn't expect to end up in a medically induced coma\nAfter fifty eight days in the hospital two surgeries and three weeks in a nursing home he's finally feeling better and this year he's getting a flu shot will have that story for you coming up just after seven twenty\nIn canyon city it's Eighteen degrees sunny and high of forty seven in Pueblo Eighteen mostly sunny a high of forty degrees and in Colorado Springs is Nineteen feels like eleven degrees and high today of thirty nine\nNPR oh Ninety One point\nIn Colorado Springs is Nineteen feels like eleven degrees today us thirty nine\nNPR on Ninety One point five to your cc's supportive locally but who gives a scrap ... sooner you thrift store carrying a mix of new and used arts and crafts supplies scrap booking paper game pieces books and more now with their new location five twenty west Colorado who gives a scrap Colorado dot com\nBy pikes peak hospice and palliative care committed to helping raise awareness of the power of palliative care to help people live their lives to the fullest with\nThe timing of details at ... dot\nOrg I'm Rachel Martin and I'm Steve Inskeep Seventy three years ago president Franklin D Roosevelt met Saudi Arabia's king on a U.S navy ship the two nations have been allies ever since despite profoundly different governments and different ideas of human rights\nSo could the alleged Saudi killing of a journalist really in danger that alliance when asked by sixty minutes President Trump emphasized how much the United states has to lose\nThey ordering military club everybody in the world wanted that order Russia wanted it China wanted we wanted it we got it so would you cut that off ... well I Would I don't want to do going ... Raphael and all these ... I don't want to hurt jobs\nI don't want to lose in order like that there are other ways of a politician\nTo use a word that's a pretty harsh words that\nIs true but even the president's big talk of possible punishment if he's convinced the Saudis killed journalists ... prompted Saudi threats of retaliation if you're near aye ms reporter for Bloomberg News and she joins us from the capital Riyadh\nWelcome to the program thank you what threats in the Saudis made in response\nWell the Saudi Government issued clay a strong but also vague statement last night that potentially threatened a you know that they would respond to any measure against them with an even stronger measure\nNow they kept that a bit cryptic as to what that means but obviously the first place that a lot of analysts plan was sort of I guess that that could mean using their\nPower and the world's largest oil exporter so Saudi Arabia obviously can hold a large share of the oil market and there was actually a a article written by a a Saudi journalist who's right prominent in one of the state controlled media outlet to a lot of beer\nToday at noon on southern Colorado's NPR station Ninety One point five K. R. C. C.\nI'm Abigail back then and you're listening to MORNING EDITION a lawsuit alleging Harvard discriminates against Asian American applicants goes to court today while the case focuses on Harvard it could have big consequences for higher education especially as it moves to the U.S Supreme Court\nThe latest on that story coming up at seven thirty [noise]\nIn woodland park it is ten degrees though it feels like it is just one degree sunny today high as thirty eight in Trinidad its twenty partly sunny today a high\nThirty eight in Colorado Springs it's Nineteen degrees feels like eleven should be sunny today was a high of thirty nine [noise]\nIn canyon city Fremont county are the one school district is on a two hour delay this morning as is Fremont or eat to school district main roads that should be clear and dry today across the region although bridges and overpasses maybe I see so please be careful it's seven Twenty one\nProgramming on Ninety One point five ... or so you see is supported by Rocky Mountain PBS present in Colorado experience for me may Duncan a two part documentary on the figure the cheap Colorado Springs history during Thursday's November Ethan Fifteen at seven thirty pm on Rocky Mountain PBS\nBy peak performance physical therapy for listeners with ongoing pain issues\nFrom runners and so I close to golfers and hikers manual physical therapy can help resolve Mick back in ... peak performance ... dot org\nAnd from the Brown University school of professional studies with executive master's degrees from mid career professionals in the fields of business cyber security health care and science and technology leadership\nBrown dot edu slash NPR from T Rowe price offering a strategic investing approached that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nUnity firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template a drag and drop email editor and twenty four seven customer service Morris campaign monitored dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin\nMaybe this is you you see the signs at work or your pharmacy flu shots available but when he got to make time and do the shots really work anyway this next story may change the way you think last year was one of the deadliest flu seasons in decades and estimated eighty thousand Americans died and thirty nine year old St Louis Mandel is almost one of them\nNow he's encouraging everyone to do something he had never done before Bram Sable Smith reports\nCurly hinder lighter wasn't opposed to the flu shot he's not against vaccinations or anything like that\nI figured this is something that's dangerous to the elderly and the young not somebody who's healthy and in their thirties\nCharlie is thirty nine he's director of government affairs at the St Louis realtors association in like more than half of Americans he didn't get one he just didn't think he needed a flu shot as it turns out I was wrong\nWrong like fifty eight days in the hospital a week and a medically induced coma two surgeries three weeks in a nursing home that kind of wrong\nNine months after he first came down with the flu Charlie still getting medical checkups like with his nurse practitioner making fell injure\nFish the other day and are having grown up and running out time during that\nSo I Would call but by and large sums of improved don't she was actually the first person to realize something was really wrong back in January\nCharlie came in he already knew he had the flu actually his wife had it too but Salinger was concerned he looked terrible she recommended Charlie go to the ER by the time he got there he had organ failure Charlie's flu Hitler to pneumonia and then to sepsis a life threatening complication that can cause Oregon's to fail\nCharlie was put in to medically induced coma for over a week\nHis father and brother flew in from out of town and we are told they may need to say good bye I knew when I woke up that I'd been near death his muscles had atrophied the doctors were worried about brain damage he\nNeeded a feeding tube to eat I basically was bed bound I had to have helped to move to a chair all of this from the flu it's hard to say why it hit\nI basically was bed bound I had to have helped to move to a chair\nAll of this from the flu\nIt's hard to say why hit Charlie so hard his doctor Kevin king says sure there are things that can predispose people to complications from the flu age or lack of immunity\nBut Charlie was young and healthy it can affect anybody and it doesn't matter how healthy you're going in and that's why king says the flu shot is important for everybody\nIt doesn't offer complete protection but if you get vaccinated and still get the flu you likely get a milder case\nThings to get better for Charlie eventually he left the hospital and spent three weeks rehabbing in a nursing home the same one where his grandmother was being treated for advanced dementia\nWhich was not an experience I expected but el the family members that came to visit got a two for you know I got to visit her and me\nOn April sixteenth two days before his thirty ninth birthday he got out of the nursing home and went to his home for the first time in three months he started driving again in may working part time in June got back to the office in August but the experience was still nine that and him\nI was laying awake at nights I'm Still kind of trying to process what I'd gone through this year or so I took to Twitter to share that and and use my story is as an example of this is why you should get a flu shot\nSlowly life is returning to normal for Charlie except for one thing in September for the first time he can remember he got a flu shot for NPR News I'm Bram Sable Smith\nIf you step on the sidewalk outside the NPR headquarters you may have to be careful not to trip over an electric scooter sitting there waiting for the next writer\nCompanies have deployed scooters from Washington DC to Milwaukee, Wisconsin to Lubbock, Texas people download a phone up and use it to pay just one question how safe are they to ride Deena Prichep reports\nPortland, Oregon is in the middle of the four months tutor a pilot program you see them everywhere park on sidewalks taking that foreigners zipping through traffic but one thing you don't see much of\nThat oh yeah no town [laughter] I won't give you my real name because she's not\nWearing a helmet nor are any of our friends\nIn Portland and the spinner companies both require them and with some of the reason scooters aren't bikes\nThey accelerate without pedaling and take some getting used to for both writers and cars\nOne of our friends almost got run over the break lights on their don't work you know\nTake some getting used to for both writers and\nCars one of our friends almost got run over the break lights on bears don't work you know\nWe've seen things from broken bones to punctured lung ... um shattered pelvis\nKatrin Juilliard as a trauma surgeon ... San Francisco general and an assistant professor at UCF California has welcomed de scooters even changing the law so writers don't have to wear helmets whereas other places like the city of Seattle are concerned enough about injuries that they're not allowing them at all\nWhen they enter the sector of transportation that's also entering the sector public health so it becomes a different ball game and we need to make sure that we're doing it safely\nIn San Francisco Juilliard as part of the city's injury prevention collaborative which is collecting data on each other injuries are they happening at particular intersections our people fracturing gold or sprained ankles or are some types of scooters more dangerous than others\nSo you have to look at the patterns to see where the the trends are and where the low hanging fruit are\nAs a trauma surgeon Juilliard has seen the dangers but she also sees the potential because San Francisco is a city dealing with a lot of car traffic and so as Portland\nFor many more thousands of jobs many more thousands of residents were not going to be building many more thousands of St\nJohn Ratey is a spokesperson for Portland's bureau transportation to continue to have a city that works that moves they want to welcome innovation knowing you can just hop on a scooter for a few bucks might encourage more people to leave their cars at home\nBut Portland wants to make sure these innovations meet all of the city's transportation goals moving people efficiently cutting emissions and making each trip as safe as possible\nIf at the same time we're seeing a rise in injuries but we also see that people are getting out of their car and potentially helping to relieve congestion you know is that a trade off from a public agency standpoint but we think is a good one I don't know we don't know yet\nPortland of course does not want the rise and injuries they're handing out free helmets and doing a public education campaign\nBut you only have to look at the ... going by to see that this is a big change cars and scooters are still learning how to be around each other and not many people are wearing helmets cities and physicians will get a better sense of scooter dangerous as the data come in over the next few months\nIn the meanwhile good safely bore you could always look for NPR News I'm Deena Prichep in Portland, Oregon\nSupport for your health comes from exact science is offering color guard for average risk adults over fifty a non invasive\nSupport for your health comes from exact science is suffering color guard for average risk adults over fifty a non invasive colon cancer\nScreening test that can be used at home by prescription only information at cold dark past dot com this is NPR News\n\nAcross the country prison discipline comes down harder on winning you can get written up for not closing your door you get written up for jumping on the phone without permission and those low level infractions can have severe consequences like more time\nHearing all the warnings [noise]\nAfter we run through all the checks they ready to take off [noise]\nPlugged into the internal radio system in your helmet on you can barely hear the war of the plane takes severe [noise]\nFor Ukraine the presence of us air force in more warplanes from NATO members Poland and Romania\nIs a huge deal\nRussia annexed Crimea and twenty fourteen and foment an armed uprising in eastern Ukraine that continues to this day\nAt first Ukrainians received western political support in the confrontation with Russia but now the Trump Administration is supplying Ukraine with lethal weaponry and last month Ukraine's president Petro Poroshenko was in Baltimore receiving two former U.S coast guard vessels partial also came to chat with the Fifteen pilots at the exercise\nAnd asked lieutenant colonel Chris ... whether you had flown in any of Ukraine Soviet era warplanes have used to fly\nTo where I actually had a dog and pony nines yesterday that training [noise]\nMajor general claimed garrison is in charge of and U.S forces and the exercise I think about it and they're engaged in a conflict right now with a peer competitor\nSo they obviously it had things she teaches and plus they're flying equipment that we don't have access to in the United states\nThe U.S and its NATO allies hold dozens of exercises every year as does Russia but these exercises are growing in size in September Russia held its largest maneuvers since the Nineteen eighties that included a significant Chinese contingent and NATO was about to hold its biggest exercises in ...\nThey held its largest maneuver since the Nineteen eighties that included a significant Chinese contention and NATO was about to hold its biggest exercises in the Cold War in Norway president ... bristles when asked if training with Americans could provoke Russia\nWe are sober and independent states and all the Ukrainian people will decide that we do not cause the permission from Russia which we should do and also\nThe commander of the Ukrainian airbase colonel yet ... says he's happy to be hosting the Americans but he could not imagine destroy all just a couple of years ago\nBut yesterday I had the chance to fly in and out of teen ... it was quite a pleasant experience but my ... twenty four is\nBetter that's my plane\nBack in the year we can tend to colonel sport Fager I've just three seven times first gravitational pull of my body of law horizon [laughter]\nYeah now but down here are shut down [noise] [noise]\n[noise]\nWell our mission maybe coming to an end many Ukrainians hope this is just the beginning cranes bid to join\nNATO was on hold for now but the government believes exercises like this will prepare it for eventual membership\nIn the western alliance with Kim NPR News started cussing Tina she's praying [noise]\nThis is NPR News I'm\nFree caregiver workshop designed to educate forum encourage and support anyone providing care to all of them one happening October twenty six in Colorado Springs were formation on our duty to counter linked at ... dot ORG\n[noise] it's a case that could end race based affirmative action nationwide it's racial discrimination and it's a quota\nOr the quarter today's against Asians much like the quarter back in the Nineteen twenties and thirties was again juice a lawsuit against Harvard's admissions policies go to court that's next time on the take away from WNYC NPR I\nThe take away this morning at eleven o'clock this is southern Colorado's NPR station Ninety One point five K. R. C. C.\nThis is the southern Colorado's NPR station Ninety One point five K. R. C. C.\nIn Nineteen sixty nine Neil Armstrong became the first man to walk on the moon but only after a year's long effort by NASA\nFilled with danger and risk\nYou know they said we're going to go to the moon before they had the technology to do it and they just had faith that they would catch up in time\nNow a new film tells Armstrong's dramatic story leading up to the historic flight more on that coming up at seven fifty one [noise]\nIn West close it is eight degrees feels like too high today I'm forty two in tone at Seventeen partly sunny today high as thirty five and in Colorado Springs is Nineteen degrees a high today as thirty nine\nNPR on Ninety One point five through your cc you supported locally by Colorado Springs philharmonic continuing the ... ... signatures series this Saturday and Sunday at the end soon over the arts which ... Mahler song of the earth just up to about a diminished conducting more at the U.S will harmonic dot org\nOr the law firm of shook shops and Gorman reminding listeners to Chuck batteries and carbon monoxide detectors for twelve years handling claims for those suffering from exposure to carbon monoxide more at ... dot com [noise]\nI'm Rachel Martin with the real estate listing made for Halloween think\nBack to your high school district laugh in Salem witch trial in six\nNinety to a man named John Boxer was his use of witchcraft and have now one lucky salted owned his house and lifting says it was built in sixteen thirty eight it nearly four thousand square feet\nHas six bedrooms the exterior is a lovely deep gray color with a bright red door let's be honest it could be haunted but it does have a pool It's MORNING edition\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com [noise]\nFrom the zoom zoom offers cloud video conferencing online meetings and a video conference room solution in one platform featuring digital video and audio with screen sharing account registration and more at zoom dot U. S.\nAnd from Americans for the arts this\nMORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep Spain is altering what some see as a monument to fascism by the ...\nWinner of the civil war but the remains of thousands of Republican soldiers were also buried there some without their families consent Celeste says that the place much like Franklin regime it's a mixture of ideology and religion\nIs moved out I guess we can come in Donetsk and we've been ... very serious Franco's like it's the very presence and it's a much deeper and difficult changed than just reading\nClass [noise] some supporters have showed up in droves during\nThe protests removal of their main singing nationalist songs and doing the fascist theloop [noise] thirty year old an eight hundred lots I got to be on one of many visitors at the value of the fall and Saturday he thinks there is an issue with the way Spaniards are educated about the civil war and it's resulting dictatorship\nAs I woke up a bottle which was what I Do\nSomething that has been covered up on them for a ... I never started recently ... during the school it was something that works for dinner was of course I'm then would never get better\nThat they got a deal and says that for him there's no room for a dictator in a public\nWhen a stark in an hour at nine o'clock this is southern Colorado NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs he the the the hunter Casey cs stark ... K WTC eh than woodland park streaming at K. R. C. C. dot ORG\nYou're listening to MORNING EDITION it's Monday October fifteenth I'm\nClear skies are expected today across the region it's pretty cold out this morning temperatures in the teens and twenties supposed to warm up a bit with ties in thirties and forties\nToday the news is next it's eight o'clock\nGood morning when asked about the reality of climate change President Trump refrained skepticism he dropped his claim of hope but that without evidence\nOf climate will change in the MORNING EDITION from NPR\nTrump refrained his skepticism he dropped his claim of hope but that without evidence\nThat climate will change back\nSays whatever is happening with the climate he doesn't want to spend too much money to fix it and\nI'm Rachel Martin and I'm Steve Inskeep in this hour we have two stories of trade bourbon makers and the rest you can talk to you prepare for punishing terrorists\nCloser to leaving the European Union without any replacement trade deal also what happens when corporate CEOs take a stand on political issues Monday or over\nFifteen ten years ago today there was a presidential debate Democrats Iraq Obama\nThe news is next\nLine from NPR News in Washington I'm core of a Coleman President Trump is flying toward the Florida Panhandle where he'll see hurricane damage and meet emergency responders Trump had said previously that he would also visit storm recovery efforts underway in Georgia\nHurricane Michael killed at least Seventeen people from Florida to Virginia dozens of people remain missing especially in Florida's panhandle where the hurricane made landfall\nThe president says he is sending his secretary of state to Saudi Arabia to meet that country's king immediately the Trump Administration is trying to find out what happened to Saudi journalist who disappeared earlier this month as NPR's Michele Kelemen reports Washington Post\nColumnist Jamal 'cause she'll be was last seen entering the Saudi constantly ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to his Yogi Trump says he spoke by phone with gangs all non and they're sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there and\nThat case is draining us relations with Saudi Arabia and the Trump is made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nOnce the largest retailer in the country Sears is now filing for bankruptcy as NPR's David Schaper reports\nFears losses in recent years are staggering more than ten billion dollars it's two thousand twelve companies debts are massive also in the billions the suburban Chicago based parent company Sears Holdings\nAre staggering more than ten billion dollars it's two thousand twelve companies debts are massive also in the billions\nThe suburban Chicago ... parent company Sears Holdings as close more than seven hundred years and k-mart stores over the last two years under this bankruptcy planned the company will close another one hundred and forty two stores before the end of the year\nBut the company will get the financing it needs to keep above five hundred more stores open through the critical holiday shopping season and beyond after losing many of its customers who the retailers like Amazon Sears is out painting it survival I'd reorganizing as a smaller version of itself\nDavid Schaper NPR News Chicago\nA federal court case opens in Boston today against Harvard University over its admissions policies from member station WBHM GBH in Boston Kirk Carapezza reports the university is accused of discrimination\nThe group students for fair admissions claims harbored systematically ranks Asian Americans lower on characteristics like courage kindness and leadership Harvard has denied the charges\nSaying Asian Americans now account for twenty three percent of all admitted students and civil rights leaders see the lawsuit of attack on race conscious admissions which the Supreme Court has allowed if carefully done\nKirk Carapezza reporting on Wall street stocks are lower the Dow Jones industrial average down fifty five points at twenty five thousand two hundred eighty two the NASDAQ has downs sixty eight Seventy four hundred twenty eight this is NPR\nIt's eight oh four I'm Abigail Batman with Ninety One point five K. R. C. C. news a southern Colorado pioneers that to be inducted into the Colorado Latino hall of fame this month\nMaria ... is being recognized for her role in the founding of the city of Pablo Sandoval moved to the area now known as Pueblo in Eighteen forty one\nHelped to create and run the ... trading post which became an important economic hub\nFor the Arkansas valley in southern Colorado and planted seeds of modern day Pueblo Joelle Martinez directs the Latino leadership Institute which created the Colorado Latino hall of fame she says it's important to recognize the contributions of Latino and Latino leaders like sand of all\nYou cannot be which you cannot see and I think that by telling these stories we let nature generations know what's possible um and to see ourselves in these extraordinary leader Capriles really helps develop that that confidence and not awareness Sandoval\nAnd to see ourselves in these extraordinary leader Capriles really helps develop that that confidence and not awareness\nSand of all we'll be recognized along with five other inducted he's at a ceremony in Denver on October twenty fifth first story is also currently featured in an exhibit at the el ... history museum located on the site of the old treating post in Pueblo\nThe bureau of land management plans to use a helicopter to round up wild horses in western Colorado the agency plans to remove sixty horses from the little book eclipse wild horse range and put them up for adoption\nHelicopter was expected to begin rounding up the horses yesterday the ... says the horses needs to be removed due to over grazing\nThat is Ninety One point five K. R. C. C. news\nSupport for NPR comes from NPR stations other contributors include progressive insurance comparing car insurance rates for multiple insurers so shoppers can evaluate options in one place now bats progressive comparisons available at progressive dot com or one eight hundred progressive\nNinety One point five care cc is on Facebook and Twitter you'll find news headlines local stories station events and announcements signed us and follow us on Facebook and Twitter K. R. C. C.\nIt is six minutes after eight o'clock I'm Abigail back then you're listening to MORNING EDITION and this is Ninety One point five K. R. C. C.\nComing up in Fifteen minutes a conversation with the president of the Kentucky distillers association about the impact of free trade agreements on Kentucky bourbon that story as it had just after eight twenty [noise]\nIn the light of it is eleven degrees a high of a forty five and sunny today in canyon city it's Twenty one although it feels like twelve degrees sunny in a high of forty seven and in Colorado Springs it's Nineteen degrees and sunny with a high of thirty nine today\nProgramming on Ninety One point five K. or CDC is support in Colorado Springs real harmonic continuing the aisle and leave their signature series this Saturday and Sunday is the answer to your would start a mall or song of yours just up to about ... minutes conducting more of the spill harmonic go\nBy the Colorado Springs fine arts center at Colorado College presenting Virgil or jeeze revolution rise against the invasion reimagining sixty nudey Pueblo rubble five hundred years later on you know Colorado College dot edu slots\nThis revolution Raj who jumped me and bridges reimagining with the new deplorable ... ... years later on you know Colorado College drug use ...\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin President Trump says the U.S is trying to figure out exactly who is behind the disappearance and alleged murder of journalists ...\nThe president told sixty minutes that is the top leadership in Saudi Arabia is responsible there will be severe punishment Saudi Arabia continues to deny any involvement and said that if the U.S impose the sanctions it will retaliate\nThis was one subject covered in a wide ranging interview that aired on CBS last night with President Trump\nNPR's White House correspondent Ayesha Rascoe joins us now Corning good morning so Turkish investigators say a democracy Yogi was murdered in their country on the order of the crown prince of Saudi Arabia Mohammed bin some on which would prove very complicated for President Trump who has sought to develop closer ties with him\nDid President Trump in this interview outlined what the severe punishment might be if Saudi has proven to have been behind us\nShe did not uh and what he did do is outlined what it will not be and that is it will not be any sanctions that limit a arms sales are banned arms sales to Saudi Arabia\nA and he made clear that he felt like that would be a economically damaging to the U.S and therefore it it wouldn't be a good idea to go that route some lawmakers have caught for that action\nBut he said that that is not a what he plans to do although he did say that he was very upset by this story and that he he said he will take strong action\nAnd he at least open the possibility he said that it could be Saudi Arabia's top leadership so we just don't know what the consequences of that would be yes so this was also in this interview the first time the president has really been pressed on climate change uh since he entered the White House what did he say and do it has his position changed at all\nStill to come on MORNING EDITION the Democrats may win back the house next month and that would create problems for the G O P\nU Republicans are unable to\nMORNING EDITION the Democrats may win back the house next month and that would create problems for the G O P\nIf Republicans are unable to maintain their majority democratic rule will be very much in opposition to a Trump White house\nMore on what's at stake for the Republicans in the mid term that is coming up just after eight thirty on southern Colorado's NPR station Ninety One point five K. R. C. C.\nClear skies are expected today across the region it's really cold out this morning highest air temperatures in the teens and twenties right now warming up a bit with ties in the thirties and forties today [noise]\nMany one point five ... has been southern Colorado's NPR station since Nineteen eighty four discover more care C. C. dot org and follow us on Facebook and Twitter\nProgramming on Ninety One point five ... or so you see is supported by ... by recognizing the people are happier when their technology works since two thousand one member guy who's been delivering Cisco Systems network security consulting and stress relief sprinkle into the office dog ... dot com\nOr the Rocky Mountain women's film festival November ninth through the eleventh for thirty one years presenting films through the female limbs from documentaries to shorts and features the animated films full festival at R. M. W. film fest dot org\n\nSupport for NPR comes from the station and from Amazon Web services used by millions of customers hey W s provide the range of cloud services and functionality from tools to security to compliance more information at build on dot a W s\nFrom Lausanne collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at ... dot com\nAnd from capital one offering a variety of credit card options with features for a range of customers from ... to travelers\nCapital one what's in your wallet credit approval required capital one bank USA and ...\nMORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin it would be understandable if ...\n...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin it would be understandable if executives and Kentucky bourbon industry said they need a drink bourbon whiskey at the target of terrorists in Europe and elsewhere Europeans imposed a twenty five percent tax as retaliation for President Trump's tariffs on aluminum and steel\nIt's no coincidence that the taxes fall on an industry centered in Kentucky which voted for President Trump and is the home of Senate majority leader Mitch McConnell the Republican congressman from bourbon country Andy Barr faces a hard fight for reelection which President Trump supported with a visit on Saturday\nWe visited the town branch distillery in Lexington where bourbon is made it a giant copper steel and we met Eric Gregory of the Kentucky distillers association who described your product rooted in the United states\nThe same reasons why we have the world's resources or the same reason we have the world's greatest bourbon\nKentucky system lumps don't show that comes to shove filters out the water takes it all the impurities and um it just became the perfect place to make the world with how global business is this more and more so now than it ever has been a we export Kentucky bourbon is about a hundred twenty six centuries\nSo at this point if you looked at a percentage of the industry is the export market a nice little extra\nOr it it it's getting to the point where it's it's more than ... percent of the bigger players um but uh in the past seniors you're probably your global sales have been out\nPacing your domestic sales wow and just to just to be clear on that fact of you said for the larger distillers more than half their market maybe over\n... from the store to the sealer but yes the I Would say they're international sales are starting to pay their domestic sales in the past Fifteen to Twenty years the global markets really increase ever since we started with a free trade agreements in the mid nineties what were the key free trade agreements with a well a ... in the EU agreements\nSo what have people been thinking about here as those free trade agreements have become under threat will\nVery concerned um a lot of the big players are were able to stockpile overseas in kind of hopefully get through a short term problem but at the same time we you know ... are starting to look at what happens if this starts to escalate and that's a point where we don't want to go\nWhen people game that out what does that look like just your profit a little less or does the market go away and\nWell we don't like the options on the table this is the twenty five percent tax increase tests were taxes no doubt about it so you're either going to ...\nGo away and well we don't like the options on the table this is the twenty five percent tax increase terrorist attacks is no doubt about it\nSo you're either going to pass along those costs a consumer and hopefully you know have people that you've converting from scotch do remain Berman drinkers um or you take your profits back a which means less investment back home here in Kentucky and we don't like that option either so the lot of different ways out of this and we don't like any other\nState of the obvious as a state that voted for president has voted for Republicans a lot to ask 'em when you have conversations with people do you run into people who were having conflicted feelings [noise]\nUh [noise] I think we all understand or know winters are a trade war and you know we're we didn't have for this issue we're kind of caught in the middle of this so that's where the conflict feelings are we don't understand why we know we're kind of collateral damage or you know to be honest with you I'm not but I again I haven't heard much\nUh come up as an issue yet you made an issue like an election yeah it has come up I mean congressman Barr has been very helpful to us in the past few months he\nSet up a meeting with the vice President Pence when he came to Kentucky in the spring how does the vice president response he you know being from Indiana he knows ... Kentucky or he will not for the non geographically minded right across the river yes uh and and he told us he understood exactly that this would this mean for us\nBourbon is uniquely American Spirit and you can't make it anywhere else\nYou can make it in the United states which can make it overseas and called bourbon thinks that that's a federal law right as a federal in Nineteen sixty four\nCongress passed a resolution declaring bourbon to be an indigenous spirits United States unlike Harley Davidson which announced they can move some production overseas we can't do that with bourbon you've got to make it here in America if you want to sell you better make in Kentucky beginning next year and you're going to have a problem with exports if this hasn't been a I think that's when you\nCan start to see some real long term consequences because one of our greatest fears is that all these scotch drinkers that we've converted over the last few years suddenly if they start looking and this from a price standpoint if the bourbon is higher price maybe they go back\nTo drink and what they were drinking before you know we might lose people for our industry and if we lose them now than we might lose him for a generation Barrett\nGregory Kentucky distillers association\nNext we turn to the effort to total the damage from hurricane Michael ... Florida's panhandle last week NPR's Camila Domonoske reports since hurricane Michael hit impossible rather than non functional sounds to me\nCain Michael which had Florida's panhandle last week NPR's Camila Domonoske reports since hurricane Michael hit impassable road than non functional phones and made life difficult for residents and rescue teams and for insurance adjuster is\nJust starting out still forty miles\nAcross ... works in the fried division of tower hill a Florida homeowner's insurance company over the weekend he caught a cell phone signal near Panama City there were still places it wasn't safe for his team to travel\nFor the situation like that we're relying on that thing that aside I got it\nAnd it wasn't just buildings that were devastated by the storm\nA lot of areas have lost a generation of timber poultry farms are hit pretty hard and the car industry is as devastated\nChris Chandler than adjuster with alpha insurance and Alabama he's been working in Houston county\nWas ready to be picked last week and a sixty Seventy a hundred miles per hour winds just blows it away but\nLess sleep all sorts of didn't go as her livelihood\nEarly estimate suggests this hurricane caused billions of dollars of damage Fitch Ratings says that insurance companies will have substantial cost but Fitch also says the industry has quote well positioned to absorb the losses\nAnd yeah that's what insurance companies are supposed to do but in Florida in particular every big storm raises worries that the industry will just fail\nAfter Hurricane Andrew in Nineteen Ninety to many companies went bankrupt or backed away from covering coastal areas so it's good news analysts say that's not likely to happen now but communities are still facing a long difficult recovery Chandler in Alabama says the damages upsetting\nYou wish that you could just snap your fingers and like everything\nBack to normal obviously that's not going to happen or you're you're you're talking to people that houses have destroyed all their belongings showed pictures there's no amount of money is going to get an image back of your of your parents that are passed away suddenly shout first birthday\nWhile some things are lost forever he says communities are already working together to start to rebuild Neil Diamond asking NPR News\nThis is NPR News\nRun the country prison discipline them down harder on women you can get written for not closing your doors you've written for jumping on the phone without\nThe country prison discipline them down harder on winning you can get written up for not closing your door you get written up for jumping on the phone without permission and those low level infractions can have severe consequences like more time\nIf the Republicans are unable to maintain their majority in the house democratic rule no matter who the speaker is will be very much in opposition to a Trump White house\nJust the way the Democrats in Congress President Obama's legislative agenda die the minute canter and his fellow Republicans took over when they won the house in twenty ten\nLook it's no fun to be in perpetual minority I can tell you that and especially in the house where a simple majority gives you almost absolute power to set the agenda and get bills across for\nThat will greatly affect the ruin of for some who had been at it for a long time and make the decision whether maybe they should retire or not\nCancer things more Republicans will head for the exits if they lose but Karl Rove former top advisor to President George W. Bush has a different prediction about how Republicans will react if they lose the house\nI think there will be miserable and emboldened there'll be miserable because they're in the minority there will be emboldened because what if the Democrats taken by narrow margins it will be deep divisions within the Democratic party\nAnd Republicans who are experts at opposition will do their best to exacerbate those democratic divisions\nThere will be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress could decide to triangulate he's already talked about making deals with Democrats on infrastructure for instance and that could leave congressional Republicans on the sidelines\nTrump has never hesitated to throw an ally under the bus says Doug high the former communications director for the RMC\nIt could be bad for Republicans if he tries to do that but it could be good for Trump for his own personal political goals I think the challenge for a lot of Republicans is what is good for Republicans in what is good for Trump or not necessarily the same thing\nAnd something else will happen if Republicans lose big in November their ranks in Congress will get smaller but also whiter older more male and much more conservative in other words more like the Trump the base of the party former\nSo whiter older more male and much more conservative in other words more like the Trump being base of the party former\nHouse Speaker Newt Gingrich says even if the Republicans lose even if they privately blame Trump for their loss and even if he casts them aside to make deals with the Democrats they'll have no choice but to stand by him\nThe Republican Party first of all is gonna be the Trump party you know he's consistently at forty to forty three forty four forty five percent approval 'cause he's at eighty eight or Ninety or Ninety two percent among Republicans\nSo Gingrich says Republicans will have no choice but to become even more committed to Donald Trump after November\nThe first thing they'll say the morning after the election as we are dedicated to the luxury election of Donald Trump and that becomes the overriding dull\nAnd if they managed to hang on to power in Congress Republicans will still have the task of showing the country they can govern that means funding the wall replacing Obamacare overhauling Medicare and Social Security\nAccomplishments that looted them over the past two years and if they keep the house they'll certainly have a narrower majority making it all even harder Mara Liasson NPR News Washington [noise]\nYou're listening to NPR News ...\nSprings librarians writes who to celebrate Halloween with daily news have been stories about the community congregation church of managed to springs more information on the no one really cares seat or [noise]\n[noise] it's a case that could end race based affirmative action nationwide it's racial discrimination and it's a quota\nOr the quarter today's against Asians much like the quarter back in the Nineteen twenties and thirties was against Jews a lawsuit against Harvard's admissions policies go to court that's next time on the take away from WNYC NPR I\nIs this morning at eleven o'clock followed by fresh air at noon you're listening to MORNING EDITION on southern Colorado was NPR station Ninety One point five K. R. C. C. I'm Abigail Batman hope you're having a great Monday morning [noise]\nComing up on the marketplace morning report fears filed for bankruptcy early this morning the move signals a shift in the already thinning world of brick and mortar retail that plus all the morning's business news coming up at eight fifty one\nIt's a shift in the already sending world of brick and mortar retail that plus all the morning's business news coming up at eight fifty one on the marketplace morning point\nIn West cliff it is Eighteen degrees but it feels like five sunny today a high of forty two in Trinidad at twenty two should be partly sunny today a high of thirty eight\nEnd in Colorado Springs it's twenty degrees sunny today a high of thirty nine MORNING EDITION continues for about Fifteen more minutes and then we will bring you won a starting at nine o'clock it's eight forty five\nProgramming on Ninety One point five ... or so you see is supported by the Colorado Springs fine arts center at Colorado College resenting Virgil orgies revolution rise against the invasion reimagining the sixteen eighty Pueblo Revolt five hundred years later on view now Colorado College dot edu slash FCC\n[noise]\nMorning I'm Steve Inskeep friendly bars now I have a gym for pets a drink\nIn the long run of our use of using chronicle reports they're making dog friendly beer alcohol free\nThey started making it for their own ... or thinking it would help with digestion they say they're now selling it to more than twenty bars and restaurants the varieties of dark beer include one called mailman malt liquor and IP a lot in the yard It's MORNING edition\nSupport for NPR comes from the station and from zoom\nZoom offers cloud video conferencing on line meetings and a video conference room solution and one platform featuring digital video and audio with screen sharing account registration and more at zoom dot U. S.\nAnd from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement\nMore at alliance for lifetime income dot org\nMORNING EDITION from NPR News good morning I'm Steve Inskeep and I'm Rachel Martin Newt Gingrich will tell you he saw something and Donald Trump early on that made him believe Trump could win the presidency\nAnd that's something Gingrich saw has a lot to do with how we see themselves the former speaker of the house made a name for himself by breaking a lot of political norms and refusing to compromise with the other side much like President Trump the Atlantic magazine's McKay coffins spent some time with Newt Gingrich recently\nPolitical norms and refusing to compromise with the other side much like President Trump the Atlantic magazine ... spent some time with Newt Gingrich recently for a profile he did it is called Newt Gingrich says You're welcome the cake up and is in our studio this morning thanks for coming in thanks for having me\nSo you went to spend some time with Newt Gingrich\nAnd he suggested suggested that you do so at the Philadelphia's do\nThat that's all right how come well he is a famous uh animal lover he's you know donated disease around the world he loves animals but I think also what became clear to me as I got there\nIs that he sees animals as useful metaphors for him as we were kind of touring the zoo he was you know pointing out the lions and saying you know this is what the lions teach us about gender politics and this is what a crocodiles teach us about uh about the way that we should pursue change\nWhat was most interesting to me though at one point he was talking about chimpanzees or and\nKind of how how vicious they are or how aggressive they are and you know I said I didn't really know what to say so I said you know oh there's the viciousness of the animal world any kind of\nCaught me off and was very stern and said it's not vicious it's natural right and I think that he draws those parallels with how he views politics and how we've used human affairs in general\nAnd he likens himself to other conservative leader she basically described to you for waves of contemporary conservative politics a Barry Goldwater responsible for one of 'em Ronald Reagan Gingrich himself and now President Trump does he see each of these waves that's connected to to the previous\nWell he does but what's interesting is that when you press them on that you know why why how are all of these connected because you could make a case that philosophically they're all quite different\nUm what he said to me was you know basically they're all anti liberal which I think actually illustrates a broader point about the politics that Gingrich helped create which is\nIt's tribal in nature partisan and nature and driven especially by negative partisanship it's about a desire to beat the other team more than it is accomplished some unified goal\nIt is a zero sum it out of versus them President Trump was on sixty minutes last night talking about what a nasty place Washington DC is the backstabbing complicity and almost in the same breath he said I feel very comfortable uh was was Gingrich as comfortable swimming in the swamp\nHe was I mean in a lot of ways he created the swamp said that Trump now says he's trying to drain right I'm ... and you know I think that this is actually one of the things that ...\nHe was I mean a lot of ways he created the swamp that the Trump now says he's trying to drain right\nI'm ... and you know I think that this is actually one of the things that ... like most about Trump when\nYou try to get him to talk about Trump is more or the brand of conservatism that the president stands for what he talks about most is the personality and the larger than life style and how how cutthroat he can be that's what Gingrich likes about Trump and I think that says a lot about his worldview\nTo what end though I mean where Democrats support the idea of what Trump has arrived in terms of our political discourse erosion of norms undermining of institutions does Gingrich see all this as a long awaited political break through\nYou know totally I think that it in in the big scheme of things she actually likes that our politics has gotten more tribal and more vicious and has kind of shed a lot of these civilized and traits he thinks that it should be two teams you know duking it out and ... and that's how he or she sees the world and he's happy that it's gotten to where it is", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Colorado Springs", "day": "15"}