{"month": "10", "state": "CO", "station": "KRCC", "content": "One am I going to be your cc southern Colorado's\nNPR station hey thanks for listening this is David Draine\nMy I'm Stephen I'm Rachel Martin hey there is Joshua Johnson the host of one day and time Abigail vaccine joined me and my co host weekday mornings for news and cultural coverage on Ninety One point five K. R. C. C.\nThis southern Colorado's NPR station K. R. C. C. C. C. H. D. Colorado Springs K. E. C. C. law hunter can you see a stark real M. T. W. C. C. F. M. woodland park streaming or to your C. C. dot org who\nGood morning California is a heavily democratic state where the Republican congressmen won reelection for years so what happened to this fall Democrats trying to retake the house is MORNING EDITION\nComing up a California father and daughter in different generations and radically different politics I'm David Greene and Laguna Beach California and I'm Steve Inskeep in Washington\nComing up a California father and daughter in different generations and radically different politics I'm David Greene and Laguna Beach California\nAnd I'm Steve Inskeep in Washington we also you're a critique of the influence of Saudi Arabia ... expected of Silicon Valley world has a lot of questions after the suspected murder of a journalist and also this hour Israel freeze in America there was a pain to the airport for more than\nIt is friday overnight Michael Steele the former chairman of\nCommittee is six years old\nNews is next\nLive from NPR News in Washington I'm more of a Coleman President Trump says it certainly looks like missing Saudi Arabian journalists democracy show genius dead he banished after entering a study consulate in Istanbul, Turkey earlier this month\nTurkish officials have suggested they have audio evidence that ... was murdered inside a claim the Saudi Government vehemently denies today Turkey's foreign minister says his government is not shared any audio with U.S officials and secretary of state Mike Pompeo agreed permit\nSame air tram Pompeo spoke on his way to Mexico City he's going to talk with Mexican officials about thousands of migrating Hondurans they're now in northern Guatemala at the Mexican border ... are trying to cross headed for the United states\nPresident Trump has threatened to call up the U.S military to seal the southern us border to stop them\nThe Afghan government is delaying parliamentary elections in the southern province of Kandahar it's followed a Taliban attack Thursday that killed two senior security officials Jennifer glass reports from Kabul\nThe decision was made by Afghanistan's national security council after the Taliban killed Kandahar as powerful police chief in head of intelligence Thursday's attack inside the provincial governor's compound narrowly missed us and NATO Commander general Scott Miller\nThe Afghan election condition which made the request to delay will announce the exact date the rest of Afghanistan is scheduled to vote Saturday turnout will be crucial for the first time there is an electoral role at any point eight million\nThe Taliban at Islamic state had both now disrupted vote and colon Afghans to boycott it voter registration and political campaigns have been beset with violence ten candidates had been killed two hundred and sixty others had been killed or wounded for NPR News I'm Jennifer glass in Kabul\nA new NPR poll on life in rural America shows many people in small town feel they're doing better than their parents and\nThe glass in Kabul a new NPR poll on life in rural America shows many people in small towns field they're doing better than their parents and have a positive outlook on their economic future NPR's Kirk Siegler reports discounters stereotypes often portrayed by politicians and mass\nMedia the NPR poll was done in conjunction with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nMany surveyed said their hometowns did face serious economic challenges but there's also optimism Rob Clements lives in rural delta County Colorado one struggling natural resource based county that seeing an influx of new people and jobs largely thanks to technology\nIt's fun to see you see people out on the streets with a smile on their face and you know I'm not worried about where their next paycheck is going to come from\nClimates daughter was recently able to move back to her home town to take a job with a local company installing broadband Kirk Siegler NPR News\nThe national weather service says flash flooding persists in central Texas rivers are overflowing and officials are releasing water from full dams along the Colorado River you're listening to NPR\nAuthorities and Florida have increased the number of ... from hurricane Michael to at least twenty people overall at least thirty people were killed by the storm in Florida Georgia North Carolina and Virginia hurricane destruction remains widespread especially in the Florida Panhandle\nNow officials in Virginia have announced a new hurricane death\nBut this is from Hurricane Florence which made landfall last month the Associated Press reports this increases the death toll from Hurricane Florence to at least fifty three people in three states Virginia and north and South Carolina\nA U.S navy helicopter has crashed on the flight deck of an aircraft carrier operating in the Pacific the crash has caused injuries but the navy says none are life threatening John Matthews reports from your couscous Japan the home of the carriers seventh sleep\nThe image sixty Seahawk crashed shortly after takeoff while the USS Ronald Reagan was on maneuvers in the Philippines see\nMaybe as declined to say how many feelers were hurt or how badly the helicopter and carrier were damaged but a spokesperson says all sailors injured or in stable condition and the Ronald Reagan is fully capable of continuing its mission Indian do Pacific region maybe official says the cause of the crash is still under investigation\nFor NPR News I'm John Matthews in ... Japan\nThe Boston Red Sox aren't going to the world series\nOf the crash is still under investigation\nFor NPR News I'm John ... views and your calls go Japan\nThe Boston Red Sox are going to the world series they defeated the defending champion Houston Astros last night in Houston for the one to win the American league championship now Boston will play either at the Los Angeles Dodgers or the Milwaukee Brewers Tuesday night at home\nThis is NPR\nSupport for NPR comes from the three I owe the powering enterprise digital transformation with artificial intelligence predictive analytics and I owe the solutions learn more at the\nThree I O T dot AI and the ... foundation at ... dot org\nAnd it's critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR in the Ninety One point five K. R. C. C. newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality cost money as a nonprofit media organization we look directly to you to help pay the costs of our services\nBecome a part of the team contribute at K. R. C. C. dot org today thank you\nMy name is Benjamin Sharma president and owner of monument occupational medicine and monuments Colorado targeted audience are owners of companies HR professionals safety managers and injured workers and so the the medical care that they need to get\nBack to work or CC's helped us quite a bit and we are able to obtain a lot of access to individuals who normally wouldn't have access to through other means of advertising\nIf you'd like to become an underwriter like me who's called genetic seven when nine four seven three for eight zero one\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile apps free and Google's play and in the ... asked or\nProgramming on Ninety One point five K. R. C. C. is supported by the Colorado Springs school hosting a pre K. through twelfth grade open house and school showcase featuring the arts and sciences and family entertainment Saturday November tenth one to four pm more at the S. S. dot org\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California\nAnd I'm Steve Inskeep in Washington DC President Trump has acknowledged what increasingly seems like reality or reporter a reporter asked him do you believe us Saudi journalist us resident Jamal could show gee is debt\nLike reality or a ... a reporter asked him do you believe a Saudi journalist us resident Jamal ... is that\nHe's dead [noise]\nAh it certainly looks that way to make sure that certainly look that way this\nMarks one of the few occasions on which the president has endorsed the broadly accepted outlines of the case ever since the Washington Post writer walked into a shouting consulate and vanished in Turkey\nSuspicion is falling on the Saudi Government get the president has suggested conspiracy theories about who could be responsible for a gruesome murder and said Saudi crown prince Mohammed bin Salman was being held guilty until proven innocent what does the U.S approach really mean for the Saudis and for Americans\nAnd for freedom of the press will talk that through with Victoria Nuland of the center for new American security she's on the line she was assistant secretary of state under President Obama ambassador to NATO under President George W. Bush to morning or\nGood morning Steve ... you know watching\nFrom the outside what does President Trump's goal appear to be [noise] well\nI think it's important that President Trump seems to have the knowledge reality as you said in your opening that this was a grisly murder of a journalistic criticism critic of the Saudi regime and that they're gonna have to be consequences for this kind of extra territorial illegal act\nBut the president also said unfortunately this has captured the attention of the world that's a quote from yesterday making it clear it seems that this isn't really something he wants to be dealing with he would rather be making friends with the Saudis\nDone necessary work and getting people out to the poll I'm Amy Walter and we'll take stock of all that next time on the take away from WNYC NPR ride public radio international\nToday at eleven AM on Ninety One point five to your cc southern Colorado's NPR station\nWas well loved while you [noise] Nineteen Ninety seven ... absolutely no mountain with them we had tried to sell it my teenage daughter\nStop getting money out of it and I'm like no no I'm going to buy it and probably about six months ago I was like okay we're down here it's the simplest thing I've done\nTwo guys one\nI don't know six months ago I was like okay we're down at the simplest thing I've done\nIn the ... guys when I'm Susan I live in Colorado Springs and I was okay I see the tea or CBC dot org gee for cargo nation information\nYour Ninety One point five care cc membership is vital we thank you for your financial support which directly funds are news music an online services at ... dot org\nIf you're in New Jersey area or just a little forgetful and you'd like to know when your favorite program airs Ninety One point five parents teach the visit our website you'll find daily and\nWeekly program guys are the things that are working\nProgramming on Ninety One point five K. or cc is supported by ... kitchen a Colorado company with fresh never frozen three pound family meals in the Safeway meat department like chicken fajitas smoked pulled pork and cabin goulash dinner for for ... minutes Carlin's kitchen dot com\nUnderstanding us and Mexico borderlands subject matter for a lecture November seventh at a political history museum more formation on this and other public service announcements on the community calendar link or see see that or do you need\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda ... Paul Riser and Catherine hon a new episode every Friday on prime video\nFrom T. I. A. T. I. A. is committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more AT T I Am a dot org\nFrom logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com [noise] and from Americans for the ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California there is a competitive race here\nIn California is forty eighth congressional district voters here might really help determine control of the house of representatives than we have been spending time listening to what is on their minds so this is Orange County it's home to the largest Vietnamese population in the United states' part of this district is actually known as a little ...\nSo this is Orange County it's home to the largest Vietnamese population in the United states' part of this district is actually known as little Saigon NTN Tom trend lives here she works in community affairs for a utility company she is raising two kids or parents also live in this community but she\nSays their lives and her's are so different\nMy parents are pretty much their lives are in little Saigon my dad works at a pharmacy\nAnd so they're ... and for me I go out in the world I experience race it that I Know what it feels like to be discriminate against I I think my parents have that because it really they their lives or hear their communities here they go to a Vietnamese math they go to their customers are meeting these are our ... our diverse\nNow I realize my experience as an American very different from my dad\nAnd these generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on as being tougher on communist leaders some younger people like ten term trend has been leaning more democratic and that is one reason\nThe party believe they can unseat the Republican incumbent here\nSo when we went to visit the ... we had heard there were some political differences in her family though I'm not sure she her so she knew quite how stark they were\nHigh high\nShe invited us into her parents' home for kids were playing around with eating snacks and they were orbiting around the grandfather [noise] how trend is the ... father he primarily speak Vietnamese and his everyday life including when he talks politics with his daughter\nShe's been backing Republicans since he first started voting in Nineteen Ninety two and he told me he was certainly no fan of president bronco bomber who he said just wasn't tough enough on the world stage\nWhom uh but no like him very much\nAnd then what now I guess we're today we have Trump what do you think of Trump so far sofa\nIn this country who do good uh what do you like what do you have\nYou're unemployed rate low uh-huh and the stock market in a brokered in Greece and so the economy is important to you yeah\nAnd that this is this is um\nOpen it [laughter] [laughter] I didn't realize how he he thought of trying to see how to talk to them\nUm I open it [laughter]\nI didn't realize how he he thought of Trump because we haven't talked about that is the first time yeah and I had a surprise because then I'll have a conversation\nAbout the other stuff that he does against the media\nAgainst like just to civil society we grow up knowing how undemocratic Vietnam is to crack down on freedom of press on basic human rights women don't have the same rights there and to see some of that happening now in America you know in some factions of government is scary because that was something that I never would imagine\nWe will be in a situation where we have a president that basically calling to press the enemy of the people like we hear that from communist Vietnam but we don't hear a you know I Would never have imagined that would be reality here today\nCould you say that you're done and yeah I'm just I just wonder why when Trump calls the media enemy of the people what your reaction to that\nMenu of all I like all the whole goal and yelled out you know they're going to\nAssume time the press talk about what these changes\nBut they don't care about it through through\nYour ... says yeah CNN again from would fall to both of them\nSo they're not they're biased yeah Fox News clearly as fire and I don't know if he does his mom and\nThe al ... defend a law I think it allows apple I'm Trump boxes like trying to you know make a phone [laughter]\nDo you think do you think the media\nIs too negative about Trump but\nHe's not fair to say that Russia interfered in through the election this grand dream mhm\nBut when they know that was it on I shouldn't before the election [noise] the way until Durham North elected and the money issue\nSo if if they find out that Trump worked with yeah the Russians where that would that bother you yeah\nYou don't get your don't believe that yeah [laughter]\nThey're doomed proven that don't need to believe them\nYou know my own room and the medical aid FBI then they'll know jazz jobs don't at all he believes\nThat the Mueller investigation should continue so they they have we have the facts I agree with that\nYeah to some of your ground yeah\nThere are a lot of families who've been divided over\nTheir views of from what is your\nThere are a lot of families who've been divided over\nTheir views of Trump what is your like dinner conversations that yeah but go really badly in I mean people get it from the table yeah it I mean this is it doesn't seem to be happening in this\nNo because I don't think our country should be torn apart because of one person\nI clearly am strongly against you know what the president stands for\nBut I also believe it's important to me I respect my parents I Know what their experience has been and and we came here so that we can have the freedom to have different views to have these kind of conversation 'cause they don't happen in Vietnam and so the fact that my dad has a different view from me on this particular issue that doesn't bother him because we have that freedom that's why my parents' lead Vietnam to be here in the first place\nEverybody got to go to vote yes you would fall choice and for future either we'd thinking\nTo think everybody should vote yeah\nAnd my father I didn't mention any he ... after the war he was\nA political prisoner for a ...\nA two year three years he was held in a political concentration camp or no they\nThey do a re education and\nYeah we're the communist tries to you know basically get him to change his thinking\nIt it's powerful to hear you say that people should vote coming from ... the history that you have\nYeah I just think we need to look to protect our democracy\nNo water bowl we both drone motorized ... roam the next time we make it dry how we have another chance for another ...\nThat was ... trend and her father couch trend there to voters here in orange County California and we're going to take you to other corners of this district elsewhere on the program this morning this is NPR News\n[noise]\nTime to members from the judge show on Monday one but two years\nThat their elders and their elders are like in their thirties and forties the case of Silicon Valley do not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the very power they wield and the privileged they wield that some of the people who founded these companies have been catastrophic Lee blind to\n[noise] on a bearded us is the author of the book winners take all thanks very much for coming by thank you Steve\nAre an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we're more from NPR's Daniel Estrin in Jerusalem lower\nCost them is twenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nAll cost them used to have a small chapter of a pro boycott student group but now she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nAnd then I Would go up and they\nGet any foreign minister see peaceful to belly told Israeli radio last week that Israel's ban on all costs him was not very successful she said Israel should reconsider how it applies adventure ... band when it turns into an international issue we lose more than we when she said\nBut Israeli strategic affairs minister ... ... who led Israel's campaign to ban all costs them defended the move\nThe little guy and he said we don't just look at articles in New York Times and the media is critical of Israel he argued there are thousands of pro Israel students and the un contend with pro Palestinian activists on\nCampus who will support our move without cost them proponents of the boycott they've asked meant and sanctions movements say there peacefully protesting Israel's treatment the Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy as a country\nTesting Israel's treatment the Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy as a country\nLaura customs case reached Israel Supreme Court which ruled that costs them had not been involved in boycott activities for more than a year and had demonstrated an academic curiosity about Israel she was released from the airport yesterday ... is her lawyer\nIt's a victory for free speech academic freedom and the rule of law Lars case proved that thought policing had absolutely no place in a democracy\nA right wing Israeli activist groups that it would be closely monitoring all cost them during her time in Israel to ensure she did not promote a boycott the Hebrew University of Jerusalem which had supported al ... case in court said it looked forward to having her on campus next week Daniel Estrin NPR News Jerusalem\nThis is NPR News\nProtesters have taken to the streets like never before this cannot be the America that we are out of\nThe question that we're going to see him the next election is whether or not meaning organizations have done messes or work in getting people out to the poll mom Amy Walter and we'll take stock of all that next time on the take away from WNYC NPR ride public radio international\nToday at ... am on Ninety One point for our to your cc southern Colorado's NPR station\nSupport for Ninety One point five K. R. D. C. comes from our listeners and from local organization who wanted to reach a discerning audience that value quality\nMarketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop and their businesses to board their non profit and buy tickets to their show [noise] to learn more about corporate support and called Jeanette seven one nine four seven or eight year oh why oh\nNot a lot of opportunity here\nOr there was this week on MORNING edition optimism in rural America where things to an economic turnaround more people envision a hopeful future close to home\nI think I have a lot of pride in where I grew up in the valley that I grew up and then when I started a family I I Want my family to have that same experience to listen to MORNING EDITION every weekday from NPR News\nWeekday mornings beginning at five on Ninety One point five\nTo your cc Ninety One point five ... is dedicated to covering a changing southern\nMornings beginning at five on Ninety One point five ... or so you see\nNinety One point five terror cc is dedicated to covering a changing southern Colorado your membership dollars directly fund our local reporting thank you for your sustaining membership\nProgramming on Ninety One point five K. or cc is supported by Ninety One point five ... summit club members who have dedicated twelve hundred dollars or more and supportive are award winning coverage of life in southern Colorado information about joining the summit club at K. or CCD ... or [noise]\nI'm Steve Inskeep had the criminal gotten away with this crime it might have suffered from limb\nMan allegedly broke into a shoe store in Roanoke, Virginia and took seven Jews out of it as a window where only right shoes were displayed awkward for walking getting off of the wrong foot to the dropped a backpack containing the shoes\nInside a police found the suspects student ID and a sweatshirt with the prophetic words call my lawyer It's MORNING edition\nSupport for NPR comes from this station and from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in\nRetirement more at alliance for a lifetime income dot org\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep the United states is not the only country debating how to protect its southern border Mexico the country to the south is also trying to secure its southern border the border with Guatemala\nAuthorities are sending soldiers immigration agents and federal police there they're aiming to stop a caravan of migrants who are hoping to leave Central America and in some cases cross through Mexico on to the United states James Frederick reports from your doubted our goal Mexico\nTwenty three year old Honduran daisy crews who says she swinging abusive gang member boyfriend crust into Mexico two weeks ago but then on Thursday she turned around after making a decision to head back south towards the border with Guatemala to join a rally for the migrant caravans\nWhen\n\nShe says she came to support her fellow\nFor the migrant caravans when\n\nShe said she came to support her fellow hunger and to be here so they don't feel alone\n[noise] crew's joined about fifty other migrants an activist since you like to go a town that sits on the Mexico Guatemala border\nBut police and activists soon clashed in chaos broke out and you can hear in the cell phone video from the scene [noise]\n\nIn the video prescribed eating ... Mexican American migrant activists who helped organize a similar migrant care of him in the spring that first part to President Trump's higher federal police alleged ... previously vandalized an immigration vehicle\nAs migrants tried to stop ... arrest crusade police got rough with everyone even women and children\nThey made me how she says an officer told her to shut up then pointed a gun to her seven year old son and\nThreatened to kill it to others present during the incident corroborated her story\nSpokesmen for Mexico's federal police tells NPR he was not aware of that specific incident and says activists initiated the aggression cautioned the Mexican border town is a foreboding sign of what has to come as a caravan of thousands gets closer\nDozens of federal police in riot gear have already been stationed on the bridge connecting Mexico in Guatemala Mexico human rights commission came to see like you go to try and head off the tensions the group's spokesman at good core Sosa\nSays he wants Mexican police to keep one thing in mind is the caravan approaches\nTo assemble ... senior cells and uses if we're fighting for the rights of Mexicans to be respected in the U.S he says the least we can do is respect the rights of our Central American\nBrothers and sisters here in Mexico while most are still underway about four hundred migrants from the Caribbean or already just across the border in the Guatemalan\nTown of mine [laughter]\nIt's a peaceful compared to the clashes next door in Mexico families relax in the shade chatting and laughing eating and drinking donated food and water\nThan you have a twenty nine year old single mother for who says her family is leading gang violence doesn't want any trouble with us on Sunday she says we come with us here to peace with no intention to use violence nothing like that were just looking\nFor a better life but as things stand now race for children and the other migrants will be met by force the Mexican border for NPR News\nFor a better life but it seems that now raised her children any other migrants will be ... by force the Mexican border for NPR News I'm James Frederick and she was a guy go Mexico\nIt's actually listening to your public radio station which brings you MORNING EDITION you can get the latest news this afternoon on all things considered and father was anytime on social media you can find all your morning edition host on Twitter if you'd like I'm nprinskeep\nEarly estimates for the final costs of hurricane Michael over ten billion dollar I'm Joshua Johnson will follow the news and follow the money on the friday news round up next time on one [noise]\nThat is this morning at nine o'clock\nIn the morning I'm Abigail ... is southern Colorado was NPR station K. R. C. C. king or a C. C. H. D. Colorado Springs can't eat these Eli hunter Casey cs stark landscape WTC than woodland park on line at K. R. C. C. dot O. R. G.\nSunny and dry today throughout southern Colorado look for hides in the fifties and sixties similar temperatures for Saturday and Sunday making for a beautiful on weekend\nHeadline news is coming up next it's six o'clock\nThis morning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't such a tough fight coming up on MORNING EDITION from\nThat's our mid term voter serious just west we'll hear from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like those she has employed should be allowed to stay at a wealthy entrepreneur on why he's left a GOP after voting for Republicans turned\nI'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington DC Afghanistan plans\nParliamentary elections violence means some are postponing\nIt is friday October Nineteen actor John ... Seventy three the news is next\nLine from NPR News in Washington encore of a Coleman President Trump was in Montana last night campaigning for a Republican Senate candidate less than three weeks before the midterm elections Eric Whitney with Montana Public radio has more from Missoula\nThis was the president's third visit to Montana since July to campaign against Senator Jon tester who he holds responsible for sinking his previous nominee for ... secretary Dr Ronny Jackson\nWhat he did was unfair what he did what he did was vicious what he did was they did was judge Kevin\nMore people came to the rally than the airport hangar it was in good hold more than a thousand also attended a protest rally on the other side of town for NPR News I'm Eric Whitney\nAirport hangar it was in could hold more than a thousand also attended a protest rally on the other side of town for NPR News I'm Eric Whitney in Missoula, Montana\nPresident Trump says it certainly looks like missing Saudi Arabian journalist ... is dead\nOfficials in Turkey has indicated they have audio evidence that ... was murdered inside that Saudi consulate in Istanbul the Saudi Government vehemently denies this turkey said today it has not shared any audio with the U.S government\nOfficials in the U.S southeast say that at least thirty people have died from hurricane Michael officials in Florida have increased the death toll there and people also perished in Georgia North Carolina and Virginia\nIn Florida's panhandle hundreds of families remain displaced and ... along reports many are still in emergency shelters in schools in the worst affected areas\nThe damage from hurricane Michael's high wind and storm surge has made many homes unlivable hundred sleeping in school gymnasiums around Florida's panhandle aren't sure where they will go in the emergency shelters close Angela lips Panama City lived in an apartment building for seniors that was damaged by the storm\nShe says she's trying to take things day by day for now and I get too worried about what's next you know\nYou a wreck yourself that it's the same thing but we have five ...\nIs accepting applications for ... that can be used for temporary stay in hotels or condos before residents by more long term housing undo along NPR News the County Florida\nWall Street had another down day on Thursday the Dow Jones industrial average drunk one point three percent the tech heavy NASDAQ Composite index fell to point one percent mark is Andy is chief economist for Moody's Analytics he says investors have a number of worries\nSo higher interest rates prospects with the Federal Reserve will continue to push retire [noise] overvalued stock sea of people are nervous that the stock market has come too far too fast and of course there's a trade war a that's a skull eating with China and that's not good news so you combine all that together and investors are nervous\nWall Street opens in about Ninety minutes the national weather service says flash flooding persists in central Texas rivers are overflowing officials\nAre releasing water from full dams along the Colorado River it's surging downstream towards saturated areas\nThis is NPR the Justice Department\nHas opened an investigation into child sexual abuse allegations against Roman Catholic priest in Pennsylvania this follows them\nFor a man has opened an investigation into child sexual abuse allegations against Roman Catholic priest in Pennsylvania\nThis follows a wide ranging skating state in Grand jury report released last summer that alleged three hundred priests abused more than a thousand children for decades the grand jurors called for action by officials in state lawmakers in their report\nInterior secretary Ryan Zinke is drawing criticism after an internal watchdog report suggested he violated department policy on family travel NPR's Nathan Rott has more\nThe report by the interior Department's Office of the inspector general found that ... wife and others traveled in government vehicles and zinc you teddy park police security detail go with them on a vacation costing taxpayers twenty five thousand dollars\nThere's no policy prohibiting the latter the report says but as it gets department rules to have family trouble and government vehicles\nVicky did get permission from the agency's solicitors office for the family travel in a spokeswoman for the interior said that proves he followed proper political junkies basing more than a dozen other investigations and they've been rocked NPR News\nElection officials in Afghanistan have postponed national elections for the province of Kandahar there'll be held on Saturday in the rest of the country\nThis follows a Taliban attack yesterday in the governor's compound that left Kandahar as top police official and intelligence official dead the provincial governor was wounded the top US military official in Afghanistan was present but escaped an injured three Americans were\nWounded on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include a log Meehan makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more at go to meeting dot com and the listeners who support this NPR station\nScott's on Peter's egg will here to the glass is nursing by fellow I'm Robert ... Ross and I'm Don ...\nAn entertainment Saturdays and Sundays on Ninety One point five heresy [noise]\nFriday I'm Abigail back in October nineteenth got to have you with us for MORNING EDITION on Ninety One point five K. R. C. C.\nIn this week's story corps we hear from a man who was brought up as a child to the U.S from Mexico he's now a lawyer who represents other undocumented\nCore we hear from a man who was brought up as a child to the U.S from Mexico he's now a lawyer who represents other undocumented immigrants that story is coming up\nIn woodland park it's thirty three degrees sunny today Hi I'm fifty three and ... forty six the high end sixty six and sunny sky today and in Colorado Springs at forty four degrees high temperature I'm sixty two sunshine for Colorado Springs Islam [noise]\nWind down your week Sunday evenings with jobs from seven to ten Ninety One point five to yours [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California and those waves behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine whether Republicans hang on to control of the house Republican congressman Dana Rohrabacher\nHas served the forty eighth congressional district here for nearly three decades but there is a political newcomer Democrat Harley wrote a who seems to have a shot at an feeding him this district it has been moving to the left and we got a hint of why that is the other night\nWe were in Laguna the gal it's one of the ... wealthy towns in the hills above the Pacific\nHere and this is where some very rich voters are changing the political landscape or did you ever get Eric McDaniel that\nWas the editor Eric giving his name so we could pull through the gates we'd been went up to a house where there was a Porsche parked\nIn front of this huge film and our hosted the raid and tone brought us inside David nice to meet you too at Antonio is Iraqi American\nHe moved from Baghdad to the U.S when he was six years old he served in intelligence in the U.S military and then he made a bundle running and then selling medical device companies that's where his politics\nWas a Republican for thirty one years when I actually uh turned Eighteen and and and joined the military when we were just coming off of what you know\nI was a Republican for thirty one years when I actually uh\nTurned Eighteen and and and joined the military we were just coming off of what you know Ronald Reagan being president and and really the strong stance he had against you know Russia and Gorbachev and his charm and charisma was really cool to be a Republican at the time\nIs six twenty I'm Abigail back when you are listening to MORNING EDITION on Ninety One point five K. R. C. C. [noise]\nIn California the Democrats are hoping to flip a reliably Republican House seat but it won't be easy\nFrom what I'm hearing if they get power all they're going to do is investigations and impeach that does it when\nMy heart just ahead what voters in the states forty eighth district are saying about the upcoming mid term [noise] that is coming up at six thirty [noise]\nThe new film beautiful boy is based on the memoir by David Sheff about his son Knicks addiction\nUs from being just one of the most sort of light filled extraordinary people I knew and he became this coast\nOn the next fresh air we hear from David and next chef David also wrote the book clean about addiction research joined us\nFresh air is today at noon [noise]\nIn a quick look at current temperatures in West cliff it's thirty degrees the highest fifty seven in Trinidad thirty seven highest sixty two ... in Colorado Springs it's forty four degrees and high of sixty two today here as well sunny and dry across the region for your friday\nNPR on Ninety One point five through your cc is supported locally by solar roast coffee bringing organic coffee roasted with solar power from ... to king supers and natural grocers state wide and to sprout stores throughout the country so roasted at a low temperature to help create coffee to savor solar rose dot com\nBust who gives a scrap creative ... center a thrift store carrying a mix of new and used arts and crafts supplies scrap booking paper game pieces books and more now with their new location five twenty west Colorado who gives a scrap Colorado dot com\nSupport for NPR comes from this station and from the finance\nFive twenty west Colorado who gives a scrap Colorado dot com\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com [noise]\nFrom Rhodes Scholar and not for profit offering learning adventures for adults in natural settings across the country learn more at R. O. A. D. scholar dot org slash retreats\nAnd from gobble ... company that delivers semi prepped meals to be finished at home in Fifteen minutes with one pan gobble sous chefs do the prep work like chopping and marinating this week's menu is a global dot com slash NPR\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections in the United states let's take a moment to check on democracy in Afghanistan\nThe country has been planning parliamentary elections this weekend most of the voting will proceed but in a very large and populous province the voting has been postponed that front attack that left to senior officials dead including a top police chief\nPamela constable covers Afghanistan for the Washington Post and she's on the line walking to the program\nI'm Glad to be with you\nI guess we should figure out what we're supposed to happen this weekend what is the original plan what's at stake and what's the campaigning bin Laden\n[noise] um the original plan was to have a very\nBig nationwide election more than two thousand and five hundred candidates for two hundred and forty nine seats in parliament candidates of all all flavors and philosophies\nAh there was lots of excitement about the election but also lots of concern and worry partly because of threats by the Taliban which has now come true\nWell and partly widespread of widespread charges on that there was going to be massive fraud so you've seen a lot of positive uh campaigning a lot of new fresh faces a lot of enthusiasm but also a great deal of of worry a an an an anxiety at the same time\nSo you've been reporting that in Kandahar Province of really large an important province the voting will be delayed for a week but this does raise a question\nWhat was possibly going to be any different a week\nLarge important province the voting will be delayed for a week but this does raise a question what is possibly going to be any different a week\n[noise] right and we don't know that obviously that says a a measure of taken on an emergency basis\nUm just to to sort of calm things down and kind of hard to very large province which is tough loss it's police tape it's intelligence teeth and the governor has been gravely wounded um there's acute security vacuum people are very nervous and worried so I think this is obviously a measure designed for short term relief of that\nI'm obviously a decision will be made later on I I Would think and hope that that elections can be held there because it's a favorite populist lots and lots of voters but let's let's see what happens tomorrow um let's see if there's violence elsewhere or not\nUm and to what extent that happens how how bad it is I suspect a generally speaking out they're going to be taking famous one day at a time here\nDoes it feel and the rest of the country Pamela constable like a democratic process does do you feel like you're in the middle of a reelection campaign where the people's will be expressed\nI Do it does ah it's been it's been a a a nice experience so to speak out compared to previous elections here um you know record record numbers of candidates out and about a four hundred women are among the candidates with which is extraordinary\nA for a very traditional society like this one up on the other hand candidates although they've been busy an active have not been doing a lot of public campaigning they've been proved that they've been cautious\nThey've had inside events um it had a loudspeaker trucks but you have not seen a massive public rallies a few have been held in the provinces and some of those have been attacked\nI'm so and and as we mentioned earlier Ken you had candidates have been killed\nAnd well okay Pamela constable of the Washington Post in Afghanistan thanks so much\nHere very welcome\nTo the music means of his time restoring or the morning you were in Europe being home was two years old when you're in brought him to the United states from Mexico on a tourist visa they never left home was allowed to stay in the U.S thanks to the deferred\nAction for childhood arrivals program or doctor and he went to law school in two thousand twelve it was around then that he meant already on it and we'll see you on a bus you leader asked her on a date and that's when the cone told her that he was undocumented\nAri on an air most CEO on a bus you leader asked her on a date and that's when the cone told her that he was undocumented\nTo make you feel apprehensive about dating me\nNo it didn't make the apprehensive it was almost like it's okay it's cool but not even fully grasping what that meant I was a U.S born citizen and I think I didn't realize I Would start living some of that indirectly through spending time with you\nSo it started working as an immigration attorney it's where to be undocumented it's weird to be in those officers with somebody else all sorts of same situation you mentioned to me that sometimes are scared of yours or of nervous when I go to immigration court or when I go to eyes\nBecause I imagine you going in there and talking smack and just kind of standing affair clients and I just imagine you saying the wrong thing [laughter] come you the truth have you ever been afraid\nI'm I'm always afraid [laughter] um when I went to my first I check in with a client on the fourth floor and it's just complete packed to the brim and you cannot walk around and it's very hot as almost suffocating sometimes I'm curious if they know about my status\nYeah we've kind of ... an unspoken system for you telling me in the morning that you will be at a nice check in and then I said please be careful and then you tax me when you're out and safe and they said\nThank God but it does way me down a little bit it is a very specific cloud hanging over us [noise] it just feels like we're at pause travel plans are paused long term plans or ... you know we ... we want to\nA house we really can't take too many steps in any direction until we had this resolved so it is hard\nWanted our wedding day feel like for you\nUm I think I I thought that piece\nYeah like it's a it's it's a start up something new for us we've been together for over five years now\nYou've been very supportive and burger and [noise]\nAnd so many ways\nI Wonder how you feel when you no longer have\nThat title of undocumented person but I'll be there with you\n[noise] so [noise] ready to her\nThat was your terribly comb already on it are mostly um although they were married earlier\nReady to her [noise]\nThat was your uh Carol become an already on it or most of them although they were married earlier this year it's unclear whether it be comb will receive a green card and become a permanent residents\nBut interview was going to be archived along with hundreds of thousands of others at the library of Congress [noise]\nMajor support for StoryCorps comes from Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs\nLove it's what makes us Subaru Subaru learn more it Subaru dot com\n[noise]\nThis is NPR News\nThe Affordable CARE Act is a central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden now chooses to go without insurance like I don't have it back right now it's terrifying\nNow about three miles away in another hundred to be home we spoke with Shane of late for them\nTo come in and of course it's all campaigned ... everything else right back here\nShe is a middle school teacher who's running for city council and we seem to have nothing at all in common with on a killer and again these are two women who politics are motivated by the same emotion fear she noises said she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people were just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds of Latino students at my school that we're going to be terrified what what was going them they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nIt definitely has an effect on how they learn\nWhen you're living in fear it's really hard to learn about things like cells and body systems and I have several students who we've been trying to get their parents to come in for conferences or to discuss their child's individual\nAnd\nI have several students who we've been trying to get their parents to come in for conferences or to discuss their child's individualized education plan that won't come because they're afraid of getting picked up and the students have shared with me and my mom doesn't have paper so we don't leave they can't they're afraid to come to school\nSheena late this is a Democrat and that's the way she's going to be voting next month for Harley router over Republican congressman Dana Rohrabacher but she says what she wants most is lawmakers who are willing to work with the other side\nI have to believe that there are people on both sides of the aisle that really do want to work together that this divisive and that's I really\nWant to believe that that's not who we are as a nation\nBecause it's it's amazing just as a journalist who watches these debates from afar um it seems like so quickly\nYou're labeled as someone who just wants to protect immigrants in this country doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges\nThat is how it looks if you're reading things on the Internet but if you're out there in the community and you're walking with us you'll see that there's far more than it does bring us together then divides us\nAnd so you'd be ready to to to settle people down here we are just calling the president racist and say that's that's not helpful let's let's try and work through this\nI I Would do that absolutely I don't know that I Would\nActually be able to come out and say he's not racist but I think I could say something along the lines of continuing to push that narrative is not helpful what is something that we can talk about that is helpful\nThat was the voice of ... life is and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News\nThe magnitude springs\nLibrary invites you to celebrate Halloween with daily news stories over\nAt the community congregation church of managing springs more information on the ... the or the or\nNew film beautiful boy is based on the memoir by David\nThe or\nThe new film beautiful boy is based on the memoir by David Sheff about his son Knicks addiction\nTo run from being just one of the most sort of light filled extraordinary people I knew and he became this coast\nOn the next fresh air we hear from David and next chef David also wrote the book clean about addiction research join us\nFresh air with Terry Gross weekday that noon on southern Colorado was NPR station Ninety One point five K. R. C. C.\nThanks for making us the part of your friday morning I'm Abigail Batman and this is MORNING EDITION\nComing up on the marketplace morning report many link doctors over prescribing painkillers two opioid abuse but a start up in Nashville is acting as a watchdog for health insurers that plus all the morning's business news coming up in eight minutes at six fifty one [noise]\n... ... is thirty five degrees and high today of sixty in the hunter it's forty two high of Seventy two today that's a hot spot for the region and in Colorado Springs it's forty four degrees a high of sixty two\nSunny and dry for your friday similar temperatures for Saturday and Sunday high today in the fifties and sixties should be a beautiful autumn weekend\nProgramming on Ninety One point five K. R. C. C. is supported by the Colorado Springs independent newspaper featuring the twenty eight teams best job edition of belittle October twenty four through November six foot newsstands or at sea us in the dot com\nI'm David Greene doing much reporting here in orange County California but I might be going out a little field trip through after this\nThat's because well fans of a Halloween movie franchise can see the movie in theaters today in South Pasadena, California you can go see a certain old clobbered house to house\nUsed as Michael Meyers childhood home imagine getting up the courage to ring the doorbell when you're trick or treating this Halloween Night It's MORNING edition\nSupport for NPR comes from the station and from the ... foundation fostering improvements in learning and enrichment for disadvantaged children and the vitality of the arts for every one ideas at Wallace Foundation dot org [noise] from the size Sims found\nFor disadvantaged children and the vitality of the arts for everyone ideas at Wallace Foundation dot org [noise]\nFrom the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size seems foundation dot org\nAnd from the John ... Catherine the MacArthur Foundation at Mac found dot org\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep in Nineteen sixty five when President Lyndon Johnson went to Congress to propose the voting rights act he outlined some of the bill's provisions\nFinally this legislation will ensure\nThat properly registered individuals are not prohibited from voting\nBut even though when it comes to voter registration laws there is a good deal of confusion and in some cases controversy here's Noel King with commentator Cokie Roberts who answers your questions about our politics and government work\nAhead of this year's election some states have already closed voter registration while other states allow people to register at their polling places on election day what is the deal with this patchwork system what is the deal is going to jail All right here's our first listener question\nThis is claiming a heart from San Francisco California I'd like to ask Cokie whether voter registration laws were controversial before the voting rights act in Nineteen sixty five however laws changed since the court granted black citizens the right to vote of white citizens' based barriers to voter registration\nThe basic answer is yes voter registration laws were controversial at first people staffing the polls were just expected to know everybody didn't in their neighborhood\nBut then in Eighteen hundred Massachusetts instituted the first voter registration\nAnd as the century moved on it became more widespread partly in a move to make sure that non citizen immigrants didn't vote by the late Nineteen early twentieth century is a rural dominated state legislatures impose registration on city voters again it was named immigrants and at fraud by big city political machines\nAnd what about the rest of her question there what about the effects on black citizens versus white citizens'\nWell of course by men were given the right to vote in the fifties amendment in Eighteen Seventy but the Jim Crow laws and the south effectively\nStripped African Americans of their voting rights in terms of light of course white women and black women couldn't vote nationally until the nineteenth amendment and Nineteen twenty but you know before the sixty five bill a lot of whites in the south couldn't vote\nBlack women couldn't vote nationally until the nineteenth amendment and Nineteen twenty but you know before the sixty five bill a lot of whites in the south couldn't vote either just because the registrars in frozen the roles they didn't want anybody new voting\nAll right we have a couple of questions about current controversies\nMy name is Rachel ... from Shaker Heights Ohio why as a candidate for governor allowed to purge voter rolls shouldn't he recused himself a secretary of state while he's a candidate\nBut I assume this is in reference to Georgia Republican gubernatorial candidate Brian Kemp who is the current secretary of state and isn't thinking about refusing himself he's provoked a lawsuit by buddy more than fifty thousand new voter applications on hold for minor inconsistencies\nThe lawsuit charges discrimination saying eighty percent of those applicants are members of racial minority groups\nThough they can't vote early or by mail they can still vote if they show up the right polling place with the proper ID\nOkay that that idea of proper ID that gets right to our next question Hi my name is Amy payment tour and I live in Omaha Nebraska\nWhen I heard about the Supreme Court ruling the ideas for voting would need to have a street address it didn't faze me because I heard that a lot of Native Americans on reservations only have a post office address how is that going to affect their ability to vote\nWell they're complaining about it this has to do with the recent Supreme Court decision upholding in North Dakota voter id law which does require currently residential street address Native American groups say that off and on reservations they don't have those and ... the irony that the nation to original residents are being questioned about their residency\nA is coming up at nine o'clock that is right after MORNING EDITION\nGood morning I'm Abigail back then and this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs can't he see FEMA hunter KCBS stark male indicate WTC and than woodland park streaming K. R. C. C. dot ORG\nFEMA hunter KCBS stark ... double ... than woodland park streaming K. R. C. C. dot ORG a beautiful day expected across the region today sunny and dry with high in the fifties and sixties should be a little bit warmer for the weekend a great chance to enjoy that last little\nBit of follow the news is next it's seven o'clock ...\nGood morning California is a heavily democratic state where the Republican congressman won reelection for years [noise] so what happened to this fall Democrats trying to help MORNING EDITION\nComing up a California father and daughter in different generations and radically different politics I'm David Greene in Laguna Beach California\nAnd I'm Steve Inskeep in Washington we also hear a critique of the influence of Saudi Arabia and money executives in Silicon valley well from a lot of questions after the suspected murder of a journalist and also this hour Israel freezing American it was a pain to the airport for more than\nIt is friday October Nineteen Michael Steele the former chairman of\nCommittee is six years old\nNews is next\nLive from NPR News in Washington I'm more of a Coleman the death toll from hurricane Michael is at least thirty people officials in Florida have confirmed new fake Tyler teens damage remains widespread in the Florida Panhandle and Georgia agricultural officials are reporting billions of dollars in hurricane damage\nSeparately Virginia authorities are reporting another death from last month's Hurricane Florence at least fifty three people die from that storm in three states\nLess than three weeks before the November midterm elections a new poll suggests many rural Americans are optimistic about their economic future NPR's Kirk Siegler takes a look at the findings from NPR the Robert Wood Johnson Foundation and Harvard University's ... school of public help\nSome of the results in this poll run counter to stereotypes we often see perpetuated in the mass media or being pushed by some politicians that rural America is dying and emptying out just like in a city it depends on where you are many small towns have strengthening economy is with businesses moving in and people drawn there by the small town life style and the ability to work\nRemotely NPR's Kirk Siegler the Afghan government is delaying parliamentary elections in the southern\nBy the small town life style and the ability to work remotely\nNPR's Kirk Siegler the Afghan government is delaying parliamentary elections in the southern province of Kandahar this follows a Taliban attack Thursday that killed two senior security officials Jennifer glass reports from Kabul\nThe decision was made by Afghanistan's national security council after the Taliban killed Kandahar as powerful police chief and head of intelligence Thursday's attack inside the provincial governor's compound narrowly missed us and NATO Commander general ... Miller\nThe Afghan election commission which made the request to delay will announce the exact date the rest of Afghanistan is scheduled to vote Saturday turnout will be crucial for the first time there's an electoral role of eight point eight million the Taliban and Islamic state have both down to disrupt the vote and colon Afghans to boycott it\nVoter registration and political campaigns have been beset with violence ten candidates had been killed and two hundred and sixty others had been killed or wounded\nFor NPR News I'm Jennifer glass in Kabul\nPresident Trump's former campaign chairman Paul Manafort is heading to court today NPR's Carrie Johnson reports the judge wants to move ahead with the process of sentencing Manafort\nJudge ts Ellis says he wants to clear up what will happen with ten criminal charges on whichever junior jury deadlocked this year prosecutors say they'd prefer to leave the usual known until after Paul Manafort finishes cooperating with their investigation\nBut they say they will not object if the judge wants to dismiss that counts so long as they reserve the right to file them again a jury convicted Manafort filing false tax returns failing to file reports of foreign bank accounts and bank fraud\nManafort had asked to wear a suit to court but the judge denied that request reasoning that Manafort should be treated like any other defendant who's been convicted of a crime and remains in federal custody\nCarrie Johnson NPR News Washington You're listening to NPR\nNews it's seven oh four I'm Abigail Batman with Ninety One point five K. R. C. C. news marijuana sales in Colorado have exceeded one billion dollars as of August of this year and are on track to break last year's record of more than one and a half billion\nThat's according to a report from the state department of revenue\nColorado Springs that city council is set to vote next week on an ordinance regulating short term rental properties like air being bees and v R B owes its past the ordinance would require owners to get a permit from the city if they want to rent their home for less than thirty days out of time\nHe owes its past the ordinance would require owners to get a permit from the city if they want to rent their home for less than thirty days out of time\nAs part of the permitting process they'll need to show they have sufficient insurance and are paying sales taxes among other criteria city council president pro tem ... says council is still weighing whether to place a cap on the overall number of short term rentals in the city\nThere was a lot of discussion about that at the last meeting\nThat we don't want to our city could be overrun with with these types of rental products and so we will discuss that\nCouncil is slated to take up the ordinance that it's work session Monday opportunity for public comment and a vote on the issue is expected at city councils regular meeting Tuesday Afternoon\nResidents living in eastern El Paso county now have a public transportation option to get to Colorado Springs for things like medical appointments and grocery shopping a nonprofit called ... Vita is providing the bus service called the Callahan connection\nIt will travel on Tuesdays and Thursdays for five dollars each way you're listening to Ninety One point five K. R. C. C. News I'm Abigail Batman\nSupport for NPR comes from the do the investments taking a personalized approach to helping clients grow preserved and manage their wealth learn more at ... dot com slash wealth ... brokered services L. O. C. and Americans for the arts and Americans for the arts dot org\nIf you are looking for something to do in the Ninety One point for care see listening area shook out the community killed really care she sees a orgy and you can submit your events here as well [noise]\nIt's six minutes after seven o'clock I'm Abigail back then your host for MORNING EDITION on Ninety One point five K. R. cc Saudi Arabia invest heavily in us tech companies\nIf you have a start up and big dreams of changing the world making it a better place a lot of those people have been very happy to open up to Saudi investors\nOn the close ties between the Saudis and Silicon Valley and how that might change following the suspected murder of journalists Jamal ... that is ahead at seven twenty [noise]\nIn woodland park it's thirty five degrees a high today of fifty three and turn it on thirty nine I have sixty two and in Colorado Springs is forty six degrees of sixty two sunny and dry today\nThree and turn it on thirty nine highest sixty cute ending Colorado Springs it's forty six degrees of ... sixty two sunny and drank today across the region [noise]\nNow you can have the Ninety One point five cares he's the newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning\nUp at ... dot org [noise]\n\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California and I'm Steve Inskeep in Washington DC President Trump has acknowledged what increasingly seems like\nReality or a ... a reporter asked him do you believe a Saudi journalist us resident Jamal ... is that\nShow these [noise]\nAh it certainly looks that way I'm a very sad certainly look this\nMarks one of the few occasions on which the president has endorsed the broadly accepted outlines of the case ever since the Washington Post writer walked into a shouting consulate and vanished in Turkey\nSuspicion is falling on the Saudi Government get the president has suggested conspiracy theories about who could be responsible for a gruesome murder and said Saudi crown prince Mohammed bin Salman was being held guilty until proven innocent what does the U.S approach really mean for the Saudis and for Americans\nAnd for freedom of the press will talk that through with Victoria Nuland of the center for new American security she's on the line she was assistant secretary of state under President Obama ambassador to NATO under President George W. Bush morning or\nGood morning Steve ... you know watching\nFrom the outside what does President Trump's goal appear to be [noise]\nWell I think it's important that President Trump seems to have the knowledge reality as you said in your opening that this was a grisly murder of a journalistic criticism critic of the Saudi regime\nAnd that they're going to have to be consequences for this kind of extra territorial illegal act\nBut the president also said unfortunately this has captured the attention of the world that's a quote from yesterday making it clear it seems that this isn't really something he wants to be dealing with he would rather be making friends with the Saudis\nOn the next fresh air we hear from David and next chef David also wrote the book clean about addiction research join us\nThat is today at noon hope you can join us for fresh air on Ninety One point five K. R. C. C. [noise]\nYou're listening to MORNING EDITION it is seven twenty good morning I'm Abigail back then but have you with us on this Friday morning [noise]\nComing up voters in California's forty eighth congressional district could help determine control of the house\nWhy the Vietnamese American vote in orange county is key to the race that\nStory is just moments away and coming up at seven thirty an American student held at the Tel Aviv airport for two weeks has been allowed to enter Israel after winning her case at the country's Supreme Court [noise]\nIn West cliff it is thirty degrees a high today of fifty seven in Raton it's thirty degrees and high of fifty and in Colorado Springs it's forty sixty degrees the high today of sixty to dry and sunny across the region for your friday programming\nOn Ninety One point five through your cc is supported by the law firm of shook shocked and Gorman reminding listeners to Chuck batteries and carbon monoxide detectors for twelve years handling claims for those suffering from exposure to carbon monoxide more ... and ... dot com\nBy climate granted for Twenty years remodeling kitchens bathrooms with colors from around the globe granite courts are marble and more on display in the show room at thirty twenty more stone on line a planet rented taught us\n\nSupport for NPR comes from the station and from little passports a monthly subscription service for kids each package includes game souvenirs and activities from a new country designed to spark curiosity and cultures around the globe a little passports dot com slash radio\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template uh dragging drop email editor and twenty four seven customer service more\nStores worldwide with email template dragon drop email editor and twenty four seven customer service more at campaign monitor dot com\nAnd from Amazon Web services used by millions of customers a W s provide the range of cloud services and functionality from tools to security to compliance more information at build on dot a W s\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California there is a competitive race here\nIn California is forty eighth congressional district voters here might really help determine control of the house of representatives than we have been spending time\nListening to what is on their minds so this is Orange County it's home to the largest Vietnamese population in the United states' part of this district is actually known as little Saigon and the anthem trend lives here she works in community affairs for a utility company she is raising two kids\nHer parents also live in this community but she\nSays their lives and her's are so different\nMy parents are pretty much their lives are in little flag on my dad works at a pharmacy\nAnd so they're ... and for me I go out in the world I experienced racist that I Know what it feels like to be discriminate against I I think my parents have that because it really they their lives or hear their communities here they go to the ... they go to their customers are meeting these are our ... our diverse\nNow I realize my experience as an American very different from my dad\nAnd these generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on as being tougher on communist leaders some younger people like ten term trend has been leaning more democratic and that is one reason\nThe party believe they can unseat the Republican incumbent here\nSo when we went to visit the anthem trim we had heard there were some political differences in her family though I'm not sure she herself new quite how stark they were\nHigh high\nInvited us into her parents' home her kids were playing around they were eating snacks and they were orbiting around the grandfather [noise] how trend is the ... father he primarily speaks Vietnamese and his everyday life including when he talks politics with his daughter\nShe's been backing Republicans since ...\nMy father he primarily speak Vietnamese and his everyday life including when he talks politics with his daughter she's been backing Republicans since he first started voting in Nineteen Ninety two and he told me he was certainly no fan of president Barack Obama who he said just wasn't tough enough on the world stage\nWhom are going to look him very much\nAnd then what now I guess we're today we have Trump what do you think of Trump so far sofa\nIn describing the Hindu roots do what do you like what do you have\nYou're unemployed at the low uh-huh and um\nStock markets in Brooklyn in Greece and\nSo the economy is important to you yeah\nAnd this is this is um\nI open it [laughter] I didn't realize how he he thought of Trump because we haven't talked about that is the first time yeah I had a surprise 'cause then I'll have a conversation about the other stuff that he\nDoes against the media against like just a civil society we grow up knowing how democratic Vietnam is to crack down time frame that the press on basic human rights\nWomen don't have the same rights there and to see some of that happening now in America you know in some factions of government is scary because that was something that I never would imagine\nWe will be in a situation where we have a president said basically calling to press the enemy of the people like we hear that from communist Vietnam but we don't hear a you know I Would never have imagined that would be reality here today\nCould you say that you're dead and yeah I'm just I just wonder why when Trump calls the media enemy of the people\nWhat your reaction to that\nMenu of all I like all goal goal and so yeah about GM neither of them\nAre from time to press talk about what these things are\nWhere they don't care about it through thing\nYou're ... so yeah CNN again from would fall to both him\nSo they're not there by us yeah Fox News clearly is by it and I don't know if you're does examining the al\n... and a lot I think it allows apple I'm Trump boxes like travelling or you know make a phone [laughter]\nYou think do you think the media\nIs too negative about Trump it's not fair\nRussia interfered in through the election in this country ...\nTo say that Russia interfered in through the election in this country mhm\nBut when they know that for I said oh I shouldn't before the election [noise] the way until drum both elected and the makers shoot\nSo if if they find out that Trump worked with yeah the Russians where that would that bother you yeah\nBut you don't get your don't believe that yeah [laughter]\nThey're doomed proven that don't need to believe them\nYou know through the medical aid FBI then just don't know which as job no doubt hall he believes\nThat the Mueller investigation should continue so that they have we have the facts I agree with that\nYeah to some of you agree on yeah\nThere are a lot of families who've been divided over\nTheir views of Trump what is your like dinner conversations that yeah but go really badly in I mean people get it from the table yeah it I mean this is it doesn't seem to be happening in this\nNo because I don't think our country should be torn apart because if one person\nI clearly am strongly against you know what the president stands for\nBut I also believe it's important to me I respect my parents I Know what their experience has been and and we came here so that we can have the freedom to have different views to have these kind of conversation is if they don't happen in Vietnam and so the fact that my dad has a different view from me on this particular issue that doesn't bother him because we have that freedom and that's why my parents' lead Vietnam to be here in the first place\nEverybody got to go to vote yes you would for toys\nAnd for future either we're thinking\nTo think everybody should vote yeah\nAnd my father I didn't mention any he oh after the war he was\nA political prisoner for about ...\nMinutes two year three years he was held in a political concentration camp I Know they\nThey do a re education to get him\nYeah we're the communist try to stay there you know basically get him to change his thinking\nIt's powerful to hear you say that people should vote coming from mhm the history that you have\nYeah I just think we need to look to protect our democracy\nDo water bowl we would drone motorized ... roam the\nWe make it dry however the other hand you have a ... that was ten term trend\nWe were wrong the next time we make it right now we have we have a ...\nThat was the anthem trend and her father couch trend there to voters here in orange County California and we're going to take you to other corners of this district elsewhere on the program this morning this is NPR News\n\nThe Affordable CARE Act is a central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden and now she's just to go without insurance like I don't have a back\nIn the bowels of these institutions\nThere is a generation of younger people who frankly do not believe the stories\nThat their elders and their elders are like in their thirties and forties the case of Silicon Valley do not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the very power they wield and the privileged they wield that some of the people who founded these companies have been catastrophic Lee blind to\nOn a bearded us is the author of the book winners take all thanks very much for coming by\nThank you Steve are an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we're more from NPR's Daniel Estrin in Jerusalem lower\nCost them is twenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nAll costs them used to ... to small chapter of a pro boycott student group but now she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nAnd then I have come up with a band that\nForeign minister the peaceful to Bailey told Israeli radio\nIsrael and then I thought I was up there and that\nDeputy foreign minister see peaceful to Bailey told Israeli radio last week that Israel's ban on all costs him was not very successful she said Israel should reconsider how it applies at century band when it turns into an international issue we lose more than we when she said\nBut Israeli strategic affairs minister ... done who led Israel's campaign to ban all cost them defended the move\nBring him to the time he said don't just look at articles in New York Times and the media is critical of Israel argued there are thousands of pro Israel students in the U.S will contend with pro Palestinian activists on campus\nWho will support our move without cost them proponents of the boycott they've asked meant and sanctions movements say there peacefully protesting Israel's treatment the Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy as a country\nLaura al ... case reached Israel Supreme Court which ruled that are caused some had not been involved in boycott activities for more than a year and had demonstrated an academic curiosity about Israel she was released from the airport yesterday ... is her lawyer it's a victory for free speech\nAcademic freedom and there were a large ... that thought policing had absolutely no place in a democracy\nA right wing Israeli activist group said it would be closely monitoring all costs him during her time in Israel to ensure she did not promote a boycott the Hebrew University of Jerusalem which had supported al ... case in court said it looked forward to having her on campus next week Daniel Estrin NPR News Jerusalem\nThis is NPR News\n[noise]\nOoh\n[noise]\nThe Ninety Colorado Springs cool Science Festival is a celebration of all things steam science technology engineering and math\nDozens of special events various venues throughout the region October Thirteen to twenty\nInformation ... data weren't gee\nHave taken to the streets like never before this cannot be the America that we always asked the question that we're going to see in the next election is whether or not meaning organization some dumb necessary work and getting people out to the poll I'm Amy Walter and we'll take stock of all that next time\nWhether or not meaning organizations of done messes are worth giving people well to the poll\nI'm Amy Walter and we'll take stock of all that next time on the take away from WNYC NPR rye public radio international\nThe takeaway weekday morning at eleven o'clock on Ninety One point five K. R. C. C.\nBut first still to come in these last few minutes of the seven o'clock hour of MORNING EDITION\nThe Nineteen Seventy eight Halloween movie was directed by John Carpenter who also composed it's creepy minimalist score there's a new Halloween and carpenter has scored Michael Meyers twenty Eighteen homecoming that story is at hand at seven fifty one\n\nIn ... it is thirty three degrees a high today of fifty six sunny skies expected\nIn the hunter is forty two degrees sunny in a high of Seventy two that is the warmest spot in the region today and in Colorado Springs it's forty six degrees a high today of sixty two and sunny sky is expected for Colorado Springs as well\n\nNow you can have the Ninety One point five ... newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning\nSign up at ... dot org\nRebuttal gotten away with this crime it might have suffered from\nMadeleine broke into a shoe store in Roanoke, Virginia and took seven Jews out of it as a window where only rice shoes were displayed awkward for walking getting off the wrong for the beef dropped a backpack containing the shoes\nInside of police found the suspects a student ID or the sweat shirt with the prophetic words call my lawyer It's MORNING edition\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com\n[noise] from I drive maker of remote PC providing real time remote access to PCs max and servers from anywhere for use when telecommuting or for remote management learn more at remote PC dot com slash NPR and from Americans for the arts\n\nIs MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep for United States is not the only country debating how to protect its southern border\nMORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep the United states is not the only country debating how to protect its southern border\nMexico the country to the south is also trying to secure its southern border the border with Guatemala\nAuthorities are sending soldiers immigration agents and federal police there they're aiming to stop a caravan of migrants who are hoping to leave Central America and in some cases cross through Mexico on to the United states James Frederick reports from so you're not at all go Mexico\nTwenty three year old Honduran daisy crews who says she's playing an abusive gang member boyfriend crust into Mexico two weeks ago but then on Thursday she turned around after making a decision to head back south towards the border with Guatemala to join a rally for the migrant caravans\nWhen\n\nShe says she came to support her fellow hunger and to be here so they don't feel alone crew's\nJoined about fifty other migrants an activist since you like that goal a town that sits on the Mexico Guatemala border\nPolice and activists soon clashed in\nChaos broke out and you can hear in the cell phone video from the sea [noise]\n\nIn the video police cramped eating ... Mexican American migrant activists who helped organize a similar migrant caravan in the spring the first part to President Trump's higher federal police alleged ... previously vandalized an immigration vehicle\nAs migrants trying to stop because of rest crusade police got rough with everyone even women and children\nThey made me she says an officer told her to shut up they pointed a gun to her seven year old son and\nThreatened to kill him to others present during the incident corroborated her story\nSpokesmen for Mexico's federal police tells NPR he was not aware of this specific incident and says activists initiated the aggression to clash and the Mexican border town is a foreboding sign of what has to come as a caravan of thousands gets closer\nDozens of federal police in riot gear have already been stationed on the bridge connecting Mexico in Guatemala Mexico human rights commission came to see like you go to try and head off the tensions the group's spokesman at golf course or Sosa says he wants to Mexican police to keep one thing in mind is the caravan approaches\nTo assemble ... senior cells and uses for fighting for the rights of Mexicans to be represented in the U.S he says the least we can do is respect the rights of our Central American\nShe is so unusual for fighting for the rights of\nMexicans to be reflected in the U.S he says the least we can do is respect the rights of our Central American brothers and sisters here in\nMexico while most are still underway about four hundred migrants from the Caribbean or already just across the border and the Guatemalan town\nOf ... with mine [laughter]\nIt's a peaceful compared to the clashes next door in Mexico families relaxing the shade chatting and laughing and eating and drinking donated food and water\nThat you have a twenty nine year old single mother of four who says her family is fleeing gang violence doesn't want any trouble with a sword plus it does have a son that fast\nShe says we come with a spirit of peace with no intention to use violence nothing like that were just looking for a\nBetter life but as things stand now raised her children and the other migrants will be ... by force at the Mexican border for NPR News I'm James Frederick infused though you die go Mexico\nThanks for listening to your public radio station which brings you MORNING EDITION you can get the latest news this afternoon on all things considered and follow us anytime on social media you can find all your morning edition host on Twitter if you'd like I'm nprinskeep\nYou can catch the friday news around ... in just about an hour and that starts at nine o'clock they say the southern Colorado NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ISI Stephen Hunter ... anti double use these the F ... park\nStreaming ... Don orange eat should be a beautiful day today across the region sunny and dry was hide in the fifties and sixties warming up just a few degrees for the weekend like a great chance to enjoy\nThat last little bit of fall headline news is coming up next it's eight o'clock\nMorning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't such a tough fight coming up on MORNING EDITION from\n... congressmen from here wants to keep his job we'll hear why isn't such as by coming out on MORNING EDITION from\nThat's our mid term voter series just west we'll hear from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like knows she has employed and should be allowed to stay at a wealthy entrepreneur on why he's left a GOP after voting for Republicans turned\nI'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington DC Afghanistan\nParliamentary elections violent means some or postpone\nThis Friday October Nineteen actor John ... goes Seventy through the news is next\nLife from NPR News in Washington I'm core of a Coleman President Trump says it certainly looks like missing Saudi Arabian journalist Jamal ... gene is dead Turkish officials claim they have recordings that proved ... was killed in a Saturday constantly in an instant bull a charge the Saudis deny\nTrump says if Saudi Arabia is to blame the response will be quote very severe\nAfter talking about ... Trump attended a rally in Montana last night and praised a Montana Congress men who attacked a reporter last year NPR's Don Gonyea reports the issue involved congressmen Greg gene four day\nGene forte was elected in a special election in twenty Seventeen that's when he assaulted a reporter from the guardian newspaper he pleaded guilty to misdemeanor assault last night the president ... visited that attack calling Jean forte quote my kind of\nGuy that your body [noise] the president\nRecalled first hearing of the assault and I said oh this is terrible he's going to lose the election then I said well wait a minute\nI Know Montana pretty well\nIt might help them today Trump campaigns\nIn Arizona which has a close US Senate race Don Gonyea NPR News Missoula, Montana\nMore than a week after hurricane Michael slammed the Florida Panhandle cities and towns are facing the daunting task of trying to rebuild NPR's Debbie Elliott reports on the clean up in Port saint Joe a coastal Florida town at least should smiley and her brother are clearing out the apartment she shares with her disabled grandmother here already\n\nSee formulas\nBut she shares with her disabled grandmother\n\nSays formulas inundated by storm surge and now most of their belongings are piled on the curb\nDevastating um is depressing um\nYou know I Try not to think about it too hard but it's been a lot of people coming and helping our we can do is appreciate any and everybody that comes in and\nOut thank you is not good enough\nPower is slowly coming back but down trees and debris line just about every street in town Debbie Elliott NPR News port saint Joe Florida\nElection officials in Afghanistan are delaying upcoming parliamentary elections in a southern province and beers dia de ... reports from Islam about this follows yesterday's assassinations of the powerful police chief of Kandahar\nThe police chief was assassinated by his buddy gone in a brazen Taliban attack in ... during a high level meeting in Kandahar to discuss security plan so parliamentary elections expected the Saturday\nNow voting will be delayed in Kandahar by one week it throws even more uncertainty around the elections which have already been ... by deadly militant attacks and controversy NPR\nThe DEA indeed on Wall street the Dow was up two hundred and ten points the NASDAQ he's a well over one percent it's Seventy five hundred Seventy five this is NPR\nIt's eight oh four I'm Abigail Batman with Ninety One point five K. R. C. C. news\nThe city of Pueblo has scrapped plans for a new homeless shelter in the city a public hearing was expected Monday on the purchase of a property on east fourth street and another location close by but cost to modify the space were higher than originally anticipated\nThe chief in reports the city was set to budget and appropriate four hundred Seventy five thousand dollars from this year's general fund reserves to acquire the properties that city would have owned the buildings and contracted with a third party to operate the shelter\nUtah's governor declared a state wide emergency this week due to drought as the mountain west news bureau Eric Newman reports it's one of two states in our region that are feeling the heat Peter\n... is a drought specialist at Colorado State University He says the droughts in both Utah and Colorado come down to two things\nOne coupon at or near record low snowpack in western Colorado in eastern Utah followed up hot and dry summer has made\nAt or near record low snowpack in western Colorado in eastern Utah followed up by the hot and dry summer has made the twenty eight drought historic\nIt was Utah the driest year on record in Colorado second since records were collected in the late Eighteen hundreds Google says well seasons very climate change just playing a part over the long term\nWe're definitely setting more highest temperature records then lowest temperature records\nHe says if the warming trend keeps up it will continue to increase evaporation and will feel it more in a dry year like this one for the mountain west news bureau I'm Eric Newman\n... Ninety One point five K. R. C. C. news\nSupport for NPR comes from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and I owe the solutions learn more at the three I O T dot AI and the ... foundation at ... dot org\nNinety One point five ... has been southern Colorado's NPR station since Nineteen eighty four discover more ... dot org and follow us on Facebook and Twitter [noise]\nGood morning how you're doing well on this Friday it's October Nineteen\n... and you're listening to MORNING EDITION on Ninety One point five\nK. R. D. C. [noise] an undocumented immigrants who lives in the U.S legally at least for now\nHas taken an unusual path\nSo I started working as an original Journey Through to be in those offices with somebody else who also is simply to ration\nComing up this man and his American wife talk about their hopes to make it legal status permanent\nThat's on StoryCorps coming up at age twenty\nProgramming on Ninety One point five K. R. C. C. is supported by the Rocky Mountain women's film festival November ninth through the eleven\nWere thirty one years presenting films through the female looms documentaries too short and features the animated film festival at R. M. W. film fest dot org\nBoy who gives his ... sooner the thrift store carrying a mix of new and used arts and crafts supplies scrap booking paper game pieces books and more now with their new location five twenty west Colorado who gives a scrap Colorado dot com [noise]\n\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California and the waves behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine whether Republicans hang on to control of the house Republican congressman Dana Rohrabacher\nHas served the forty eighth congressional district here for nearly three decades but there is a political newcomer Democrat Harley wrote a who seems to have a shot at and feeding him this district that has been moving to the left and we got a hint of why that is the other night\nWe were in Laguna the gal with one of the super wealthy towns in the hills above the Pacific\nHere and this is where it's a very rich voters are changing the political landscape or give him again Daniel that was the editor\nEric giving his name so we could pull through the gates we then went up to a house where there was a Porsche parked\nIn front of this huge fountains and our host to raid Antonio brought us inside David nice to meet to\nAntonio is Iraqi American he moved from Baghdad to the U.S when he was six years old he served in intelligence in the U.S military and then he made a bundle running and then selling medical device companies that's where his politics\nI was a Republican for thirty one year and when I actually uh turned Eighteen and and and joined the military we were just coming off of what you know Ronald Reagan being president and and really the strong stance he had against you know Russia and Gorbachev and his charm and charisma was really cool to be a Republican at the time\nThe next fresh air we hear from David and Nick chef David also wrote the book clean about addiction research join us\nFresh air is today at noon [noise] this is southern Colorado was NPR station Ninety One point five K. R. C. C.\nIn California the Democrats are hoping to flip\nColorado's NPR station Ninety One point five K. R. C. C. I'm Abigail Batman [noise]\nIn California the Democrats are hoping to flip a reliably Republican House seat but it won't be easy\nFrom what I'm hearing if they get powered all they're going to do this investigation impeach that doesn't when my heart just ahead what voters in states forty eighth district are saying about the upcoming midterm can catch that story at eight thirty [noise]\nIn woodland park it is thirty three degrees and sunny today with a high of fifty three in Pueblo at forty six to high of sixty six sunshine in the forecast end in Colorado Springs we have forty six degrees sunny here today as well with the height of sixty two degrees [noise]\nIt is eight twenty and you're listening to MORNING EDITION [noise]\n\nProgramming on Ninety One point five through your cc is supported by into credit union and business banking is committed to comprehensive solutions to help solve small business challenges including business trucking details at ... dot com slash business judging federally insured by in the usa\n... recognizing the people are happier when their technology works since two thousand one member guy who's been delivering Cisco Systems network security consulting and stress relief sprinkle into the office dog ... dot com\n\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda ... Paul Riser and Catherine hon a new episode every Friday on prime video from\nT. I. A. T. I. A. is\nCommitted to helping those who are driven by purpose reached their definition of success investing advice banking retirement learned more it T. I. E. A. dot org\n[noise] from logged me in makers of go to meeting the collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\nAnd from Americans for the arts\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections ... let's take a moment to check on democracy in Afghanistan\nFrom NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections in the United states let's take a moment to check on democracy in Afghanistan\nThe country has been planning parliamentary elections this weekend most of the voting will proceed but in a very large and populous province the building has been postponed that run attack that left to senior officials dead including a top police chief\nPamela constable covers Afghanistan for the Washington Post and she's on the line more to the program\nI'm Glad to be with you I guess we should figure out what we're supposed to happen this weekend what is the original plan what's at stake\nAnd wants to campaigning bin Laden\n[noise] um the original plan was to have um a very big nationwide election more than two thousand five hundred candidates for two hundred and forty nine seats in parliament candidates of all all flavors uh and philosophies\nAh there was lots of excitement about the election but also lots of concern and worry partly because of threats by the Taliban which has now come true\nWell and partly widespread of widespread charges on that there was going to be massive fraud so you've seen a lot of a positive uh campaigning a lot of new fresh faces a lot of enthusiasm but also a great deal of of worry a and and and anxiety at the same time\nSo you've been reporting in Kandahar Province of really large and important province the voting will be delayed for a week but this does raise a question what\nIs possibly going to be any different a week [noise]\nRight and we don't know that obviously this is a measure of taken on an emergency basis\nUm just to to sort of calm things down I mean kind of hard to very large province which is tough loss it's the least have its intelligence teeth and the governor has been gravely wounded um there's acute security vacuum and people are very nervous and worried so I think that there's obviously a measure designed for short term relief of that\nI'm obviously decision will be made later on I I Would think and hope that that elections can be held there because it's a favorite populist lots and lots of voters um but let's let's see what happens tomorrow um let's see if there's violence elsewhere or not\nUm and to what extent that happens how how bad it is I suspect a generally speaking out they're going to be taking famous one day at a time here\nDoes you'd feel and the rest of the country Pamela constable like a Democrat\nGenerally speaking they gotta became famous one day at a time here\nDoes it feel and the rest of the country Pamela constable like a democratic process does do you do feel like you're in the middle of a reelection campaign where the people's will might be expressed\n[noise] I Do it does it's been it's been a a a nice experience so to fake compared to previous elections here um you know record record numbers that candidates out and about a four hundred women are among the candidates with which is extraordinary\nFor a very traditional society like this one on the other hand candidates although they've been busy an active have not been doing a lot of\nPublic campaigning they've been recruited they've been cautious that inside events um it had a loudspeaker trucks but you have not seen massive public rallies a few have been held in the provinces some of those have\nBeen attacked [noise] um so and and as we mentioned earlier that you had candidates have been killed\nAnd well okay Pamela constable of the Washington Post in Afghanistan thanks so much\nHere very welcome\n... ... ... that music means of his time restoring order this morning and you were in general being home was two years old when parents brought him to the United states from Mexico on a tourist visa they never left the cone was allowed to stay in the U.S thanks to the deferred\nAction for childhood arrivals program or doctor and he went to law school in two thousand twelve it was around then that he meant ... air most CEO on a bus you leader asked her on a date and that's when the cone told her that he was undocumented\nDoes it make you feel apprehensive about dating me know and it didn't make the apprehensive it was almost like it's okay it's cool but not even fully grasp what that meant the U.S born citizen and I think I didn't realize that I Would start living some of that indirectly through spending time with you\nSo I started working as an immigration attorney it's where to be undocumented it's weird to be those offices with somebody else ... you mentioned to me that sometimes you're scared of your share of nervous when I go to immigration court or when I go to eyes\nBecause I imagine you going in there\nAnd just kind of standing affair clients and I just imagine you saying the wrong thing [laughter] come you the truth have you ever been afraid\nI'm I'm always afraid [laughter] um when I went to my first I check in with a client on the fourth floor and\nTell me the truth have you ever been afraid I'm I'm always afraid [laughter] um when I went to my first I check in with a client on the fourth floor and just completely packed to the brim and you cannot walk around and it's very hot it's almost suffocating sometimes I'm curious to know about my status yeah\nWe've kind of unspoken system for you telling me in the morning that you will be at a nice check in and then I said please be careful and then you text me when you're out and safe and they said\nThank God but it does way me down a little bit it is a very specific cloud hanging over us [noise] it just feels like we're at pause travel plans are paused long term plans are ...\nBuy a house we really can't take too many steps in any direction until we had this resolved so it is hard [noise]\nWhat did our wedding day feel like for you\nUm I think I I thought that piece yeah like it's it's\nIt's a start up something new for us we've been together for over five years now\nYou've been very supportive and burn Karen [noise]\n[noise] and so many ways\nI Wonder how you feel when you no longer have\nThat title of undocumented person but I'll be there with you\nSo ready to [noise]\nThat was your terribly calm and carry on it or most CEO although they were married earlier this year it's unclear whether it be comb will receive a green card and become a permanent residents\nAnd interview was going to be archived along with hundreds of thousands of others that the library of Congress [noise]\nMajor support for StoryCorps comes from Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru Subaru learn more it Subaru dot com\n[noise]\nThis is NPR News\nThe Affordable CARE Act is a central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden now chooses to go without insurance like I don't\nVoters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden now chooses to go without insurance like I don't have it\nNow about three miles away in another hundred new beach home we spoke with Shane of late for them\nTo the cabinet quarters at the all camel band ... everything else right back here\nShe is a middle school teacher who's running for city council and we seem to have nothing at all in common with on a killer then again these are two women who politics are motivated by the same emotion fear ... said she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people were just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds of Latino students at my school that we're going to be terrified ... was doing them they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nWhen you're living in fear it's really hard to learn about things like cells and body systems\nAnd I have several students who we've been trying to get their parents to come in for conferences or to discuss their child's individualized education plan that won't come because they're afraid of getting picked up and the students have shared with me and my mom doesn't have paper so we don't leave they can't they're afraid to come to school\n... this is a Democrat and that's the way she's going to be voting next month for her Lee router over Republican congressman Dana Rohrabacher but she says what she wants most is lawmakers who are willing to work with the other side\nI have to believe that there are people on both sides of the aisle that really do want to work together that this divisive mass I really want to believe that that's not who we are as a nation\nIt's it's amazing just as a journalist who watches these debates from afar um it seems like so quickly you're labeled as someone who just wants to protect immigrants in this country doesn't care about this\nLike so quickly you're labeled as someone who just wants to protect immigrants in this country doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges\nThat is how it looks if you're reading things on the Internet but if you're out there in the community and you're walking with us you'll see that there's far more than it does bring us together then divides us\nAnd so you'd be ready to to to settle people down here we are just calling the president racist and say that's that's not helpful let's let's try and work through this\nI I Would do that absolutely I don't know that I Would actually be able to come out and say he's not racist but I think I could say something along the lines of continuing to push that\nNarrative is not helpful what if something that we can talk about that it's helpful\nThat was the voice of Sheena laces and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News the Japan\nAmerican society of southern Colorado will hold their annual cultural festival in these are on the easiest campus October twenty of more information on this and other public service announcements can be linked\nTo see that or ...\nProtesters have taken to the streets like never before this cannot be the America that we all said\nThe question that we're going to see him the next election is whether or not banning organizations have done this or worked in getting people out to the poll I'm Amy Walter and we'll take stock of all that next time on the take away from WNYC NPR ride public radio international\nStay with us from the takeaway starting this morning at eleven o'clock followed\nFresh air at noon it is friday October nineteenth hope you're doing well this morning I'm Abigail Batman and this is Ninety One point five K. R. C. C.\nComing up on the marketplace morning report many linked doctors over prescribing painkillers two opioid abuse but it started in Nashville is acting as a watchdog for health insurers that plus all the morning's business news coming up at eight fifty one on the marketplace morning report [noise]\nHealth insurers that plus all the morning's business news coming up at eight fifty one on the marketplace morning report [noise]\nIn West cliff it's thirty three degrees and sunny in a high of fifty seven today in Trinidad forty sunny a high of sixty to end in Colorado Springs me have forty six degree in the high end sixty two today and sunny skies expected\n[noise] my name is Andrew in charm president and owner of monuments occupational medicine in monument Colorado for targeted audience are owners of companies HR professionals safety managers and injured workers and so the medical care that they need to get\nBack to work or CC's helped us quite a bit and we are able to obtain a lot of access to individual we normally wouldn't have access to through other means of advertising\nYou would like to become an underwriter like me who's called genetic seven when nine four seven three for eight zero one\nMorning I'm David Greene doing election reporting here in orange County California\nBut I might be going on the little field trip through after this\nMess because well fans of a Halloween movie franchise can go see the movie in theaters today in South Pasadena, California you can go see a certain old clobbered house to house\nUsed as Michael Meyers childhood home imagine getting up the courage to ring the doorbell when you're trick or treating this Halloween Night It's MORNING edition\n\nSupport for NPR comes from this station and from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep in Nineteen sixty five when President Lyndon Johnson went to Congress to propose the voting rights act he outlined some of the bill's provisions\nFinally this legislation will ensure that properly registered individuals are not prohibited from voting\nBut even though when it comes to voter registration laws there is a good deal of confusion and in some cases controversy here's Noel King with commentator Cokie Roberts who answers your questions about how politics\nGood deal of confusion and in some cases controversy here's Noel King with commentator Cokie Roberts who answers your questions about our politics and government work\nAhead of this year's election some states have already closed voter registration while other states allow people to register at their polling places on election day what is the deal with this patchwork system what is the deal is going to jail All right here's our first listener question\nThis is ... heart from San Francisco California I'd like to ask Cokie whether voter registration laws were controversial before the voting rights act in Nineteen sixty five however last changed since the court granted black citizens great vote have white citizens or seized barriers to voter registration\nThe basic answer is yes voter registration laws were controversial at first people staffing the polls were just expected to know everybody didn't in their neighborhood but then in Eighteen hundred Massachusetts instituted the first voter registration\nAnd as a century moved on it became more widespread partly in a move to make sure that non citizen immigrants didn't vote by the late nineties early twentieth century is a rural dominated state legislatures impose registration on city voters again it was aimed immigrants and at fraud by big city political machines\nAnd what about the rest of her question there what about the effects on black citizens versus white citizens'\nWell of course black men were given the right to vote in the fifties amendment in Eighteen Seventy but the Jim Crow laws and the south effectively stripped African Americans of their voting rights in terms of rights of course white women and black women\nCouldn't vote nationally until the nineteenth amendment and Nineteen twenty but you know before the sixty five bill a lot of whites in the south couldn't vote either just because the registration frozen the roles they didn't want anybody new voting\nAll right we have a couple of questions about current controversies\nMy name is Rachel ... men from Shaker Heights Ohio why is the candidate for governor allowed to purge voter rolls shouldn't he recused himself a secretary of state law he's a candidate\nBut I assume this is in reference to Georgia Republican gubernatorial candidate Brian Kemp who is the current secretary of state and this and thinking about using himself he's provoked a lawsuit by buddy more than fifty thousand new voter applications on hold for minor inconsistencies\nThe lawsuit charges discrimination saying eighty percent of those applicants are members of racial minority groups\nThough they can vote early or by mail they can still vote if they show up the right polling place was proper ID\nOkay that that idea of proper ID that gets right to our next question Hi my name is ...\nThey can still vote if they show up the right polling place with the proper ID\nOkay that that idea of proper ID that gets right to our next question Hi my name is Amy paying their chart and I live in a lot of ... when I heard about the Supreme Court ruling the ideas for voting would need to have a street address it didn't faze me\nAnd I heard that a lot of Native Americans on reservations only have a post office or dress how is that going to affect their ability to vote\nWell they're complaining about it this has to do with the region Supreme Court decision upholding in North Dakota voter id law does require a current residential street address Native American groups say that off and on reservations they don't have those and pointing I'd say the irony that the nation's original residents are being questioned about their residency", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Colorado Springs", "day": "19"}