{"month": "10", "state": "ID", "station": "KRFA", "content": "\n\n[noise]\nUh-huh [noise]\n\n\n\n\n\n[noise]\n\n\n\nThe pianist Les ... with that sentiment envy minor by use if heightened on northwest public broadcasting where Brahms variations on a theme by Haydn are waiting to be heard next\nThis is Kerry Swanson station manager you listen because this is where you can count on accurate insights of reporting and music that elevate your day this is your station if northwest public broadcasting is important to you then make sure it's here for you now and then the future\nBy giving it your support during the super Thursday fall pledge drive on October eleventh in these times of increasingly fractured information\nYou can make sure that this trustworthy source of news indoors\nBecome a new member or renew your annual contribution and make your donation one of the twenty five hundred needed to make this super Thursday's successful on October eleventh thank you\nCan actually make that pledge right now like count toward the goal donated N. W. P. B. dot org while you listen to the Columbia symphony orchestra conducted by Bruno Walter in this performance of the variations on a theme of Heiden by you hunt is from [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\nVariation on a theme heighten but you'll hunted Brahms played by the Columbia symphony orchestra conductor\nThe theme is really short the variations take a little more time sometimes you love something short short ribs short meeting short fund drives for example yep one day fund drive for northwest public broadcasting this Thursday October eleventh\nAnd you don't even have to wait a short time you can donate right now at N. W. P. B. dot org\nAnd have that pledge of yours count toward the goal to twenty five hundred for steeper Thursday if it's time for you to become the first time donor or renew your support do it now and it will count and you're really pledge will help keep the short fund drives the standard at northwest public broadcasting thank you so much\nTo pianist and Sergei rocks modern music Emanuel Ax and you seem ... men in the sweet number one for two pianos by ...\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[laughter]\nWe'll go back to\n\n\nAnd then [noise]\n\n\n[noise]\n\n\nNa na na na na na na na\n\n[noise]\nOn on on the\n[noise] [noise]\n[noise]\n\n[noise]\n\n\nMm\n\n[laughter]\nThe sweet number one for two pianos by Sergei rough modern off with the pianist Emanuel Ax and the FEMA Brahms men on northwest public broadcasting and W. P. B. dot org homeless super Thursday which is actually this week\nA couple of days away a goal to raised in one day as much money as could be raised in a week or ten days on another station you've done it before you can do it again you be the hero that makes up one day fund drive possible\nThe pledge count has already begun you can donate right now at N. W. P. B. dot org and make it killed for super Thursday when we need twenty five hundred members to take part to make it a big success to become a new donor or renew your support at N. W. P. B. dot org\nBenjamin Britten simple symphony born misinformed yet to lead by Ronald Thomas\n\n\n\nWhen you're in the\nDo\n", "year": "2018", "show_name": "This American Life", "city": "Moscow", "day": "09"}