{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\nFrom a PM American public media this is performance today I'm Fred Child\nComposer Robert Schumann suffered from all kinds of internal demons he battled debilitating anxiety and fatigue and self doubt and while he was reading this music he even had physical symptoms every day he felt itching and twitching all over his body\nAnd mentally he often had hallucinations and heard voices\nBut in the middle of all those difficulties and distractions Robert Schumann was capable of writing music of pure joy and sunshine coming up Robert ... symphony number two from a concert by the Los Angeles philharmonic [noise]\nThe wounded including for law enforcement officers after suspected gunman Robert power to open fire at the tree of life synagogue during the ceremony this morning authorities say the forty six year old is hospitalized and fair condition with multiple gunshot wounds FBI Director in charge Bob Jones says the suspects full mode of isn't clear\nThe actions person took today we're ... we're in the early stages of sophistication and or the next several days and weeks with a look at everything and the suspects life is home says vehicle to social media and his movements over the last several British\nJones says powers entered the synagogue shot and killed people and was leading when he encountered officers he says they believe he acted alone done things ... the head of the Jewish Federation of greater Pittsburgh says the attack as possibly the deadliest one of the Jewish community and history of the U.S [noise]\nMeanwhile President Trump is condemning the attack calling it horrific as NPR's Tamara Keith reports Trump says it's an act of anti Semitism\nIn prepared remarks President Trump said it was a wicked act of mass murder pure evil and unimaginable adding you wouldn't think such anti Semitism would be possible in this day and age\nViolated filled poison of anti Semitism must be condemned and confronted\nA form of religious or racial hatred for prejudice\nTrump said he had considered canceling his campaign rally in Illinois but then decided quote we can't let evil change our life and change our schedule camera Keith NPR News\nI'm fifty six year old Florida Man arrested in connection with potential explosives sent a prominent critics of President Trump is expected to be in court next week either say Iraq is charged with the illegal mailing of explosive along with other federal crime NPR's Martin Kaste the has more on the fact that\nThey are as a history of theft and drug violations and in two thousand two he faced charges after he threatened to throw a bomb during a phone conversation with the utility company his lawyer at the time Ron ... says there was no evidence to say I had a bomb but he thinks they opt does have a mental disability\nHe refused to even get diagnosed but his family and anyone who interacts with confetti he suffers from something he's certainly a doesn't have the right to or the ability to communicate the way you and I drew\nLowly also says the ... has been living in a van ... registered Republican and has been active on line and supportive President Trump\nOur news\nBillionaires made more money in twenty Seventeen than in any year in recorded history that's according to a new report by Swiss bank you'll be up more than two thousand of the world's billionaires grew they're combined wealth by one point four trillion dollars last year more than the GDP of Spain or Australia and fierce enemies and has more\nThe number of ultra wealthy people is growing fast in China where two new billionaires are meant it every week\nNinety seven percent of the Chinese billionaires are self made and many are in sectors such a technology or retail\nThe report says since twenty sixteen China has produced fifty companies with evaluation of at least a billion dollars\nJust behind the United states which produces sixty two billion dollar companies at the same time the wealth gap in both China and the U.S is growing\nBut the bottom forty percent of wage earners in the U.S seeing their wealth decline according to Moody's the IMF reports rising income inequality in China is out pacing many other countries in Asia\nChina than than NPR Newt\nFederal emergency management agency officials have some supplies to the U.S territory of the northern Mary on an island who's residents are dealing with power outages\nApplied and officials say the agency it's focused on opening the an airport and making sure cell towers operate they also want to focus on restoring the power at least one person died in the storm I'm Janine her to NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include pro quick who's literature online premium features worked from the eighth century could present day and makes minority authors works to discover all along with the western canon at libraries or ... dot com\nMm\nA little foreshadowing and the instrument playing the P. T. theme there from a PM American public media this is performance today I'm Fred Child taking you to concerts around the world\nWill go to Walt Disney hall in Los Angeles to hear the LA philharmonic played symphony by Robert ... in a few minutes but right now it's music by Argentine composer asked her appeal to a lot and he wrote the piece that we're about to hear for a friend of his\nWho played the double bass a piece called the ... well just got to be arranged\nIt becomes a showcase for the the Monica Ellen Sunday soon here alongside her colleagues in the money when they get this concert in Jacksonville, Florida controlled by the by al ...\n\n...\nOr a a\n\nKnown a long time\nA little a\nOh [noise]\nBoom\nTomorrow will be another cloudy day with a chance of rain highs will also be in the fifties\nAre you listening to an W. P. B. on the radio or are you hearing this on your phone or computer maybe a smart speaker this station stays up to date with technology to serve you in whatever way as most convenient for you get the N. W. P. B. app\nCome to an W. P. B. dot org or tell your smart speaker to play northwest public broadcasting we're\nAbout to hear from a concert at Walt Disney hall in Los Angeles music by Robert Schumann\nEighteen forty four was a rough year for sure he was suffering from\nAll kinds of problems both physical and mental\nVertigo terrible dizziness he had phantom pain you describe like knives poking all over his body [noise]\nHis wife Clara wake up in the morning and find Robert soaked in here and in a letter to Felix Mendelssohn Robert Schumann wrote I itch in which every day in a hundred different places [noise]\nSherman was desperate so he tried changing some of his everyday habits\nTo began drinking mineral water you stop smoking and he even changed the way he can pose instead of sitting back and waiting for inspiration he became methodical would sit down at the piano and forced himself to right at least some music\nEvery single day and in the middle of all that anxiety and pain and difficulty\nHe wrote a symphony for my life and [noise]\nThe symphony number two by Robert Sherman what's your Gustavo Dudamel conducting the Los Angeles philharmonic will pick it up at the beginning of the second movement and go from there to the end of the peace\n[noise]\n\n\n\n\n\n\nYour\nInsurance and sunshine in so much of that music by Robert Sherman way or the second third and fourth movement the final free movements from his symphony number two [noise]\nThat cancer was at Walt Disney hall in downtown Los Angeles conductor Gustavo due to melt lead to Los Angeles philharmonic [noise]\nLA philharmonic is celebrating its one hundredth anniversary this year and to mark the occasion they've unveiled a new project it's a new building for the youth orchestra of Los Angeles yolo for short\nThe big new building designed by Frank Gehry same architect to design that iconic stainless steel structure Walt Disney hall\nYoga the youth orchestra has aid ensembles for musicians from age five to ... age Eighteen Gustavo due to melt told the LA Times gross it's very important to me that the children in LA have this base where they can develop their own dreams construction for that new building for the ...\nArtist delivers an Sean dropping performance\nYou are listening to a PM performance today\nGood afternoon thank you for coming in and making northwest public broadcasting a part of your Saturday Mm\nYou can hear performance today every Saturday afternoon from two to four and every Sunday evening from seven to nine right here on the NPR and classical music service an N. W. P. B.\nThe shell will continue in a moment\nNorthwest public broadcasting received program support from what's been hospital and medical center in coal facts providing therapies including occupational speech and physical therapy for children and adults\nTreatment options also include massage and aquatic therapy for information that three nine seven thirty four thirty five or which meant hospital dot org broadcast\nOf our show is supported by exact science is offering Colo guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home available by prescription only information at Colo guarded test dot com\nBy the thousands and she picks out a select few for broadcast the ones that are the most distinctive and compelling and memorable well Suzanne has been doing this for a while she has a keen musical sensibility\nAnd she was also raised in a way that she rarely says anything negative about anyone so F Suzanne leaves no listening notes about recording", "year": "2018", "show_name": "This American Life", "city": "Moscow", "day": "27"}