{"month": "10", "state": "ID", "station": "KRFA", "content": "\nHorn so Lewis chairman Belmont and with the ... to ... Missouri conducting music by poll do he's doing now for corn and orchestra well given this season poll do cause shores jurors of print it\nOn the home page of northwest public broadcasting and W. P. B. dot org down where it says the art you'll find new movies TV shows and books to keep you plenty scooped this Halloween\nWell next hours classical music Riggins with a flute and guitar and includes music for flute and string quartet by Amy Beach also a famous Mozart symphony\nThere's always a lot going on at N. W. P. B. get the skinny and our monthly e newsletter you'll find out about upcoming programs and what's happening behind the scenes at northwest public broadcasting sign up for your free copy at N. W. P. B. dot org look for the link to sign up for our monthly newsletter\nPollution Louis ... valley will be in the upper thirties to lower forties tonight to undo mostly clear skies and tomorrow mostly sunny with a chance of sprinkles in the afternoon ... mid sixties to low seventies\nTonight in Poland a low of faulty and Lewiston is expecting a low forty two\nNorthwest public broadcasting K. R. essay Ninety One point seven Moscow Pullman K. and W. V. Ninety point five Clark St Louis and cayenne W O Ninety point one cotton wood ...\nUsually by the versatile Brazilian guitarist still so much ado coca played by fluke is Gary shocker and guitarist Jason veal\nHere on northwest Public Broadcasting's NPR and classical music service will come along as your evening continues Mozart next and then flute and string quartet combined in music by the American composer Amy Beach\nI'm Gigi Yellen pleased to be invited in to share that classical music with you this evening in Lakewood in ... Seattle at Ninety point nine FM Leonard Bernstein the New York philharmonic most charged thirty ninth symphony\n\n[noise]\n\n\nOh\n", "year": "2018", "show_name": "This American Life", "city": "Moscow", "day": "23"}