{"month": "10", "state": "MN", "station": "KZSE", "content": "Ask NPR News at our politics team will get you answers find out more at NPR News dot org slash\nPolitics discovering what matters\nI'm NPR News chief meteorologist Paul hurting her start your day with a weather updates from NPR News text the word whether to six three seven three five and ... your phone every morning with the forecast to plan your day [noise]\nResident Trump claimed Central American migrants headed for the U.S are more than just poor families looking for a better life\nGoing to fight MS or you're going to find Middle Eastern you're going to find everything I guess what we're not allowed\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nResidents claims about the migrants caravan and Sandra Day O'Connor announces she's\nBeen diagnosed with what might be all scientists were going to learn more about the first woman appointed to the Supreme Court plus politics are dividing families like never before recently several congressional campaigns have run attack ads featuring their opponents siblings criticizing\nThe candidate first the news\nLive from NPR News in Washington I'm jak sphere Turkish media are now reporting investigators have found clothing at a Saudi consular vehicle in mist in Boulder may belong to slain journalist democracy ... NPR's Peter Kenyon reports ... was killed sometime after entering the Saudi conflict earlier this month\nParking garage a tendency to black Mercedes sedan had been left at the garage some two weeks ago after waiting for permission from the Saudis Turkish investigators searched the car and found suitcases and clothing the surge has been on for the body of democracy ... since the Saudis acknowledged he died in the consulate October second\nTurkish president ... was skeptical of the Saudi claim that the death was accidental noting that Saturday advance team carried out a reconnaissance mission apparently scouting out remote places to dispose of the body hair to one says whoever gave the order for the killing must be held to account Peter Kenyon NPR News Istanbul\nA mobile clinic is now pulled into the main square of a southern Mexican town to treat some of the Central American migrants were in a caravan trying to reach the U.S now estimated of being as many as seven thousand people the group is so large summer being forced to cap on a basketball court with no facilities and little\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nBorder for allowing drugs to come into the U.S dropped his threaten to reduce or cut off aid to Central American countries including Guatemala Honduras and El Salvador over critics have complained that will only cause more people to leave those countries\nWhen us national security adviser John Bolton is warning Russia against new attempts to interfere in us elections ... more on both ends comments after meeting with Russian President Vladimir Putin's both\nSays the U.S will not tolerate election interference from Russia or other countries he argued that Russia's cyber attacks the head of the twenty sixteen election and made it almost impossible for the U.S to work with Russia diplomatically over the past two years\nSo that's a huge loss both countries but particularly a rush so it's a lesson I sang a don't mess with American elected\nPresident Trump and his Russian counterpart met in July seeking to ease tensions between their country's motives says that Trump including may hold another round of talks in Paris next month Ayesha Rascoe NPR News\nStocks after being down sharply earlier in the day recovered a good bit of their losses technical trading programs kicked in late in the session without Jones industrial average which at one point was downloaded five hundred and fifty points ended the session doubt about a half percent markets among other things do that by worse than expected earnings for cash from construction maker caterpillar\nDownloaded up down a hundred and twenty five points today than as that closed down thirty one points yes and the five hundred drops Fifteen points you're listening to NPR\nSupport for news comes from love me in makers have go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more at go to meeting dot com\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit wind WC A. M. P. L. S. dot org to learn more\n[noise] protesters wearing on ask Dan has shouted and chanted throughout the meeting vowing to shut it down but after a recess and without any discussion because of the noise the council voted six to to to authorize the purchase city council member Eric ... has been voted in favor of purchasing the gear\nWhich includes things like helmets advisors an elbow and chess pads\nWe have a responsibility to protect all of our city employees of safety here and I believe that the police are included in that\nOpponents criticize what they say is the growing militarization of police one council member who voted against the purchase says the city should craft a policy to govern the use of the equipment Dana cracker Minnesota Public radio news delivers\nAuthorities reporting outbreak of a mild form of bird flu in turkeys and candy you hike county\nThe world organization for animal health says routine surveillance testing confirmed the presence of a low pathogenic and five and two virus in a flock of forty thousand turkeys in Minnesota's top turkey producing county\nThe virus is different from a highly pathogenic strain that caused a massive outbreak and us turkeys and chickens and twenty fifth team the state board of animal health says only one of four Barnes on the farm has been affected\nThe flock has been quarantined but has shown a but has shown no signs of illness\nA funeral will be held this weekend for Wisconsin couple who were shot dead in their home last weekend who's Thirteen year old daughter is still missing\nThe service will be Saturday for James and Denise closet St Peter's Catholic Church in camera in a village next to the couple's home town of barren today a second search took place for clues in the case this one involving hundreds of volunteers [noise] clear skies expected\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nUn dot edu\nFrom NPR News this is all things considered ... Chang and I'm Audie Cornish President Trump is campaigning hard with just two weeks to go until the mid term elections and he's keeping the fact checkers busy\nWe're going to take a look now at some of the president's latest claims with NPR's Scott Horsley hey there Scott first let's talk about the caravan of Central American migrants the president has been talking a fair bit about that\nThey're making their way to Mexico and hopes of reaching the U.S border I'm now President Trump has suggested that they're not just a family's looking for a better life what is he saying instead\nThe president tweeted this week without offering any evidence that quote criminals and unknown middle Easterners are mixed in with this caravan\nHe was pressed on that in the oval office today and conceded there's no proof to that claim but he continues to insist the caravan an illegal immigration more generally pose a serious threat to the country certainly you have people\nComing up through the southern border from the middle east and other places that are not appropriate for our country than Tom not letting them in\nNow it's not unheard of for people from the middle east to try to cross the border illegally from Mexico but it is extremely rare already\nOut of more than three hundred thousand people who are apprehended along the southern border last year only about eighty four for ... war from countries in the middle east and reporters who've been traveling with a caravan say they have not seen any middle Easterners in that\nGroup or there's no evidence then of Middle Eastern infiltration the president has not presented any why is he talking about it\nThe illegal immigration and the threat of terrorism have been ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit wind WC A. M. P. L. S. dot org to learn more\nSupreme Court in the home stretch of the midterm campaign\n\nThe\n[noise]\nThe third on that Leslie was that tax cuts which I think a lot of mainstream Republicans thought would be the first thing that tax cut they passed in twenty Seventeen but we haven't been hearing too much about what's going on\nThe ... is not warn terribly well right now is pulling at about forty percent approval uh a lot of people maybe don't feel like they've seen a big jump in their own take home pay there's also been some renewed attention paid to the federal deficit which has ballooned as corporate tax revenue shrank\nThe president believes he has a fix for this though and it's another tax cut I Want to play a piece of tape from his rally in Houston last night already but I have to warn you take this message with a big grain of salt\nWe're going to put ... percent tax cuts for middle income families is going to be [noise]\nNow whatever you might think about the merits of another tax cut Congress certainly is not going to take any action on that next week they're not even session till after the election and what's more nobody outside the White House seems to know what the president is talking about the head of the house ways and Means Committee belatedly put out a statement this afternoon saying he's willing to work with the president over the coming weeks\nWith you or Minnesota perspective that comes your way at seven after the daily here at NPR News and before\nTerry Gross and fresh air you got all that that's the run down for the evening Tuesday evening the ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nSupport for NPR comes from the station and from capital one\nOffering a variety of credit card options with features for a range of customers from ... to travelers capital want what's in your wallet credit approval required capital one bank usa NA and log men\nMakers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device\nLearn more at ... dot com\nFrom NPR News this is all things considered ... Chang and I'm Audie Cornish\nStrict voting laws are putting some states in the headlines this election year in Georgia fifty three thousand voter applications were placed on hold because the names didn't exactly match names on IDs and North Dakota law requiring voter id is to include street addresses has also gotten attention\n... considers these examples of policies that can suppress voter turnout especially in minority communities\nShe's the head of an why use Brennan centers voting rights in elections project I asked her about how voting laws have changed over the last decade\nOur country has a trajectory of expanding the right to vote but we saw in\nRight after the ... election was efforts across the country to make it harder to vote we saw bills being introduced from coast to coast I'm In state houses that would have put barriers in front of the ballot box for many Americans it is harder to register and vote than it was prior to twenty times\nAll right so to begin to help us understand the range of a legislation what are we seeing from states in terms of how they're dealing with voting now\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThat will count we're seeing states not providing equal access to commonsense things like\nA polling location near them or around them a twenty Eighteen is going to be a challenging time for a number of voters but they should not be deterred\nAnother issue I've been reading a lot about is this idea of purging what do these laws look like how are they justified\nPurging has a practice of removing voters from the rolls um some of that is set forth through law but some of that is just the policies and the ways that election administrators conduct their business\nUm what we have discovered is that an increasing number of Americans are getting purged from the rolls that were sixteen million people purged uh between twenty fourteen and twenty sixteen we're seeing some states like Georgia purge up to one tenth of the number of people that are\nOn the ... cases when they're doing this are they saying look this person hasn't voted and two and three cycles or look we're not sure if this person's still lives at the same address I mean is it described as a administrative\nAnd we want\nElection and administrators to do the regular cleaning up our voter rolls\nThe problem with purging is that we see too many election administrators use sloppy procedures and so voters are finding out that they're being purge way too late um critically were also saying that purging is happening\nIn states that used to be required under the voting rights act to be able to demonstrate that there are election process as we're not going to be discriminatory and we're saying that those areas are having an even higher increase in the number of people that are being perch from the rolls\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nLaws have been a blunted by courts overtime\nTo London but not overturned sort of not words aren't seeing it as suppression yet\nI I think I Would push back a little bit on that I think we're talking about a matter of degree so for example the photo id law in Texas that\nWas a an acted in two thousand eleven looks really really different than the photo id law that is on the books now and the same thing in North Dakota so some courts are stepping in and saying some of these policies are are too much uh but they're not going all the way and saying that these policies can't exist in any form\nA many Americans especially Americans that have traditionally had their rights to vote suppressed are very very resilient and very determined to overcome it but having said that these laws are going to depress turn out in a way that we wouldn't have seen that these laws hadn't existed in the first place [noise]\nYou know ... is head of NYU's Brennan centers voting rights and elections project thank you for speaking with all things considered\nThank you [noise] there are few subjects that can divide families more quickly than politics can mother against father father against sun sun against daughter will you get the idea\nAnd then there's this kitty wells relatives of Adam ... published an op ed against him saying the Republican is not fit to be governor of Nevada this is just the latest example of politicians family feud going public\nLaurel white of Wisconsin Public radio reports on some others house Speaker Paul\nRyan has endorsed the Republican running to succeed him in Wisconsin's first congressional tests\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nTypical as political attack ads go and it is except that the person speaking as the brother of styles democratic opponent Randy Bryce Joseph ... is a democratic strategist in Wisconsin He says the ad reflects a political attitude in the state and across the country that's become more nasty and polarizing\nWe have heard about it it's been said arbitrary again that what's happening with jobs were divisive politics\nLiterally as a family member it experiment number that I went wow you're that is really just ugly editor most public what\nThe heck he says this kind of ad is bad for candidates and voters because it makes elections less about issues and more about candidates personal lives and Randy Bryce isn't alone in facing this sort of attack in Arizona Republican Congressman Paul ghosts are six siblings filmed an ad against him this election year as well\nGrace cos are Jones those are destined ghosts are Jennifer gold star pogo SARS my brother my brother and I endorsed Dr ... doctor drill wholeheartedly\nGoes R responded to that ad by calling his siblings disgruntled Hillary supporters who put political ideology before family he said Stalin would be proud\nThese ads may be the most public display a family feuds over politics but sites like them are happening more and more across America\nEven when a sibling isn't running for Congress Dr Keith Chen is a professor of behavioral economics at UCLA and co author of politics gets personal effects of political partisanship an advertising on family ties\nWe don't actually have very good survey data on how often it is that families of kind of like deep partisan\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nYou know over an hour and a half like shorter Thanksgiving dinner and twenty six gene than in twenty Fifteen\nChan says the more political ads that ran the shorter the family dinner Scott\nAnd perhaps unsurprisingly the people who seem most hurt by these conflicts aren't the partisans on either side it's the family members caught in the middle in Arizona eighty five year old Bernadette ghosts are told the New York times that she was shocked and crushed by the things six of her children set about their brother in the attack ad\nIn Wisconsin the price brothers mother Nancy released a letter asking the pack behind the ads take it off the air\nShe says they need to consider a mother's pain seeing her son's pitted against each other all for political gain for NPR News I'm Laurel light in Madison\nThis is NPR News\nStories the hair on NPR News I made possible by member investigation fact checking reporting on breaking news\nNumbers power every story and NPR News every step of the way\nThe twin cities forecasts calling for clear and cool conditions overnight with a low around twenty eight degrees lake north easterly wins shifting around to the southeast after midnight that will bring in some milder air for tomorrow Wednesday looks mostly sunny with behind your fifty five degrees and then\nThursday rain likely in a high in the upper forties a good chance of showers Thursday night and then gradually tapering off on\nOr to a business\nAs usual let's find a way out of this and move on the big question of course will be will Mohammed bin some on remain as the crown prince his father is in his eighties an ailing a so far NBS is still in line to succeed him That's NPR's Greg Myre me thank you for your reporting thank you\nAnd leaving hearing the killing of Saudi journalist ... has sparked international\nOutrage that people right here in the u._s. or else they're talking about the instant and how President Trump has been handling it North Country Public Radio's Brian Mann reports on how it's playing out among voters and us media outlets just two weeks before the midterm elections\nCarol morality and her friend Boston Neary work in publishing and live near Burlington, Vermont both say they're definitely voting next month both describe themselves as independents when I ask if they are paying attention to the ... case they nod their heads\nWe actually were discussing it in the car on the way down here\nWe meet on the street in ... Vermont where the two were shopping and leave ... says she's troubled by President Trump's focus on money and an arms deal with the Saudis rather than seeking justice for a slain journalist\nIf he was murdered [noise] um I don't think that his biggest concern should be for the African artifacts and find out and make an educated decision it was a human being\nMyriad greed says she thinks Trump's tone just isn't right\nI I think that's something that more transparent moral leadership [noise]\nNarrative questioning Trump's moral compass on the show ... case has played over and over in media that tends to be critical of the president here's Joe Scarborough on MSNBC and then he\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nLast week described a whisper campaign by conservative commentators and activists ended discredited showed some suggesting possible ties to Muslim radicals this narrative has been taken up by Republican politicians including Corey Stewart a candidate for US Senate in Virginia who spoke with CNN's Anderson Cooper that's for sure\nWhen he was ... he was not a good guy himself\nWhat does that mean exactly not not a good guy himself\nWell either so I mean there's a lot of stuff out there a\nOne voice leading this attack on the show gene is Rush Limbaugh less than three weeks after the Saudi journalist and Washington Post columnist was brutally killed\nLimbaugh used his influential radio show on friday to describe the show but gee as suspicious a man unworthy presidents concerns or there's no whisper about this cabinet whispering anything when I talk about this I'm from the stops on Saturday the Saudis acknowledged ... died in their embassy\nBut many conservative outlets have simply downplayed his death like President Trump they've focused attention instead on that caravan of migrants moving north through Central America and Mexico Peter ... is the host of the program Fox and friends it will be time to deploy the military I Believe so because we haven't changed our immigration\nPolicy is this issue immigration did seem far more significant to many of the voters we spoke to they ranked protecting America's borders as a higher priority for Trump to show gee case my downs is a retired state trooper in Westport New York a Democrat who says he'll be voting Republican this year Trump\nIs on the right track trying to correct certain things like for instance the immigration you know we watch it on television it you know the ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nTroubled by the case or weren't paying that much mind voters hostile to Trump said the story just reinforces what they felt before anger and outrage Brian Mann NPR News [noise]\n\nYou're listening to all things considered from NPR News support for conversations with Dr ... comes from the H. G. A. architects and engineers and national designed for granted by their responsibility to create an enduring positive impact more information at H. G. A. dot com\nConversations with Dr John Halbert is supported by ... view employer solutions and\nInnovative portfolio of services providing a local answer to employee health productivity and cost savings learn more at fair view employer solutions dot org\nThings considered on a Tuesday Afternoon from Minnesota Public radio news\nSeems every day you hear or read a story about the latest study for example on what we should eat ... eggs good for you or they bad for you it can be hard to keep track and know which ones are actually based on science and which ones are junk science\nDr Hoeber gets busy in the clinic this week so here to help us sort through some of the science surrounding studies and what we need to know when we hear about them\nIs Mary butler co director of the Minnesota evidence based practice center at the school of public health at the University of Minnesota and associate professor there it's good to have you here thanks for coming in and keep asking me so when we read and hear things all the time and it tends to be about let's say\nCoffee is a good views and not wind should you have it as a defect\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. start or to learn more\nWhen we hear it rather than think about it in terms of this exciting great big new breakthrough that's going to answer everything we ever had wanted to know\nInstead think about it in context of what have we known before what's the next new thing that we're learning from that does this make sense who were the people they were conducting it on to those people looked like me\nThink about it from a critical perspective of how it relates to you interested in yard and also um the strength of the evidence how strong what's that finding many many times particularly for things like coffee they affect that we find in the studies can be quite weak\nBut they often show up in the news print or on the radio or on TV right as a strong statement of coffee we'll do this or coffee won't do that when in fact the study itself may have a fairly weak\nLevel of evidence\nAnd how do we as people who aren't who don't do this as you do research for living or what you what would you be looking for them to know if it's really good\nBottom limit the best things we can try to do is to see how well the journalists themselves were reporting it or did they just give you the headline and it was almost too good to be true\nOr too too bad to be worrisome and anxiety provoking or did they provide the information with other contact with an assessment of whether the study was done well did someone who wasn't related to this\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nThe pharmaceutical or food industry or should we be looking for that and does that necessarily than knock it out\nIt doesn't necessarily knock it out they are very good scientists who are parts of other corporations\nHowever having said that ah even researchers ourselves we can become sort of enamored with an idea and that's an intellectual conflict of interest if we lose our ability to look at something objectively\nSo and there's always a level of concern with regard to potential conflicts of interest whether it is financial\nOur intellectual ... so there is always important need to keep some healthy skepticism\nNot necessarily to the point where we discount everything that we learn oh or see in print but definitely to keep an open mind to the possibility that there might be more that we need to know\nMary butler is an associate professor and co director of the Minnesota evidence based practice center at the school of public health of the University of Minnesota and thanks for coming in and shedding some light on studies and how we should approach\nThem thank you\nIs supported by you care when it comes to health plans you care uses the power of their people to help simplify anti complicate terms for their members learn about Medicare individual and family or Medicaid plans at ... dot org for forty nine it's Minnesota Public radio\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWe have today you got the sunshine you've got a little bit of a breeze\nAnd you've got a very dry or do points in the twenties I've even seen some teens today so that kind of suck some of the moisture out of the soil so another relatively warm one tomorrow yeah had a nice day to day nice day tomorrow we're close to fifty in the twin cities forty nine right now forties across most of Minnesota\nThursday rain likely in a high in the upper forties a good chance of showers Thursday night and then gradually tapering off on friday\nAt your forecast from Minnesota Public radio and\nEntire state how this is science and then you can fall back then you have to put anything in my head and they\nSt Paul ... discovering what matters forehead on all things considered\nI'm John ... Minnesota Public radio news with ... D C after the news why Bolton says the treaty has outlived its purpose and Turkey's president says Saudi operatives murdered journalist Jamal showed gee\nIn a Savage premeditated action also up to a hundred and fifty thousand Minnesotans could be at risk for losing public benefits like food stamps cash assistance will tell you why and Fifteen minutes and about two thousand volunteers came together today to search the woods and farm fields around Baron Wisconsin\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more one of the worst cover ups in the history of cover ups wherever the president stopped short of saying he'd take any action directly against the Saudi Government instead Trump says he believes lawmakers need to make that decision\nI think here I'm going to leave it up very much because this is a very strong ideas both both ways uh I've been told by certain senators we want that investment to keep coming at the same time that doesn't mean that that they're not going to do something that has to be some kind of retribution asked the\nSaudi Government is claimed the journalist was killed after a fight broke out inside the Saudi constantly didn't stumble Turkish authorities say could show was brutally murdered a drop administration says a record number of migrant families of arrived at the southwest border during the previous year as NPR's Joel Rose explains that's according to official figures out today\nUS Customs and border protection apprehended more than a hundred and sixty thousand members of migrant families at the border and the fiscal year that just ended despite the Trump administration's effort to deter illegal immigration by separating families at the border\nThe total number of undocumented immigrants apprehended for the year it was down slightly to just over half a million far below the numbers of the Nineteen nineties into thousands\nStill a senior Trump Administration official caused the situation and unprecedented crisis because many migrant families must be released into the U.S to wait for their day in immigration court under a long standing settlement agreement\nThe Trump Administration calls that a loophole immigrant rights advocates say it's a crucial protection for families seeking asylum Joel Rose NPR News New York\nSupreme Court chief justice John Roberts says he is saddened by the news that Sandra Day O'Connor the first woman to serve on the high court has now she has\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nViewers you can go to the concerns about a slowing Chinese economy and increasing tensions between the U.S in Saudi Arabia prompted in early sell off at one point the Dow Jones industrial average didn't nearly five hundred fifty points before rebounding in the latter part of the day at\nTobar has already been volatile months and market analysts say that could continue as investors worry that the global economic expansion that feel the bull market is beginning to slow those concerns meant big declines for industrial stock such as three ... caterpillar\nThose stocks were hit especially hard as the company's forecast lower demand and higher costs ... NPR News Washington\nTo do under discussion about a hundred and twenty five points the NASDAQ fell thirty one points today you're listening to NPR\nSupport for news comes from the John D and Catherine Teaneck Arthur foundation recognizing exceptionally creative individuals this year's MacArthur fellows and more information are at Mack foundation dot org\nFrom Minnesota Public radio news I'm personally\nA Mexican citizen has admitted to faking his own kidnapping in Minnesota in an attempt to get an immigrant visa prosecutors say forty six year old Alondra court is\nAllowed to record chess today pleaded guilty to one count of visa fraud and one count of illegally re entry the U.S of course has admitted that from April through August he conspired to fraudulently apply for a visa based on a false kidnapping report\nHe said he had a co conspirator travel from Chicago to Minnesota state of the stores facility for days court shows and they asked to have his mouth and hands bond with duct tape and he was left in St Paul\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot\nOrg to learn more shelter in a small island called nine one one for help\nBorder patrol agents in the area overheard the call and responded they launched a boat and found that people provided them with cold weather emergency sleep systems and took them to the landing where they were turned over for treatment\nLaw enforcement on the scene recovered the people's gear including their two canoes Peter Cox Minnesota Public radio news\nThe fourth of seven people charged with federal crime stemming from protest against the Dakota access to oil pipeline of North Dakota has been sent to a year and four months in prison twenty two year old young or cheese of New Mexico was indicted in the fire is set in a county road bridge in October twenty sixteen he\nReached a deal with prosecutors under which he pleaded guilty to civil disorder and the government dropped a more serious charge of using fire to commit a federal facility or to use was given credit for time served and it could be released from prison in April and the twin cities guys are mostly clear the temperature is forty eight degrees hits five or six\nOh things considered is at ... University of Minnesota how committed to providing seem to be mothers exceptional ... to ... and comfort availability of nationally recognized me and they don't care more at ... dot org slash moms\nIt's all things considered from NPR News I'm Audie Cornish secretary of state Mike Pompeo says the U. S. is revoking visas for a number of Saudi officials who may have been involved in the killing of Saudi journalist ...\n... says the Treasury Department is also considering targeted sanctions and President Trump is promising quotes\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nTurkey and Saudi Arabia as NPR's Peter Kenyon in Istanbul and Deborah Amos she's covered the reaching for many years welcomed\nBack I think either So Peter I Want to start with you know what can you tell us more about what are the one had to say today\nWell he laid out a some of what we know an added new details including the fact that members of this Fifteen men Saudi team that showed up the day 'cause she'll do disappeared were tracked scouting out remote sites including a forest\nOr the idea of being they might have been looking for a place to double body all the details or to one added seemed aimed at knocking down the Saudis version of events their latest version that showed you died accidentally after a fight broke out in the consulate I heard one didn't talk about alleged audio recordings investigators are said to have\nBut if there's evidence holds up the Saturday explanation does not a he said when the leadership gave the order that's what he wants to them\nSo Peter what else happened today\nWell the investigators searched a diplomatic vehicle Saudi constantly vehicle found in a parking garage had been left there for two weeks they found suitcases inside with some clothes that may belong to Saudi consular employees we're still waiting confirmation also CIA director Gina Haspel\nFood on courage to review evidence and aired once spoke with a ... family members and offered condolences\nThat the Saudis also reached out to cause show genes family\nUm there were pictures released of his son meeting with the Saudi king and the crown prince more can you tell us about this you know the picture was striking there you have the son of a slain journalist standing in front of the crown prince who some say is linked to his death in Istanbul um this event\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nEars the opening speech it was given by a Saudi businesswoman look not all young and she had to address the concerns in the room\nI wanted to an old ... photo who's presidents with us this morning\nWe are very good eat food that they had a ... in recent weeks or Indian culture and out of DNA and I'm confident\nA turbulent day on Wall street stunk climbing nearly all the way out of a steep broad sell off that started early in the session at one point that he raised more than five hundred points from the Dow industrial average\nEven with the late afternoon rebound those stocks extended the markets recent string of declines the benchmark ... five hundred down for its fifth straight loss was off the team that down with a hundred and twenty six more on marketplace at six\nAnd you also hear about how Netflix is borrowing two billion with a B C to fund new content that adds to the eight billion Netflix or Netflix already owes\nIs strong subscriber gross enough to convince investors that Netflix can handle it soaring debt so a lot of subscribers that's marketplace at six on Minnesota Public radio news it's five twenty\nFor NPR confidence station and from the financial services firm of rain in James offering personalized wealth management advice and banking\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more executive\nAll things considered from Minnesota Public radio news an estimated Seventy thousand Minnesotans could be affected by a proposed federal rule called public charge it's attached to government officials use to find out whether immigrants are likely to rely on government benefits\nThe proposed changes would put more than a hundred fifty thousand Minnesotans at risk for losing public benefits like food stamps and cash assistance that's according to a new study by the migration Policy Institute\nIt looked at the direct and indirect impact of the rule and here to tell us more are ... good afternoon ... good afternoon so first tell us what public charge actually is\nWell the term public charge has been used since the very early days of immigration to the country and its referred to someone who would likely need financial assistance by the government\nI'm In the Seventeen hundreds us colonies protected themselves against public charges by requiring mandatory reporting of ship passengers screening them and turning away the one they thought would need financial assistance\nOr states then took on their own version of the real pretty much until the ratification of the constitution which then gave Congress a role in immigration policy\nAnd the public charged rule continue to be part of immigration law until today um then came the welfare reform the Nineteen nineties which included significant changes affecting immigrants and their use of public benefits as well and that brings us to today\nAll right how are immigrants currently evaluated for this public charge rule\nThe current standards affects two categories of immigrants one ah those seeking admission to the United states so family members looking to reunite with relatives here and too\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPLR subtle word\nIs whether someone um uses Medicaid for a long term care it relies on an affidavit of support that says you know this family member would support the immigrant when they come and what the welfare reform in the nineties immigrants are aren't able to receive public benefits for the first five years of their residency here\nShorter the proposed changes here how do they differ from current practice\nThe proposed public charge rule is long and complicated but it still affects the same group of immigrants uh those seeking admission and others who have temporary status but what's changed is the number of factors that the government would consider\nThe list is a lot longer for example immigration officials either at the consulates abroad or here with tests for things like age if the person is too old or too young um health whether the person has a medical condition that requires ongoing care financial status education English language proficiency\nUm they would also look at participation in programs like Medicaid section eight food stamps the rule is it retroactive but it's if it's an acted as it is today a that is what immigration officials would begin to look at one of the reasons for these changes\nWell homeland security says the idea is to ensure that immigrants are self sufficient and rely only on their own capabilities their families or their sponsors\nBut because of things like age and health immigration advocates say the changes are intended to control the types of immigrants who come into the country they say it's an attack on non citizens who rely on the services for their families and children\nI was talking with a public health nurse in free born county she runs the WIC program and she said she\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nWith a green card she was considering dropping out first year that it would jeopardize her future citizenship so there's this chilling effect and that's why researchers with the migration Policy Institute included this broad set of people when they looked at the number of non citizens in Minnesota and other states who would be impacted by this\nRe ... reporting for us this afternoon on proposed changes to a federal rule called the public charge thank you very much you welcome\nAround two thousand volunteers are spending the day to day surging woods and foreign fields around the northwestern Wisconsin town\nOf barren they're looking for evidence related to the disappearance of Jamie costs the Thirteen year old has been missing for more than a week since her parents were found shot to death in their home Matt Sepic reports from Baron\nAuthorities here said Jamie was at home early last Monday morning when her parents fifty six year old James ... forty six year old Denise claws were killed\nInvestigators have yet to say whether the shooting was random or if the couple was targeted for a specific reason Baron county sheriff Chris Fitzgerald asked for volunteers to scour the area for clues\nThousands answered the call Brian Granholm drove an hour north from Eau Claire with a colleague just before nine this morning they waited for a few minutes in a long line of vehicles that stretched along Wisconsin highway twenty five near the staging area\nWe both live in the local area we work together so we decided that we saw was going on and they needed help and figured we'd come out and let out of hand if we could\nDressed for the Chris fall weather many riding their hunting gear insulated blaze orange coats and cover\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a NPR less dot org\nHundreds of law enforcement officials from local deputies state game wardens are on hand to date overseeing the search parties\nThere working from aerial photos taken by helicopter yesterday each images divided into a grid with heavy red lines sheriff Fitzgerald says volunteers are instructed to look for anything that doesn't belong in a farm field\nThey're being brave to look for anything that they feel is suspicious or auto place you know brand new or laying in the ditch or the field or wherever anything you know like a piece of clothing obvious things like a firearm something like that you know I don't know what we're going to fight\nFitzgerald says searchers are walking about ten feet apart and they're looking in an area two to three miles around the home where Jamie's parents were killed\nIn some parts of the surge zone it's challenging to spawn anything because of heavy leave covered in ... ground\nThe sheriff is also asking the public to be on the lookout for two vehicles have interest spotted on security video at the time of the killings\nOr red orange dodge challenger and a black SUV either were Ford Edge for accurate M. D. X. Fitzgerald has not publicly disclosed any potential motive for the homicides but he remains hopeful that Jamie clause will be found alive\nA funeral for her parents whose scheduled for this Saturday at St Peter's Catholic Church nearby cameras Matt Sepic of Minnesota Public radio news Baron Wisconsin [noise]\n\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nFifties [noise]\nA chili below freezing night ahead it's Minnesota Public radio news\nThere's a new way to listen to MORNING EDITION wait wait don't tell me he was around the world and all your favorite program simply say like so lame PR anytime you want to be up there were one good company\nTry Alexa play NPR\nBetween cities forecasts calling for clear and cool conditions overnight with a low around twenty eight degrees like north easterly wins shifting around to the southeast after midnight that will bring in some milder air for tomorrow Wednesday looks mostly sunny with behind your fifty five degrees and then\nThursday rain likely in a high in the upper forties a good chance of showers Thursday night and then gradually tapering off on friday\nTwo hundred and forty five children remain in federal custody that's according to government data analyzed by the American civil liberties union\nThe ACLU has been tracking these children and it was the ACLU lawsuit against the Trump Administration that led to a federal court order to reunite these families we're joined now by ACLU attorney leak learnt welcome thanks for having me\nSo we should first said that the vast majority of these children who were separated at the border more than two thousand of them have been reunited with their families\nBut it has been for months since the court order why are two hundred and forty five children still in custody yeah that's the question right or you know obviously the\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nAfter the court order and where these children being held right now these two hundred forty five children that are still in custody\nThey're being held in governor facilities all across the country often thousands of miles from where the parents are ... I Would say of the two hundred and forty five\nA number about one twenty five are going to remain in custody until a sponsor takes them and that's because\nWe've reached the parents and they've made the agonizing decision to leave their child in the U.S not because they don't love the child stop because they don't desperately want the child back with them\nBut what they're saying to us is it's too dangerous for the child to come back one father said to me look my life has over ... killed 'em killed and this is a father who seem to be in his forties or fifties obviously his life\nShouldn't have been over he shouldn't have been thinking that way but all he said was was I cannot bring jobs back here it's too dangerous we're hopeful that the government will allow some of these parents to return to the U.S and reunite but right now the only thing definite we can tell those parents that\nYou have two choices leave your child in the U.S to pursue asylum or bring them back to Central America\nWe have heard at various points that some of the families are deemed ineligible for reunification because the parents have criminal backgrounds what kinds of criminal backgrounds are we talking about here\nSo they very we have set all along that if a parent has a very serious conviction that bears on their fitness to be a parent even under stand her child welfare law state law they would not be reunited and so those people we've always said would not be reunited but we're also seeing\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more wind WC A. M. P. L. S. dot org\nBecause the government's saying it's just too dangerous to put them in a family detention center with their child and we could not disagree more strongly with that [noise]\nDo you feel you has reported that five children have parents who have not been reached at all and what does that mean that the U.S government has no idea what happened to the parents we\nAre the ones trying to locate the parents the government has given us phone numbers finally they gave us phone numbers these are five that we have not been able to reach by phone\nWe remain hopeful will reach the five um but if we don't we will have to look for them on the ground we have great partners including justice in motion and kids in need of defense on the ground we hope that we'll be able to reach them one way or the other we're not giving up on the five we will find the one way or the other we believe\nLegal learnt is deputy director of the ACLU immigrants' Rights Project thank you very much for joining us thanks for having me [noise]\n\n\n\n\nListening to all things considered from NPR News in Russia it's become dangerous to protest in public Russians wants to complain about ... government are rarely granted permission if they protest any way they often end up in jail but there is another way to protest in public it's called the solitary pick it\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nShe's one of tens of thousands of Russians invested in housing developments that suddenly went bust\nShe's angry with the government for certifying a shady real estate developer\n... keeping its promise to make sure the building is completed\nArguing over folds up her son to talk to me\nBecause if the two of us are standing together with our placard her solitary picket would technically turn into illegal rally\nMe my husband and parents all working to pay for an apartment that's not getting\nMelt or go no but says she and her husband took out a mortgage and sold her grandmother's house I don't know three and a half million rubles in debt for more than fifty thousand dollars she says one person picket the only way of getting our message to the government\nWould you mind if I made it seems that\nWe can't make a mass protests like in America\nWhere people they're unhappy about with posters and warns so that everybody sees them\nThat's not allowed here you need to ask permission for everything and they won't give it to you\nJust like in the U.S Russian constitution guarantees the right to peaceful assembly but since the Russian Revolution a century ago public protests has largely been stifled there have been some exceptions fifty years ago a loan demonstrators went out on Red Square to protest the Soviet union's invasion of Czechoslovakia\nThey faced various forms of punishment somewhere locked up in psychiatric hospitals decades later the communist system was brought down by hundreds of thousands of people peace we take him to the streets East Berlin Prague and Moscow\n[noise]\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\n... lift but my real as a veteran human rights activists was organized dozens of protests says the authorities are breaking the law banning rallies you\nShould contribute to pursue those reversed you if there's a conflict between the government and an individual then the individual is always guilty that's clearly part of the Soviet legacy and under boot and Soviet times are starting to return\nBack at our solitary picket in front of the construction ministry of urban over is adamant when you look at that age\nAre going over so she plans to continue her lonely protest on to work on an unfinished building his resume\nPerhaps it's not been completely in vain construction ministry says I've spoken to protesters and it's working on the problem\nLucian Kim NPR News Moscow\n\nAnd tomorrow on MORNING edition we go to a city fighting hard against the opioid epidemic Huntington West Virginia with first responders facing burnout that community has formed\nQuick response team help they visit patients homes within days of an overdose and they make sure those patients get treatment that story tomorrow MORNING EDITION written by asking your smart speaker to play NPR or your local station mining\nEdition tomorrow morning starting it for him here on Minnesota Public radio news tell that smart speaker to play NPR News I'm Tom ... and meteorologist Paul hunting areas here on your smart speaker or your radio or wherever it is you like to listen I met with hard enough to be on this ... I was gonna say\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nFor the last two weeks nine in the past twelve days have been dry\nOr we've only had about a tenth of an inch of rain in that time that's really good weather tonic to dry out the soil to get the sunshine the breezes temperatures in the fifties and do points in the twenties and thirties so very dry air sucks that\nExtra moisture out of the soil because we've had a very ... wet run before that this we had a wet Ron chillier one for October right but tomorrow you'll see us back up and closer to normal I Do we're running about five degrees below average for the month so I think will make the low fifties tomorrow in the twin cities in souther Minnesota forties up north\nAnd another nice day with some sun mixed in with the clouds and then the rain moves and Thursday Friday doesn't look real heavy I'm thinking a quarter to a half an inch for much of Minnesota by Saturday\nA and a that'll hang in to the weekend at least with some spotty showers but Tom it doesn't look like a real heavy rain system\nAll right and then let's look to the south and hurricane wheeler what do we need to know about this yesterday you were saying it was a very powerful shit it was and it's we can do a little bit over the last day or so little less organization a winds down to a hundred and twenty\nMiles an hour or so still a category three storm it's making landfall just about now time along the Mexican coast between ... and ...", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Rochester", "day": "23"}