{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C.\nA. M. P. L. S. dot org to learn more [noise]\nI'm Carrie Miller are you looking for a good book to read that sign up for the thread newsletter text book to six seven seven six seven seven and I said recommendations to your inbox once a week [noise]\nIce and he's about to change the lives of residents have ... Ontario because last night he was elected mayor I'll speak with then Carter about his journey\nAnd deeply disturbing after dropping a camera into the depths of the southern ocean researcher gets back images of a graceful little creature never before seen in that region is called the headless chicken monster\nThose stories and more coming up on a Tuesday edition of as it happens [noise]\n\nLive from NPR News in Washington ... Stevens President Trump says he's waiting for all the facts before\nDeciding how to respond to the death of Saudi journalist Jamal ... G NPR's Ayesha Rascoe report that Trump plans to work with Congress on potential action against those responsible for the killing\nTrump says will ever came up with the idea of attacking Jamal cause show she should be in big trouble\nThey had a very bad original concept was carried a poorly and the cover up was one of the worst and the history of cover ups very simple the Trump Administration is revoking the visas\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more than\nNational security adviser John Bolton says he's told Russia's leader that interference in the two thousand sixteen us election is hurt Moscow's interest\nBolt and says there's no evidence that the meddling affected the outcome of the U. S. boat but says it did create mistrust of Russia he spoke with reporters in Moscow today after meeting with Vladimir ...\nWe discuss their ... their concern with a Russian meddling in elections and why it was particularly harmful to Russian American relations without producing anything for them in return\nRussia denies any state sponsored effort to influence elections but potent has suggested that some patriotic individual hackers might have been involved the Trump Administration says a record number of migrant families arrived at the southwest border last year NPR's Joel Rose has more on the figures released today\nUS Customs and border protection apprehended more than a hundred and sixty thousand members of migrant families at the border and the fiscal year that just ended despite the Trump administration's effort to deter illegal immigration by separating families at the border\nThe total number of undocumented immigrants apprehended for the year was down slightly to just over half a million far below the numbers of the Nineteen nineties into thousands\nStill a senior Trump Administration official caused the situation and unprecedented crisis because many migrant families must be released into the U.S to wait for their day in immigration court under a longstanding settlement agreement\nThe Trump Administration calls that a loophole immigrant rights advocates say it's a crucial protection for families seeking asylum Joel Rose NPR News New York\nYahoo has agreed to pay fifty million\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nThis is NPR support for news comes from the jak can't cook foundation providing scholarships throughout the nation to exceptionally high achieving students with financial need from middle school to college more information about cook scholarships is available at J. case the F dot\nOrg from Minnesota Public radio news unproven Nelly three am shares narrow their last uh four percent by the close of trading today after falling as much as a present in mourning trading the downdraft came after the maple would based company reported for natural result to felt well short of investor expectations\nA Mexican citizen has admitted to faking his own kidnapping in Minnesota in ad attempt to get an immigrant visa prosecutors have forty six year old ... has said that from April through August he conspired to fraudulent Lee apply for a visa based on a false kidnapping report\nHe said he and his co conspirator travel from Chicago to Minnesota\nState of the stores facility for days Cortez then asked to have his mouth and hands bound with duct tape and he was left in St Paul where he was followed by a snow plow driver he has no lawful status to stay in the U.S and had been removed previously in two thousand one and it ...\nThe twin cities may soon have nonstop service to yet another international destinations Shanghai, China guilty airlines is helping to provide nonstop flights between the twin cities\nAnd the Chinese metropolis in June twenty twenty spokesman Patrick Hogan says Twin Cities airport leaders expect there was a good chance of securing the required government approvals\nIt'd be the first time we would ever have had service to China it's a long process\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more we're forty degrees in the twin cities of turtles six\n\nHello I'm Megan Williams sitting in for care along good evening I'm Jeff Douglas this is as it happens\n[noise]\nTonight\nBox don't stop there and Ontario conservative accuses the PM and trying to buy votes Justin Trudeau insists the carbon cash she'll give Canadian is just an incentive to do the right thing by your plants\nForward he figures one hundred forty seven people spoke with human rights watch about the actions of Palestinian security forces [noise] and they painted a horrifying picture of predict send opponents being routinely arrested and tortured\nYou can't fight city hall that you can\nFight your way into it after years spent homeless he defeated his addiction at last night then Carter also defeated his opponents become the new mayor of offshore Ontario\nTap size matters on the floor of the black sea archaeologist discover a phenomenally well preserved sunken Greek Ship that had been resting there for about twenty four hundred years\nApparently nature forgot to plan ahead an Australian researchers undersea camera beams back pictures of a stunning\nBlobs known pardon the scientific term as the headless chicken monster and\nEvery little thing she does not magic and Ontario woman who put the Conan ... charged with a building or victims of tens of thousands both countries\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nJustin Trudeau is handing out money to millions of Canadians the prime minister was in Toronto this morning to roll out the details of the carbon tax that he is imposing on the provinces that refused to participate in his government's carbon pricing scheme\nAttacks will increase the price of carbon putting good but the prime minister announced today that he'll be giving out rebates that will more than make up for what an average household will have to pay afterwards Mr Trudeau was asked\nIf he had a message for the premier to still do not like his plan here's what he said\nThe Canadians have been very clear that they are worried about climate change worried about the impact on their future on their kids on the future generations worried about the impact on their livelihoods and all kinds of jobs that they'll have and their kids [noise]\nThere is no more debate about whether climate change is real and whether we are responsible for it the only political debate that seems to remain is whether or not we should actually do something about [noise]\nThe science both on the on the the the the um [noise] scientific side and on the economic side is unequivocal that putting a price on pollution\nIs one of the best ways to move forward\nAnd we are doing exactly that I think the question for conservative politicians is if they do not want to [noise]\nBuddha they expect to act in their stead\nPrime minister Justin Trudeau speaking in Toronto this morning in the writing of ontario's progressive conserving\nNineteen Seventy four or five other bike all that was a police officer was killed in a motorcycle accident and just absolutely\nDevastated me and for the next Seventeen or Eighteen years I tried to escape reality through drugs and alcohol to the extent that it found me mentally emotionally physically furniture spiritually broken into every aspect or by the time I was thirty one years old\nAnd you were homeless her sound that period where you not\nYes I was on I mean this is probably not a news to anyone that suffers with a severe addiction\nOur friends or family or we treat them horribly we now we find ourselves a very isolated and on our diction takes over every decision we make our lives you find that you have no place to live no friends to turn to and your family is loves you\nBut they just they just can't help you do you remember much about this year\nI Do I Do and I'm I'm reminded each and every day how lucky and blessed I have\nMy sister Marie I'm help save my life um and I also reflect upon the loss of her life and fortunately my sister praying at age fifty um made a decision to end her life and and that was really devastating to me\nAnd said sorry how how was marine able to pull you out and not talk to\nMy sister marine always believed it and she always believed that it was more to me than ah what appeared on the surface I mean one day I finally got so sick\nBut I found there one day and said you know money and I think I'm going to die and she said why don't you come over to the house and when I went over to see her she just walked me on the side of the head and she said you've got two choices today either die or sober up because we've had enough\nAnd then you know what you've had a hard life we've had a hard life that's what life's all about\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more you think\nThe challenges that that you face prepared you to read it in for the job of being the mayor of a city\nOr they could really gives you purpose of life so you don't look at it as these horrific things that happen in your life I think what you do is you look at it and say I've been given these unfortunate gifts but out of those gifts I may be able to be able to help or many others then it's a natural coal\nTo be with another woman share that experience but also to be able to say how can I serve my community how can I serve the public at the very highest level\nThe city a voucher on it you're going to be ... faces a lot of this same kind of challenges you faced isn't out beyond addiction there's homelessness housing affordability how do you plan to tackle those issues\nWhere I think first and foremost have already demonstrated a of the ... of of finding services in different ways of reaching the individuals were going into those hard to reach areas to build a relationship with those individuals that are suffering what this opioid crisis but having those experiences and understanding what kind of services or necessary without somebody\nUnderstand the very hard road to recovery specially with this opioid crisis will be gives you a better insight about how you could serve the population better\nOver the years you've put a lot of funding also into literacy programs for kids white has meant to you\nAs many people know that I\nDidn't really learn how to read properly until I was about thirty one years old and in rehab a bike house or came to me and said you know I had to stand up and I couldn't read at thirty one which was really embarrassing so you kind of struggled through and you and you tried to fake your way and but what he did was he said who is the one person you want to meet in your life and and\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nThe cultures and a lot of work that experience showed me that I I could make an investment in an area that could change people's lives and what a blessing notice\nGiven everything you've been through I'm curious to know how do you think your younger self would react to know that you're now the mayor of ...\nIt's a hard question because I to be honest and this is this is the truth from very young age to um I was Thirteen Years old\nI don't think I ever thought that I Would accomplish anything in my life and then for the next seven years this or goes off on drugs really took away any kind of light or hope or aspiration of anything\nYou have to understand I sit here twenty eight years later in a separate life amazed\nAt the generosity kindness forgiveness of that has been granted on me to be able to have this chapter in my life and I'm I'm again as I'm overwhelmed that I have this opportunity but I don't think I could have ever imagined when I was younger that this would be what I Would be doing some years later\nMr Carter thanks so much and best of luck\nI really appreciate your time and I hope you have a glorious to thank you thank you\nDan Carter is the Maryland demonstrable Ontario which is used to Toronto we reached him in ... and you can read more about Mr Carter story and the challenges that he overcame on our website CBC dot CA slash a I H\n[noise]\n\nUh\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nFor the program leader for the Australian and Arctic division and yesterday he and his colleagues presented some video at a conference in Hobart, Tasmania they had captured the video using cameras that they had sent to the bottom of the southern ocean\nAnd what they found there was something so peculiar but even the marine scientists did not know what to name it turns out it is called\nThe headless chicken monster\nWe reached ... in ...\nMr wells for that had ... chicken monster sounds terrifying\nDoesn't actually look like\nIt's actually caught a graceful and beautiful sea cucumber that lives in that they say and um it can swim unlike some other ... what kind of looks like a pink overloaded with wings\nAnd how did you figure out what it was\nSo we were caught the pros we'd sit the camera on the sea floor in the southern ocean using one of the string fishing vessel slipped guys down all the feast or how he got a little too when we ... we really had no idea what it was the first game was a jelly fish that we did a little bit more research and that's when we would get out\nBut it's similar when they do things stand in the Gulf of Mexico and so on that by the way uh where I Would look into that it was a hit list you can also\nNow the monster ... is a is a lovely shade purple and it's almost by laughing gas it glides along the ocean floor how can something so unassuming Lee beautiful end up with a name like the headless chicken monster\n[noise] um well we didn't come up with the nine and our colleagues at the mess\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nI think that's why I created it that way\nAnd it has these these really delicate almost fairly tentacles that didn't that support it as it dances across let's err on the floor and what is it actually doing as good as it moves along the ocean floor\nYeah so it has been the easiest to swim so it can swing a up off the sequel\nThat's unusual for ... uh you know the most typical sea cucumber ah that you come across the street like a sausage there's laws on the sea floor the Hitler student most can swim and its wings from patch the types of food and then when it was almost like a fool\nIt has the tentacles in a ring around it's also uses it used to sit through the Senate and pick up articles of food\nAnd you didn't expect to find it in that part of the world\nThat throughout most of the records that we know of the hit list to get votes to secretly come from the tropics all the sub tropics whereas this one was found in the southern ocean nearly three thousand kilometers southwest of historian new and all of the cold heard it all and so we were caught surprised to find it that a sale\nAny theories on why it's there\nIt's possible to ones but um that area of the ice is is is applies we haven't done a lot of research we really only guess down into ... so this is going to the bar diversity that you have any side\nThey might be more critical was to get most of them that we really don't but there's almost certainly lots of other things that we've never seen before that will discover as weak to pull him all cameras\nCan you tell me about some of the other ... creatures that\nDown their son and one of them do some\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nAnd when the ...\n... the fact that you found that they had less chicken monster in the Antarctic um what does that tell you about the environment there\nBobsled I mean we're we're living in a situation of course where um you know the the West Bank and Gaza Strip and effectively now a divided for over a decade so you have how math\nAnd control in Gaza and the fact that dominated Palestinian Authority and the west bank both of which have shown\nA little uh provide the little room for supporters of the other to engage and expression organizing et cetera um policies of course of ... living under military occupation now for for over fifty years characterized by systematic writes abused and part of the split between the U.S\nHas been up there have there has not there's no legislative counsel there have not been elections in over a decade so you have a climate of which there is that the conventional political\nUm systems in place and then a context in which there to\nAuthorities that have little tolerance for the sun\nNow authorities most in the west bank and Gaza have claimed that these abuses are only isolated incidents that uh are properly investigated and dealt with how do you respond to that\nA ... you know human rights watch spent two years investigating these abuses and it's quite clear that these abuses are not isolated cases um we see arbitrary arrests dissidents across a different forms\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward we have to it's time to talk forums on race YWCA and he L. S. dot org\nCountries to reconsider their commitment given the accusations against the Palestinian authority a torture\n'em there's been significant focused on the international community and developing the rule of law I'm In Palestinian society but security assistance is being provided to forces that are doing the very opposite of maintaining the rule of law\nA human rights watch calls on uh the ... us an email with a case of the Palestinian forty to suspend assistance to units involved and widespread arbitrary arrests and torture and kill these abuses stopping perpetrators are held to account\nIn past reports you have repeatedly singled out Israel's for violating the human rights and Palestinians if authorities and the Palestinian territories are also committing human rights abuses where does that leads the Palestinian people\nWithout the people are stuck between authorities that are in tolerant of dissent Palestinians are and they're you know I'm fifty first year of an occupation characterized by institutional discrimination systematic rights abuses and it's at the same time\nThey're being squeezed by authorities Hamas in Gaza and about string theory in the west bank that are tolerant of dissent and are simply systematically stamping out criticism so Palestinians um you know are are are in a unique situation where they're facing\nUm you know a a an ugly occupation of a ride with abuse at the same time as authorities who have little autonomy exercising a little bit of power they have to ... operate ... police say\nMr ... thanks so much for speaking with me today\nMy pleasure thank you\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\n[noise] [noise]\n\n[noise]\nAnd I'll burn a woman is helping a lot of stories will help her race a major lapse in judgment\nLast Thursday Brittany Schneider made the drunken decision to spray paint graffiti in northern Thailand unfortunately she chose the thirteenth century wall she got caught and now she's facing happy fine and possibly jail time this morning Calgary eye opener host David Greene reached Brittany Schneider in Thailand\n... feet guys got drunk and have dire and can you sit there and they found like spray paint\nAnd lead to try to pick it up and start spray painting the wall and they were drunk could join any my name and I came to charity I finished the every right but I was doing wrong so I stopped at your idea that everything in the wall\nAnd and then what happened\nThat we all got they can make nothing happened to the pool and like I remember like what we looked at ... like I said oh my God we spray painted a while actually I was so scared like\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nYeah that she could\nLook you admitted it in judging from what you've told me you know you did something stupid um but when you said when you explain that to type police what did they say to you what what what's your sense as to how they're treating this\nLike ... like I'm very apologetic like I feel sorry for that and they really do think that they can get ... late ... punishment for it I think actually tells me that gets the fire that I don't think it should be I find\nThat was CBC Calgary has David ... speaking to Brittany Schneider Alberta woman has been charged after she spray painted a thirteenth century wall in northern Thailand\n\nDa da da\nDa da\nDa\nDa da da da\nDa da and witchcraft those are the charges against Milton, Ontario psychic she stands accused of ... people that have tens of thousands of dollars which explains the fraud and extortion chargers\nBut she was also charged under section three six five of the criminal code pretending to practice witchcraft\nAnd archaic provision that could soon be cleared from the books hoping regional police detective constable\nProgramming is supported by why WC Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty two you can visit wind WC A. M. P. L. S. dot org to learn more\nOf\nJust over sixty three thousand dollars in cash and property\nAnd what was told that was happening was\nAh you were going in for your original psychic reading and after that psychic reading she would tell you that you know she's sensitive that energy around you or she's sensitive curse and she used that and said that for six hundred seven hundred dollars\nThat you would pay to have her do rituals and cleansing in order to take away the fat spirits\nAs she would gain your trust she wouldn't a asked you for you know a couple of thousand dollars so that it can be blessed and be returning choose and in order to gain their trust you would actually give that money back\nAnd then over an extended period of time she would start to ask for larger and larger sums of money which would get into the thirty forty thousand dollar range wants to victim would start to ask for the money back [laughter]\nShe would say that that things would happen to bad things would happen to her family and then eventually just stopped returning phone calls\nNow obviously the clients who who went to her ... leaves and these sorts of powers but are there any other characteristics of the ... people have who were willing to hand over so much money to essentially a stranger\nTypically these are very vulnerable people there in a very vulnerable state in their life\nThey've either and gotten a divorce going through a divorce have lost a loved one suffering illness within the family or an illness themselves they're searching for answers are searching for anyone that can give them any good news or\nProgramming is supported by wind up you Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward when it's time to talk forums on race YWCA ... dot org\nVery beginning we only had a few victims and some people were too embarrassed to come forward and too embarrassed to move forward with charges\nSo that's why we had one great victim that we were able to glean a lot of information from and were able to charge the psychic with extortion fraud over and the witchcraft fortune tally in charge\nAnd then now because that's been in the newspapers and we've been able to get it out there a lot more victims have been willing to seeds and not be as embarrassed to be like wow this happened to somebody else okay this also happen to me and they're more willing to come forward", "year": "2018", "show_name": "As It Happens (CBC)", "city": "Rochester", "day": "24"}