{"month": "10", "state": "MN", "station": "KZSE", "content": "[noise]\nI'm Catherine richer part of it\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nYou want to keep up on current affairs and a lot to do is to be NPR News makes it easy for one source for international national in Minnesota you\nListen to catch up with the world go on with your dad NPR\nDiscovering what matters Georgia where the Republican candidate for governor also happens to oversee the state's election\nLaws and beyond the pale but not beyond a joke even after the murder of journalist ... ... a Saudi satirist living in London says he will not stop making his popular videos making fun of the crown prince those\nStories and more coming up on the Thursday edition of as it happens [noise]\n\n\nLive from NPR News in Washington I'm chase Stevens [noise] New York city police say they've given the FBI more suspicious packages intended for high profile critics of President Trump NPR's Quil Lawrence reports that authorities are now examining ten apparent bombs\nThe FBI is analyzing the explosive devices NYPD Commissioner Jimmy O'Neill says he is certain that the perpetrator will be found and prosecuted\nLaw enforcement professionals do not care about the politics behind these acts but we do care about is keeping the public reserves safe that's it that's the job fighting crime and keeping people say\nOf the devices has exploded and concern about suspicious packages has caused some false alarms\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nNPR's Carrie Kahn reports that while the group still consists of thousands its size appears\nTo be decreasing the line of migrants stretched more than a mile on the highway north out of the town of methods to ... thousand spent the night and the town's main plaza\nThe group was headed to the next town some twenty five miles away earlier in the week the United nations estimated the group at about seven thousand people in the Mexican government has said the numbers are significantly smaller\nAccording to Mexico's interior on Foreign Relations department more than Seventeen hundred people have left the caravan and applied for asylum in Mexico with nearly two hundred more returning voluntarily back to their home countries\nPresident Trump who has claimed without evidence that the caravan is riddled with criminals head of the U.S midterm elections is planning to an eight hundred active duty troops to the southern border Carrie Kahn NPR News Mexico City\nOn Twitter President Trump said he'll send the military to the southern border to stop the Margaret caravan from entering the U.S\nThat department of homeland security has asked the Pentagon to deploy between eight hundred and one thousand active duty troops for that purpose trumped administration officials tell NPR that the operation is expected to be up and running next week\nWild swings on Wall street this week but the market closed in positive territory today with the Dow Jones industrial rebounding for much of its losses in the previous session J. J. can a hand is chief market strategist for ... a mirror trade he says the markets wings are making investors look at their portfolios I think what\nHave done is they've ... and perhaps in a good chance to meet people\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nIs NPR News ... news comes from the Joyce Foundation committed to advancing racial equity and economic mobility for the next generation in the great lakes region learn more at Chili's F. D. N. dot\nOrg from Minnesota Public radio news I'm very finale results of an NPR News Star Tribune poll show Minnesotans are divided on President Trump's trade policies Tim pug my reports\nThe survey of eight hundred Minnesota voters last week found forty two percent approve of the president's trade policy including recently imposed tariffs another forty eight percent disapproval ten percent were onshore\nOpinions varied among geographic areas and there was a clear partisan divide Republicans overwhelmingly approving Democrats overwhelmingly disapprove\nPoll respondents were also split on the economic impact of terrorists\nThirty four percent say they will protect American Jobs forty six percent said they will raise the cost of consumer goods twelve percent said there won't be much of a difference\nStatewide Nineteen percent said the terrorists will leave them better off and they actually while thirty five percent said they will be worse off forty percent expected do change the polls margin of error is plus or minus three and a half percentage points\nTim pug Meyer Minnesota Public radio new\nOfficials plan to relocate several gray wolves from Ontario to Ohio real national park this winter it's the next step and rebuilding depleted wolf population only two remained into a cruise to it for and more will to the island from Minnesota this fall\nPlans call for transporting twenty to thirty mainland walls to Iowa ... the next few years\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nSo energy center well these guys fifty degrees and the twin cities ... six\nHello I'm Megan Williams sitting in for Carol law good evening I'm Jeff Douglas\nThis is as it happens\n[noise]\n\nTonight to making a mockery the murder of Jim ... suggests the Saudi regime will not tolerate criticism about a Saudi satirists and London scoffs at the notion he'll stops golfing at his nation\nThe prices writes Justin Trudeau says it would cost billions to cancel the armored vehicle deal with Saudi Arabia but an N. D. P. M. V. whose constituents would make the labs says not canceling will cost Canada more than money\nMay terms and conditions as the U.S vote nears complaints about voter suppression in Georgia where the Republican candidate for governor is also in charge of the state's election law tanks\nBut no tanks new bill would make it illegal to keep whales and dolphins in captivity and one senator says her experience as a residential school survivor factored into her support of the law\nTurning off his subconscious mind driver for us sandwich chain response to the call and instead of delivering food winds up delivering a man to the hospital\nAnd to make a long story short sub ISI scientist ... seals himself inside an airtight bio dome as an experiment but his breathless anticipation and ... when he approaches actual breathless in us as it happens the Thursday edition\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org [noise]\nThe murder of journalist Jamal 'cause she'll gee has hammered home the message to critics of the Saudi regime that dissent is not welcome and that is true even for Saudis living in exile who may have previously felt safe from retribution for speaking out against the Saudi royal family [noise]\n... almost ... is one of them he lives in London any produces a popular satirical weekly YouTube showed that pokes fun at the Saudi royals and has thousands of viewers inside Saudi Arabia we reached Mr ... in London\nMr out and I said he had a argued tempted to lay low or that and stop making satirical videos of the Saudi regime after what happened to a gym out ...\nActually I'm nuts because uh\nWe have to to the ... um ... having to Joe ... could happen to anyone else and therefore the whole world should get to know that you will face of the so the regime\nI don't need to tell you what happened to Jim ... he was murdered killed in a consulate possibly tortured and dismembered has not rattled you a little\nBit just a it is a horrifying but uh\nThis is what we should we we should is expected them to start with you and they go home and they they have ... million people from abroad and they are um ... ... people in Saudi Arabia for their own opinions there's a lot of the only difference with this a ... incident\nAnd there's an anticipation that twelve million people will die in the next year from war induced famine this prime minister when\nHe took office knew all about this contract he talks about confidentiality and he talks about penalties a he has been rather cavalier in in terms of throwing around numbers\nAnd I ... I just I Want to ask you about that because the prime minister says he's prevented from offering details but that there would be penalties in the billions if you cancel the contract what's your understanding of what the true price would be\nI don't know I have never been given any access to the contract\nUm but um he knows what is in that contract and I think that people should also recall that there's only a year left in the contract so the question is how many vehicles are are still to be shipped what is the nature of the vehicles were not even sure that they're all labs\nAnd the fact that he knows yes fit terms or confidential but she knows on Monday he said it was going to be a billion dollars\nOn Wednesday he said oh well a billion dollars a was just a figure of speech and now he's saying possible penalties and the billions a thorough so um it it's very very unclear\nBut what is clear to me is that as signers of the international arms trade treat age we have an obligation not to sell to human rights defenders and the world is going to come after us and and make us live up to ...\nAt the same time these workers\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more for their\nFamilies if there's only a year ago and only so many and left some of these armored vehicles to deliver what makes you so confident it's worth paying that price them to billions and penalties\nWhat price would you pay on twelve million lives twelve million people are expected to perish in the next year because of this war that the Saudis are waging we have to stand up and say uh this is wrong\nNow earlier this year though you weren't calling for those expert permits to be canceled you wanted them to be slowed down ... how did your mind changed on that well\nI'm In terms of um\nWhat was going on I think that there needed to be clarity and it's interesting\nYou're talking about what was going on in Yemen\nYet what was going on in Yemen and there have been reports over the last a while and speaking with um with representatives from General Dynamics they kept assuring that they had close contact that they actually went and inspected what was going on in Saudi Arabia\nAnd they were sure that there wasn't anything on toward a but clearly a that is\nI guess more hopeful than a than a than truth show\nWell can I just that's just so is it not somewhat naive to believe that when you're shipping these armored vehicles to whatever country that they will always be used for peace making purposes\nI think it depends on who your customer is and in this case it's a very unreliable customer if we were to find a customers among our NATO allies\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more very much for speaking with me ms Matheson\nOh my pleasure take care thank you for the opportunity I think you have to die\nI re map as soon as the ... member of parliament parliament rather from London fan Shaw we reached her in Ottawa\n[laughter]\n[noise]\n\n\nPolice have so far this week uh intercepted at least ten pipe bombs in the United states addressed to some outspoken critics of president Donald Trump\nAnd investigators are still trying to find out who is behind them but President Trump was already playing his own blame game today against the media\nOne of his tweet said quote a very big part of the anger we see today in our society is caused by the mainstream media that I referred to as fake news unquote\nOne of the pipe bombs was of course address to CNN and this morning CNN reporter Abby Philip asked White House press secretary Sarah Sanders [noise]\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org ration\nAbsolutely day in day out there is a negative ... Ninety percent of the media attention around this president is negative despite historic a job creation despite the fact that our economy is booming despite the fact that\nTrade deals that everybody said couldn't be made have been made despite the fact that the president is trying to solve law and order at our border and protect the security\nOf the Americans are from the east coast to the west coast north and south he does continue to focus only on the negative and that is there is a role to play yesterday the very first thing that the president did would come out and condemned the violence\nThe very first thing you're networked did which come out and accused the president of being responsible for that is not okay the first thing should have been condemned the violence\nWas White House press secretary Sarah Sanders answering questions from the media this morning [noise]\n\nAnd\nYesterday afternoon Curtis by what he took his first breath of fresh air in over fourteen hours the self described ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot\nOrg to learn more ... why is that like to take that first breath of fresh air after fourteen hours enclosed in a plastic wrapped cube\nKosovo's pretty fantastic up until then we're felt really sick\nAnd breathing in our regular fresh atmosphere was it was great\n[laughter] so tell us why did you shot yourself up in an airtight container\nSo I Do science experiments on my YouTube channel just in order to raise awareness about basic science concepts and I think that people really don't understand the climate change because they don't even understand what the air is made out of\nAnd you know it's not their fault but I'm trying to do projects like this one\nSo this one I see myself in a box to raise awareness about the base science concepts surrounding climate change\nOkay so let's talk about the actual ... down that you constructed how big is that\nIt's ten feet by ten feet by ten feet so it holds thirty thousand leaders of air which sounds like a lot but really isn't\nAnd and what did you have in there with you\nYeah so I had about two hundred plants which were the most important part and I had a lot of air monitoring and health monitoring equipment and out of ... to sleep in a bunch of food about eighty leaders of water and a bucket\nOr I Would think that would be necessary [laughter]\nKind of plants did you have in there with you\nI had a pretty big variety of plants I had some sunflowers and some corn and beans and\nProgramming is supported by wind WC Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty two you can visit YWCA M. P. L. S. dot org to learn more looks\nLike something where you were request they pin from your bank but the thing that caught my eye was that it had a a fish of the United States Postal service change of the address stick them on it so when I open the notice it said that we have indication that you have moved [noise]\nAnd you need to fill this document out [noise] if you do not filled the form out within thirty days we will then move to them in an active roles\nNow that sentence clicked on a whole lot of Bell's in my head because you cannot place anyone on the inactive roles unless they have not voted and at least two federal cycles we had just voted\nSo there was no way they could put us on the inactive list we were being sent that now this illegally we moved within the same count\nAnd say not count on staff and you challenge and how did you challenge it\nBecause I was so distracted that I took a picture of it\nI put it on Twitter uh the ACLU side they contacted me after that they could represent me in a case and I I agree and I'm so thankful for that and we challenged secretary of state ... who's our chief election officer as well as my county\nACLU decided to settle I wanted to take this to court but I was faced with a dilemma\nOf there were a hundred and fifty nine thousand who are in the same circumstances ally than we were sort of in a limbo in terms of the loop be allowed to vote so in order for myself\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nOnly denies that he's attempting to suppress the vote in any way what's your response to him\nMy response to him would be let's have a conversation because there are questions about my case that's simply do not fit the rhetoric that he looked like us to believe I was not in an active voter but I Need to know why it was targeted because the only thing I can think of I Am black\nI Am female and I tend to vote democratic\nWell it's been widely reported that people most affected by this are and like you black or poor people what memories does that evoke for you and for many black people in Georgia\nOh for me that was so personal you know I don't they civil rights baby um I grew up during the most turbulent times of our history and I have a connection\nThrough my own family I mean everyone who is African American in this country we have a connection to the fight so if you don't want me to vote you do not see me and it's not one person one vote is no person no vote\nDo you think the perception that you have and many other people black people uh especially that votes are being surprised that this hurts the legitimacy of elections in the United states\nOh absolutely I'm a big fan of the Democratic process if anything should be nonpartisan this should be however throughout the country not just Georgia this has become a partisan battle and there's undue cuts any message\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nFor this country [noise] put their lives on the line and shrimp don't you turn around\nCome to me and John the I'm not even worthy of voting and you're going to try to take something that the ... right no I Will not stand for it\nMeans Hopkins were going to be watching this very closely thanks so much for speaking with me today\nThanks for asking me\nWe reached D.C Hopkins in Atlanta Georgia and we do have more than a story on our website CBC dot C. H. slash a I H [noise]\n\nCanadian Donna Strickland won the Nobel Prize in physics earlier this month a lot of people around the world couldn't help but take note of her title when they were surprised that a scientist could win the most prestigious prize in the world and still only be an associate professor [noise]\nWell now the University of Waterloo has officially made mis strict lend a full professor on October second issue did come up in ... conversation with thrown a strict one and there's also a lot ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\n[noise] ...\n... is a delivery driver at a Jimmy Johns in Columbus, Nebraska Jimmy Johns as us restaurant chain that serves challenges so as you would expect ... typically the people who call are hungry and they want to order food\n... when a manager picked up the phone this past weekend the caller had a more urgent request her brother needed a ride to the hospital he was in pain bat is where's that Kilmer came in we reach Mr Homer ... Jimmy Johns in Columbus\nMr ... so you're at the store this weekend what is your manager tell you about this phone call he has just received\nA I mean well I just came back from another delivery and basically what he said was a we don't have any more deliveries to do but we've got a guy who used to go to the hospital you want to do that\nHow did you react when you heard that someone had called Jimmy Johns for a ride to the hospital\n[laughter] it was kinda funny at first and it was definitely something unusual though it wasn't really something that I knew what to do about it and stuff that I think about\nYour manager told you might take to give her call\nMe and he gave me the choice is a different color if if you want I mean if you don't want to that's okay because he he wasn't sure either exactly what we should be so I thought about it for a little bit and then I decided that I should call them in secret name\nWhat did he tell you when he when he gave you that choice\n[laughter] well we weren't really are\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\n[noise] [noise] well I called in and I guess right away I just I just asked her what what his name was ... he was and then we kinda talked for a little bit longer and so I think we both came to realize\nThey can pretty much at the same time that she wasn't talking to ... who she ... she thought she was talking to that point after like who who to who is it do you think that you're talking to and she said\nWell the social worker and I said well no this is Jimmy John [laughter] so why [laughter]\nAnd so at that point I guess you you were faced with another choice\nYeah well she and she was when she heard that then she she was kind of you know kind of discouraged 'cause I think she thought she was talking to somebody", "show_name": "As It Happens (CBC)", "year": "2018", "city": "Rochester", "day": "26"}