{"month": "10", "state": "AL", "station": "WNTM", "content": "Loosened weekdays five AM to be a ... one thousand dollars nice radio is Kevin ten WN T. M.\nR. for news radio seven ten WINZ ... radio you can hear Rush Limbaugh he goes out of ... [noise]\nGlenn thanks [noise]\nDone here [noise] I'll talk to you later [noise] flown\nTo the program glad you're back I'm just talking to Steve off the air is fascinating\nIs that really really really a fascinating\nEach one of those guys to his you know really walked through the fire for his principal um and uh I I that's something I really respect\nLike what he says about Donald Trump Donald Trump south problem not just he's a reflection of of us and he's reflecting that part of us that says get him when he's really he's really done his homework on on Donald Trump and and\nAnd how bright he is on reflecting the people and it really when you look at how Donald Trump is reflecting a those guys if you will\nIt really shows how wrong the Democrats the the democratic leadership really is they're just they're off the deep\nEnd I think I mentioned I don't know if I mentioned is off the air but there's a certain the New York times today this is the headline in the New York times\nMichelle Obama wanted Democrats to go high now they aren't so sure\nAnd it goes through the Eric Holder a quote or when they go low we kick the Michael ... when they go a low I say hit back harder um Hillary Clinton you cannot be civil with a political party that wants to destroy what you stand for 'em when we when that's when civility concert again\nUm there was another ... a Joe Biden if I were in high school I'd taken behind the gym and beat the hell out of him\nI mean this is as they sit there in the new democratic what's the difference between\nThat and Donald Trump saying when they hit me I hit him back twice as hard\nWell I mean I I you know that\nDid what they're saying they are trying to oppose is Donald Trump yes right I mean I you know they're not they're not certainly not selling themselves as the new Donald Trump's mhm they're saying that Donald Trump is so bad we must act this way\nUm so I mean I you know I don't like it from anybody so I mean I I've been clear about that over the years but still I don't think that that it's it's an amazing thing I think because you look at Michelle Obama who who is the only one that I saw all of the Democrats who came out and said holder comments were bad\nThat's her phrase that was being criticized strain but she was she was saying like no that's not the right way now to me that is complete lip service the Obama administration played lip service just civility paid lip service to bipartisanship they paid lip service to a lot of times\nWhat made them almost unbeatable for the average person right\nThey they won twice based on that mhm and even though they were just as hard nosed as any other\nDemocrat justice hard nose they at least tried to hide it\nThis switch is now overt we're harassed Maxine Waters were harassing people in restaurants harassed them go after them several Democrats have said there's no it is the new policy seemingly of the Democratic movement as defined by Eric Holder who said this is the new democratic part\nAnd it's amazing how they all claim to be the new civil rights leaders\nBecause they're all emulating Malcolm X they are not emulating Martin Luther king yeah that was really the the ... that was his Vail mhm I mean that's what that's what won the civil rights I contend if ... if if Martin Luther king would have swung back\nAnd it ... they would have followed Malcolm X\nThings might have been worse for ... for a for blacks for a while\nBack very rarely does that does that tactic work right I mean people want\nThey don't want to think of themselves as you know as you know animals harassing innocent people in a restaurant and that's not something that anyone wants to ... you want to associate yourself with those people ... right and you know you see that occasionally on the right with certain groups who who go down these roads\n... you know the alt right for example if you will you'll hear from conservatives about the alt right generally speaking is either they're\nHorrible horrible and the people in the totally wrong and all these issues\nOr they don't exist right like there's very few people were like you know what the right pretty darn great I mean Breitbart famously a you know what I don't know not to you know Steve Bannon was the one who said that that Breitbart was the platform for the alt right but really\nOutside of Steve Bannon you've seen almost no embrace of these groups are largely because no one wants to be associated with them right right like who wants to I don't want to I don't want anyone to think I'm friends with that guy right it's just a normal human instinct\nAnd that's not even not seats that's all right really nobody even knows what All right is I mean the average person\nThey just see them as people who are going out in the streets and you know a beating people up or torturing people or or marching against you know Jews in blacks and everything else and you're like I don't want to be part of that I just don't want to write a ugly I don't want\nThat I'll be ... there was an actual death in Charlottesville right and then everyone would say that that is horrific um but you know there was also over there right like we're just marching around with torches and saying horrible things do you want to be associated with any of them well no\nBut the left also there was ... the shooting of of our of our congressmen a year ago and it's like it never even happened\nNobody the guy who was arrested this weekend the I think it was CBS that was reporting this he was arrested because he had built a two hundred pound bomb and was going to blow himself up on election day they didn't even report that he was a leftist\nThey just won't recognize it uh and you know who on the left standing up\nAgainst that who is standing up and going oh we don't want to be you know that's not us we don't want to be a part of that they just denied that it ever happened\nAnd it gives them this ability just to [noise]\nSilently endorse them\n... real morning habit news radio seven ten doubled un P. M.\n[noise] tonight ten nine central on ABC finish the sentence for millennia Trump is the first lady the interview Ken women in the me too movement call us for no question is off limits you're not the first first lady to have to deal with her husband's alleged infidelity has put a strain on your marriage\nTo know what will Milan even Trump say let's talk about the jacket this\nWhy did you wear being Maloney the ABC exclusive event\nDon't miss it tonight at ten nine central on ABC\nDust pollen dark we spend most of our time indoors film I read in the outdoors when you're inside too with over six hundred scientists to choose from plus custom option we have a solution to make your indoor air cleaner fresher and\nWell better our filters are manufactured right here in America and shipped free within twenty four hours and you can sign up for a subscription say you never have to think about air filters ever again\nIf you've ever experienced heart racing shortness of breath or dizziness if possible you could add a trio fair relation one of the leading causes of syrup find out before it's too late\nWith cardio mobile the FDA cleared personal EKG device than just Ninety nine dollars to order visit cardio dot com K. hate our D. I. A. dot com cardio mobile fits in your pocket and so you can take an e Katie anytime anywhere and right when you deal with them in\nThe party and mobile delivers a medical greedy cagey right to your smartphone and just thirty second you'll know your heart rate them is normal poor atrium relation is detected\nDon't wanna cardio mobile today for just Ninety nine dollars is a cardio dot com K. R. D. I hate dot com\nTick unlimited Katie's morning noon or night you can always know how your heart is doing\nCardio ... much peace of mind in your pocket for only Ninety nine dollars ... party a dot com K. A. R. D. I. A. dot com and\nWant to make your own mobile comfortable place but don't think you can afford a top brand heating and cooling system\nWill carry or has the right solutions for every budget I'm uncle Henry I'm a customer of heads heating and air conditioning and I asked them to turn to the experts carrier\nAnd they showed me carriers full line up a best in class home coverage systems and they helped me pick the one the best fit mine needs in my home budget from carriers value priced comfort series to their top performing infinity system carrier banks all their products with strong warranties and a commitment to provide innovation and quality a commitment that's made carrier\nThe industry leader since Nineteen oh two at carrier they make the best more affordable than ever turn to your local carrier expert\nHeads heating and air conditioning they've helped me with emergencies in the past and with a brand new system that I still love ... heads at two thought one six five three seven eight seven three that's to buy one six five three seven eight seven three\nThree inches better [noise] get traffic and when they're on the nine mornings on Youth Radio\nAnd joining us yeah mobiles and I urge radio station ... W went actually H. D. three mobile\nMichael's past of destruction police the Brady Fox need is damage has been for a second day now in several states from hurricane Michael\nCurry ... through a someone's home um and they're all over\nJust rank amateur on professionalism but the reason I played this is is not not to mention this guy but because while this guy is jumping all in my chili\nListened to this story this is from the federalist papers liberal professor says hurricane victims deserve to what thank God because they support Republicans\nNow do you think these clowns in Boston with zero in on something genuinely get range like this no they're going to make up the fact that a bunch of people like me who I Know that climate change man made climate\nChange is a hoax are somehow responsible for people having lost everything including risking their lives\nDoes\nUniversity of St Thomas engineering school in Minnesota thermal and fluids sciences professor Dr John Abraham he's a professor actually believe the Florida Panhandle residents deserve to get hit by a catastrophic hurricane because they elected climate deniers\nHere's the headline in an article written by this guy was published in the guardian not some obscure little rag or penny saver this was published in the guardian\nOn Thursday victims of hurricane Michael voted for climate deniers elections have consequences denying science has consequences and we are reaping what are we so\n\nPeople just like this are teaching your kids and they're being paid a lot of money to do it\nThis is the watch chicken the reasoning that he is teaching at ease engineering school the guy is still range this is this is hyper political partisanship disguised as science\nHe thinks that voting for Republicans causes hurricanes to hit red states and the people in red states who voted Republicans deserved to get wiped out by hurricanes for voting for Republicans and his name\nIs Dr John Abraham a University of St Thomas engineering school in Minnesota\n\nDespite the lack of science to support his case Dr Abraham blames Michael's intensity on manmade global warming there isn't any evidence for it it's not\nThe most intense hurricane ever hit the panhandle\nYet he blames the intensity or manmade global warming are needing to subsequent claimed that southern voters brought this upon\nThemselves by voting Republicans into office\nIt's a wonder that a state like Florida which will get pummeled by Michael couldn't vote for somebody that denies climate change this doctor wrote\nPointing to governor Rick Scott and Senator Marco Rubio and his argument is that in the last Republican climate deniers or voted out of office that more hurricanes will bring more death and destruction\n... so this clown who is disguised as a as an engineering professor literally is saying that if you want to stop\nDestructive hurricanes striking where you live vote Democrat he literally this one is what he said\nIn an unrelated story a bunch of which is somewhere are putting a tax on Brett Kavanaugh this week and I'm not making that up and they are disguised as Democratic Party activists are tax on Capitol I'd I'd I don't know what the nature of the ...\n\nI mean this [laughter] if if it if it weren't so irresponsible that would be funny meanwhile you have the entire left now attempting to destroy Kanye West\nAt what Kanye West Dan is simply venture off the liberal Democrats plan to shoot and that is a no no if you're African American you venture off the Democrat plantations they are going to destroy your meanwhile idiots like this professor\nA professor of engineering literally tells people\nThat if you want to stop hurricanes from blowing up where you live vote Democrat it's because you're voting Republican and and denying climate change that these hurricanes are coming after you now do you remember after Hurricane Katrina you people might have thought that I was joking\nThere were people\nIn the leftist medium who literally we're trying to tell people in New Orleans that George Bush wanted that hurricane to strike Louisiana\nHe wanted it specifically the strike New Orleans this is why there weren't any warnings it wanted it to strike New Orleans because Bush knew that residents of New Orleans would have to abandon the city\nAnd go to Texas where as Democrats they would be absorbed and wouldn't affect any political outcomes but in Louisiana you can turn the state Republican if you get rid of a bunch of New Orleans Democrats and so whatever people out there saying that Bush\nActually wanted to hurricane to wipe out New Orleans so that residents would have to leave\nWould have to go to Houston\nThere were some even saying that Bush was doing what he couldn't just steer the hurricane that Bush was responsible for it because Bush told the weather service to downplay the warnings\nWell I didn't want to mention it but I'll go ahead and mentioned there were some that now these were not mainstream media people but they did repeat this there were people out there\nTalking maybe ... takes on the Internet who are claiming that Bush was steering the hurricane\nRemember that\nBush was hearing that hurricane Bush himself the president was fearing the hurry and and what this guy is professor at the University of St Thomas's no different\nSeven ten W when GM sponsored by C. P. C. office technologies providing service that can't be copied visit them today at C. P. C. T. E. K. dot com\n[noise] south Alabama jaguars football is on Ninety six\nDown south up out oh that was a way of two thousand they seen his head football coach have Campbell jak system when they first ...\n\nHours prior to kick off on her local offer jak football Ninety six one of the rocket and I heart radio just search jak south Alabama host Alabama State senator X over Thirteen tick off for ... from people stadium [noise]\nMany of us have been thinking of our friends and neighbors down the coast those impacted by hurricane Michael either I Mason for bachelor service heating and air we all know that with a big storm the power can go out for several days but even if the power goes out for several hours as it did in our neighborhood the tropical storm Gordon just a little while back\nThat could be a problem if you need to keep the power on metro bachelor service can help they have generators in stock and can service your existing generator learn more at bachelor service dot com\n[noise] now doubled you Wednesday em Gulf Coast weather from NBC Fifteen\nI'm Jake done from NBC Fifteen with your weekend forecast we start with a fantastic friday sunshine in Seventy nine sixties\nFor your high school football plans overnight tonight we're back in the middle fifties on Saturday and sunshine in a high in eighty one little bit warmer on Sunday few clouds in a high of eighty seven I meet ... Jake done from NBC Thirteen have a great weekend\nFrom the all clear plumbing and free studio calls have you five oh wait wait this is these radio seven ten W. N. D. M.\nLawsuit zone Chris foster told about eighty percent of the areas and Florida hit by hurricane Michael been covered by search and rescue teams looking for bodies were survivors needing help we used to living deaths are blamed on the storm FEMA administrator Brock Long says besides making sure everybody has the central that'll place to stay\nFocused his own communications uh you have to be able to communicate to appropriately response um and you know we're we're trying to do everything we can to get the private sector vendors of horizons and Eighteenth ... of the world to get in to try to get their systems back up and running or about\nOne point four million power outages from Florida to Virginia President Trump tweets pastor Brunson will be home soon Andrew Brunson is a free man in Turkey after two years in prison in house arrest accused of supporting an overthrow the Turkish government South Carolina Senator Lindsey Graham tells box I never\nBelieve one minute extra brunch but has any still will cause the Turkish government is this is Fox [noise]\nFive and I every weekday on news radio Seventy WN GM [noise]\nThat's right it's not like friday\nOr whatever you want to talk about the folks have added that the ah the rule it's not that way Monday through Thursday you might not hear any difference as a listener\nBetween friday and then the other day but there is in terms of how we screened a program not Victoria Bissell brown retired history professor at when al ... which means she\nAlso taught your children [noise] Grinnell College [noise]\nWritten now that's a big name in Iowa but I I'm not I didn't I didn't bother to look we're ... college is she lives in have referred Pennsylvania ... township so anyway I yelled at my husband last night not pick up your socks yell\nNot how could you ignore that red light yell this was real yelling\nThis was not why did you leave the toilet seat yelling this was thirty minutes from that got yelling\nTriggered by a small fought was dismissive annoyed patronizing comment really small microwaves it triggered a hurricane I blew I was so mad I blew hard and fast and it terrifies me I'm Still terrified by what I felt and what I said\nI'm almost Seventy years old I Am a grandmother\nYet in that roiling moments screaming at my husband does if he represented every clueless guy\nOn the planet I announced that I hate\nAll men and I wish all men were dead if one of my grandchildren ... something that ridiculous I'd have to stifle\nLaugh my husband at fifty years did not have to stifle a laugh he took in dead serious like I don't have I doubt that he did [noise] I don't think this guy is probably ever laughed with his wife in fifty\nYears [noise] but that's just me speculating let me continue my husband\nDid not defend his remarks he did not defend men he sat hunch doesn't hurt and he listens to me\nFor a moment it occurred to me to be grateful that I'm married to a man who will listen to a woman\nThe wins calmed ever so slightly in that moment when I realized he was okay and then the storm surge wound up in me as I realized the pathetic impotence of nice men's plan to rebuild the wreckage\nBy listening to women [noise] guys you really saw hopeless as soon as this guy get anything right and he blew it he listened to everything and his wife still well up and exploded because what he was doing there wasn't enough\nAnd yet there's nothing else he could have done\nAs my range rushed through the streets of my mind I'll guarantee of most of them are one way folks toppling every memory a very good thing my husband has ever done and there are scores that\nYou really want this woman said she's gotten mad hear her husband is not responsible for it and she's getting madder and madder and madder and him in the midst of him doing everything right\nThere rages rushing through the streets of her mind toppling every good memory of her husband she's got this is in the Washington Post\nI said the meanest thing I've ever said to him don't do you share sit there and sympathetically promised to change that is what she said to end the meanest thing ever don't say\nThat you're going to stop yourself before your blood out some impatient annoyed controlling remark\nThis woman Seventy she still mad their husband controls her I guarantee you what's the other way round [laughter] no I said to him you can't change you are able to change you don't have the skills and you won't do it\nYou are you said or one of the good men you respect women you believe in women you like women you don't hit women you know raped women or in any way abused women you have applauded and funded feminism for fifty years you're one of the good guys and you cannot change you can listen all you want but that will not create one iota\nWhat Ben this poor guy ... foot [laughter] what this woman is saying\nThe guy is perfect and yet he's guilty he's perfect because his perfection will not change anything his\nBeing right on the money everything she wants will not matter\n\nThe centuries of feminist movements that have washed dropping away good men have not once organized their own mass movement to change themselves\nAnd their sons or to attack the mean spirited teasing punching thing\nThat passes for male culture not once bastards don't listen to me listen to each other talk to each other on your power for once the gender war that has broken out in this country is flooding all of our houses it's rising I'm tired of memories that\nAnd they're calling it feminism because they're choosing to live that life well that's not\nFeminism her opponent again the highest ranking woman in the air force first female fighter pilot marked on mic Sally [noise] have you seen the\nPolling data on some of the Senate race hits looking bad it's for the Democrats are Democrats in the capital effect is\nIs very real\nI mean it's looking bad for mansion even it's looking bad for Heidi Heitkamp is looking bad for a guy in Indiana Donnelly smoking ban for this woman ... on an Arizona\nBeto O'Rourke who has got the the left Hollywood is throwing money at better or worked in Texas and he is continuing to lose grounded Ted Cruz\nI mean there are some I've read speculation that that Senate race is over I don't want any of you believing that\nBody wasn't long ago that Beto was leading crew is if you believe the polls it it looks like if the if the election we are today and if the polls are right that there isn't anything approaching a blue\nWave and the Senate and in fact it is a red wave\nAnd now there's more evidence for starting to see if I have details coming up that this blue wave in the house may be a a myth\nSo we'll just have to see details coming up let me get to the phones always try to do that in the first hour on open line friday Lake City Minnesota this is Phil I'm Glad you called or high\nHigh Iraq's August first state aid that does and I wanted to say that then that will be etched in my hype a cat in the U.S is your laughter your laughter I mean you're updates the first time I heard clause knowing me I just about drove off the road it's a pleasure thank you for\nThirty are more and more than welcome sir and I appreciate that I was telling me is our prayers are official gay community update and we haven't had occasion to play it recently but might revive it from the archive today just since you brought it up\nThere still whole areas beyond description uh I hold them back for science degree what NPR graffiti and we used to talk about what is the optimal cap when you hear these are people with the UN and wherever talking\nAbout well the climate change everything burning up they never tell us what the optimal temperature is a but every time the temperature goes up a few degrees\nBut you have large swaths of Canada Russia China that are you know I'm terrible turn into a better agricultural areas and we ended up a feeding more people are case in point\nA mere ten thousand years ago here enough to head west we have this giant oil a shirt sitting over most of the country\nAnd then this wonderful thing where the climate warmed up and we have for this area that's suddenly feeding the world so every time the temperature goes up\nA little bit ah we feed more people so I don't know what the problem is I mean\nWhat Oh yes it does make the problem is they're trying to scare everybody into signing on to this because it's it's classic if you sign on to agreeing to the whole premise of climate change your green do a lot you're agreeing you are to blame\nAnd that's a big one\nBecause when you agree that you are to blame then they hit you with but you can fix it you you you can make demands and how do you do that you agree to pay higher taxes you agree to become an activist you read and start criticizing everybody else\nSo they get you to accept blame then you also admit that\nGigantic organizations are the only way to structure our lives and to protect everybody so it's it's simply a waving guilt people into accepting\nWhen they don't even know this is being done to them the premise of socialism communism\nUnder the guise of saving the planet but your point about the optimal temperature I've expressed that in a different way over the years how do we know folks that climate conditions right now\nIn the entire history of this plan on how many hundreds of thousands of years whatever it is how do we know that the temperature and the climate right now is optimal is perfect is what it should always be how do we know that\nWe don't\nIt's the vanity obese people assuming that this is the baseline this perfection anything that veers off from here is a problem there so full of it I Can't begin to describe the way\nIn every corner of this was your name is a household name\nLimbaugh ... beat Mitt work news radio seven ten WN PM [noise]\nCarlo a steel worker is married to his high school sweetheart a cancer survivor they have a special needs son Carlos just been laid off from his job losing his medical insurance and to make matters worse the bank is about to foreclose\nOn his house with his back against the wall Carlo will do anything to protect his family directed by and starring James ... Carlo is based based film and a bail on Amazon I tune in Google Play watch Carlos inspiring story today on Amazon high tunes and Google Play\nTonight ten nine central on ABC finish the sentence for millennia Trump is the first lady of women in the me too movement call you a supporter of no question off limits you're not the first first lady to have to deal with her husband's alleged infidelity has just put a strain on your marriage\nTo not one of them belong to Trump say let's talk about the jacket\nWhy did you wear being Milan\nABC exclusively that don't miss it tonight at ten nine central on ABC\n[noise]\n\nWay\nBacking Saturday Night and I\nBeauty of how to live on the news\nThis Wednesday night as a\nResult of the\nBox office\nWe\nWatch the whole thing I like to listen to news radio in Dublin he went\nOur radio it's that easy and I got\nSome emails rush the woman from Grinnell in his seventies where does the woman that it [noise]\nWhere does she do learn that kind of have [noise]\nThink I have the answer\nI don't think that's hard at all [noise]\nI Will share when we got back [noise]\nEvery so often I'll see people on social media ask the question what Dennis should I go to and I always tell them to go to my dentist H red cliff brown junior he's a good thing you know one university boulevard immobile I picked him because friends of mine recommended to me\nWhat is Paolo Alto university\nWhat do they do there\nAnd the short version of the story is it is a play is run by women\nThey ... themselves as a school that prepares women to become experts in psychology their website\nCouch saw the wonderful things they can do for women and Seventy three percent of the faculty to students whatever are women never on their website is there a mention of seeking men about psychology so I concluded that this is a haven for women\n\nNow this this this professor here from a written now university Victoria missile\n\nYeah I I I Know women my age who grew up with the Gloria Steinem ms magazine Betty for Dan version of militant feminism\n\nAnd back then it was basically about equal pay for equal work and not getting married and not letting them am defined your happiness a relationship a marriage or what have you\n[noise] but where do these women come up in the ... where do they get to have I have a theory that it has to be it has to derive from the fact\nThat a lot of its media I\nThis particular woman published in the Washington Post\nProbably listen to NPR religiously probably read the New York times religiously probably watches CNN religiously\nAnd as a professor at a university\nThey are surrounded she is surrounded by other like\nMinded women\nThey feed on each other's bad experiences with men they retail and retail story after story after story\nAnd it's kind of like all Kanye West said yesterday Kanye West said that\nIn groups of people were there isn't any male energy people are gonna go nuts after awhile\nKanye West noted philosopher an Oval Office visitor\nMade that point yesterday and I think that's where this comes from I think it hanging around with with the other angry politicized leftist women\nWhatever anger there is gets\nRetold and retold and it becomes more and more intense and that raises this woman does not hide the abject range the almost on contain a bull anger even for her husband who she is perfection\nThis\nThe reason why this is Rob this is the American left folks this is the Democrat Party this is the group of people that thinks Hillary Clinton is the Hillary is one of these women\nHillary Clinton is exactly one of these women running around\nFilled with range on controllable rage hatred an anger that is compressed and intensifying each and every\nDay and I'm telling you no matter what the drive by just think it's not infectious it does not make you want to join the team\nIt makes you think these people are nuts\n\nIt's that far out of the mainstream yet to them it is the main stream\n\nAnd this is not gonna sit well this is not a good day for me to move but actually it happened yesterday New York judge drops sexual assault charge against Harvey Weinstein\nNow we're not hearing much about this shockingly because Kanye West is eating up all the oxygen in the news bubble\nDisgraced movie mogul Harvey Wang's team has won last count of sexual assault being brought against him before his trial begins according to the Daily Beast\nOn Thursday morning a judge dismissed one of six criminal counts brought against the disgraced mogul by the Manhattan da ... ...\n... Evans alleges that winds dean forced her to perform oral sex in two thousand four ... stands attorney Benjamin Brafman argue that the charges be dismissed due to Evans previously describing the sex act to a witness has consensual\nA witness reportedly told this to the Y. P. D.\nSo Brafman sudden a press conference this is not about suggesting that a woman who comes forward should not be believe this is about a witness who came forward\nAnd committed perjury before a grand jury now wait a minute just a Brafman\nWe're coming off the Kavanaugh hearings were we were told women can't lie and we were told that women don't lie and we were told that we're not to think women lie anyway and you are\nNow saying that a charge was dropped because a witness who came forward and committed perjury perjury before a grand jury\n\nDon't worry Harvey Weinstein is still a creepy pervert out there still has five counts against him but in this case he found somebody who was willing to sell it and what he wanted and they reduced the five to six charges to five speaking of Hillary [noise] you know what I'm living\nLimited service on bed rest her real quick I have a feeling that we're going to have a Hillary Clinton this is amazing by the way this is recycling an old\nStory that we have previously laughed at I Can't tell you how many ... looks like okay good don't have it here no big deal\nHillary Clinton to Trump you asked Russia hacked me on national TV this is the most amazing thing and this story is another great illustration of the divide\nThat exist between saying an insane in this country\nAnd how the people on the insane side had literally no sense of humor have none no perception of what so ever of humor\nHillary Clinton fired back at President Trump yesterday after reclaimed today earlier that Clinton had engaged in a conspiracy with Russia\nDuring Wednesday nights campaign rally in Pennsylvania Trump told the crowd there had been collusion he said well if you look at it when you think of but there was collusion between Hillary and the Democrats in Russia there was collusion there was a lot of collusion with Russia and lots of other people by the way\nAnd he's right what he's talking about here\nIs the Clinton campaign the Democratic National Committee hired fusion GPS founded by Glenn Sampson who's refusing subpoenas to testify to Congress claiming the Fifth Amendment\nFusion GPS took the money from the Clinton campaign the DNC and went to a law firm cut out called Perkins ... this was\nDone to make Hillary and the DNC money look why they were buying a legal advice and campaign advice but the law firms then funnel the money\nAfter wandering through Christopher Steele and he went out and created this lying stinking phony dot CA the one that has the story that Trump hired a bunch of prostitutes in Moscow\nTo urinate on a bad ... that had been slept in Bible rock Hussein all and Michelle my bell oh\nThe ... is is not a single bit of it has ever been corroborated like balls the Ford story not a single bit of corroborate ... no evidence whatsoever and yet that\nDot CA was used to get a finds that weren't the spy on the Trump campaign\nAnd that dot CA is what kicked off in a truth ... special counsel investigation to try to find collusion between Trump and Russia to many of his old knows but that's what Trump's we're learning to and Trump is exactly right the collusion here between anybody in Russia is the Hillary Clinton campaign the DNC\nAnd the route is Hillary Clinton DNC to I'm a\nFusion GPS then on to Perkins collie and then to steal the money still got went through a bunch of different layers before he got it but they essentially commissioned an opposition research hit piece on Trump that they tried to sell every body was legitimate entails Trump's what\nIt is out here what rate goes bananas she can't believe the truth is being told about her she can't believe that they can't let this day and so she has to\nTrump is the guy that asked the rushes to heck me he did it on national TV Trump is the guy that he would and they have tried to make this case\nI it's the funniest thing in the world Trump was down in Miami up his resort down there to route and this was a period of time where Hillary's emails number sixty thousand total on her server\nAnd she told that there were legal or illegal server private server private address while she sector I state\nEgos are such that they never want to admit\nThat anybody change their mind they want to say they came to these conclusions themselves\nAnd they will openly reject ah any claim that somebody change their mind or talk not everybody but a lot of people that way um\nThe hypocrisy is not useless I mean it's highly entertaining and it is substantial savings\nI'm for people but in terms of of ... Democrats I just found that never ever really been tripped up by it largely because the media doesn't make a big deal [noise]\nRush Limbaugh on news radio seven ten WN PM sponsored by CBC office technologies providing service that can't be copied visit then today at C. P. C. T. E. K. dot com\nI Want to tell you about my dentist H Radcliffe brown junior he's at Fifteen oh one university boulevard in mobile I picked a thread click around you and your because when I moved back to mobile a couple of years ago friends of mine recommended it to me I had a crack at the time I needed a crown\nAnd he was able to use state of the art new equipment to make me a crown while I waited it was a same day crown\nNo temporary crown and it was an amazing perfect fit and since then I've been doing a great clip brown junior for cleaning and in regular checkups Dr brown has a family friendly practice he offers a wide range of services including cleaning Z whitening cosmetic bonding bunny ears\nBridges dentures parcels he restores implants if you're a new patient you can get a new patient appointment within just a few days\nRemember the name it's H. Radcliffe brown junior you can call him a two five one two three four two fifty six thirty six look for a trade cliff brown junior dentist on Facebook grand\n[noise] now doubled un GM Gulf Coast weather from NBC fifty hello and Happy Friday I'm Jake done from NBC pain it's going to be a gorgeous day along the Gulf Coast\nSunshine in a high of Seventy nine which is technically below normal\nSomething we haven't done in a very long time we're in the sixties this evening for friday night football games ... by Saturday morning sunshine in eighty one on Saturday eighty seven on Sunday I'm Jake done for this I heart radio station\nFrom the honestly or plumbing and dream studios clearly don't mess Joyce this is news radio seven ten WINZ\nNews I'm Chris foster plans for a temporary morgue are being called off in Florida for now with search and rescue teams not finding mass casualties in their search through areas hit by hurricane Michael at least eleven people were killed from Florida to Virginia and about one point three million homes and businesses are still without power it may be that way for weeks in some parts of the Florida Panhandle\nEither going to be different for folks if for so long and they were grocery store maybe got\nJeff Rogers with Gulf Power there may be prove a Saudi Arabian journalist was murdered by a Saudi security team and assembled turkey\nThe Washington Post to pay to Saudi Arabia in general is Jamal ... she writes full reporting that American officials say they've been told by the Turkish government the dairies audio and video evidence to back up the claim ... was killed inside the ... boxes Simon oh and that\nJournalists was critical of the Saudi Arabian government which denies that\nWe have one day in terms of exposing\nSean Hannity all of the deep state all of their corruption W when the em [noise]\nMan on the books being is all over the place here is a piece in Politico today Amish by John Harris ... John Harris is one of the founders of political used to be the Washington Post\nMe and so these are you know these are not chump change obscure wacko ... well they may be that but I mean they're not they're widely no they're they're highly respected right in the mainstream of left wing activist journalists\nAnd the headlines of this story Trump may not be crazy but the rest of us are getting their fast\nI\nI I don't know where to start with this I mean even the the first the first line here CNN before lovemaking is not his idea of a turn on\nShe can hardly turn it off in roast as she is in the latest unnerving gyrations of Washington so obviously these are psychologist stories psychologist couches are filling up as American seek relief from Trump anxiety disorder ...\nI I don't believe this for a minute I think this may be the case in Washington it certainly will be the case the Upper West side and probably in a lot of Hollywood but nationwide people are not seeing shrinks to deal with Trump anxiety disorder but yet this guy these two people think well all of America is if it's happening in Washington\nNew York and it's happening everywhere\n\nSo a psychologist tail here CNN before lovemaking not his idea of a turn on but his wife she can't turn CNN off\nSo engrossed in the latest unnerving gyrations of Washington who else to blame for this but Donald Trump\nA president who excites hot feelings in many quarters has cooled them considerably in the bed rule ... above Philadelphia ... so you got people who are going to psychiatry is now blaming Trump for the fact that they both gone frigid\n\nBlaming Trump for the fact that they have lost interest in sex lovemaking quite as however you refer to it so there's still do if you're a couple of sought counseling\nIn part because the agitated state of American politics was causing strain in their marriage\nThe couple story was related to political by their therapist on condition of anonymity\nBut they're travails according to national surveys in interviews with mental health professionals\nAre not as an anomalous as one might suppose though no even when symptoms are not sexual in nature and there is a bum didn't evidence that Trump and his daily upper ours are galloping into the inner life of American I'm telling you these people are bunkers\nNow we've known this on the fringes you know John Kerry would lose the election and down here in South Florida a enterprising psychologists was open temporary offices\nAre advertising if you're if you're suffering from Bush arrangement syndrome please come see us after John Kerry lost in two thousand form and this kind of stuff\nHas been you know since Florida to a thousand it's been somewhat common here but it's it's reaching new heights new bows\nEmpirical data bolsters the anecdotal reports from practitioners the American Psychiatric Association and I'm a survey\nFound it thirty nine percent of people said their anxiety level have risen over the previous year fifty six percent were either extremely anxious or somewhat anxious about the impact of politics on daily life uh twenty Seventeen study found that two thirds of Americans see the nation's future\nAs a very or somewhat significant source\nOf stress\nOr more plausible interpretation for all of this in the view of some psychological experts is that Trump\nHas been cultivating adapting and prospering from his distinctive brand of provocation brinksmanship and self drama for the past Seventy two years what we're seeing is merely the president's own definition of normal\nIt's only the audience who finds their performance disorienting\nAnd what words Trump's not crazy but the rest of us are getting their of fast and people are going to psychiatry and paying money to be told this we tone Trump is driving them crazy\nHe literally is causing and they'll lose their sanity you thought I'd been joking or to exaggerating about this and I'm not we're dealing with people\nWho are genuinely on here\nThey haven't gotten over the fact that Trump won they can't get over the fact that they're people can't get rid of the Trump the intelligence agencies the FBI that the OJ the deep state powerful people in Washington the Democrat Party\nOver liable as like Dianne Feinstein Chuck Schumer can't lay a glove on Trump and there beside themselves getting rid of Republicans has never been as hard\n[noise]\nTrump signed legislation to clean up millions of tons of garbage from the world's oceans Obama didn't do as\nPresident Donald Trump added his signature just to save our sees act on Thursday green lighting and initiative to clean up eight million tons of day Bree from the planets oceans\n\nSponsored by Alaska Republican senator Dan Sullivan the bill aims to promote better domestic at millennials are going to go nuts over\nAnd that's why to his favorite to lead them do it all [laughter]\nChampionship we will rebates super say on purchases you buy now that's for me that means you get your money back my money\nIs that something your list this would be interested in getting their money back is there anyone out there listening who would have a problem getting their money back everybody about at least twenty five hundred dollars in furniture and qualifies participates can get for the rebate for aren't you they are right\nNow you better get down here during the super sale and rebate before we reach our remake participated\nHundreds of thousands of dollars up front as your heart in\nLodi heart radio and get use radio said WN GM pong do go [noise]\n\n\n\nBy the way it folks I I've got two more stories that focus on the insanity of the left I mean and I'm not using the term loosely here's another\nOne Susan Glasser staff writer at the New Yorker she writes a weekly column on life in Trump's\nWashington she writes a weekly column on life in Washington in Trump's what what life in Washington has become because the Trump once a week\nThis piece the headline I listen to all six Trump rallies in October\nAnd you should to some had it's not a reality show it's real it's a long piece but do not misunderstand\nThis lady Susan B. Glasser list and didn't watched six Trump rallies\nAnd she is up set that they're only on CSPAN she's mad that Fox has stopped covering them that CNN is stop covering them that pie MSNBC or stop covering them because she thinks\nThey are damaging to Trump She thinks\nThe people of this country saw these rallies that it would be the end of Trump She points out how Trump lies all the time\nHow Trump exaggerates all the time\nShe totally miss understands the purpose of the rally she does not exactly yes I predict that she does not get the connection or the bond between Trump attendees after rallies Trump supporters and Trump\nShe totally does not get this\nShe does not know how to listen to the Trump She does not know how to uh empathize with Trump rally attendees she has no\nAbility\nTo relate to Trump has his supporters do she watches these things and she is appalled at Trump personally politically he lives all the time he ... he mocks people he makes fun of people ...\nMeanwhile people at these rallies or having the best time of their lives it's the highlight of their week to go to a Trump rally and this woman is ... she's watching six of them so far this month\nAnd totally does not get it she is missing the purpose of the rallies she does not see\nThat this is Trump's mechanism for getting past the media she does not see that this is how Trump\nNegates and goes over the drive by me something Reagan also master\n\nTheir masterful they are formulaic even though everybody thinks they're improv and off script they are formulaic there are segments in every Trump rally and he follows them to achieve\nWhat he says differs in some cases but the point is here's a drive by media specialist ... and totally doesn't get it\nIt's the exact opposite\nIf these rallies were televised nationally\nAs they used to be\nThere wouldn't be any talk of a blue wave anywhere except in New York and\nCalifornia Rush Limbaugh could use the\nWord favored\nMorning\nMy friends like you I Am thankful every day for the brave men and women to protect our freedom and our country now is Veterans Day approaches I Want to announce that my friends at Mahendra are holding their fifth annual military salute give away\nThe winner will receive a hindrance retriever utility vehicles that threat a brand new read my Hendra retriever one thousand gas model\nLast year's winner army captain Robert forty of Ohio is loving here's my handwritten you could be next\nTo nominate somebody who is active duty or a veteran of the U.S military and to get official rules\nVisit Rush Limbaugh dot com and look for them a hindrance military so little give away\nThanks to my hindered the makers of the toughest utility vehicles on earth and God Bless all of you who protect our freedom\nTake advantage of rock bottom prices and test drive him a hindrance today at J and J tractor ... or call to five one six seven nine eight six seven seven that's to find one six seven nine eight six seven seven\nWords well what's new today on the free her radio a radio\nA perfect for decorating the house or just studying the dairy mood\nPumpkins ... with the labor is why we\nEveryone's talking about like the people were bowlers bobcat Joe Rogan experience all your music all your favorite\nBy the time since he was telling your smarts stay up to date information you\nTo news radio seven WN one eye on radio [noise]\nKinda proud of myself bullshit [noise]\nTwo hours here and not a word Kanye West [noise]\nI guess everybody else has been\nSo we're going to get into what got some great soundbite coming up I think we're we're going to skip it [noise]\nAnd there'll be a tough by friends we will be back before you know [noise]\nBottom of the hour breaking news had one news radio seven ten WINZ out mobiles and I urge radio the Ninety nine point nine W ... three mobile\nPlus a faceless hackers got on the ... the company just releasing more information about the security breach first disclosed two weeks ago actually is Christian Goodwin has more life\n... [noise] but she put it up and of course the media ran with it and they've had to withdraw it because she had to withdraw because it wasn't true\nAnd it\nIt's fairly common that these people on the left engage in this kind of storytelling insult mongering here it is John ... never Trump ...\nThe Democrats blue wave is drying up oh if that will be a disappointment\nDon't ... elections before they're hatch that's the lesson of the past couple of weeks or so called fundamentals that supposedly govern the twenty Eighteen mid terms\nStill point to a good a great night for Democrats there the out party the out party generally does better than the party in power\nBut\nTo generic polling question this week have Democrats up twelve and Thirteen points respectively that would suggest a so called blue wave in which most house and Senate seats in play will likely tilt Democrat and it's in line with attorney general Republican numbers around now\nYet yet we pointed out\nThat all of these national generic polls show this gigantic way but if you go race by race\nIf you go into the state's district by district you don't see this way you don't see the evidence in the polling\nAnd people have been asked well how can this this disparity be how can you have a generic ballot that shows that Democrats plus proper plus Thirteen but then you don't find any single congressional race that shows Democrats plus twelve or Thirteen well it must be in the generic ballot doesn't mean much ...\nHow could a generic ballot the lemon name on it by this time when you start pulling people a month three weeks away from the election you start asking questions about how they're going to vote\nWithout a name\nAnd the question what do you think could result is going to be\nState level polls over the past two weeks showed no blue wave certainly not in the Senate\n\nThey suggested Democrats appear to have almost no serious chance of winning the ... in the Senate that would require them to pick up three Republican seats and the whole every\nOther seat that the ...\n\nThey held by incumbents at at this moment it's far more likely Republicans are going to pick up one of their seats\nSo [noise]\nIt's and it goes state by state to show her and this is all happening and then the evidence against a blue wave is primarily in the Senate\nBut\nThe conventional wisdom here is not rooted in specifics but conventional wisdom is rooted in just that conventional wisdom and hope\nThe left hopes that this is a traditional here party out of power wins big that's what they're hoping they've got their generic ballot polls would say that's exactly what's going to happen then you're going to the states state by state race by race and you don't see it see why to close races some that could go either way\n\nBut they're still hanging on to hope they are reporting the hope they're reporting hoping hoping that reporting the hope will turn the hope into reality\nNow before we get too much in the hour I Need to tell you a little bit about a movie that is a opening tonight it probably has opened in some cities all reading of certain theatres it's God's Nell\nThe trial of America's biggest serial killer\nNow ... an abortion is the Martian doctor who got away with the ... murders in Philadelphia and got away with the wanting to murder\nOf thousands\nNobody can get the media interested in the story even after he was charged and convicted and put on trial and the reason is that correct guys now\nWhat's the worst thing that ever happened to people who want to keep abortion thought of and\nCategorized as something other than what it is the media wouldn't cover it and nor the trials very much\nThere have been a lot of people who didn't covered Michele market was one of the leaders also people at the like and Marcy on hot air was was hot on the trail of guys and I think they wrote over a hundred and sixty\nDifferent articles so the trick has been how do you do a movie about this\nHow do you get it made me in a movie equals Hollywood how do you get stars had to get people to start at how do you get money to finance it how do you get it may be and how do you get a distributed it how do you find the theaters\nThat will exhibits that thing how do you do or and they they ran into every predictable problem that you can imagine but they ... and they got it done\nAnd the way they got this ... this is a movie about the trial of ... guys now it's it's it's a it's a\nProcedural moving like a procedural crop cop show crime in a cop show on TV meaning it follows a formula it doesn't get overtly political it doesn't it doesn't want to limit the audience by getting political even with a trial this movie\nHas a rating a PG Thirteen and it's about wanting abortion murder there is not a lot of\nHardly any abhorrent Gore and violence\nIn the movie at its depicted in a in other ways it's not meant to shock it's meant to entertain and educate it's an attempt to you is a movie\nIn a responsible way to do things in movies are supposed to do entertain entertain entertain enlighten maybe inform it's not the political movie that the left would make\nAbout a story like this it can't avoid the politics but it is exceptionally well done for the subject matter you're you're not going to be if you go see it you're not going to be watching people advocating for a cause\nYou're not going to see a movie designed to separate you from your money in terms of political fundraising you're gonna see Hollywood professionals who happen to be pro life producing a movie about something that really happened\nA mass murder he was a mass murderer of people\nIn the room that nobody on the left one at anybody to know about\nWhat he did ... guys now was despicable but he was a charming guy even engaging smile and laugh and even and this trial it was said that he was charming people now are oh buddy Nick Searcy\nDirected this and I don't know anything about directing movies\nBut I can imagine some of the challenges in in a movie like this you don't want to preach and you don't want to make your movie of target but you want to be truthful about it and you want\nThe message\nTo be delivered but you don't want to turn people off you don't want people to think that you're being they're they're they're being preached or any of that\nAnd so the way I looked\nAt it I didn't I didn't see Nick Searcy use a bunch of special effects or other things to distract you just let the story tell itself and it's basically the trial there some set up\nThe story itself is all anybody needs to know the number one mass murder in America which he was never referred to as as because of course the\nLeft abortion is not even human it's a viable tissue mass or what have you uh it's got\nStars people that you know people put their careers on the line to star in this movie the odds are that they're going to have trouble getting cast and other movies having been identified with this dean Cain is one\nOf the ah the actor who plays a guy's now himself as a as an actor and I think ... commercials name as Earl Billings and for somebody\nThat's only widely known as an actor in TV commercial this guy does one heck\nOf a job it's probably the finest\nRole that he's played for the best performance that he's had a I Would guess a as an actor\nBut I just want to let you know that if it if you're thinking about going to states PG Thirteen we're not talking ... we're not we're not even talking ours here so\nI'm gonna be immersed in a bunch of repulsive\nGore and again it's it's thought that they don't need to do that tell this story the story itself tells itself\nThe trial of America's biggest serial killer there are a lot of people who have\nPut everything in their careers on the line to get the movie made they got it made a lot of people to put their careers and the line agreeing to appear and star even Searcy a directing\n[noise] hold\nOne hand underpaid um how long were you know what\nWe're going to change that with\nOne thousand dollars I wouldn't want thousand dollars every hour\nRadio seven ten WINZ ...\nHours before your guests dean and when I feel I mean\nYou could make it rain in front of your least favorite co workers driven by mobile bay Harley Davidson where they need your used totally demand is high\nAnd find daily and paying top dollar check out they're friendly team at the Gulf Coast high volume dealership on Facebook there's always a party and ... are like\nListen weekdays five AM to nine pm for your shot one thousand dollars news radio seven ten WN GM\nMany of us have been thinking of our friends and neighbors down the coast those impacted by hurricane Michael either I Mason for bachelor service heating and air we all know that with a big storm the power can go out for several days but even if the power goes out for several hours as it did in our neighborhood tropical storm Gordon just a little while back\nThat could be a problem if you need to keep the power on metro bachelor service can help they have generators in stock and can service your existing generator learn more at bachelor service dot com\n[noise] now WN GM Gulf Coast weather from NBC Fifteen hello and Happy Friday I'm Jake done from NBC this pain it's going to be a gorgeous day along the Gulf Coast sunshine\nAnd our high of Seventy nine which is technically below normal\nSomething we haven't done in a very long time we're in the sixties this evening for friday night football games ... by Saturday morning sunshine and anyone on Saturday eighty seven on Sunday I'm Jake done for this I heart radio station\nAll we're plumbing and brain studios calls having to five oh wait wait news radio seven ten W. N. T. M.\nI'm rich Dennison American pastor Andrew Brunson held by Turkish officials for two years on espionage charges has been freed from custody his sister Laura reacting to today's news or joint light\nRail officials in Turkey so us pressure had nothing to do with pastor Brunson was release search and rescue operations continue as officials assess the damage from hurricane Michael ... administrator Brock Long\nWe hope to have a hundred percent of the initial search and rescue operation down in Florida I'm you know today as as as well as Georgia\nThe storm would slam parts of Florida Georgia Virginia and the Carolinas was blamed for at least Thirteen deaths police are investigating the shooting death of Michigan State university student from Texas officials say in East Lansing the twenty two year old was shot this morning during a fight at an off campus apartment complex [noise]\nGulf Coast warnings from five to nine every weekday use radio seven ten doubled un GM\n[noise] [noise] again those satisfaction of stone Nineteen sixty five months before we get back to the phones one quick\nThing there's a an NBC opinion piece that uh has appeared in opposition to the gods no movie\nAnd here's the headline with his face legal abortion is vilified by the pro life cause no movie which inadvertently shows the dystopia\nOf a post row America\nSo whereas we have a bunch of journalists trying to blame Donald Trump\nFor inspiring\nMohammed been so long to murder a sort of a Saudi journalist\nNow we have this NBC piece which is basically saying\nThat what this movie is inadvertently showing is what will happen if abortion ever becomes illegal guys like God's noble springing up everywhere that guys now\nCould not have become the mass murderer he became\n\nIf abortion would have been a legal\nWhich is a crock he did his monitoring after abortion and become legal but they're trying to say everybody you know you better you better not get what you wish for here because if you ever if you ever get abortion we have a roe versus Wade overturned you're going to have people like guys know popping up left and right\nWhich misses the entire point of this movie but that's not a surprise at opponents would try to miss Kass what's wrong with this tweet\nSaying that the crown prince may have felt in Bolden by Trump's anti media rhetoric to murder a journalist [noise] yeah that happens in this country right we have a history of murdering journalist\nDonald Trump got that was the first one was the first hurdle is Trump a quarter to be killed Kevin tell me [noise] he's ear risk well jackass is okay head back to the phones to Jim in Jupiter, Florida right up the road great to have you with us or Hi\nHey thanks rush rush I'd the down in Miami last week but I mean I worked I pass by what is to be the ground breaking up the largest mall in the United states\nAnd it got me to thinking I said to myself this is off plus the underwater two years ago it was all supposed to be a new or all of Miami a it was based on a two thousand and seven Nobel Prize winning award winner Albert Gore predicted it full of Miami demand may global warming\nIs a rising sea level twenty feet which would be underwater and I just got to thinking well you know he's not good at predicting the future maybe you can explain the past or someone please explain how about twenty thousand years away you know\nThis is really a great point and you're you're you're making a really great point here and and because it you're right on the money out Gore had said\nJust in general that current shorelines and he has he has mentioned Miami in South Florida in Manhattan he has predicted when they are going to succumb to rising sea levels will be underwater and he did say\nMiami\nThat it was only a few short years at Miami certain parts of it would be inundated by rising sea levels and one of the places where he said so they are breaking ground on one of the biggest malls in the country you have to ask yourself\nWho in their right mind would go out and get the financing and make all of the decisions that\nHire all the architect everything else has to be done to build a new gigantic mall only to realize it's going to be submerged underwater in a few years\nWho would do this what kind of responsible planning commission would permitted what kind of developer would waste is money the point is nobody really believes that word is mall is being built is going to be inundated by rising sea levels anytime soon\nThere's a there's another analogy that this ... Gulf Stream which is\nA manufacturer of one of the largest most popular corporate aircraft in America the gulfstream series there's the G. five fifty ... about forty five ... four ... four fifty\nOr when they announced they were going to build the G six fifty the G six fifty as a like a foot wider and a little bit taller a has a massive range days of the arts interior\nAnd they announced this at a time where the media was telling us that we were\nOn the verge of running out of fossil fuels and that the supply of fossil fuels was finite\nAnd we were gonna have to do something real fast because we're losing votes will be up to start serving and fossil fuels it's a good thing anyway because they caused climate change and so forth and I asked myself why would Gulf Stream I happen to know the c._e._o. at the time\n\nI said why are you guys doing this if you how you got to power this Jeff how are you ... if there isn't going to be any terrorist scene refined which is jet fuel job if you're not going to have enough jet fuel for anybody who buys this plane to fly it why are you going to make it\nSo well what you're hearing isn't true", "show_name": "The Rush Limbaugh Show", "year": "2018", "city": "Mobile", "day": "12"}