{"month": "10", "state": "NY", "station": "WAMC", "content": "Straightening support for WAMC comes from my dog harness dot com and no ... no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog would love thousands of reviews at my dog hunt S. dot com\nTobar twenty six and a P. M. and midnight for tickets and information\nVisit the Linda dot org\nThis is Northeast Public radio W. A. M. C. F. M. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety points reruns in Utica W. M. K. E. H. D. nine point nine Kingston W. O. S. R. H. D. in any one point seven Middletown to UCLA each dean Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine tai chi ...\nW am cue HD one oh five one great Barrington W. W. E. S. H. D. eighty point nine mount Kisco W. N. D. H. D. in any point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany [noise]\nWe're back for another late night of jazz on public radio this is jazz after hours from public radio international the freshest new jazz on the radio every Friday and Saturday Night\nI'm very happy that you're with me tonight as always the music on jazz after hours reflects the courage jazz scene including performance information for the artist you'll hear on the show as you might expect for musicians with a new record these hardworking folks are very busy performing I'll have lots of details coming up during the show\nToday would have been dizzy Gillespie is one hundred first birthday and as you might expect there's a party going on specifically at jazz at Lincoln Center and you're invited\nCarlos and Rick is is the jazz at Lincoln Center orchestras bassist and tonight what would have been dizzy Gillespie birthday Carlos and ... pays tribute to the trumpet master and celebrates the release of his own new album listen to this line up\n... Michael Rodriguez and Brian Lynch trombone is Vincent gardener tenor saxophonist Melissa al Donna pianist men mobile era drummer Luke ... and ... and vocalist Anthony a Monday it's going to be a great show you can watch it streaming live from jazz at Lincoln Center\nBut remember since Early Show seven thirty start time in New York city so you do the math to figure out for your time zone but I Would encourage you to watch this show from Carlos Enriquez and the good folks at jazz at Lincoln Center\nWe get started on this edition of jazz after hours with a new work called the seasons actually it's been cooking for a really long time it's a project of saxophonist bend when del\nHe's been working on the seasons based on the concept established by Tchaikovsky almost a hundred and forty years ago\n... wrote a solo piano piece for every month of the year called the seasons and now saxophone has been window has taken this famous body of work and reinterpreted each piece bend when does the seasons has just been released for the first time on CD and I want to start off the show with October\nBecause it is there's this new music from ... to start off jazz after hours [noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\n\nAnd\nThen and then she'd been\nMen\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com [noise]\n\n\n\nAnd and\n\n\nAnd\n\n\n...\n\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope poll dog hoarding it did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nOf the\nThe days\nStreaming support for WAMC comes from my dog hardest dot com I don't choke no poll dog hard is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n[noise]\n\n[noise]\n\nI guess you could take\nAnything for the girl I built my\nTo say then it was just really didn't\nThey get\n\nKnow you're so they'll be\nSo full\nOf you who was in\nThe sun goes down they\nThat you would call though roads leading these\nGames will be new branches called leaning\n\nBe here you know do you\nSee a game so\nNo longer he he you know\nMuch they can\nAnd they need to really\nNeed\nGo\nDo you think\nDo you think you can continue to be in the\nStreaming support for WAMC comes from my dog hardest dot com I no joke no pope dog hard is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nThat particular work nights song is based on poetry by Leonard Cohen embassy on you\nHeard Scott Callie on base in Chico pin euro on guitar with lets you on a soldier\nIn late October from the twenty fourth through the twenty fifth street doing a teaching residency at UCLA bent on November night she's performing and be celebrities series she's doing the book of longing at Berkeley performance center in Boston\nAnd Dave Anderson began the set with the track from his immigrants sweet that was ... part of the three parts immigrants week from melting pot\n... play saxophone there you heard Colombian American drummer ... Acevedo Venezuelan American percussionist Rebecca ... a couple of tablet or just on the record Aaron Hanson and deep sing sitar player named ... ...\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hard is it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nOn tape Anderson's melting pot album and that's appropriate friday November second you can catch Dave Anderson performing with me and my estimate is Manhattan bridges orchestra and that's happening of course it may not\nBe McCann is up next year guitarist has just released his sixth album the records called pay for it on the other side which is a reference to the toll McCann has to pay every day on his way to work after he crosses the bridge\nThis tune is a memory painting of peach native Wisconsin It's called yonder grew up in Wisconsin fishing hunting hiking and that's what this piece of music is all about apple saxophonist John Doe Gallagher pianist Henry Hey basis met close the drummer marked for her with guitarist Pete my cat jazz after hours Mm\n\nMm\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who do Curtis is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who do Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nOh geeze\nBusiness Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you an HD Ninety point three ramps and you can WHM cage dean Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a NHCD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nights high kind of rogue WAMC ... five\nOne great Barrington W W E S H da da da da and ... Ninety point one Stanford W a in our eighty five Bruce during WAMC am fourteen hundred Albany [noise]\n\n[noise]\n\n\nContinuing our weekly exploration of new jazz on public radio international this is jazz after hours on the ... this hour of the show I've got a great record from singer Alexis coal some tango music from a Norwegian pianist name ...\nWe've got the McGuire Twins who are just about to kick off with an extensive tour through Japan tenor saxophonist Doug Web was a big big coming up in Los Angeles on Monday Night and we begin with Seattle pianist Randy helpers that\nLong long time performer in the Seattle area jazz educator\nHis new record is called open heart and it features some Seattle's finest players like Chuck ... base Adam Kessler on drums Jake Thomas scramble sex on this track mark Taylor on Alto David Marriott junior trombone this is new from Randy ... open heart album jazz after hours\nTo\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope poll dog hard it is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love that is the reviews at my dog Curtis dot com\nStreaming support for WAMC comes from my dog hardest dot com or no joke no poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\nGuitarist John Schofield has a new band celebrating his sixty six birthday who's new band is called combo sixty six and that too and we heard was dedicated to steal much it's called king of Belgium\nJohn Schofield on guitar drummer bill Stewart bassist Sandy archer and on the keyboards Gerald Clayton tonight you can find John Schofield performing in downtown San Francisco at S. F. jazz\nAt longtime Seattle pianist Randy how ... dad did the Gershwin tune the man I Love on his new album open heart\nYou've been around for very long time in Seattle playing music teaching music and performing music with the Seattle repertory jazz orchestra he'll be on stage with that band on Saturday November third Sunday November report that the been a royal concert hall they're playing the music of Maria Schneider\nThe tremendously influential big band or an Evans the captain black big band is up next year playing\nA tune by the band struck a player Josh Lawrence called presidents it starts off our next set of music here on public radio international you tuned into jazz after hours [noise]\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who do Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nStreaming support for WAMC comes from my dog hardest dot com I don't know who do her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk what your dog would love that is the reviews at my dog Curtis dot com\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk to walk your dog with love thousands of reviews at my dog Curtis dot com\n\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog would love that ... at my dog current S. dot com that\nKnow\nThat\nNot the same\n\nNa na\nNa\n\nWhen you put a voice like that\nOut front of an all star sex tap like one for all you get a tremendous record it's called you'd be so nice to go home to I'm sure it's going to make my list of favorite albums of the year\nYou've changed with Alex's coal and one for all Eric Alexander tenor saxophone ... trumpet\nThe trombone us with Steve Davis the pianist David hateful time John Webber played bass and Joe Farnsworth was the drummer earlier tonight Alexis ... played the Westchester collaborative theater in Austin in New York it's kind of a hometown chauffeur Alexis\nNorwegian piano ... did ...\nHe loves tango we just released in all tango album called two hands to tango and we heard nor tape there ever more evidence and the captain black big band that was presidents Josh Lawrence wrote it for his bandmates ... short also went out the sex trade Roberts on tenor\nJohn ... trumpet\nBrand Davis also playing trumpet there David Gibson on trombone staffer hunter on trombone Brent White also when trombone Madison ... and we're Marshall and Jason Brown playing drums on presents the new release from the captain black big that\nAnother big band up next year I kind of like this large ensemble stuff especially this time of night it sounds good to me\nFrom the one undress spina big bad this has to be a no originally written by one undress for a small band back in two thousand nine for his recording debut B. B. B. which stands for Barcelona Bogota Boston\nIt's been recorded and re issued on the new record ... Montana rearranged here for ... Rivera soprano saxophone and one on drifts spina steps down from the podium to sit down at the piano to play on this one taught to be you know it's new from that one Andreas spina big bear [noise]\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who do Curtis is that just to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who do Curtis is that just to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\nBang\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\nThis is Northeast Public radio WAMC yet that makes the Ninety point three Albany W. R. H. D. Ninety point three reps in Utica W am cage the Ninety point not kicked in the west are Eighteen Ninety One point seven Middletown UCLA key Ninety One point I Plattsburgh but you see a any she Ninety three point three candidate Harry W. A. N. C. H. E. won a three point not that kind of rogue WAMC ... even a five\nPoint one great bearing ... W W E S H e idiot point nine mount Kisco WAMC HD Ninety point when Stanford W ANR eighty eight point by Brewster WAMC I Am fourteen hundred\nAll the show was called jazz after hours my name is Jeff handily spent the whole week listening to new music and I picked up some for you this hour I think you're going to like I've got to South Florida jazz orchestra Scott rotten Berkes trio\nBassist Matt Penman and we begin with any Henderson released a terrific album a couple of months ago called the cool\nDropping player is joined by Donald Harrison on Alto saxophone piano Kenny bury the bassist is S. E. S. yeah that might Clark is the drummer with Eddie Henderson here on a fund version of easy living to start up this hour partially\n[noise]\n\n[noise]\n[noise] um\n\n\nStreaming support for WAMC comes from my dog ... dot com I choke no pope dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nUm\n\n\n\n\nMm Mm\n\n\n\n\nMm\n\n\nMm\nMm Mm Mm\nMm\n[noise]\nMm [noise]\n\n\n\n\n\nMm\n\n\n\n\n[noise]\n\n\nMm\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hardest invented to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com [noise]\n\n\n\nMm\n\n\n\n\nMm Mm\nMm Mm Mm\n\nMm\n\nMm\n\n\n\n\n\n\n\nMm\nMm Mm\nMm mhm\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\n\n\n\nDay\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who do Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com [noise]\n\n...\n\nNa na na na\nThey\nTo\nBack\n\n\n\nNow\n...\nNa\nNa na na\nNa\n\nNa\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com [noise]\n\n\n\nNo no no\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com oh\n\n\nThe great trombone is Jay Jay Johnson wrote that too it's called Carolyn in the morning and it was performed by Steve ... and his band on the most recent Steve album called the very thought of you get a skinny Baron basis buster Williams syndrome or W J three\nReal sweet touch their on Carolyn in the morning new from Steve ...\nAn all star group called the south Florida jazz orchestra did monks round midnight that comes from the music of Gary Lindsey are we still dreaming album celebrating the arranging of Gary Lindsey\nThat arrangement came from Gary career going way back to Nineteen Seventy eight and that performance around midnight featured saxophone pie at ...\nAnd the ... jazz ensemble began the set with autumn left you'll find that one on connect the dots terrific jazz record number of jazz on the\nNew record from Justin Coughlin coming home was produced by Quincy Jones and Derrick Hodge it features Chris Smith on base ... drums and Allen park or a guitar with pianist Justin Coughlin will use this to last to get us right back into the music jazz after hours\nMm\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll dog harden it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that is the reviews at my dog Curtis dot com\n[noise]\n\n[noise]\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll yogurt is it that just to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com\nKnow\nThat a\nNames that men\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n[noise] [noise]\nKeeping your late night full of music on public radio international this is jazz after hours for PR every weekend night we're here to play new jazz for you my name is Jeff handily I've got a lot of music to fit into this hour so I'm just going to jump right into it\nYellow jackets I've had a very successful run with this new record raising our voice\nRussell for us to use the keyboard is Bob Mr Sachs William Kennedy on drums and being older son on base there's even some vocal work by let's see on a cell\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog hornets it that just to make walked easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com and then\nSomething\nYou know\nThen\n\n\n\n[noise]\nStreaming support for WAMC comes from my dog's heart is dot com and no joke nope poll dog hornets invented to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to walk your dog with love thousands of reviews at my dog Curtis dot com\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\nStreaming support for WAMC comes from my dog hardest dot com I choke nope poll dog hard is it that do to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to walk your dog would love that is that reviews at my dog Curtis dot com [noise]\n\n[noise]\n[noise] [noise]\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\n[laughter]\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love dozens of reviews at my dog Curtis dot com\n[noise]\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that is the reviews at my dog Curtis dot com oh\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\nHenry counterweight to third which slippery when she got that set of music here I'll be All right with pride for dignity is the name of the new Henry Connor way album getting banks junior was the piano Kevin Smith on base and the bandleader and recount outweighed the third\n... jazz orchestra did BJ student that comes from down a rabbit hole John Jones wrote it and he sold out there on trumpet BJ June\nThere is a very important performance by the I'm In a jazz orchestra coming up with the lily pad in Cambridge on the twelfth of November and there special guests soloist will be friend of jazz after hours John ...\nSomething to look forward to if you're in the Cambridge area and the ... masters ensemble did fifty one west fifty first street on the album our ... here's the band Scott angle bright\nPA here's the band Scott angle bright and less love it on trumpet Stephanie ... the French horn player less Benedict and Ryan dragging played trombone Jerry pitcher Christian at ... and Bob car would wince\nAt chalk on piano great when do you go on vibes and as I mentioned back at the top ... Andrew Ciro sits in along with Bob car an enemy all on fifty one west fifty first street\nWell thanks a lot for staying up so late with me it'd be awfully lonely here without you my name's Jeff handling I've got a little ways to go here toward the end of the show I thought it'd be kinda fun to play our hero Hara his performance is a nod to Akira Kurosawa and a reference to the movie rush 'em on it's called points of view\nIt's new for our hero heart jazz after hours the records called some rebel\n[noise]\n\n\n\n\nStreaming support for WAMC comes from my job hardest dot com I no joke nope poll dog hornets invented to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk to walk your dog would love that is the reviews at my dog Curtis dot com\n\n[laughter]\n\n\n\nMm\n[noise]\n... ...\n\n...\n\n...\nStreaming support for WAMC comes from my dog hardest dot com or no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nStraightening support for WAMC comes from my dog harness dot com and no ... no poll dog harness in that did to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog would love that ... at my dog current S. dot com AMC am fourteen hundred Albany\n[noise] [noise]\n[noise]\nWe're back for another late night of gas on public radio this is jazz after hours from public radio international the freshest new jazz on the radio every Friday and Saturday Night\nI'm very happy that you're with me tonight as always the music on jazz after hours reflects the courage jazz scene including performance information for the artist you'll hear on the show as you might expect for musicians with a new record these hardworking folks are very busy performing I'll have lots of details coming up during the show\nToday would have been dizzy Gillespie is one hundred first birthday and as you might expect there's a party going on specifically a jazz at Lincoln Center and you're invited\nCarlos ... is is the jazz at Lincoln Center orchestras bassist and tonight or what would have been dizzy Gillespie birthday Carlos Rodriguez pays tribute to the trumpet master and celebrates the release of its own new album listen to this line up\n... Michael Rodriguez and Brian Lynch trombone is Vincent gardener tenor saxophonist Melissa al Donna pianist men global era drummer Luke ... and ... vocalist Anthony a Monday it's going to be a great show you can watch it streaming live from jazz at Lincoln Center\nBut remember since Early Show seven thirty start time in New York city so you do the math to figure out for your time zone but I Would encourage you to watch this show from\nCarlos Enriquez and the good folks at jazz at Lincoln Center\nWe get started on this edition of jazz after hours with a new work called the seasons actually it's been cooking for a really long time it's a project of saxophonist bend when del\nHe's been working on the seasons based on the concept established by Tchaikovsky almost a hundred and forty years ago\n... wrote a solo piano piece for every month of the year called the seasons and now saxophone has been went Dell has taken this famous body of work and reinterpreted each piece been when the seasons has just been released for the first time on CD and I want to start off the show with October\nBecause it is there's this new music from ... to start off jazz after hours [noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\n\nI can\nAnd then and then she'd been\nMen\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com\n\n\n\n\nCommon and\n\n\nAnd\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope poll dog hoarding it did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nMm Mm Mm\nStreaming support for WAMC comes from my dog hardest dot com or don't choke no poll dog hard is it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n[laughter]\n[noise] [noise]\n[laughter]\nThe\nI built my\nSame way because then it will eventually we're\nAgain they\nYou know your songs on\nThe phone\nWhen you think things will be before\nThe sun goes down they\nThat you would call me do read the piece in\nThe game will be nice branches hardly\nAny\nGood to be here you know do you\nSee again so\nNo longer he he you know\nMuch they\nAnything [noise]\n\n[noise]\n[noise]\nDo\nCan do to go in\nAnd it will be looking at the moment\nIt is now that you would call\nStreaming support for WAMC comes from my dog hardest dot com I no joke no pope dog hard is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nThat particular work nights song is based on poetry by Leonard Cohen embassy on you heard Scott Callie on base in Chico pin euro on guitar with Lucy on a soda\nIn late October from the twenty fourth through the twenty fifth she's doing a teaching residency at UCLA and been on November night she's performing and the celebrity series she's doing the book of longing at Berkeley performance center in Boston\nAnd Dave Anderson began the set with the track from his immigrants sweet that was ... part of the three parts immigrants week from melting pot\n... play saxophone there you've heard Colombian American drummer ... Acevedo Venezuelan American percussionist Rebecca ... a couple of tablet artist on the record Aaron Hanson and deep sing a sitar player named ...\nAustrian American bassist ... Canadian pianist David ...\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hard is it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nDave Anderson performing with ... Manhattan bridges orchestra and that's happening of course it meant that\nPeople can is up next year guitarist has just released his sixth album the records called pay for it on the other side which is a reference to the toll McCann has to pay every day on his way to work after he crosses the bridge\nThe tunas the memory painting of peach native Wisconsin It's called yonder grew up in Wisconsin fishing hunting hiking and that's what this piece of music is all about apple saxophonist John Doe Gallagher pianist Henry Hey basis met close the drummer marked for her with guitarist Pete mechanic jazz after hours\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who do Curtis is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nMm\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who do Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com Mm\nOh jeeze", "year": "2018", "show_name": "Jazz After Hours", "city": "Albany", "day": "21"}