{"month": "10", "state": "NY", "station": "WAMC", "content": "The is the b._b._c. World Service where I see me after the crash continued\nTo a big financial crisis a folk can be a vote is actually going to be\nTen years old and then they come in the country [noise] international many\nCases go far beyond find least with respect to some of his lungs how they'll see after the crash at the beach fees were still come\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety point three rents in Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown WC el each dean Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine tie kinda robot\nWAMC which do you want to five one great Barrington WWE ... point nine mount Kisco W ... any point one Stanford W and our eighty eight point five rooster WAMC am fourteen hundred Albany [noise]\nThis is jazz after hours on public radio international we're here every weekend on public radio to fill your night but new jazz and suggestions for seeing the music live at a venue near you\nSome of the new music you'll hear tonight specifically from Christian McBride will be presented on stage in Pittsfield, Massachusetts tonight at the Pittsfield city jazz festival\nChristian and his new John at just released their newest record and it's coming up tonight on jazz after hours the ban will play tonight at the colonial theater in Pittsfield\nAlso on the show and on stage tonight Bob James in Tokyo John Schofield in Seattle beat McCann in Cleveland Rachel Caswell in Indianapolis Christian Sands in New haven and John Pitman in Toronto\nLots more of the artist she'll here tonight are booked somewhere near you and the next few days I Would encourage you to make some notes if you hear some music you like get out this week to see some live jazz\nOur first performers onstage tomorrow in summers Point New Jersey's playing the gateway play house\nIs ... album is called for you gender saxophonist javahn Jackson who was formerly a jazz messenger and has written a lot of originals on this new record honoring pharaoh Sanders McCoy diner and this one will use to start off the show my man Hubbard\nThe tenor saxophone us has pianist Jeremy ... basis David Williams' rising star drummer plenty hunter helping him pay tribute to the man he played with from Nineteen Ninety two to two thousand eight javahn Jackson with my man Hubbard starts off jazz after hours [noise]\nStreaming support for WAMC comes from my dog hardest dot com I choke nope y'all Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nBoom\n\nBoom\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who don't horn is is that do to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nAll a la la la la la\nLa la la la la la la la la la la la la la la la la\nAnd John Jackson paying tribute to his one time musical collaborator Freddie Hubbard with my men Hubbard you'll find that one on for you tomorrow night at the gateway play house you'll find John Jackson on stage in summers Point New Jersey\n... new album from ... big band called parallels and we use it to start off the next set of music listening for Doug Web on tenor sax Josh Aguilar on trumpet Brandon go belly featured on electric piano on this performance of pure imagination it's new from David records big bad [noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke nope dog hornets is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com bubble\nMy\n\nDi di di di di\nDi di di di di\n\nAnd\n\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hornets invented to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nHe\n\n\n\n[noise]\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dope hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk to walk your dog with love thousands of reviews at my dog Curtis dot com Mm\n\n[noise]\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nIf you find yourself in New haven later on today you can catch that performer in a free concert at Yale or to the under ... series that's Christian sense\nAnd later on in the week you'll be out in California at the ... center in Santa Cruz and then on the twenty he's got a performance booked at the Joe Henderson lab that's what the S. F. jazz center\nThe new Christian sands album is facing dragons that was ... debate between ... guitar sushi knock them were on base drummer was drone Jennings you heard some percussion there from Christian Rivera and Roberto ... I'll\nDo or Rupert and direct slur in the middle of that set with Mel walled runs so eyes\nThat was recorded over two nights back in two thousand Fifteen as the guys were performing in Orlando it's been released as are in the new music from Jeff Rupert and Richard directs were on jazz after hours and David regards big band stepping out at the beginning of that set with pure imagination\nParallels is the name of the new album featured soloist Doug Web tenor sax Josh Aguilar on trumpet and Brandon could belly on electric piano\nPuerto Rican trumpeter Charlie ... and his band the turnaround pay tribute to net out early on her newest album songs for Matt this is the four oh to be blues from Charlie ... and his band the turnaround back into the music here on jazz after hours\n\n\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\n\n\n\n\n\nDe\n\nDa da\nStreaming support for WAMC comes from my dog hardest dot com I Know choke nope poll dog her name is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love that is the reviews at my dog Curtis dot com\nBall like Noah me it was\nA real live\nTo be young men to be your\nThe ... junior touch\nYour your voice you know you are oh\nNo one here we have one\nDa da de\nDa da da da da da da da\nDa da da da da da da da da\nDa da da da da\nM. H. D. Ninety point three Albany W are you an HD Ninety point three ramps and you cut WHM cage the Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a NHCD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nine tie kind of rogue WAMC ...\nBarrington WWE ... W. A. N. D. H. D. Ninety point one Stanford W a and R eighty five Bruce during WAMC am\nFourteen hundred Albany [noise] [noise]\n\n\n\n[noise]\nWelcome back to another hour of jazz after hours on public radio international my name is Jeff family I'm here to play new jazz through the night on this ... station in this hour of the show we'll hear trombone as Steve Terry guitarist beat mechanic was a date tonight in Cleveland\nGuitarists ... who's out on the road with Ben window this week\nAnd we begin with John Schofield one of my most recent visits to New York city included stopped by the blue note to see John Schofield I went by myself I was squeezed into this tiny little table with a British tourists to claimed he'd come all the way from the u._k.\nJust to see John Schofield at the blue note and I understand that because he's really remarkable player\nWorking hit sixty six birthday this year with a new band called combo sixty six\nThat new band includes drummer bill Stewart basis Cindy archer\nAnd keyboard is Gerald Clayton this weekend John Schofield is on stage in Seattle a jazz alley and he's on your radio now with the track from combo sixty six this is I'm sleeping in a ballot written by the guitarist for his new album [noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nMm\n\nMm\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope poll dog harden it did to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com Mm\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hornets invented to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\n\n\n\n[noise] no ...\n\nIt's been a long time dream of pianist Ellen song to collaborate with celebrated American poet Dana Julia\nThey finally got it together on a new record called some with words\nThe great John Ellis place multiple read the instruments on the record you also heard trumpeter Ingrid Jensen basis Ruben Rogers drummer Kendrick Scott and the great percussionist Samuel ... the vocalist on that performance where Carolyn Leon heart and Christie actual the tomb was too bad\nStreaming support for WAMC comes from my dog harness dot com I Know choke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nAnd then Helen is back in the U.S October twenty fourth and twenty fifth to perform a disease clip Coca Cola with Rodney would occurs quartet\nIn the middle of that set we heard some new music from some jazz all stars Terrell Stafford Dick goats Bruce bars Tim or field David long Byron land them\nThey didn't give themselves and name they just go by the names of the members of the bad but the records called family feeling all the tunes on this record written an arranged by the pianist Bruce bars\nThat was warm night with tariffs Stafford on trumpet decode ... piano to more field also want sex David one was the bassist and Byron land them the drummer\nAnd John Schofield newest project combo sixty six began the hour this weekend John is on stage in Seattle at jazz alley you heard bill Stewart sending archery and Joe Clayton teaming up with a great guitarist on a tune called I'm sleeping in it began this hour partial\nWell this next artist he's in our region saxophonist named treaty they signed\nHis newest record is called Helsinki songs and he's performing music from his new album at the time period jazz happening in Finland will start at the next set here with ran delusion folk song listen for Christian Randall ooh on piano ... base and mark who own Askari on drums\nWith saxophone streak they sign and his new album Helsinki songs [noise]\nMm\n\n\n\n\n\n\n\n[noise]\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog ... dot com [noise]\n\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope y'all Gordon is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk what your dog would love that is the reviews at my dog ... dot com\n...\nA\n\n... ... ... from his terrific new album the very thought a view teaming up with guitarist Russell ballooned there on the Greek version of no regrets usually ... has a very active touring schedule I've been checking his website regularly since this new album has come out\nLooks like he's chilling for a while if I come up with any dates for the jury and the next few weeks as I'm playing music from his newest album I'll tell you about\nPi McCann guitarist did yonder attuned is a memory painting of pizza native Wisconsin\nWhere he grew up fishing hunting hiking becomes from his newest album pay for it on the other side which sounds rather on but it's but actually refers to the bridge that people can cross every day on his way to work tonight you can catch him in Cleveland at the bus stop to eight o'clock show\nWe also heard ... newest album Helsinki song that was ran delusion folks from ... most recent release\nGuitars ... out on the road in Europe these days he's performing with Ben went del there in France and Spain and the next few days\n... newest album is called ask for chaos and this is one of the two trio he recorded with on his new album this is the G ... trio with represented one base and Jonathan ... on drums guitars ... the tunas cold Milton ... jazz after hours [noise]\nStreaming support for WAMC comes from my dog hardest dot com I Know choke no poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Kurdish dot com\n\n[noise]\n\n\n\n\n\n[laughter]\n\n\n[laughter]\n\n\nM. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety point three runs in Utica WAMC cage de Ninety point nine kicked in WLS R. H. D. Ninety One point Kevin Middletown W T E L HD Ninety One point nine Plattsburgh W T A N each the Ninety three point three Kennedy Harry WAMC HD won a three\nPoint nine to ... WAMC ... when a five point one great bearing ... W W E S H da da di ... W. A. N. C. H. D. Ninety point when Stanford\nW ANR eighty eight point by Brewster\nAnd WAMC am fourteen hundred Albany\n[noise] [noise]\n[noise]\n[noise] um\n[noise]\n[noise] [noise] [noise]\nOur weekly exploration of new jazz on public radio international this is jazz after hours I'll be All right my name is Jeff handling gosh it's really a great weekend to get out and see some live jazz tonight Bob James is on stage in Tokyo will listen to something from his newest trio album\nBernie cryptic is on stage in the Cleveland area tomorrow at the ... street cafe you can catch the great id Meyerson and just a few hours ago in New York City Ben Patterson finished up at miserable in the village but don't despair you can catch 'em on Sunday at little branch that's in the ...\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog harden it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nWith his guitarist at Jerry and his drummer Jason team in starting off our our ... and you're listening to jazz after hours we are\n\nTeach them a\nTo win\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll dog hard it is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog ... dot com bust\n[noise]\n\n[laughter]\n[laughter]\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com [noise]\n\n...\nMm Mm\nMm Mm\n\n\nMm\nMm\nWell\nAnd the Web has a day coming up kind of a fun day with Larry Golding they're doing a duo show on the sixteenth of October at the Catalina bar and grill in Hollywood\nStreaming support for WAMC comes from my dog hardest dot com I Know choke nope poll y'all garden is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nRun a piano critical enjoyable play bass in the river on this performance is Roy McCurdy music from ... jazz after\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll dog hard it is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\n\nFormer\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll yogurt is it that did to make walked easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that is the reviews at my dog Curtis dot com\nDa\n[noise]\nI'm a retired\n\n[noise]\n\nMichael ... is the bassist and drummer Billy kill some together with Bob James he's on stage tonight at the blue note in Tokyo and dug Web began the set with these things written for Michael D strum bonuses and recorded on fast French\nCatch him on the sixteenth performing with Larry Golding Z in Hollywood at the capital in the bar and grill on sunset\nEvery couple of weeks I like reaching for this Bob mentor big band album with the vocal group New York voices\nIt's called meeting of the mind so it's got a lot of really fun music on it like this one old double moon the featured vocalist here is Laura Kennan one of the members of Newark voices and the ... was played by Bob about this is Bob mentors big bad with New York voices jazz after hours [noise]\n\nDo get done hand me something that the big in which you\nMake this man\nOn a magic right now for about a\nMonth on us grew\nOh\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\nAnd\nRang\n\n\nAnd\n\n\n\n\nNa\nNa\nNa\n\n\n\n\nBreak the real nice to have\nLa la la la\n\n\nLa la\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll do her name is that do to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love that is the reviews at my dog Curtis dot com\n\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com stamper W. A. N. or eighty eight by Brewster and WAMC am fourteen hundred Albany\n[noise] anyway [noise]\n\n\n[noise] [noise] [noise]\nThis is jazz after hours on public radio international my name is Jeff ... thanks a lot for staying up so late to hear the music\nGosh if I had to describe this night I Would use the words fast and furious were already into the fourth hour of the show and I have lots more music I Want to play for you tonight so we'll jump right in Christian McBride new record is called Christian McBride new John and he'll be celebrating its release and playing music from this new group\nThis weekend in fact later on tonight at the colonial theater part of the Pittsfield city jazz festival Denny's onto a run at the blue note in New York City\nChristian McBride new John is Christian on base trumpeter Josh Evans saxophonist Marcus strict one and ... which ... market Strickland wrote this next June seek the source knew from Christian McBride to start up this hour show [noise]\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\n\n\n\nDo\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that is the reviews at my dog Curtis dot com\n...\nLa\n\nNo oh well well a little girl and\n[noise]\n\nUm\n\n\nSwedish American ... el ... in New York based pianist John Coward of the brain blade fellowship at their\nNews collaboration together is called after us a beautiful duo album on which you'll find that to practice patients\nJohn was just on stage last night at the ... street cafe with Joel Harrison he's out with Brian Blade at the jazz standard on the nineteenth through the twenty first of this month\nAnd then in early November he's part of Joni Seventy five\nThat's a birthday celebration for Joni Mitchell November sixth and seventh at the door the Chandler pavilion in Los Angeles and listen to this list of performers for the show brandy Carlisle Glenn hazard ... Harris Norah Jones Chuck ... Khan Diana crawl Chris christopherson last Lobos\nGrand Nash seal James Taylor and Rufus Wainwright performing with John Coward and a lot of other great performers at the door the ... billion\nOn the sixth and seventh of November if there's any tickets available you should grab a couple\nIn the middle of that set we also heard Toronto trumpet player John Pitman attract from John's latest album kinship\nTonight John is on stage in Toronto at lot rap\nAnd he'll probably be playing new music from his kinship album we heard for she'll bond with John ... minute on trumpet ... a baritone saxophone the pianist on that record was Jeff McLeod Mike downs was the basis to criticize Melba ... drummer John Goodman\nAnd Christian McBride new John began the hour would detract from their self titled album called seek the source did I at the colonial theater part of the Pittsfield city jazz festival look for Christian McBride at new John on stage and then watch for him at the blue note in New York City\nStreaming support for WAMC comes from my dog hardest dot com I Know choke no poll dog hard is it that just to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nBlind and this is Mike ... called Mr snacking I don't know anything about it but you can speculate on the name while they played music for you for ... and ...\nAlong with some young players on their way up in Stewart on base and Joel McHale on drums from Venetian blind this is Mike Freeman's ...\n[noise] [noise]\n[noise] [noise] for um [noise]\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com I Know choke no poll dog hard is it that just to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\nLittle da da da da da\nDa\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who don't harden it did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com oh\n\n\n...\n\n\nStreaming support for WAMC comes from my dog's heart is dot com no joke no pope dog hornets invented to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n\nMm\nStreaming support for WAMC comes from my dog hardest dot com or no joke no poll dog harden it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n", "year": "2018", "show_name": "Jazz After Hours", "city": "Albany", "day": "13"}