{"month": "10", "state": "NY", "station": "WAMC", "content": "\nHe says the b._b._c. World Series after the crash can can use\nYour brain ... sort of ask for a holiday of Africa\nAnd they can [noise] for Congress to really see the cases go far beyond the fine least success on our focus on how many of these [noise] the last of the worst habits um\nNortheast Public radio WAMC FM Eighteen\nNinety poetry Albany double you argue in Eighteen point three bumps and Utica W. A. M. K. I. G. Ninety point nine kings can double July sorry gene Ninety One seven Middletown double UCLA the Ninety One nine class or get what do you see a an Eighteen Ninety three three kinda G Harry W. A. N. C. H. E. one oh three nights I kinda regret WAMC way she won all five one great Barrington\nW W E S H da da na na Kisco WINZ Eighteen Ninety\nPoint one Stanford W ANR eighty eight five Brewster at WAMC am fourteen hundred Albany\n\n\n\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness in that did to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog would love that says that reviews at my dog current S. dot com\nAs on the radio were here two nights every weekend on NPR I and I really appreciate that you've chosen to spend some of your weekend with me if you like new jazz you've made the right choice if on the other hand the tuning dial or button on your radio is broken and you're just stuck here\nWell this is your lucky night I think the music I've been picking out for you all week is pretty good\nThere's a beautiful new record to buy New Orleans star Jon Benet piece vibe or phone us stepping Harris has a new record and a tour books through Chicago this coming week I'll have to dish for you\nThe Count Basie orchestra founded in Kansas City eighty three years ago had the number one jazz album in America last week I'll play that for you this hour and the number one jazz album this week is by ... stuffing Harris that's also when the first hour of our show\nOne quick note before we begin the show tomorrow night the free live stream from jazz at Lincoln Center will celebrate dizzy Gillespie\nAnd you can be there through the very generous efforts of all the folks at the Columbus Circle venue and of course the wonders of technology and what would have been dizzy Gillespie is one hundred first birthday basis for the jazz at Lincoln Center orchestra Carlos Enriquez pays tribute to the trumpet master and celebrates the release of his own new album\nThat's an Early Show don't forget it starts at seven thirty in New York so if you're out here on the west coast like I Am at four thirty Sunday afternoon for jazz at Lincoln Center\nWe begin to show with a jazz pianist whose latest record is all about his love of Eric set the Maurice rebel WC and Mozart\nIn a case of this first tune a work written for two pianos by Maurice rebel it comes from kaleidoscope the new record by the Cyrus just not trio\nWill start the hour with alter close ... between bells ... piano Eric Miller on bass and Chris back on drums this is jazz after hours from public radio international\n[noise]\n\nStreaming support for WAMC comes from my dog hardest dot com I no joke no pope dog her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope y'all Gordon is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog ... dot com da\n\n\nAnd in ... in\nAfter hours I'll be All right from the sixties duo project by used to a person Ron Carter weird the way you look tonight\nStreaming support for WAMC comes from my dog hardest dot com and no ... no poll dog hard is it that did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to walk your dog would love that ... at my dog Curtis dot com\nA new record begin the Gore a featured soloist there from Trump except Merlin trombone is Russell Friedland out those ... many ... bail jumping or Kevin wild and ... Calgary begin the ... the new record from Greg be as an artist imagination jazz orchestra\nAnd Cyprus just nuts trio began the hour with onto close short by Maurice rebel a new record kaleidoscope from the Cyrus just a trio on the nineteenth of November he'll be performing at the Capitol theater in Salt Lake City and then on the twentieth and the twenty first he's in Knoxville at the Tennessee theater\nThat was pretty excited this last week to get a new record from trombone is John ... Chuck he's a good friend of the show he's got a very important date coming up in November ... jazz orchestra I'll tell you all about that just a few minutes\nTo record from the John ... quartet is called reminiscent and I want to start this next set with if you could see me now\nJohn to me is the pianist Jimmy masters the basis and did write a check the drummer with John Boehner John Fitch\n\nStreaming support for WAMC comes from my dog ... dot com I no joke no pope dog hard it is that do to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to walk your dog would love that is the reviews at my dog Curtis dot com\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog with love thousands of reviews at my dog Curtis dot com\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da\n\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com boom\n\n\nThen and then\nNa na\nNot\nBe\nTo do\n\n\nNa na na\nNa\nNa\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nAnd then\nAnd\n\n\n... ... ... ... ...\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope who do Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nThe Count Basie orchestra made it to the top of the jazz charts last week they had the number one jazz record in America called all about that they see we heard can't hide love featuring white cliff Gordon trombone and pianist ...\nAnd this week the number one jazz record in America is from Stefan Harris and his band blackout we've heard the play wing shorter go their new album sonic create from the twenty fifth through the twenty eight this coming week you can catch this is north east\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nPlattsburgh WC an HD Ninety three three kinda G Harry W. A. N. C. H. D. one oh three nights I kind of regret W. A. M. U. H. D. one oh five one great Barrington W W E S H da da da da da da da da da da da and our eighty eight five Brewster WAMC am fourteen hundred Albany\nContinuing our weekly exploration what's new in jazz this is jazz after hours on public radio international my name is ... family here and the jazz on the rise studio out of California\nPlaying music for you tonight thanks love petunias\nI've got ... Peterson's Gen next big band coming up this hour and David caffeine jazz orchestra\nAnd other big band the metropolitan or cast big band that by me ... is in this hour the show and we'll begin with a yellow jackets who still have it after all these years I remember playing the first yellow jackets album on the radio in Seattle many many many years ago\nThe new ones called raising our voice and we'll start off the hour with strange time Russell for us to use the pianist Bob mentor a saxophone William Kennedy is the drummer and dean older son the basis of the new yellow jackets album to start up this hour show\n[noise]\n\n\n[noise] [noise]\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walked easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\nBang\n\nEat\n\nWell ... ...\n... ... ...\nStreaming support for WAMC comes from my dog hardest dot com no joke nope dog her name is that just to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nUse the gym so\n\nMy move to a movie for the auto\nMe know mine she\nWould still be oh my\nShe mouse like your\nSheen do need to\nAnd if you can't\nBe there to greet you\nStreaming support for WAMC comes from my dog hardest dot com I choke no pope dog hornets invented to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nEarly\n... seeing\nStill be on\n\n\n\n\n[noise]\nMm Mm\nMm [noise]\n\n\n[noise]\n[noise] Mm\nMhm mhm mhm [noise]\nMhm [noise]\n\n\nMhm [noise]\n\nMm ... rather\n\n\nThan\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nYou know [noise]\n\nThe medal in the middle\nOf the many mhm [noise]\nMhm [noise]\nMm\nMhm\n\nMm\nMm\n\n\nMm Mm\n\nMm\n\nMm\nMm Mm\n\n[noise]\n[noise]\n\nMhm\n[noise]\n[noise]\n\nUm [noise]\n[noise]\nMm Mm\nMm [noise]\n\n\n[noise]\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who do Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nAnd\n\n\n[noise]\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love thousands of reviews at my dog Curtis dot com oh\n[noise]\n[noise]\n\n\n\n\n\n\n\n\nMm Mm Mm Mm Mm well [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] Mm Mm Mm Mm Mm Mm Mm Mm Mm [noise]\nMm Mm\nMm Mm\nNah\nNah nah nah\nNah [noise] [noise] [noise] Mm\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hardest invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com Mm\nMm\n\n\nMm\n\n\nMm\n\nYou point three Albany W argue any sheen Ninety point three renting you to cut W. M. K. Eighteen Ninety point nine Kingston W O s are each dean any one point seven Middletown to UCLA each dean any one point nine Plattsburgh WTO again HD Ninety three point three ... three nine tie kind of robots\nW. A. M. U. H. D. one oh five one great Barrington WWE I teach the eighty point nine up Kisco W. N. C. H. dean any point one Stanford stimuli than our eighty eight point by Brewster WAMC am fourteen hundred Albany\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] to\nWelcome back to another hour of jazz after hours on public radio international\nMy name is Jeff handling this is our weekly new jet speech Iran PR I\nIn this hour of the show that new jazz will include Ben Alison the jazz at Lincoln Center orchestra with Ruben Blades the humanity quartet and we begin with mikel plow and mark Turner just released a new duo album called federal the Danish guitarist in the American saxophonist have known each other for a long time\nAnd have released this new album that includes the red the album that's the name of the two would use to start off this hour far show\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\nMm\nMm [noise]\n\nMm Mm\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hard is it that just to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\n\n\nPaying fees they ... to\n\n...\nTo\n...\n\n\n\n\n\nTo\n...\n[noise]\n[noise]\nMm\n\n\nMm Mm Mm Mm Mm\n[noise] de\nDe\nDe\n\n...\nDe\n... uh ... they\nAnd they got\nA\n...\n...\n\n... ...\n\n\nMm\n\n\nStreaming support for WAMC comes from my dog's hardest dot com I choke no pope do hard is it that do to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com oh\n... ...\n\nNa\nNa\n\n\nMm\n\nMm\n\n\nSo I'm all stars out of the Hudson River valley called the humanity quartet and their album is called simply humanity the bans basis Sean Smith wrote that tune springs standard your jokes\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com\n... us John has been on stage for the last few days with Brian Blade and life cycles that the jazz standard on the sixth and seventh of November there'll be performing in Los Angeles at the door the Chandler pavilion that's part of a birthday celebration for Joni Mitchell\nWe heard it all to know some competition called Baltic from the new album after us el ... and then John Coward\nAnd mikel plow and mark Turner began or our with a tune called the red album comes from pharaoh their newest released together Nicolas out with these trio in November to ring Italy\nWell ... is up next year he's got an album all original music he's a trumpeter\nIt's called trips and will listen to the tune Edinburgh David Feldman is the group's musical director and the pianist on this recording Andre ... based you'll hear Rockville brought on drums ... on saxophone\nAnd on trumpet Guillermo BS go this is a number on jazz after hours\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope dog hornets is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n[noise]\nMore\nHalf my\nWhen she said no\nNo we don't go to ... or ... well\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope dog her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com [noise]\n\n[noise]\n[noise]\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com oh\n\n\n[noise]\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who dug hornets invented to make walked easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that the reviews at my dog Curtis dot com [noise]\n\n\n\n\n\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog harness that did to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nPoint one Stanford W ANR eighty five Bruce during WAMC am fourteen hundred Albany [noise]\n\n\n\n[noise]\nThis is just after hours from public radio international\nBanks all opportunity in for the final our of our show this Friday night Saturday morning I'm Jeff handily\nI really appreciate your staying up so late to hear the new jazz tried to make it worth your while with something from PMS shake maestro listen to the one o'clock lap band out of the University of north Texas Alison Miller and carbon staff who were just on stage at the earshot jazz festival in Seattle\nAnd Walter Gore a pianist begins to the hour with a track from his newest record in due time\nHe is currently pursuing his masters in jazz composition and arranging kind of a famous jazz school William Patterson university a lot of players you hear on the show have studied at William Patterson\nFrom Walter ... most recent album will hear a tune called just thinking ... Lopez is the drummer Gonzalo tap on the basis great tenor Harris place vibe or phone with pianist Walter Gore from his album in due time you're some new jazz for you on public radio international jazz after out [noise]\nUm\nBurned\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hard is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com bubble\n\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll dog horn is it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n[noise]\n\n\n\n\n[noise]\n\n[noise] [laughter]\n[noise]\n[noise] [noise]\n\nJazz after hours on public radio international with some music from one o'clock lab banned from the University of north Texas the records called lab two thousand Eighteen rhythm of the road we're to June written by the band director Ellen bay lock gold without a doubt\nSam ... is the opposite sex bonus featured there and ... on trouble with one o'clock Web\nFrom Allison Miller and Carmen stuff drummer and pianist we heard ready steady we're joined by basis Matt Goodman trumpeter Ambrose ... misery sex opponent David Stevens new record called science fair\nAnd as I mentioned fans of jazz in Seattle were just treated to a performance by the group that you're shot\nAt Walter Gore a pianist began it was just thinking his newest album is in due time\nWhat ... is a saxophonist and he's just released a new record cold Helsinki song there'll be performing in Finland in early November at the temporary jazz happening\nWell listen to help thinking song from the new record retreat prevail saxophone Greece John ... ... ... and on base and work who\nStreaming support for WAMC comes from my dog hardest dot com or no ... no ... dog hornets invented to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\nMm\n[noise]\n\nMm\n[noise]\n\nMm\n\n\n\nMm [noise]\n\nMm\n[noise]\nMm Mm [noise]\nMm\n\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com mhm\n\n\n[noise]\nMm Mm\nMm\n\nMm\n\n\n\n\n\n\n\nMhm mhm\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hornets in that do to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to walk your dog with love thousands of reviews at my dog harness dot com\nThere\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog harness dot com\n[noise] no\nDone many\nThe um\n[noise]\n\n\n[noise] and\nMaybe ... ... [noise]\n\n[noise] [noise]\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog ... dot com\nStreaming support for WAMC comes from my dog hardest dot com I don't know who do her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk what your dog would love that is the reviews at my dog ... dot com", "year": "2018", "show_name": "Jazz After Hours", "city": "Albany", "day": "20"}