{"month": "10", "state": "AZ", "station": "KUAZ", "content": "Hosts Joshua Johnson your panel of journalists we'll discuss the international news story for the week including the status on the Brexit negotiations\nAnd Indonesia still reeling after an enormous tsunami that need to be your local how\nDry conditions are expected today and tomorrow with temperatures near or slightly below average for early October sunny today and tomorrow with a high in the mid eighties clear tonight with a low around fifty six\nIt's Seventy four degrees in midtown Tucson Seventy seven in Sierra Vista\nSenator Palin journalists we'll discuss the international news story for the week including ... on the Brexit negotiations and Indonesia still reeling after an enormous denying that need to be your local how\nDry conditions are expected today and tomorrow with temperatures near or slightly below average early October sunny today and tomorrow with a high in the mid eighties clear tonight with a low around fifty seconds it's Seventy four degrees and attempt to son Seventy seven in ...\nPoint one can you may see ... D Tucson and any point nine K. U. A. S. F. ... Europe is to its technical\nAre among the world's highest honors for service to humanity and now we know the winters who's in this year's class of Nobel laureate from the old you AMU at NPR in Washington this is one [noise]\nEither I'm Joshua Johnson today on on a it's the friday news round up the twenty eighth the Nobel Prize just have all gone out culminating in the peace prize which went out today who won and what for [noise] meanwhile Russia is getting attention for an ig noble a cheap rip spying on a leash\nYou and NPR in Washington issues one [noise]\nEither I'm Joshua Johnson today on on a it's the friday news round up the twenty ... Nobel Prize just have all gone out culminating in the peace prize which went out today\nWho won and what for [noise] meanwhile Russia is getting attention for him to dig noble achievements spying on a leash to international agency [noise] plus the U.S calls out China for trying to sway public opinion in America and first lady millennia Trump visits Africa\nOr also across the Brett Kavanaugh vote in the Senate but in the meantime let's review this week's top global headlines\nComments on our Facebook page or tweet us ... one ... [noise]\n[noise] live from NPR News in Washington I'm Louis ... the U.S Senate is now marching toward a final Senate vote on the nomination of Brett Kavanaugh to the U.S Supreme Court\nThis as the American bar association has announced it is revisiting it's evaluation of cabinet after his Senate Judiciary committee appearance last week NPR's Kelsey Snell reports of final Senate vote is expected Saturday evening Senate Republican leaders are\n\n\n\n\n\n\n\n\nRepublican Susan Collins she voted to advance Kavanaugh but has not yet announced how she will vote on confirmation her decision may be critical if Collins or any other moderate changes their mind vice president Mike Pence will have to break the tie Kelsey Snell NPR News\nThe Capitol the nation's jobless rate has hit its lowest level since December of Nineteen sixty nine three point seven percent although Williams sprayed chief economist at the AFL CIO is concerned that wage growth continues to be low\nReal disturbed remember was but we only grew a two point oh eight percent over last year with the growth of GDP but we've seen over the last two quarters bothersome because of the productivity is up ... percent are going to pick up at this moment\nThe Labor Department says employers added just one hundred and thirty four thousand jobs the fewest any year analysts say that may have been due to disruptions caused by Hurricane Florence which struck north and South Carolina closing thousands of businesses\nIt's been a week since a deadly earthquake and tsunami hit Indonesia NPR's Lauren Frayer reports from the capital Jakarta the death toll has surpassed Fifteen hundred and fifty\nAmong the bodies being pulled out of the rubble were those of a mother clutching her baby\nAnd jobs the fewest in year analysts say that may have been due to disruptions caused by Hurricane Florence which struck north and South Carolina closing thousands of businesses\nIt's been a week since a deadly earthquake and tsunami hit Indonesia NPR's Lauren Frayer reports from the capital Jakarta the death toll has surpassed Fifteen hundred and fifty among the bodies\nBeing pulled out of the rubble were those of a mother clutching her baby both dead their neighborhood in ... on the island to sue the way she was wiped out by mudslides French rescuers thought they had detected signs of life under the rubble of a hotel in the same town but they've not yet been able to locate any survivors there\nNPR's Lauren Frayer in Jakarta this year's Nobel Peace prize shared by two people who fight sexual violence NPR psoriasis or hunting Nelson says one is an active is held in sexual slavery by ISIS the other a gynecologist in Africa\nUCD activists ... is only the seventeenth woman to receive the award and the many supporters of Dr ... was spent two decades healing victims of gang rape in the Democratic Republic of Congo see his recognition was long overdue the Nobel Committee says the two were awarded the peace prize for their efforts to end the use\nPR psoriasis are highly Nelson says one is an active is held in sexual slavery by ISIS the other a gynecologist in Africa\nIs eating activists ... only the seventeenth woman to receive the award and the many supporters of Dr ... was spent two decades healing victims of gang rape in the Democratic Republic of Congo see his recognition was long overdue\nThe Nobel Committee says the two were awarded the peace prize for their efforts to end the use of sexual violence as a weapon in war\nWall Street the Dow down to sixty this is NPR\nForeign Northern Ireland political parties are being briefed on the Brexit talks buddy you chief negotiator Michael of Michelle buying a in Brussels today the u._k. and the ... are still divided over how to solve the issue of the Irish border Peter Ross in London reports\nPolitical leaders from Ford of northern Ireland's pro the main parties are reaching Mr Barney to discuss possible solutions for the Irish border after the u._k. leaves the use the parties are concerned about the impact of breaks or Northern Ireland on whether it will lead to return of a hard border in Ireland\nYou candy you're still divided over how to solve the issue less than two weeks before the crucial EU summit however the Irish prime minister earlier\nBorder Peter Ross in London reports\nPolitical leaders from photo of northern Ireland's pro the main parties are meeting Mr Barney to discuss possible solutions for the Irish border after the u._k. leaves the use the parties are concerned about the impact of breaks or Northern Ireland and whether it will lead to return of a hard border and in Ireland\nThe u._k. and you're still divided over how to solve the issue less than two weeks before the crucial EU summit\nHowever the Irish prime minister Leah ... has suggested that a deal between you and the u._k. could be agreed before then saying there was a good opportunity for the deal but he called on the u._k. to publish his latest plans for the void in your heart border as soon as possible for NPR News in London and Pete Rose\nInterpol president among way has been reported missing while making a trip to his native China Interpol is based in France in a statement the organization said quote this as a matter for the relevant authorities in both France and China\nClinton till was the secret service agent in the presidential motorcade in Dallas in Nineteen sixty three who leapt onto the president's limousine to shield the president at first lady after John Kennedy was shot he was honored shortly thereafter with an award for bravery he is now about to receive the Theodore Roosevelt rough rider or more from it\nInterpol is based in France in a statement the organization said quote this is a matter for the relevant authorities in both France and China\nClaims hill was the secret service agent in the presidential motorcade in Dallas in Nineteen sixty three who left on to the president's limousine to shield the president and first lady after John Kennedy was shot\nHe was honored shortly thereafter with an award for bravery he is now about received a Theodore Roosevelt rough rider on board from his home state of North Dakota he's eighty six years old\nI'm Louis ... NPR News Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\n[noise]\nWelcome back to the pre recorded presentation of one ... friday news round up here on NPR eighty nine point one support comes from the Tucson museum of art presenting thirty Americans the rebel family collection a showcase of contemporary African American artist from the past forty years\n\n\n\n\n\n\n\n\n\n... goes to two people from two different countries for their work helping victims of sexual violence in armed conflict also a big election is coming up in Brazil more allegations of Russian hacking vice president Pence has harsh words for China and Iran and first lady Melania Trump goes to Africa\nJoining us to discuss this and the big stories from around the world is David Sanger national security correspondent for the New York times and the author of\nThe perfect weapon war sabotage and fear in the cyber age David welcome back to what a\nGreat to be ready Joshua Vivian ... covers the White House for the wall Street Journal Vivian welcome and NPR national security correspondent Greg Myre ... co author of this Burning Land lessons from the frontlines of the transformed Israeli Palestinian conflict Greg Greg glad to have you back\nGood to be a gesture we'd also be glad to have your questions in thoughts about the top stories from around the world we are following the top story in the U.S right now and we'll have more on the vote regarding judge Brett Kavanaugh a little bit later on that vote has taken place in the Senate has voted\nTo move forward with the big vote will discuss that a little bit further later on but we want to start with some big stories from around the world that have really gotten eclipse over the counter not covered so email us one a at W. A. M. U. dot org comments on our face\nIt'll be glad to have your questions and thoughts about the top stories from around the world we are following the top story in the u._s. right now and we'll have more on the vote regarding judge bread having ... a little bit later on that vote has taken place and the Senate has voted\nTo move forward with the big vote will discuss that a little bit further later on but we want to start with some big stories from around the world that have really gotten the clips over the counter not covered so email this one a at W. A. M. U. dot org\nComments on our Facebook page where you can watch our video stream or tweed us at one ...\nAmerica and other western governments hammered Russia's spy network this week\nYesterday the u._s. indicted seven military ... with links to an Olympic dumping scandal earlier ... Dutch authority said they had foiled ... cyber attack against the international chemical weapons watchdog let's explain\nFor men working for Russian military intelligence or caught trying to hack the computer network at the headquarters of the organization for the prohibition of chemical weapons OPEC W. that's the group that was investigating the use of chemical weapons ... England that attack on the ... Russian spy\nAnd in Syria equipment was found in the trunk of a car there was a wife ... antenna hidden under a jacket on the shelf reports suggest ... was\n\n\n\n\n\n\nCyber as the main way that they see to disrupt and undermine not only foreign governments\nBut those who would be opponents of automatic ... or those who are busy investigating other Russian malfeasance so when you go across the indictment and the other day that we got a from the British and from the Dutch\nAnd I'm more or less the same for Saturday and into Saturday evening my Sunday about sixty percent chance of rain a high up Seventy nine and chance of rain sticking around right through late Monday afternoon and cooler temperatures following by Tuesday a high up just Seventy nine degrees and the nighttime low Tuesday night of about fifty five [noise]\n\nSupport for NPR comes from this station and from progressive insurance offering a way to buy home insurance with their home quote explorer tool custom quotes and rates are available on mine learned more progressive dot com or one eight hundred\n\nSupport for NPR comes from this station and from progressive insurance offering away to buy home insurance with her home quote explorer tool custom quotes and rates are available on mine learned more progressive dot com or one eight hundred progressive now that's progressive\nAnd from Boehner with the\nBone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service\nContract or locate her and more information ... bona dot com\nHas won a I'm Joshua Johnson it's the friday news round up with NPR's Greg ... of the wall Street Journal and David Sanger of the New York times we welcome your questions and thoughts about the top stories from around the world\nComments on our Facebook page where you can also watch video stream tweed us at one eight or email one a at W. A. M. U. dot org with regards to cyber hacking Michael asks with the loss and resulted widespread dissemination of the CIA tool kit which allows one to ...\nJoshua Johnson it's the friday news roundup with NPR's Greg Myre ... of the wall Street Journal and David Sanger of the New York times we welcome your questions and thoughts about the top stories from around the world\nComments on our Facebook page where you can also watch a video stream tweet us at one a or email one a at W. A. M. U. dot org\nWith regards to cyber hacking Michael asks with the loss and result in widespread dissemination of the CIA tool kit which allows one to spoof hacking from another country how can cyber bread crumbs lead to certainty that another country is actually guilty\nDavid what do you think well cyber attribution is something that people are getting a lot better at I'm certainly there are lots of ways to make it appear that a cyber attack came from other places when the New York times was attacked by the Chinese and its computer systems\nAh years ago it looked like the attack was coming from a University in the southern part of the U.S\nBut the fact of the matter is a combination of forensic evidence a motive\nPast use so similar tools can get you most of the way most of the time so there are some pretty good ways to go do it the bigger question facing many governments is\n... and it's computer systems uh years ago it look like the attack was coming from a University in the southern part of the u._s. but the fact the matter is a combination of forensic evidence a motive\nPast used ... similar tools can catch you most of the way most of the time so there are some pretty good ways to go do it\nThe bigger question facing many governments is once they've found this out and perhaps decide one ounce it has happened in these most recent cases then the political pressures on them so what do you do about it\nThat's why the president signed a new set of executive orders and I'm\nIn August we haven't seen them they're all classified that pushes down into the system or the ability for commanders in the u._s. to do cyber attacks back without having presidential sign off\nTill now that's been something that the only only the president ... authorized the use of nuclear weapons and cyber weapons now it's not entirely clear that only he can authorized using cyberweapons in retaliation but you want to make sure you're attribute ... pretty good\nBefore you strike back you know who to attack yeah great married before we move on\nFrom there ... first of all that has no small\nUs to do cyber attacks back without having presidential sign off\nTill now that's been something that the only only the president could authorized the use of nuclear weapons and cyber weapons now it's not entirely clear that only he can authorize the use of cyber weapons in retaliation but you want to make sure you're attribution is pretty good before you strike back you know who to attack\nYeah great married before we move on\nFrom there first of all that is no small thing that that the U.S military might have the latitude unilaterally to shut down a power grid or turn off a hydroelectric dam through the Internet\nBut beyond that do we have a sense that certain countries certain organizations are getting a better handle on dealing with cyberattacks to world clearly hasn't figured this out is anyone making progress I think about the EU because I hear so much about Internet regulations from there on the consumer level but\nOn a military level is anyone making progress\nOr not that I'm aware of the U.S I think it's still a world leader in in in terms of you know advanced Internet abilities and and the threats are pretty clear ah Russia China and North Korea or Iran but a ... figuring out or response in how you want to\nIs anyone making progress I think about the ... because I hear so much about Internet regulations from there on a consumer level but\nOn a military level is anyone making progress\nOr not that I'm aware of the U.S I think it's still the world leader and in in terms of uh you know advanced Internet abilities and and the threats are pretty clear or Russia or China and North Korea or Iran\nBut a ... D figuring out or response and how you want to calibrate that response so it doesn't become this open ended escalation and you don't know the capabilities of your rivals if you respond a you you're injuring really uncharted territory\nVivian do we get a sense of countries beginning to kind of work together to figure this out to to figure out some kind of international response to cyber attacks or his Russia really got the whole world kind of running with here on\nThe what we've seen in the last couple of days is coordination of um indictments and you know raising concerns about I'm signing an otherwise obviously there's a lot of discussions that are taking place where countries our western allies trying to coordinate some kind of effort to counter\nThe threat that that the Russians posed but at the same time again you have so many ah restrictions and so many um uncertainty as to how to approach\nYou're on the what we've seen in the last couple of days is coordination of um indictments and you know raising these concerns about um spying and otherwise obviously there's a lot of discussions that are taking place where countries our western allies trying to coordinate some kind of effort to counter\nThe threat that the that the Russians posed but at the same time again you have so many uh restrictions in so many um uncertainty as to how to approach the cyber world in general and cyber threats\nUm as David said the U.S trying to really formulate some sort of attack plan or something to counter to protect our infrastructure so that we don't have um we're not as vulnerable as we've seen ourselves\nIn the past but obviously you know the U.S is still trying to figure out a way forward I'm having looked at what happened to us in the two thousand six to election still we're talking about the fact that we are vulnerable in two thousand Eighteen we could be vulnerable and twenty twenty so we haven't actually tried quite figured out how to protect ourselves get alone\nThe world's kind of coordinating on a global scale to do the same it's it's it's not an easy task\nTwenty kind of a decentralization of the way that we vote that we are so many different kinds of voting systems might you know way kind of how helpful it helps insulated from the courthouse\nLooked at what happened to us in the two thousand sixteen election still we're talking about the fact that we are vulnerable in two thousand Eighteen we could be vulnerable on twenty twenty so we haven't actually tried quite figured out how to protect ourselves get alone the world's kind of coordinating on a global scale to do the same it's it's it's not an easy task\nIt's funny kind of a decentralization of the way that we vote that we have so many different kinds of voting systems might you know way kind of how it helps allied health insulated from according to the fact that we've got all these different utility company yeah that you know ... but but the key element here is we've done a better job at discussing internally how we would\nDo counterattacks than we have organizing the world than the sort of digital Geneva Convention of what standards of what's on limits and often it\nLet's shift gears and talk about the Nobel Prize is particularly the Nobel Peace prize the winters were announced this morning\nDr Denis ... and ... one for their work combating sexual violence as a weapon of war\nThe announcement from the Nobel Committee said in part quote Dennis ... look quite ... is to help or who has devoted his life defending these victims nutty a rod is the witness who tells the abuses perpetrated against herself\nAnd others were rod is in Iraq\nThis is particularly the Nobel Peace prize the winners were announced this morning\nDr Denis ... and ... one for their work combating sexual violence as a weapon of war\nThe announcement from the Nobel Committee said in part quote Dennis ... look quite ... is to help or who has devoted his life defending these victims not him a rod is the witness who tells the abuses perpetrated against herself\nAnd others were rod is an Iraqi woman she was captured and held by the Islamic state escaped captivity after three months and told to her story in a book called the last girl\nDr ... founded a hospital in eastern Congo that treated thousands of women many of whom are survivors of gang rape ... pretty extraordinary people to be wanting this prize especially as we've learned more about how sexual violence is being used as a weapon of war and has for quite some time\nReally has to two individuals who seem really deserving of the peace prize has been a lot of had a lot of controversy in recent years very politicized\nA couple of people who really been thrust into dangerous situations handled it with with incredible courage and Dr ... a bill this hospital in eastern Congo which is in the middle of nowhere\nMore about how sexual violence is being used as a weapon of war and has for quite some time yeah really has to two individuals who seem really deserving of the peace prize has been a lot of had a lot of controversy in recent years very politicized\nA couple of people who really been thrust into dangerous situations handle that with with incredible courage and and Dr ... up built this hospital in eastern Congo which is in the middle of nowhere and just a very remote region Twenty years ago for maternal care they're just as much health care of that was his intent\nBut as the Congolese civil war metastasize um rape became a huge issue a huge problem that the various factions un peacekeepers were involved in in rape there\nAnd so he became the voice of rape being used as a weapon of war and so he's been at this for Twenty years very prominent a voice but still operating in a very ah a dicey region of very deserving winter very\nI I can really speak for the case of ... who I I spend a lot of time in Iraq and two dozen Fifteen sixteen I'm intervening ZD women who were released from captivity from ISIS and the impact obviously psychologically\nOf rape being used as a weapon of war and so he's been out there for Twenty years very prominent a voice but still operating in a very ah a dicey region of very deserving winter ...\nI I can really speak for the case of M Ms ... who I I spend a lot of time in Iraq and two dozen Fifteen sixteen\nI'm interviewing gives you the women who were released from captivity from ISIS and the impact yeah obviously psychologically um physically or the the the use of sexual assault\nAnd rape as a tool in war is obviously a huge thing but you have to also remember that these women go back to their tried to go back home a lot of their family shunned them because of cultural sensitivities to such things and so\nTheir lives are essentially up ended by this their families a lot of times don't take them back home a lot of these women were impregnated I'm as a result of this and\nHad to really know where to go because they were single mothers which in Iraq is is just\nCompletely a taboo and so you know it's something that you should raising awareness for this was something really really important and you had a lot of people on the ground in Iraq [noise] trying to educate these families that this is not of no fault of the women that they had no say in the matter but obviously you know changing cultural perceptions it's it's it's an uphill battle\nA lot of these women were impregnated I'm as a result of this and had to really know where to go because they were single mothers which in Iraq is is just\nCompletely a taboo and so uh you know it's something that you should raising awareness for this is something really really important and you had a lot of people on the ground in Iraq trying to educate these families that this is not of no false to the women that they had no say in the matter but\nObviously you know changing cultural perceptions it's it's it's an uphill battle and so this woman obviously I'm trying to do that and it's a it's it's worth the the know notoriety that she's getting\nLet's shift gears and talk about China vice president Mike Pence spoke yesterday accusing China of trying to sway American public opinion and undermined the Trump Administration\nTo put it bluntly President Trump's leadership is working in China wants a different American president there can be no doubt China is meddling in America's democracy David what is\nVice president Pence mean by meddling what do we know about what China actually is doing well it's it's pretty fascinating because he is appropriating the\nLanguage of the Russian attacks from on the twenty sixteen election and transferring it over to a different set of activities that the Chinese are are\nAnd China wants a different American president there can be no doubt China is meddling in America's democracy\nDavid what is vice president Pence mean by meddling what do we know about what China actually is doing well it's it's pretty fascinating because he is appropriating the language of the Russian attacks from on the twenty sixteen election and transferring it over to a different set of activities\nThat the Chinese are are involved in that there's no question that the Chinese have views cyber before in for political purposes but they largely haven't used it here they've used it in Taiwan they've used it\nSupport comes from ballet Tucson presenting their season opening gala and fall concert the new work to live banjo music from the twenties and thirties\nPerformances are October twelve through the fourteenth that theme of a college Center for the arts tickets are available at bally's Tucson dot ORG and support comes from the University of Arizona College of humanities\nPresenting the twenty Eighteen humanities festival secrets topical lectures panel discussions and events will be running now through October thirtieth\nTheir season opening gala and fall concert a new work to live banjo music from the twenties and thirties\nPerformances are October twelve through the fourteenth that theme of a college Center for the arts tickets are available at bally's Tucson dot ORG and support comes from the University of Arizona College of humanities\nPresenting the twenty Eighteen humanities festival secrets topical lectures panel discussions and events will be running now through October thirtieth learn more at humanities festival ... dot edu\n\nSupport for NPR comes from the station and from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nAnd from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract are located her aunt more information or at bona dot com\nAs promised let's get a brief update on the Supreme Court nomination of judge Brett Kavanaugh the Senate voted this morning to move his nomination\n\n\n\n\n\n\n\n\n\nTo support their allegations\nIncluding naming over two dozen witnesses ... unfortunately\nThe limited investigation that was conducted by the FBI failed to interview any one of the witnesses these two women identify who could support her a town\nThat was Senator Dianne Feinstein speaking on the Senate floor just a few hours ago of course the Ford and Ramirez she referred to our professor Christine Blasey Ford and Deborah Ramirez both of them have accused ... of sexual misconduct\nFeinstein was preceded by Senator Chuck Grassley the chairman of the Senate Judiciary committee who bemoan the process and slam Democrats for their treatment of the nominee\nWhat left wing groups and their democratic allies have done to judge Kavanaugh\nIsn't nothing short\nOf monstrous I saw what they did to Robert Bork\nI saw what they did to Clarence Thomas\nThat was nothing compared to what we witnessed here in the last three months\nWhen all was said and done Senator Lisa Murkowski Republican of Alaska was the only GOP member to vote no\nAnd their democratic allies have done to judge Kavanaugh\nIsn't nothing short\nOf monstrous I saw what they did to Robert Bork\nI saw what they did to Clarence Thomas\nThat was nothing compared to what we witness here in the last three months\nWhen all was said and done Senator Lisa Murkowski Republican of Alaska was the only GOP member to vote no on advancing to the ... vote Senator Joe Manchin a Democrat from West Virginia was the only Democrat to vote yes\nSenator Susan Collins Republican from Maine voted yes but said she would announce her decision on a big vote later today that vote is expected to happen this weekend you'll find full coverage of that here on your NPR member station and online at NPR dot org\nBefore we get back to the round up a quick heads up and the much needed diversion from the news of the day this month's meeting of the one a movie club is next week\nThis time we're watching one of the most hotly anticipated movies in Hollywood the latest remake of the classic romance a star is born now this movie has already been made three times in Nineteen thirty seven Nineteen fifty four in Nineteen Seventy six now Bradley Cooper\nNPR dot org before we get back to the round up a quick heads up and they much needed diversion from the news of the day this month's meeting of the one a movie club is next week\nThis time we're watching one of the most hotly anticipated movies in Hollywood the latest remake of the classic romance a star is born now this movie has already been made three times in Nineteen thirty seven Nineteen fifty four in Nineteen Seventy six\nNow Bradley Cooper stars in an directs this version alongside Lady Gaga has a hard drinking musician who falls in love with a young singer a star is born just debuted we will review it this coming Wednesday if you go see it send us your review how many stars out of five would you give the movie and why\nLeave us a voice mail eight five five to three six one a one a weed especially love to hear from you movie buffs who've seen any or all of the previous versions how does this one compare\nEight five five to three six one a one a or use our app won a vox pop to send us a radio quality audio file we will review a star is born spoilers and all this Wednesday on one day\nBack now to the round up with Vivian ...\nOne a one a weed especially love to hear from you movie buffs who've seen any or all of the previous versions how does this one compare\nEight five five to three six one a one egg or use our app won a vox pop to send us a radio quality audio file we will review a star is born spoilers and all this Wednesday\nOn one day back now to the round up with Vivian ... and David Sanger let's talk about Iran\nAfter the Trump Administration abandoned the nuclear deal that was negotiated during President Obama's tenure and reimposed sanctions Iran took us to court the international court of justice to Akron argue that the u._s. actions violated the terms of the Nineteen fifty five treaty of ...\nWell the Trump Administration hit back this week\nSecretary of state Mike Pompeo announced on Wednesday that the U.S is ending that treaty\nIs a decision frankly that his thirty nine years overdue in July around brought in Marilyn's case and the international court of justice alleging violations of the treaty of amity or on six to challenge the United states' decision deceased participation in the Iran nuclear deal and to reimpose the sanctions were lifted as ...\n... well the Trump Administration hit back this week secretary of state Mike Pompeo announced on Wednesday that the U.S is ending that treaty this was the decision\nFrankly that his thirty nine years overdue\nIn July around brought in Marilyn's case and the international court of justice alleging violations of the treaty of amity or on six to challenge the United states' decision deceased participation in the Iran nuclear deal and to reimpose the sanctions were lifted as part of that deal\nAre always attempted interfere with the sovereign rights of the United states to take a waffle actions necessary to protect our national security and the rod is abusing the icy Jay for political and propaganda purposes\nThat was secretary of state Mike Pompeo speaking on Wednesday Vivian salami some have said that ending this treaty is largely symbolic or is that so\nYeah it is an unknown and a lot of ways I think um in general it's more just I'm reinforcing the administration says standing efforts to withdraw from the Iran nuclear deal and um crackdown on Iran and kind of show that they're not messing around and so\nI'm basically this was just one more step in that process but as far as any real uh changes on like that\nThis treaty is largely symbolic or is that so\nYeah it is an unknown and a lot of ways I I think um in general it's more just I'm reinforcing the administration says standing efforts to withdraw from the Iran nuclear deal and um crackdown on Iran and kind of show that they're not messing around and so\nI'm basically this was just one more step in that process but as far as any real uh changes on the ground it really doesn't do much it's really just our sponsor\nTo on the international court of justice says ruling a that essentially said that sanctions that they re imposing sanctions um we're not fair to Iran\nMy re step back for just a second what is this treaty of amity [noise]\nUh I'm sure that was a question if the state department I just have this vision of some low level staff are going through the basement looking treaty or am I think it's really um family\nAs I could result think through what we've heard about this the the big acronym of Jaycee peel away the Iran nuclear deal but what is this treaty of Amman well\nIn Nineteen fifty three the U.S helped orchestrated a coup in Iran bringing the shah of Iran back to power\nIf they were us and Iran were buddy\nVision of some low level staff are going through the basement looking treaty or am I think it's really damage\nCan result things through what we've heard about you know is that the big acronym to J. C. P. away the Iran nuclear deal but what is this treaty\nA mammoth well in Nineteen fifty three the U.S help orchestrate that coup in Iran bringing the shah of Iran back to power or if they were us in Iran where buddy buddy at that time and so two years later\nIt's yeah you brought me back to power shirt treaty of amnesty great and they were indeed good friends from fifty three until\nThe Seventy nine revolution this is the shah who was deposed in these lemon revel in the Islamic Revolution of ... Seventy nine so for thirty nine years uh there has been no enmity between us and Iran\nUm this again seems very symbolic I'm just a last little relic that somehow didn't get shredded after the the the revolution and Seventy not\nIt was the last hurrah of Kermit Roosevelt grandson of Theodore Roosevelt CIA operative who almost singlehandedly staged this coup and then they got everybody we put in power to go sign the treaty port Kermit he's getting no respect in this state\nUm this again seems very symbolic I'm just a last little relic that somehow didn't get shredded after the the the revolution Seventy nine\nIt was the last hurrah of Kermit Roosevelt grandson of Theodore Roosevelt CIA operative who almost singlehandedly staged this coup and then they got everybody we put in power to go sign the treaty port Kermit he's getting no respect in the state department these days are\nMales name is Carmine Roosevelt that I'm taking it I I liked that name for for a man who had such a place in history Kermit Roosevelt and I know where the American David ... is there any real effect in terms of\nThe sanctions the consequences to the U. S. for refusing to lift them if this treaty of him it's he is more symbolic where might there be more tangible impact\nThe so the tangible impact is November when President Trump has said that he will impose the full\nSanctions on Iran He's given allies warning that this is coming and those sanctions if he does it as he his pronounce would say to any ... company around the world but particularly European companies if you do business with Iran you're not doing business with the United states and its\nWhere might there be more tangible impact\nSo the tangible impact is November when President Trump has said that he will impose the full sanctions on Iran He's given allies warning that this is coming\nAnd those sanctions if he does it as he has pronounced would say to any ... company around the world but particularly European companies\nIf you do business with Iran you're not doing business with the United states and it's an effort to choke off the Iranians\nBy making the big aircraft makers Boeing's ready pulled out the big um oil a production equipment makers all get out of Iran and they were doing that what's happening now though is that the ... the Europeans are saying we're going to find a mess it\nTo buy oil from Iran without clearing it in dollars so that the u._s. can effect that with the sanctions\nAnd a number of us went up and met a with the Iranian foreign minister when he was at the un ah last week and he made an argument to us was Saturday evening\nThat he believed that this method was going to come together so we're heading toward a conflict between the U.S and its European allies over on do we have a sense of ...\nFrom Iran without clearing it in dollars so that the u._s. can effect that with the sanctions\nAnd a number of us went up and met a with the Iranian foreign minister when he was at the un ah last week and he made an argument to assess who Saturday evening\nThat he believed that this method was going to come together so we're heading toward a conflict between the U.S and its European allies over on\nDo we have a sense I think I feel like the the big issue really is Iran's nuclear program and the argument from the other nations who are still signatories to this this deal the Iran nuclear deal\nIs that it's it's not perfect but it's good and that it has done something to impede Iran's ability to develop a nuclear weapon do we have a sense of where we stand in that regard setting the economic stuff aside for a moment just this put us any closer on that path\nNuclear weapon do we have a sense of where we stand in that regard setting the economic stuff aside for a moment just this put us any closer on that path or we still kind of in a holding pattern me what is was outlook\nSupport comes from the scene Philips and the hills celebrating the feast of St Francis at the CDC\nWith the blessing of the animals at eleven AM Saturday October six including pet adoption information and pet food drive saint Jill ups in the hills is at Campbell in river learn more at St Philips Tucson dot ORG\nAnd support comes from the UAE colleges social and behavioral sciences their music plays an identity lecture series is on third arm Thursdays in October at six thirty at the box theater this week exploring cultural blending in music learn more STDs downtown ... Arizona dot edu\nTwo female scientists have been added to the ranks of Nobel laureates this week and we'll talk with one of them I'm Ira Flatow and this is science friday [noise]\nThey didn't the first time that two women had been awarded the Nobel Prize for physics and ...\nBeing in music learn more SPF downtown dont Arizona dot edu [noise]\nTwo female scientists have been added to the ranks of Nobel laureates this week and we'll talk with one of them I'm Ira Flatow and this is science friday [noise]\nIt is the first time that two women had been awarded the Nobel Prize for physics and chemistry and the same year one winner Dr Francis Arnold joins us to talk about what the future holds for other potential female prize winners\nPlus a wind power is a growing source of green energy but a new study says numerous wind farms might actually boost local temperatures and finally climate change in sexual assault among the most efficient topics of our time\nMathematician Eugene Chang says two arguments that disagree can still both the logic\nLeaves town how\nSome answers your questions coming up after the break stay with [noise]\nLine from NPR News in Washington I'm Luis kids on the nomination of Brett Kavanaugh Supreme Court is now on track for a final Senate though probably\nSix of our time mathematician Eugene Chang says two arguments that disagree can still both the logic\nLeaves town how some answers your questions coming up after the break stay with [noise]\nLine from NPR News in Washington I'm Louis skills on the nomination of Brett Kavanaugh to the Supreme Court is now on track for a final Senate vote probably sometime this weekend on this vote the yeas are fifty one\nThe nose are forty nine the motion is agreed to ... the majority yes low down on the procedural question the Senate will now continue to the final confirmation decision NPR's Scott Detrow has more\nIt was a party line vote with two exceptions Alaska Republican Lisa Murkowski voted no in West Virginia Democrat Joe Manchin voted yes\nSenators can still change their minds ahead of the final up or down vote in fact Maine Senator Susan Collins a Republican since ... may not be final and she'll announce her ultimate decision later today in a speech on the Senate floor\nThe final vote will likely be held Saturday but it could be pushed to Sunday if Collins is a no Montana Republican Steve Gaines won't be available to vote tomorrow because his daughter is getting married\n\n\n\n\n\n\nCain Florence but the unemployment rate which is calculated from a separate survey still drop by two tenths of a percentage point to just three point seven percent what else economist Kevin Hassett says the jobless rate hasn't been this low since Nineteen sixty not\nIt really has us puzzling with our puzzlers here about how low the unemployment rate really can go\nMany employers complain it's getting hard to find all the workers they need but so far that has not produced a big spike in wages average hourly wages in September were up by modest two point eight percent from a year ago Scott Horsley NPR News the White House\nThe Nobel Peace prize this year goes to a Congolese doctor and an Iraqi woman who are working to end the use of sexual violence as a weapon of war the arteries Dr ... and not him around ... survivor of kidnapping and rape\nWho escaped to tell the world the story of girls and women like herself\nUnited Nations secretary general Antonio good cherish applauded the decision of the Nobel Committee\nHigh owner to lay not your mood a\nDoctor venues where\nAll these is when the steam Nobel Peace prize in defending the victims of sexual violence costly for\nRod ... survivor of kidnapping and rape who escaped to tell the world the story of girls and women like herself United Nations secretary general Antonio good cherish applauded the decision of the Nobel Committee\nOwner too it's not your mood of\nVenues for\nBeing on the swim team Nobel Peace prize in defending the victims of sexual environments you can call me for every hour shift\nBows on a reserve are the first from their countries Democratic Republic of Congo and Iraq\nTo receive the Nobel Prize Dr ... says his dedicating his award to all women affected by sexual violence Wall Street at this hour of the doubt down two hundred and thirty points this is NPR\nFrench authorities have launched launched an investigation into the disappearance of the president of the international police organization Interpol it's based in France NPR's Eleanor Beardsley reports the officials wife told authorities she had not heard from him a French judicial official who wishes\nTo remain unnamed confirmed to NPR than an investigation was open today after ... home weighs wife came to authorities over it\n\nFrench authorities have launched launched an investigation into the disappearance of the president of the international police organization Interpol it's based in France NPR's Eleanor Beardsley reports the officials wife told authorities she had not heard from him a French judicial official who wishes\nTo remain unnamed confirmed to NPR than an investigation was open today after making home weighs wife came to authorities overnight his wife says he disappeared during a trip to China and was last seen on September twenty ninth\nThe sixty four year old ... was elected president of Interpol two years ago his term runs until twenty twenty he lives in the ... with his wife\nFormerly ... with a vice minister of public security in China working to control narcotics who was also director of China's counterterrorism agency in a statement Interpol says the issue as a matter for authorities in France in China and that it will not comment further Eleanor Beardsley NPR News\nParis this famous American choir [noise]\nThe Mormon Tabernacle choir has a new name in keeping with the intention of the new president of the faiths you dropped in a Mormon church of\nJesus Christ of latter day saints has announced that the famous\nChina's counterterrorism agency in a statement Interpol says the issue as a matter for authorities in France in China and that it will not comment further Eleanor Beardsley NPR News\nParis this famous American choir [noise]\nThe Mormon Tabernacle choir has a new name in keeping with the intention of the new president of the faiths you drop the name Mormon church of Jesus Christ of latter day saints has announced that the famous gospel singing group will now be called the Tabernacle choir at Capitol square\nChurch president Russell Nelson announced guidelines in August for people to stop using more men or LDS substitutes for the church is full name\nThose names had been used in and braced for generations by members of that face on Louis ... NPR News\nWashington support for NPR comes from NPR stations\nOr their contributors include the library of Congress with the national library service for the blind and physically handicapped a program that offers thousands of books for all ages in audio and ... more at one eight hundred three hundred six thousand\nNPR News Washington support for NPR comes from NPR stations\nOther contributors include the library of Congress with the national library service for the blind and physically handicapped a program that offers thousands of books for all ages and audio and braille format more at one eight hundred three hundred six thousand\nWelcome to science friday on NPR eighty nine point one support comes from eagle sense sustainable landscapes\nSeeking to help create resilient landscapes for the Sonoran Desert ... specializes in rainwater harvesting organic maintenance and wildlife friendly arid plant design learn more an eco sense easy dot com [noise]\nThis is science friday I'm Ira Flatow a bit later in the hour how we can use logic to navigate their way through every day arguments\nDivision of political issues with a little help from mathematician Eugene Chang but first this week one of those rituals of science the early morning wake up call from Stockholm to a handful of researchers whose work\nThis is science friday I'm Ira Flatow a bit later in the hour how we can use logic to navigate their way through everyday arguments\nDivision of political issues with a little help from mathematician Eugene you're chasing the first this week one of those rituals of science the early morning wake up call from Stockholm to a handful of researchers whose work\nHas changed their fields joining me now to talk about the prizes and others like Detroit subjects in science is Sarah Kaplan science reporter at the Washington Post welcome back\nThanks gets beer nice to have your ... let's walk through the Nobel we're planning a to speak with chemistry Nobel front a Nobel is Francis Arnold later this hour but briefly what did you win for\nShow a doctor or not and two other researchers George Smith and Gregory Winter where where did the chemistry Nobel for their work on directed evolution so this is basically one person called it applying the principles of Darwin in a test to taking advantage of natural selection\nAnd using it to um kind of direct bacteria or virus as to produce molecules that can be used for all kinds of peaceful purposes whether it's making antibodies or biofuels or drugs ...\nYeah so a doctor or not and two other researchers George Smith and Gregory Winter were awarded the chemistry Nobel for their work on directed evolution so this is basically one person called it applying the principles of Darwin in a test tube taking advantage of natural selection\nAnd using it to um kind of direct bacteria or viruses to produce molecules that can be used for all kinds of useful purposes whether it's making antibodies or biofuels or drugs\n... I'm a chemistry Pulitzer Prize was split with two other researchers right Stuart Smith and Gregory Winter and what to what they win for [noise]\nSo they both work on a this technique called phage display which harnesses bacteria phages they're viruses that infect bacteria\nUm and it's kind of a ... the similar principle where you're taking advantage of these living systems to produce useful molecules proteins and antibodies that have all kinds of biological and medical applications ... what about physics\nSo in physics the a prize was awarded to three researchers who work with lasers a pretty cool [laughter] I'm Arthur Ashe skin dried Murrow and Donna Strickland 'em and they basically not just use lasers but use lasers as tools so asking um develop this technique called optical tweezers where he basically\nThese living systems to produce useful molecules proteins and anti bodies um that have all kinds of biological and medical applications and what about physics\nSo in physics the prize was awarded to three researchers who work with lasers a pretty cool [laughter] I'm Arthur Ashe skin dried Morocco and John Strickland 'em and they basically not just use lasers but use lasers as tools so African um develop this technique called optical tweezers where he basically\nFigured out that when you point a laser this focused beam of light atmosphere ... object to the object is actually drawn towards the center of the beam and you can use that to manipulate\nThings as teeny as particles or as big as bacterial cells I've seen the tractor beams China yeah [laughter] it's a real life tractor beams and fortunately doesn't work on that large just need to keep the laser pretty focused but\nUm it's fun to think about [laughter] and I after winning a done a Strickland explained what amazed her most about the research\nThink quite late generation is just one of these remarkable things one color water any clear and come up short\nThe largest needle to keep the laser pretty focused but um it's fun to think about\n[laughter] and after winning a done a Strickland explained what amazed her most about the research\nQuite late generation is just one of these remarkable things one color water any clear anything and outcome was short and and it's just remarkable to sit there where it all those colored\nMore information is that green fields dot ORG [noise]\nAlso support comes from the east a restaurant with a menu the changes monthly beast October menu includes grilled sturgeon with rage celery root and ripe ... as well as a chocolate chip bread putting with hot chocolate and shaved sheep's milk cheese details at feast menu Don ... [noise]\nDiscovery more information is that green fields dot ORG [noise]\nAlso support comes from the east a restaurant with a menu the changes monthly beast October menu includes grilled sturgeon with braids celery root and rye flower ... as well as a chocolate chip bread putting with hot chocolate and shaved sheep's milk cheese details feast menu dot com [noise]\nUm I replied oh you're listening to science friday we're talking with Dr Francis Arnold recipient of the twenty the Nobel Prize in chemistry um [noise] hey ... a lot of people think you're a scientist but you were very proud of engineer are you not\nI Am tell us what the differences well I Love to build things I'd like to make new things that didn't exist before of course chemists do that as well they build new molecules\nSo we're we're blending together chemistry and engineering in evolution of new proteins\nHow do you build that I was watching a to a Ted Talk you gave it was quite fascinating and you talked about being able to sit down at a keyboard and type\nThe differences well I Love to build things I'd like to make new things that didn't exist before of course chemists do that as well they build new molecules so we're we're blending together chemistry and engineering in evolution of new proteins\nHow do you build that I was watching a to a Ted Talk you gave it was quite fascinating and you talked about being able to sit down at a keyboard and type out a recipe for some form of new genetic smell it out and and what a new gene comes back to you [noise]\n[laughter] yes it's really amazing has changed so much and the thirty years that I've been doing this\nSo that today you really can't type out a DNA sequence now whether it's a recipe is a different story and we can talk about that but you can type out a DNA sequence email it off to your favorite supplier of DNA and they will send you back in the mail that DNA\nYou you're saying that talk that I I Want to write new DNA what does that mean to you\nActually it's easy to write and you know DNA what's hard is composing it you'd think about it DNA is the code of life it's the product of almost four billion years of evolution\n\n\n\n\n\n\n\n\nBecause we don't understand how DNA encodes function\nRemember biology molecular biology is a brand new discipline it's been around the the structure of DNA was published in Nineteen fifty three so it's not been understood for but for a very short time\nAnd how DNA goes through all the complicated things of his cell and makes biological molecules in codes the ... the the the structure and functions of these biological molecules is a brand new field and we still don't understand those rules are so what\nYou mean then and what what do people mean in ... when you say\nAre the directed evolution of something what is that process me\nIt's just like breathing it's we've been breeding cats dogs race horses lab rats corn for thousands of years without really manipulating the DNA directly but now that we can\nSynthesize DNA and put it in a test tube I can go direct the DNA and\nCombined DNA from different sources different species I can dial in\nWell it's just like breathing it's we've been breeding cats dogs race horses lab rats corn for thousands of years without really manipulating the DNA directly but now that we can\nSynthesize DNA and put it in a test tube I can go direct the DNA and\nCombined DNA from different sources different species I can dial in levels of random mutations that can direct negotiations so I have control over the underlying DNA diversity and then I decide who goes on to parent the next generation\nAnd then how do you get a useful product that I'm about what's the next step [noise]\nSo you put the DNA into a microbe and they start reading it as if it were their own\nAnd a day in day than take the DNA and create the proteins that the DNA encodes\nThan I as the breeder of molecules so to speak I have to decide who is better than what I started with which one of those microbes makes a bitter protein and that's called good old fashioned analytical chemistry so are you take the DNA out of ...\nStart reading it as if it were their own\nAnd a day in day then take the DNA and create the proteins that the DNA encodes\nThan I as the breeder of molecules so to speak I have to decide who is better than what I started with which one of those microbes makes them better protein and that's called good old fashioned analytical chemistry so are you take the DNA out of that and feed it back and I do it all over again\nIt is it's sort of creating life in that sell as a new you're creating a new form of life or you're not [noise]\nWell I think that's probably exaggerating because life was there for me to work with were using the tools of biology to make new things I'm making new proteins they're not alive but they do do some things inside of cells\nBut you do you need the cell to help you make the ... [noise]\nWell actually so you don't have to have the self there's now very powerful systems where he can do everything from DNA to protein inside of a test tube with no cells at all\nAnd so uh where do you rent truly see this research going what is what is your ultimate goal here\n\n\n\n\n\n\n\n\n\nWe need in our daily lives from renewable resources without producing excess waste\n... I saw on you talked to said I have fun for us we molecules to have sex Oh yes I Do [laughter] [laughter]\nWell if you think about sex you have to wonder why nature would devise a to a a strange process and have all these half the population that doesn't carry the next generation\nSo there has to be some benefit to re combining your DNA with somebody else's and that benefit is the innovation that comes around if you we combined DNA you get progeny\nRe combined DNA dining coach something novel\n... she would get a phone call or two before we have to go let's go to an Adrian and Hamdan I Adrian\nHi this is a non and Hamdan um [noise] I grew up in Southeast Asia where my parents my cousin's everyone around me were just starting out their math or engineering my son who is about two and a half years old\nWhat I'm trying to figure out how to identify his mind said whether it's the towards chemistry sports um math so man\nBefore we have to go let's go to an Adrian and Hamdan I in June [noise]\nHi this is a mountain and hand that um [noise] I grew up in Southeast Asia where my parents my cousin's everyone around me were just starting out their math or engineering my son who is about two and a half years old\nWhat I'm trying to figure out how to identify his mindset whether it be towards chemistry sports um math so may not be completely relevant question but I Would love to hear your thoughts on this subject how to identify your kids\nOr younger generations um your skill sets that they can go towards chemistry or science physics\n[noise] did you know did you know what an early age Dr Arnold that you want to I\nI was lucky my fires the nuclear physicist and he always thought the girls could do math just as well as boys could so he never discourage me and I also had four brothers to compete with\nAnd I like being the winner [laughter] so I had a father who encouraged my natural tendency never discourage did and had plenty of people to compete with\nWell you know I hear this from so many scientists we've talked to over the years that they had a role model for men to her ...\nAnd he always thought the girls could do math just as well as boys could so he never discourage me and I also had four brothers to compete with\nAnd I like being the winner [laughter] so I had a father who encouraged my natural tendency never discouraged it and had plenty of people to compete with\nWell you know here there's from so many scientists we've talked to over the years that they had a role model mentor somebody could even be their parents who kept them or good kept alive or encourage their interest in science same thing for you it seems\nIt seems so and I miss my father he passed away two years ago but he would have loved this news\nMhm I'm a ... and he's the right to add to to answer the listener's call is there any way to identify any young age was talented\nIn science I think all children are talented ... and if they love it they will ask questions they will do it I think the most important thing is not to discourage someone ...\nHave a tweet from Sydney who says please ask what she knows about how instinct is encoded Indian example dogs urge to bury things\n[laughter] I Wish I knew but it's clear that\nAnd the young age was talented\nIn science I think all children are talented ... and if they love it they will ask questions they will do it I think the most important thing is not to discourage\nSomeone ... have a tweet from Sydney who says\nPlease ask what she knows about how instinct is encoded Indian example dogs urge to bury things\n[laughter] I Wish I knew but it's clear that many important behaviors are at least partially genetically encoded loyalty and dogs are so many interesting behaviors\nThat can be bred but we don't really understand what the genetic details of that are as we sequence more things and under ... and measure their properties will be using important and powerful tools like machine learning to peace out and to try to pull out what is that genetic\nBasis while you weren't you in his updated my and my last question and that is are there what tools would you like to see I mean I give you while you've got some money now from the Nobel right what kind of tools would you that don't exist would you like to have\nWell I Want to be able to measure important properties rapidly\nWe'll be using important and powerful tools like machine learning to peace out and to try to pull out what is that genetic basis\nWhile you weren't you in his updated my my last question and that is are there what tools would you like to see I mean I can be while you've got some money now from the Nobel right what kind of tools would you that don't exist would you like to have\nWell I Want to be able to measure important properties rapidly so that I can do this breeding faster I don't have\n... powerful enough tools to do that but I'm also interested in how do you use AI and machine learning to interpret the results of evolution to make it even faster than it is now\nI noticed on your Ted Talk you said that one of your great ambitions is to be invited to give the Ig Nobel awards be [laughter] you know we broadcast the eggs every year the day after Thanksgiving and we know mark Abrams pretty good so I think we can put any yeah you know might be able to put in a good word for you know\nBig Nobel Awards be [laughter] you know we broadcast the eggs every year the day after Thanksgiving and we know mark Abrams pretty good so I think we can put in yeah you know might be able to put in a good word for you know\nAnd support comes from the ... breakfast clubs ...\nAnd support comes from the ... the breakfast club serving breakfast daily featuring they're homemade pecan sticky buttons locally owned and operated the ... the breakfast club now offers for locations in Tucson including the newest location on will not just south of the street details at this be breakfast club dot com [noise]\nHigh today of eighty four degrees under mostly sunny skies and clear for tonight with a low uh fifty eight chance of rain over the weekend [noise]\nThis is science friday I'm Ira Flatow in a time of contentious dues indivisible political races Ken we have better conversations about the issues they get us most emotional talking about how a better understanding of logic\nLogic can help us talk and listen and maybe start to bridge some of those divides\nFifty eight chance of rain over the weekend [noise]\nThis is science friday I'm Ira Flatow in a time of contentious dues indivisible political races Ken we have better conversations about the issues they get us most emotional talking about how a better understanding of logic\nLogic can help us talk and listen and maybe start to bridge some of those divides or at least understand why we're disagreeing so passionately\nOur guest is Dr Eugene Chang mathematician a scientist in residence at the school of the art Institute of Chicago her newest book is the art of logic in India logical world and um [noise]\nWe want to hear from you as anyone's logic ever change your mind about something some some listeners phoning in first one Alex is from Chicago hey Ellen neighbor [noise]\nHey hey there you go ahead do or\nPreviously I find myself as a an aspiring feminist um and I had done so because my logic was that I really couldn't fully empathize with some of the issues that women face I'm at the mail um and I was met with that logic from\nSome listeners are pointing in the first one Alex's from Chicago hey I'll learn a neighbor [noise]\nHey there you go ahead so odd\nPreviously identified myself as a an aspiring feminist\nUm and I had done so because my logic was that I really couldn't fully emphasize with some of the issues that women face I'm as a male um and I was met with that logic from a coworker of mine who um had said you know\nAlex as a black male\nYou know you might be doing things that contribute to I'm white supremacist systems that you might do so knowingly or unknowingly but that doesn't necessarily make you no longer a an African American male in the same way um women or being a man who contributes to massage mystic systems knowingly\nWasn't necessarily make me I'm unable to tie identify as a feminist um it would just mean that I have to do more to aspire to um to contribute to feminist system and so I'm being able to see the fact that you know I can still be a male male experiences while existing ... feminist\nUm in identifying myself in such a way it really changed my mind I'm In the way I thought about that\nUm to contribute to permanent system though I'm being able to see the fact that I can still be a male male experiences while existing reminisced 'em and identify myself in such a way really changed my mind um and I thought about that\nThat's great thanks for calling that is great that very heartening\nIs is you know as part of the problem was that we don't see how we others see us\nI think that is part of the problem but I think a big problem is\nThat we often spend you know trying to defend our own points of view instead of trying to understand somebody else's points of view and we often focus on trying to change someone else's mind instead of trying to see that point of view and see what it's believed as he is and one thing I found very interesting in that the coolest experience is that\nIt was a great example of using some abstract structure to tap into the person's own experiences\nSo in a way I think the logic was used very cleverly using emotions as well to say let's find an analogous situation that this person will understand from their own experiences and then hope that they can translate that\nTo somebody else's analogous experience\nHave a tweet from James was supposed to me logical discussions do recall\nThat it was a great example of\nUsing some abstract structure to tap into the person's own experiences\nSo in a way I think the logic was used very cleverly using emotions as well to say let's find an analogous situation that this person will understand from their own experiences and then hope that they can translate that to somebody else's and out as experience\nI have a tweet from James who says to me logical discussions do require map it requires empathy empathy is caring enough to respect and their their view and listen to it is that emotional I don't know\nI agree I think that logic does not require math that logic is in a way parts of math\nThese things have poor as boundaries I mean we've constructed a lot of us official boundaries between subjects the bureaucratic purposes\nBut I Am a mathematician and from my point of view because I Am so deeply steeped in the discipline of mathematics I find that the full discipline of mathematics helps me\nWith logic in the real world I'm not saying that you have to be a mathematician in order to use logic and that's a good thing because I think everybody can use logic whether they're a mathematician or not\nWe'll talk about some from a current events or let's turn out to the artist topic in current events\nWell that's a whole other our whole lot of different\nParts of this argument that we can analyze starting with what we mentioned before about Rome definitions because all of the people who claimed to the principle of the presumption of innocence\nAnd the thing about the presumption of innocence I think is that it's technically for court cases and criminal trials\nAnd it's something that gets bandied around as a general principle but it's really a very specific principal and similarly the idea of freedom of speech is often bandied around as a general principle when in fact that's just about whether you can be in prison for things and things\nSo going on from the presumption of innocence\nThere is a paradox because some people say well we have to bring you pick someone innocence until that until that proved guilty\nAnd the thing is that if you have an accuser\nUndone accused personnel let's just say the accuser is a woman and the accused person is a man then what about the fact that we should also presumed a woman to be innocent until she has proved guilty of a false accusation and so then we have a ... because we can't actually hold the man on the woman both innocent at the same time because that causes a contradiction\nAnd mathematics and civil Sufi have studied paradoxes for a long time I studied ways to resolve paradoxes by shifting levels or finding that things are up to ...\nAs a woman and the accused person is a man then what about the fact that we should also presumed a woman to be innocent until she has proved guilty of a false accusation and so then we have a ... because we can't actually hold the man I'm the woman both innocence at the same time because that causes a contradiction\nAnd mathematics and philosophy have studied paradoxes for a long time and studied ways to resolve paradoxes by shifting levels or finding that things are to a different level and the thing is I think that we we can start with the axiom of\nPresuming the accused persons the innocence and then we can look up ... will that creates for us and what mathematics does all the time it starts with some basic assumptions and builds a logical will run out and then we look at that world and go what do we think of this world\nAnd so we can look at the world that we've created by presuming accused people to the innocence until proven guilty and I think what we should see is that we've created a world in which people know that they can get away with sexual assault because there is almost never actual evidence that can prove that it happened\nAnd if they know that they can get away with it that means that they will do it more and so we've ended up in a culture where sexual assault can it can happen does happen on happens all over the place because people know that they can get away with it\nBy presuming accused people to the innocence until proven guilty and I think what we should see is that we've created a world in which people know that they can get away with sexual assault because there is almost never actual evidence that can prove that it happened\nAnd if they know that they can get away with it that means that they will do it more and so we ended up in a culture where sexual assault can it can happen and does happen on happens all over the place because people know that they can get away with it so then the question is do we care about that\nAnd that becomes a question of false positives and false negatives so do we care that so many people are getting away with sexual assault all we more afraid of what some people are worried about which is that that will be false accusations and innocent men will be have their lives destroyed by a false accusation so\nHaving a false accusation um would be when somebody is innocence but is thoughts is accused of being guilty and the other way is when someone who's guilty but ... isn't proved to be guilty and so it left off\nAnd that's really about whether you were prioritizing the plight of victims of sexual assault or the the potential innocence of men and we have to have a discussion about that and about the fact that we have some help prioritizing the the ...\nIs that he's Asian um would be when somebody is innocent but is thoughts is accused of being guilty and the other way is when somebody is guilty but ... isn't proved to be guilty and so it left off\nAnd that's really about whether you were prioritizing the plight of victims of sexual assault or the the potential innocence of men and we have to have a discussion about that and about the fact that we have some help prioritizing the the men who might be accused\nWere prioritizing them over the thousands and millions of women who are suffering sexual assault over time and so the question is are we going to do anything about that\nSo the next problem is a a question of black and white thinking and this happens a lot wet people get into arguments in extremes on so many of our arguments at the moment ton divisive because we take extreme opposite positions instead of something more moderate in between\nI'm so there is a an argument's around saying something like um you are making everyone into a rapist or ... one that professor lung but said on his book that that we are ... just spin the bottle crimes as rape\nAnd that's taking a very black and white view of thinking that we're calling off\n... at the moment ... divisive because we take extreme opposite positions instead of something more moderate in between I'm\nSo there is a an argument's around saying something like um you\nAre making everyone into a rapist or what one that professor lung but said on his book that that we are characterizing just spin the both will crimes as rape\nAnd that's taking very black and white view of thinking that we're calling all forms of sexual assaults and harassment rape which is not what is happening there is a scale and there are things that are as bad as rape and there are other things that are bad but ... not as bad as rape\nWhich comes takes us to the issue of false equivalence is and strong person arguments where you can take that for ... and then you can declare well you're saying everyone has a rapist which is not what people are saying\nOr your ... some people say you're saying any woman should be able to destroy the life of any man just ... accusing him a sexual assault which again is a very extreme position that I don't think that anyone really is taking\n'em ... finally um that's the question of knowledge and ... hypotheses which comes off and scientific testing law where you have to decide what you'll default position\nAnd then you can declare it while you're saying everyone has a rapist which is not what people are saying\nYour ... some people say you're saying any woman should be able to destroy the life of any mind just by accusing him of sexual assault which again is a very extreme position that I don't think that anyone really is taking\nAnd finally um that's the question of knowledge and alternate hypotheses which comes up in scientific testing a little while you have to decide what you'll default position is and then to say you say\nThe absence of further evidence I'm going to take this default position and I'm going to wait until I found enough evidence to change my mind and the thing is that in\nA court case and the trial it's very important because we're going to punish somebody badly for something so before we do that we should be very sure\nThat they deserve to be punished whereas in the case of a Supreme Court appointments than what we're doing is we're giving something something very good and important\nAnd so we should be very sure that they deserve that very good and important thing and in that case one might argue that that that situation could be negated by one bad thing happening whereas in the case of a trial be we should nuke we should not punish somebody if there is some\n\n", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Tucson", "day": "05"}