{"month": "10", "state": "AZ", "station": "KUAZ", "content": "More information to the U.S presidents dot org\nComing up next our it's the pre recorded won a program we'll find out how new laws on drug pricing could impact you and your family Andrea Kennedy will be your local how they say is if team fifty K. U. easy you know one point one\nK. U. E. Z. FM in each to each his own and eight point nine key us F ... it's ten o'clock\nHow's your health care these days\nIf you're tired of waiting for Congress to improve it didn't look to your state house chances are it's getting things done\nFrom W. A. M. U. at NPR in Washington this is one [noise]\nIt says his team to the ... one K. U. E. Z. FM in each teaches on an eight point nine key us F ... here at his job it's ten o'clock\nI was your healthcare these days\nIf you're tired of waiting for Congress to improve it than look to your state houses chances are it's getting things done\nFrom W. A. M. U. and NPR in Washington this is one thing [noise]\nEither I'm Joshua Johnson today oh what an eight part three of our special series the state we're in\nHealth care is top of mind for many lawmakers especially in states that are fighting epidemic levels of opioids ... other states are rethinking Medicaid and whether low income people who could work should have to as a condition of their coverage and then there's the cost of prescription how do you know you're paying a fair price\nWe'll explore these and other health care issues and steak houses across the country and we love to hear from you what's your state government doing with health care and what would you like it to do [noise]\nComments on our Facebook page or tweet us ... won a\n\nFrom NPR News in Washington I'm Lakshmi Singh a joint Turkish instead\nAs a condition of their coverage and then there's the cost of prescription how do you know you're paying a fair price [noise]\nWe'll explore these and other health issues of big houses across the country and we want to hear from you what sure the government doing was healthier and what would you like it to do\nComments on our Facebook page for the last one [noise]\n\nLive from NPR News in Washington I'm Lakshmi Singh a joint Turkish and Saudi investigative team of searching the Saudi conflict and assemble turkey nearly two weeks after journalist ... entered the building and apparently never came out he is feared dead\nThe mystery surrounding the show ... whose columns have been critical of Saudi crown prince Mohammed bin Salman puts the Trump Administration in a highly sensitive diplomatic position with the U.S ally in the middle east NPR's Michel ... is traveling with secretary of state Mike Pompeo who is on his way to Saudi Arabia this hour to meet with the crown prince his father Washington\nPost columnist Jim ... show was last seen entering the Saudi constantly ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to cause Yogi Trump says he spoke by phone with ... on and is sending his secretary of state Mike Pompeo to Riyadh\nIn the middle east NPR's Michel ... element is traveling with secretary of state Mike Pompeo who is on his way to Saudi Arabia this hour to meet with the crown prince his father Washington\nPost columnist Jamal because she'll be was last seen entering the Saudi constantly ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to his Yogi Trump says he spoke by phone with ... and they're sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there\nThe cases draining us relations with Saudi Arabia though Trump has made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nShould President Trump ever make another Pocahontas dig against Senator Elizabeth Warren the lawmaker from Massachusetts will respond with a DNA test she has released the results which offers strong evidence that she has Native American heritage going back six to ten generations\nUntil now Trump never seem to believe warrants claim at his rallies he has mocked her as a fake Pocahontas or a markets deeply insulting to Native American groups several months ago in Montana he even better generous\nShould President Trump ever make another Pocahontas dig against Senator Elizabeth Warren the lawmaker from Massachusetts will respond with a DNA test she has released the results which offers strong evidence that she has Native American heritage going back six to ten generations\nUntil now Trump never seem to believe warrants claim at his rallies he has mocked her as a fake Pocahontas or markets deeply insulting to Native American groups several months ago in Montana he even better generous donation senator warns favorite charity if she could prove them wrong I won't\nA million dollars for your favorite charity\nIf you take the tests that it shows you earn it\nOn his way to Florida this morning President Trump told reporters\nHe never said that the president\nAnd first lady Melania Trump are in Florida this our viewing hurricane recovery work NPR's Quil Lawrence reports from the Florida Panhandle hundreds of people are still in shelters\nCharge and chainsaw or in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative about when the lights might come back on\nThere is no cell phone signal and much of the region locals have been getting tips from radio stations about where they\nReviewing hurricane recovery work NPR's Quil Lawrence reports from the Florida Panhandle hundreds of people are still in shelters\nCharts and chainsaw or in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative\nWhen the lights might come back on there's no cell phone signal in much of the region locals have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle from all over the state Quil Lawrence NPR News Miramar Beach Florida\nThe Dow is up twenty nine points to twenty five thousand three hundred sixty nine an as that goes down twenty seven asked him he's off one this is NPR [noise] it's a desperate seeing this hour in South west France flash\nFloods have killed at least ten people\nNPR's Eleanor Beardsley reports five months worth of rain fell in five hours overnight swelling rivers into raging Torrance\nTelevision is showing footage of waters coursing through towns and villages with only the tops\nNine than as that goes down twenty seven as some he's off one this is NPR\n[noise] it's a desperate seeing this hour on south west France flash floods have killed at least ten people NPR's Eleanor Beardsley reports five months worth of rain fell in five hours overnight swelling rivers into raging Torrance\nFrench television is showing footage of waters coursing through towns and villages with only the tops of cars visible\nThe heaviest flooding was in the area around the medieval walled city of ... where they owed river reached a level not seen since Eighteen Ninety One the waters rose so quickly that many people were stranded on their rooftops and had to be rescued by helicopter\nAt least one elderly person who couldn't make it to the second story of his house drowned\nIn some places a river rose by more than twenty feet and floodwaters were too powerful for the emergency services to get through even in boats today schools are closed and people are being urged to stay inside the French prime minister has gone to visit some of the devastated towns Eleanor Beardsley NPR News Paris\nSears is filing for chapter eleven bankruptcy protection the company says it will start holding liquidation sales and we'll close in additional one hundred forty two\nPlaces a river rose by more than twenty feet and floodwaters were too powerful for the emergency services to get through even in boats today schools are closed and people are being urged to stay inside the French prime minister has gone to visit some of the devastated towns Eleanor Beardsley NPR News Paris Sears is filing\nFor chapter eleven bankruptcy protection the company says it will start holding liquidation sales and\nWe'll close an additional one hundred forty two stores before the end of the year [noise]\nSears has been plagued by declining sales and growing debt the more than a century old institution is the latest in a string of traditional retailers struggling to compete in an increasingly online retail world\nUs stock slightly mix this hour the Dow is up forty seven points to twenty five thousand three eighty seven the NASDAQ as down Nineteen points in the S. and P. as up now a fraction this is NPR\nSupport for NPR comes from the three audio tree powering enterprise digital transformation with artificial intelligence predictor of analytics an eye on these illusions learn more at sea three I O T dot AI and the ... foundation at ... dot org\nTwenty five thousand three eighty seven the NASDAQ has down Nineteen points in the S. and P. is up now a fraction this is NPR\nSupport for NPR comes from the three audio tree Powell ring enterprise digital transformation with artificial intelligence predictor of analytics an ... solutions learn more see three I O T dot AI and the ... foundation at ... dot org\nA very good morning to you it is six minutes after ten o'clock on this Monday morning here at NPR eighty nine point one\nFor our support comes from the University of Arizona College of humanity presenting the twenty Eighteen Tucson humanities festival secrets tropical lectures panel discussions and events school one from now through October thirtieth learn more at humanities festival dot Arizona dot EDU\nIn midtown right now sixty six degrees we have a slight chance of rain in the forecast high today have Seventy four good morning I'm Andrea Kennedy ... Johnson in Washington\nIn midtown right now sixty six degrees we have a slight chance of rain in the forecast high today Seventy four good morning I'm Andrea Kennedy ... Johnson in Washington [noise]\nNear the Idaho State capital has been the site of multiple demonstrations aimed at expanding Medicaid in July protesters turned him enough signatures to put Medicaid expansion\nOn next month's ballot Lauren ... is with the advocacy group Idaho voices for children she told ... TB television why she supports this legislation\nAnd how much have pretty much given up hope that we are going to our health care problem and I don't like later and they got the cat [noise]\nIdaho was one of four states that will vote on Medicaid expansion next month many people have expressed frustration at the federal government on health care and are looking to state governments for change and that is our focus for part three of our special series this state we're in a deep look at the bills in ballot initiatives dominating the debate in state capitals\nDozens of red and blue states have passed laws aimed at lowering prescription drug costs and addressing the opioid crisis\n[noise] Idaho was one of four states that will vote on Medicaid expansion next month many people have expressed frustration at the federal government on health care and are looking to state governments for change and that is our focus\nFor part three of our special series this state we're in a deep look at the bills and ballot initiatives dominating the debate in state capitals\nDozens of red and blue states have passed laws aimed at lowering prescription drug costs and addressing the opioid crisis many voters will also face ballot initiatives on expanding Medicaid on medical marijuana or other health measures\nIf these are pressing issues where you live we'd love to hear from you so email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one ...\nJoining us in Studio to talk about these trends is read Wilson national correspondent for the hill read welcome back to what ... what we also welcome back Julie Rovner chief Washington correspondent for Kaiser Health news she's also the host of the podcast what the health\nAnd the author of health care policy and politics a to Z Julie thanks for making time for thanks for having me I feel like every time I say the name of that podcast I have to pronounce it really really carefully wanting to help you get it just try and Scott Greenberg or executive editor of state line which is a journalism project of the ...\nThe hill read welcome back to what I was we also welcome back Julie Rovner chief Washington correspondent for Kaiser Health news she's also the host of the podcast what the health\nAnd the author of health care policy and politics a to Z Julie thanks for making time for us thanks for having me I feel like every time I say the name of that podcast I have to pronounce it really really carefully what the hell you did it just try\nAnd Scott Greenberg or executive editor of state line which is a journalism project of the Pew Charitable trusts Scott welcome thank you so much Julie let me start with you and we'll start with Medicaid expansion we want to go through a bunch of different kinds of legislation over the course of this conversation\nBut we'll start with Medicaid first of all just give us the basic remind us what Medicaid expansion me\nWhen the Affordable CARE Act was passed in twenty ten every state was supposed to expand Medicaid the idea was that for um middle income people there would be subsidies to help them buy private insurance\nAnd for lower income people and extended that all the way up to a hundred and thirty eight percent of poverty I'm about sixteen thousand dollars a year those people were supposed to get Medicaid for the first time you could get Medicaid if you just had a low income you didn't have to be\nI'm pregnant or child or a senior citizen or someone with a disability a and it went to the Supreme Court and the Supreme Court to every\nState was supposed to expand Medicaid the idea was that for um middle income people there would be subsidies to help them buy private insurance\nAnd for lower income people and extended that all the way up to a hundred and thirty eight percent of poverty I'm about sixteen thousand dollars a year those people were supposed to get Medicaid for the first time you could get Medicaid if you just had a low income you didn't have to be\nI'm pregnant or child or a senior citizen or someone with a disability a and it went to the Supreme Court and the Supreme Court to everybody's surprise said um this is going to be voluntary for the state\nAnd support comes from Arizona oncology were Dr Robert Jim provides cancer care in a community based setting information about Medicare medical and radiation oncology multi disciplinary cancer care and cancer treatment options available in southern Arizona is at Arizona oncology dot com\nIn midtown right now sixty eight degrees are expecting a highest Seventy four with a chance of showers today\nSupport for NPR comes from\nDr Robert Jim provides cancer care in a community based setting information about Medicare medical and radiation oncology multi disciplinary cancer care and cancer treatment options available in southern Arizona is at Arizona oncology dot com\nIn midtown right now sixty eight degrees and we're expecting a highest Seventy four with the chance of showers today\n\nSupport for NPR comes from the station and from ultimate software dedicated to putting people first with cloud based solutions for HR payroll and talent management learn or an ultimate software dot com ultimate software people first\nFrom Rhodes Scholar and not for profit offering learning adventures for adults in natural settings across the country learned more at our oh a de scholar dot org slash retreats\nAnd from listeners like you who donate to this NPR station\nThis is one a I'm Joshua Johnson our series the state we're in continues today with a discussion of trends on health care law's was read Wilson of the hill Julie Rovner of Kaiser Health news and Scott Greenberger of state line glad to hear from some of you about where health care policy ...\nLearn more at R. O. A. D. scholar dot org slash retreats\nAnd from listeners like you who donate to this NPR station\n\nIs one a I'm Joshua Johnson our series the state we're in continues today with the discussion of trends on health care law's with read Wilson of the hill Julie Rovner of Kaiser Health news and Scott Greenberger of state line\nGlad to hear from some of you about where health care policy stands for you in terms of your overall politics Suzanne in Maryland wrote on our Facebook page\n... pie is trying to make my mother's Parkinson a preexisting condition health care policy is life or death for people and I will stand and fight Ben Jealous and Susan Turnbull have plans to make Maryland a leader on health care and I'm volunteering for a governor's election for the first time in my life\nSuzanne thanks for writing and we'd love to hear from more of you about what your state is doing with regards to health care policy how it affects you and whether it's got you more politically engaged than in the past comments on our Facebook page tweet us at one eight or email one a at W. A. M. U. dot org before we move on from Medicaid read\nI Do want to get your sense of kind of where this is going only one state Maine has approved for Medicaid expansion through that\nGovernor's election for the first time in my life\nSuzanne thanks for writing and we'd love to hear from more of you about what your state is doing with regards to health care policy how it affects you and whether it's got you more politically engaged than in the past comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org before we move on from Medicaid read\nI I Do want to get your sense of kind of where this is going only one state Maine has approved Medicaid expansion through the ballot box so voters in Maine voted for expanding Medicaid but the governor of Maine Paula page still refuses to do so\nHe talked about his opposition to expanding Medicaid during the morning talk show on W. veal AM radio back in July here's part of what means governors said\nOne thing I Know is nobody can force me to put the state in red ink and I will not do that to tell them to go to jail before I put the ... the state and read it and if that's the core tells me I have to do it then we're going to be going to jail\nThat's part of Maine Governor Paula page speaking back in July and I read ... telling voters I'd rather go to jail can kind of feel like he's telling voters to go to somewhere else but how much of his political feet or I mean has this kind of ... well a ... page is he\nForced me to put state in red ink and I will not do that so I tell them to go to jail before I put the state and read it and if that's the core tells me I have to do it then we're going to be going to jail\nThat's part of Maine Governor Paula page speaking back in July and I read ... telling voters I'd rather go to jail can kind of feel like he's telling voters to go to somewhere else but how much of his political feed her I mean how's this going to add\nA ... page is a he was sort of Donald Trump before Donald Trump was Donald Trump he uh ... what is the loud and and bombastic candidates in a one two races that uh\nUh he probably shouldn't have one in the political sending that you know main is a pretty liberal state and\nI came in to shake up the old order and that's what voters elected in foreign uh now he is refusing to follow the will of the voters I'm In the Medicaid expansion will happen in Maine at some point Paula pages turn out this year or the Democratic candidate is leading in most of the surveys that are that they're up there\nUm but it it has not happened yet and as a consequence of all the pages actions\nThere are thousands of people in in Maine who not only voted for this thing but voted for this thing and now don't have the health care that they that they need and and this is a it's a problem in Maine especially in a community is with us\nThe Medicaid expansion will happen in Maine at some point Paula pages turn out this year or the Democratic candidate is leading in in most of the surveys that are that that up there um but it it has not happened yet and as a consequence of all the pages actions\nThere are thousands of people in in Maine who not only voted for this thing but voted for this thing and now don't have\nThe health care that they that they need and and this is a it's a problem in Maine especially in communities that have been hard hit by things like climate change the lobster community in the in the northwest part of the state along the northern coast or is it has been pretty devastated and they work for very low wages in pretty dangerous jobs in\nA ... you would think that they would need that Medicaid expansion\nLet's shift gears and talk about the cost of prescription drugs an issue I think that everybody sooner or later has to grapple with now dozens of states pass laws this year the aim to get rid of this kind of gag rule it prohibits your pharmacist from discussing prescription drug prices with you\nWe spoke to one democratic state lawmaker about this and about why he introduced new legislation on prescription drug pricing\nI Am representative Ryan Patrick Kennedy I Am from the state of Rhode Island and I'm In my thirtieth year as a state representative\nDozens of states pass laws this year the aim to get rid of this kind of gag rule it prohibits your pharmacist from discussing prescription drug prices with you we spoke to one democratic state lawmaker about isn't about why he introduced new legislation on prescription drug pricing\nI Am representative Ryan Patrick Kennedy I Am from the state of Rhode Island and I'm In my thirtieth year as a state representative\nSo earlier this year representative Kennedy had this sinus infection a mild infection his doctor prescribed an antibiotic Kennedy went to a pharmacist that he'd known for a long time and the pharmacist told him that he paid the retail price of the ... paid the retail price of the drug and didn't pay with his insurance he would pay less\nWhen I went to my local pharmacist he told me I I Can't tell you that there might be another option for you that other option would have been not to use my co pay because the cost of the of the pills was so low it would've been cheaper for me to pay those out of pocket\nRepresentative Kennedy learned that the pharmacy had a contract with a company called a pharmacy benefit management company it handled its drug insurance plan that ... that prohibited the pharmacist from discussing\nI I Can't tell you that there might be another option for you that other option would have been not to use my co pay because the cost of the of the pills was so low it would have been cheaper for me to pay those out of pocket\nRepresentative Kennedy learned that the pharmacy had a contract with a company called a pharmacy benefit management company it handled its drug insurance plan that ... that prohibited the pharmacist from discussing this with customers\nKennedy and for the Democratic state lawmakers decided to introduce legislation that would ban the so called gag clauses and the bill had not passed\nWe wanted to make sure that Rhode Island does have that opportunity to speak one on one with their with their pharmacist and and learn what their their pricing options are because\nThe vet is consistently one of the big complaint so we hear from our constituents on a on a regular basis is how expensive drug costs have become\nSo Scott Greenberg and we heard from representative Kennedy about what's going on in Rhode Island how common are laws like the one that he's pushing ... how many states have passed laws like this will\nBe these gag or clauses are are pretty common and uh last year there were a over a dozen states\nThat is consistently one of the big complaint so we hear from our constituents on a on a regular basis is how expensive drug costs have become\nSo Scott Greenberg or we heard from representative Kennedy about what's going on in Rhode Island how common are laws like the one that he's pushing ... how many states have passed laws like this will\nBe these gag or clauses are are pretty common and uh last year there were a over a dozen states that [noise] excuse me took up legislation or\nHaving to do with these gag clauses um and actually just recently President Trump signed a bill outlawing these um gag clauses this was kind of low hanging fruit though of a\nOf a drug the drug price issue a I don't think anyone like these gag clauses but uh\nYeah that that will the let federal legislation and the state bills won't change the fact that many many people struggling to pay for the prescriptions they need and um it's a very complicated issue and there are many states are taking other other steps to try to rein in prices\nSince you mentioned the president's he signed two bills last week as you noted that were designed to lift these gang clauses on prescription drug prices here is part of what the president said\nThe no the lowest price active two thousand Eighteen and the patient right to know\nYeah that that will the federal legislation and the state bills won't change the fact that many many people struggled to pay for the prescriptions they need and um it's a very complicated issue and they're many states are taking other other steps to try to rein in prices\nSince you mentioned the president's he signed two bills last week as you noted that were designed to lift these gangs clauses on prescription drug prices here is part of what the president said\nIt's the no the lowest price active two thousand Eighteen and the patient right to know drug prices act and uh\nObviously based in the name you can tell that this gives people knowledge as to prices have different locations where to buy the drugs that will have an immediate impact to uh\nIt's called the law of supply and demand pretty simple but we didn't have that they didn't want to have that a lot of people didn't want to have that\nBut now we have it then it's going to really drive prices\nScott back up to the the bills that various states have signed on this California signed a few bills into law in this a few weeks ago governor Jerry Brown signed them and these are considered among the strongest of these laws in the country what do they do\nWell I think the what a lot of states are doing in California or as is often the case with this kind of progressive legislation is in is in the lead on this on California\n[noise] but now we have it and it's going to really drive prices Scott back up to\nThe bills at various states have signed on this California signed a few bills into law in this a few weeks ago governor Jerry Brown signed them and these are considered among the strongest of these laws and the country what do they do\nWell I think the what a lot of states are doing in California or as is often the case with this kind of progressive legislation is and that is in the lead on this on California is trying to reduce drug prices through transparency in other words they are\nAre requiring um uh the drug companies to be public about a price increases increases beyond a certain point in the idea\nIs that uh if these are made public that they'll sort of be shamed into into reversing some of these increases it's still too early to say though whether this is going to have the desired effect um nevertheless other states this year California passed its bill or in two thousand Seventeen and last year you had five\nMore states um Connecticut Maine New Hampshire Oregon in Vermont all passed a drug pricing laws that are similar to California so we'll see whether transparency is enough to reduce prices and then in addition to that um some states have tried to go even even further than that\nThe desired effect um nevertheless other states this year California passed its bill or in two thousand Seventeen and last year you had five more states um Connecticut Maine New Hampshire Oregon and Vermont all passed a drug pricing laws that are similar\nTo California so we'll see whether transparency is enough to reduce prices and then in addition to that um some states have tried to go even even further than that Massachusetts passed a bill that would've allowed a its Medicaid program\nTo exclude some drugs from the a formula or the the um [noise] uh the group of drugs that are available to Medicaid recipients and the idea was that this would give them some leverage when negotiating with a drug companies over prices\nIf they were able to exclude some FDA approved drugs and and as of right now Medicaid state Medicaid programs have to include all\nFDA approved drugs and their formula Larry the idea was that if they were able to exclude drugs that would give them leverage in negotiating on prices but the federal government shutdown that that effort by Massachusetts\nWant to make sure understand the argument for Massachusetts what they were trying to do anything you said the federal government shut that down so Massachusetts does not do this now right now for an hour an hour now but the ... it sounds like you're saying the argument is you know find out\nFDA approved drugs and and as of right now Medicaid state Medicaid programs have to include all FDA approved drugs in their formula or the idea was that if they were able to exclude drugs that would give them leverage in negotiating on prices but uh the federal government shutdown that that effort by Massachusetts\nI wanted me to understand the argument from Massachusetts what they were trying to do anything you said the federal government shut that down so Massachusetts does not do this now right now for an hour an hour now but the ... it sounds like you're saying the argument is you know find Massachusetts\nAnd you know Julie as the drug company I could say hey Julie this medication that we know is FDA approved is still too expensive and we're not going to just pay blanket leave for a medication we think it's too expensive so you have to keep negotiating or we're not going to we're not going to honor that part of the\nAnd our support comes from friends of pack FEMA animal care center shelters nearly Seventeen thousand homeless vets a year and it never turns away a bed in need information about supporting the friends of ...\nAnd our support comes from friends of fact he ... animal care center shelters nearly Seventeen thousand homeless vets a year and it never turns away a vet in need information about supporting the friends of ... animal care center is online at friends of the ACC dot O. R. G.\nIn a traffic note for you this morning we have a report of a collision on oracle road just south of Fort low you can use stone avenue or fair view to avoid that situation it's sixty nine degrees in midtown\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one in a\n[noise] from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com [noise]\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one in a\nFrom farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from the John D and Catherine T MacArthur Foundation at max found dot org\nBefore we continue a quick heads up about next Monday's installment of our special series the state we're in we'll focus on state trends in labor unions and collective bargaining public employee unions have been in the spotlight this year with teachers' strikes this spring and the Supreme Court decision this summer that affects collective bargaining\nHow is the labor movement doing in your state perhaps there are laws where you live that prevent people from organizing for better wages or working conditions or benefits\nTell us what's going on where you are leave us a voicemail eight five five to three six one a one day we also know there are thousands of hotel workers on strike across the country have you been\nAnd the Supreme Court decision this summer that affects collective bargaining\nHow is the labor movement doing in your state perhaps there are laws where you live that prevent people from organizing for better wages or working conditions or benefits tell us what's going on where you are leaving the voicemail eight five five to three six\nOne a one day we also know there are thousands of hotel workers on strike across the country\nHave you benefited from union membership or perhaps do you think that unions have too much power in your state\nTell us your story eight five five to three six one a one a or you can leave us a radio quality audio files through our app won a vox pop or series the state we're in continues next Monday on one day\nBack now to our conversation with read Wilson Julie Rovner and Scott Greenberg are still time to get in a few more of your questions and thoughts about state health care policy where you live one a at W. A. M. U. dot org Julie let's get to that question from months in law who tweeted isn't part of the reason Medicaid expansion didn't get as good support\nIs that it wasn't available as quote unquote GAP insurance for those whose employer plan has a high deductible\nOne day back now to our conversation with read Wilson Julie Rovner and Scott Greenberg are still time to get in a few more of your questions and thoughts about state health care policy where you live one a at W. A. M. U. dot org Julie let's get to that question from months in law who tweeted\nIsn't part of the reason Medicaid expansion didn't get as good support is that it wasn't available as quote unquote GAP insurance for those whose employer plan has a high deductible\nWell of course the people who have an employer plans with hijacked or our big problem in the lower income people of those have a particular large problem if you have many thousands of dollars in deductibles that you have to pay before your insurance kicks and\nThere are a couple of small demonstration programs where Medicaid has been able to uh basically fill in with employer insurance but generally Medicaid has sort of an all or nothing proposition you're either on Medicaid or you're off\nThe way the Affordable CARE Act was created with those people up two hundred and thirty eight percent of poverty we're supposed to get 'em medicated people between a hundred and thirty eight percent of poverty and two hundred and fifty percent of poverty get special discounts they don't have those big deductibles so it it and then over two hundred and fifty percent of poverty then you're sort of on your own\nI'm In Arkansas I might point out though another we've been talking about a lot of different program that they instituted\nKate is sort of an all or nothing proposition you're either on Medicaid or you're off\nThe way the Affordable CARE Act was created with those people up two hundred and thirty eight percent of poverty we're supposed to get 'em Medicaid people between a hundred and thirty eight percent of poverty and two hundred and fifty percent of poverty get special discounts and they don't have those big deductibles so it it and then over two hundred and fifty percent of poverty then you're sort of on your own\nI'm In Arkansas I might point out though another we've been talking about a lot of different program that they instituted was to help people who often who were right at that margin we're constantly shifting back and forth between Medicaid and private plant and basically what they would do is the state was allowed to basically buy them into the private plan so they wouldn't have to keep changing\nWhere two weeks sidebar for just a second let me the the point of this series this is talk about what states we're doing on big issues healthcare is a very big one it's one of the very first things that Donald Trump said he was going to act on when he became president repealing and replacing the Affordable CARE Act AK Obamacare\nThere are some people who feel like health care should be a national matter that every human being in the United states of America should have equally good planned\n... what's simple set of health care costs and there are other Americans who believe it should be left up to the states that every state has different kinds of needs and different issues and the needs to be versatility are we any closer\nVery first things that Donald Trump said he was going to act on when he became president repealing and replacing the Affordable CARE Act AK Obamacare\nThere are some people who feel like health care should be a national matter that every human being in the United states of America should have equally good planned what simple set of healthcare costs and there are other Americans who believe it should be left up to the states that every state has different kinds of needs and different issues and there needs to be versatility\nAre we any closer to one side of this argument winning or is the state federal split just kind of baked into the nature of this country like where is this where is this going Julie\nActually it's where it's going is back to where it was before the Affordable CARE Act what we're finding from all these sort of small incremental changes that the Trump Administration has done is that the the Affordable Care act was intended\nTo create more of a national floor if you will for health insurance states\nStill do an enormous amount of regulation of health care they always have the federal government has always been sort of the the junior partner to the states um but it had gotten so such a patchwork that it made huge differences which state you lived in what kind of healthcare you were able to get to the Affordable CARE Act was trying to say\nThere's a floor beneath which people won't fall that is slowly being chipped away and we're going\nTended to create more of a national floor if you will for health insurance states still do an enormous amount of regulation of health care they always have the federal government has always been sort of the\nThe junior partner to the states um but it had gotten so such a patchwork that it made huge differences which state you lived in what kind of healthcare you were able to get to the Affordable CARE Act was trying to say\nThere's a floor beneath which people won't fall that is slowly being chipped away and we're going sort of every month looking more and more like we did in two thousand nine before the Affordable CARE Act passed Scott do you get the sense of this means that the effort to repeal the Affordable CARE Act is kind of\nSucceeding that it is taking us back to where we were before him\nAs Julie said it is in some states but in states that want to go in a different direction again California Massachusetts states like that they are re instituting some of the uh parts of the Affordable CARE Act that the Trump Administration has and the Republican Congress have tried to undercut so for example\nA on the individual mandate the requirement that you have insurance um\nSo called association health plans which are these cheaper plans that do not a ... a offer all of the benefits that were mandated under the AC a some states are saying well whatever they're joined the federal level um insurance is regulated at the state law\nTo ... some of the uh parts of the Affordable CARE Act that the Trump Administration has and the Republican Congress have tried to undercut so for example a on the individual mandate the requirement that you have insurance\nSo called association health plans which are these cheaper plans that do not a ... offer all of the benefits that were mandated under the AC a some states are saying well whatever they are joined the federal level um insurance is regulated at the state level and if you're going to sell insurance in our state you are going to abide by these rules\nI'll tell you one issue read that states and many people have been hoping the federal government will act on and it's the it's kind of moved on anyway and that's dealing with medical marijuana it's on the ballot in some states again this year about twenty two states have already legalized pot for medical use some of legalize the recreational use\nVoters in Utah will choose whether to join the states or not and the political battleground seems to have shifted and I want to read if you see it this way for more traditionally liberal states into more conservative areas overtime or\nAnd it's not just the medical or that has gone that way but also legalization of recreational marijuana the two states where a legalization is going to be on the ballot this year is in Michigan in North Dakota a medical ... know for ... for recreational noted for in in\nUtah will choose whether to join the states or not and the political battleground seems to have shifted and I want to read if you see it this way for more traditionally liberal states into more conservative areas overtime\nOr yeah and it's not just the medical or that has gone that way but also legalization of recreational marijuana the two states where a legalization is going to be on the ballot this year is in Michigan in North Dakota\nA medical ... no for legal legal for recreational noted for in in on the medical side there are three different amendments in Missouri which is nice and confusing for the voters out there to try to figure out\nWhich is which are and then that Utah is as you say on the ballot Oklahoma already approved it this year so yeah we're we're not talking about the liberal coastal elites that are legalizing marijuana ah we're talking about a red America that is now dealing with this debate or it came up and you know in Florida last year and\nLast year two years ago but this is this is now a debate that I think it shows the shift in the political conversation around marijuana those sorts of people who approve of a marijuana legalization tend to be a older white males funny enough\nAnd then the millennial generation that the younger the basically the younger you are the more you in favor of\nA legalization you happen to be um\nWith this debate or it came up and you know in Florida last year and last year two years ago but this is this is now a debate that I think it shows the shift in the political conversation around marijuana those sorts of people who approve of a marijuana legalization tend to be a older white males funny enough\nAnd then the millennial generation that the younger the basically the younger you are the more in favor of\nA legalization you happen to be um the older white males the theory is that's the that's the sort of libertarian streak or they don't want the government regulating something that\nThey don't think the government has a hand in regulating and the real swing voters or perhaps not surprisingly come down to suburban women are in talking to the people who run campaigns for and against marijuana legalization or basically the battleground is a mothers who are worried that their kids are going to be exposed to marijuana\nSo you get the proponents are talking about the law enforcement uh ability and and the fact that it's not that this will not expand the market into younger people who will then have access to recreational marijuana and then you've got the opponents who say exactly the opposite that legalization will in fact\nUh begin to rope and a bunch of kids why are there three items in Missouri so they're all on the ballot from different ah proponents different sides of it\nWorried that their kids are going to be exposed to marijuana\nSo you get the proponents are talking about the law enforcement uh ability and and the fact that not that this will not expand the market into younger people who will then have access to recreational marijuana and then you've got the opponents who say exactly the opposite that legalization will in fact\nUh begin to rope and a bunch of kids why are there three items in Missouri\nSo they're all on the ballot from different ah proponents different sides of it with two of them are from a actual citizen groups that they put them on about those are amendment to an amendment three\nAnd then there's a proposition which if premise wrong I think the proposition goes on the ballot from the state legislatures that's going to be some kind of compromise or a piece that's proposition see 'em and they are all sort of competing with each other and this underscores another piece of\nThe evolution of of marijuana politics pots big business or in a lot of these states that have legalized Colorado Washington Oregon or California Nevada Alaska or Massachusetts and Maine\nAre the people who are setting up a ... who get to write these laws also essentially get to determine who's in the market um and who owns a very lucrative space one of the biggest opponents of recreational legalization in ...\nAnother piece of the evolution of of marijuana politics pots big business or in a lot of these states that have legalized Colorado Washington Oregon a California Nevada Alaska or Massachusetts and Maine\nAre the people who are setting up a ... who get to write these laws also essentially get to determine who's in the market um and who owns a very lucrative space one of the biggest opponents\nOf recreational legalization in a bunch of early states where the people who ran medical marijuana shops because they already have the monopoly right why dilute the monopoly with other people\nI should know by the way we did a program this year about state laws on marijuana and the business of pie you can find that on line at the one a dot org\nScott a couple of things to add to what to read said on this very interesting issue um at one is that it's sort of intersects with what we talked about earlier the opioid crisis because there are many people\nAre supporters of medical marijuana who argue that this is a viable alternative to uh to opioids for people who have chronic pain\nAnd then also I think we've written about this um it's interesting that social justice provisions are finding their way into marijuana bills or this idea that a a minority communities have been the most impacted by the war on drugs and therefore\nSex with what we talked about earlier the opioid crisis because there are many people\nAre supporters of medical marijuana who argue that this is a viable alternative to uh to opioids for people who have chronic pain and then also I think we've written about this um it's interesting that social justice provisions are finding their way into\nMarijuana bills or this idea that a a minority communities have been the most impacted by the war on drugs and therefore uh as we move towards legalization that makes sense to include in these bills provisions that uh\nBrexit and geopolitics this afternoon at three o'clock on marketplace and of course report on all the day's business news [noise]\nMostly sunny and breezy today high near Seventy four degrees we have a thirty percent chance of rain that goes up to Seventy percent tonight when it'll lead mostly cloudy and windy with alone you're fifty three for Tuesday partly sunny and Wendy high near Seventy degrees\nAnd forty percent chance of rain on Tuesday in midtown right now sixty eight degrees sixty three in Sierra Vista at eleven o'clock [noise]\nFor here and now comes from that weren't greeters of Matt Latin simulator\n[noise] when it'll we mostly cloudy and windy with alone you're fifty three for Tuesday partly sunny and windy high near Seventy degrees\nAnd forty percent chance of rain on Tuesday in mid town right now sixty eight degrees sixty three in Sierra Vista at eleven o'clock\nFunding for here and now comes from that work greeters of ... and simulate software accelerating the pace of engineering and science you learn more network dot com from NPR and W. B. or Boston I'm Jeremy ...\nRather young Syrian now coming up as President Trump visits hurricane ravaged Florida residents reflect on what they went through a motel owners Mexico beach sorry he didn't evacuate [noise]\nMonday recalled up each day he had so much stress is Bola sees it looks like we did the wrong thing I should just serve we did and he said it's been really good no these are\nAlso Sears filed for bankruptcy or are there lessons for Amazon and President Trump says I'm wrong killer in a conflict could be behind the disappearance of the Saudi journalist these stories and get ready for all the predictions about what's going to happen in the mid term but really how good are we in forecasting future in\nThe room with expert predictions so often it heads I win tails\nThey did so much stress is boise's it looks like we did the wrong thing and just er we did and he's been really good no these are\nAlso Sears filed for bankruptcy or the lessons for Amazon and President Trump says I'm wrong killer in a conflict could be behind the disappearance of the Saudi journalist these stories and get ready for all the predictions about what's going to happen in the terms but really how good are we in forecasting future in\nThe room with expert predictions so often get hit by wind pills you forget we had about coming up here and now [noise] the news is first\nLive from NPR News in Washington I'm Lakshmi saying President Trump and first lady Melania Trump or spending the next few hours in Florida in Georgia being briefed on the hurricane recovery Glenn air force base this afternoon Trump applauded what's been done so far off it just\nYour\nLast week hurricane Michael roared ashore in Florida's panhandle is a destructive category for storm with one hundred and fifty five mile per hour winds at level neighborhoods Mexico beach population of a thousand was nearly wiped out\nThe hurricane wrecked havoc in four states from Florida to Virginia it killed at least Seventeen people [noise]\nA team of Turkish in Saudi investigator\nYour\nLast week hurricane Michael roared ashore in Florida's panhandle is a destructive category for storm with one hundred and fifty five mile per hour winds at level neighborhoods Mexico beach population of a thousand was nearly wiped out\nThe hurricane wreaked havoc in four states from Florida to Virginia it killed at least Seventeen people [noise]\nA team of Turkish and Saudi investigators are searching the Saudi consulate in Istanbul, Turkey the scene of the disappearance Santa ledger murder of Saudi journalist earlier this month NPR's Peter Kenyon reports that officials continue to deny any involvement in a journalist disappearance\nIn the morning Turkish officials announced their intention to search the consulate as well as the Saudi consul general's residence and diplomatic vehicles but the search didn't begin until after dark\nTurkish investigators have claimed the journalist ... was killed inside the consulate on October second in his body disposed of\nSaudi officials reject the allegations investigators focused on the arrival of Fifteen Saudi used as stumble on the day 'cause she'll be disappeared them into part at the same day Saudi officials say 'cause Yogi left because within an hour of arriving but it provided no evidence to back up there\nVehicles but the search didn't begin until after dark\nTurkish investigators have claimed the journalist ... was killed inside the consulate on October second and his buddy disposed of\nSaudi officials reject the allegations investigators are focused on the arrival of Fifteen Saudis Istanbul on the day 'cause she'll be disappeared them into part of the same day Saudi officials say 'cause Yogi left because within an hour of arriving but it provided no evidence to back up the claim Peter Kenyon NPR News Istanbul\nThe Russian Orthodox church is breaking ties with the head of the global orthodox community\nAfter the accurate medical patriarch head of Constantinople decided to grant Ukrainian clerics independence from the church in Moscow for the first time in hundreds of years since Russia annexed Crimea from Ukraine in two thousand fourteen calls for the Ukrainian churches independence have intensified\nStrong winds and dry conditions have prompted Pacific gas and electric for the first time to shut off electricity for some of its customers to prevent wildfires in parts of northern California from member station ... in San Francisco Ted Goldberg has an update\nE has turned off power for some fifty nine thousand customers in three counties north of San Francisco and three other counties in the year\nThousand fourteen calls for the Ukrainian churches independence have intensify\nStrong winds and dry conditions have prompted Pacific gas and electric for the first time to shut off electricity for some of its customers to prevent wild fires in parts of northern California from member station ... in San Francisco tied Goldberg has an update\nPG E has turned off power for some fifty nine thousand customers in three counties north of San Francisco and three other counties in the Sierra foothills the proactive electricity shut offs live some school districts to cancel classes for the day\n... which is the largest utility provider in northern California says the move is in the interests of safety in a last resort due to extreme weather conditions\nThe national weather services wind speeds reached Seventy seven miles per hour or two locations in the northern part of the bay area on Sunday evening over the summer Cal Fire announce it ... electrical infrastructure cause at least a dozen fires in six counties last October\nFor NPR News I'm Ted Goldberg in San Francisco\nThe Dow Jones industrial average is up forty seven points that this is NPR News\nUs defense secretary Jim Mattis is on his way to Vietnam Michael Sullivan reports this as mad as his second visit this here met us visit\nEvening over the summer Cal Fire announce it PG nice electrical infrastructure cause at least a dozen fires in six counties last October for NPR News I'm Ted Goldberg in San Francisco\nThe Dow Jones industrial average is up forty seven points this is NPR News\nUs defense secretary Jim Mattis is on his way to Vietnam Michael Sullivan reports this has managed to second visit this year\nMadison visited communist Vietnam's capital Hanoi in January he's visiting the country's economic capital Ho Chi Minh city on this trip\nTo meet with his Vietnamese counterpart and visit a Vietnamese airbase Madison's trips bookend to visit by the U.S navy aircraft carrier Carl Vinson to the port city of ... in March it was the first such visit since the war and one that signal both sides willingness to grow military ties\nAs China continues construction on disputed islands in the south China Sea in June met us called out China for deploying surface to air missiles on some of those islands place there he said for the purpose of intimidation and coercion for NPR News I'm Michael Sullivan in Bangkok\n[noise] Stephen Hawking has more warnings for the world though it's been months since he died in his\nAnd when that signal both sides willingness to grow military ties\nAs China continues construction on disputed islands in the south China Sea in June met us called out China for deploying surface to air missiles on some of those islands place there he said for the purpose of intimidation and corps and for NPR News I'm Michael Sullivan in Bangkok [noise]\nStephen Hawking has more warnings for the world though it's been months since he died in his final book brief answers to the big questions unveiled a London launch event today hocking rights that education in science around the world are in greater danger than ever before\nLate physicist cites a global revolt against expert strong the example of President Trump's election and the u._k. is decision to leave the European Union speaking up the case attempt to divorce the European Union\nStill hinges on one of the thorny issues in the ... debate how to avoid a hard border between Arlen which is part of the EU and the u._k. is Northern Ireland Brexit talks stalled over the weekend\nI'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations\nTempted divorce the European Union still hinges on one of the thorny issues in the ... debate how to avoid a hard border between Arlen which is part of the EU and the u._k. is Northern Ireland Brexit talks stalled over the weekend I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nAnd good morning to you once again on this Monday six minutes after eleven here at NPR eighty nine point one\nWhere our support comes from the University of Arizona College of the humanities resenting the twenty Eighteen Tucson humanities festival secrets topical lectures panel discussions and events\nRuns now through October thirtieth learn more at humanities festival dot Arizona dot EDU in midtown right now it is sixty eight degrees good morning I'm Andrea Kennedy from NPR and W. B. U. R. I'm Jeremy hops amount than young it's here and now President Trump visiting the Florida Panhandle\n... of the humanities resenting the twenty Eighteen Tucson humanities festival secrets topical lectures panel discussions and events\nRuns now through October thirtieth learn more at humanities festival dot Arizona dot EDU in midtown right now it is sixty eight degrees good morning I'm Andrea Kennedy from NPR and W. B. U. R. I'm Jeremy ...\nAnd Robin Young it's here and now President Trump visiting the Florida Panhandle today to see the devastation left behind like hurricane Michael Charles Smith in what was the small town in Mexico beach is grateful for the attention and they help from FEMA\nAs you know by now Mexico's beaches quaint no high rise hotels so Michaels direct hit nearly wiped it out Charles Smith owns what's left of the Gulf view motel it was destroyed in fact he's in Alabama now that's how far he says he had to drive to find a place to take a shower\nCharles that we're so sorry for the destruction and also you state during the worst because you've been through hurricanes like open all so you didn't realize how bad Michael would be you must have been terrified\nYes ma'am very while I was going to die right before that it really it we'd had electric circuit TV\nIn fact in Alabama now that's how science says he had to drive to find a place to take a shower Charles we're so sorry for the destruction and also you stay during the worst because you've been to hurricanes like uncle so you didn't realize how bad Michael would be you must have been terrifying\nUh yes ma'am very I knew I was going to die or right before that it really hit we'd had no electric so I couldn't see the TV\nMonday recalled up he said but he had so much stress in his Boise is it looks like we did the wrong thing I said yes are we did\nAnd he said it looks like this is the I said Yes sir I said it's been really good knowing user oh wow then the phone lines went dead oh held on for a bit of grab all my cats and took him downstairs put him in one of my room because I figured the roof going to blow off the top\nOf the rooms the water started coming up under the door and around the side of the door\nNeighbor's house came through the front that I Try to get the cash out to put an end the stairwell but the water was too much I grab the oldest or not it would not move it would not there was too much water pressure\nMy cats and took him down stairs put them in one of my room 'cause I figure the roof gonna blow off the top when\nI was one of the rooms the water started coming up under the door around the side of the door\nNeighbor's house came through the front that I tried to get that cat out to put in in the stairwell but the water was too much I grab the oldest or not it would not move it would not there was too much water pressure than the wall started collapsed and I was able to get one door open\nI grab one of my cats just threw it in the office it went up to the top stairs I went back down for the other ones\nAre the doors slammed arming the water went up went\nFrom two feet to for\nTo flip me after the roof and I got sucked into the laundry room with the poor cat and then the fridge writer hit me because everything is ... you you take everything that floats and put it right about four feet where you're at and it's not standing still\nIsn't moving and it's a missile yep oh I got hit by\nBeds stoves 'cause I'm I'm a motel\nFor to float me after the roof\nAnd I got sucked into the laundry room with the poor cat and then the fridge raider hit me because everything is ... you you take everything that floats and put it right about four feet where you're at and it's not stand in steel\nIs moving missile yep oh I got hit by beds\nStoves 'cause I'm I'm a motel and I got kitchenette and my neighbors' houses floating\nIn my house I grabbed the cat I had I threw it in and they came in and suck me back out I was able to get back into the in the room number two\nAnd then they outside wall caved in we're not once I get a phone to fridge later 'cause it got ... got sucked in jammed into the ... the bathroom I was able to get back at ... onto the fridge right or I went to reach for my cat wall broke through and the cats just around the bad news is loaded out\nAnd support comes from beyond bread celebrating October with pretzels Brett pumpkin cranberry bread and hand decorated Jack o lantern cookies learn more on the Web that beyond bread dot com\nAnd support comes from beyond bread celebrating October with pretzels brats pumpkin cranberry bread and hand decorated Jack o lantern cookies learn more on the Web ad beyond bread dot com\nSome predictions about the mid term elections which are three weeks away that's coming up next on here and now\nIn midtown right now it's Seventy degrees in Sierra Vista sixty five at eleven twenty\n\nFunding for here and now comes from the listeners of WB water Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance available at Geico dot com or one eight hundred nine four seven auto\nThis this year and now the midterms are three weeks away and pundits and politicians are working hard to make predictions about how they'll turn out we often look for predictions tell us what will happen\nListeners of WB water Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance available at Geico dot com or one eight hundred nine four seven auto\nThis year and now the midterms are three weeks away and pundits and politicians are working hard to make predictions about how they'll turn out we often look for predicts just tell us what will happen in politics and the economy and technology and in other things but as the saying goes making predictions is hard especially about the future\nSo how do you do it well joining us now is Dan gardener who's the author of future babble and super forecasting the art and science of protection Dan welcome\nHi Jeremy so why is it that we humans always want to know what's going to happen in the future when it's really hard to do that in a lot of ways yeah uh it\nReally stems from a really fundamental need we have a need a psychologically rooted need for control a sense of control of our environment and what do you need for control of your environment you need to know you need to know what's happening now or if you're looking into the future you need to know what's going to happen and if you look into the future\nWe humans always want to know what's going to happen in the future when it's really hard to do that in a lot of ways yeah uh it\nReally stems from a really fundamental need we have a need a psychologically rooted need for control a sense of control of our environment\nAnd what do you need for control of your environment you need to know you need to know what's happening now or if you're looking into the future you need to know what's going to happen and if you look into the future\nAnd you've got important questions on your mind and all you see as a swirling vortex of uncertainty that's deeply disturbing you have to a race that uncertainty and one way that we erase uncertainty is by turning to experts in saying please tell me what's going to happen next\nWhen the experts that I think of when it comes to productions that get it pretty right at least in the not too distant future weather forecasters yeah I have an app that tells me in ten minutes it's going to start raining exactly where you are right now um but you know where are we good at it and where we bad at it\nWell it's interesting that you highlight weather forecasters because of course people tend to make jokes about weather forecasts as they always get things wrong yeah ... exactly the opposite in fact weather forecasting is the gold standard of forecasting now the big difference between the ...\nIn the not too distant future our weather forecasters yeah I have an app that tells me in ten minutes it's going to start raining exactly where you are right now um but you know where are we good at it and where we bad at it\nWell it's interesting that you highlight weather forecasters because of course people tend to make jokes about weather forecasters they always get things wrong yeah ... exactly the opposite in fact weather forecasting is the gold standard of forecasting\nNow the big difference between the weather forecasters in one of the reasons why they're so good\nAnd so many other domains is it the weather forecasters know how good they are and they know when they cannot do so many other demeans that's not true people use vague language like something's probably going to happen or that's pretty certain or there's a good chance that\nA and nobody keeps track they don't keep score and so if you look at\nThe big famous pundits who tend to dominate the news whether it's politics or economics or anything else [noise] um they don't actually have proven track record scientifically scored track records we don't know how accurate they are in the same way that we know how good a baseball player is by looking at his batting average\nIn is the goal of a forecast to change the future\nSo if you look at the big famous pundits who tend to dominate the news whether it's politics or economics or anything else [noise]\nUm they don't actually have proven track record scientifically scored track records we don't know how accurate the are in the same way that we know how good a baseball player is by looking at his batting average\nIn is the goal of a forecast to change the future to be able to make a decision once you know what's gonna happen or once you think you know what's going to happen that will change the outcome\nThis is an absolutely essential point very often when you talk about forecasting people talk about well how do you make it accurate forecast but very very often when forecasts are made\nIt's not actually accuracy the people are interested in there all sorts of other reasons why people make forecasts so you know a pundit on television might be making a forecast because it's ideologically congenial for the audience that very often happens\nOr they might be making a forecast because it's shocking and it's interesting it entertaining [noise]\nUm there's all sorts of these other competing interests and one of those is to cause change so for example if I warned that some terrible thing is about to happen it's not necessarily that\nYes so you know a pundit on television might be making a forecast because it's ideologically congenial for the audience that very often happens\nOr they might be making a forecast because it's shocking and it's interesting and entertaining um there's all sorts of these other competing interests\nIn one of those is to cause change so for example if I warned that some terrible thing is about to happen it's not necessarily that I Believe that is in fact the case it may be that I'm trying to spur others to action in order to prevent this suppose a catastrophe\nI'm so we have to be careful when we're looking at a forecast we have to ask yourself is this person just trying to give me a district good to be as accurate as possible or do they have other interests at stake\nWhat are some big flops some production failures that stand out in your memory\nWell I always liked to say that the Nineteen seventies or the golden era of failed predictions um it started really in Nineteen sixty eight with population bomb by Paul Ehrlich there was a huge bestseller basically said that there will be mass global starvation within a couple of decades [noise]\nWrong or and then the Nineteen seventies were absolutely stuffed with the most amazing forecast in in in ...\nFlops some production failures that stand out in your memory\nWell I always liked to say that the Nineteen seventies where the golden era of failed predictions um it started really in Nineteen sixty eight with population bomb by Paul Ehrlich there was a huge bestseller basically said that there will be mass global starvation within a couple of decades [noise]\nWrong or and then the Nineteen seventies were absolutely stuffed with the most amazing forecasts and and happily for humidity most of those forecasts which were wrong we're all dismal they all said we're going to run out of oil [noise] um\nWell it reminds me of Y. two K. right that we all thought that general is going to end with two thousand came along and nothing happened\nThat's exactly right Y. two K. was another one there is a very long litany of these things but you know a one of the unfortunate aspects about forecasting is this\nIf I go back to old forecasts and say hey do you remember what that guy said ten years ago well let's take a look at what happened and it turns out it's wrong\nI can tell you from experience the people kinda yawn [laughter] because it's an old forecast who cares about or forecast old forecasts are old news but if time passes in somebody's forecast happens to be right\nIs this if I go back to old forecast and say hey do you remember what that guy said ten years ago well let's take a look at what happened and it turns out it's wrong\nI can tell you from experience that people kinda yawn [laughter] because it's an old forecast who cares about over forecasts old forecasts are old news but if time passes in somebody's forecast happens to be right\nThen they will be introduced as the person who got it right and we all have to listen to this person because they tell us what's gonna happen next and as a result the rule with expert predictions so often is heads I win tails you forget we had a bad\nRight well you think about that every time somebody who figured out that President Trump was going to win when much of the media thought that he would not when a when he did win you know there are a few journalists out there like I said at look at my tweet from you know two months ago I said it was going to happen\n[laughter] yup and you know look it's a there's an old saying about the mutual funds you know you start five hundred mutual funds and you just bet on all sorts of different stocks and ... by sheer happenstance one or two of them will hit big\nAnd then you hold up your one or two that had big and you say look at this what a brilliant invest right and well forecast very often function like that you can't judge the quality of a forecaster by a single forecasts\nI said at look at my tweet from you know two months ago I said it was going to happen\nYou up and you know look it's a there's an old saying about the mutual funds you know you start five hundred mutual funds and you just bet on all sorts of different stocks and ... by sheer happenstance one or two of them will hit big\nAnd then you hold up your one or two that had big and you say look at this what a brilliant invest right and well forecast very often function like that you can't judge the quality of a forecaster by a single forecast\nThat stand gardener who is author of the book future babble and coauthor of super forecasting the art and science of production Dan thank you so much for joining us thank you\nWell let us know what you think of forecast political and otherwise it here and now dot org the famous Santa Ana winds blew into Southern California today prompting the national weather service to issue a red alert for fire danger\nIn late July the Carr Fire swept through parts of the city of reading and the surrounding area today residents are faced with burned hillsides and more than a thousand homes sites contaminated with toxic ash Liam Moriarty from Jefferson public radio reports [noise]\nI'm just off keswick dam road under western edge of renting the Carr Fire blasted through this neighborhood on the evening of July twenty six incentive reading dozens of homes on this date accrue in white hazmat suits and rest\nIn late July the Carr Fire swept through parts of the city of reading and the surrounding area today residents are faced with burned hillsides and more than a thousand home sites contaminated with toxic cash Liam Moriarty from Jefferson public radio reports\nI'm just off keswick dam road on the western edge of renting the Carr Fire blasted through this neighborhood on the evening of July twenty six incentive rating dozens of homes on this date accrue in white hazmat suits and respirators as methodically sifting through the ash and rubble\nIvan Rodriguez the California Department of toxic substances control says this is phase one of the clean up\nThat entails screening the properties that have been devastated by the fire\nAnd looking at household hazardous waste that needs to be removed to allow for the ash and debris to go off in the future time\nRodriguez says the typical American home contains a whole range of products that can cause toxic contamination after a fire\nYou for first got cylinders with looking for batteries looking for any\nPaints any solving any pesticides herbicides hazmat workers are marking what they find with spray paint to signal the removal crews white paint for propane tanks and other standard hazardous waste ... which requires its own special removal techniques\nIt's your time Rodriguez says the typical American home contains a whole range of products that can cause toxic contamination after a fire\nWe're looking for first got cylinders but looking for batteries looking for any\nPaints any solving as many pesticides herbicides hazmat workers are marking what they find with spray paint to signal the removal crews white paint for propane tanks and other standard hazardous waste pink ... which requires its own special removal techniques\nOne space one is complete crews will collect the ash in rubble including the building's foundation and hold it all off to a hazardous waste facility\nThe danger of toxic gas blowing across the landscape gives this job a sense of urgency but there are other post fire threat says well\nWe're on the back deck of my house Daniel Whitley a standing behind his home in the lake reading states neighborhood were many homes were damaged or destroyed ... was nearly one of them\nWere looking at the remnants of the Carr Fire that came a pair of sleep close to the back of the house\nAs he points to the burned hillside right out is back door he talks about his plans to head off the erosion that winter rains are likely to cause\nI'll put in some straw bottles those long stalled fields flexible things and then I'm going to plant some a perennial bunch grasses up there\nSays if you can get the grass\nReading states neighborhood were many homes were damaged or destroyed Whitley was nearly one of them were looking at the remnants of the Carr Fire that\nCame perilously close to the back of the house as he points to the burn hillside right out is back door he talks about his plans to head off the erosion that winter rains are likely to cause I'll put in some straw bottles those long stalled failed flexible things and then I'm going to plant some a perennial bunch grasses up their\nWhitley says if he can get the grasses established before winter he thinks he can avoid potential mudslides\nDrew co says that in some of readings burned over hillside neighborhoods so called debris flows could well be a danger\nShe can have essentially a large mass of rock and mud and water moving down and you can wipe out a house\nCall was with Cal fire's watershed emergency response team the group of hydrologist a soil scientist and other experts uses sophisticated digital mapping tools and onsite observation to identify populated areas at risk for landslides another post fire hazards to safety and property\nThe watershed emergency response team the group of hydrologist a soil scientist and other experts uses sophisticated digital mapping tools and onsite observation to identify populated areas at risk for landslides another post fire hazards to safety and property\nSupport for our stations comes from two Concord voices and orchestra\nPresenting northern lights the Carl and music of Scandinavia and the Baltics in three concerts from October Nineteen through the twenty first led by guest conductor Dale Borland Venus and more information\nIs that true Concord dot O. R. G. and support comes from ... see a gallery in the sun the landscape paintings of Tucson artist Ted ...\nAre featured in desert dwellings a new\nExhibit at the gallery and the son running through January thirtieth of twenty Nineteen learn more at ... dot ORG [noise]\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station from carbon I'd offering secure data protection solutions for growing businesses including automatic back up for ...\nOf Tucson artist ... are featured in desert dwellings a new exhibit at the gallery in the sun running through January thirtieth of twenty Nineteen learn more at ... dot ORG\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station\nFrom carbon either offering secure data protection solutions for growing businesses including automatic back up for services and computers high availability and disaster recovery solutions and automated data migration learn more carbon I dot com\nAnd Geico offering auto insurance coverage for cars trucks or SUVs and providing twenty four seven customer service more information on auto insurance a guy go dot com or one eight hundred nine four seven auto\nIt here and now a quick but important correction in our conversation with the BBC's Jeremy bone on friday he said that Israel shutdown that Russian jet over Syria in September\nNow the Kremlin did initially blamed the incident on Israel but later attributed it to a chain of tragic circumstances and said Syrian forces accidentally shut down the Russian plane killing all of the Fifteen Russian service members on board so we regret that error\nIt's here and now a quick\nBut important correction in our conversation with the BBC's Jeremy bone on friday he said that Israel shutdown that Russian jet over Syria in September\nNow the Kremlin did initially blamed the incident on Israel but later attributed it to a chain of tragic circumstances and said Syrian forces accidentally shut down the Russian plane killing all of the Fifteen Russian service members on board so we regret that error\nAnd now looking ahead election day is twenty two days away and there's a big race for governor in the smallest state in Rhode Island the incumbent Democrat Gina Raimondo is up against the Republican Allen Fung reminder beat funk four years ago\nAnd in this year's rematch the economy is still front and center here now is Peter O'Dowd reports\n[noise]\nFactories like Salvador tool and finding in Providence are remnants of Rhode Island's one glittery manufacturing industry or laugh\nKimberly Salvador's on the factory floor of a family business the jewelry or workers or stamping out of metal sold all\nShe's taking his face [noise] and she just Paris\nOut fast show now\nFactories like Salvador tool in finding in Providence are remnants of Rhode Island's one glittering manufacturing industry\nKimberly Salvador's on the factory floor of the family business the jewelry or workers or stamping out of metal will be sold all over the world\nShe's taken this day and she gets to Paris\nOut fast so now\nThere is a chunk of metal sort of in between the stem of the flowers are out there and being a big chunk of metal through a beautiful\nIt'll be where they don't then it will cut the outline and they'll cut all in between at\nA few decades ago as much as eighty percent of the costume jewelry sold in the U.S was made here in Providence and a third of the state's workforce had a job and manufacturing but globalization and the great recession nearly wiped out Rhode Island's themed industry\nHas the reputation\nAs being that costume jewelry capital of the world in the twenty\nThis area\nWent from a textile industry into\nManufacturing jewelry part and findings and those\nThe workforce had a job and manufacturing for globalization and the great recession nearly wiped out Rhode Island's beamed industry\nIt has the reputation\nAs being the costume jewelry capital of the world\nIn the twenties\nThis area\nWent from a textile industry into\nManufacturing jewelry part and findings and those textile mills became the factory the building that we're in right now was a textile mill and then it was a bakery and now it is\nIt was stage manufacturing a company that we purchased this was\nThe industry in Rhode Island how it is still the industry and read a lot of it has changed a lot\nA lot of people would say then you factoring in the U.S you know has diminished\nMy response to that is there was a time when we struggled\nAnyone you talk to that knows anything will say it's coming back\nThat people aren't that satisfied with going overseas and they prefer to have something that in the usa\nAre you happy with the direction of the students going\nI think we could do better um but I think that gets into politics and\nA manufacturing in the U.S you know has diminished\nMy response to that is there was a time when we struggle\nAnyone you talk to that knows anything will say it's coming back\nThat people aren't that satisfied with going overseas and they prefer to have something that in the usa\nAre you happy with the direction of the state is going\nI think we could do better um but I think that gets into politics and I'm not going there\nWhat's the politicians are\nWhen I ran for governor we had one of the highest unemployment rates in the country\nAt a recent debate Gina Raimondo took credit for bringing in Rhode Island out of the recession in\nFor most of the year that Iran we had the highest unemployment rate in the country in some industries like the building trades unemployment was over twenty percent people were hurting so I did get to work I go to our changing the way we do economic development\nWhat she means is tax breaks Raimondo lured big companies like Johnson Johnson and the division of G. E. with generous financial incentives her opponent Alan ... who was mayor of the city of Cranston is not impressed\nCultures with the governor subscribe to a corporate welfare [noise] goes\nFor hurting so I did get to work and I got to hurt changing the way we do economic development\nWhat she means is tax\nBreaks ram onto lured big companies like Johnson and Johnson and a division of G. E. with generous financial incentives her opponent Alan ... who was mayor of the city of Cranston is not impressed\nThe culture that the governor subscribe to a corporate welfare [noise] those millions that have been given for many uh developments that are produced only a few construction jobs no long term jobs that's going to be dramatically reformed and many of those millions are going to be caught\nAnd fun has his own challenges in this blue state he has to tout his conservative credentials without feeling too closely to President Trump and then there's this wild card\nYou deny our knowledge and draw votes from Mr ... I Want to draw votes from the both of them\nJoke shrill oh he's running as an independent and he could get a big chunk of conservative votes at funds expense trailer was the chair of President Trump's twenty sixteen campaign in Rhode Island\nAre not in it as a ... and I would look right in their in their eyes and tell them that I'm tired of the party politics\n[noise]\nSo how will vote\nBoat from Mr ... I Want to draw votes for the both of them\nJoke shrill oh he's running as an independent and he could get a big chunk of conservative votes at funds expense truly was the chair of President Trump's twenty sixteen campaign in Rhode Island\nI'm not in it as a ... and I would look great in their in their eyes and told them that I'm tired of the party politics\nSo how will those three candidates do in the race for Rhode Island's governor\nTo get some answers to that question I went to this very busy street corner in downtown Providence of course the capital of this tiny little state and I asked Maureen locally for some guy that she's a political scientist and she's been following politics in this state for a very long time\nI Lived in Rhode Island to thirty three years you know the lay of the land\nIs pretty much yeah why did you bring me right here in this spot in downtown Providence\nIf we were talking about this race this would be a good place to illustrate some of the changes that have gone on in the past decade say\nWe were in the worst shape\nAfter and during the recession we were at the bottom\nWhy did you bring me right here in this spot in downtown Providence\nIf we were talking about this race this would be a good place to illustrate some of the changes that have gone on in the past decade say\nWe were in the worst shape\nAfter and during the recession we were at the bottom\nWe were the last to come out of the recession you know I've heard that a couple of times talking to Rhode islanders you were the first to go in and you were one of the last to come out right\nI think that's because we had a a workforce that was relatively uh on train for new technology but up until fairly recently\nThey were able to make a living in manufacturing a good middle class\nCottages little cottages down at the shore and things like that\nBut all that changed you know in the eighties and nineties so in the recession hit we really weren't prepared\nIt ... it it really hit us very hard how much did that pain affect the political psyche of the people here\nI think they were pretty cynical about politics because we had been so long at a disadvantage economically and people people would promise things and not a lot of big changes occurred\nIn addition to that there was eight\nThat changed you know in the eighties and the nineties and so when the recession hit we really weren't prepared\nIt's ... it it really hit us very hard how much did that pain affect the political psyche of the people here\nI think they were pretty cynical about politics because we had been so long at a disadvantage economically and people people it promised things and not a lot of big changes occurred\nIn addition to that there was a sort of a Hail Mary pass made by the last administration a Republican administration\nThat attempted to a fun with state funds are gaming sort of video games will Curt Schilling\nWhen Boston the Boston Red Sox pitcher the Boston Red Sox Fisher it cost us like you know over like Ninety million dollars initially we got some of the money back\nBut that really gay people are jaded perspective on economic development and what people were doing so added to the\nYou know the long downturn and sort of deep recession we had\nThis was an attempt to pull us out\nIt failed and it left people pretty cynical\nAnd yet here we are today twenty Eighteen we're about to come up on the midterm elections in a big gubernatorial election here in Rhode Island\nDollars initially we got some of the money back\nBut that really gave people an jaded perspective on economic redevelopment and when people were doing so added to the you know the the long downturn sort of deep recession we had\nThis was an attempt to pull us out\nIt failed and it left people pretty cynical\nAnd yet here we are today twenty Eighteen we're about to come up on the mid term elections in a big gubernatorial election here in Rhode Island\nAnd we see construction crews here will harder work on projects\nRight well the thing is we are in a good spot now in other words we have come out of this recession our unemployment numbers are above the national average I think that's why you see all the trains in the sky and so forth\nLet's talk about Alan from he is a Republican and the pool do show Raimondo ahead but not by that much\nIs that a surprise to you in a blue state like this is going to be an interesting race it's not going to be a cakewalk for Dina reminder she's going to have to work really hard and she's gonna have to get out of her voters so in that sense I Am not surprised there are people in this state who are concerned about old Rhode Island what it was like an\nAlan songs message resonates with them\nGot a good story he's got a good story\nDo show ram onto ahead but not by that much\nIs that a surprise to you in a blue state like this is going to be an interesting race it's not going to be a cakewalk for Dina reminder she's going to have to work really hard and she's going to have to get out of her voters so in that sense I Am not surprised there are people in this state who are concerned about old Rhode Island what it was like and\nAllen songs message resonates with him\nGot a good story he's got a good story he's the son of Chinese immigrants he worked in a um Chinese restaurant the ones who are the local college where she is Yale Harvard roads are so it's a very very different picture\nThe most recent University of New Hampshire poll which came out after my conversation with Maureen locally has ... pulling ahead but even in deep blue New England you can't discount the conservative vote and there are pockets of Rhode Island were fun will do well\nWe were walking by the inch water water and a\nFour miles a day rain snow sleet right here in this part in this box\nMet flung supporter Ron and Conan his friend Alan ... on their daily walk around a pretty little park in the city of Johnston Trump beat Hillary Clinton here by fourteen points two years ago\nBeen in deep blue New England you can't discount the conservative vote and there are pockets of Rhode Island were fun will do well\nWe were walking by ...\nFour miles a day rain snow sleet right here in this part in this part\nI met funk supporter of Ron and cone and his friend Alan ... and on their daily walk around a pretty little park in the city of Johnston Trump beat Hillary Clinton here by fourteen points two years ago", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Tucson", "day": "15"}