{"month": "10", "state": "MA", "station": "WARA", "content": "Now ... the Afghan be\nIn the mid ... they\nSee is better\n\nYou're listening to W. A. R. A. Thirteen twenty am Adel borrow\nEight to ...\nYou can jump\nAll the\nI was dating\nThen\nSaid\nDon't\nWhat was that\nIn a while just stop and think Donald\n\nOh\nWell no no\nOh\n[noise] oh\n[noise]\n\nOf the band ... builders it down and let me tell you that all of the gene bumped to do down in ... not on the\nBed and ready to do them in there and we began Mongolia\nBest friend he was told him to do that began Omar going\nAll we did the same with captain to build a no\nTown ball chicken them together and build a building you know a little\n\nDidn't\nAnd then they just downloading digital bye\nIt was about to do to cook it on the radio\nAnd when they don't know what a renegade they'll remember how to how\nBe carrot and the world or a long row to keep the road and looked at the ...\nNa na na\nNa ve\nBomb begin\nOnly\n... ... ...\n... ... ... to\n\nTo keep\n\nBoom boom\n[noise]\n\nA teenager\nAnd and\n\nUm\n\n\n\n\n\nWow\nHa ha\nHa ha ha ha ha ha ha ha\nHa ha ha\nHa ha ha ha ha ha\nHa ha ha ha ha well the thing about the\n...\nBump bum but [noise]\n[noise] [noise]\nBom bom bom bom bom symbol on it [noise]\nYou know\nThe amount for\nSpeeds up there on\nThe line or she may not be a bomb but the\n\n... ...\nThe\nGumbo spent about\nHours on the line\n\nFrom there but I\nThat both people that\n\nDon't go hated all\nI Want you back in\nJune\nMid around all day\nLong you\nBeen a lot more Jew but\nThe\n\nBelow my jaw drop\nI don't know my jaw drop I don't know what [noise]\nAround\nThey allow\nYou to do that\nI didn't know she\nDidn't loans you that [noise]\n\nDidn't last long and then\nMm Mm\n\nI\nWouldn't\n[noise] [noise]\nYou know\nKnow [noise] and we begin to do well and you know as we move ... John how\nBring to the T. V. you already see the\nIn your on the\nThe the new the\nMay be one\nKnow what to do\n\nThat human beings\nWe may\nThe one thing but you know\nThey\nDe de\n\nAre\nYou're listening to W. A. R. E. Thirteen twenty am Arab world\nWhen he am apple borrow\n\nGo let's do\nThe book name\nTo get on the\n\n\n\n\n\n\nWell genes that only walk for that but the damage that they do that but the problem\nReally\nDon't know\nWeekend ball yeah it'll all getting hold of it that\nWay at any\nWhere you get the\nKnow\nYou know those three now\nMan he\nDo we know what he did they gain from them\nIsn't it done you\nWater to\nThe oh and\nMe\nThat's you know in\n\nOr\nNo we're\nCan walk\nWhole\n[noise]\n[noise]\n\n\n\n\nA\n\n[noise]\nVery big\nCar now\nOne and then the card house as\n\n\n\n\nNow\nAm a\nNow\n\nThe man made in China\nAnd\nAnd\nWe use the song about through by\nA two story called I was a mean old man\n[noise]\n... who\nWho\nIs man getting ... to ...\nJust the rules [noise]\nFrom three for those\nCan really be ... died in that in ... [noise]\n... than me no ma'am I'm older than ... ... ... ...\nMind by ... man it was ... done now in the bank was ...\nBy ... to ... to me ... I did things and we burgers brand new bloom was\nMaybe about ... mine are hired on ... and I\nGave when zoning maiden name brand new new lab by waving would meet ...\n\nLiving in here one on me is the rain [noise]\nSuch a ... ...\n... ... to ... and\nHad done mind you know do ... do those\nAnd then remind you know to blame the dirty little down the ...\nOr did those down\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\nReally all need some where I'm from a monkey mind [noise] level you are\nWorking needs to\nBe leading the blind own in the Nick ...\nWho can just say can chat who gets you have no one\nWill get better than the than the ... to a mortgage they share the skin off the board game to me man\nDo you turn in\nTo a golden\nNa na na na na na na\nNa na na na\nNa na na\nYou can route to legislate\nIt and I bet you than\n\nYou are listening to W. A. R. S. Thirteen twenty am Arab world\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYeah\n\n\n\n\n\nMore just fun\nCould I be given the the memories that are ...\nStill not much more\nJobs were arrested in the\nYou're listening to W. A. R. E. Thirteen twenty am apple borrow [noise]\nThe day is just by the\nSeasons\nThey had this bright and\nIs the name that he was lied\nBully me who was the\nWhat the lady\nThe ... the uh the ...\nA new man in a ... a ...\n[noise]\nAnd then uh\nThen huh\nAnd then uh\nThen we'll know the men ... we'd go strong\nThis ... ... ...\n... ...\n... you know\nYou could\nMany\nAh [laughter]\n... ...\nNa na na\n\nNa na na na\n\nNa\nVe than yeah wow\n\nWow boy a be\nA little greedy rolls\nOn a\nWho was on\nA waitress\nIn a ... a\n\nLaw a um a\nA ball all\nAnd\n... the one the\nThings from me you ... you say why\nDoes it go on and ...\n\nSo\nMeans am more yeah\nLittle man at the\nOn\nBomb bomb\n\n\nDiversity graduate Barrett will take place on October thirteenth for three PM six PM at Rhode Island colleges Murray center attendees can speak with graduate admissions representatives from local and national colleges and universities\nDon't have the opportunity to learn more about it mission requirements application deadlines financial aid opportunities and or the fear is free and open to those considering graduate school\nWar the fear is free and open to those considering graduate school though was wishing to attend the fare can register by visiting diversity college fairs dot com [noise]\n\nOr\nLet me\n\nBe it is not a tease me the ... them to\nHow\n\nGo oh\n\nOn Tuesday October thirtieth imply pm to ... pm United regional\nChamber of commerce will hold the twenty ninth annual east of the region that tri county regional both technical high school and Franklin he said the region is an annual celebration of restaurants from all the sixty communities that the regional chamber served attend these will have the opportunity to sample food from a variety of restaurants that are members of the chamber\nDeborah too early to sample ... variety of restaurants that members of the chamber of\nOh\nOh oh\n\nMatter and then\n[noise]\nFor\n...\n...\nIn the ... you know ...\n... ...\n...\n... ... maybe ... ...\n...\n... ... ... the\nBird banging engineer ... ... ...\nBoom boom boom boom ...\nWhat would be\nA new ... new\nCare\nWe do not\n... ... in the\nAir ...\n\nCorrectly I got a\nB we try\nWhere where\nWhere in the proper way to do a lot\nBetter to go ...\nUp and\nThey're going to take it\nThrough the la la la la la la ... and\nAnd\nNot too bad he said like why\nDon't I don't know if\nYou are listening to W. A. R. A. Thirteen twenty am Adel borrow\nOn Thursday November eighth at six thirty PM Pam Holland presented discovering cousins using DNA at the Richard the memorial library in North Africa where all this talk will show how to explore matches and use the tools available at the major DNA testing companies\nIt will focus on practical ways to discover relatives in order so Moby cousins for more information or to register you can email librarian Maggie homes I Am homes at ... dot org\n... grace how sweet\nThe sound of a ...\n\nA ...\nA ... a\n... a a a a\n... ...\n... ... ...\nThe\nThe F\nMuch shaves oh\nOh\nVery\nA in a\nA may ...\n... to\nAnd he ... and\n...\nSure ... as long\nSorry\n... ... ... ... ... ...\n... ...\n... nice\nTo this\nOr\nBook a ... ...\n...\n... ... ... s\nWill be ...\nOr ...\nOr\n...\n... ... [noise]\n[noise]\n\nOh what\nA like a man\nWho owned by the way [noise]\n\n\n\n\n\n\n\n[noise]\n... ...\nRead the new bride yeah\nAnd you\n\nKnow not\nJust you know there are\nA ... a in a\nA gallon\n... a ... a brawl but we're a law every man for\nA while you know I\nKnow about you know very well uh uh uh\n[noise] no\n\nSo yeah that I well I think I\nAs long as the\nOn the phone\nThing I Know\n\nThink\n... main being an emphatic but then the ... Blount or riding your mind and your mind\nDay you may be that way\nYou know they're like\nString upper but they might happen\nDown to them about a year you\nTo them about it\nI mean a rock and roll and\nCrime and all of the day after all that ...\nWomen ...\nYou may be getting\nDegree\nCall it that the one that's\nThem about it\nMay be stripped him working working on a home where you live in a man\nOf your mind and they made us do\nThe men are stronger than you might even won't pay\nYou may be no matter\nWell I\nHave with them about it you can\nBut there are some body in\nBeing afraid Gen\nYou may be admitted to begin to look\nBegin\nCan you may be working in a bar or you'd be a lot of course\nTo them about it\nYou may go in there you may call material that you may call Bob\nHumane told me they\nCalled me and care\nLoading major Goldman re\nAre going to have a third about it and you\n\n\nMy name is Chris Wyoming and I'm the manager of the elder dental program we're inviting any seniors residing in Massachusetts for sixteen older so I can I read that screening clinic in taunton on Saturday\nFor sixteen older to attend our free dental screening clinic in taunton on Saturday October twenty from a forty five AM\nTo one PM participants will receive a free dental screening and have an opportunity to speak with a dentist and the clinics relaxed and friendly study participants will be screened for oral cancers and have a chance to receive free bench or cleaning\nFor more information called seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program a project of the community the NA\nOn that on that\nDo you do what\nThey think the big thing was when\n...\n... or ...\n\nWhen you\nWalk around what went wrong Renee whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa\nWhoa\nWhoa with but that may\n\n[noise] the\n[noise]\nBe\nTo do that\nBut\nIt\n\nBe\n[noise]\n\n[noise]\n\nTo\nThat and then we\nDidn't have the\nWill be\nDr Gary highland or will return to Richard's memorial library for a series of lectures titled\nPapers the series starts with the federalist papers on Thursday October forth it will be followed by the pumpkin papers on Thursday October Eighteen\nAnd the Pentagon papers on November first all lecturers will take place it's seven PM registration is required within these lectures if you'd like to register you can email librarian Maggie home\n... lecturers if you'd like to register you can email librarian Maggie homes at in homes at sales in dot org [noise]\n\nA\n...\n... ... ... ... ...\n... I saw on the ... ... ... well the ally ... well no\nYeah I ... well no\nI I can\nOnly imagine\nWhat my eye he when he can\nSurrounded by well not\nJeez well then all of you\n\nAll creation well no\nThe whole you know during the day and your name out loud\nAll our broken\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n... the\n... and\nDidn't\n\nYou're listening to W. A. R. S. Thirteen twenty\nAm Adel borrow your eyes Providence campus arts and cultural program will host the documentary film Gen silent on friday November sixteenth from five thirty pm to seven thirty PM in the ... auditorium on Washington street\nGen silent as a documentary by filmmaker stew medics that asks six LDP seniors if they will hide their friends their spouses better entire life\nIn order to survive in the long term care system Gen silent discovers how oppression in the years before stone wall now effects older ... people in what is being done about it and mission to the film screening is free [noise]\nTo vary in truth radio\nWith your host has to offend me all the kingdom located in one ten Ruggles street in Providence Rhode Island\nWe not would you open your heart your ears in your mind ... everyday living and now gives you\nTruth of the ... everyday living and now here's your host asked her family [noise]\n[noise] I Want to welcome you to to Dave Savage bridge the lord bless go that is great shows that is a continuously walking you know I'll be off and do you know my ... I Wonder if what things we thank him for what he's teaching us it meant\nWhat good is that you know it's the approved foreign things and yet these are needed photos to be able to cardio in in this during the it meant\nSo I Want to to go with me to the book called the ... eleven that's where we are going to start\nOr not we'll read from Boston to bus tour of the ... shutdown eleven from by stand to bust for off\nBible just for the lined with that though ... says he's not as the land of Egypt from Hans ... came out\nWe are Dallas who they die see I ... it would that food I said I didn't know pops but is lined with that you go to parts that seat is the land of views on bodies\nAnd drink get what I Do read of everyone in line with the law that got carried for\nThe eyes of the lord that God I always appointed from the beginning of the year ... going on to the end of the year and this is one of the reasons why those of us who believe in Jesus Christ wants to be grateful to go\nThe reasons why those of us who believe in Jesus Christ must be grateful to go look at the passage of the scripture go to get people from the land of Egypt and\nHe was talking to them about the line that they were going to pour says\nThe place where I was taking them to\nSee what's going on in both lines is that the lines of you're going to pose as it's not like the land of Egypt and the land of the gift your protected by your power you're protected by your strength\nYou made your guy dates you planted by your own effort and your work that day to know as much as we can and it brought forth as much as it got\nSo God was bringing out the limitation\nOf you might not believe the the limitations on a few of my ability you seem to all that look\nYou have become dependent upon yourself\nYou up and depending upon your wisdom and understanding but it does not produce much because there is limited to you on that standing there is a limit to you know like there's a limit to your power\nSo they are for the best of productivity to your power is nothing but now I'm bringing down an outstanding I'm bringing to another place I Know that came to him I Want to bring you into I Know that wisdom\nAnd that is to say to you that way you go to process is the land that God is giving you go to the Supreme in that line\nIs there a line that you cannot go out is full of use ...\nYou cannot see completely nuts line you cannot you know by your mind on that stand everything about that line\nYou cannot reach the now the kingdom of God praise the lord you cannot complain with your own mind by your own air for how good does these things but this line\nMind by your own effort how good does it stands but this land is their land that brings it in that comes from ever\nGod is the one that does that work in his kingdom\nGod is the one that does a great thing and it's getting them to where you come you up to ... God it's so pretty good\nYou have to call them humbly saying that you asked I Do not know anything what I knew cannot work in this place because I mean they're different line it is not the same ... it's not the same condition they are different\nAnd there is a different to walking in the kingdom of go walking in the kingdom of God I Do walk is of divine power comes only by divine power prisoner look so water's descriptions are telling us is telling us that when we come in to Christ\nWe leave our own old lifestyle\nWe're most abundant on our old lifestyle by which we did all things according to our ability according to census and I couldn't do are not like an according to our own knew how\nWe're most now they lie on divine strength remorse rely on the vine wisdom we're most rely on divine power\nWe're most noon die without really got to go or not they can walk in the kingdom that were coming to\nIs will go to say in to these people\nAnd that is the very fun dish on for those who want to work in abundance of good\nIf you truly want to enjoy ... they are born of peace the abundance of joy\nThe abundance of grace I'm fearful from God\nThe abundance of ... um well\n... bonus of ... um well\nThey are burned down so they love and kindness messy of go\nYou have to understand that is known by mind is known by a pile of what it is by the spirit of the living God God is so boring and ... yourself onto him praise the lord\nThat is the beginning that is the beginning point\nWhere we've come on down the government of go we have to realize that all complements in that can do\nMost combined divine power\nAll oh that works out dead walks only things that I don't buy the power bill is pretty tools will our company is the book was a goal\nSo when we come to God it it is not about what we can do it just about what God wants to do in our lives on through was a man and the only way we come into a blessing is by the military\nA barn dances I really want to or that God I called because I was going to go to a bonus but how do you begin to work in this up on this\nAnd I just want to continue talking about I Want to begin to examine today and I want you to see that\nThere is there a passage of scripture that lives\nDown for us this step by step way I'm On a weekend and ...\nAnd then the abundance of good good as not left those without that wisdom ... how do you are appropriate they are born Tom blessing of the living ... how do you operate the abundant blessing of living go my to\nYour book of my two\nYour book of my to\nShop dot six\nOr we read from Boston I Love Jesus Christ did she ended up was about three I said\nAfter this might not there for three is given them the blueprint on their their principles of prayer\nAfter this might not free to anybody else to do anything else forget about that\nIf you want to break this is where you ... and that means that we cannot disadvantaged in from go\nUnless we followed this button because Lord Jesus Christ brought us the truth ... from heaven amen after this might not there for three I was fired that\nA man named ... is there any duck on the ...\nOut of my time\nUnderstand who I Am\nSo that you walk in the blessing Brazil look\nEvery king dome asked his own government we know that I never government is head\nBut the king dome has his own government we know that I never government is headed by someone\nOr has some government exercise authority over the subjects where gold is the head of all\nHis skin dorm rooms overhaul\nBill is invisible you're part of his ... dome affects all\nGuarded Supreme he kills mix I live\nTherefore we live by his Greece\nBy his greatest praise the lord\nAnd ... and it is going to apply those who I Am not talk to you know but it comes in ... ... s set by the grace of God\nYou ruining their fears of men let's look\nAt it on myself that I think\nRoom and stuff that that team bus one\nNobody can come into it tore the essay by the bottom go\nThis is how will land the humble way of life in cry when we are humble will begin to experience the abundance of go it all starts with two militant\nRaised a little room on stuff that the team\nThe Bible says from one let the episode is subject onto the half hour's four days no power but don't go the powers\nThat be a big fan of gold the powers that be a dead of go no bought the\nOakwood pies adding leadership position is that by the grace of God it won't do that\nYou know don't go by the opposition by his own power Jesus I pointed in\nYeah man everyone that comes into a ... they come into our daughter by their permission to go even when you for simply the power\nOf God does not allow you to know how people\nThat is what will have to understand all\nThat is what we have to understand all woke up I mean it can happen on this I\nWould go for beets cannot happen he has the power to stand up against anything ... to prevent anything but when we see what everybody's happening you know how close by the problem is if we look good\nNothing can happen in your life is that the luggage by Muslim for it if you believe on the bridge to lower the devil cannot touch you except by the mission of the bestseller him and so you can walk with or at least I ... corridor yourself in that fight it meant it won't do\nDid not go through these days he went through a book by by accident guard buy meat that it is a lot\nAnd man I'm going to start to improve finely I'm awfully\nLearned I got a little rumors of our situations under this rule is forever or pose the door to a bone in life\nYou roof over our situations on these rules or for whatever\nThat is it do we into entering the bone number of reasons are good I mean for us all polarized belong to go on all gluten you do to him it is these are not stand in the open your life do they like to go and I was just scripture says is this your life with the light in the light of God was he like\nWe all have to humble ourselves\nEverything we need is in Jesus Christ everything we need is in the hand of God audience for life on garden as I've been provided for us we're not to be working deprived were not to be walking oppressed were not to be working rush it\nIn this uh we have all things in a bonus but how do you have asked us what to do with you on that time that the king dome belongs to go yours is the kingdom and the power and they blew the so when we know that God has the kingdom and go down\nPower and they blew the so when we know that God has the kingdom and go down or the power then we'd give ... to him in every respect and we cannot give glued to go without foster for homes in ourselves a subject of God\nThat is our started given loaded too good we have to ... as I say yes you are my go first or do\nYou ah my guard our guard is a ... and ... belongs s gift from that\nWill go on to live out from day to preserve\nYou say that I make is that I can see that and I make a life\nWas good mix you alive or dead cannot kill that is demeaning\nSickness cannot invade your buddy you may robots cannot should too down is that I make you a life that is I keep you alive bridge the law so it stuck you know the protection of going there man it is talk of the pretty sufficient that go research officers with\nIt meant it means that God is guiding our feet and direct you know apart so that we don't come into anyhow so that we don't get destroyed\nSo we can be rest assured I wouldn't know that God is so bring that he would keep us\nCome rain or shine\n... tornado or who they can\nGo to ... ... also not me gold will keep all the praise the lord it meant economic downturn or economic woes gold will keep us war or new we'll go we'll keep us\nGo to keep us in man\nThere for the first step\nTo a ball not alive\nBought a compromise that God is ... is too sick deliverance\nAnd that can be no deliverance without a sobering gone\nUsed to sing deliverance\nAnd that can be no deliverance without the ... gone\nDeliberate outskirts to eliminate shown on in life demands\nBut many I denied that eliminates John because of their own posture not callousness\nThey are not really sat down to the good things out about Gardasil okay what is this all about you see it's amazing what is going on in the world today many people at directing the affairs of their lives based on yeah I see somebody I said in the area that is no good\nAnd they are not really about to say\nThey said yes that is true I don't believe in God\nAnd you ask them why because it's not visible I cannot see\nI knew I was walking by my father I was going by my mother OK cardio and I keep on going\nThen who bought the first minute first woman\nSome people say the monkeys okay why is it that those monkeys are not given by the ...\nWhat does it stop us monkeys from given by two or they remind me what is the that stopped frog from flying\nHim in Brazil oh\nWhat is this you know you were if you want to believe that the audio of evolution what put a stop to eat\n\nFollow what I'm saying to you\nWhy is it that the warm ... not ... I'm I'm all for science into a snake\nI live they look like they're like drink\nUnder crawl under underground\nWhitey they will stop at the point of the room and they normally do want to develop into something else\nWhy didn't the frog stopped and did not become if he's\nWhy is it that just like that\nWhat makes a monkey stop being a who might be\nThe monkeys stop being a who might be\nIs evolution no longer walk\nSo you can see that by the simple reason it\nYou can put something on you can't be bumps on this story because if evolution is true then all this I feel evolving\nHe bought this object still involved in that we must be seen this new evolution\nWhy is it that we're not saying that\nIf we keep a chimpanzee or a monkey for thousands of years I got to keep them alive or even if it's for the lifetime they do is you see something new to say ... that is changing in them\nWhereas it does not happen it monkey is born in monkey monkey would die monkey\nThat is the truth\nAnd that is by the power of good a warm is born a warm and a woman would die it warm is Nick is born a snake and this and they will die is Nick Brazil oh\nNothing is changing\nBecause that is the way they are I never snake is different from the warm and they operate in different ways then we must begin to understand something is behind this to a man\nAnd that's something whatever you call it or he is that where I live in ... some people who are wise now in science they say where that is what they call it that is adding to it again be\nOr that there's some kind of intelligence\nIs the law your column intelligence\nHe's good why because it can do what to do\n[laughter] he can do what you cannot do mine I never made a new um mine has never developed any ethnic snake go to ... percent lower so we cannot allow ourselves\nBut any ethnic snake go does sober priest alone so we cannot allow ourselves to canoe to walk in the north where you know that that is go then the beginning of deliverance asked I asked comment\nBecause if you knew that that is good\nThen it's like how do I get to know\nHow do I get close to him\nHow do I drove to in Brazil oh\nYeah man on that stand out your exports showed the damage your enlightenment\nWhat do you know what you're talking about what professor snow and they're talking about is based on the ... and I said before now they have in mind is caught on next by today and it gives an expert opinion about something that has to be known is based on did not like that is I've been doing at that time\nGod to me\nKnow no\nNo no\nNo\nKnow ...\n\n\nDr Gary highland or will return to Richard memorial library for a series of lectures title papers\nThe series starts with the federalist papers on Thursday October for it will be followed by the pumpkin papers on Thursday October Eighteen\nAnd the Pentagon papers on November first all lecturers will take place it's seven PM registration is required within these lectures if you'd like to register you can email librarian Maggie homes at in homes at sales in dot org [noise]\n... ... [noise] ... ...\n... ... [noise]\n... ... ... [noise] ...\n\n\n... ... ... ... ... ...\n...\n\n\nYou\n... de ...\nWould just na\nNa\nNa\nNa na na\nYou\n\nCan hear\n... ...\n...\nNa\nNa\n[noise] [noise]\n[noise] nah nah\nNah\n\n\n... ... ...\n\nAnd na\nNa na na na na\nNa\nNa\nNa\n... does\nShe\nAnd\n... ...\nA I'm\nYou're listening to you hey Jorge Thirteen twenty\nAm apple borrow on Thursday November ... six thirty PM Pam Holland presented discovering cousins using DNA to Richard memorial library in North out over all this talk will show how to explore a mattress and use the tools available at the major DNA testing companies\nIt will focus on practical ways to discover relatives in order so ... cousins for more information or to register you can email librarian Maggie homes at ... am homes at ... dot org [noise]\nYou're listening to W. A. R. E. radio idle borrow coming up now the Armenian video our\nCulture tradition Armenians a proud of it and river Armenian songs that her there Armenia live John I Wish I could if I wanted to know how you buy them can act yeah who knows what hiding you can't go in and hadn't ... good morning it is Sunday\nThe\nGood morning it is Sunday\nOctober the\nFifteen establish here in Providence in Nineteen forty seven and now in our seventies second year of broadcasting you're listening to the longest running Armenian radio program created by the late Russell gasp Marion produced\nDirected in hosted by yours truly sonar terrain you know what I mean ... or of Providence\nBrings you the best in I'm In the music latest news of the Armenian community in public service announcements\nAre with masters judge gets burying and now sit back relax and enjoy your program\nAbout evolution and the ... ... ... ... miles out of hired ...\nIdaho murder man noticed that the\nParty and I of course you know your ... Gardner\nBeen settled pick up on design it on the streets you know Dr ... ... ... ... ... ...\n... ... young Doolittle much he bumped Arnold snuggle Mitch ... I I don't I'm which I'm much this muffin or skin or you're doing I object Marilyn\nOften get in through the rug out to dinner hustle gentle golfing I'll miss you didn't vote for too little shutter knock\nMake British are not getting guys I could go to the ... [noise]\nAnd today is Sunday October the thirteenth if only I could read the calendar from where\nOctober thirteenth Sunday [noise]\n[noise]\nWe did have to justice last week ... ... Chevy in Ninety seven of Cranston passed away Wednesday October third at the ... century in Providence he was a loving husband of the late to reset Chevy in born in Turkey he was sending played host stepped in by dot Chevy in\n... he was a textile printer and the textile industry for many years before retiring was a World War two U.S army veteran he was a devoted father Lawrence Chevy and his wife Carrie of westerly and Richard Chevy an of Cranston loving grandfather of Kimberly Chevy insects\nAnd her husband Gabriel of New York city cherish great grandfather Rebecca Theresa stop them and dear brother arose ants Nelly of Providence in late ... talk to you Charles and Elizabeth Chevy in Elizabeth ... and Mary Grant\nElizabeth Shove in Elizabeth ... and Mary Grant\nFuneral services were held from ... in St ... church with very old military honors it north burial ground our condolences to the Chevy and family\nAnd ... rock sci fi or eighty four past week friday October fifth at Rhode Island hospital she was way for the late Samuel sci fi odd\nShe was born in Providence a daughter of Oscar ... rocks is survived by her children David look freedom when his wife dawn of Lincoln and Valerie Salvatore and her husband Robert of north Providence shoes grandmother of Jiang and Sophia Salvatore and sister of suit enough to join in the late ... and ... and\nRoxy was an avid Red Sox fan enjoyed playing bingo but our greatest joy and life was cooking in spending quality time at home with their family and friends funeral services were from ... funeral home with a service at\nA St George ... church our condolences\nTo the ... family and with our ... October thirteenth twenty Fifteen today is the third Donald's of armed ought to beat in October Thirteen two thousand one says the seventeenth out of the ... Garabedian\nOctober fourteenth for Monday the fourteenth delta Peter Garabedian October fifteenth though nine to ... is a nice settled to Beverly Kashmir in October Fifteen two thousand four Tuesday is the fourteenth ... in October sixteenth\nTwenty Fifteen Wednesday is the third that also seeking student with Raj on October sixteen twenty fourteen Wednesday's a forced out of Helen ... until the sixteenth Nineteen Ninety six Wednesday is the twenty second data to at least at a notion October sixty two thousand and one is easy Eighteen the anniversary of Carl climb\nOctober seventeenth twenty Thirteen Thursday is a fist settles abducted by ... by young October seventeenth two thousand\nLots of Dr ... pi yeah October Seventy two thousand Thursday the Eighteenth outs of cooking hotshot duty on\nOctober Seventeen Nineteen Ninety six thirty the twenty second thoughts of ... action\nOctober Seventy Nineteen Ninety seven thirty is the\nTwenty first dot of Margaret just scale in October Seventeen to thousands or is this the Eighteenth out the ... Jerry Meridian\nOctober Seventy two thousand one Thursday is the seventeenth ... Iranian activists seventeenth or fought there is the is the fourteenth Dr John ... Syrian I feel the Eighteenth or five friday the thirteenth out the Jacob jak sky on October Eighteen twenty fourteen friday is the fourth stop the Jeannette Iranian\nOctober Nineteen twenty sixteen friday is the second thoughts of Susan Boyle Goshen in October Nineteen twenty sixty friday\nExcuse me Saturday is the second titles of Susan's daughter Lisa ... Lankford\n... coming from the requiem service merciful lord have mercy on those sorts of are deceased even eating [noise]\n\nMm\nOh\n\nMm\nNo ooh ooh\n\n\nAnd\nUh\nFor the\nMm\n\n\nSay inside St Mr women's we'll presents a sentimental journey Rhode Island native Brian Georgia will perform classic sixty swing hits from ... and I tried to dean Martin to Tom jones there'll be dinner in ... contact church\nThe friend in the church office at two seven to seven seven one to for your table reservations call the church office to seven to seven Seventy one to friday October twenty six six o'clock a guiding auditorium friday night October ...\nFriday October twenty six six o'clock I got an auditorium friday night October twenty six I'm it'll be I don't even know what the dinner is but a\nDinner in raffle so we'll see they're twenty five dollars for an adult kids or ten dollars friday October twenty six\n\nIn the school\nOh\nNo\nNo no\nNo no no no no no no no no\n\n\nNo no no no\nNo no I\n\nAm\nAh\nOh\nMan\n\n\nOh\n\n\n\nOh\n\n\nOh\n\nOh [noise]\nAnd saint saint massive Armenian churches having flu shot free flu and pneumonia shot clinic October twenty eighth after church services this is a walk in clinic sponsored by the right eat and eat the wire way you must be Nineteen years old and a road island resident with health insurance to get a free flu shot\nResident and you have to have health insurance\nHigh dosage available for senior citizens if you do not have health insurance shots are thirty dollars as defined by writing from what questions call tech pharmacist less uh\nThirty dollars as defined by writing or more questions call tech pharmacist Melissa you have any questions call Melissa a at Fort Irwin five to nine seven one seven to for their won by nine seven one's seven [noise]\nI Am ... out of the sun ... dog Hyatt and lives being met him was shocked we the ... id ... von ...\nHide listen [noise] to see them ... [noise] Mitt unfairly\nMich got they may make a boo hoo pillow in particular the image they get ... von Braun metric of Calais and ...\nWith us by human among the ... has hired a lesbian met hide any by been bought this and then when I first got out I\nYou have ... out only ... I'll be shows against the whole sudden Mitch hold onto the gift Tom ... month by month [noise]\nI ... the Gillette ... there's not a ... inch best boomer Nazis yet ... the common core should should put jets with about it on them upon\nMake but do we know squeezing I'm ...\n... ... ... ... Hassan ... out of news about it or the ... ice bottles shift to but I Am for ... ...\nKeep this good then you have ... patents\nKeep this good then you have ... does he my\n[noise] [noise]\nMy dog battle is a little murdered son [noise] how do you really really high to not get snow [noise] accustomed yet it may have ... percent of your team about I'm tiny give my spine crucial polite I gave him a bit odd it's high filibuster\nI sort of be got some provide an issue ... [noise]\nI signed on Sunday June ... Nevada [noise] Chinese cut to the suffering the net him ... out you know I said I must be start chopping sunny I'm Johnny Mae [noise] our son\nOutside [noise] I thought I may lose on Sunday [noise] ... me too [noise] on Sunday [noise]\nDoing that is yet world she got as we see me do on Sunday [noise] deeply on gun ... still discuss on this voter bond as yet get higher up in the mood to fish the men were holding\nThem a ... I'm sure must have been higher there must be some higher hole for their honeymoon on Sunday [noise]\nHigher which he holds about a lunar unsolved [noise] I ... about the ... men like I Know what I kind of shut up shut solves morning noon and hold them in the blue on Sunday [noise]\nOld mig ... that\nWish the ... ... ... who is ...\nShe and her ... ... who ... who they are who we see I'd ever rules on Sunday [noise]\nGo talk available is you know I'm ... I'm slow he ... multi\nTongues you get ... ...\n... ... pools on Sunday\nMet him ... ... you know he don't give that bottom ... Shaun\nGone off to be shop I'm ... so I knew Mel testify to on Sunday I Love to hold on to get us money hello being met\nA boost ratings to my dog highest summits overeating ... inch best told name what's the scene yet never blooming mounted\nOn and meet blue I'm trying to eat\nIn the U.S two men ... ... there was never that never vote in each best ... I'm ... I ... enjoy doing pay their chance she on the news I don't ... I Need\nTo ... she high in how about noon cut you off yes cut through the name of our moon gun phenomenon\nOn whom von ... VIII there are some of the blue on Sunday\nEvening yeah a lot of the gossip the ... to me I ...\nI left the best you could have on them must these finance Meg ... on on these young kids over there or they go to ... to ...\nYoung kids when they are they good God is there to put my body dead body ... hot I Do know what I you know I'm tired of going\n\n\n\n\n\n\nAnd the the dating back to the church to welcome in honor of new probably his great bishop understood\nOn as he celebrates divine let her do you think bart's church Sunday November twenty fifth a special reception will follow and again that is Sunday November twenty fifth\nAnd that the holidays are fast approaching your friends that are ... project wants to help you and your family get into the Christmas spirit we joined us for an afternoon of Christmas Cheer on Sunday December second Sunday December second to think how old are your sons is amazing I could tell the group Boston jazz voice ...\nSing holiday songs as the amazing I can tell a group\nBoston jazz voices fans of W GBH is things that thing competition will recognize them as last season's finalists their stunning vocal arrangements create a unique and rich sound that we'll have you clapping your hands and moving your feet tickets are thirty dollars each a family for a pack\nOf tickets is available for one hundred dollars the event begins at five o'clock and concludes at seven o'clock the concert takes place at the ... center\nOne oh nine Skilling road Winchester\nParking is free enjoy refreshments or wrestling silent auction spaces limited so purchased your tickets early and for more information you can call the Armenian tree project\nSix one seven nine to six eight seven three three that six one seven nine to six eight seven three three or you can go to Armenia tree dot org for more information and again that event is Sunday December second and you know what that takes us rate to New Year's eve for the first time\nBringing Rhode Island and New Year's party you don't want to miss\nAll start entertainment featuring California's own hot\nChili on and touch it gene Gary and\nAlso playing the multi talented mal bar same in in coming from New Jersey Steve us begin junior a full Armenian misery buffet New Year's party favors complimentary champagne toast and valet parking you don't want to miss this for table reservations or general information you have questions call upset\nFor zero one to five five to seven nine seven two five five to seven nine seven tickets can be purchased at ...\nDot com as well and a portion of the proceeds will be donated to the local Armenian churches here in Rhode Island and again this is a New Year's eve you don't want to miss out Sinai\nSaint saint methods of God in order to time as the place\nYou don't want to miss out now I think it's I think that's the guy didn't notice time as a plate December thirty first we'll see you there\nAlready when's that let's go back to I'm In good a good dog\nLa la\nLa la\n\n[noise]\n[noise]\n[noise]\nMan robbed a bank\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\nLaw then they don't\nTo be Sunday Morning nine to ten am with porches according to transcribe think about what message ought to get married you can hear all of our program on ... on our website on WWW dot Armenian reading why would dot com WWW dot Armenian radio our dot com you can write Nissan it\nAt our immunity why would you buy one for Providence Rhode Island zero see nine zero one you're listening to the army new media while we're on W. airy\nOn October thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl T bogus a cathedral of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guests will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at their Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy\nYour eyes Providence campus arts and cultural program will host the documentary film Gen silent on friday November sixteenth from five thirty pm to seven thirty PM in the past auditorium on Washington street Gen silent as a documentary by filmmaker ... asks six el GBDs seniors if they will hide their friends their spouses better entire lives\nIn order to survive in the long term care system Gen silent discovers how oppression and the years before stone wall now effects older algae beat the people in what is being done about it and missions in the film screening is free\nThe national diversity graduate fair will take place on October thirteenth from three PM to six PM at Rhode Island colleges Murray's center attendees can speak with graduate admissions representatives from local and national colleges and universities\nThey all have the opportunity to learn more about admission requirements application deadlines financial aid opportunities and more the fair is free and open to those considering graduate school\nThose wishing to attend the fare can register by visiting diversity college fairs dot com\nYou are listening to W. A. R. A. Thirteen\nOh ... ... you're listening to W. A. R. S. Thirteen twenty I'm ...\nMy name is Chris Wyoming and I'm the manager of the elder dental program we're inviting any seniors residing in Massachusetts who are sixteen older\nTo attend our free dental screening clinic in taunton on Saturday October ... from a forty five AM to one PM participants will receive a free dental screening and have\nAn opportunity to speak with a dentist and the clinics relaxed and friendly setting participants will be screened for oral cancers and have a chance to receive free dental cleaning\nFor more information called seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental\nProgram a project of the community the NA\n\nAnd\n\n\nAnd then put me in the ...\nThe wrong things\nThe dog the and\nMe a nice\nThe thing that\nNo longer\nNon the bombing\nMe the big big man made that\nThank you for that I read the lord of the people that you got to be working\nKnow we have limited New York city not worth it\nKnow we have come in New York how do they not washing immune you lord ... thank you thank you and what not but we we thank you for your God we thank you lord\nGo wrong with that you may God and we are near\nToday we lift up our hands lord\nAnd we've been raised\nA weakness you walk on\n... ... what do you wonder if we can all hope you will help you would have you on\nNa\nNa na na na na\nNa na na na\nNa na\nYou'll do I mean\nThey may be\nRight now more\nThan ...\nMillion man man I really really you play you know we didn't\nSee the\nNa na na na na na na na na na\nNa\nNa na ... your name\nThe Senate and do you make the you know there were a man and then they may be on a loan\nKnow the ...\nYou have your dry\nEver be a nice them and to me and I live on a plan to address me I'm not saying that\nOn\n\nNa na na na na\nNa\n\nNa na na na\nNa na na na\nNa na na na bang the\nKnow a\nA lot of angry uh\nLa under\n\nThing in a\n\nA\nA\nDa da\nDa\n\n\n\n\nOh\n\nIn in\n[noise]\n\nMm\n\nYou know we serve a great great God don't we Hebrew spoiled\nSays that for the joy that was set beforehand he adored across you know what that joy is that's me and you being restored to fellowship with the father he did it for the joy\nAnd you know what we can have joy now why because we can worshipping him praise God for what he's done if he didn't do that\nWho knows where we'd be I Know where we'd be going\nSo let's just take a moment and praise him let's have joy for what he's done in our hearts father we\nThank you we praise you got your glory and honor thank the lord for sacrificing your son\nAll we love your law we thank you\nIt's in your son all we love your law we thank God thank you for your great love for our Scott because of that love will never be the same Nike\nOr praise God\nSo when you're having a hard day's think of that year his joy\n\nIf you look at it in that sense it's a whole different world has ever have a rough day where you're wrestling struggling\n\nFor the joy and we had another joy to we can be in heaven ... praise God just go to the lord and prayer I Know there's many needs many requests if you have a\nNeed um please raise your hand um fellow believers around them layer handle not shoulder\nSays I Want one hurts we all heard part of being a family when families go through things they stick together\nThey pray with each other they hold each other up sometimes we hold each other's hands\n[noise]\nJust to bring confidence and encourage me to go to the Lord's Prayer father God we're so thankful\nThankful for who you are God not only\nUm lord who you are or that your name should be less than glorified but lord you made so many provisions through the cross lord you made forgiveness of sins dear God drink you covered our sins guy you bury them and lord also you brought up about the fact of healing God\nIt says that by your stripe shore healed\nMore through calorie you've done so much and lord we just come before you before you ought to be\nYou've done so much and lord we just come before you before we on behalf\nOf lord the those that raise their hands whatever that need is God you're the God of the impossible you could do anything you've created this earth God nothing is impossible for you just give us a face to believe the lord to receive what you have\nFor us I pray for each one of those hands that were raised guide lord as we find our hearts together with those\nBelievers those brothers and sisters and Christ I pray lord that you would reached down and law that you would just touch them more that you would heal them lord that whatever the need is lord whether it's financial or spiritual\nWhatever it is God you know and it says in your that your seat at the right hand to the throne of God interceding and lord we just ask\nYour will law does your answer would be on the way even right now got lord we asked us according to will in your plan God I pray that you would do the supernatural\nLord it's only you can do God lord for those that have lost loved ones recently\nGod I pray that you being a God of all comfort would comfort them God and lord that you would pull your law then you're ... you're you're touch upon their lives and lord that they would sense your your love and our hearts Scott and I just pray that you would just have your way and those\nWe have a daily interaction a daily annoying thing with that spirit that we must be aware of and listen to be taught from\nNow generally annoyed doing is points back to a specific time a ceremony something that changes\nA spiritual equipping in ... in our lives and you can never go back for example the Old Testament kings were anointed the kings\nDavid for example or so as David stood there among his brother's Samuel took the olive oil he abroad important on David said symbolic of the Holy Spirit and the spirit of the lord came mightily upon him from that day on\nEven though I'm the oil represented the spirit there was something really that changed there was a the oil is just oil but the spirit came upon David and his life\nAnd his rule was radically change where was radically changed Jesus was annoyed with the Holy Spirit in power and we still annoyed eat are Christians for leadership today for example ... and I were that we had in the hands laid honest in Carlin bill Illinois you'd have to look that one up on the map\nSo wide spot in the road and we were set apart we're or day in their uh when we became missionaries over that Springfield, Missouri and they put oil on us and lay the hands on us instead of suicide they\nThere was a special equipping spiritually that came in and John honest\nThere was a special equipping spiritually that came in and John is telling his church inverse funny but you have an annoying thing from the holy one\nAs charisma you have the Cristo so the ... you are you see the word play there you have an annoying thing from the holy want an all of you know the truth\nGod did not equip you or create you to sit in a few occasionally he created you to be a warrior to help push back the powers of darkness\n[noise]\nIn um after World War one\nThis song was the most popular song [noise]\nIt's a title how you're going to keep 'em down on the farm after they've seen ...\nThe very simple it expressed the feeling okay these farm boys have gone to Europe they've gone to the plays they've seen the big city they've experienced\nAll vis how in the world are they ever going to go back to the farm\nThose look at the word to can you put that back and just the words can you okay how are you going to keep 'em down on the farm after they've seen free how you're going to keep them away from Broadway jazz in around and painting the town how you're going to keep them away from harm that's a mystery\nThey'll never want to see a rape or plowing that goes on so anyway the point is they were changed after having had the experience of Europe\nIn the same way once you and I have been touched by God things forever change\n\nCannot go back to knowing what it was like before knowing God intimately now as salvation ... I'm I'm the find something out a little here\nNow as salvation ... I'm I'm the find something out a little here you a salvation experience can be a wonderful experience\nBut for many of salvation experience is simply something legal like a wedding planning a wedding certificate or an adoption certificate you were brought into the family of God and you may not there may not be a lot of emotion\nIn other words it's more judicial then then experiential however we believe in this church is that there is a baptism in the Holy Spirit and in culture what the Holy Spirit that changes everything\nIt's an overwhelming intimacy with God that touches and fills us with the spirit consequently there's no room for doubt anymore you know that you know that you know that you know you've been touched by the living God\nAfterwards you know him who is truth and you can identify the counterfeit now these ... they denied that Jesus Christ\nRight that's what they denied denied that Jesus came in and they physical form\nWho is the body of Christ you and I write who was the body of Christ back then the brothers and sisters in the church these people went out from the church they look back at him and said there is nothing of Jesus in that church\nYou and I are now the body of Christ and they denied the spirits annoying thing on the people they left\nWell the next two point a point of John of support this idea of annoying to\nRemain in the annoying thing versus a twenty four hours to see that what you have heard from the beginning remains or abide and you if it does you will also remain or abide in the sun and in the father and this is what he promised us even eternal life now when we think of something\nAnd this was what he promised us even eternal life now when we think of something remaining we think of something that is rooted like a tree that has its roots going down into the ground or we think of a house that has a foundation that goes down into the ground on a footing\nRight and John's wart picture in in John Fifteen is that of the the branches being attached to the the um\nThe fine thank you I forgot my word there the branches being attached to the vine and but you know that's only one part of the word picture he's saying remain abide stay connected right now I don't see many houses moving around\nI don't see trees walking down the street in other words it's the back side of that word picture that's important un I have the ability to walk away so perhaps maybe today a better word picture might be staying that marriage\nStaying that good relationship do not walk away from it remain do not walk away because we have the ability to not walk in real life\nWell last summer county and I were working in the garden and normally we chain up our dog\nBell ah [noise] and we're busy working and the one we ... we discovered she was gone and she's usually right under our feet so much it was a surprising thing we started calling her we became frantic and I'm\nSo eventually we started going down the street and sure enough eventually here she comes running up the street scared and there was a lady following\nHer or she had gone out for a little walk on her own the past that we normally take when we do go for a walk only\nOf staying on the sidewalk like we do she wandered into route one fifth\nOnly instead of staying on the sidewalk like we do she wandered into route one fifty two and this lady saw her stop the car and was making sure that she was trying to catch her but bell ran home\nOr in the same way you and I can disconnect we can wander away it is fully within our will I say I said we all like sheep have gone astray each of us has turned to his own way\nFriends let's remain in the annoying thing let's remember all that God has done for us\nThis annoying thing even comes with a promise eternal life\nBut we must continue to distinguish between the counterfeit and the genuine as for you the annoying thing you received from him remains in you and do you do not need any wants teach you but as his annoying thing teaches you about all things and as that annoying thing as real not counterfeit\nJust as it has taught you remain in him now do your children continuing him so that when he appears we may be confident and under shamed before him and his coming\nWe learned to identify the counterfeit by knowing the genuine my secretary in Connecticut she could identify that as a counterfeit because she knew every check\nShe wrote almost every check it only only one or two did she not right she knew immediately as soon as she double click on that she knew that that was a counterfeit that could not be pastor we you never signed that type of check\nLast month I met a a a lady whose job is to grade gemstones\nShe's hoping to get a promotion and learn how to grade diamonds she's not going to have to know alert be taught about counter fence because she's going to become so\nIt's not gonna have to know alert be taught about counter fence because she's going to become so intimately acquainted with the genuine the counterfeit will be easily identifiable in the same way we need to know Jesus intimately and remain in his teaching and among those who loved his teaching\nJesus told this story about a good shepherd the gatekeeper open the gate for him and the sheep peers his voice and come to him he calls his own she by name and leads them out\nAfter he has gathered his own flock he walks ahead of them and they follow him because they recognize his voice\nThey won't follow a counterfeit\nThey will run from him because they don't recognize his voice my sheep recognize my voice I Know them and they were following me\nFriends there are many false ideologies and is them out there in the world and they they will lead us astray some of them might even have good motives but it's not the same thing as walking in the genuine light of God\nWe you and I are called to walk in the light\n\nNa\nNa\nNa na na\nNa na\nNa da da da da da da da da da da da da da da\nNa na na\nA senior\nBelow zero leave on a really\nOn a new\nReason we know that\nLow\n\n...\nMedian your jobs when he died in the\nI'm\nA\nOh\n\n\n\nYour eyes Providence campus arts and culture a program will host the documentary film Gen silent on friday November sixteenth from five thirty pm to seven thirty PM in the ... auditorium on Washington street Gen silent as a documentary by filmmaker ... asks six el GB the seniors if they will hide their friends their spouses their entire lives\nIn order to survive in the long term care system Gen silent discovers how oppression and the years before stone wall now effects older algae beat the people in what is being done about it\nAnd mission to the film screening is free\nRhode Island college will hold their full open house on Saturday November third from one PM to for thirty PM in the very center prospective students will have the opportunity to meet one on one with faculty and staff to learn about programs in student services students can explore Rick's campus through tours of the quad\nFind a performing arts center residence halls and the rec center there will also be academic presentations and an informational presentation on missions and financial aid your eyes Providence campus arts and cultural program will host the documentary film\nGen silent on friday November sixteenth from five thirty pm to seven thirty PM in the past auditorium on Washington street Gen silent as a documentary by filmmaker student addicts that asks six el GBDs seniors if they will hide their friends their spouses their entire lives\nIn order to survive in the long term care system Gen silent discovers how oppression and the years before stone wall now effects older algae beat the people in what is being done about it and mission to the film screening is free you are listening\nTo W. A. R. A. Thirteen twenty am Adel borrow\nOctober thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl T bogus a cathedral of St John located at two Seventy one north main street in Providence is\nSt John located at two Seventy one north main street in Providence this is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states gas will also have the opportunity to learn from local organizers about gun control activism today\nCarl ... is a professor of law at thirty Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy\nHello I'm Dan Lewis and welcome to biblical insights with pastor del and now pastor del them Austin as\nThank you guys for showing up this morning a week because there's no church service without so I really appreciate that and thank God for your presence and God never disappoint\nOr even do at times we may thanks so every time you take a step toward God it will take multiple steps towards you and blessed you in ways that you can't even imagine so your presence here this morning we'll be greatly reward it\nOr not because I'm saying so because the word of God will be shared with you guys have been shared in the past and you will leave here uh knowing a little bit more and more a in a positive\nLittle bit more and move a and a positive way and your relationship with God\nA very quickly\nI Want to share with you\n\nI Want to share with you out of a and Romans chapter Romans chapter tens\n\nRomans chapter ten versus a ... Seventeen the apostle Paul is talking about faith and how we get face\nAnd says faith comes from hearing the message and the message is her through the word of crisis and I thank\nGod for the opportunity to steady the word of God not only on a Sunday Morning\nNot only personally but also the opportunity to study the word of God with someone who study it off for a long time and with someone who admitted that\nThe focus to not only educate themselves but to educate others and the word of God so if you want to have additional face if you want your face it to grow\nThe steady of the word of God is very important and as a as a church we're trying to offer you numerous opportunities for you to come to study the would have gone\nAnd we know Sunday Morning that spot and we know throughout the week there many of your work many of you have responsibilities so if I offer something on a Tuesday Morning not everyone will be able to attack\nSo if I offer something on a Tuesday Morning not everyone will be able to obtain so choose the morning you would come to a Bible study and on Tuesday evening you could come to a this new pass away of freedom that we are right\nOn a Wednesday ah I really want you to to come and try pasta Rogers Bible study\nYou'll be blessed by it and those of you who've attended it you know it's good you know it's great pasta Roger has been a great friend to me it's been a mentor to me\nA as a pastor now I consider my pastor at times when I'm feeling a little frustrated filling happy and then we'll get together and he'll help me see things that I'm not quite seeing so\nUh I think God for sending him back here and I thank God for allowing him to do the ministry that he's doing in the church to on a Wednesday evening at seven\nLight so I'm going to let you know about it you know go about your business as I go about my business so we did communicate\nBut it's a it's a communication that's based on the fact that okay I Know I'm not going home with you [noise] so I give myself the permission to say things that perhaps I might not upset if I Know it was if he was a relationship that have been through it\nMight make some sense folks\nBear with me because a lot of people do not understand what progress so therefore they they cannot use it to work for them so I say you cannot have ... which is communication if you don't have a relationship so\nThe nature of the relationship that you have will shape the kind of conversation that you have so if you have a relationship with God on data to strangers that you could understand that kind of communication that you have a ...\nBecause you just passing through and God's lights and likewise gotten just passing through in your life radically you know you ... you you may pause and you ask for a favor from a stranger but they tend to be something substantial\nBecause you don't have the kind of relationship with a stranger perhaps you may say okay I Need to get through excuse me and the person step\nTo the side and the person let you go out of your merry way and ah\nSo you ask for a favor their granted to you but it's not something substantial\nSo if you have a relationship with God which is that over strangers okay imagine I see a stranger on the street\nIf I tell him to excuse themselves so I could pass through most likely he will comply unless you know I give them the wrong by unless I asked the wrong way I Would imagine that same stranger who just comply to let me\nRight but in managing the same stranger who just comply to let me passed through because I ask it in a great tone of voice in the great matter imagine I\nCause I just would you let me borrow a thousand dollars\nWell whoa whoa whoa what where's that coming from I don't know you from Adam so why would you ask me for a thousand dollars why would I give you a thousand dollars when I don't know you will matter okay it's it's\nIt's it's like you know which strangers there's certain things I couldn't ... with a certain things I cannot go into because we don't have that kind of relationship that is why I say you cannot have communication without a relationship and the relationship will determine what you could talk about\n\nLike why the certain things are going to announce the stranger you cannot you cannot not a stranger some\nPersonal information you know what's your blood type where are you going with the\n\nHeat up so\n\nWas imagined that uh you to people who work together you have a professional relationship that in a professional relationship you know I'm every Monday to friday you talk about professional stuff work related stuff\nMaybe friday before work and\nYou might say oh I have a great weekend you know I really you know go enjoy yourself you know you might offer some wonderful ah wishes to the person\nCome Monday when their combat as co worker you might change if you gossip hearing that a few things you know but nothing ... or those serious because it's a professional relationship okay\nThese are serious because it's a professional relationship\nOkay imagine you have a professional relationship with God right\nEverything is so formal everything's work related uh you know there's certain things you could never get into because as a professional relationship\nAnd that certain things that you know it's not because the person does not have the capacity to be a black guy but he's a professional relationship and then when you reach certain activities that might be\nNormal in a different relationship you got about ...\nAnd a professional relationship that certain things you could not talk to the person about certain things you cannot say okay let's go and do it together because you know as a professional relationship\nPrayer is sort of like that if you maintain a relationship with God it's going to be awkward you were asking but you don't really have paid for what you're asking for because you know it was out of the bound because lots on your camera and and your wife\nYou know a ...\nThere was no solid foundation for what you are asking for and likewise got cannot come and talk to you because you keep it a professional relationship now they may they may be things that God is able to grant you would in a professional relationship\nRight but they're they're going to be things that he's not going to branch you they're going to be things that I look at you you're going to be uncomfortable coming to talk about about\nImagine you have\nA profound oh intimate\nRelationship with a person now think about what sort of conversation do you have with that person you talk about all kinds of different\nIt's all most all different\nWhat kinds of different and it's almost at all different times some of 'em might be trivial some of them might be super phone not okay the conversation gets to be a little tense and some of it or they might be life transformative\nAnd there are certain demands that you make from that person that you would never dare ask someone else\nAnd there are certain times you make the phone call you know\nAnyone else you wouldn't dare call at this time but to that person you're good because you know we have that kind of relationship\nSo you cannot have prayer\nWhich I'm calling the communication of conversation\nOutside of a\nRelationship and based on the relationship that you have then you will know\nHow that relationship will end up the communication and the top of the communication that you could have with the person what you could ask what you cannot so with these things in the back\nGround let us go through the tax settled to go through the tax and then think about\nHow God how you work with ... and how God works would you uh\nJames as\nIs any one of you in trouble here should try is anyone happy\nThem sing songs of praise is any one of your sick you should call The Elders of the church to pray over him and annoys him with oil and the name of the law and the prayer offered and face will make the sick person well the lord will raise them up if he had sent you will\nAnd well the lord will raise them up if he had sent you will be forgiven\nTherefore confess your sins to which other and pray for each other so that you may be field what James is saying is this prayer is so important that he\nOught to be done all the time under any and every situation\nFor average so important it ought to be done all the time under any and every situation\nBut because privates like communication of conversation is going to happen in the context of the relationship that you have with the person then how we engage in that\nConversation is important and its relationship is any one of you in trouble\nThere are a lot of troubles that are taking place in the world I feel bad for them but in my ways of thinking and I'm like well that's not my problem and a certain problems you have there are certain people you're not going to call you cannot called\n... Rajan you've got a lot higher in the middle night\nNot going to call someone that you don't have a profound relationship\nYou imagine that you have you know a serious financial difficulty you not gone to a ball there's someone that you don't have a profound relationship with someone you having an intimate relationship what they're going to know about your flat tires whenever that happened\nYou know if they're in bed wake them up\n'cause I'm In trouble it's not anybody else\nI'm up 'cause I'm In trouble it's not anybody else who for me I can come to you because you know we have that kind of relationship so what kind of relationship do you have with a\nYou know it\nIs God the person who hear your prayers last\nBecause in some ways you already know that you can't even bring those things will God's or you have already brought those things for your financial consultant you would already brought those things we'll say or if it's you you already brought those things are your friends and so I Can't even bring those things to strangers\nAnd then oh none of 'em could have helped let me call got about\nAn a close relationship you have your talk about anything and everything and when it's time to ask for forgiveness you do that when it's time to play around you do that when it's time to be serious you do that a and sometimes you just in the presence of the person's just because\nYou do that a and sometimes you just in the presence of the person's just because you like being the president's surprise it's coming and to God's presence and spending time with that and you know\nTwo weeks ago I should what you guys about the power off your words and I was showing you how did got created the world and I was showing you how God created the world by for claiming an idea and that idea becomes reality right\nYou know you one idea where you from your problems\nOne idea where if God comes three you\nWhile you're driving your car and give you the right idea you fix that problem so you may think you have money problem you don't have a money problems you have one idea from the lord why\nIt was as well I I have this issue if God was to come to you and give you that one I did that only God can get your solution that will come so that's why he was he wants to spend time with you\nBut when you're already comments that I knew what I Want to know what I Want is I I'm not I'm not going to give your leftovers I'm not going to give you a second\nBest I Want you to be connected back to me and then once you connected back to me at times when you less expect that I'm gonna tell you how I'm going to care for you I'm going to tell you how I'm going to provide for you and I'm going to tell you you know what\nYou're not going to have anything but I'm going to give you the piece that you need in the midst of this problem like into fall migration will be sustained you know sometimes we don't like to hear that\nWay since my voice was staying you because I Will renew your mind\nEnable you to enjoy life focusing on things\nA enable you to enjoy life focusing on things that that matters to me focusing on things that matters I suppose of the things that you don't have as opposed to the things that are ultimately that do not matter\n\nMy brother was in my sister's God tells us\nThat prayer is powerful prayer was affected\nWhen it's done by righteous person and I should which you are the reason why he says the righteous person is not just talking about the piety as much as that is important but he's also talking about people who understand what it is\nAnd prayer cannot be separated from the relationship\nAnd the relationship will shake it as shapes the relationships because lots of times the greatest thing that God will do for you wish to change your thinking you won't change your financial situation first you want change your physical situation for us but it's going to change your thinking\nAnd I was telling you some of you\nYou telling God do more jewel\nTomorrow\nThen I Will do this in God's has already give you the day go enjoys a no no no change there's been a lot of joy says no no I wouldn't give it to you\nSo that things that got over to give to yoga and to me and he's telling us to\nWork on those things appreciating does things maximizing those things and change a perception around those\nNon mall\nAs I uh\nWell and more as I\nAs I read broadly not only within ... Christian scriptures and Christian communities writings and read outside of it yeah that that I'm reading this thing we're supposed to talk about you know how do you enjoy life how do you stop all this negative things oh this is that really brings you down\nAnd then you know that frame it in their own way but\nIt comes down to stop enjoy the now that you have in front of your stop enjoy it give thanks to it and I quickly realize what they're saying is\nFor us when we pray that's what we do when you pray correctly what do you do you pause and the knowledge that you have somebody who is greater than you and your life and you have somebody\n\nWho stopped hearing you on your trial that you could bring all your burdens too that you could talk about everything and somebody who was over who's going to open your eyes not only to the difficulties that you have and tells you that he has a covered but also showing you the wonderful things that\nYou have an ... sometimes you're going to come and you're going to confess things that are when you do and sometimes you're going to go and you're going to practice grits furnace given sex right and sometimes we're gonna come you're going to praise the lord\nBecause you cannot do something with that keeping some of it to yourself I mean you're gonna example tried getting excited and worship service and still be depressed for that moment right\nAnd still be depressed for that moment try\nTry bringing joy to the lord and not have it you know so it's impossible\nBecause as you doing it to the law that's why you asked me to do with God that God is not this person who's so uh uh equal to stick\nTo go just to go and just worried about people doing things for him he asked you to do it because he knows and you're doing it for him you don't want to have at yourself\nBecause when you pause and you begin to\nConfess people pay good money to go to a therapist confess the wrongdoing and sometimes if they don't go through a self as they're called you\nDon't you have friends call you were telling you about a death sentence because they the look entering you add the ... in you as a as a confidence right\nNone of your friends who called you and says just what I did the other day the conference was bothering them they need to talk about the telling you because they know you're not going to let the the information out but then if you talk about it\nI tell you to go and praise though I don't want to play when you go on for what you're going to do you're going to confess whenever there's a lot and it's going to bubble up and you don't need to pray about it you need to tell another friends about it because really telling God to write prose\nDon't you have some moments where you want to shout and get excited and you want to share with somebody\nThat exercise when you're happy like that shock to the law which is ...\nIt to the law because it's not it's not every day a friend who's going to be available and sometimes it's not every day\nIt's a lot because it's not it's not every day a friend who's going to be available and sometimes it's not every day that a friend who's going to want to see him being so jubilant and excited about that and it's because some people are jealous\n\nDon't you have moments sometimes where you want to give thanks for something\nYou want to uh uh ... all the things that you were grateful for because in doing so with the help you\n[noise] well that's my primary\nWhen you go to the lord sometimes in your pores is is you know I'm really grateful for what you've done for man and and and I'm Glad for the fact that okay if it wasn't on my side there's no way I Will be here if it wasn't you who have gotten the adult this impasse that hopefully no one else no except me and you\nI wouldn't be thank you for that\nThank you for the fact that I got into traffic because my mind was somewhere else\nAnd you allow me to get into a traffic without another call coming up the same time thank you for the fact that I didn't get into an accident but somehow others have been killed by but somehow in some way you preserve my life so I Know it's not me being smarter and I know it's not just to make\nIt off the call I knew someone was looking out for\nThank you for the fact that before you let something happened to me somehow you give me a for a warning about\nSome of us truth be told\nTroubles that we've got ourselves into God did warn us about it you forgot about it later on when you're dealing with the consequences but truth be told God did warn you will\nLater on when you're dealing with the consequences but truth be told God did warn you about it\nSo thank God thank God for the fact that the Holy Spirit every now and\nThen as you're doing right now are you telling you about some say telling you about a a way of change in your life away of pausing and acknowledging what's important\nThat is what prayer to pry forces\nYou to pause and acknowledge what's important in your life and this race mean we we were living sometime we were running around we don't even know why are we running around but when you pause in prayer what does it do it helps you prioritize that which is important\nYou're listening to W. A. R. E. Thirteen twenty am apple borrow\n[noise] [noise]\n[noise]\n\n\n\nUh uh uh\nFor\nUh [noise]\nUh [noise]\nOr [noise]\n\n\nA\nYear or a or [noise]\n[noise] [noise]\n\n\n[noise]\n\nYou know on the news oh\nA a [noise]\n\nA ... [noise]\n\nOf\nDay for doing nothing on the phone for a man\nI I have a a\nA\nA\nBad day [noise]\n[noise]\n[noise]\nA game\nCome and go man\nMy father die oh come and go\nA ball now it's a\nBig man with a lot of big\nOf big yard where we can't play ball ball\nMy father\nAnd\nBe\nA one game a lot\nThan a man and do the new in the black\nThey didn't use any black or on the\nLine\nGo go go home and do the whole black\nSo I'm like the blind man on the local or who\nWho raised in a claim for my own business and a lack of man and the dog in Pakistan\nNot it's not all the lights\nSaw was like\nOh no no no no not\nAt the time to have\nLa la la\nLa la\nLa ... no vote will now\nPets don't da da\nDa\nDa da da da da da da na ... those ... now a jury pool\nSo we already know a ... la\nLa la la la la and go do ...\nLa la la\n\nKnow how can I bring the\n... or ... or ...\n... ...\n... ...\n\n\n...\n... ...\n...\nThe river men are run ...\n... ... ... ... we're going to\nLaw school ... ... ...\n... ...\nBut I'm ... ...\n...\n\n\nHappen and\nNa na\nI don't know what the man a man\nAnd\nWill be in ...\nThey are not a\n\nNot getting any\nNa back I'm a ...\nMan of la la la\nI say about about a lot\nBe ...\nThe man\nBut he ...\nHe ... he made\nBack I'm a ...\nShane gum problem\nFor me at\nNow or ...\n\nWell you probably don't want to change the whole the whole gene\nAnd this just saying\nWell you probably don't want them to do\nWhat you're looking for some reason\nAnd your comment to me I didn't\nKisses nah\nKids is not\nShoe sure he during the day to day ...\nAnd I'll give you your way standing\nAgain and I said I'm\nThey might be over\n... you know\nResult of famous\n\n\n...\n\n\nKnow\n... and\n\nThen they ...\n... do you mean\nI Wish you could see me\nDo wish I could show you Don\nLove the urge to do but\nOf one and so\nWhat was the again maybe\nNo one's wanting a\nCop in your car ... known much more than a\n... I can move yeah\nOh yeah she is married and bring a new born on the air news ...\nNews no lie\nYour rainy\nYou're listening to W. A. R. S. Thirteen twenty am apple or [noise] [noise]\n\nYes and then this is\nIn them and put it in the name the just\nBecause [noise] we've come with a lot of the center predators\n[noise] we\nDo know about ... years\nSays oh let me just a\nWe pray but it would raise it out loud but other\nIn\nThe day and I'm never\n\nMany who didn't have\n\nDa\nDa da da\nI'm\n\n\nOh\nOne\nMeaning nine nine ... ...\n... ... ...\nIn my\n...\n\n\nYou know\nYou mean like ...\nMe\nIn my\nYet\n... na na na\nNa\nNa na\nDi di di\n\n...\n[noise]\nOr a\nA\nUm\n[noise]\nNah nah\nUm\nOr\n[noise]\n\n\nYeah [noise]\n\n\nLike oh\nYou\nCan get\n\nThen by\n\nDa da da\n\nLa ...\n\n...\n\n\nOh no no\nAnd I\nAm so\nAh [laughter]\n\n\n\nOh\nOh\nOh\n\n\nOh\nRural older\n\n\nAh say\nYay\nYeah\n[noise]\n\n\n\nOh\n\n[noise]\nOh\n\nMy God\n\n\n\nKnow\nYou\nAnd\nIn the ...\nReally we ...\n\n\n\n\n[noise]\n\n\n\nUh\n\n\n\nThe day\n[noise]\nYou're listening to W. A. R. E. Thirteen twenty am apple borrow [noise]\n\nLike whoa whoa whoa\nWhoa whoa whoa\n\nWhoa whoa\n\nWhoa\nWhoa whoa whoa\n\n\nI\n\n\n\n\n\n[noise]\n[noise]\n\n\nAll money gone to use my brothers and sisters\nThat I've seen through my own law [noise]\nMy normal I mean in my words\nMy dog in my words\nThey bring in the\n...\nNo no no no I\nKnew that I Know that you know what the ...\nYou know I got\nMom or you\nNot a lot\nNo that was the last\nA name and I need\nNamed\n... mayor\nMan well we\n\nMay ... ...\nNo no no no no\nBig ...\nNo no no no ...\n... ...\n... ...\n...\n...\nOh I'm a\nOh no\nNa na na and\n\nOr ...\nOr ...\nOr ...\n\nNo oh\nNo\nOh ...\nUh\nA no no no no no I'm In new\nArea la la la la la la for\nA\nLong time oh\nA hold on to do a a\n\nA\nR\nA M o\n\n\n\nO\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nI ...\n... ... [noise] most Mm\n\n[noise] [noise] [noise] no\n[noise] [noise] [noise] [noise]\n[noise] no no\n\n... [noise]\n[noise]\nI mean he the need\nThe\n... I Need\nTo be\n... ... ...\n... ... my ...\nAh ...\n... ...\n... ... ... [noise]\nYou oh da\n\nKnow\nNo no\nNo oh\n\nNo\n\nLove ...\nTrips didn't move 'em\nTeach me a\nYour little ...\nYou know ... ...\nKidney ...\nDon't remember what a\nIn what he did you do\nIn making a big thing about ...\nYou ... a\nFriend who lives in Manhattan\nOh no no and then you\nKnow the next day\nJust didn't\n\nYou know you really don't know I mean you know a new way\nDid you\n...\nMeaning\nThat I\n\nDon't know\nDo you\n\nReverse the\nThey were based on\nEight\nSome days you're ... you're on your way\nTo go straight\nLauren thanks very prone\nBurning or do\nSaid hello you're on the road\nFor a long way\nOn your way\nSay goodbye to the ... member\nA job here the last rain\nDay would be\nYour most shut shut up out of\nYou got people leaving\nKeyboard and receiving\nAll it's All right\nHe gets All right well he'd have a real good time\n\n\n\n\n\n\n\n\nA\n[noise]\n\nA\nA\nA\nA\n...\nWho\n\n\nUh\nUh\n\nUh\n\nBe she saw\nShe\nThat I can\nYou\nMe happy\n\nYou're listening to W. A. R. S. Thirteen twenty am Arab world [noise]\nThe um\nAre a\n\nWhile the ban will be you\nWe do we do\nThey give you my\n... bill the strong ... ... ... ... ...\nWell no one knew\nDo you ...\n... barrels\nDid you not\nBe oh\nSometimes\nChange\nHe\nThe top of the\n\nDay the\nDay\n\nYou know oh ... oh whoa whoa whoa whoa whoa whoa wait a\nMinute [laughter]\n[noise]\n[noise]\nI don't know if\nIt's not going to a\nLot [noise]\n\nLove dry in these teams and then\nThe time\n\nAbout all the ... the\nWe\nJust did the ... the the\nStuff is\nHard to\nDo that on our\nWe're aware the bomb rescue man can bomb locked arranged it happened the generator\nBees style but they're\nIn that actual power is\n...\nWell you're in a new\nBook the\nShooting with us today is around me\nGoing to do and my mother\nNews show me\nThe ...\nMan care than me\nMeans to me about\n...\n... ... ... ...\nNo\n...\n... ... ... ... ... ... ... ...\n... ... ...\nIn the in\nMean he was\nThe\n\nOn\nAnd\n\nAnd\n\n\nAnd\n[laughter]\n\n\n\nIt can be\nSurrounded by a clue what well not the\nCheese and well\n\nAll ... about\nThe whole you know not\nBut I broke\nYou're listening to W. A. R. A. Thirteen twenty am Arab world\n\n\n\n\n\n\n\nA lot of\nFrom\nLa la la la la la la\nWhile a\nNa na na\nNa the\nOver\nA man\nYou give me\n...\nYou ...\nMe at\n... ... ... ...\nThe ... for me the whole\nThe edge\n... ... ... ... ...\n... ...\n[noise]\nNo no no\n... ... you're\nMaybe\nCome on the ...\nDo you love\nRoll your hair\nNeed you\nYou I'm not a young guy\nIn New York New\nMaybe\nTime of the\nThe the the book the\n\n\n\n\n[noise]\nIn fiction\nOn this show sometime conviction [noise]\nPlayed maybe you when you come face to the\nThe news has to be the man\nWhen he made his thing when\nThey finally again\nKnow it could be ... could not or something and I am good to\nKnow who she drew who would do you just look grow\nHa ha ha ha\nHa ha\nNon by\nI'm not I'm\nNot\n[noise]\nNo ... on a ... day and a Chinese done do\nDo\nBe\nA\nDuring the day or\nDo not\nDon't read\nWhile\nA minor ...\nNa\nNa na na\n\n\nBomb\n\nOh you don't want\nMe on\nOh oh\n\n...\n\n\n\nA\n\nThat all of them into Baghdad\nBring it in a man who can\nA little bit like me\nIt all comes\n\n\n[noise]\n\n\n\n\n\nThing\nBefore during and after the ball and then after that\nLike ... and ... and\nA little bit\nIt all over\nSaid oh no that's right I\n\n... boys are just as true ruling ... going on and we're already so then the more two of you\nAnd so then I was growing up here and ... [noise]\nYou're listening to W. A. R. S. Thirteen twenty am apple borrow oh\nLord I'm really glad to she and\nYou see when you feel much you have\nFor\nDog ... things\nSee them\nO da na\nHey I'm\nAnd the\nThere Jim how many do\nJust tell and nice to\n\nLong run you know I\nIn the fall\n... ... ... [noise]\nA\nPretty ...\n\n\n...\n[noise]\n...\n...\n\n... ... ... ... ... ...\nOr you can tell them all know\nSome ... ha\nHe ... the thing you know\n... ...\nFrom the new ...\nIt's going to keep the oil spill in the\n... go\nTo ...\nSong ...\n... ... ...\n... ... you know\n... ... ...\nThe\n\n[noise] [noise]\nWell ...\n... ...\n...\n\n\nVe\nThen\n... ... and that you\nWhere the snow\n\nI Do read the\nYou know\n\n\nDo the ... and\nThe way it is the first\nBe a member of the world and imagery and\nI made it to be pretty\nThe\nBe sitting in la\nThat's where really mind\nThe king\nOf needing to reach for he did\nAbiding\nAnd the need to be free and\nMonday\nSay love\nFree and\nMoney you need\nWere\n\nAnd the sweating to get away\nRelease him no\nDo it for me\n\nTell you the\nSaid to him I don't\n\nKnow what we're told me that he was\nI Believe it will [noise]\nSure nobody else do it but the law I Know\nNo body else do it but a lot I Know\nYou know you you will you told me that you will\nI Will try to know why I Believe in my heart that Marshall Law will make a way ...\n[noise]\n\nLove the sham na\n\n\n\nAnd you\nThe na\nNa\nNa na na\nNa\nUh\nYeah you know\nA\nMan a\nThe ... ... ... ... ...\nA ...\nLot of hands you\nKnow a man in charge them strongman\nNa\n\n\n[noise]\nOoh ow\nOw ow\nOr\nOr or\n[noise]\n\n\nThe\nAs\nA a really a pretty ...\nA\n... [noise]\n[noise]\n\n[noise]\n[noise]\nI'm In a in a row man di\nDi di di di di da da\nDa da da da da da da da da da da da\nDa da da da da da\nDa da da da\nNa\nNa na\n\nNa\n\n[noise]\n[noise]\nNo one here on the couch\nNa na\n\nThirteen twenty am Arab world you've found hot rock radio [noise]\nIt's time to get right with God and I'm telling you know what I Believe the whole issue for this thing is you know I'm Holy Spirit or you can show this house with your presence in Christ\nReal or you can speak to the deaths of this whole to those who knows are said to those shows box but to do so lord who have been growing old ...\nTo the cold have gone to the ... gone much pink\nTo the call the God and the things to try to do\nCome and speak you spoke conditioned to my heart\nYou know I've heard she didn't see the news to hear let him hear what the spirit and pass the say the whole now is the except the time the whole now is the day as salvation and she said this is a day of mercy ... their grades [noise]\nThis is the time for you to get right with God and deal with this nurse\nDo receive the murder she in vain don't turn away from the chance to call and Jesus to come back to his arms now this\nIs a message of grace but it's also morning now today is the day of celebration Jesus war and\nThen the last days many for going to grow coal scripture says because Mick ... show about the level of many so cruel coal and he said this is going to happen at the time he called the beginning of sorrows and folks were living in the beginning of saw\nWere living in time to sit down and it could be\nRampant inequality except she'll put versions beyond description Jesus said in those times since the beginning of sorrow and many parts are willing to go home and he said they're going to turn away if you wish to\nWalking for the whole car you've chosen the wrong time this is not the time according to the scripture to reject\nThe loving called Christ cold this leads to heart and that's that's what the scripture says he should there will come a great falling away those who received not so true are going to fall\nOh in a way to do should receive not so true are going to fall under what the scripture calls the ... sin ... showed discrepancies\nCan it can hard cold hard the scripture says\nTo day if you will hear his voice [noise]\nYou have a hard hard\nWork 'cause you're not going to listen to bunny hardness a heart that just beyond the influence\nIs leading Christ\nThey placed themselves beyond the the the news of the Holy Spirit and sell them whole sticks Blue Shield [noise]\nWith no intention of ever will be home gospel no ...\nThe lord himself good come down in the flesh the Bible says that many would not\nBelieve that refusal to accept the mercy of Christ\nPerson who keeps putting distance between Michele thank God [noise]\nSelf imposed\nCold there's bleach do hardness\nNo it was time to get right with God because this generation is last second\nThey lost the fear of God [noise]\nIs what the Bible says\nDear lord and depart from the evil\nThat fear more just to Haiti evil [noise]\nMercy I'm sure it was in ... courage and by the fear of billboards men depart from their evil the fear of the lower\nHave all the fear of the lower\nHere though I follow what you want reverential\nAll of what you want\nTo such a thing as\nYou can get the majesty unfolded itself you know I\nCan just see if you have no fear of God you have to invent a gospel of convenience and this is what's happening in America had around the world\nDo you see men can't get away from that\nSense and that's the Holy Spirit who says there's death and then there's judgment there was a day of standing before God to give it a ...\nThe Bible makes it very very clear those that have been others as hell and there's a day we're going to have to get an account the bears and hell and she's just said there's ... there's a hell of a fire\nAnd weeping and wailing and gnashing of teeth and darkness it can be felt there was a pretty good shape man has to invent a ... full where there is no God and that's where we are in the United states around the world right now no hell no head of the\nList is it so just\nTo put up with have how do\nYou see this is the danger he brings Senate Jesus that is\nTaller and that's the key word right now tolerance tall or toward the same sex marriage tall right toward it\nThere's no such thing as since there's no such thing as the senator there's no such thing as judge mud that\nShow they buy into the young people to buy into that\nMany Christian young people are saying we need to\nTolerant but now the spirit speak to that ladder time some she'll depart from the fate giving he should do sing spirits doctrines of doubles speaking lies in Hyde Park Chris\nSpiritual doctrines have double ... bickering large in ... park where she covers their conscience shirts\nOr the horror liar any amount of dog to standing there saying turn ...\nMm\nMaybe rain [noise] I Love going\nThe French the holy\nWill be the easiest thing in the ...\nI\n...\n[noise]\n[noise]\n\nSo\nYou know people on the little known people that were um you know well when\nI get a new you know we\nJust leave your mom and I\nEven man\nThe non issue I'm\n...\nA good job she\nOh see\nMe\nThe\nLa la\nRead the story\nWe\n\nI started doing\nLittle machine guns drawn what\nYou\nThe uh\nWas no no no no\nKnow marriage the\nFood I don't care about mom very\nOh no no no\nIs no need to be here\nUm the blonde hair\nMarianne Joan ...\nLow to the lord\nIs homo very\nOh why don't\nIt from your\nJohn Glen\nCome along to\nHe he may be in\nHo ho but\nYou know we need to be here\nI Know the blob\nJoe oh\nClose very da da da\nDa da da da na\nVe to me\nI'm not sure\nOh man I'm On\nTo them to know or\nTold oh there is a well known\nDo it all day long long drawn out\nOh loving the body of ... I Want to crawl back in my\n... ...\n... ...\n\nIn a minute\n... to\nIn a band here on hot rock radio\nA coffee shop or that um we heard from a another group that John another audit um that is no spring\nWe heard from a another group that to another artist um that is no stranger to the music scene here\nEspecially um uh on the plate at the upper room or we're going to hear from a Patrick Francis stoop right now he has a a CD called I Am a Christian one of his CDs he's played recently\nUh at the upper room which is located at twelve Twenty one main street and beautiful downtown which work and is at Lorenzo actually always says um where everything else is and we're going to play a track right now called salvation here on TALK radio\n[noise]\n\n\n\n\n\nNews\nLive and then\nHe's a\nAnd buying a ... of all\nThing every day you can\nLaw and\nBy the\n\nOn\nOn [noise]\nOn\n\nLine [noise] [noise]\nUm [noise]\nYour\nThen a guy and\nA guy named live longer\nA\nA security as strong as you a\nMan I mean\nA ... it's the\n\nGood\nStronger\nA guy named\nYou're\nListening to W. A. R. S. Thirteen twenty am apple borrow\nOur security as strong as you are\nYou man I mean\nA galaxy\nGuess I'm\nA security\nStronger\nA guy named\n\nStrong God you a man\nA God oh my God yeah\nGod oh my\nGod yeah Mm Mm\nMm Mm oh my God\nOh my God we're\nBut\n[noise] [noise] [noise] [noise]\nRaging grace here on hot rock radio we heard from Sean Dennis and a couple dosages of law that shut shut down and said raising glory on hot rock radio and on a don't forget a gang gang to come on down and support sang to fire a ban now I just want to just a side note\nOf last week actually there are in which just packed I mean with this\nNo last week actually the upper and was just packed I mean with the ... you know with some of these new bands I'm I think the word is finally getting out that um\nYou know to come out and support these people and support the local coffee houses um I gotta say Rhode Island ah has of a secret I Know we've been talking about it for quite some time now for ... I'd say several years now\n[noise] um about the upper room coffee house and to me at times I think it's it's still want to Rhode Island's best kept secrets you know not too many people realize you know what the upper room is it's a coffee house that's open on Saturday Night in West Warwick Rhode Island actually twelve Twenty one main street\nAnd if you're a person with a but on a on a very tight budget and a lot and who who nowadays isn't\n\nLong\nPurpose here on hot rock radio over the pulse of God's love for you that actually is a husband and wife team that played at the upper room they actually are trying to get the word out more so if you're of\nA band out there or if you're a group out there\nExcuse me if that's just rephrase is if you're a um I guess you could say a promoter or a perhaps a I'm\nA I guess you could say a music recording a studio there would like to uh get in touch with these folks 'cause they're really looking to do some work get in touch with us you can always write us at heart rock H. E. A. R. T. part rock male or female dot com that hard rock mail at G. male dot com\nYou know I think I've been getting a really distracted a lot\nIn the show I think mentally you know sometimes you can see something and all of a sudden it distracts you\nAnd I started thinking you know it's ... it is there a is there a healthy dose of distraction as well as a healthy dose of focus because sometimes maybe it maybe we do all need to have maybe sometimes in life or to either too distracted\nAnd not ... not staying on the course or we get too focused so focused to a point where we become a rigid\nAnd uh and then of course you know if there is something that God does want you to see I think sometimes got allows distractions to happen in healthy situations for reasons sometimes distractions can be helpful\n[noise] um I Know today we're doing the show um you know it no one sees the things that go on behind the scenes here but this place is becoming a very a very busy place and which is a very good thing you know this is something that\nVery busy place and which is a very good thing you know this is something that we've all wanted to see happen in the in a long time and there's a lot of good things are going to happen here\nUm but I have a I have a studio where the window and a dog with a window in it so sometimes if you're you and your back is turned you can you know when you're talking to the Mike from you can actually be focused on what you're thinking what you're going to say what you know but if you're looking toward the back like sometimes I can turn my head and\nLook out the window into the hallway and sometimes you can get distracted\nBy what you see going on or maybe someone might be walking by making noise I Know that we've had a few shows this week where not on this show but maybe last week but\nWe've had a few shows where people just I'm doing some construction work we had a fire alarm [laughter] [laughter] so there's a lot of different things that can happen\nAnd the cost of a show\nThat can get ... that can distract the flow\n[noise] but sometimes I think that there's a healthy version of distraction too you know there's unhealthy distraction as healthy distraction I Know I'm starting to sound like philosophy talk almost but [noise] um we need to ask God you know when we're being district we because we have an agenda many of us have an agenda\nI Know right now with me when I started the show today\nI was on a I was on an agenda\nYou know to obviously do the show produced a show of think about what's next\nAlways be thinking about what show where God wants to show to lead sometimes I don't even plan to show it just happens I could play a song and come lowest can come into the studio we could start talking about a certain topic that's something to do with the song and I say oh you have a few minutes ... on the air on my wife could call up I mean these are all different\nPiece of different forms of distraction but they're healthy distraction you know what I'm saying\nTwo different forms of distraction but they're healthy distraction you know what I'm saying and then there's distraction that happens where now you're losing focus\nAnd you just can't seem to get the focus back and your groove back on the show could even distract the way you you you know she speak what you're going to say so I just wanted to let you know that sometimes and I think many of us already know this [noise] that just like anything else has to be a balance\nIn your life and only God can actually bring that balance and so if you're focused on God\nTo appoint so much that no matter what life throws your way right whether it's a distraction or something else you're you're still on the same plane\nAnd I think that's something that we all need to ... we all need to get back on you know 'cause we're so busy being distracted or beings we're so busy sometimes focused in on agenda is that when a distraction comes up sometimes we can become annoyed\nYou know thank God I didn't do that today at him you know I didn't get annoyed but you know\nI'm\nYou know I'm just saying there are certain circumstances sometimes when you're so distracted engrossed in what you set out to do your work that you know have you ever felt that way have you ever experienced that in your in your\nLife I'm just something to think about um we're going to hear right now from another track called um\nLet me just make sure I see what I'm doing here before I talk about the structure and seems like today I'm just distracted all over the place huh but it's a good thing I wanted to play something for my friend Kathy will turn out there her and her husband have or her husband David Wilson\nAnd they have a awesome industry out in um the other side of the world in Australia I'm and I'm David\nUm the other side of the world in Australia I'm and I'm David Wilson had written a song or I should say is a bunch of songs on a CD called redeemed\nAnd are they actually hurt Kathy Wilson's brother is um\nLess Garrett which is the gentleman who um who actually um put the ... the popular him um or I should say wrote the popular music to the\nUm you know him this is the day the this is the day that the law has made almost song in every church um regardless of done nomination across the board\nUm well anyway she's ah she's actually um written to me on Facebook she's been requesting\nA copy of her interview I guess I'm not sure if she should sounds like she didn't have a chance to download it when we added up on the on on Facebook and on a speaker on our website on Thirteen twenty W arrow radio dot com and if any of you like to have any past archive shows\nWe can get them out to you however um you know there's a little work involved\nAnd um\nYou know we will uh you know you can write to us and that is a hot rock mail hey G. A. R. T. hot rock male or female dot com we have to just to let you know we have to take the shows the old shows off so we could put new shows on because there's only so much room we have to put up there\nSo I'm you know we usually the maximum you should keep things up there for like two ... two months to three months and then we have to take it down\nBut anyway but I I just wanted to say hello to cap the well to note there all the folks listening in Australia or Dr ...\nAnd right now we're going to hear from a David Wilson and uh this is a cool track or we're going to hear a attract called friends\nJust a cool track or we're going to hear a truck call right on hot rock radio [noise] Mm\nSo many new yes\nMeans so many and she came to ...\nGet ...\nWe played a little bit of a we play about maybe the first eight minutes of that\nIn the beginning of the show today and uh the track is from David Wilkinson get right with\nGod and I tell you ... it's a it's\nA wakeup call for ... for for all of us not just some of us not just maybe two of us not just ...\nWell for for all of us not just some of us not just maybe two of us not just tree is they say in Rhode Island I've lost\nAll of us need and and you know and ... ... it's not like I say I was trying to say a little bit earlier will cross when I was getting distracted it we'll talk that's why I brought that up [noise] um\nWe all have to check ourselves\nYou know and it's not it's not any one place she just says in his word tiny one in ... no one has the right to judge you or I don't have the right to judge lowest lowest doesn't have the right to judge me or sue or Bob you know or anybody like wherever you are you don't have the right\nTo judge people 'cause she just says you know how could you how could you judge people the way did you just put it is you have to look at you have to take the ... the the uh the spec out of our shoes me the log out of your own I before you can look at the spec in your neighbors I write\nI'm so I don't know what your lifestyle is like or not like it is and again you know what it's not really my place to judge you what your lifestyle is like\nReally my places to just simply tell you a plan of seed through the music that were playing to the the things that were sharing and it's really up to you to\nHopefully take that back to God and prayer open the Bible maybe get some word and maybe ... because the Holy Spirit can talk to you through the word of God amen\nAnd I I'm just you know\nWe all have to do a self evaluation\nYou know and I'm Talking about regardless of where you're at in life you need to invent some of us are going through life just numb and I have all this is smiling when I said that but some of us are going through life just numb you know that no matter what anyone says no matter what anyone may preach no matter what anyone may share that\nBut anyone says no matter what anyone may preach no matter what anyone may share they're not going to change it nothing's going to affect them you know but but again it all boils down to a what's in your heart\nAnd what's in between you and God amen because really that in the ultimate end that's what you're going to be faced with because Jesus you're going to eventually one of these days all of us are going to come face to face with the creator\nYou know may not be now\nMay not be ten minutes from now it may not be a\nHour to an hour from now it may not be a week from now but at some point you know hopefully hopefully most of us will get to a point where we are old and gray and we've lived a good you know lived a long life hopefully but you know what we're all going to need we're all going to face him\nAnd when we do he's going to see right in us and what's he going to see when he looks into your eyes what's he gonna see when he when you're standing or or before him something to think about promoting Lewis good morning lowest\n[laughter] always has a face on a look on her face like so much to ... oh my gosh the the wheels are just cry and we'll start going round and round yes the smell the smoke [laughter] I ... I spent all the machine\nI just fed the mice with and she's you know so they're going on the treadmill really fast now [laughter] I I mean I'm I'm Glad I did learn\nWell there's several things that um you said that I just wanted to caution people um [noise]\nWe are told that we're not supposed to judge one another and that we're supposed to remove the log from our own I before we worry about the ... that's in our brothers I but we do have a calling\nBy the word of God to judge one another according to the word of God we're not supposed to judge the motives of someone else's heart because got alone knows that um and if he tells us then\nElse's heart because God alone knows that um and if he tells us than we know that and that's not a judgment that we're making but it's it's God's telling us but um [noise]\nWe do have a right to make righteous judgments and God cause us to that but once again it gets back to us taking the log out of our own eyes and making those righteous judgments in our own lives and that's what I'd like to encourage everyone to do because\nIf we don't make judgments I mean because you can really take it to the extreme like I'm not supposed to judge so I don't know if I should wear the blue sweater or the yellow sweater today you know come on really [laughter] yeah we have to make judgments that's just kind of life what life is about do I\nGo ahead and go through the yellow light or do I stop\nRight let me let me see it as well oh let me ask the healthy judgment and then there is unhealthy judgment\nAnd then there's godly judgment [laughter]\nRight well golly judgment obviously comes from the lord I'm selling yes healthy judgment is when we we may approach someone or do something in our ... judge them and love yeah like constructive criticism is a loving thing yeah\nBut when you're ... it's ... it's the words you choose that can be damaging and could end up making the situation\nWorse right a heart with which we do things that's what we need to judge we needed our own heart\nMaybe that's what Jesus was trying to say when he was saying you know take the log out of your own I you know if we approach the thing in a loving manner ... then it's it's a healthy situation yet but if we don't approach it in a healthy men are we approach it with contempt\nOr um within ten of hurting the other person you know maybe putting a me and my wife call it a\nTen of hurting the other person you know maybe putting a me and my wife call it a a dagger zinger or whatever you want to call it yeah you know or maybe a snide remarks you know about someone's lifestyle whatever instead of doing it in a loving way right you're doing it in a way that it's hurtful yes and you know and it's not showing love that's when it's a bad thing\nMhm right yeah\nBut so it's but it's very easy for us as Christians to take that you know oh not supposed to judge\nYou know well yes and no [laughter] you know\nWe are supposed to make righteous judgments\nYou know I I personally Joe Louis um and we can actually judge everyone guilty because we're all guilty before God amen to that and for and it um but but I think if we if we carry that like and [noise] [noise] I'm a situation where you might want to talk to somebody is to just\nYou know reminded them and yourself that you are a center as well\nBecause that's where we all come from the same mould mould we all come from the same ground wing all radio in the same and dirt so we're all older than dirt were not older than dirt were as old as dirt because we're all made up there [noise] but anyway [laughter]\nWell that's right that's right and you know just trying to lighten the load a little bit there yeah [laughter] um [noise] but yeah so\nWhat we do have a right to judge\nBut we need to judge ourselves first and foremost before we judge anyone else ... so I'm Glad that you said in there that set my wheels grind into and I can't remember what it was specifically but that's okay\nOh about um you know it's not our place I like I feel personally maybe maybe when I bring it out maybe I might bring us out again I don't know but personally I I\nBuy you know I grew up in a I grew up in an environment where and not just in my own house but and people around me with people\nAmong other people you know I you know I had people like I was around people that like never had anything to say about anybody that came into their life yeah and sometimes I find myself slipping into that a\nThought mold or whatever you want to call it you know pattern of thinking and when I Do I catch myself because I remember when I was a kid\nYou know going back to Eighteen hundreds and [laughter] stop and Fred Flintstone was president [laughter] um I I actually you know I used to save gene when I grow up I don't want to be like that\nBut you know it's funny you got to be careful about not only who you make in front of a who you're criticizing but you could we all could fall into the same path and now it's like now at forty five years old every now and then I find myself at least by at least I'm smart enough to catch it\nBut I find myself slipping into that pattern like oh my gosh so I'm just like ... you know this person when I was a kid that I said I Would never be calm and I'm sounding like this person this is not good and void release spaghetti and you know you know helped me to do and we all do it see and that's all right just judgment we're making them ourselves\nYes and and um rising up and running to the lord to be our strength to help us to overcome because it's human nature we\nAll fall into these things that are human nature and um [noise] part of it got is God has made us the way that he has made us I was thinking about this when I was driving to Providence today [noise] um [noise] God has made us\nAll different and he's made us that way for a reason and part of it is for us to trust in him to help us to change and part of it is so that we're individuals so that we can serve the body of Christ in a different way\nAnd we need to run to him to ask him to show us\nAnd we need to run to him to ask him to show us which is which because of because if we're\nTrying to change things that God has made us to serve the body of Christ\nAnd not trying to change the things that God has made us that he wants us to change because they're they're ungodly than we were seeing the whole picture wrong Mm [noise] and that was just I felt like that was an epiphany for me today that", "year": "2018", "show_name": "no_show", "city": "Attleboro", "day": "14"}