{"month": "10", "state": "MA", "station": "WARA", "content": "You're listening to W. A. R. E. Thirteen twenty am Arab world\nOf the day is\nThose things ...\nThat's ... you know those the\nStrip my God just\nAnd I got no\nHe is too\nA witness ...\nWe're here and rich ...\nAround them needed me or\nMy heart\nThen leading me a\nLeading me through um\n\nIt's not an ancient\nBut what I was like oh\n\n[noise]\n\nThis with\nRaise the rich ...\nNeed in me my heart\nYes indeed and the\nThe where what you're leading made news\nWe'll watch your lead made\nSuch an ancient ...\nBut one that I Know versus what\n\n\nDanger bomb nice ...\n... oh early\nAnd then they [noise]\nAnd\n\nAnd\nAnd and na na\nNa na na\nNa\nKnow a\nBut they are in\nWrong\n\n\nDown or you\nWrong\nSleeping and the fish\nBut\nWe didn't use\nTo measure was dreams I Want\nKnow is just a college\nSo ... and our mistress and confidence\n... maybe\nAnd I'm the type thing\nTo touch the term\nSubside ...\nAnd then we'll take a lot\n... people\nPeople hearing about\nBoat riding saw\nSan ... all\n... just to\nTo say\nTheir my words\nPlease take Mardi\nDying die\nAnd ... and ...\nOf ... kind\nYou're young you got the way the family\nBlack hat and your\nBlack hat and\n\nAnd and\n\nNeed to\nOh\nDa de\nDa\n\nAnd\n\n\nJust watching it on the man but\nAre listening to W. A. R. A. Thirteen twenty am Arab world oh God oh\nTwenty am apple borrow so\nI got along the way across town\nAnd go you know I got a\nBut not only you know the guy\nA guy on long ago where laws\nThe animal and you know and he goes no may\nYour loan me and\nThe way at all times\nThe angle normally\n[noise]\n[noise]\nShe's a love me\nAll day and I\nThe global don't ...\nYour street we're right\nAround and then the three\n... alone\nYou know was the woman ladies arrived\nKnow was the woman arrived\nBack though are the hanging around the whole shot\n\n\nI\nMy in\nThe jobs\n\nThe\nA\nJob\n\n\n\n[noise]\n[laughter] [noise]\n\n\n\nThey\n\n\nDon't\nCan I just do\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\nBe the\nOnly maybe\n\n...\n\n\nDo them\nKnew\n[noise] [noise] [noise] [noise]\nOld Lovell man\nI Am a\n...\nAny goal I Am a screen\n[noise]\nThis guy ah this God\nIn\n\n\nYou know a\nA long time\nThe me lie they um\nWhat do we have to go home\nThe\nThing\nThat I can Breen brand\nAnd again that\nA show that ball for\nYeah by the by\nIraq game by home\nLow man man those are the I\n... I Am very\nI have a\nDo you go\nOn ...\n...\nAh it's a\nSaying is we're not on\nA on a\n\nAnd there are a\n\n... ... ... ... ...\nOr ...\nThat I don't lie\nKnow that I don't live\nThey read the whole time I\n\n\n\n\n\n[noise]\n[noise]\n\nMean it's good that he\nIt\n\n\nWell I mean\n\n\nMade\nMe\n\n\n\nKnow no big name\nKnew when we\n\nGo\n... ...\n... you\nJob but I knew things were\nYou I mean we [noise] you\nKnow we knew about June music on around me\n... living in New\nGum do with me Olympic which one do\nAnd so I've been shot up above\nThe clippings\nHow well we're about to\nOh you don't have\nOh I Am wondering why\n\nSo tell me why stop and say\nWell by the\nDown out of mind again they may\nGuess\nWould make me stronger in bringing [noise]\nOoh when we'll look I'm not I'm not I'm\nLet me let me get away from\n\n\n\n\nYou're listening to W. A. R. S. Thirteen twenty am apple borrow\n\n\n\n\n\n\n[noise]\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nAgainst the ...\nThe ... ball\n[noise]\nDa da da da da da da\nYou're listening to W. A. R. S. Thirteen twenty am apple borrow\n... ... ... ... ... ... happened\nHow the man\nMore happy for the day\nThey did well well well gee wow I'm All right well what what how Jesus wow when they did well\nWell what were you when they were doing last that long ago\nAll that they have the\n\nWhen\nYou walk around what went wrong Renee whoa whoa whoa whoa whoa\nWhoa whoa whoa\nIt\nFor that but that may\nHa ha ha ha ha ha ha\n[noise] the\n[noise]\n[noise]\nPull out the\nBut oh\nGee\nBe\n[noise]\n[noise]\n\n... ...\nThat may be\nMay be\nWill be\n\n... you\nWhat a day to day\nDropping Jell mail\nLa la la la\nMaybe the Google Alaska\nAnd all the way\nHandle the no\nWe\nI'm a\nLaw I'm\n\nOh\nI'm like no\n\nKnow\n[noise]\n\n\n[noise]\n\nMm Mm Mm Mm\nI can only imagine what it will I ... well no\nI I can only imagine what my eye sees when he was looking\nAround it by a clue well not see\nCheeses well then all of you\n\nI can only imagine Mm\nAll ... well no\nThe whole universe ...\nDay and your name out\nAll the man\nA man\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nI'm sure\nYou know her she\nSitting in the and\n...\n\nAnd [noise] [noise]\n[noise] [noise]\nRally university will host a lecture caught in the shadows other world than just to mention on Thursday November aid from four to five thirty PM shadow ... patterns are kept throughout the universe by the gravitational field the stars and galaxies this talk will unveil how these cosmic shuttles carry clues about the existence of extra solar planets\nAnd a possible spit dimension the auditorium will open at three thirty PM proceeding and guess they're asked to arrive at the auditorium no later than three fifty the um the lecture will take place at Brown university's icy Ahram one Twenty one south main street on the eleventh floor\n\n[noise] [noise] [noise]\n\n\nRhode Island college will hold their full open house on Saturday November third from one PM to for thirty PM in the very center prospective students will have the opportunity to meet one on one but faculty and staff to learn about programs in student services students can explore rich campus toward the quad find them performing arts center residents holes in the rec center there\nYep it's three tours of the quad find a performing arts center residents holes in the rec center there will also be academic presentations and informational presentation on missions and financial aid\n[noise] [noise]\nRight thing to say\nReally see the guy was on that plane\nA new one that\n[noise]\n\nAnd then they're shown no\nStanding and\nWhat I came down to this virus or you\nNone of God he's your mother to\nNo one can take in\nHome of mumbling\nMany rooms in the house\nMany rooms in the hell no no no no\nSome one more\nUm\nUm [noise]\nNo no\n[noise]\n\n\n[noise] oh\nNo no no real action to me it was a ringing wall ...\nNew Year's day man named Don Cheney is a\nHe did\n...\n...\n... ...\nWell\nOn\n\n\n\n[noise]\n[noise]\n\nYou're listening to W. A. R. A. Thirteen twenty am Adel borrow\nBrown University who hosts the lecture cosmic shadows other world in a fifth dimension on Thursday November aid from four to five thirty PM shadow ... patterns are cast throughout the universe by the gravitational field of stars and galaxies this talk will unveil how these cosmic shadows carry clues about the existence of extra solar planets\nAnd a possible fifth dimension the auditorium will open at three thirty PM proceeding and guests are asked to arrive at the auditorium no later than three fifty PM the lecture will take place at Brown university's icy Ahram one Twenty one south main street on the eleventh floor [noise]\n\nYou mean being in him in England [noise] mine mine\nYou may be that way [noise]\nYou may be that way\nYou may be up there like\nString a bunch of 'em I happen to\nTo them about it yeah yeah yeah\nTo them about it\nMight be in a rock and roll and\nCrime and all they need\nYou might ask about yoga ...\nWomen ...\nYou may be getting\nDegree they\nCall it that the smell that you\nThem about it yeah yeah\nMay be an effective weapon working on a horrible you live in a ...\nMinute limit us do\nThe men are stronger than you might even won't pay\nYou may be no matter\n\nHabits now about it you can\nHave to tell me about it and\nAre some body and\nMay be afraid Gen\n... you may be admitted to begin\nAnd you may be working in a bar but you know how to pay\nThe nerve to monitor\nYou may you know you may call mid may you may call me by\nYou can\nLoad you've made your call and they re\nHave gone on how to learn about it and get\n\n\nTo Maine and maybe that's\n\nI Am very and\nLet him maintaining yeah yeah\nAnd I've been thinking you know\n\n\nAnd this time of day is a\nNine to mean voting for just a dream job would\nIn a humble well\nThe news that you're\nNot going to\nDay she was saying well\nThe\nOne\nMan\n\nOn the day that he ... coup that\nA mood na\n\nNa\nNa na na\n\n\nNa\n... Mm\nMm yea\nNa\nNa\nNa na\n\n\n... ... ... ...\n... so\nAnd na\nNa na na na na\nNa\nNa\nNa we're so\nAnd\nHer age\nAnd have a game and\nFish\nAnd game and the ...\n[noise]\nThere's ... ... [noise] ... ...\n... ... ...\n\n... not ...\n... the ... been knocked blows my\nGod I've been\nHall but most ... won't\n... know\nSweets the to the book\n\nDer animals\nGreat man who\n\nKisses and a\nShoe sure he drinks a day to day\nAs you make a promise and I'll give her away standing\nAgain and I said I'm\nDoing my number\n... ... as long\nWas famous\n\nJust [noise]\nThe one and so\nI was taken maybe\nShen maybe that's\nI Wish I could show you haven't I'm not\n\nOctober thirtieth at six thirty pm that Center for reconciliation will host the hidden history of the second amendment a presentation by Carl ... the role of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states I guess we'll also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at thirty Roger Williams University School of law he has written and spoken extensively about both the second amendment and\nThe law he has written and spoken extensively about both the second amendment and gun control oh let's see\n... and ... and ... and and and and\n\nThat\nAn issue again\nCome and go man\nMy father's dot com and go man it's a\nBig man you know with a lot of big table\nOf big yard where we can't play football oh big\nYeah my father and\n...\nWe me\nAnd a ... ... ... ... ... ... ... ... ...\nYou know much more than a\nCop in your car and he should know much more than a\n... I can be a\nA young man lane and reading the news on a airline ...\nNo ... no lie\nYour ratings\nYou\nKnow what I read a\nThe ... or ... or\n... ... ...\n... ...\nUh\nTo W. A. R. S.\nThirteen twenty am apple borrow Dr Gary highland or will return to Richard ... library for a series of lectures titled papers\nThe series starts with the federalist papers on Thursday October forth\nIt will be followed by the pumpkin papers on Thursday October Eighteenth and the Pentagon papers on November first all lectures will take place at seven PM registration is required within these lectures if you'd like to register you can email librarian Maggie homes at in homes at sales in dot org [noise]\nTo spring in truth radio\nWith your host past offend me oh we have any of the king dome like stretch located at one time to read those street in Providence Rhode Island\nWe not would you open your heart your ears and your mind you ... ... everyday living and now gives you a host asked how many\nTime belongs to go\nEat these to acknowledge that time\nSo I wanted to be our taste shown to this war and followed would have go that will come\nTo you where did you follow eat then you would see its blessing race the law\nI Want to know something\nTo do anything good cities you will do\nWhat they're about God I said I doubt it is what\nAll directly to you he east of ... that will feel\nHe's probably get paid to fulfill\nMan can't talk endlessly men can't talk\nTo show off what they're doing that to do do you can see that that does not go against the law\nWas ... about pro sits out of the amount of God is that what I've set\nThat will I Do what I have said that we ... I Do if the Senate seat you will do the\nBritish the law so I Want to do on that than that as we go on tonight because he said to us is that it won't do do you have one side of the past week is that not a single ...\nOh my word will pass on fulfilled that is why I read George would you because all the promises that God I made for you they will come to pass in the name of Jesus Christ\nIt's made for you they will come to pass in the name of Jesus Christ if you look at the book of Sam Sam ... off\nThe water go set something tools some were about six your Bible say these new watchdog the lord apple pie or words like serious about riding the funders of\nPeople would have fired several times Gulf War is that big God's word\nAs being tested all Rodney said today's ... by the middle east India\nThe water go that's been proven to feel that it's not seen in the water ... dot com polluted Brazil all the word of God is through\nThat does not necessarily mean through the respect of the opposite of light in the world but that is true for all times Brazil oh that means that you must always be\nThe word of God most always be it walks everywhere\nAnd it works for all people he does not much how your liberally life and he does not matter which country you belong to watch for is\nWhat community the word is to bridge the law\nThey cried these us all the problems is a go the UAE under him in the Bible says every word of God is pure easy issue to those that trust in him you cannot trust the water go and come up short\nYou cannot trust the word of God and come up short\nI Want to do receive this\nBut um come up short\nI Want you to receive this Fox and fruits I saw a lead funds based on your own activities in life Brazil oh it is impossible for the word of God to fit\nThe Bible says that even if we have ... God is spread food he cannot deny him self second demoted stepped up to about that the goal cannot deny himself you will come front people were there was\nA newer say last yeah this is what you say and then they want to explain it to eat the denying themselves not just not go\nDo what good times for labor is that for their boat load your war is set to even though the glass me with the flow I mean for the world of ghost towns forever Brazil oh\nGod is they're covering on keeping go\nGod loves combatants got lost contracts which is ... is a contract that cannot be broken it contract that cannot be nullified or set aside brood Jesus Christ will and that that come in and we and that that contract\nOn average contract moss beep our phone British national guard always performs his own contract\nIs that how do they not just you know come down from what I Do know that don't do it without what in the at making them bought and blow some given grad student ... ... feet to the store is that so it's my war that's gone out of my mouth you know they don't mean boy what a gold always be our foods\nThat woman's sad for this hour how by prayed how can you say that because God said ask\nAnd he's got to be given on till you see\nLet's just say that because God said ask\nAnd he's got to be given onto you she asked on the show the evidence of the answer to our Priya you will do appear on the show the evidence of the concept of your previous in and they're more Jesus Christ not is the good job of the prayer that then that\nWill go on on Sunday the name of Jesus Christ you will see the ... the ability of Jesus in the Bible says the word became flag\nKnew what a guard a west produce what is done you all that is why you cannot talk with the word of God\nWe are going on a journey into night Bristol oh we are going on that journey\nBecause you are entering the food is or isn't the yeah of rest under yeah or know why because the goal is through we are sopping living go west side being frugal Brazil oh jeeze God\nOn these ... he's ... he's might see that it's not then they said that they cannot do that it's nothing that says without wisdom that nothing is says without thinking he cannot say well I didn't think about it that better with you about thought about it I Will not said that that is no we go\nEvery word of God most people feel Bristol in the book off ... Bruce ... not six\nHe rules sap that seeks God in making coming on with these people not only gives his war\nBut he also about this war without an oath\nThe word of God a loan is enough but I saved out why not you know for God you know not really give you double assurance it wanted to do is what kind of thing he boxing it gain we've done or Brazil all that\nWhat kind of thing he Boxing Day without an old Brazil oh that is why disk of justice to all he Bruce stepped out six from by several the look at it or don't go\nDo us God they come in and they'll show more abundantly ... out of the problem is the ability office comes to this is the reason God give I Know he ...\nHe did Tommy those so Doherty here out of the covenant\n... even with that Billy the office comes so does that look my well it's not fair in its determination to show that this war cannot fate he give you an old to go with the\nThis pet of restoring some thin or someone do is satisfactory state so they are for that it started some process the extent of the process that depends upon who is doing to the stores because on the least satisfied you will\nBased upon who is doing to the stores because I don't believe satisfied you will not stop original so does mine that wants to restore you\nYou make good piece of work and say that that's all you can go for that\nBut how many people know that are that God this ... is that these global it'd be rebuilding the allies regional so do these storage some process got his own that victim is not going to stop on the ... in South east for less satisfied that the ...\nThat is why you need to be excited about what God is the guard ... do you and they will not drop due to start his own\nOr dealing satisfied and he cannot be satisfied or to conceive glowed in your life he cannot be satisfied until he's glory\nI Know this game in you alive he cannot be satisfied or do people recognize him a lot British the law so we're not talking of\nProcess that has no determination behind it\nI Know that there is a sad state of beer and start to form a good state\nAnd that was why these are the\nBritish the low ... that they are now our winners beauty and it's much different states and they create that month\nOn set to mine to have to me new\nTo a joy that condition met someone came that thought he was smart who who manipulate is on the streets undisciplined mine outside of his he had any times Christ came to restore all who believe by ...\nDance class game to restore all who believe by today out the United states\nFrom this time for you will have to mean to an undecided out there that prevented people the kingdom of God you are working to become law on the name of Jesus Christ stars Sean is not something that God just do listen to me\nThat is why you need to understand what we're talking about star restaurant is based on cabana\nGone out to propose and I made the governor now he has not seen that coming out fulfilled yet he must restore you saw this story song walked into a guard dog asked the government is fun dish and\nThat is why you can't talk opera star restaurant or less like cover not person\nYou cannot talk over the store isn't unless you believe in Jesus Christ because if ... is the governor of go now to mix with his own people and that's what are the joys with you that because you believe in Jesus Christ that this fund that's something that is enough\nTo make ... do you why because you must uphold is governor set currently on and if you want to illustrate that you can't see that the last restaurant in the life of Jericho\nWake you up was one that I did not have anything it was because of the covenant that God began to bless him in the household of lover it was because of the governor\nYou just got a hot tub or not we go he had no reason to historian bet because it's coming out got no fair he decides to say look I must bless this person I have Cindy justice I'm much trans fat the west and the resources into his time because\nMuch trans fat the west and the resources into his time because that is coming on to mid with the British below the knee started some process of God he's also guys that by the purpose of God God what is telling you because of his ... while you're alive\nBrazil oh that is something that they are determined to go on Sunday you\nUnless you really starts you on it quits you I'm puts you in a position where you can fulfill that ... day he himself will be defeated in his ...\nAnd ... girls can never have been detected in his ... says published a book on never fear since that it's not in in that unit bus go about rule is telling us that he must restore you so that that process must be accomplished Brazil oh that was why women most this\nEven though ... how to ... live in ... he was a head of God\nAnd decided to al ... is ... without reference to Dubai wisdom Brazil oh eat too much emphasis on like manual falls out doing now\nAnd then does that say look I Will feel dismissed John By my own wisdom I Will feel this wisdom by my old power I Am strong so because Armstrong I Can't do with your personal stuff goes people\nBecause I don't smoke pot when I Do with them I Can't come up what I've done so that nobody will know about what happened to him he was sent into exile for forty years\nThat God had the bubbles for his life it is the desire of God that ethos Morsi's now go we used to live by the people of Israel you have to go to the story in his attempt to restore Moses guard went to most is literally you have to visit to restore it\nThe two most recently you have to visit to restore him ... ... has a purpose for your life\nI'm for that purpose he's he had told his story that is the purpose of God for the start for that reason he must restore Detroit now does the government under God that's made with this ... this is it coming on charge that our president did not go said before I get\nWhen I came there are some things that you said ... some of them are that are you in the Monday Night that's up to four to nine because that's coming out of pocket of Gulf War does does\nIt does end up passing you will find out that that is nobody in this place that can be a pool that policy that is nobody in this place that can be defeated it does end up passing instead of our content\nWith those who contend with too is that that will make them in their flights like me\nThey were down below like strict one than there were no time your to do my only one of his first alone it is for that purpose is that in the world is that ... the ... to live out from the Mike ...\nIs that but I said to you is that they ... they might not be taken away\nThat this nobody can give you a cup of Tea Party there is no power in the universe is that going to stop you from a company she will go on a complete in this place Brazil all we're talking of covering up the cost of the governor you must be just as they made it coming out with hip hop\nAnd said I Will make you defined are all men in the ... just as he made it coming out with Sarah\nAnd said that from your seat and there's a lot of the place even though they thought that that will not be the case then we'll do that taught like most is that it would be by themselves and then married so my ligament God that okay you have to make your own I meant I won't let this month\nI mean God said okay you have to make your own I meant I won't let this month but it is from say that I used to be number so air time\nCame doubt God hospital visits said why because of the governor because of the governor of God what did you START I said to you that this is the time of the bipartisan Brazil oh he must fulfill that would say\nThat is the best for what we're talking about\nThat is it best he's for what we are talking about we're talking of\nPeople um proof that blue waters of God is that then the ads on the line to shop your point\nThe eyes of the Death Star\nThan they let me see I live like a death undetermined under more sing for what that was fought in the way down it seems in the desert what does it talking about this is the evidence of storage than\nYou are going to see the evidence of storage when God does this work they'll be done you approve of these stories bridge that all the wisdom of God is going to a floor into the hearts of men I've already been praying\nDot com two thousand on several go will begin to drop I yes into your mind for great and wonderful businesses that will live Brett you from all this economic bump they raised a lot of how the employee mentality that God we vet you alive with employer mentality\nSynonym of Jesus Christ and outgo won't give you grits well along with the\nTo back it up to believe in the name of Jesus Christ is that the ads on the line with your ...\nWhen he gets up what would they do they will see this is your impossible you will see that there are parts of it is you don't know how to do you see out to do that do you make your mentality won't varnish it and they want to describe you in\nDo you make a joke at the mentality won't bodies in the name of Jesus Christ you know you I shot of go on that go with you is the majority is this what we're talking about is that he had somebody that stop you on TALK\nPlus I've not been paying attention to the water go there'll be get told received punt the revelations that cannot be non British law you know the cost is going to talk about this dark I'm not doing that one that is what do you\nGo to show your vision of where this is good do you think that just paintings that will not come to pass new\n\nAnd now\n\nA lot on my\n\nLong\n\nHi my name is Chris Wyoming and I'm the manager of the elder dental program we're inviting any seniors residing in Massachusetts who are sixteen older\nTo attend our free dental screening clinic in taunton on Saturday October twenty from eight forty five AM to one PM participants will receive a free dental screening and have\nAn opportunity to speak with that dentist in the clinics relaxed and friendly study participants will be screened for oral cancers and have a chance to receive free Thatcher cleaning\nFor more information called seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program a project at the community me in a\nWe love you\nOn ...\nThe big regret the big\n...\nNo longer can they go\n\nHa ha ha ha\nWas ... and\nYou're listening to our Thirteen twenty am\nAdel borrow on Tuesday October thirtieth from\nFive pm to ... pm be regional chamber of commerce will hold its twenty ninth annual taste of the region\nAt tri county regional technical high school in Franklin tasted the region is an annual celebration of restaurants from all of a sixteen communities that the regional chamber serves attendees will have the opportunity to sample food from a variety of restaurants that are members of the chamber [noise]\nYou're listening to W. A. R. E. radio I borrow coming up now the Armenian radio our [noise]\nHeritage culture tradition Armenians I'm proud of it and wherever I mean in songs that her there Armenia live ... ... ...\nGood morning it is Sunday October\nThe twenty first established here in Providence\nIn Nineteen forty seven and now in our Seventy second year of broadcasting you're listening to the longest running Armenian radio program created by the late Russell gas burying produced directed and hosted by you truly your immunity level of Providence Rhode Island brings to the best in our new music latest news of the Armenian community and\nPublic service announcements a webmaster\nI mean the music latest news of the Armenian community and public service announcements a webmaster is George gas Marion and now sit back\nAnd enjoy your program\nOr they recently had and I get to know that I could have gotten rid of the I'm a little ... about ... miles out of ...\nI ... met notice I don't\nDidn't I of course you know I ...\nIn general the group and resigned you don't see a doctor when I read about it during the ... ... how much he bought a mutt it didn't stop the bleeding ... look at Dodger tuning\nEach ... show on 'cause you're doing it too much he run ... ... I I'm with John mentioned this person I was skin how you're doing I object to everyone\nI've done it in ... to the U.S I've been a godsend I'll miss ... little shutter knock\nMake ministry again guys I could go to the ... and I love I Believe I Believe [noise]\nAnd we did have three just this last week\n[noise] October fourteenth twenty teens\nAverage is up ... passed away the age of Ninety two he was from situated avenue Cranston born in Providence he was simply trials and Mary up carrying ...\nWith the car tiger for for the United states government any World War two U.S navy veteran\nHe was a graduate of Bryant college in Northeastern University\nSurvived by two daughters Terry summers of Warwick and Janet tempted and her husband John Narragansett grandchildren Tom dynamic and his wife\n... Gabby ... and his wife Kristy Samantha somebody Connor Christopher incredibly tempting and great grandchildren Tim or ruin Dante and his brother Greg Kaiser up carrying of Englewood, Florida he was rather late Esther Terry up carrying an automated up carrying\nFuneral services were held at the Rhode Island Veterans Memorial cemetery in exit or our condolences to his family\nAnd in a dorm on John eighty eight passed away October sixteen she was daughter of the late ... and Maria pitch a rally wife of the late George Dorman John who was one of her her one and only love\nWife of the late George ... John who is one of her her one and only love mother of Lisa we go with home she was ... and and the late Laurie manila grandmother of illicit and Amanda ... go\nHome she adored in the late Robert Bobby manila the third sister actually Dominic John Joseph Danny Angelina assumes that Theresa enrolled she also leaves many nieces and nephews funeral services were held from the country really home with a service at Saint Anthony church in North Providence our condolences to\nThe ... family and we also have another desk to report it is my father's younger sister Naomi Balkan of nine in Connecticut she passed yesterday and joins her husband Joe Balkan\n[noise] I don't have any of the arrangements are\nThe obituary to be able to uh\nRead that to you but we'll have that next Sunday my condolence to my cousins\nAnd continuing with our dining Lutz is [noise]\nOctober twenty first two thousand one today as a Seventeen subtlety of Eddie match in October twenty first when eleventh today's a seventh adults of roads Krikorian October twenty first twenty Thirteen today is a fifth bottles of Mark Foley Arjun\nOctober twenty second twenty fourteen Monday is the fourth outs of Katherine bar in Albany see October twenty four two thousand Lindsey Eighteen thousand even ... it is also the Eighteenth all of the Wednesday of Isabelle that definitely on October twenty fifth twenty Thirteen Thursday's a fifth outs of Richard ... and October twenty fifth twenty Seventeen\nThursday is the first set off the cleaning a boy in October twenty six twenty Seventeen friday is the first south of married just Killian\nOctober twenty seven twenty fourteenth Saturday is a force\nThe first south of married just Kelly in October twenty seven twenty four teams Saturday is fucked up to ... again\nActually twenty seven two thousand one Saturday the seventeenth to touch that dirty cries because Syrian you very much on the requiem service merciful lord have mercy on the sort of I just see especially evading for the passing of my aunt Naomi gets burying barking\n[noise]\n\nKnees ...\nMore than ... a ...\nAnd\n...\nNo oh no no\nOh no\nIt's\nA ... oh ...\nOh okay\nYeah yeah yeah\nMhm yeah oh\nMy God I'm\nAn\nA a\nOh um\nOh no I was a\nReally\nGood being\n\nNo no\nNo\n[noise] oh\nNo\n\nNo no\nNo no\nNo no no\nNo no no\nOh\nWhoa whoa\n\nA ...\n\nOh no no\nNo no\nNo no\n\nWorld\n\nYou know no no\nNo no no the\n\nWhoa whoa\nWhoa whoa [noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\nLa la la la la la la\n\nOh on the phone number\n...\nNa na na\nNa or\nOr\nA\nYou a little bit about the recent explosion of interesting\nBut gory and chant and in the ... in the mystical music of various mostly Eastern European composer\nSuggests that there is something in modern western life that has listeners searching for the ancient or perhaps timeless sounds of sacred music\nThe secret court on music of the Armenian church certainly fits the bill Armenia has the various times been considered part of Europe or part of\nAsia and that dichotomy that sense of struggling to different cultural world has deeply affected this music lets us into a bit more\n[noise]\n\n\n\nOh\n\n\nOh [noise] leads to some in the background\nBit of news I'd like to make sure our listeners are all [noise]\nArmenian historical association of Rhode Island of ... along with the national association for Armenian studies and research present the art of Armenia an introduction and illustrated lecture by Dr Christina Murray antsy Thursday this Thursday October twenty fifth seven o'clock\nAt the hiring museum to forty five Waterman street Providence that's on the east side of Providence right there at ... ... square everyone knows it says the bliss building and uh\nAgain this is Thursday October twenty fifth at seven o'clock it's a material history and visual culture that reaches back to the paleolithic era professor Christina Murray and see the newly published the art of Armenian and introduction\nProvides a survey of the arts of Armenia from antiquity to early modern times and again this takes place Thursday night seven o'clock October twenty fifth to forty five what I'm In St in Providence\nAlready and on friday night of this week October twenty six beginning at six o'clock in the garden and cultural center will be listening to run George geo with a sentimental journey St sagging St mustard women's skills presenting\nA classic sixty swing hits from Frank Sinatra to dean Martin to Tom jones there'll be dinner in ... contact friend in the church office to seven to seven seven onto again this is this Friday night six o'clock donation for adults twenty five\nOne to again this is this Friday night six o'clock donation for adults twenty five dollars children is only ten dollars and against this Friday night October twenty six beginning at six o'clock a diving auditorium Seventy Jefferson street\nOctober twenty eighth\nAfter church services that Sunday [noise]\nA walk it is going to be flu shots free\nFlu and pneumonia shot clinic walk in clinic sponsored by writing the AC way way you must be at least Nineteen years old in Rhode Island resident with health insurance it's a high dosage available also for senior citizens and if you do not have health insurance and you'd like to get these shots it's only thirty dollars\nFor questions you can call pharmacists Melissa for zero one five to nine seven ... seven two for one five to nine\nSeven ... seven to and then that brings us to November now we all know November is bizarre month the first weekend saint saint Mehserle second weekend of November St Martin in church at Rhodes under the toxic Cranston and then the third Saturday of November\nFrom seven from eleven to seven at the Armenian evangelical church one eighty Oakland avenue Cranston it is their church because I remember it's only one day for the evangelical church and uh\nAgain church bazaar they need our help pleases if you haven't done so already help out any day of the week pretty much at either of the churches they're always in full swing so a call you respect of church you can find out the times\nBut uh again they do need your help and I'm at St Bart's announced they also have a\nLet's see ... ...\n... is available for pick up you can buy it and now it's between um ten in one Monday through Wednesday or after church on Sundays um put in your order with ... three five three two one three three five three two to one three and\nGood point three five three two one three three five three two one three\nAnd a you know bizarre they need our help so uh you go let's go back\n\n\n\n\n\n\n\n\nAnd I actually have another announcement save money seems church will welcome in honor\nThe new ... then you probably his grace bishop uninsured early on as he celebrates divine energy on Sunday November twenty fifth a special reception will follow mark that data teams are science church in Providence November twenty fifth\nWe'll follow mark that data teams are science church here in Providence November twenty fifth\nAnd before you know it it's going to be New Year's eve the holidays are right around the corner for the first time bringing Rhode Island and New Year's party you don't want to mess\nAll star entertainment featuring California's on how to cut ... also playing the multi talented man theme in and coming from New Jersey Stevens let's begin junior there'll be a full Armenian met that buffet\nNew Year's party favorites complimentary champagne Towson valet parking don't miss this event\nNew Year's eve for a table reservations or general questions you can contact hopes set at four zero one to five five to seven nine seven this will be advance reservations only I Know this is going to get sold out they'll be limited tickets available so called for everyone to five\nFive to seven nine seven and ask for ... and that's New Year's eve December thirty first saint ... [noise]\nOh [noise]\nOh [noise]\n\n\nOh oh oh\nOh oh\n[noise]\n\n[noise]\nAll\nThese [noise]\nAh\nAh ah on\nA small office\nLet's get back to liberate the country\nDo\nWe know you're not are no\n[noise]\nI was young he's a guy who\nYou pick the blue ridge\nYou Dick John boom ... Bush don't know\nVery highly Underwood returns\n... library for a series of what's your story the birds the series starts with the federal\nFor your library for a series of luxury papers the series starts with the federalist papers on Thursday October forth it will be followed by the pumpkin papers on Thursday October Eighteenth\nAnd the Pentagon papers on November first all lectures will take place at seven PM registration is required to attend these lectures if you'd like to register you can email librarian Maggie homes at andme homes at sales in dot org\nHi my name is Chris Wyoming and I'm the manager of the elder dental program where in writing any seniors residing in Massachusetts who are sixteen older\nSo they can ... dental screening clinic and titan on Saturday October twenty at from a forty five AM to one can participants will receive a free dental screening and have an\nOpportunity to speak or that dentist and the clinics relaxed and finally setting because they tend to be screened for oral cancers and have a chance to receive free ...\nFor more information costs seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program at project at the community the NA\nOn Thursday November eighth at six thirty PM Pam Holland presented discovering cousins using DNA at the Richard memorial library in North that over all this talk will show how to explore matches and use the tools available at the major DNA testing companies\nIt will focus on practical ways to discover relatives in order film will be in a cousin's for more information or to register you can email librarian Maggie homes at M. homes at ... dot org you are listening to W. A. R. A. Thirteen twenty am Arab world\nOctober thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl ... the role of St John located at two Seventy one north main street in Providence this is a free discussion on this\nLocated at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guest will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at their Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy\n[noise]\n\nAnd\n\nNa na na\nNa na na I\nMean you\nLot of\nSeason that you\nMe to come in for your health floor with the heart of praise him Thanksgiving God\nWell all that you've done well all that you will continue to do lord we thank you got your amazing and incredible love the lord we believe that God oh church wanting you lift your hands and just\nPick a moment to thank God for his great love for his regular people knew because\nWe are able to walk through the floor today amen\nThank you she's on we bless you lord you weren't named most worthy great God\nA a\n...\nA ...\nOr\nWe know ...\n\n\nA\nAnd a\nYou\nKnow we you\nKnow\nCan\n\n\nThe\nThe\n\nMean we\n\nShould\nBe\n[noise]\nGood morning\nWell it's really good to see you\n[laughter] [noise]\nThe unseen world and the scene world overlap and interact\nAnd there are no ordinary people here today there are people who live in the human route the real world but we also interact with the unseen world\nAnd I really believe we had a a spiritual breakthrough last week of all things from the book a job but anyway I really believe like repressed and\nAnd um you saw the effects and so uh I Would just like to have a time of publicly giving thanks to God for\nProtecting us this past week and I'm I'm going to have you do something we were not very lethargic all around here we try to be formal sometimes and I can't do it um you got that verse up their Scott\nThere's a a passage out a song one twenty four that I Would like to have you uh read and every time I raised my hand I'd like you to re read that phrase\nUm and then I Will pray for Thanksgiving after we're done with it and here we go ah let's practice altogether if the lord had not been on our side\nOkay that's pretty good ... every time I raised my hand why don't you guys do that you're ready [noise]\nLet the people of God say [noise]\nI'd say [noise]\nWhen men attacked us [noise]\nWhen their anger flirt against\nUs [noise]\nThey would have swallowed us alive [noise]\nThe flood would have been Gulf bus [noise]\nThe Torah would have swept over us [noise]\nThe raging waters would've swept this away [noise]\nPraise be to the lord who was not let us be torn by their teeth we have escaped like a bird out of the polar snare\nAnd we have a skate our help is in the name of the lord the maker of heaven and earth let's pray heavenly father we just thank you for your divine protection this past week\nLord\nThere's what the news media says then there is ... ...\nWhat happened in the unseen realm lord we believe that your hand a protection was on this campus\nYou watched over the attraction of this man to this facility you watched over the events that led to my coming in here lord I take you that it was me and not somebody else I thank you that you had your protection was on this campus\nI think you that uh he was able to leave and and did so willingly lord I thank you for the protection over our two police officers that engaged him lord I Am even grateful that you spare his life\nHeavenly father if you had not been on our side watching over all of these events who knows what we would be doing here this morning it would be completely different instead lord\nIt's what we would be doing here this morning it would be completely different instead lord we thank\nYou we give you praise truly lord the unseen romas interacting by brightly Monday and we thank you publicly in Jesus' name amen [noise]\nWell the lord did not give us a spirit of fear but of power end of love and of interestingly self discipline in other words he's also given us commonsense so\nIn light of everything let me update you what is going on with our security here or worked we've been taking a two prong approach and there's been a lot going on behind the scenes\nAnd uh the very first thing and most important is actual people doing the job\nOr we currently are ah recently approved Henry chosen to be our new head of security\nAnd he's looking for recruits you'll find his email on the bulletin and I've given him a list of names so when he calls you please say yes I'd be delighted to\nAnother personnel thing is that the next all team meeting in October we're going to go over protocols with all of them in ministry department heads\nIf you're not aware there's fifty two ministries that's a very busy campus\nUm there was a lot of moving parts here\nAnd all it takes us for one thing to break down in this case the door not closing on top of a alarm ... not being set\nAnd uh so all of us we're going to run a ... brief everybody in October the second thing is we're going to move ahead with a um installing security cameras\nA recording device for the campus we got an estimate earlier this year and we're just going to move ahead with it and then DCA is president security system will eventually be upgraded\nHad with it and then D.C a president security system will eventually be upgraded an integrated with that if you're not aware we have a school and it is currently has its own stand alone security system but we're gonna dove tail it so that we have one security system here\nVery good that aside we thank God for his protection we also thank God for his provision if I could have all of the people I asked about the mortgage shredding to come on up at this time\nThese individuals are a church council members they are members from the good steward campaign team\nThey are ministry staff\nHave we got enough to for twelve and and the ...\nOh here we go here we go there we go that's what we need we want to thank God that this is the mortgage of the property next door the White House next door and I'm not a pencils out one day everybody I'm\nForty two months ago we launched a campaign to pay off\nThe White House or the mortgage was roughly are pretty close to three thousand dollars a month and if you know anything about it in your own personal budget or if you have all if every it's possible to have all your decisions made for you\n\nWe weren't quite that bad but three thousand dollars a month\nIs a lot of money out of our operations budget in other words how can you do outreach when you're doing this so the lord put it in our heart to pay off this mortgage as quickly as possible in the forty two months we made forty one extra pay\nAs possible in the forty two months we made forty one extra payments that are obviously almost a payment among praise God [noise]\nNow this has saved us forty eight thousand dollars in interest\nHere's another interesting thing\nForty one forty two months ago when we came to you we said all we're asking us for five dollars a month five dollars a week\nFive dollars a week and do you know most of the contributions worth five dollars a week per person\nSo just a little just a little bit of sacrifice on behalf of everyone here we say forty eight thousand paid it off and now we're able to move forward or before we read these I Want to give a special thanks to the boys and\nGirls\nWho over the forty two months gate eight hundred and Ninety seven dollars [noise]\nLuckily shredding began go ahead there was a machine right there [laughter]\nOkay so that that might got okay yeah okay so this demo God comes down and dies on the cross okay so that part's no problem\nThat is not incompatible the next second main part of the early church is where the compatibility of wives the second main fought is only that which God becomes is fully healed\nNow that one requires some thinking\nLet me put it this way Jesus had to be fully man for you and me to be fully redeemed for this person for you to be fully redeem if I could say like this if Jesus was fully human except for his little finger then all of our little fingers are not fully redeemed\nIn other words when we get to return it to you we're not going to have little fingers in other words Jesus had to be fully human fully human for this\nFlash this world to be recreated in the new happens in the new earth\nNo if if the if people believed this deception\nIt would have changed from Christianity\nTo something other than Christianity it was an attempt to denied the very foundations of Christianity by denying the historical physical Jesus look again many the sabers of going out into the world they do not believe that Jesus Christ came to earth and a real body\nSuch a person as a deceive or an anti Christ I love John's response\nNow here's an elder he's an old man by this time\nNow here's an older he's an old\nMan by this time and he doesn't even say Hi it's John he ... he just starts out right from the beginning the one who existed from the beginning is the one we have heard and seen we saw him with our own eyes and touched him with our own hands\nHe is Jesus Christ the word of life\nThe old man the church affectionately called John the elder doesn't even Greece has friends he just is opening line of hey we've heard we've seen them I've touched them\nI Am an eye witness sayings methods do not change the contents of them changes he is still a deceive or who wants to deny something that is physically unreal and if you think this is a must the old thing\nSame still in the deceiving business I'm going to give you\nTwo examples and a quick trigger warning because it's not\nThese are not political issues how do you answer this question these two questions determines about the level of deception you are willing to buy into number one when does life begin\n\nThinking about it this is an important question because it leaves the how you answer leads either to the dignity of human kind that we are created in the image of God or just a bunch of tissue that can easily be discarded\nThat's next one it's it's a hot button right now is gender identity or reality\nHow how you answer that question ... ... e bleeds either to a moral rightness or wrong or sexual\nLiberate teen\nSavings methods remain the same he's denying reality however in our ... our content today that it's changed it's it's ... it's all the issues that we wrestle with today but human\nIt's changed it's it's ... it's all the issues that we wrestle with today but humankind believes the substance because they love gardening us\nInstead of light that's the bad news bad news there is an enemy toward a soul he wants to deceive he wants to destroy our faith and he has a plan to do so but there's good news the good news and you may not see how good the news is right at the first\nBy December you'll have it down look at Johns thesis sentence every good writer has a thesis entertain this was were ongoing his was no difference this was the message has given us to announce dude God is light\nAnd there was no darkness in uh the metaphor of ... the word picture of walking in the light is the answer to being just saved we\nKnow that God is wholly how back says that um you're too pure are to look out evil\nWe know that God is immortal Paul wrote that God is immoral and he lives in on approachable light we know that God is full of glory it says and saw him that he he wears glory like a a a coat of light\nBut John's perspective is that internal life\nLight equals eternal life skews me and said that wrong each a light equals eternal life and he you know why because he's jumping to the end he's like hey if you want a turtle life you've got to walk in the white\nHere's here's listen to the good news how John phrases that this one who is life from God was shown to us and we have seen them\nAnd now we testify\nAnnounced to you that he is the one who is eternal life he was with the father and then he was shown to us we are telling you about what we ourselves have actually seen and heard so that you may have fellowship with us and our fellowship is with the father and with the sun\nSo that you may have fellowship with us and our fellowship is with the father and with the son Jesus Christ we're writing these things so that our joy will be complete\nLet me give you the logic got Israel we've seen him God came son to son Jesus fully human and divine to earth here's our means to eternal life\nAnd Jesus came so we can a fellowship eternal life with father and and the sun and that equals joy that's a simple\nAs it is friends live both illuminates and exposes darkness if I had a microscope puppy or a common microscope for many high school a\nClassroom\nThe light would go through their there'd be a reflection of lights of natural sunlight through lenses and it would magnify it would expose what is dark to the human eye so that we can see it in the same way the light of God\nGod is light and his his shining on us exposes us\nThat's not necessarily good as if you haven't heard all my stories I have one more\nMy teenage years my home church bought the local theater in town\nSo we had a sanctuary building it was just a little little tiny country church like\nAnd we bought the only theater in town and it was during the Jesus people revival and and what we called it the state Jesus center in every weekend we either showed a Christian movie or we had a Christian concert of some sort\nOr the youth met there on Tuesday nights and being youth we enjoyed running around the state Jesus center\nWith the lights off\nIn fact we played many your pastor has played many a game of hide and go\nIn fact we played many your pastor has played many a game of hide and go seek at the state Jesus center\nAnd we often would run into walls we would\nTrip over chairs which in our knees on something\nI mean we're playing hide and go seek in the dark in a big building every now and\nThen one of the sponsors would turn on one of the theatrical spotlights and\nTry to find them and we would die [laughter] light exposes things that's just point\nLight is good even though it eliminates all our sins if we walk in the light we're going to stop singing and the result will be\nEternal life\nVersus Evans says but if we walk in the light as he is in the light we have fellowship with one another and the blood of Jesus in San\nPurified us from office and\nJustice sunlight kills mold so walking\nIn the light kill sin in the life of the believer the message God as light light equals eternal life therefore walk in the white well that but there's more ... now not only ...\nReceive these three again soon I Would send in and I will throw in another\nAnyway here's another point there was more good news every good writer not only introduces his letter or his\nTopic with the good the sun just when he's closing at all he'll say and this was\nWhat I have said to you or unlike a preacher who says in conclusion in conclusion you know Ninety five times John actually doesn't he concludes and he writes this I write these\nThings to you who believe this was in his last chapter I write these things to you who believe in the name of the sun\nWe believe this was in his last chapter I write these things to you who believe in the name of the son of God why so that you may know you have eternal life\nJohn as a pastor at heart he seeks to assure his friends that they may know for sure that they are going to have eternal life\nIt's as if he is saying look if you don't believe my testimony if you don't believe I saw the rhythm art if you don't believe I ... with him after he rose from the dead if you don't believe any of that you can still know for sure that you're gonna have eternal life\nHere's the end there's verification and we're going to go through these in the next couple of months there's an assurance of eternal life immoral ... verification walking in the white there is a relation no verification walking in love this was the great love book guys\nIt's all in the love one another is in this book several times there is a scriptural verification walking in truth this is what it means to be a believer we are told walk in the light and soon will disappear\nYou may just thought that\nAnd they have no idea\nIn the door and they have no idea what\nYou\nChoose to march\n\n\n\n\n\n\n\n\n\nOn Tuesday October thirtieth from five pm to eat PMDD neither regional chamber of commerce will hold its twenty ninth annual taste of the region\nAt tri county regional both technical high school and Franklin piece of the region is an annual celebration of restaurants from all of the sixteen communities that the night in regional chamber serves attendees will have the opportunity to sample food from a variety of restaurants that are members of the chamber\nOn Thursday November eighth at six thirty\nFor a variety of restaurants that are members of the chamber on Thursday November eighth six thirty PM Pam Holland presents discovering cousins using DNA at the British memorial library in North Adel borough this talk will show how to explore matches and use the tools available at the major DNA testing companies\nIt will focus on practical ways to discover relatives in order so moldy in eight cousins\nFor more information or to register you can email librarian Maggie homes at M. homes at ... dot org\nRhode Island college will hold their full open house on Saturday November third from one PM to for thirty PM in the very center prospective students will have the opportunity to meet one on one of the\nFaculty and staff to learn about programs in student services students can explore Rick's campus tours of the quad find a performing arts center residence halls and the rec center there will also be academic presentations and an informational presentation on missions and financial aid you are listening to W. A. R. A. Thirteen twenty am Adel borrow\nBrown University who hosts the lecture cosmic shadows other worlds in a fifth\nDimension on Thursday November aid from four to five thirty PM shadow ... patterns are cast throughout the universe by the gravitational field of stars and galaxies this talk will unveil how these cosmic shadows carry clues about the existence of extra solar planets\nAnd a possible fifth dimension the auditorium will open at three thirty pm for seating and guess are asked to arrive at the auditorium no later than three fifty PM the lecture will take place at Brown university's icy E. R. M. one Twenty one south main street on the eleventh floor [noise]\nHello I'm Dan Lewis and welcome to biblical insights with pastor del and now pastor del them often as\nThank you guys for showing up this morning a week because there's no church service without [noise] so I really appreciate that and I thank God for your presence and God never disappoint\nOr even to a lotta times we may thanks so every time you take a step toward God it will take multiple steps towards you and bless you in ways that you can't even imagine so you're presidents here this morning we'll be greatly reward it or not because I'm saying so because the word of God\nWill be shared with you guys have been shared in the past and you will they leave here uh knowing a little bit more and moved a in a positive way and your relationship with God\nA very quickly I Want to share with you\n\nI Want to share with you out of a and Romans chapter Romans chapter tens\n\nRomans chapter ten first ah\nSeventeen the apostle Paul is talking about face and how we get face\nAnd says faith comes from here\nIt says faith comes from hearing the message and the message is her through the word of crisis\nAnd I thank God for the opportunity to steady the word of God not only on a Sunday Morning\nNot only personally but also the opportunity to study the word of God with someone who study it off for a long time and with someone who admitted that the focus to not only educate themselves but to educate others and\nThe word of God so if you want to have additional face if you want your faith to grow the steady of the word of God is very important and as a as a church we're trying to offer you numerous opportunities for you to come to study the would've come\nAnd we know Sunday Morning that's fought and we know throughout the week that many of your work many of you have responsibilities so if I offer something on a Tuesday Morning not everyone will be able to obtain\nSo choose the morning you would come to a Bible study and ... and Tuesday evening you could come to a this new pass away of freedom that we are right on a Wednesday\nAh I really want you to to come and try pasta Rogers Bible study\nYou'll be blessed by it and those of you who've attended it you know it's good you know it's great pasta Roger has been a great friend to me it's been a mentor to me a\nAs a pastor now I consider my pastor at times when I'm feeling a little frustrated filling happy and then we'll get together and he'll help me see things that I'm not quite seeing so uh I think God for sending him back here and I thank God for allowing him to do the mess\nI thank God for sending him back here and I thank God for allowing him to do the ministry that he's doing in the church to on a Wednesday evening at seven uh I really encourage you to come and study with them or your faith will grow\nIn a way that you will be amazed because he will help you understand the word of God so I think a foster Roger for his commitment to God's ministry at this time at Memorial Baptist and I invite you to join his Bible study if you haven't already\nTo this morning we're\nGonna talk on a subject that's very important because you're trying to do it every day or just you and you're supposed to say you do it every day\nBut before I get into it I'm often amazed when I ask people\nWhat the tea you know have you ever watch individuals who have wonderful relationship with one another or whether it be a a marital relationship of friendship or ... and if you want to ask them what's the secret sauce how do you get to have a good relationship\nDo you have a ... because\nYou just passing through and God's lights and likewise gotten just passing through in your life [laughter] radically you know you ... you you may pause and you ask for a favor from a stranger but it cannot be something substantial\nBecause you don't have the kind of relationship with a stranger perhaps you may say okay I Need to get through excuse me and the person step to the side and the person let you go out of your merry way and ah so you ask for a favor the granted to you but it's not something substantial\nSo if you have a relationship with God which is that over strangers okay imagine I see a stranger on the street\nIf I tell him to excuse himself so I could pass through most likely will comply unless\nYou know I give them the wrong by unless I asked the wrong way I Would imagine that same stranger who just comply to let me passed through because I ask it in a great tone of voice and the great matter imagine I cause I just\nWould you let me borrow a thousand dollars\nFor well what what what was that coming from I don't know you\nFrom Adam so why would you ask me for a thousand dollars why would I give you a thousand dollars when I don't know you will matter okay it's it's\nIt's it's like you know what to strangers there's certain things that could grants you but\nThere's certain things I cannot go ahead you because we don't have that kind of relationship that's why I say you cannot have communication without a relationship and the relationship will determine what you could talk about\n\nLike why the certain things are going to announce the stranger you cannot you cannot not\nLike why the certain things are going to announce the stranger you cannot you cannot not ask with strangers some personal information you know what's your blood type ... where are you going with that\nYou know so\n\nThat was imagine that a\nYear or two people who work together you have a professional relationship that in a professional relationship you know I'm every Monday through friday you talk about professional stuff work related stuff\nMaybe friday before work and\nYou might say oh have a great weekend you know I really you know go enjoy yourself you know you might offer some wonderful ah wishes to the person\nCome Monday when their combat as co worker you might change if you gossip hearing that a few things you know but nothing to eat or those serious because it's a professional relationship\nOkay imagine you have a professional relationship with God right\nEverything is or form where everything is work related uh you know that certain things you could never get into the gods as a professional relationship\nAnd there are certain things like you know it's not because the person does not have the capacity to be a black guy but he's a professional relationship and then when you reach certain activities that might be normal in a different relationship you got about ... right\nIn a professional relationship do certain things you could not talk to the person about certain things you cannot say okay let's go and do it together because you know it was a professional relationship prairie sort of like that if you maintain a relationship with God it's going to be awkward you asking but you know\nWell since we got it's going to be awkward you were asking but you don't really have paid for what you're asking for because you know it was out of the bounds because lots on your camera and and your wife\nYou know a ...\nThere was no solid foundation\nFor what you are asking for and likewise got cannot come and talk to you because you keep it a professional relationship now that may they may be things that God is able to grant you would in a professional relationship\nRight but they they're gonna be things that he's not going to grant you that going to be things that I look at you you're going to be uncomfortable coming to talk about\nThe manager in you have\nA profound oh\nIntimate relationship with a person now think about what sort of conversation do you have with that person you talk about all kinds of different\nAnd it's all most all different times some of them might be trivial some of 'em are just so profound that okay the conversation gets to be a little tense and some of it or they might be life transformative\nAnd there are certain demands that you make from that person that you would never dare ask someone else\nAnd there are certain times you make a phone call you know\nAnyone else you wouldn't dare call at this time but\nWithout crossing your good because you know we have that kind of relationship so you\nCannot have prayer\nWhich I'm call of the communication of conversation outside of a relationship\nAnd based on the relationship that you have\nIn ... and based on the relationship that you have then you will know how that relationship will end up the communication and the top of the communication that you could have with the process and what you could ask what you cannot\nSo with these things in the back ground let us go through the tax let us go through the tax and then think about\nHow God how you work with dogs and how God works would you uh\n\nJames size is any one of you in trouble Fisher Price is anyone happy let him sing songs of praise is any one of your sick\nYou should call The Elders of the church to pray over him and annoys him with oil and the name of the law in the ... offered and face will make\nThe sick person well the lord will raise them up if he had sent you will be forgiven\nTherefore confessional since to which other and pray for each other so that you may be healed what James is saying is this program is so important\nThat he ought to be done all of the time under any and every situation for average so important it ought to be done all the time under any and\nEvery situation but because privates like communication or conversation it's gonna happen in the context of the relationship that you have with the person then how we engage in that conversation is important and its relationship\nIs any one of you\nAnd its relationship is any one of you in trouble\nThere are a lot of troubles that'll taking place in the world I feel bad for them but in my ways of thinking and I'm like well that's not my problem and that certain problems you have there are certain people you're not going to call you cannot called\nOK you imagine you got a flat tire in the middle night\nYou're not going to call someone that you don't have a profound relationship\nYou imagine that you have you know a serious financial difficulty you not gone to a ball there's someone that you don't have a profound relationship with someone you have an an intimate relationship what they're going to know about your flat tires whenever that happened\nYou know if they're in bed wake them up\nBecause I'm In trouble it's not anybody else who for me I can come to you because you know we have that kind of relationship so what kind of relationship do you have we got\nYou know it\nIs God the person who hear your prayers last\nBecause in some ways you already know that you can't even bring those things to God's or you will have already brought those things for your financial consultant you'd already brought those things where you're ... or ... you you already brought those things to your friends and I can't even bring those things to strangers\nAnd there's oh none of them could help let me call got about\nImagine you have an intimate relationship with somebody and then they have already bring\nAll the issues to someone else\nAnd then they have already bring all the issues to someone else\nAnd then it's later one that you're going to hear about it honestly how you're gonna feel you're going to feel\nLike they don't trust you you're going to feel like for some reason\nThe conception you have about the relationship is not quite what it is because if that trust you if they believe in you if they're comfortable with you if the easy to talk to you than you would have known about if the if the only reason you're not hearing about it is because they don't feel comfortable coming to you [laughter]\nMy brothers and my sister's a relationship with God is which is my main point will determine how we talked about how we behave around\nWhile you're driving your car and give you the right idea you fix that problem so you may think you have money problem you don't have money problems you have one idea from the lord way as well I I\nYou have one idea from the lord way it was as well I I have this issue if God wants to come to you and give you that one I did that only God can get your solution will ... so that's why he was he wants to spend time with you\nBut when you're already comments if I knew what I Want to know what I Want is a I'm not I'm not going to give your leftovers I'm not going to give you a second\nBest I Want you to be connected back to me and then once you're connected back to me and at times when you less expect that\nI'm gonna tell you how I'm going to care for you I'm going to tell you how I'm going to provide for you and I'm going to tell you you know what you're not going to have anything\nBut I'm going to give you the piece that you need in the middle of this problem\nLike into Paul my\nRace will be sustained you know sometimes we don't like to hear it\nWorks if my voice was staying you because I Will renew your mind enable you to enjoy life\nFocusing on things that that matters to me focusing on things that matters I suppose the things that you don't have as opposed to the things that are ultimately that do not matter\n\nMy brothers and my sisters God tells us that prayer is powerful prayer was affected when it's done by righteous person\nAnd I should which you are the reason why he says the righteous person is not just talking about the piety as much as that is important but he's also talking about people who understand what it is\nIn prayer cannot be separated from the relationship and the relationship will shape sit as shakes the relationships\nLots of times the greatest thing that got\nJohn ships because lots of times the greatest thing that God will do for you was to change your thinking\n\nYou won't change your financial situation first you won't change your physical situation for us but he's going to change your thinking\nAnd I was telling you some of them you\nYou telling God do more joy\nTo Moro\nThen I Will do this in God's has already give you the day go enjoys it no no no change there's been a lot of joy says no no I Want to give it to you\nSo that things that got over to give to you guys and to me and he's telling us to work on those things appreciating those things maximizing those things and change our perception around those\nMore and more\nAs I you know\nAs I read broadly not only within ... Christian scriptures and Christian communities writings and read outside of it yeah the reading this thing we're supposed to talk about you know how do you enjoy life how do you stop all this negative things oldest is that really brings you down\nAnd then you know that prime it in their own way but it comes\nDown to stop enjoy the now that you have in front of your stop enjoy it give thanks to it and I quickly realize what they're saying is\nUs when we pray that's what we do when you pray correctly what do you do you pause and then knowledge that you have somebody who is greater than you and your life and you have ...\nYou have somebody who is greater than you and your life and you have somebody\n\nWho stop you you and your ... that you could bring all your burdens too that you could talk about every and somebody who was over who's going to open your eyes not only to the difficulties that you have and tell you that he has a covered but also show you what\nThe wonderful things that you have an M ... sometimes you're going to come and you're going to confess things that are\nWhen you die and sometimes you're going to go and you're going to practice great furnace given sex right and sometimes they're gonna come you're going to praise the lord\nBecause you cannot do something with that keeping some of it to yourself let me give you an example try getting excited and worship\nService and still be depressed for that moment try\nTry bringing joy to the lord and not have it you know so it's impossible\nBecause you're doing it to the law that's why you asked me to do with God that God is not this person\nWho's so uh uh equal to stick to go just to go and just worrying about people doing things for him\nHe asked you to do it because he knows and you're doing it for him you don't want to have it yourself\nBecause when you pause and you begin to confess\nPeople pay good money to go to a therapist confess the wrongdoing and sometimes if they don't go through a therapist they're called you\nDon't you have friends call you were telling you about a death sentence because they the look\nDo you have friends call you were telling you about a death sentence because they the look entering you add the look in you as a as a confidant right\nAm I the only one\nNone of your friends\nWho called you and says just what I did the other day the conscience was bothering them they need to talk about the telling you because they know you're not going to let the the information out but then if you talk about it\nI tell you to go and praise though I don't want to cry when you're going for what you're gonna do you're gonna confess whenever there's a lot and it's going to bubble up and you don't need to pray about it you need to tell another friends about it because we need telling God the right person\nDon't you have some moments where you want to shout and get excited and you want to share with somebody\nThat exercise when you happy like that shock to the law which is ...\nBring it to the law because it's not it's not every day a friend who's going to be available and sometimes it's not every day that a friend who's going to want to see him being so jubilant and excited about that and it's because some people are jealous\n\nDon't you have moments sometimes where you want to give thanks\nYou want to uh uh ... all the things that you were grateful for because in doing so with the help you [noise] well that's my primary\nWhen you go to the lord sometimes in your pauses as you know I'm really grateful for what you've done for man and and and I'm Glad for the fact that okay if it wasn't on my side there's no way I Will be here\nIf it wasn't you who have gotten the adult this impasse that hopefully no one else no except me and you I wouldn't be thank you for that thank you for the fact that [noise]\nI wouldn't be thank you for that\nThank you for the fact that I got into traffic because my mind was somewhere else\nAnd you allow me to get into a traffic without another call coming up the same time thank you for the fact that I didn't get into an accident but somehow others have been killed by but somehow in some way you preserve my life so I Know it's not me being smarter and I know it's not just to make\nIt off the call I Know someone was looking out for me\nThank you for the fact that before you let something happened to me somehow you give me a full morning about it\nSome of us should be told\nThe troubles that we've got ourselves into God did warn us about it you got about it later on when you're dealing with the consequences but truth be told God did warn you about it\nSo thank God\nThank God for the fact that the Holy Spirit every now and then as you're doing right now are you\nTelling you about something telling you about a a way of change in your life away of pausing and acknowledging what's important\nThat's what prayer to pray forces\nYou to pause and acknowledge what's important in your life and this rock race mean we we were living sometime we were running around we don't even know why are we running around but when you pause and pray and what doesn't do it helps you prioritize that which is important\nAnd then having prioritize ... which is important what do you do you commit yourself to do something about it as God is doing what only God can do about it if\n... God is doing what only God can do about it\nIf you live by those principles guarantee you\nYour life cannot but improve\nBecause sometimes we are in this downward spiral\nIf you would pause\nAnd pride God would stop that negative thanking God would stop all this a worrying and infighting because God was a I got this thing covered\nAnd if you were to pause and confess some of the guilt feelings that you're carrying will will be lifted from you if you were to pause\n\n\n\nYou're listening to W. A. R. S. Thirteen twenty am apple borrow\nResolve money gone to use my brothers and sisters\nThat I've seen through my own law [noise]\nMy dog in my words\n\nHow about all\nIn\nLaw and [noise]\n... that a lot of\nThe river men are ...\n... ... ... in a word in\nLaw who smoke are ... ... a\nLong time commitment\nBut on the ball\nIn the palm\n\n\nThe na na\nNa\nNa na na na na na\nThan ...\nTo be big in ... rather than\nI said I'm not a\n\nNot\nNot getting any\nMy back I may ...\nWord man of la la la la\nI say about about a lot\nBe ...\nThe the ...\nWhat do you why not ...\nNot getting me\nThey can be both ...\nThe name the law\nShade number ...\n... ...\n\nOh\n\n\nThank you just know oh\n... ... ...\nOh oh\nOh\n[noise]\nAll all\nThat and I\nA nice\nNo I'm\nIn\n...\nIn\nA na na na na\nNa na na and AA\nOn a\nHold on the News I'm a\n\nI'm\n\nA uh\n\n\n\n\nOh\n\n[noise] ... ...\n... [noise] [noise] [noise] [noise] [noise] I\n... mother you\n... [noise] [noise] [noise]\nOh no no no\nYou know\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise] just\n[noise] [noise] [noise] [noise] [noise] your ...\nBut he didn't win\n\nNa\nNa\n\nSeems\nTo me uh\nI mean well I mean you know\nI can\nDo what we know\nYo da\nDa\nDa da\nI can speak your\nDa da\nWhoa\nWhoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa\n\n\nNo\n\nWe uh the ... ...\n... ... ...\n\n...\nWe didn't see the need\nTo\nLook at\n... ...\n...\n... of them they need\nYou know ... and he he\nDoes not\n... ...\n\nWas oh well maybe I mean [noise]\nYou\nKnow they\n... ... ...\n... in that level and\n... in peace then\nAs they did in\nThe middle of a\nAnd when that ought\nTo\nEach other last night\nThat you\nLike I'm being [noise]\nYeah well I didn't have any\nThoughts about\nBeing\nPhone ringing\nWould only be\nIt you know\nBecause they\nJust ... ... in the\nThey did in\n...\nAnd when that ...\nThat have to\nThat's you\nBecause we\nEat out a long time\nAnd he ... he\nThought that I saw\nIt in ...\nThey ...\nThey ... ... ...\nDo we\nGo\nWe ...\n...\n[noise] [noise]\n\n\n[noise] when\nThey look like me [noise]\n\nIt makes me wonder as one you make ... ...\nTrying to restrain getting ...\nMen do they go back to me that way around\nThat up again\nI'm\n\nI'm not ... ...\n... ...\n...\n\n[noise] [noise]\n[noise] [noise]\nWell maybe I can see it today to do these things can change\nThe now now she's in\nWell he's given me peace though now every\nDay\nOn may ... no ...\nBut it does you know every year yeah\nSo a praying for\nGiving me Donny\nName for a guy named me I'm na na\n\n\nNa na na na na na na na na na na\nNa na na na na na na na na na na na na na\nOh\nNo no no\nNo no no no no no no no no\nNo no [noise]\n\n\n\n...\nTrips didn't\nTeach me how to\nYellow drop the ball\nAnd you know ...\nKidney normal you've I'm making\nDecision whether or\nWhat he did you\nMake it had been thinking about what ...\n...\n...\n... ...\n...\nJust didn't\n\nYou know you're really low\nYou know you really look for me you know all the way\nDid you do\nThe ... you\n\n\n\nWell [noise]\nKnow I [noise]\nYou're listening to W. A. R. S. Thirteen twenty am Arab world\n\n[noise]\n\n\nI'm\nLong um\nYou\nBall\nBe in you\nKnow\n[noise] we are\nAnd [noise] you know\nMen [noise]\n[noise] [noise]\nThey are I mean you ...\n... no\nNo no no no I\nMean I Know that you know my\nYou know I have one\nMom or you\n... na na\nNa those ...\nYou can rent it\nHe\nMan\nUh then\n\nRead ...\n...\nNo no no no no\n\nNo no no no\nWell there were a lot of them they can get you\nA roundabout\nThe ...\nNa na na na\nOh no no\nNa na I had\nAnd the the\nUh\n\nOh oh\nMan\n\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa what about the\n\nGoes to a\n\nLa la\nLa la la la la la\nFollowed\n\nWhen I\nGrow up with them on a\n\n\n\nThe energy and\nWhoa whoa\nWhoa whoa\nWhoa\nWhoa whoa whoa [noise]\n\n[noise]\n\nWe can\nThe um\nThe um\nA\nWhile the ban will be a\nDon't all of a ... who was one of the time or was you know we know of all they do a\nReport on the other one they just\nUp on you know they\nDown the hall of fame a\nDolls or bad find me and I thought it was\nFor a man ah to\n... days around me\nCan you show me how\nThis is\nMe care to be on\nFar to the students\nOne guy had too many ...\nCan't\nDo we\nKnow\n\nBorder I saw\n\n... ... ... ...\n... ... ... ... ...\nI can\nGo on the ... what will they lie well no\nI don't know I can\nOnly imagine what my\nEye he when he can\nHe\nYou are listening to W. A. R. A. Thirteen twenty am apple borrow\nMom who\nKen I'm\n\n\n\nNo\nA\nVery moving\nDum La Crosse\nA longtime own grave\nWaiting for the day will now be come\nThey don't oh\nGod\n[noise]\n[noise] [noise] [noise]\nThey can ...\n\nWell the ... all\nMood global\nA ...\nOr\n\n\n[noise]\n\n\n\nNeed to be a deal to me because it just you know what I Do to me because I\nWas very clean up the\nCorps\nThen in the ...\nThe\n\nYour hand\nAnd\nOur\nAnd\n\n\n[laughter]\n\n\nUm\n\n\n\n\n\n[noise] [noise] oh no but\nHow many a night for\nHas maybe they're\nAll the time was\nVery seen the green and ...\n\nWhere you know ...\n\nBoth on screen\n\nDo\nYou live today\nUm\n[noise] [noise]\n[noise] [noise] [noise]\nThe\nIn ...\nWhen you know\nIn\nThose gray\nOh\nNo kidding me now have named\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\nDown the ... to\nThat they were both\nOh\nLong\nOh oh\n\nI'm\n[laughter]\nKnow na na na\nNa na\nNa na\n\nA\nMe on\nOh oh\nHer [laughter]\nGod\n\nGirls grow\nMy mom\nSince the\nI'm\n... who\nHe is he\nThe\n...\nNo\nUm\n\n[noise] [noise]\n\n... ... ... ... ... ... ... ...\n... no ... in a row they enter Tommy di do\nDo right\nYou're listening to W. A. R. S. Thirteen twenty am Arab world\n[noise]\n\nAnd\n\n\n\nThat you know me and so\nNa na na\n[noise]\n\nI Need you one more lay the new\nWell no but\nShe knew\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\nKnow that that they\nNot really\nPhone\nOut\nThe ball rises\n\n\n\nMy uh\n[noise]\n[noise]\nWell why\nThey run\nRain a loan\nYou're listening to W. A. R. S. Thirteen twenty am Arab world\n\n\nAnd there there\nAnd where do you go\nThere right\nNow don't miss the the\nCheese are being the ball and\n\nMaybe banning\nThe time\nThe phone and you know do do do you keep moving\nGreat ... that\nThere will\nThe big\nWith the job to\nIt in the street and you\n\nA dead man Ryan break the\nBank and their direct don't you don't\nAny big mind a\nThere in Iraq and\nTheir neurons\nThem\nThere and\nThey can be\nA\nYou know\nThere in Iraq and\nSay\nThey're there and I\nBeing and\nTo\nTo say it should do it for\nSome\nSome\nKnowing\nOn the way he does\n[noise]\n\nAnd the sweat the\nRelease it no\nDo it for me\n\nTell you the\nSay tomorrow so I don't\n\nKnow where you will you told me that he was\nAnd I believe it will I Believe it will [noise]\n... no body else do it but the law I Know\nYou you will you told me that you would\nWant to know why I Believe in my heart that my law will make a way Sean\nNa huh\n\nNot that I'm the I'm going\nAgain and you know\n\n\n[noise] [noise]\n\n\n\nNa na\nNa\nYou know\nIt was\nShould you\nMan you can tell\nMan [laughter]\nThere\n\n\n\n\n\nIn the not the\nAgain we're just now I\nMean they\nI'm In\n\n\nWe just hang\nDo the math\nNa\n\nAnd\n\n\nHow long\nLiving in\n... ... ... ... with that you\nWell then\nIn the ...\nDo we see and\nYou know\nUm those little\nIn the\n\nThe men\n\n\nGood would then they go at all of my\nReal slow down and darkness and never do that [noise]\nWell they're fun to look for\n... ... ... the grand too much more\nThe world would then they search for a high school\nAnd they try to average by the time and money never tell\nAnd would do\n...\nMore just fun\nCould I be given the the memories that are ...\nStill not much more\nJobs were arrested in law\nMore than a man go there you know all of them\n[noise] [noise]\n\n\nOh\n\nYou're listening to W. A. R. A. Thirteen twenty am Arab world [noise]\n\nDa\nNa na\n... and ... ... ...\nNeed to be leading\nAnd this guy\nAnd then we\n[noise] the men [noise] we'd do strong\nThis is a ... ...\n... ... ...\nA\nYou could\nMen ah three\n[noise] [noise] [noise]\nNa na\n\nNa na na\nNa na\nYou\n... yeah wow\n\n[noise]\n[noise]\nThe day is right and\nIs the land is\nWith the lead me to the the [noise]\nWhat do you believe me\nSmall but they have\nBaby in the I'm In a\n... new may a great thing to\nDo a\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n... um\n\n...\nGo ...\n...\n... ...\n...\n\n...\n...\n\n... ... ... I mean no one no one knows\nThat we're seeing ...\n...\nThe\n\n... primary I was pregnant with\nWas what was going on par ha ha ha\nHa ha ha ha ha ha ha\nWell he has not yet\n\nGod no more of a\nNeeds expecting any even\nThings\nThis\n... ... ... or ...\n\n...\n... ... yeah you're you're you're hearing it [noise] ...\n... ... ... ... ...\n...\n... [noise]\nLadies and gentlemen welcome to rival morals dreaming\nBaseball and I know we are\nWay you're listening to W. A. R. A. Thirteen twenty am Arab world\n\nYou know\n\nBook\n\n\nI never get sick of hearing\nYou\nI Know what it around [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] ... you sound hot rock radio\n[noise]\n\n\nNeed to pay\nFor everybody\nKnow\n\nShows\n\n\n\n\nThere were so\nThat there\nIs [noise]\nShe did\n[noise]\n\n[noise]\nWe do\nI\nJewish\nAnd they\nAnd and and\nAnd then when they and\nThey [laughter]\nI'm On you to the upper room has a YouTube channel which is up or room are I just typed out and you should be able to get some we would like to encourage you to come on down and it's not it's nothing like a nothing like\nUm I guess you could say a seeing a band live and in concert play another truck right now by rock salt this is called gonna move Iran hot rock radio\n[noise]\n\n\nAnd a half\nMillion man down on the other thing that\nWas\nThe only thing that\nOn\nThe bomb in a\nYou can read\nYou can find why\nThey say they are just around the bomb or just the way to live by\nBill um let me know buddy who\nAm I now know for a long time there was one of them is de ... that would\nMake them that\nBomb in the\nTo give them they want\nBatman\n[noise] [noise]\n[noise]\n\n\n[noise]\nThey planned it you'll want to go\n\nAnd enjoy the college right and then they have bank\nGave to breed a bitter\nThey know their own thing but I Know that after a while I read that book\nYeah I Know that after a while I read that book you know I'm not I have them you can breath\n\nBadly you want\n\nTime\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\nThis is hot rock radio\n... ... ... ... ... ... ...\n... ... ... [noise] Mm\n\nMm Mm Mm Mm Mm Mm Mm Mm Mm\nWhere near McGahn since ...\nAnd ... ... ... what I mean\nYou know ... ...\n... ... Mm Mm Mm\nNo I I forgive you know\nWhenever ... steak you know I'm\n\nA low in Maine by your side and\nAn old man ...\nAlthough we mean by your side\nI mean come on their own in the\n... ... ... ...\n...\nKnow\nEven though you didn't want me to\nEven though you're taking care of\n\nTheir own wham 's ... come ...\nAnd ... and your name again ma'am\nWhen whenever they are saying can you know\nA low in me by your side\nWhen no one is ...\nA low in me by on July ...\nI'm\n... ... no ...\nI look at me and the ...\nYou know\nAllowing me by your side\n... no let's go I'm\nDo in the buyers dies\nThen then you know\nAnd then you know\nYou know Mm\nLa and I'm\nIn um\nWill\nCome on and you know\nMm Mm Mm\n\nI rock radio the ... of God's love for you here each and every week on Thirteen twenty streaming all around the world\nTo and we like to say um hello also too I Wednesday friends who listen on thirteenth twenty W. A. R. and ah what do we got going on here Lou right where was I Oh yes um we want to give you an opportunity\nExcuse me why turn the dial over here to another I\nWant to give you the opportunity to um\n\nIn a bar or a\nHour and then all of our own and your mom or\nThat was a little bit of the joke I'm Susan\nThat was a little bit of the joke I excuse me thirty three lakes is performed a at the upper room were recorded believe it or not at the upper room\nOr we'll give you a chance to hear what we heard show petty but we'll give you a chance to hear the show from her professional recording and I'm not saying that the upper room sound is not professional but when you sometimes when you're recording things in the lives environment you're not getting the full crush 'em quality\nUm that you may or may not get or I should say may or may not may get a in a you know for an actual ... mix CD a there's a lot to it in the music business to get a group or an artist is shown\nUp just perfect his Joe petty with hold on tight here on hot rock radio [noise]\n\n\n\n\n\n\n\n\nNow you\nKnow\nI'm\nMy mom I\nSaid\n\nI\n\n\nMm\nMm\nMm\nYou're listening to W. A. R. S. Thirteen twenty am apple\nAnd\nThe rain [noise]\n\n\nWe live lead and\nOver the\nOr\n\n\n... ... ...\n...\nA ...\n... I\nI ...\nAnd ... and\nChris ... with Jesus she loves me and uh before that we heard from news boys that's for sure and oh by the way we're ah you're watching the hot rock radio here on Thirteen twenty we're here each and every Sunday from six to nine a courtesy of Jim Jones and all the gang out\nThere are really a great uh\nYou know an awesome opportunity to be on there with a with those folks\nUm you know a ... as we look at the calendar right and if you\nGo to um one way you can find out what's going on at least at\nThe upper room and you want to keep up to date with everything you can go to W. W. W. dot the rubber room are I uh ...\nW. W. dot the upper room R I\nOr dot O. R. G. and just click on the um the links are should say the events calendar on the left hand side of the screen so I'm definitely come out and combine next week\nOr at the upper room yeah every week there's something different at the upper room we can't tell you that it's like the same old same old and you know every week every week there's something new and exciting something new invigorating and and just a enough to just a\nUm I don't know get to recharge you know having a bad week that day bad whatever or maybe feeling down and out you know where else can you go on a Saturday\nWhere um it doesn't cost anything to get in I don't know too many places these days it's free\nOr to get into but come on down and make why not make this weekend the chance that the weekend that you will a try something different which is the upper room I Know we've been talking about the upper room a crushing coffee house for many years we've talked about a bunch of other coffee houses as well\nI Do know I had so much strength yes you know your own strength lowest his hair goods good him little Louis hello wow you know um\nWe've just do what's been going on in the world of lowest lately you said you went on a woman's retreat last week I went to women face last weekend which was fabulous and um I was doing something like that she's been away for a while\nYeah well it's it's definitely not the same thing because this is like a a national ministry and they go all over the the country there in South Carolina this weekend and in Seattle I think it is or Portland, Oregon something like that next weekend um\nWhere were they did they come to your church there in Hartford position rode on half the half said [laughter] so it went over they used the week\n... no no no it's just the weekend it was a friday night and Saturday when we came home Saturday Night and time for a church on Sunday oh wow yeah it was great you know and and there are many\nUm women who are nationally known 'em for their different ministries actually internationally known for their ministries who come and speak and share their their stories and\nEncourage women to just rise up and be more of what God has called us to be ... to let us know we're not alone in our struggles\nYou know it's funny a lot of times when people go through things in life\nThey think that sometimes it feels like you're the only one going through it you have you ever noticed that\nOh yeah I and that's kind of the purpose of this is to let the let these women know that they are not\nThe only ones that are going through difficult circumstances and sometimes I feel so guilty because my my difficult circumstances are nothing compared to the difficult circumstances that some of these women have been through in their lives case in point on\nSaying compared to the difficult circumstances that some of these women have been through in their lives case in point on that you know it's funny we we always look at our situation in life where we think it's the worst situation ever ... you know like for example means means to you know we live in a a of a modest\n[laughter] a small\nLittle apartment three rooms maybe and and and one of the biggest pet peeves that I think I should say pet peeves but one of the biggest things that I it bothered sue more than me is that you know we're cluttered\nNowhere congested is too small for two people and um but it you know we've tried we've looked at a few places and actually about four or five different places you know for the costs since the since we vote since the summertime we really haven't quite found that the nothing's come to fit yet\nAnd uh you know we always come you know I I have to admit I'm guilty of sometimes I just complain too much about what if you know why why do you know we could have this we could have that you know or we could be making more money uh we could be doing this\nAnd then last night [laughter] I happen to see on sixty minutes or I don't know if it was a recent sixty minutes where\nThey were showing people who\nHave been down and out\nLost their job\nLast or or just working poor\nPeople living out of their cars ... they had this one family that was living in a um [noise] with like a broad truck van\nYou know with those big event you know like a UPS type a truck it was like a bread trucks type things delivery van with a sliding door on the knees say on the big ... ... and these people were living in here I Am complaining about living in boxes and storage and all that and these people were living in bags mhm\nAll that and these people were living in bags mhm [noise] and it just blew my mind when I saw this because it's like wow and and how happy they looked\nMhm yeah they had nothing and\nThey you know imagine you'd you'd if we take for granted that we live in an apartment\nOr in some people's cases maybe a house\nWhere you have\nYou know you could go to the bathroom or anytime you want or need to take a shower or bath\nYou know some people you know to get ready for work or school is like a a big ordeal like you're going to get yourself to the nearest YMCA down the street or you know a place where you can take a will get cleaned up somewhat and get ready and they didn't even you would never know when you see them in public\nBut above their living conditions\nSo when I've seen this documentary I was just\nIt humbled may have to ...\nOn my it reminds me of um about a long time ago when um people from ... Ghana Stan had been I'm living in other countries intense and stuff and they were finally\nAllowed to go back to their homes\nAnd I saw I don't think it was on sixty minutes but it was some news show where they were doing that maybe was even a documentary where they were talking about these people going back to their homes and what they were going back to that they were so thrilled and so incited to be going back to\nWhere a hip high mud walls\nWow and they had a rock in the middle of a pet that they would build a fire around and when the rock got hot they put their bread on top of it\nAnd when the rock got hot they put their bread on top of it to cook it that's how they made food\nAnd that's how they made food and these people were ecstatic to be going back to the legal their\nHomes or wow instead of living in tents\nSo Lowe's your mind away doesn't it get to be thankful for what we now have have you know sticking to that too low as soon as I was\nDriving the work coming here today I'm Santa myself here I Am I have a I have a roof over my head I can sleep in a warm bed and have a car to drive you know it may not be the the latest model or the you\nKnow the [laughter] you know the thing with all the fancy buttons that gets me from point a to point B I can stay it keeps me warm while I'm moving it works\nIt's got four wheels [laughter] oh that's a plus a threat um and the steering wheel yeah well that's very important um and you know I thought about that after I saw that documentary last night I'll bet it even has heat in the wintertime\nMhm [noise] and uh I after I saw that documentary I just went to bed and I'm just saying to myself gee imagine those people that one guy in the documentary there was saying that that his family would take turns guarding the car\nIn the you know and they would have to move the car from different locations to protect themselves from the anything that could happen to them you know like they ... they could get robbed in the middle of the night police couldn't harassed them you know because if the police find out\nThat are found out that these people were living on the street with kids you know then the D.C ... and then they take the kids away from their families and there there was scared about losing their children\nRight so you know God said to myself oh magic living like that day to day and the woman the girl was there was a girl that she was a teenage girl she was just the most uh positive\nGrow with there was a girl that she was a teenage girl she was just the most\nUh positive bubbly\n... year little young lady that you meet and she was living in the back of a van and she says you just gotta do what you gotta do day to day to survive and make they make things happen and not focus now on the ...\nWhat you don't have yeah yeah and I'm saying to myself she's got that attitude and look what she has and will give me ... or look at us and our attitude with what we have\nRight and I'll bet that because this was on sixty minutes it was on sixty minutes I Can't read them but I I what I'm getting at is is that I'll bet\nThey didn't say whether those people were even Christian or not you\nKnow they didn't go into those the relation ship of of God or anything like that\nAnd I'll bet some of them are not maybe that some of them or not but they can still have that attitude ... imagine\nWe can do with our thought life if we choose to when we have the spirit of God within us ... just imagine there's in anything that we can do there isn't anything that we can't\nGet through because that's what got promises he doesn't promise the prosperity\nThat so many latch onto he doesn't promise the prosperity he promises to get us through\nHe promises to be with us in the hard times because those hard times are going to come that doesn't mean that you're not a Christian that doesn't mean that you don't believe God it doesn't mean that you're outside of the will of God or or don't have face\nThose things happen I mean if bad things happening to you indicate that you're not inside the will of God then Jesus being crucified\nYou're not inside the will of God then Jesus being crucified would've put him outside of the will of God said he wasn't God was with him through that\nAnd just it just it just baffles me though when we think about how blessed we truly are yes so you know\nIf you're like me listening right now\nAnd you're sitting in your look in your apartment and wine and bigger pac man\nI Want a better house I want to I Want a nicer car\nOr even on a smaller scale you look at your cell phone go\nAgainst I found you know\nThere's some people don't even have a cell phone there's some people that can't even afford a tin can and string to make a phone [laughter] you know and I'm not saying to laugh to make fun of the situation but\nThat certain people step up and help you know don't\nWe assume that certain people step up and help you know don't expect anything from anyone at any time I mean if it happens great considered ... it's a blessing from God but God can use\nAnyone he can use your boss he can use your friends you can use your family he can use this total strangers but God can use anyone to bless you at any time whether it's money whether it's something that's material or need whether it's close whatever it is\nGod can any will if you trust you will bless you and then so we should all that to share this or that say this is that during this this season that we're entering into a season of giving\nA season of bounty forgiving and thankful and this would just pray that ah that this attitude and and I pray that for myself as well we'll continue\nUm time and time again throughout the year not just this year this time\nWe need to be thankful all the time for the little we have yeah\nDo we need a new uh uh you know could we use a better place to live\nMaybe could we you know have more money in a bank accounts probably you know could we be you know having enough money to pay all our bills off at once ... maybe you know but\nWe're able to get by what what we got and what we get and\nYou know so hopefully that um I guess you could say enlightened you a little bit too I'm encouraged\nBe encouraged to just uh you know I guess you could say I'm looking at your circumstances and say hey you know what it could be a whole lot worse I say that to my wife's\nAnd say hey you know what it could be a whole lot worse I say that to my wife's to a lot of times you know when it especially when it came to the crisis that we just went through you know we look back on or crisis that we just gone through they've got can take it too it he'll take you through it\nAnd I said that my ... you know it's just a suicide you know that was ... you know we look back on it that was I mean when we were going through it it felt like it was the most painful thing in the world but looking back on it in hindsight\nThat was nothing it could have been a whole lot worse and then\n[noise] All right well and we've been playing a lot of good stuff I'm telling you a little bit about what should what to expect that the upper room hey you know guys come on up to the upper room\nCheck 'em out uh we got a new ban coming up this week is this a broadcast Brittany cash 'em in um the cash men or the cash 'em in a band is playing at the upper room for the very first time their brand new I'm always brand new to watch\nAnd are there uh we'll give you a couple of samples right now again of what they sound like this is a track called kings of glory [noise]\n\n\nWe're going to play another track right now this is called um\nDa da\nDa\nAnd more music right now from our hot rock radio archives from a band that just recently\nHas a retired this is the N. B. J. bandwidth from their trip it or just the king album here on hot rock radio\n[noise]\nSeemed to be in the\nPrinting will be some time\nAnd I know [noise] push oh\nI go to push your order\nMan now mayor rely\nFriends are down there\nIn the jobs bill but\nMom\nI Know for sure oh\nDo it in the first show oh\nLong time to time\nWe continue with the Donald\nTell him and so\nTo be in the in the middle east and you know in in in the\nJumping Ben I'm\nFalling down\nAnd\nAnd round and round and round them\nPromise to look\nUp\nPromise to look up\nA lot of you and me even though you're saying\nThis world have\nDo a show or\nDo they will be the time\nKnow in pushed yo\nA long\nWe continue with the\nKnow we have to do it\nIn my ... in the world\nMan Tom Reeves for\nShouldn't do that but it how\nBob and they're in\nMy trust and you do or\nTake my ... way\nTank you away from\nSmoke bees and ... I\nI Know the first show or the\nWill be some time\nOr\nOh I Want\nYou mean in China\nKnow and I go out\nSmoke me a\nTo do it\nYou do when the", "show_name": "no_show", "year": "2018", "city": "Attleboro", "day": "21"}