{"month": "10", "state": "MA", "station": "WARA", "content": "\n\nYou're listening to W. A. R. E. Thirteen twenty am Arab world\nI'm going to see\nTo be making ...\nAnd you\nBe injury\nThe\n\n\n\nThe the\n\n\nMy\n\n\n... he\nWas the\nMan\nIn\nA really\nSmall\n\nMm\nMm [noise] [noise]\n\nBy the time\nWrap on\nReading the magazine [noise]\nAll right\nWas\n[noise]\n[noise] I\nBringing an animal\nBring it in a minute and then\nThen a little bit more and then when\nWhoa whoa that people\nUp and\n... the medal mhm\n[noise]\n[noise]\nDo\n\n\nThe ball bringing them involved in that direction\nFor going in and all that\nAgain and again and\nAgain [noise]\nIt all over\nA flag I [noise]\n\nI\nWhen\nThe\n\nI Need you\nI Need you know lay the\nNa na\nNa\n\n[noise]\n\n\n[noise]\n\n\nAll that that's a real\n\n\n\nI'm In my job\nYeah I\nThose were\nThe\nOther\n\nHand\nThey're just saying\nDon't need all that and we\n[noise]\nNa na na\n\n\nSay that again the\n\nJob with a ... a world champion\nWherever we will pay for their lives will\nThere and don't let the mobile\nBut there are big\nBall and oh\n\nThe time I didn't know how to keep the\nThing\nThe news and\nYou're listening to W. A. R. S. Thirteen twenty am Arab world\n[noise] [noise] [noise] [noise] I live\nRubble\nThere ah by\nOur you walk in with them this is Cherie burns are you trying to take them up on New Years down the line and you live in and bomb the Gen you know that's bad for your spiritual and\nDo you try to buy your emotions are you put near St didn't let you lead the menu and I imagine then you better be careful because you've been in the I\nDie\nMean I Know so\nOther oh my God I had a good\nUh\nThat you think do you wonder why do things you do\nDo you deal that sounds it's got a hold on\n[noise]\n\nAnd you know\nNa na na\n... ...\nDream come\n\n\n\n\n\nBegan man\nNa na na\n\nNa\nMan I\nThe\nOr Japan\nYou\nFor\nBeer and [noise]\nAlready named that now that ...\nAnd the naming the\nThan\nNa na ... he\nTo go\nThe ...\n\nUm no no no no\n\n[noise]\n[noise] [noise] [noise]\nThe movie and\nThe ...\nRight now I'm\nIn a\n\nNo\n\nNo no no\n\nSome na na na na na\nNa\nNa na\nNa\n\n\n\n\nAnd brings me either you\nKnow even the words that\nKnow once\nTo\n\nAnd throughout\n[noise] um\n\nAnd\nMe [noise]\nMe and\n\n\n[noise]\n[noise]\n[noise]\n\nQuo\n[noise]\n...\nYou have\nA a really really pretty [noise]\nUh\n[noise]\n[noise]\n\n\n\nUh [noise] a man\nAnd a\nHalf a million dollars\nA day\nOr [noise]\n[noise]\nYeah\n\nThe end term let me\nThem a long time to go to a\nThem to my teens and ...\nTo\nSemi dreams them off\nAlong the road\n\nTo put all my long\nWell to\nDa da\n[noise]\nNow do they live on that a long\n\nMan who\n\n\n[noise]\n... do the story about the man\nWho kingdom homeless guy\nWho really broken hearted oh man the man\nHas been dry it in a\nYou do you do do\nBills paid the bad guy I'm\nYou are listening to W. A. R. S. Thirteen twenty am apple borrow\n[noise]\n\n\n\n\n\n[noise]\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNa na\nNa na\nTold\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise] [noise] and a\nNew down and\nIn\n\nIn Chinatown\nThe\nTime but baseball\nBecause you\nDon't\nWhat to do your\n[laughter] [noise] di di di\n\nDi\n\n[noise]\n\n\nNot at\nAll\n[noise]\n[noise] [noise]\n[noise] [noise] the\nMovement and you\nTo hear\n\nFrom\nDa da da da\nDa da\n\n\nDa\nDa\n\n\n\nTime by the way\nThis now let's see\nThe dominant although they\nGood knowledge let's see\nDo about that and then they\nDa\nDa\nDa\nDa\n\nSays oh\nGo there but now about it learn a\nThey do things and um\nGo surfing buddies are now\n\nMan out\n\n[noise]\nOh\n\nOh\nWhoa\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n\n[noise]\nOh not that long\n[noise]\nI don't think it's [noise]\nIt's bad enough that they didn't [noise] [noise] [noise]\nDo they do but and then [noise]\n\n...\n\n[noise]\nDays and then go\nOut that she knew very\nAbout that\nNow that they're buying word\nIt has been torn\nDown man that I thought I heard when\nTime\nI Am\nMy guy you\nThe movie\nKnow county commissioner and over and over time\nHo ho\nHo down\nThey can come\nThe guy and\nBy\nUp in that case\nThey feel that\nGuy\nOr girl on there\nDown [laughter]\n\nYou're listening to W. A. R. S. Thirteen twenty am apple borrow\nWe'll go\n[noise]\nWe'll go to fall in line until the last minute\nIt and do you live in the name of the little little world we\nYou do the um the dumbest and shooting the gun laws that Yahoo\nDied and the men loaned me live\n... ... as for me like a little she will\nThe new me I'm Lynn ...\nThey're they're being there and and and then I went in there and\n[noise]\nWay\n\nYou know\nI'm ...\nThe main\nDa da\n[laughter]\nAnd\n\n\n[noise] oh\nNo\nDing dong\nSees\nMy again my freelance battle out\nDo that\n\nHe\nShe\nThe time I got down my little da da\nNa na na\nNa\n\n[noise]\n\n\n[laughter]\nSaid\nThat that all the same old\nHamm\nDone in a gun shy\nAnd\nKid ...\nDe ... now\n\nYeah I can hear you\nLot of\nEvery\n[noise]\n[noise]\nRead and on and I\nNot a bad time\nTime no no real\n[noise]\n[noise]\n\n\n\n\n\n\nLa\nLa de\n... de\n\nThe\n\n\n... you\nCome true\nThe\nOh\n\nBe the one that you\nDr Gary highland or will return to Richard ... library for\nA series of lectures titled papers the series starts with the federalist papers on Thursday October for it it will be followed by the pumpkin papers on Thursday October Eighteen\nAnd the Pentagon papers on November first all lecturers will take place it's seven PM registration is required to attend these lectures if you'd like to register you can email librarian Maggie homes at ... homes at sales in dot org [noise]\nMaybe you didn't choose this\nAnd be an all star caregiver [noise]\nSo what are you going to do [noise]\nClean either emotionally and physically you got to dig deeper\nDriving the physical therapy doctors appointments don't you forget about the pharmacy you\nBecause [noise] that's what caregivers due\nBe the best cure for this world is our said [noise]\nCaregiving is tougher and tougher to care God's you need at ... dot org slash caregiving\nOn the target you needed or if you don't work in Washington\n... born in New York the New York now\nLooking to make a difference have extra time during the week the literacy center is looking for you by becoming a volunteer at the literacy center you could help them learn to read a study for the citizenship test learn English and even help them with their high school equivalency for more information on how to volunteer or joined the next shooter training\nYou can view our website at the literacy center dot com or called Bible wait two to six three six zero three the literacy center building a better community [noise]\n[noise]\n[noise] ... [noise] ... no\n\nThe older you know turned back and say [noise] so\nMe\nBut you know\nWe're a\nFact that the dollar [noise]\nOne\nDa da da da da da\nDa da da da da\n\nDa\n\nDa\nDa da da da da da da\nDa\n\n[noise] oh\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nNational diversity graduate beer will take place on October thirteenth from three PM to six PM at Rhode Island colleges Murray spender attendees can speak with graduate admissions representatives from local and national colleges and universities\nThey'll have the opportunity to learn more about admission requirements application deadlines financial aid opportunities in war\nThe fear is free and open to those considering\nFinancial aid opportunities and more the fair is free and open to those considering graduate school those wishing to agenda ... register by visiting diversity college fairs dot com\nWell Jason I've got to tell you you're pretty much everything this company is looking for in an entry level candidate great your resume isn't quite what we're used to but you've got a fantastic work ethic thank you and I'm impressed by how you carry yourself\nSo should we talk about the job to job oh sorry yeah I have no way for creating or even meeting you this interview didn't happen\nIt may sound ridiculous and that's because it kind of is there's a huge pool of time with your company's missing out on meet the grads of life who are they telling worth knowing about young adults have unique determination and experience an ideal\nFor your company in an entry level position internship or even mentorship they might not have every qualification you typically look for but they're exactly who you're company [noise] we really don't miss out on a resource many innovative companies have already discovered go to graduate dot or to learn how to find cultivate and trained as great pool of untapped\n... by the council of graduate life dot org\nFor over forty seven years Amigo and has been offering services and programs for children and adults with autism spectrum disorders and other disabilities located at thirty three Henry avenue in Edinburgh Amigo has been committed to building vital relationships hawks fan in their community ties on the local level\nAmigo provide state programs transitional planning and a continuum of services to support all ages for more information you can visit our website at Amigo ink dot org\n[noise]\n\n\n\nYou're a rebel or\nChose to clean and you don't you know\nIn\nWhile and\nLittle thing\nAre now\n\nWhat\n\n\n[noise]\n\n\n\n\n\n\n\n\nThe one ... Arab world Dr Gary highland or will return to Richard memorial library for a series of lectures titled papers\nThe series starts with the federalist papers on Thursday October forth it will be followed by the pumpkin papers on Thursday ... genes\nAnd the Pentagon papers on November first all lectures will take place at seven PM registration is required within these lectures if you'd like to register you can email librarian Maggie homes at ... at sales in dot org\nStaying at home surrounded by family and friends resting comfortably with your illness under control and support for your family caregivers that's what most Americans want at life send hospice\nCan make it happen with the help of hospice patients and families are like can focus on what's most important enjoying life together and living as fully as possible feel free to contact community in a hospice at five zero eight two two two zero one one eight\nYou can also visit community DNA dot com for more information\n[noise] let's go inside the mind of a ten year old one\nLet's go inside the mind of a ten year old I should warn them earring did I\nI like the earring Gabby had those often urine I Need to ask her where she got that but that's just what you would want me to do I'll have McKay laughter for me buckle up Sarah yeah\nBut then they can and will be like why don't you ask your spouse that's just like the Kayla Farrell back a lot I came to a great name I Wish I was calling to Kayla there's like\nA dozen stairs in my class hey we're not hitting the road and the ... oh yeah seatbelt I forget sometimes because the brain is like busy you know\nI Wonder if you eat that school today\n[noise] sometimes it can be tough to get through your ... but it's not impossible always make sure they're wearing your seatbelt even on short dry remember you had the ... you have the power will never give up until they bought a message from the national Highway Traffic Safety Administration at the council listen they record the Gulf slush kids' book look more information\n[noise] [noise] [noise]\n[noise]\nMm\n\nHanding\nAnd\n[noise] and\nAnd\nAnd\n\n[noise]\n\n\nKeeps me\n\n\nI remember as a boy\nKnow the garage dreamers over\n\n\nIt up and go\n\nNa na na\nThe real way\nI Believe that you oh you do them well and that then lead the way\nThat it\nGives them the\nRight to make it easier\nTo\n\nRemind you know we use to be\nMy knees\nIn the long\nRun [noise] [noise]\n[noise] [noise] [noise]\n\nI\n\nThat um\n[noise]\nA ball oh\nI'm going to\n\nYou\nNeed to do\nAnd then then the\nMom I mean they've been\nRight at\nThe the Fox News in the winter\nAnd mine um we\nWeight [noise] [noise]\n[noise]\n\nThat\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\nNatural diversity graduate career will take voice on October thirteenth from three PM districts at Rhode Island colleges Murray surrender attendees can speak with graduate admissions representatives from local and national colleges and universities\nThey'll have the opportunity to learn more about mission requirements application deadlines financial aid opportunities in war the fear is free and open to those considering graduate school\nThose wishing to agenda ... register by visiting diversity college fairs dot com looking\nAnd register by visiting diversity college fairs dot com\nLooking to make a difference had extra time during the week the literacy center is looking for you by becoming a volunteer at the literacy center you could help someone learned to read study for the citizenship test learn English and even help them with their high school equivalency for more information on how to volunteer or joined the next two to training\nYou can view our website at the literacy center dot com or call by the wait two to six three six zero three illiteracy center building a better community\n\n\nOn October thirtieth six thirty PM the center\nReconciliation will host\nThe hidden history of the second amendment a presentation by Carl ... the role of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states gas will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at the Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy [noise]\nHe'll challenge your storage [noise]\nTry to break your will\nDo push you to the edge of your sanity [noise] because that's what\nKids do this car is your territory out there to defend\nWho makes the payment who cleans it drives\nYou do that too and in here your word is law so when you say you won't know until everyone's buckled up you won't budge in it [noise] ... to hear that [noise]\nNever give up until they buckled\n[noise] the message from the national Highway Traffic Safety Administration and the girls are more information because it's safer car dot Gov slash kids\nBuckle up staying at home surrounded by family and friends resting comfortably with your\nStaying at home surrounded by family and friends resting comfortably with your illness under control and support for your family caregivers that's what most Americans want at life stand hospice can make it happen\nWith the help of hospice patients and families are like can focus on what's most important enjoying life together and living as fully as possible feel free to contact community in a hospice at five zero eight two two two zero one one aid\nYou can also visit community DNA dot com for more information\n[noise] [noise] [noise] [noise] [noise]\n\n\n\nMeeting [noise] waiting [noise] meet you [noise]\n[noise]\n[noise]\nOh no me\n[laughter] the you adjust to sign\n[noise]\n\nMeeting waiting\nFor you to adjust to sign a Mad Men in danger\n[laughter] what do you want to just\nWhat are you\nGoing to talk to me down the drain\nTell me again Elaine tell me is like yeah nice [noise]\n\n[laughter] [noise]\nI'm not [laughter] left wing [laughter]\n[laughter]\n[noise]\nOn\nThe needy waving wheat you adjust decided\n[laughter] yeah yeah\nUm I generally live\n[noise] [laughter]\nYeah with a\n[noise] [laughter]\nBut just\n\n\n\nWanted to figure out\nI'm getting the\nBe less\n[noise]\nYou're listening W. A. R. S. Thirteen twenty am\nArab world Dr Gary highland or will return to Richard's memorial library for a series of lectures titled papers\nThe series starts with the federalist papers on Thursday October forth it will be followed by the pumpkin papers on Thursday October Eighteenth\nAnd the Pentagon papers on November first all lectures will take place it's seven PM registration is required to attend these lectures if you'd like to register you can email librarian Maggie homes at in homes at sales in\nOrg bloody nose auto repair located at three ten unsolved main street in Edinburgh is celebrating twenty five years in the auto when truck repair business\nOver the years ... and his team up mechanics at work to build a long lasting report with their customers from oil changes to diagnostics transmissions and routine maintenance on foreign and domestic cars and trucks bloody nose will keep your vehicle running\nBloody nose auto repair five zero eight two to six eighty five forty five or\nOh the nose auto repair vibe zero eight two to six eighty by forty five or at bloody nose auto repair dot com\nRich is just too lazy to\nReally really good guy the term good egg isn't enough to describe but he's also certified organic and free range rich which the cap bad gun every day the toothpaste the olive oil the shin\nTwo and three day he led to ten year old nephew beat him in virtual tennis even do he can straight up just lay his ten year old nephew enjoy tennis and\nWhen the toilet paper is running low rich replaces the role on the actual older not just on the back of the toilet and\nRidges and texting and driving ridge no what do you do in ...\nI was just telling everyone how great you are texting and driving\nMakes good people look\nVisit to stop ... stop ... dot org a public\nService announcement brought you by the national Highway Traffic Safety Administration in the ad council [noise]\n\n\n\nThree a\nThe\n\n\n[noise]\n\nNo no no\nNo no no\nAnd in that region and\nKnow\nAnd allow them\n\nGo\n\n[noise]\n[noise]\n\n\n\nJune don't matter\n... what were your own\n\n\nDown\n\n\nThe\nLet them know that must be to\nThe fact that a law that goes by topic\nIt was a fun topic\nDa da da da da\nDa da\n\nDa da da\n\nDa\nDa da\n\nDa da da di di di di\nDi di di di di\nDi da da da da da da\nDa da da\nDa\nDa da da da\nDa da da da da\n\nAre and [noise] [noise]\n[noise]\n[noise]\n[noise] but\nThe time to time to say to\n\nA lot of\nPeople\nThe people\n\nIn\nAnd out of la di da da da da da da da da da da da da da da da\nDa da da da da da da\nDa da da da\n\n\n\nDa\n\n[noise]\n\n\n\n\n\nIn order to accommodate working parents in school times and unlikely story in plain bill hostess Sunday story time on the first Sunday of every month story time consists of a half hour of stories songs and a simple craft and is recommended for ages two to six\nBut all story lovers are welcome registration will open one week before only children need to register the next story time will take place on Sunday October seventh and eleven AM and run an Jill eleven thirty to register for the event you can visit their website and unlikely story dot\nCom you can I I was work well it was worth periods civic\n[noise] against for giving me it was a UFO seen how bring up a Washington DC was a fisherman attacked by a three hundred and twenty pounds for a lot of fake news boggle right and it was holding on like a driver's ed student doing stealing\nOur guide and I got a bunch of wide eyed kids to wise up about what they see on the Internet\nThen it hit me like I dodged ball field day the name of the game was ... age students got an article and two minutes to the side and it was credible all around the same time they were able to use ... decide to get cold\nNow the little hobby shops or even teaching that gullible brownies or thing or two about only knew\nWas your day pretty good I got a new title today office birthday party planner oh fun\nToday office party planner oh fun he doesn't have a better word story and you want to create jobs were talking about how to teach DFW rotten council\nThe benevolence in protective order of ... has been part of the Arab rural area since Nineteen oh six they have always been involved in community service in charitable fundraising giving back to our veterans supporting our seniors and providing youth enrichment opportunities such as soccer and who shoots\nFishing derby and dictionary projects well also providing academic scholarships the folks are over eight hundred strong locally and their members or their greatest asset to learn more you can go to Adam ... dot org remember oaks care oaks share\n\nThere\nFirst\n\n\nNa\nNa [noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\nWhen you when you been in your book and the and demanding\nAnd any different than in than simply because I'm a single mom\nAnd she said she and\nShe says she hits than it's been when\nThey think they will be with us when it's going to get to the window\nAnd you can go now to this\nPoint for them because they don't want them to do\nSomething like that when she\nWhen she was saying I Need\nNew\nIn and\n[noise]\n\n\n\nBusiness\n\n\n\nWalk\n\n\n\n\n\nOn October thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl ... the role of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guest will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at three Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy [noise]\nReal challenge your authority\nWill try to break your will\nTo the edge of your sanity [noise] because that's what kids do this car is your territory out there defending\nWho makes the payment Clinton who drives you do that too and in here your word is so when you say you won't move into everyone's buckled up you won't budge in it [noise]\nTo hear that\nYou won't budge in it [noise] to hear that [noise]\nNever give up until they bought the message from the national Highway Traffic Safety Administration and the outcome for more information because it's safer car dot Gov slash kids buckle up\nAmigo is currently looking for qualified individuals to help fill various positions within the company located at thirty three Perry avenue Amigo was offering fooling part time positions in addition to hurt him opportunities Amigo offers first second and third shift availability to help fit your needs in there\nWhen you joined me go you will help to create a positive light and experience for all the individuals that we have the privilege of serving on a daily basis for more information on all positions available\nPlease call five zero eight four or five five\nSix two zero zero or visit our website ... Inc dot org [noise]\n\nHang in\nWe keep\nSaying\nAnd [noise]\n... or\nMaybe the gray\nAnd\nVery and I\nTeen arena yo da\nDa da da\n... bang\nFor\nCall a\n\n[noise]\nYou do when you started Thirteen twenty am Arab world\nHi my name is Chris Wyoming and I'm the manager of the elder dental program we're inviting any seniors residing in Massachusetts who are sixteen older\nTo attend our free dental screening clinic in taunton on Saturday October twentieth from a forty five AM to one PM participants will receive a free dental screening and have\nAn opportunity to speak with a dentist and the clinics relaxed and friendly setting participants will be screened for oral cancer and have a chance to receive free that you're cleaning\nFor more information costs seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program a project of the community being a\nStay at home surrounded by family and friends resting comfortably with your illness under control and support for your family caregivers that's what most Americans want at life stoned hospice\nCan make it happen with the help of hospice patients and families are like can focus on what's most important enjoying life together and living as fully as possible feel free to contact community in a hospice at five zero eight two two two zero one one eight\nYou can also visit community DNA dot com for more information\n[noise] ... with cold and the public period I Am ... W. A. R. A.\nMm Mm Mm\n[noise]\n\nFolks good morning good morning good morning ooh it's loud happy indigenous people's day today folks yes [noise] yes indigenous people's day thing of beauty\nYes we're here we're here alive today this is pontificate ing with Paul and the ... the day off I Can't afford to I Need every cent I can get a so I Am here with you we're altogether hip hip hooray you ate boy oh boy all boys is my way loud there we go and that little bit better okay [noise]\nUm [noise]\nBut we are here today\nAre celebrating indigenous people's day the uh well the short term Republican victory oh we'll ... we'll wait till later in the week to discuss that today's a holiday today's a holiday let's keep it a upbeat and wonderful yes this is October eighth it's indigenous peoples slash Native American day\nAlso called indigenous people's day in California and completely separate from Native American heritage day that's November or this holiday celebrates the indigenous peoples\nOf North America\nAnd is celebrated in various localities in the United states beginning as a counter celebration to Columbus Day considering his brutal treatment of Native Americans [noise]\nUm [noise] and it looks to promote Native American culture well commemorating the history of Native American peoples oh come on\nStory of Native American peoples oh come on here's my mouse there's the mouse that is the most that's it little mousy mostly there we go\nSo that's what we'll be doing a a a lot of today are the celebration as a protest against\nColumbus Day\n[noise]\nFirst in Berkeley, California through the international Indian ... then in Denver, Colorado and now we're Vermont the letter is\nObserved as a federal holiday in the United states but it's not observed as a state holiday in every state most retail stores are open [noise]\nWhich you can I Do [noise]\nThe man and\nYes we'll be using mostly Native American music today or songs by Native American bans are songs about Native American subjects [noise]\nJust to give you a little um a preview of what's coming up a Todd Snyder this land is your land it's reworking of the great Woody Guthrie song this land is your land this land is Milan Dennis God tells us unless you're a Native American you're lying\nOr come and get your love by Red Bull and will play that Cherokee Nation by Paul Revere when the raiders I Know I Know some of our Italian brothers and sisters might get a little upset [noise]\nHow can you not honor the Italians on this great Columbus Day because he started the greatest genocide in the history of planet earth that's why I bought bought bought we will throw around tallying brothers and sisters of bone\nSome Vic Damone maybe maybe Frank Sinatra singing [noise]\nPale moon an Indian love song [noise]\nRoy ... Indian wedding Oh yes and then a special song for you brought to you by the Republican Party [noise]\nAmerican Woman get away from me a\nA running bear loves little white Doug Carol suggested that one from Rhode Island fans Nelson Eddie Indian love call [noise]\nMaybe please Mr Koester [noise]\nMaybe some slim Whitman Whitman\nWhen I'm calling you [noise] you know the version for Mars Attacks off [noise]\n\n\n\nNumbers you can call the show boy oh boy oh boy the Mike levels are all kinds of screwed up here\nNumbers you can call the show boy oh boy oh boy the Mike levels are all kinds of screwed up here summer turned up way high summer way low [noise]\nWhich I recognize that before I got in here [noise]\nOh well um [noise] you can call the show at five oh wait two to one three to zero five oh wait two to two Thirteen twenty you can become a remote correspondent by texting the show at seven seven four to eight seven six one nine for that seven seven four to eight seven six\nOne nine four but there is something else to celebrate today above and beyond indigenous people's day uh today is another [noise]\nAnother glorious glorious special event or with a local tie yes not only is this the beautiful wonderful celebration of indigenous people October eighth is also\nFluff or not her day yes Fla for another day\nToday is national Fla for another day all over the country\nOf fluff another is yummy sandwich made with bread peanut butter and marshmallow fluff it's now a classic American treat enjoyed in school cafeterias college dorms and local diners nationwide yes\nIf a peanut butter and jelly sandwich God's food isn't available to you second best the philosopher Notre\nEnough sugar and that puts you into a diabetic coma marshmallow candy can be traced back to ancient Egypt when people first began to harvest the marsh mellow plant\nRaise your hand if like me you're just learning that there's a marsh mellow\nPlant althea ...\nI I don't need a plant that makes marshmallows I mean there's really a plant that grows out of the ground a marshmallow plant I never knew that wow they say it's important to\nThat goes out of the ground a marshmallow plant I never knew that wow they say it's important to learn at least one new thing every day which is why you should watch Fox News yes it's important to learn one new thing every day what covered recovered\nBack to pontificate in the fall and the pro terrier here at Thirteen twenty W. A. R. A. and all over the world that there'll be way are re radio\nDot com excuse me at the levels are a little off today against some of the things that turn way up high and others are\nA UPS is working yes the UPS delivery\nMan just dropped off a package here at forty two unions street not a world where we are broadcasting\nFrom um [noise] there's a listing in your local papers what is and what is an open today for crying out loud but anyway um [noise]\nYour life do you have any of 'em the ... people or ... people you know those people in your life network market\nPeople you know those people in your life network marketers you know why am ways one of the most famous ones where you don't have friends you have associates there's\nA letter about that in today's Ask Amy column and we haven't even gotten to the dear Abby stuff yet in the ask Amy column in today's daily prompted the Boston Globe oh God\nI think you'll be able to relate to this my husband and I have been friends with a fund couple for many years unfortunately\nThey have just joined a multi level marketing scheme predicated on targeting friends and family for sales\n... Amway Tupperware is a big one selling I way back in the day we fell for the new skin one yep we got involved in the new skin network a marketing or multi level marketing scheme we only last about old\nWhat did we lose\nAbout twelve hundred bucks eleven hundred bucks and that deal wow where we idiots\nAnyway I'm well while we are happy\nWhoops excuse me [noise] take two [noise]\nWe are happy they have something to be passionate about they are no longer a fun couple to be around now when we have them over for dinner their product is all they want to talk about\nEvery conversation that we managed to steer away from this eventually returns to it even though we have told them again and again we're not interested\nI Can't imagine inviting them to dinner [noise] excuse me I Can't imagine inviting them to dinner parties with our other friends as we used to knowing that they will be aggressively working the room for sales should we confront them\nThe aggressively working the room for sales\nShould we confront them and explain things or just stop inviting them wow multi level marketing and my apologies to wonder if you were involved in Amway enter slightly offended by this but tough I'm the kind of person would rather have you know friends\nThan associates a and I will say this offer Amway\nI don't know what the heck they put in there what is it called S. H. one he ate\nTheir laundry detergent powder\nThat stuff is fantastic I'll criticize them way up and down all day long for for their techniques um [noise] but boy oh boy oh boy does that s a eight or essay twenty eight whatever the heck they call their laundry detergent while that stuff is great my mum I'm\nA million years ago my brother Mike they got involved in the Amway thing or they bailed pretty quickly because bay Mike Mike decided he'd\nRather have friends than associates and he'd rather not drive all his friends away I mean it's tough enough mice a life insurance salesman at a financial planner\nSo we had enough friends already turning in running the other way whenever he walked into a room the last thing you needed was to try to push him way on them but my mom you know tried to help out her loving son and she bought all kinds of Amway\nProducts um at the beginning and a continued with that as a eight what's the name of that laundry detergent continued with the laundry detergent 'cause it was fantastic stuff um since my mom passed away and since I went to Quincy um\nI think what do we use what do we use at home Carol I think we use the arm and hammer stuff [noise] uh yeah we use the\nArm and hammer stuff but boy I missed the NY stuff will get to um Ask Amy's answer about what to do what to do\nThey miss the M waist up we'll get to um Ask Amy's answer about what to do what to do about their friends who have joined a multi level marketing plan but first let's go to the phone lines at viable way to do to one three to zero good morning\nHello oh there we go hello\nHi I have a question about ... and I'm driving home I'm thinking what country was telling me think about it I'm thinking about you know I was five and ...\n... yeah I've got to take over so we can\nAnd between what happened with the ... and what happened at our country\nWe have all that that's what human beings do don't we I mean we're animal\nI understand that a lot of the focus is on me and um they came from somewhere or ... or\nUm well one we'll never know the Koch network at one point were connected but I guess I've often wondered so every ... feet for casting for our complain that was my only point I'm driving oh\nYes I I go okay what's the big issue here [laughter] [noise]\nYeah that's um we are just animals and do we we do try to take take take\nAnd I guess in some ways by celebrating celebrating indigenous people's day where we are just are protesting the white western Europeans for being the best at it in the history of mankind nobody has been able to match a white western Europeans when it comes to colonizing planet earth we\nI understand that so I I Can't so my point is it maybe every country but then again when when the country\nThat tree again when we see every country they think about it if it weren't colonized by white or well a lot of black people of right here yeah we were wondering [laughter]\nI think we'd be chanting together we beat dancing in circles [laughter] we'd be celebrating by soon [laughter] that's my point is [laughter] we'd have totem poles instead of statues we'd be smoking pay OD instead of marijuana so many things would be different\n[laughter] certainly would not advanced civilization either [laughter]\nOh I think someone someone would have come up with that but yeah my brother in law are always makes that joke about the Native Americans what do you mean there are nomadic people who never invented the wheel what's the deal with that but yeah\nI Know I I I Do I understand to a certain extent what happened but it's no different from any other country that was mostly a ...\nYeah I I I guess the only difference is are we made much better use of germs remain much much better use of germs to wipe out the native population\nWe did not know that smallpox the death on blankets and I think it's viral and I don't know what the life expectancy is up to five or so that's another area too with a blanket working every day I I certainly hope that one never knew\nThat virus was in a blanket or\nAre they they knew darn well during king Philips war and you could say that the blankets infected with smallpox might have been one of the first forms of chemical weapons or ever you\nKnow it could have been say an awful thought Paul yeah yeah I agree and I want to\nBut ah yeah\nI Can't I Can't you and I want I Want to throw it out too and\nUm my grandmother came from Italy and\nThere are a lot of people who are really was a theory that a lot of it was a motherly okay\nAs scary oh I Know\nMichael Angelo it hasn't won their mother with all of you know I'd like to throw that out of that one to get that look\n[laughter] hey thank you so much for calling out take care of\nTheir ego five oh wait two to one three to zero five oh wait two to two Thirteen twenty aged three sixty nine is also checking in on that I mean come on we're human beings we're always trying to cocker each other so nobody's gonna when somebody's got to lose which side you want to be on\nMan who cares about morality and right and wrong and whose land it wasn't the first place it's about winning and losing your celebrating the losers Healy\nAged three sixty nine road Columbus found\nNative people intelligent and his relations with them were benign ha ha ha [noise]\nHe gave strict instructions to settlers to treat native people with respect when he was absent some men disobeyed his orders wow wow\nA pretty sanitized where to look at it as your three sixty died [noise]\nAnd again they came here they came here uh the whole point of coming here was to pillage a well first of all the whole point wasn't to come here at all they were trying to find India by failing to the west so that he gets spices and stuff and then sell those in Europe and make lots and lots of ...\nSo they could get spices and stuff and then sell those in Europe and make lots and lots of money the whole point once they stumbled across this place was what's the what's the pillaging gosh darn it an agent three sixty nine writes sixty two percent of Americans have a favorable opinion of Columbus the rest\nLet's see Sally dream passed away in February two thousand four I think it was\nThe summer of two thousand five we had kind of a reunion\nOr one of our a former co workers at a company called our T W where we met a had a cook out like in July or August or something and um that's where ... and I kinda reconnected as a cook out and now that I think of it that cookout that cookout or was\nNot really a a reunion of our T W employees that cookout was elicit cover as the host tried to sell Tupperware products to everyone I mean we felt guilty\nAnd they\nThink I bought something like cutting board or something but anyway um\n\nCutting board or something but anyway um\nWow\nReally a remote correspondent writes in my girlfriend cells um adult products at parties ... people are sometimes embarrassed to purchase these at adult stores interesting I've never been a products guy\nI've never understood the um\nUh accessories as it were I think human touch is kind of a pretty neat thing I really kind of a not a prude\nBut when it comes to um sex sex boy am I a square boy am I a square you see and hear about all these different um fetish is and stuff for or appliances that this remote correspondence a girlfriend cells I or\nIs it just me 'cause I'm starting to think it's just me I'm starting to think on the last man in America\nTo me I'm ...\nGood old fashioned regular canoe you'll relations with someone you're desperately in love with which is my case\nI think it's pretty darn tremendous I mean I don't want to go into um our personal life a gentleman doesn't disgust such things but all these fetish is you see him as see or read about or hear about all these um appliances for lack of a better word I Swear to God I just don't get it I just don't get it\nI I again I\nGood old fashioned regular could noble relations\nAre fabulous enough for me oh well five oh wait two to one three two zeroes the number five oh wait two to two\nThirteen twenty is lurk\nBear oh a ... has anyone ever heard of new skin\n... no there are ... has anyone ever heard of new skin products 'cause I'm trying to think when this was this had to be\nEarly nineties early nineties when uh my brother John's\nUm his best friend from college also a football player also a ah like my brother Mike financial planner or he got into this new skin stuff and it was supposed to be you know skin products that were good for you good for the environment I remember the shampoo and the soaps didn't even have\nMuch sides 'cause 'cause we'll ... necessary or\nMakers of this kind of stuff used excessive sides to make you think your cleaner when it's not the ... that are really cleaning you but anyway um my brother John bought and my brother my body and Sally and I bought in law Laurie in industries I think last Laurie in industries wasn't that a village that the elves lived in\nIn uh the lord of the rings trilogy I think that was the name of our company that lost eleven or twelve hundred bucks\nI'm In fact in fact if you um I still still to this day down seller a in a little box\nI still have um a couple of ah bars of new skin so\nA couple of tubes of new skin something or other but anyway I I kinda thought again I don't know who's listening today and who's not because this is a glorious glorious holiday of indigenous people's day but I kinda thought this would get a little bit more um\n[noise] oh I see I see the remote corresponded writes ah 'cause I was saying to me it normal good old fashioned regular normal can be a relations are wonderful wonderful I wouldn't even consider one of the fetish is or one of the appliances as it were I mean it doesn't just not my world view\nSo one of the appliances as it were I mean it doesn't just not my world view the texture writes back or if the woman is alone it helps sometimes you idiot\nI don't think I'm idiot for that reason texture there's a lot of other reasons obscenity yet but\nI don't think I'm an idiot for that one oh well five away to two to one three two zeroes number five a way to to to Thirteen sweat you will take a break can be back on the other side after this one Thirteen twenty W. A. outright were playing a Native American music or music about Native Americans to celebrate this wonderful wonderful glorious\nHoliday indigenous people's day you know\n\nAbout now\nYou are listening to pontificate ing with Paul and the public area I Am Thirteen twenty W. A. R. A.\nIn order to accommodate working parents school times and unlikely story in plain ... hostess Sunday story time on the first Sunday of every month story time consists of a half hour of stories songs and a simple craft and his recommended for ages two to six but all storyline\nAnd a simple craft and is recommended for ages two to six but all story lovers are welcome\nRegistration will open one week before only children need to register the next story time will take place on Sunday October seventh and eleven AM and run until eleven thirty to register for the event you can visit their website and unlikely story dot com\nAre you looking for more opportunity the literacy center is here to help we have free year round classes in English computer literacy and high school equivalency with the help of teachers and tutors you can prepare for your citizenship test\nMake a resume get ready for college or learn how to speak better English classes held during the day evening or on Saturdays viewer website the literacy centered dot com or call five oh wait\nTwo to six three six oh three the literacy center building a better community called [noise]\nFive a week two two two Thirteen twenty so free from anywhere just use a friend's phone [noise]\n\n\nWay way of life [noise]\nUm [noise]\nYou're on your own\nYou argue I don't\nKnow ...\nOn our ... made\nCherokee pretty\nCherokee\nSub\nIndeed and they show\nCherokee breed\nCherokee\nWould you\nWelcome back to politics vacating with Paul and the pro terrier here at Thirteen twenty W. A. outright end all over the world that W where they are a radio dot\nCom let's go to the phone lines at five oh wait two to one three to zero good morning hello how are you\nYeah I'm In the midst of all everything is going on now I Would not recommend playing tag in the workplace I don't think that's going to work out well for anyone [noise]\nYes yes that's for you tag your boss at work if you're brave and see how they react [noise] had get your resume ready\nMaybe they will make the whole office play spider tag\nOr maybe they'll to argue with mountains of paperwork or maybe they'll send you to human resources and you'll start looking for another job of course it might be a better idea to suggest it with your co workers at lunch or even better with your kids when you get home it is tax day ladies and gentlemen bursting into the studio completely uninvited\n[laughter] the amazing Jim carbon actually that's not true we texted last night I knew he was coming in he will give us a\n\nWill give us a a meteorological update or Mr blue pride mark off on pain rights and it is my fault for the technical difficulties on AM radio Thirteen twenty there'll be a way out right that's what I get for changing my phone for charging my phone in your studio a couple of weeks ago laugh out loud your friend mark it's your fault mark\nUrging my phone in your studio a couple of weeks ago lap outlawed your friend mark it's your fault mark\nIndigenous people's day started in Berkeley, California writes agent three sixty nine tonight in Nineteen Ninety four figures\nSix million Jews as the greatest genocide fool no no that's not the greatest genocide ... three six and that was a terrible terrible horrible genocide what happened to the Jews horrible genocide what happened to the Armenians\nUm the clump the arrival of Columbus a lead to the\nDeath of Ninety percent Ninety percent\nOf the indigenous peoples nine out of ten gone so that that ... is the greatest greatest genocide\n[noise] in uh in human history Ninety percent of a population wiped out with Guns Germs and steel stunning we'll be right back after this and Thirteen twenty W. A. R. [noise]\nHey [noise] and then one day they had to lay off the topic\nGoing\nOn I think I\nTo find a way\nBy Don I Know\n\nYou're listening to W. A. R. A. Thirteen twenty am Arab world\nOctober thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Karl ...\nWill host the hidden history of the second amendment a presentation by Carl T bogus a cathedral of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery and the United states guests will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at their Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy\nArgue one of the thirty million Americans who skip breakfast every day we don't need to remind you that skipping breakfast can have a detrimental effect on your health the breakfast place located at one eighty seven pleasant street across from the show gas station has been serving their customers meals made to order for over thirty is\nUsing vegetables from local farms in cage free eggs owner Casey dark ... opens the breakfast place every day from seven AM to one PM for breakfast and lunch\nAnd put those on the go all meals are available for takeout\nYou're listening to pontificate ing with Paul and the military at ... am Thirteen twenty W. A. R. A. if you'd like to be a guest on the show and tell us your position if you still think it's a good idea send an email to Paul at W. A. R. A. radio dot com\nThat hall with a P.\nS. W. A. R. A. radio dot com [noise] pontificate and with Paul and the ... more like recess than school on AM Thirteen twenty W. A. R. A.\n\nWhoops sorry [noise] in a more sensitive sensitive honoring of indigenous people's day um we have this submission from Johnny Preston\nYou're from Johnny Preston [noise]\nHall of fame on ... ... from the Enron and\nManning young Indians preying on the\nOther [noise] bad other real [noise] lovely\n[noise] in in may the\nWind was the name that just lovely scientifically [noise] but they're trying with each other even though there is a good now it'd be\nA man\n\nMan you know\nGood swimmer welcome back to pontificate him with a ball and the ... right here on thirteenth watch WMA outright and all over the world at W. A. R. A. radio\nDot com wow wow aged three sixty nine fighting back when I started that\nColumbus began the genocide of Ninety percent of the native population of this ... Ninety percent he writes and five thousand dead maybe fake news wow wow well you know I guess you have to believe stupid things to be a member of coal forty five that's the way it works good morning Jim\nGood morning Paul how are you very well thank you\nBy the way I had the holiday oh yeah that'd be the ... by the way it's just such thing as one Columbus Day some ... this is possible I Know I don't think we already late one ... literally about Columbus like\nColumbus was fourteen Ninety two we have the little mutt and I don't hear it I think I heard your will sitting right there are like oh I [laughter] I was you know the the\nAnd I got her sitting right there are like oh I [laughter] I was very no the the ... and the fighting that was going on in the air in the last Fifteen minutes\nWho can you say for a was started exactly a quarter of ten so it's only been going twenty minutes I heard it as I was on Richardson avenue in in the northern Fifteen minutes ago but no seriously it sounds like it's a transmitter issue I've heard that before so\nAh but the caller i._d. Sandy called in if you have to\nGo and she indicated it was going on longer than that I\nOnly heard it in Mansfield at quarter ten is when it started but maybe it was before but it's a ... it sounds to me like it's a transmitter issue and hopefully it is not doing that right now but\nYeah um are we still getting a elites blurbs Homs and as Jim called them audio fired hawks and then fired in\nHong Kong and fight no I didn't add to that word LDL is that a technical term in electronic broadcasting hogs and ... I I I don't know how you doing\nVery well very well um this is a a a date similar to what we've had recently Paul a lot of clouds but what you see is what you get\nIn at least to get right to the weather on on this\nUh [noise] we do have a new hurricane which I'll talk about just a minute or so but ah pretty much another day we're very little change in temperature as we head out uh on this a first or second Monday of the month of October which of course ah in recent years has suddenly become\nA holiday but at any rate what a rip off to all these holidays Paul mentioned this yeah for where the holiday is not on the date it happened\nWhenever you think of you know the wealth of October I mean the same thing with people's birthdays now when we make them all these Monday holidays lie with bands all I Know you know the reason why but I'd be a little you know even Martin Luther king which we say is the complete opposite of today's holiday I think well how much better way but you\nGuy is going to be upset is Washington and well first of all is Washington's Birthday and they made him share it with Lincoln and get it now\nAnd Washington and well first of Washington's Birthday and they made him share it with Lincoln and get a now now they've got to share it\nWith all of that all of the forty three other presidents\nHow can you imagine if they made the fourth of July a Monday holiday you know they'll do it that's probably coming you know I mean because the all the issue the fourth this year is on a Wednesday so I'm not sure if I could take the first half of the week off of that but that's why we're really going downhill when the fourth of July becomes a Monday holiday [noise]\nAnyway uh back to whether\nOr when the Senate violates the constitution repeatedly but that's a different\nFor tomorrow and beyond [laughter] uh six sixty for a high today not much change right now I think the thermometer by the window which is the temperature at the mailbox\nHere at union street is fifty seven degrees so we're going to be very much not much of a change at all today that might be a touch of missed but as I joked about recently sometimes sunshine is overrated\nAnd this is another one of those days Paul where if you had a jog or you rent a marathon them to be a great day not much when a light wins out of the northeast tonight falling back to the upper fifties low Mitt that he's not much change here's the story for tomorrow and Wednesday mid seventies\nTomorrow ... increasing son oh eighty okay on Wednesday [noise]\nYou know what I did on Saturday don't you\nYou got rid of the air conditioning took all three air conditioners out didn't drop a single one on the driveway on one side of the house or on my neighbors car and the other side you have now I thought you only three oh two downstairs one upstairs you know in ... office by their all in the window ones though\nBy the way to to to Thirteen twenty so free from anywhere just use a friend's phone [noise]\nRandy Newman a wedding in Cherokee country\n[noise] [noise]\n[noise] you know what I'm saying\nYou know no no [noise]\nNo no no\nKnow I don't\nMean to them well\nMom one for a\nThat's inhumane papa was a little person and mumble was ...\nWow that's inhumane papa was a little person and momma was a working girl and it's a very insensitive Randy Newman song wow it had Cherokee in it that's why I went with it [noise] whoops hello Jim loophole\nThe amazing Jim Cornish live at in Studio where this couple of remote correspondence here it's seven seven four to eight seven\nSix one nine for that seven seven four seven seven okay seven seven four to eight seven six one nine for agent sixty one is displaced\nShow today you can tell us a holiday not the normal pace you know normally ... Dominic has the computers all nobody was in ... in the whole building when you came yeah exactly I I was all alone alone in here a little bit of scared too was dark but no normally dominant gets the computers all set up and ready for me to go because he understands them attack no more on\nI I had to do it myself this morning and I've never recover and unfortunately agents sixty one another displeased listener\nIf I was going to piss or if I was going to annoy this many people there would have stayed home for crying out loud but anyway he writes I've been listening to this drivel\nFor Seventeen minutes over the air there have been no pops bumps buses et cetera Seventeen minutes I Will never get back are you calling Sandy a liar Asian sixty one is that what you're doing\nIf he if he or she was on line it was not going was not happening if they were listening over the radio it likely was yeah and then agent three\nSixty nine says your probably one of those statue Rutgers try to erase history by destroying money by destroying monuments\nSo we can eliminate the past that you don't agree with you know the monuments in the south my problem with that is they weren't put up right after the civil war agent three six and I most of them were put up after the rise of the KKK\nWar agent three six and I most of them were put up after the rise of the KKK in the late Eighteen IDs and then again ah from Nineteen oh five to Nineteen twenty and if it's\nAll about heritage we love our heritage should see his teeth it's all about our heritage ... huge God Almighty\nCome there's not a single statute not one of Lieutenant General James long street\nOK rubber tea leaves second or third or ... or the south second or third grade is generally got leaf first Stonewall Jackson seconds after Stonewall Jackson died general launch street was leads right hand man how health if Robert Haley had listened to Lieutenant General log street at first\nThey would have redeployed south occupied high ground somewhere between there and Washington and won the civil war you would have won the war how come there's not a single statue not one not one to James laundry in the south ... what is James James lock street do after the war\nHe believed in black suffrage he believed that blacks if properly educated equals of whites\nHe worked a as basically the chief of police are down in New Orleans after the war and at the turn of the century there was a huge white supremacist mob that tried to take over the government in a New Orleans a who was the leader of the government forces and police forces\nOr that crush the rebellion by the white supremacist that would be general launched rate\nSo what do you find when you go down to New Orleans today\nYou find these huge ... monument\nTo the white supremacists who tried to take over the government down there what do they have up for general long street there\nThey take over the government down there what do they have up for general long street zip that nada nothing wow\nAnd why isn't he on it to this day what is the reason why that is said what is the reasoning\nBecause he believed blocks with equals of white you know I Know rush to white supremacist\n... is that amazing that to this day hundred ... more years later there hasn't been more of an uproar about getting a statue\nFor luxury yeah yeah heck I I'd have oh and by the way um I missed the point or aged forty asked how many people died as a result of Columbus um and I mentioned you know Jared Diamond sport Guns Germs and steel all that and then\nHow would you really know those days yeah ... years ago or ... who was there was no counting of anything nobody knew really there was no there was no Internet no but there was no I was ... years ago how do they okay there's one over there that died and then there's one on one another to another state or is\nGet stage and forty second question because I currently I missed the point again my question is how many people is Ninety percent Ninety percent of what which is what you're asking it could be two hundred people or it could be two million yeah I Would say closer to the two million a\nThat's a great one age in eighty two rights how about half breed by share and listen to this age and sixty one you doubt her you dissenter radio is cutting out again so something's going on ... back you heard it I heard it at that beginning a quarter attending Norton\nAnd then ... agent to twenty four writes\nWho's getting home I Love that he included the am at the end of whom it's not who was kidding who the proper way to say it is who's kidding whom excellent grill done agent to twenty four who's getting home everyone knows that Columbus Day commemorates the beginning of ...\nEveryone knows that Columbus Day commemorates the beginning of the slaughter\nOf Native Americans or Indians we should not celebrated but it is a day of mourning in history and I said Columbus Day and Indians to be politically incorrect on purpose [laughter] well done well done\nAnd it's San Salvador is the ... I suppose location that he\nWas like hold on hold on an aged three six not only liberal knowledge is accepted as fact on your show [noise] I mean there is are there isn't a statue of a gym to General James long street that's not liberal knowledge or or conservative knowledge it's just knowledge for crying out loud [noise]\nMy God Almighty if it doesn't support your thing it's fake news\nThere is a monument to the white supremacist who were crushed by general long street in New Orleans there is no monument to general on street there or anywhere else in the south\nBecause he believed imply suffrage those statues are about white supremacy you want to take them\nAll down I don't know I don't know about that there is no alleged well not a legend in the words there was no statute of laundry anywhere in the United states might be a picture of them on a wall right but there's no actual statue\nMaybe maybe maybe probably in the oh great religion on somewhere having a hard time believing you owe him a simple Google Search shows long streets statues everywhere\nNew Orleans where he worked after the war [laughter] okay I got to find where this one is\nWhat's the nearest one to Adel boroughs ... long street and let's go over there thank you aged forty and we'll look that up when I get home I'm having enough time with the computers as it is um my people would Dutch a five a way to to to one three two zeroes the number five a way to to to Thirteen twenty we still haven't gotten to your multi level marketing horror story\nA well no I just get into the mid nineties or are we both got into it when I was married\nWell no I just get into the mid nineties or are we both got into it when I was married and uh it it became a if like you say almost like cult forty five in terms of if you weren't in it and you you know you could lose friends on occasion and things like it just got luckily I got out of it and\nUh well ... what you got out of multi level marketing I got out of the marriage while that\nToo [laughter] that was not for another thing but no but it wasn't a pleasant you know you you were kind of reminded me a little almost like like Jim Jones you know Jim Jones the one down\nWith that color in South America whatever wherever it was what I ought to be on a a guy in a a another is if you weren't with them or you were a real you know what's the matter with you and it it it it you know it worked for some but\nUh luckily and again time share the same thing uh luckily we were able to get out of that\nUh but uh again that those were bigger in Twenty years ago when they are now and all you hear his ads nowadays Paul how to get out of the time she was like you know\nWho got you into the multi level marketing Europe is that your idea of the wife's\nWho was hers it was her like her a friend of hers got her and then because we were married it's almost like no one if you get it if you're married both of you have to be in it so I was like you know forced into it and so anyway I'm sure that listeners out there that you know that it wet well for some but ah like you say well why would not even brought up today\nUsually on phones right and therefore people at work I don't want to be seen using their phone while I can send emails on a computer right so it's more more easier way to do it if you're at work if you're doing it on a computer versus if you're on a cell phone work doing it right\nI ... well it is that will be my guess as to the situation no but I don't check they W. A. R. I. E. mail enough so what is the message for today pardon me you've got some today oh I've got I've got a dose of remote correspondent\nUm and it's also you know I Want to get remote correspondence cause more of the listeners is less of me which is it's a good thing for everyone concerned um\nI got to be careful here but too much of anything is a good thing you know someone sends me five ten Texas show that's great that's great we get up to you know\nTwenty five thirty thirty five Texas show it tends to overwhelm with overwhelming my phone and overalls my attention and it it's it's it's tough to keep up gosh darn it um is your phone slowing down\nThree Stooges whoops I'm an Indian Pierre tough frontier man takes a liking to Indian squad curly oh yeah the uh the to get married currently slips off wig and the boys run for the great Three Stooges this weekend the young I didn't get it three little beers was on that is where are they play golf\nAll they say it's like a hero yes this is like a kid's game they're all wearing shorts [laughter] what are you with Georgia washer cut down a tree I'm so some great Three Stooges\n[laughter] what are you with Georgia washer cut down a tree I'm so some great Three Stooges um this weekend's um\n[noise] I agree with that remote correspondence please check your email agents are three sixty nine should be very interested in it OK whatsoever he is looking at it right now folks he's looking right at these tracking\nA done that ah that that uh yet uh\nI have so many things open now it's taken awhile to load\nData that uh that that uh that uh yeah\nColumbus controversy what time is eleven forty one okay we can get to this I guess\nAll right okay now what is going on that uh that that got\nDone and should have stayed home today five away two two two and three to zero as the class room\nThis is from the History Channel Cindy my agent to twenty four as the classroom rhyme goes Christopher Columbus sale the ocean blue and fourteen Ninety two when discovered America but there's more to the story of the explorer we celebrate\nWith a federal holiday on the second Monday of every October has historians have continued to learn and write more about the real life of Christopher Columbus controversy has arisen over the validity of honoring you explore as a hero\nOkay All right I I\nI Want to read this but it goes on for about eighty seven pages I can\nUm hold on\nMany European explorers Columbus encountered indigenous peoples throughout his voyages you know lesser beings in their mind\nSingularly focused on his mission to find riches and conquer a new lands Columbus and his teams treated the indigenous groups they came across as obstacles to their great her mission there are three main sources\nThe goals to their great her mission there are three main sources of controversy involving Columbus his interactions with the indigenous people he labeled Indians\nBecause he was again he first thought he landed in India he was trying to find India by selling to the west um should have had a compass [noise]\nWould have been better up uh up up up up up up up up uh\nUh there are three main source of controversy the use of violence and slavery\nThe forced conversion of native peoples to Christianity and the introduction of a host of new diseases that would have dramatic long term effects on a native peoples in America historians have uncovered extensive evidence of the damage Rick Rick wrecked raped\nBy Columbus and his team's leading to an outcry over\nEmphasis placed upon studying and celebrating him in schools and public celebrations in an era in which the international slave trade was starting to grow\nColumbus in his men enslaved many native inhabitants of the west indies and subjected them to extreme violence and brutality on his famous first voyage fourteen Ninety to Columbus landed on an unknown Caribbean island\nAfter an arduous three month journey\nOn his first day in the new world first day he ordered six of the natives to be seized writing in his journal that he believed they would be good servants throughout his years in the new world Columbus\nAnd acted policies of forced labor in which natives were put to work for the sake of profits later Columbus and thousands of peaceful piano Indians from the island of Hispaniola to Spain to be sold many died in route and it goes on and on and on what's what's what's where's this one\nHold on that might have some actual numbers\nOkay last paragraph three short sentences those left behind\nOK last paragraph three short sentences\nThose left behind or first to search for gold mines in work on plantations within aged forty eight I Hope you're still with us if you couldn't take it and turned away I'd understand today God what a weird show anyway within sixty years after Columbus landed\nOnly a few hundred of what may have been as many as two hundred and fifty thousand piano people were left on their island so for two hundred and fifty thousand\nTo a couple of hundred [noise] [noise]\n[noise]\nYes sir what really should be celebrated if we had to do something in lieu of Columbus Day why not you don't have a day when the you know Jamestown, Virginia or the pilgrims and sixteen twenty ... a year or even St Augustine Florida wasn't that one of the ... like late Fifteen hundreds that was after Columbus died I think\nUh why don't why isn't there a day for when we really started to establish colonies in the United states why is there a day for that\nAt least they weren't killing all kinds of people they they I mean the the pilgrims were not saints but or at least they weren't as bad as Columbus right\nBut I but\nWhy don't we have a ... ... people we do have that Thanksgiving Day isn't it is it really I mean you know what about ... I think in king Phyllis war yeah they're every bit as vicious as Columbia they weren't but you know you know but anyway\nFive away to two to one three to zero five oh wait two to two Thirteen twenty is the number um gosh darn where every [noise]\nUm\nWe'll be right back after this and Thirteen twenty W. A. R. [noise]\nJim just asked off year what the heck is that that's a Jimmy pepper which is tied to\nFirst played for me and Nineteen [noise]\nSeventy eight I think [noise]\nIn bad McCutcheon Jerome at Bridgewater state college\nHome surrounded by family and friends resting comfortably with your illness under control and support for your family caregivers that's what most Americans want at life send hospice can make it happen\nWith the help of hospice patients and families are like can focus on what's most important enjoying life together and living as fully as possible feel free to contact community in a hospice at five zero eight two two two zero one one eight\nYou can also visit community DNA dot com for more information\nSorry it's time for a break on AM Thirteen twenty W. A. R. A. [noise] more of punch advocating with Paul and the ... next\nDr Gary highland or will return to Richard memorial library for a series of lectures titled papers the series starts with the federalist papers on Thursday October forth\nIt will be followed by the pumpkin papers on Thursday October Eighteenth and the Pentagon papers on November first all lectures will take place it's seven PM registration is required within these lectures if you'd like to register you can email librarian Maggie homes at ... homes at sales ink dot\nEmail librarian Maggie homes at ... homes at sales ink dot org\n... from now [noise] seven seven four to eight seven six one nine for me [noise] I don't expect the reply because he's old and has a flip phone am Thirteen twenty W. A. R. A.\nAlright alright alright\nFor our Italian brothers and sisters his are Frank Sinatra okay he's a proud Italian gentleman to celebrate in Columbus Day he's got that bottle yes here's Frank Sinatra song pale moon an Indian love song [noise]\nOr if they get more than one thing going at once [noise]\n... ah [noise]\n... [noise] uh [noise]\n\n...\n[noise] ... the the\nYou know the old jobs gas pikes things like that [laughter] we we try to avoid that I'm sure Sally was better at that than I was I was more relaxed parents she was more paranoid parents and then after the eleven o'clock break we'll get to this one [noise]\nWe try to make things easier for our kids are we try to accommodate our kids is is this going too far to accommodate a child airline passenger let's child use party\nIn the aisle of the plane wow first of all where they store in the potty does that go and carry on [laughter]\nI Hope you used about I can and a half a Lysol on that thing before you're sticking that in the overhead bin of the air foil if you bring\nUp pet on a plane right what do they do how do they take a you know what not in the middle of the aisle at least they are looking up in the baggage claim that let me in the overhead bins\nWhat does that smell oh that's the collie up the high all doing its thing and I don't know yeah\nAgent to twenty four ah says\nI actually did call in sick today I have the blue flu yeah it was blue all day Saturday and Sunday for reasons we'll talk about tomorrow\nUm oh it's cloudy out right now no I'm ... I'm Serious I was supposed to work to no that's not why I was blue because it was no I Know why\nAre they cheated and won again that's why a I'm Serious I'm Serious I was supposed to work today I just wanted to stay home and celebrate the Native Americans I Would send you a smile um oh gee but you wouldn't be able to see it on your flip phone that's a good point um\nHowever if they emailed you on that W A L re account they could you could see in a ...\n... apparently according to ...\nOh really a company could you could see the ... who apparently according to age I'm forty eight um yeah it's just like check my email Jim Rome or hindered after you should check it more\n[noise] [noise]\n[noise]\n[noise]\nThe civil liberties other shoe to record it we we just grew older people or the district of Columbia or the other way or the Florida Georgia or the beauty of the Kentucky\nOr the best interest of the barrel or the meaning of the Michigan or the north Carolina for the New Hampshire for the New Jersey or New York or the or the Pennsylvania Rhode Island so Carolina\nVirginia or the group at all it was Virginia beginning to live in the woods in them and they get to where we would\nMiss the jeep was open to be is the consideration to St\n\n\nPeter Blue Shield Elba gal turns out his microphone just is yes you do\nA cattle noticed as well every time a woman was mentioned because that's how Republicans look at women there were only ... because his personnel you describe over a really nice guy always great yeah that kind of a surprise but it's a terrible thing to say but what would you go again kind of surprise is coming from him do you ever see no it's not he's a Republican you ever see other attractive women on Fox News\nAnytime I mean every woman she's for most usually\nAbout ... when he would say it would you question him about it like when you bring the site called them on it\nAfter you question him about it like ... and they asked I called them on a Wednesday night they come back I have a red blooded American male I'm a red blooded American male\n[noise] it's okay to objectify women as long as you know call me on it while I'm the two huge what's a you\n[laughter] a debt debt debt that uh\nOh okay and I mentioned um don't teach your kid how to use again how old I Am the ATM machine what a dope Asian eighty two correctly points out kids nowadays just go on Amazon with their parents password and order what they want no limit I had a story over here that I\nSaid months ago but never got to and it was a bunch of great examples of kids subverting their parents you know parents put up those blockers or or password protections nope doesn't stop the kids at all it's like the great Groucho Marx light so easy a five year old can do it well somebody go out and find me a five year old ...\nAgent under a much more literate with technology than older people are now obviously\nOh yeah yeah age in Eighteen writing um he's in favor of the parents later the kid use the party and the island which of the plane what's the alternative just let the kid pie in the floor\nAs we talked about pulling the past they should have an ... a small room for all children on planes let them play in there you know maybe in the back of the plane had to have about three or four rows open space with just all kids\nYou don't have to listen to them cry and oh I mean one and a lot and everything else again with authority started was with a with the White House has centered on oil which you could do is just the data all of them will be back after this time for one more quick weather up there and I'll get out of here eleven AM break an eleven all five you're listening to\nW. A. R. A. Thirteen twenty am Arab world\nOctober thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second\nHe is at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl T bogus a cathedral of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guests will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at their Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy [noise]\nAtlanta I didn't talk for a long time\nThings\nLike that something you can [noise]\nAmigo is currently looking for qualified individuals to help fill various positions within the company located at thirty three Perry avenue Amigo was offering full\nAnd part time positions in addition to hurting him opportunities Amigo offers first second and third shift availability to help fit your needs and there's when you joined me go you will help to create a positive client experience for all the individuals that we have the privilege of serving on a daily basis\nFor more information on all positions available\nPlease call five zero eight four or five five\nSix two zero zero or visit our website ... Inc dot or to\nJoin the conversation because by the way to to to Thirteen twenty five a way to to to Thirteen twenty or become a remote correspondence by texting seven seven four to eight seven six one nine for scientific getting with Paul\nAnd the ... on AM Thirteen twenty W. A. R. A. [noise]\n\n[noise]\nMe and\nNot not the same\nOne long\nOne man always wrong me\n\nThree by share\nHello Jim low\nWho's that remind you of thinking that\nYou know not a well known them all\nActually Jim the Elizabeth Warren version of the song is in half breed no it's called it's called one eight breed I\nWon a breed that doesn't flow off the tongue as well but the\nWay to to to what three to zero five a way to to to Thirteen twenty before we have another quick a meter logical update but the amazing Jim Korb an agent five Ninety five rights and ... as well\nOr listening on line and alert tight message came through which I didn't hear mentioning several states but don't know why\nDid pose is the president of United States pressed the wrong button\nNo why did pose is the president of United States pressed the wrong button and send out an alert which reminds me of last week age I'm forty eight had one of the best satirical text of all time regarding those alerts and I completely misinterpreted it started yelling at him\nWithin an hour you against for example like when they send the Amber Alert subtle phones\nLike am I guess why would I be against selling them why why why so many people against what happened last week with that alert test I mean if there is a bad situation and emergency wouldn't you want to know oh no no I'm not I think I think the technology improves just the fact that it was from him technology improves um I I think they should use that that was way more than ...\nIf that was like Hillary Clinton sending and I would you\nWant people probably would have liked right well no half the country would hate her because you know I Know ... who should be locked up I'm just saying I don't see anything wrong the only thing I said the last I think it was frightening when when you get a message on your phone and it's turned off you still\nHelp someone learn to read study for the citizenship test learn English and even help them with their high school equivalency for more information on how to volunteer or joined the next to their training you can view our website at the literacy centered dot com or call by the wait two to six three six zero three illiteracy center building a better community\nArrows big read is in full swing with many events designed to explore the elements of this year's book five guys joined up ... this week as we showcase Mesa tables constructed with five skies overhead show hosted by the ... arts museum\nThe exhibit included a visual interpretation of the table aspect of the story along with performances from the carpenters poets eastern Massachusetts you can watch this program and all of our quality programs around the area in high definition on the double ACS Roku channel\nYou're listening to pontificate ing with Paul and the military at ... am Thirteen twenty W. A. R. aid if you'd like to be a guest on the show him some your position if you still think it's a good idea send an email to Paul at W. A. R. A. radio dot com\nThat hall with a P.\nS. W. A. R. A. radio dot com [noise] pontificate and with Paul and the ... more like recess than school on AM Thirteen twenty W. A. R. A. [noise]\nHere's a song from Todd Snyder [noise] it's a a\nIt's a kind of a new look at the Woody Guthrie song while the ... about Twenty years old but it's a new look at the Woody Guthrie song this land is your land this land is obviously this Milan this land is your land which is taught Snyder says unless you're a Native American you're lying or so here's a an alternate take your own digital people's day\nThis land is our land a Todd Snyder it's about how and why we stole an entire ...\nNo I ... it's about how and why we stole an entire continent from the native population studying [noise]\n\nMm\nMm\nGreenway who does the Asian make with\nStreets do guns or\nAnd\nA dollar to dream job would love\nMad and breathe the land in a\nManner\nNa\nNa na\n[noise] mountain ranges\nLanded\n\n\n\n\n\n\n\nWelcome back to ... fall and the role of cherry it here at Thirteen twenty W. A. outright and all over the world at W. A. R. A. radio dot com [noise]\n\nMark we'll talk more about the ... game is that comes up later\nIn the week Todd Snyder this land is our land we stole it fair and square gosh darn it\nI Will get back and wrap up that song at the end of this break or an airline passenger is being shamed online after a photo surface do them letting a photo surface of them letting their toddler use a portable party\nIn the ... of a plane\nApparently the unnamed woman brought her own party seat on board\nA on board the plane and set it in the ... for the child to use mid flight in front of the other passengers why billboard tore was full bowl bowl I bet you didn't even check to see if all of oratory was full\nAnd Instagram account known as passengers shaming posted the photo of the incident over the weekend they claim that the woman was defiant when the flight crew of the unnamed airline told her to use the on occupied bathroom instead she replied I don't give a ...\nI don't give a crap only she didn't say crap gee that's ironic when your son is grabbing in a port a potty\nGee that's an ironic when your son is grabbing in a port a potty were potty seat in the aisle of a plane needless to say Instagram users in the comments section headache field day with a picture\nWhich has racked up nearly ten thousand lakes and thousands of comments already most criticized the woman for the acts some calling a vial while others didn't seem so surprised by it\n\nUm we have a number of comments or from what's wrong when we have a number of comments from people there\nAbout that but before we get to people's comments about that again bring the little port a potty thing into the on occupied bathroom ... or ... or laboratory or let you can do is business and they're not in the island the plane while let's go to the phone lines at five oh wait two to one three to zero good morning\nYeah hello Kevin Oh\nHanging around on the holiday just kicking back yeah I got this book or\nThat's a dollar tree or the other day super boys the amazing adventures of Jerry Siegel and Shuster the creators\nOf so so oh you're all set for a while with like okay\nNow what you were talking about various issues around this holiday a polluting and I'm self uh I don't know if you're with us but ... are probably\nGeographically speaking on a center around the center of the city of problem is is a large monument ... resting on granite law so it goes in a life size statue Christopher Columbus\nOkay just traveled the intersection of el would avenue and ... avenue and it is funny you should just let the Basij which actually face\nYou find a year just base is ritually face okay I'm not in favor of that but yeah it sure it shows him like holding a global pointing oh gosh [laughter]\nMa ma [laughter]\nPointing the way you know what I mean yeah hopefully development pointing the way for the\nWest and a ... an empire building of the past but uh yeah it's it's something that uh [noise]\nYou know how does a small coterie I think mostly college students and and very far less folks uh pay attention that statue but it's not on federal Hitler's you might expect to see\nIt since ... section okay you know and it's ... it's probably been there for a long time so uh that's one thing like okay for ... for a while to you I'm\nA little bit louder Kevin having trouble hearing you\nYeah well I like I said I'm I'm taking it easy so I'm probably my water Jersey down a little bit you know ... especially after it happened yesterday\nOff too but I'm also I'm also I'm\nA now that the um\nThe the noise and feel every and uh you know the the okay the rabble rabble a is finally started a quiet down a level and hustle and bustle over the Kavanaugh affair we can all get back to normal live a normal lifestyle\nOr I think we need we need this holiday the kind of a [noise] kinda tuned down to things back down and uh you know I'm fifty a it's a it's a few already down\nYeah you have I have been mentioning that at all today I think um\nIt's a feeling you know\nYeah I haven't I haven't been mentioning that are at all today I think I might get into it later in the week but you're right it's a holiday I haven't gone there all the Republican stole another one how I'm Al Gore won the popular vote\nGeorge W. Bush got to a point the judges um Hillary won the popular vote by millions Trump gets to appoint the judges so if we didn't have the electoral college if the will of the people actually meant something if your vote actually meant something as opposed to just a few thousand people in swing states whose voice votes really means something\nOr if our votes meant something right now they'd be Seventy two edge on the Supreme Court in democratic appointed candidates are which based on popular vote a reflects the country far better than the current five for conservative majority does and here's the other thing that bugs the crap out of me which will get into later in the week\nWouldn't even give me here and now this opening comes up with a Brett Kavanaugh and really really of all the millions of people in this country that guy that out of control screaming crying maniac he's the best you can do for a Supreme Court just he deserves the benefit of the doubt\nYeah he's the best you can do for a Supreme Court just he deserves the benefit of the doubt yeah if you're running for you know or if you're if you're applying for a job as an insurance underwriter a salesman\nTruck driver fine we'll give you the benefit of the benefit of the doubt I'm\nNeil Gorsuch did need the benefit of the doubt Merrick Garland wouldnt have needed the benefit of the doubt you know you don't get a job where there's only nine of them in the whole\nWorld for life\nIf there's any doubt sorry it's not a trial it's a job application so that's how they cheated and Mitch McConnell doubling down on what Republicans do best\nViolate the will of the majority of the people in this country or if if if Trump loses the election in two thousand twenty and the Republicans still control the Senate yup yup he said it they'll stone wall again and refused to give a hearing even a hearing\nTo a candidate for the Supreme Court ah selected by a Democratic president\nWow that's how they cheated OK moving on come back we'll be now wants you to the year I don't know two thousand three maybe two thousand four\nUm when the subject of Columbus Day came up on the um [noise] when I was\nOf the Frank fully show all those years ago up in West or is this is a bit of a long clip so I don't play it off and uh but it does address the real the real as far as you know history of\nColumbus Day so here's a discussion from twelve or Thirteen Years ago regarding a what back then we called Columbus Day what now we proudly call indigenous people's day those crazy holidays yeah\nI'll be call indigenous people's day those crazy holidays yeah you know and I really\nDo is sit maybe we get another holiday than Columbus Day I think so because this is my this is my thinking it's like when they name a highway yeah you know it's the Billy BS highway well we've nobody now knows who really be as is or what he did\nA two hundred years ago right or we named stop after people and it's all gone we don't have anything new to name after anybody who may have done something nice now but\nBut you have to remember these people ... million oh no no no don't remember them but the community should we know they don't know how do they do they should Weiner after everybody whoever knew who barely be asked was what he did is gone\nThat's it money ma down and then we rename it you go to any\nCorner talking about a big guy a big deal I'm not talking about taking down the Lincoln Memorial I understand just saying maybe this doesn't have to be\nJoe ... well you go to any intersection of West or anywhere where two roads me to be like sergeant Joe O'Malley underwear in their World War one you're going to get it out and Joe well well well where do you draw the line that more like\nOK okay heartening Luther kings and knock on the door for a half way decent a holiday for how long off Thirty years and he knew the gray and ... we paid it to them nice job you find the joy whatever right you know I mean enough's enough that's what I'm saying why do these guys get a lock for ever\nSo we can ever have a holiday for anybody who does anything new okay this point I agree with you a hundred percent hundred percent because at some point okay President Lincoln gave a President's Day right what about Lincoln and Washington's Birthday combined them to a car sales right because okay refrigerator sailing beer delivered we all know what happened\nIt's now it should be just shopping day right national shopping day because how long ago did these guys do their deal\nNow we have some people recently ... who may warrant a national holiday\nWhich is just a step back one second do lose that thought oh I Want\nA holiday [noise] which is just to step back one second don't lose that thought oh I won't I think we should keep it Lincoln and Washington's Birthday 'cause I Want to honor those guys there's a lot of presidents I don't want to order\nSo should we have a day where we have to work overtime for the crappy Presidents Day is that what you're suggesting exactly Bill Clinton day we put in twice as many everybody has to stay at work to like eight at night absolute Lyndon Johnson day well I mean come on got him some slack alright alright he might get where you're going yeah\nLike maybe next day you're working on nine right absolutely and not telling anyone and I don't yeah okay but I I just think that at some point we need that maybe step back and let three shuffle the deck that's all I'm suggest All right I mean really Columbus with all due respect to the guy has you clearly pointed out yeah\nStumbled upon this little ... to earn it I don't know\nTo just to recap for those who wasn't listen we're listening Columbus and Italian sailor refined gentleman no one in Italy would give them any money they knew he was nuts\nSo he goes to Spain and Portugal I don't know what he did with the queen behind closed doors you're suggesting that he slept this way into discovering America I I that's how he got the money from the queen and the ... wait a minute are you telling me it was all on yet because we need to go about this I don't orderly fat\nYou're suggesting that historians may have missed the part of the Christopher Columbus story where he bought the queen sash\nHere's what he bought the queen and get the cash now the queen ... of the kings are going to be happy about this she doesn't like Columbus around fine goat takeoff fide India sailing to the west good luck to you so this is so the queen of Spain basically pleasures herself\nAnd then kick out of office right right and the kicks the guy out of the country he sails west looking for India misses his target by what Eighteen thousand my stumbles on the Dominican Republic\nBy the way did inside of single baseball player okay almost all the Dominican Republic we call it America and that guy gets a holiday talk about a falling\nRepublic we call it America and that guy gets a holiday talk about a folly of areas that worked out right I'm just disappointed that that piece of the story that I Am most interested in and I wouldn't be about the Dominican Republic are missing by Eighteen hundred miles was never on on a test in school\nThat was I Would have remembered if the question read what year to Columbus discover America I okay I have trouble with that I had trouble if you\nIf the question read what queen Columbus bop or getting the cash to sail I would've known that Isabella about [laughter]\nThe these are the problems that I faced in school I was not interested in most of the stuff would I ever remembered that at at least gotten one right mhm yeah I Would have answered that question with confidence\nAnd that would have triggered all sorts of other correct answers because as you know when you have something to focus on it's like you know you don't ... you don't memorize the whole thing you just get the word right except I would've known he did wild monkey dance with Isabel which led him to go where he went to the end it would have\nFrankly altered my entire educational experience I had\nI been aware of that yes\nBecause I've chaperone a couple of field trips with my son he's in junior high he's in high school now and the other teachers would say to me Mr Halley you have a very new unique way of telling the story but you do get to the point so if it's all this was all true oh yeah\nYeah so Isabella queen of Spain was oh well I don't know that\nI mean you can't go that far with a Q. sleeping well how do they have to sleep with before she becomes the ... what's the number one in one so in other words if you're only buy from one guy on the side no you're not a whole ... right right well let's say that the everybody who was on the ship with Columbus also had their way whether\nAn hour or we have to ... I think so but we're not that's not the allegation so we're not accusing her of being well ... we don't know she may have been\nThat's not the allegation so we're not accusing her of being well ... we don't know she may have been to practice the difference between being promiscuous and being a ho as you just find them [laughter]\nFind your term surfer going to have a historical guard\nFor ... which is one or two extra deli and says the merit okay hold is when you've got a business on the side you know bookkeeping ... where there's cash transactions actually so as long as she slept with let's say thirty guys for free [laughter] there there is no hold them accountable\nBut had she charged a city for these thirty man right what about if you charge one guy but there was a cat's consideration she gave that lumber the money that's ... well that you know what little little know Columbus discovered\nA Idaho and he named it after ... as a Bela ... Idaho and I didn't know right there you go people you think you're not going to get a historical lesson here on this program today you're wrong there's your Columbus primary rocks there's your Columbus Day historical lesson and uh we started out by suggesting what\nWho to rename a street and our were down and using Isabella bingo halls and then that's how we got the name Idaho [laughter] so yeah kids when you get back to school tomorrow makes sure\nIf you have a test on Columbus you remember that information then write it down and then call it we want to know how you did tell your teacher you heard this another show so lonely because sometimes we may need correcting [laughter] we do our best to verify everything on the program but sometimes it's impossible to ah to get you know\nThey Seventy three percent of those facts I just gave her a true and it's your kids to figure them out anyway are you are listening\nAir it is folks while from Frank foolish show all those years ago Columbus ... Isabella agent to twenty four writes in eureka you've got it Columbus was banished to the west for sleeping with the queen definitely not worthy of a holiday\nThis was banished to the west for sleeping with the queen definitely not worthy of a holiday yeah that that's the allegation not sure if it's true but that love the joke yeah which state what state was named after queen Isabella [noise] that would be\nIdaho I Do yeah um the amazing Jim carbon rights before Columbus called them Indians do we know what\nThe natives call themselves are the people the people I Know that was the Lakota tradition they called themselves the people little bit self centered but that's what they called themselves um and then agent Twenty one\nThe day off a rare time he got to listen to the show today and certainly not our best effort rats alright that's going to wrap it up Amy Goodman is coming up next for democracy now a thank you so much for listening to all of you\nEspecially on a day like this one it was a top effort a tough slog I appreciate it sincerely um we'll see tomorrow Dominic will be back tomorrow as well or oh all of our regular program we have a podcast at six o'clock tonight about mental illness which usually catch a seat immoral folks\nYeah [noise] oh there's there's buried give [noise] did you hear that\nFalse settle for just a second look W. A. R. hey Thirteen twenty am\nOn another day where the temperature doesn't change much pretty much what you see is what you get mostly cloudy today\nHigh temperatures right around sixty degrees north east wind five to ten miles an hour mostly cloudy tonight\nFalling back to the upper fifties not much of a change and then we warm up tomorrow with increasing sunshine becoming breezy in the afternoon I in the mid seventies a warm Wednesday coming up sunshine temperatures near eighty degrees and then the remnants of what will be hurricane Michael and a front\nBringing us rain some time by later Thursday into friday\nPerhaps some gusty winds stay tuned\nOn that but overall not too bad today\nHowever if you like sunshine well I guess you probably won't like today [laughter] Thirteen twenty am I ... corridor\n[noise]\n[noise]\n\nThe\nProblem is that that guy that is democracy now\nOn this vote for the eyes or fifty [noise] the Naser forty eight\nOn this vote the eyes or fifty the Naser forty\nThe nomination of red M. Kavanaugh of Maryland to be an associate justice of the Supreme Court of the United states is confirmed\nThat Senate confirms Brett Kavanaugh as a nine Supreme Court justice he's expected to tell the power to conservatives for decades to\nThis confirmation comes despite several multiple several accusations have attempted rape and sexual assault\nWe'll get reaction and look at what's next\nTo be terminated the\nRepublican members of their homes malls\nOr couldn't be prouder of focus on a Republican from\nYour ankles and er and determination\nAnd realize that today is going to send a depth charge through politics\nWe boat and we run for office will go to\nWashington DC to speak with tanks and the damned Benjamin about protesters\nAt the Capitol and my three wire editor in chief Julie Jacobson we'll also speak with feminist\nShariah ... her new book rage because of the power of women to anger then fears are growing over the missing Saudi journalist jumping off the show the Turkish officials say they believe was murdered in the body consulate in Istanbul last week show getting is a Washington Post columnist\nHe lives in the United states than\nGoes ... fold poet or within his own place to be much better for him to a low a breathing space for a quarter\nSo do you get to ... or you just sort of the media to be the most important to me that us permission goes against\nYou need you to be the most important to me ... building and\nWe'll speak with Mehdi Hassan columnist for the interception knows ... interviewed him we'll also speak with media Benjamin author of kingdom of the unjust behind the U.S Saudi connection all that and more\nDemocracy now democracy now for the war and peace report I'm any good men Brett Kavanaugh was sworn in Saturday as an associate justice of the United States Supreme court just hours after the Senate voted to confirm him\nTo fifty three year olds lifetime appointments and mentor right wing majority on the court for the foreseeable future\nThe vote was fifty in favor forty eight against and one president Republican Senator Lisa Murkowski who promised to bug her party and vote no on cabinet she voted present so that Republican senator Steve Gaines of Montana could attend his daughter's wedding without voting\nRepublican Senator Susan Collins of Maine who was seen as a possible swing vote on Kavanaugh's confirmation announced her support for the candidate friday afternoon\nJust by the turbulent bitter fight surrounding his nomination my fervent hope is that Brett Kavanaugh will work\nTo less than the divisions in the Supreme Court so that we have far fewer five four decision and so that's public confidence in our judiciary and our highest court\nIs restored Mr President\nI Will vote to come for judge cap and\nA confirmation came under intense public scrutiny after three women accused time that's\nKavanaugh's confirmation came under intense public scrutiny after three women accused him of sexual misconduct tea has denied the allegations made by Dr Christine Blasey Ford as well as two more accusers Julie sweating that can Kavanaugh's former Seattle classmate Debbie Ramirez\nWho said he exposed himself to her during a party in a statement released Saturday Ramirez said by their vote the senators were quote deliberately ignoring Kavanaugh's behavior adding I feel like I'm right back at Yale we're half the room is laughing and looking the other way\nThis is how victims are isolated and silenced Ramirez said\nWest Virginia Senator Joe Manchin was the only democratic senator to vote in favor of Kavanaugh's confirmation that says mansion after declaring his support for Kavanaugh last friday\nOr budget with association indoors and very much but we just as we could do for senator do you think that there's still a place in the Democratic party for you after this resource for understood was over religion\nProtests against Kavanaugh's confirmation raged in Washington DC and across the country Saturday Capitol police arrested a hundred sixty four demonstrators including a hundred and fifty at the U.S Capitol building in a handful\nOf protesters who interrupted the Senate roll call vote in New York City protesters took to the streets justice Kavanaugh is confirmed that says a key on sorry of the alliance for quality education\nCabin I Want to constantly say that this is way bigger as a black woman and society I Am clear the cabinet well not only three ton though the way many civil rights legislation\nThere had been supportive of communities that looked like me people turn those as well what what I also am clear is that as a black woman and society\nWe turn those as well [noise] what what I also am clear is that as a black woman in society that we've been up against that we can rise above this who can ride back\nWe'll have more on the confirmation of Brett Kavanaugh to the Supreme Court after headlines United Nations climate panel warns in a new report humanity is only a dozen years to mitigate climate change or face\nGlobal catastrophe with severe droughts floods sea level rise and extreme heat such a cause mass displacement of poverty the landmark report by the inter governmental panel on climate change the eye PCC warns dramatic\nAction is needed over the next twelve years to whole global temperature rise below one point five degrees Celsius or to point seven degrees Fahrenheit beyond which global crises could unfold at a rapid pace\nThe report comes as governor Rick Scott has declared Florida a state of emergency as forecasters predict tropical storm Michael could strengthen to become a major hurricane is it makes landfall late Wednesday\nAnd Indonesia the death toll from last month's massive earthquake and tsunami has risen to more than Nineteen hundred with some sixty thousand people displaced after\nAn Eighteen foot wall of water ... miles and to the island of ... authorities warn some five thousand people remain missing many of them likely swept out to sea or trapped amidst rubble that could take months or years to clear\nIn Haiti at least twelve people died in nearly two hundred were injured after five foot nine magnitude earthquake struck Saturday evening and Haiti's northwest many of the injuries came as unsafe cinderblock homes and structures collapsed on residents\nIn Brazil far right presidential candidate show you're both NATO surge to first place and Sundays general election but will face in October twenty eighth runoff election after narrowly missing an outright win both NATO claimed forty\nRunoff election after narrowly missing an outright win votes to NATO claimed forty six percent of the vote he'll face workers' party candidate Fernando ... who won just under thirty percent both to not have had a history of making racist massaging a stick\nAnd homophobic comments he is a former army officer was openly praised Brazil's military dictatorship of\nThe late Nineteen sixties and his encourage police to kill suspected drug dealers and once told the female lawmaker she was too ugly\nTo rape a head of the election anti ... protesters rallied in Sao paolo in another city Saturday proclaiming not him [laughter]\nAnd my son ... gender and from Judy in protest er nurse homophobic like violence against those who are not have sexual\nWe should all worlds hurts the presumption of innocence we refuse to the gym and aided by the mob\nWe ...\nA mob of people that were coming after Republican members of their homes and ...\n... we finally discovered the wonder and it was for the Republican voters would have to go to the ... due to\nSenate majority leader McConnell also said he was prepared to take up another nomination to the Supreme Court by President Trump and twenty twenty even though he blocked President Obama's nomination of Merrick Garland to the Supreme Court in two thousand sixteen because it was an election year\nThis comes as President Trump is already touting Kavanaugh's appointment to the Supreme Court as a major victory speaking Saturday at a rally in Topeka, Kansas she urged voters to support Republican candidates saying Democrats have become quote too extreme and too dangerous to govern\nYou don't and Rogers doing are so there's a ... hour doing and we left wing mob and that's what the guy\nMore we're joined by three deaths in Washington DC Monday and Benjamin cofounder of coat paint which part of the protests in front of the Supreme Court Saturday against Kavanaugh's confirmation also with us Jody Jacobson precedent ... wrote a piece this weekend headlined Titanic fraud\nSusan Collins a moderate\nWho never was answer riot your model a long time writer and feminist activist and author of the new book range becomes her the power of women's anger she's also director of the woman's media center speech project and organizer of the safety and free speech coalition welcome you all back to democracy now\nI'm so that moment at three o'clock on friday when Susan Collins announced that she would vote to confirm\nSusan Collins announced that she would vote to confirm judge Kavanaugh as the next Supreme Court justice said the United states Jody Jacobs and that's what you focused on in your column talk about the significance of this of course I'm Senator Murkowski of Alaska and now she would not\nSupport judge Kavanaugh in the end she simply voted present to balance out her colleagues senator Danes who went home to his daughter's wedding um but\nSenator Collins Jody why do you call her a frog\nSenator Collins has often been portrayed as a moderate\nBut that portrayal is really an inside the beltway portrayal it's convenient tool for media pundits she used in order to have someone on the Republican side they can use to frame off with Joe mansion for example but\nSusan Collins is not a moderate she has voted with a Mitch McConnell and was now President Trump but most of the time she has taken a step here\nIt's really beyond just a vote\nShe went on the floor of the Senate\nTo literally gas like the entire nation about both the process\nAnd about the nominee himself she took Republican talking point about the process of the FBI investigation for example which was far from complete and far from sorrow and did not even include an interview with\nEither Brett Kavanaugh or doctor bluesy Ford and called it a complete investigation it didn't have there are many many witnesses don't we're not hauled in many leads that were not followed it was really um the epitome of window dressing so she tried to tell us that\nA full investigation had been carried out that she had a you know examine his record and found it to be\n[noise] that she had a you know examine his record unfounded ... are more centrist or liberal than other people may mostly all of us have um how dangerous to be um or have read it to be rather and then also she went on\nTo tell Dr ... before\nThat she did not know what she was talking and there's this Republican line that goes well we believe talk blizzards word but\nWe don't think she really knows what happened to her and he says is not the definition of trying to ... someone I don't know what is it was deeply deeply painful really I'm\nReally I mean I I Want to turn to um uh the I Wonder at church to the fact that neither blouse a Ford\nFor Kavanaugh was interviewed by the FBI a very different situation than ah being questioned at the Senate Judiciary committee this is what Dr lousy forward had called for\nAn FBI investigation the criticism at the beginning once it was going forward is don't just intervened the two of them go beyond that but I think very few people thought maybe Mitch McConnell did that the two of them weren't going to be interviewed and it's particularly\nSignificant when it comes to Brett Kavanaugh because he would be under oath\nIt wouldn't be a the Democrats asking questions and he could attack them for being Democrat and then the Republicans simply supporting him he would having to directly answer FBI questions he explain how it was possible\nThat the FBI investigation didn't\nInclude interviews with these two primary people\nWho was controlled by the White House in conjunction [noise]\nShe was controlled by the White House in conjunction with the Republican side of the Senate Judiciary committee and they decided to gather what would happen in the investigation and literally there were people that were that were done the FBI was not allowed\nTo interview and among those were ... and Dr lazy part ... ... do you have\nA a situation where Kavanaugh Who Lied under oath numerous times outside the scope of this issue of\nThe sexual assault but on many other issues was not being put under oath by the FBI and if you watched the hearing when he was questioned repeatedly I I think it was by Dick Durbin and several others would you\nCall for an FBI investigation he remain silent so he clearly did not want to be put under oath and he did not want other people to be interviewed and let's face it she spent the better part of the two weeks before the FBI under investigation in the White House with Don McGahn so\nThere's no way there was going to be a fair and throw FBI investigation because he was part of the group calling the shots I think the key thing here to realize is if you wanted justice\nAnd if you wanted to really understand if Dr Palese for ... and credibility and her claims were credible than you would want to do a thorough investigation and you would want to remove any question but the reality that have to grapple with it they did not care\nAnd they did not want to understand and that is what's so\nWell barely clearly they deeply cared about putting him on the Supreme Court I wanted to bring in a democratic Senator Elizabeth Warren who spoke on Thursday nights\nI wanted to bring in a democratic Senator Elizabeth Warren who spoke on Thursday making a new claim about the content says the FBI document on Kavanaugh that we're viewed by senators and the Senate basement one after another and not being able to bring in a pen not being able to take any out any notes\nThis is what she said senators have\nBeen multiple so I Will now say three things that committee staff has explained are permissible to say without violating committee rules statements that I have also independently verified as accurate\nThis was not a full and fair investigation it was sharply limited in scope and did not ask for the relevant confirming facts\nTo be available documents do not exonerate Mr cabinet\nThree be available documents contradict statements Mr ... made under oath\nThat Senator Warren and this is extremely significant Jody a because people don't know what we're in those documents that these senators reviewed and she's saying they were not exonerate him right\nBecause I think it was very critical for her to see clearly and loudly because what you've got is being on the other side of the on out saying well the documents show that you know there was no evidence for ... for\nUm a\nClaims and if you know what it's like ... when you've been attacked and I do\nIt the the most ... humanizing kind of experience to have something happen to you to try to pass for how to how people dismiss you I Can't tell you\nHow to how people dismiss you I Can't tell you how left\nThe country peanut this episode has touched so many women not only of course the women\nWho were there to out the two weeks or just you know at the Capitol giving their hot women drop this country who have been in this situation and have been Gosling about it it's really deeply painful\nJody Jacobson press and editor of a ... news wrote a piece this weekend headlined a Titanic fraud Susan Collins a moderate who never was um a\n[laughter] well you know I think that um it's useful for McConnell to to talk about a mob these are citizens they're articulating their needs and there are defending their rights\nThey happened mainly to be women which means that they're associated with unhinged emotion 'em and you can see that in multiple\nDid with unhinged emotion 'em and you can see that in multiple\nForms of commentary coming from his party but I think that we all understand certainly as women that anger and the expression of anger comes with the penalties for women were socialized to put others first\nTo restrain our expressions of negative emotions because it causes discomfort and even his little girls are rewarded for being nice and pleasing a not for being assertive or aggressive neither of which implies that were angry by the way\nIt's just that the assertiveness and aggression and anger are are not separated and the behavior or an responses to girls and women are so I think that what we're seeing now in this explosion of women's feeling is\nIs clearly a pent up need to be listened to and believed it's a demand that this stopped at the gas lighting stop\nThat the doubting stop and that the disregard for our rights as citizens or come to an end\nYou wrote about Kavanaugh's range ... bossy storage and the testimony\nWell she she was so composed and um to me or and actually\nHer she was deferential right she she went out of her way to\nTry and put others it is which I think is\nA fairly common for women um in her situation certainly knowing that and she she not only was a a witness but an expert witness or she was testifying but she also a\nStudy that's her entire life she knows what these dynamics look like I Would say that the saddest part actually of her whole testimony to me was when she used the word college ...\nBecause it showed that she really um\nLee geology because it showed that she really I'm considered that these\nThese people that she was appealing to and on the right of course it was all men are three of whom had been participants in the Anita Hill a judge a Clarence Thomas hearings\nThat that they considered her appear that they would treat her with mutual respect that they would\nLike now acknowledge her professional expertise and that is simply not true she could not make that assumption\nAnd that kind of as a rude shock two girls and women all the time that we believe that we are functioning as equals\nA with equal dignity and with the knowledge that we have accrued some expertise and then we're sort of slapped in the face with the information that our male parents do not feel that that way at all\nOn the other hand came in roaring and indignant and ... and um his emotion analogy\nOverwhelmed everything else in the room and he could do that because in our culture there is an essential core of rationality that is associated with being a man it it actually didn't degrade the idea that he could think clearly\nWhereas if you're a woman or you don't have that uh some you can't ... people don't presume that about you you are all emotion Holiday Inn if by chance you think clearly um that's sort of a layered on top of this this um feelings\nOrientation that we're supposed to naturally have as women which is of course nonsense men are no more rational logical than women are and women are no more unhinged and emotional and men that was very clear from from the confirmation hearings\nShow on a lot of the discussion has been about the mid term elections innocence galvanized the right um many Republicans\nElections innocence galvanized the right um many Republicans are saying\nInterestingly shortly after Kavanaugh which confirmed to the Supreme Court Republican Congressman Steve king tweeted a photo of a sleeping in Fenton said quote soon babies like this little angel will be protected in the womb by law\nOf course referring to the overturning of row the weight I'm as we wrap up\nSince you've just come from this book tour around the country how people are continuing to organize or do you think that stops women in their tracks\nOh gosh no I mean very clearly I think that may be one of the most formidable um confrontations of of what we had been living with is about to come\nI think that this is this is not stopping anything in its tracks if if if we're looking at a twelve hour a clock we're probably at second three or four\nI Would say I mean the the truth is that a lot of people would like me too and any suggestions that me too it's failed or come to an end um to go away and it's really not an end at the beginning this is not a a movement that is I'm\nAbout to come to a closer that looking back it really is an incredibly sustained and I'm committed challenge to to the systemic abuses\nShariah trolley want to thank you for being with us a rage becomes sure the power of women's anger is psoriasis new book\nMuddy Benjamin we're asking you to stay with us as we turn to a very different story right now what has happened to ... he walks into the Saudi consulate in Istanbul, Turkey is a columnist\nFor the Washington Post and he never comes out as far as anyone knows he's believed to be dead\nComes out as far as anyone knows he's believed to be dead what happened stay with us [noise]\n[noise] um\nNew jobs and when do\nYou\nYour job and you're\nAbout to call them and we\nLearned\nAbout this runaway for your job\nTo job through\nNew jobs\nYou're\nTalking\nThey were the other day and then\nI just said and he was probably originally\nIt was up all the time\nIf you will probably remain\nFor you to you by Peter coach\nThe democracy now I'm any good men fears are growing over the fate of missing Saudi journalist ... Turkish officials say they believe was murdered in the Saudi consulate in Istanbul, Turkey last week\nThe show he was a columnist for the Washington Post she's been living in a post exile in the United states he entered the Saudi consulate in Turkey seeking a document he needed to get married and has not\nBeen seen since the Washington Post reports of Turkish investigation has revealed a group of about Fifteen Saudi men traveled to stumble to kill ... as he visited the consulate\nSaudi officials have denied the report and say they don't know the journalist whereabouts in an interview with Bloomberg last week but Saudi crown prince Mohammed bin Salman\nWhereabouts and an interview Bloomberg last week the Saudi crown prince Mohammed bin Salman said the Saudis were very keen to know what happened to ... and would allow Turkish officials to enter the Saudi consulate in search the premise that spot when he was pressed about whether a shaggy faces charges in Saudi Arabia he invaded the question\nShow gets a well known critic of the Saudi regime democratic Senator Chris Murphy of Connecticut treated Sunday if this is true that the Saudis alerting us resident and to their consulate and murdered him it should represent a fundamental break in our relationship with Saudi Arabia\nUnquote well last week the Washington Post printed a blank column and supportive ... it was titled a missing vote with just his byline\nOr a missing voice it was the headline our next guest is Mehdi Hassan who interviewed ... Washington D. C. earlier this year\nYou'll crown prince to pretend to enroll in the Supreme leader you've said he's creating quote an interesting full of dictatorship also\nSee him was that it for murder but he just goes on in old poetry was in his hand wouldn't be much better for him to a low a breathing space for ...\nOr ... or you just sort of the media to debate the most important needed for mission building in the country what he is doing cool for ... for a while to sort of a newspaper\nOr a loving woman to draw you order a low for women to to begin poem or two a lead me to the ... of the images establishment demanded that he is doing that I use things but it is an important to those for mission requires us\nTo contribute to to discuss it and no one should be do\nWe go now to Washington DC where we are joined by Mehdi Hassan who is interviewing and ...\nGoing out of Washington DC where we are joined by Mehdi Hassan who was interviewing and ...\nAnd that he is a columnist for the intercept published and their deconstructed pod cast a he has to step up front to al Jazeera English ... speaking also with us and and the invention and cofounder of ... and if the author of came to the un chest\nBehind the U.S Saudi connection with alchemy about ten ... many talk about the latest news is and what we understand at this point\nWell I Want to thank you both for being with us to talk about this um the Washington Post of course also talk calling that's an attack on journalists and demanding answers for their columnist or we will continue to follow the case of chocolate choking muddy and Benjamin and Mehdi Hassan thanks so much for joining us\n\nAnd unlikely story showcase renowned author Eleanor teal as she celebrated her latest book the treasurer of\nTo showcase renowned author Eleanor teal as she celebrated her latest book the treasurer of bad\n... McGee a story of a little girl named Jenny and our best friend Pandora who set out on a quest to find a hidden treasure and New Zealand during the gold rush audiences retreated to a reading from the book along with games and activities that helped bring the story to life\nYou can watch this program and all of our quality programs from around the area and high definition\nA double A. C. S. dot com you are listening to W. A. R. A. Thirteen twenty am ...\nEvery one another day where the temperature doesn't change much pretty much what you see is what you get mostly cloudy today\nHigh temperatures right around sixty degrees or northeast wind five to ten miles an hour mostly cloudy tonight\nFalling back to the upper fifties not much of a change and then we warm up tomorrow with increasing sunshine becoming breezy in the afternoon I in the mid seventies or warm Wednesday coming up sunshine temperatures near eighty degrees and then the remnants of what will be hurricane Michael and a front\nBringing us rain some time by leader Thursday into friday\nPerhaps some gusty winds stay tuned\nOn that but overall not too bad today\nHowever if you like sunshine well I guess you probably won't like today who Thirteen twenty am I'm ...\nHi my name is Chris Wyoming and I'm the manager of the elder dental program where lighting any seniors resigning in Massachusetts who are sixteen older\nTo attend a free dental screening clinic and titan on Saturday October ... from a forty five AM to one can participants will receive a free dental screening and have\nAn opportunity to speak or that dentists in the clinics relaxed and finally setting because they tend to be screened for all cancers and have a chance to receive free venture cleaning\nFor more information costs seven seven for two zero three one three to six\nNation called seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program a project of the community ...\nThings do they do ... and then and then you get\nA\nNot\nPay they know and then\nYou\n\nJohn I\n[noise]\n[noise] I\n\n\n\n\nThing I\nBut I think that\nThey said oh\nI'm\nYou do\n\nSaying\nNo no\nAnd\n\nAnd\nBegan to do and\nThey ...\nYour debt and\n... and\n...\n...\nDean Kamen\nAnd\nGermany and the anti\nSmoking group\nThe anti\nYou know no one man [noise] [noise]\n[noise] ...\n[noise]\nWell I\nWell ... ... ... ... you\nDone and then she\nA on\n\nDa da da\nYeah\nAnd and and\nName and then\nIt goes on\nAnd to me\nAnd then the phone [noise] and then they can\nTime and you got\nAhead [laughter]\nNo that is but then\nIt out a lot\nDa da da da\n\nDe\nDe\n\n\n\n\n\n\n\n... [noise]\nThe way\nMe you\nWill\nNow we'll see you know the the\nOne way\nAnd I will see na na na\n\nOf someone\n... and ... no but I'm not\nBed and no body then\nOne can call me\nAnd you can\nAnd yell\n\n\n[laughter]\n\n[laughter]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\nOh\n[noise] oh\n\n\n\nNo\n\nKnow [noise]\n[noise]\n\n\nGot\n\n\n\n[noise] [noise]\n\nYou're listening to W. A. R. E. Thirteen twenty I Am a ... [noise]\nWill come to the ... the only news children's author and Nico Denise paid a visit to an unlikely story to read her new book why they're more carbon we spoke with her to find out more about your person tissue and so\nMy second time visiting an unlikely story and I'm here to\nMy second book in a series called starring Carmen this book is called lake camera\nLook at a series called starring Carmen this book is called lights camera\nUm it's about a little girl\nTo learn how to share the spotlight\nHas a lot of energy and creativity\nWhom she um\nThat's where she has trouble sharing the spotlight\nSo loosely based on my own family and my own\nSo today we're just sort of read the book and\nTake questions do some crafts\nToday the official release day of lights camera Carmen um came out with a burns books\nOn the first one came out a year ago so this is supposed to\nAn unlikely story has wonderful kids programs and um they have a following kids that love to read that come in and enjoy meeting authors and if you look at their author roster of events just always fantastic\nWe just love it and we love supporting um local\nIndependent bookstores and this one is one of the best in our area and\nSo not too far away um we come and shop here and we've come to the author is here I have three daughters um my husband's a children's book illustrator so children's books are in our family and we we just love\nWe love this community it's a really it's more than just a bookstore is a community of readers\nSo I started out as a copy writer\nAdvertising believe it or not and I met my husband who illustrated children's books he'd been you went to Rhode Island school of design\nIn writing but not necessarily\nUm but the great thing about copy writing which makes it a little bit similar to picture books is you have to learn how\nCopy writing which makes it a little bit similar to picture books is you have to learn how to condense a story into fewer words so you have to understand\nI'm an economy of language and I'm\nLike a very tight beginning middle and end which wasn't that\nCopier writing storytelling that I was doing so I decided I Would try to\nSee if I could do it to write for kids um and my husband gave me a lot of\nHe started drying and I started writing and we work together and eventually came up with a story which was our first\nWhich was um pages love potatoes [laughter]\nSo nice little young counting books\nUm and we showed that to his longtime editor and she liked it and that became my first published\nAnd then after that I\nGot involved in the children's community and\nMy own children so I was reading a lot of children's books that I just fell in love with that is my one of my favorite ways of telling stories um I Love the combination\nStory um\nEver that's what I've been doing ever since\nThat day for today's updating can watch all over contents by visiting our website to ... dot com by downloading ... visiting middle believe the U.S Roku channel ... news in Washington ... [noise]\nEvery one another day where the temperature doesn't change much pretty much what you use what you get mostly cloudy today\nAre temperatures right around sixty degrees but north east wind five to ten miles an hour mostly cloudy tonight falling back to the upper fifties not much of a change and then we warm up tomorrow with increasing so I'm Johnny becoming breezy in the afternoon I in the mid seventies\nWith increasing sunshine becoming breezy in the afternoon I in the mid seventies a warm Wednesday coming up sunshine temperatures near eighty degrees and then the remnants of what will be hurricane Michael and a front bringing us rain some time by leader Thursday into friday\nPerhaps some gusty winds stay tuned\nOn that but overall not too bad today\nHowever if you like sunshine well I guess you probably won't like today with Thirteen twenty am I record\nThe national diversity graduate fair will take place on October thirteenth from three PM to six PM at Rhode Island colleges Murray center attendees can speak with graduate admissions representatives from local and national colleges and universities\nThey'll have the opportunity to learn more about admission requirements application deadlines financial aid opportunities and more the fair is free and open to those considering graduate school\nThose wishing to attend the fare can register by visiting diversity college fairs dot com [noise]\n\n\n\n[noise]\n\n\n\n\n\n\nThe you\n\n\n\n\nWell in your son and I was wondering\nThat it's like okay uh the first one why did I stick Vienna to use as a as a metaphor\nTables constructed with five guys overhead show hosted by the ... arts museum exhibit included a visual interpretation of the table aspect of the story along with performances from the carpenters poets eastern Massachusetts you can watch this program at all about quality programs around the area in high definition on the double ACS real gentle [noise]\nReason the directors each other we\nBelieve we can get over it was a good\nGood\n\nWell there are\nA\nReally good\nMm\nJeeze\n[noise]\nNo I'm\nNa\nKnow ...\n[noise]\n\n[noise]\nMm\n\n... ... [noise]\nUh\n[noise]\nUh the\n\nLa la la ... who [noise]\n\nThe [noise]\n[noise]\n[noise]\nDo\n\nDo that and we do\nAll I'm a teacher\n\n\n\nDr Gary highland or will return to Richard's memorial library for a series of lectures titled papers the series starts with the federalist papers on Thursday October for it it will be followed by the pumpkin papers on Thursday October Eighteen and the Pentagon papers on November\nOh by the pumpkin papers on Thursday October Eighteen and the Pentagon papers on November first all lectures will take place at seven PM registration is required within these lectures if you'd like to register you can email librarian Maggie homes at in homes at sales in dot org\nNa da da na I still\nHanging around\nA lot of living in your car one hospital now\nLike to buy those little hole in the ...\nDo you go to the gym and yo la di di Jane\nAnd you're there the junkie ...\n... ... ...\nIt's like some ... rabbit\n\n\n\nAnd and\n[laughter]\n\n\nAnd be standing\nIn line [laughter]\nMe either\n[laughter]\nIn the brain damage\nBrain\n\n\n\nIt brings out\nIn three years\n[laughter]\n\n\n\nAnd [noise]\nThe bird [laughter]\n\nIn the\nArea and they're\nTrying to think\nYeah I\nThink\n\nThey [laughter]\n[laughter]\nI'm In\n\nIn the end up doing a better that\nPeople and\n[laughter]\n[laughter]\n[laughter] [laughter]\n[laughter]\n\n[laughter]\n\n[laughter]\n[laughter]\n[laughter]\n\nAnd she said they can do any day Monday when or where and when and where they\nGo hand in hand and share share [laughter]\nAnd beer [laughter]\n[laughter]\nYou just bring it back out\nOn the ballot\nIn the way\n... diversity grudge\n\nThe national diversity graduate fear it will take place on October thirteenth from three PM to six PM at Rhode Island colleges Murray spender attendees can speak with graduate admissions representatives from local and national colleges and universities\nThey all have the opportunity to learn more about it mission requirements application deadlines financial aid opportunities in or the fear is free and open to those considering graduate school\nThose wishing to attend the fare can register by visiting diversity college fairs dot com [noise]\nA\nA law\nYou're listening to W. A. R. E. Thirteen twenty um adult world [noise]\nWill come to the WTO daily news children's author and Nico Denise paid a visit to an unlikely story to read her new book white secure more carbon we spoke with her to find out more about your presentation so\nMy second time visiting an unlikely story on and I'm here to\nMy second book in a series called starring Carmen this book is called lake camera\nUm it's about a little girl\nTo learn how to share the spotlight\nHas a lot of energy and creativity\nWho she um\nThat too she has trouble sharing the spotlight\nSo loosely based on my own family and my own\nThat today we're going to read the book and\nTake questions do some crafts\nToday the official release day of lights camera Carmen\nToday is the official release day of lights camera Carmen um came out with a burns books\nOn the first one came out a year ago so this is supposed to\nAn unlikely story has wonderful kids programs and um they have a following kids that love to read that come in and enjoy meeting authors and if you look at their author roster of events just always fantastic\nWe just love it and we love supporting um local\nIndependent bookstores and this one is one of the best in our area and\nSo not too far away um we come and shop here and we've come to the author is here I have three daughters um my husband's a children's book illustrator so children's books are in our family and we we just love\nWe love this community it's a really it's more than just a book store it's a community of readers\nSo I started out as a copywriter\nAdvertising believe it or not and I met my husband who illustrated children's books he'd been you went to Rhode Island school of design\nIn writing but not necessarily\nUm but the great thing about copy writing which makes it a little bit similar to picture books is you have to learn how to condense a story into fewer words so you have to understand\nI'm an economy of language of um\nLike a very tight beginning middle and end which wasn't that\nCopier writing storytelling that I was doing so I decided I Would try to\nSee if I could do it to write for kids um and my husband gave me a lot of\nHe started drawing and I started writing and we work together and eventually came up with a story which was our first\nWhich was um pigs love potatoes [laughter]\nSo nice little young counting books um\nSo nice little young counting but [noise] um and we showed that to his longtime editor and she liked it and that became my first published\nAnd then after that I got involved in a children's the community and\nMy own children so I was reading a lot of children that that I just fell in love with that is my one of my favorite way of telling stories um I Love the combination\nStory um\nEver that's what I've been given everything\nThat they are for today's updating can watch all over contents by visiting our website to double easiest dot com by downloading ... visiting ... channel for double easiest news from Austin rocket [noise]\nEvery one another day where the temperature doesn't change much pretty much what you see is what you get mostly cloudy today\nHigh temperatures right around sixty degrees or northeast wind five to ten miles an hour mostly cloudy tonight\nFalling back to the upper fifties not much of a change and then we warm up tomorrow with increasing sunshine becoming breezy in the afternoon I in the mid seventies a warm Wednesday coming up sunshine\nTemperatures near eighty degrees and then the remnants of what will be hurricane Michael and a front bringing us range sometime by leaders Thursday into friday\nPerhaps some gusty winds stay tuned\nOn that but overall not too bad today\nHowever if you like some ... well I guess you probably won't like today [laughter] Thirteen twenty am on June ...\nHi my name is Chris Wyoming and I'm the manager of the elder dental program where lighting any seniors resigning in Massachusetts who are sixteen older to can act free dental screening clinic\nPresiding in Massachusetts who are sixteen older\nTo attend our free dental screening clinic in taunton on Saturday October ... from a forty five AM to one PM participants will receive a free dental screening and have\nAn opportunity to speak with a dentist and the clinics relaxed and friendly setting participants will be screened for all cancers and have a chance to receive free venture cleaning\nFor more information call seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program a project of the community the NA\n\nI'm\n... Mm\n\n\nIn the\nThey will walk down the\nTo do [noise]\n\n[noise]\n\n\n[noise]\n\nCharge\n\nWell\nWill miss ... in\nDid you know\nJury and\nUm\nUm\n\n[noise]\n\n\n\nNo I'm not a bang bang bang bang bang bang bang bang now [noise]\n[noise]\nMaybe yeah\nHe\nHe ... [noise]\nThe news that\nTo me\nMaybe\n... back in the\nSnow\nIn order to accommodate working parents school time and unlikely story inflamed bill will host\nA Sunday story time on the first Sunday of every month story time consists of a half hour of stories songs and a simple crap and is recommended for ages two to six but all story lovers are welcome\nRegistration will open one week before only children need to register the next story time will take place on Sunday October seventh and eleven AM and run until eleven thirty to register for the event you can visit their website and unlikely story dot com [noise]\nWe knew oh\nDo\nMay be the\n\nOn a long\nYeah 'cause I\nAnd\nWay in\n\nGod [laughter] I'm\n\nNot I\nDon't\nWhen the\n\nMore\n[laughter] ha ha ha\n\nThat\n\nBut I find um\n[noise]\n\n\n\n\n[noise] Hi my name is Chris Wyoming and I'm the manager of the elder dental program we're inviting any seniors residing in Massachusetts\nWho are sixteen older to attend our free dental screening clinic in taunton on Saturday October twenty it from a forty five AM to one PM participants will receive a free dental screening and have\nAn opportunity to speak with a dentist and the clinics relaxed and friendly setting forget they tend to be screened for oral cancer and have a chance to receive free that you're cleaning\nFor more information called seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program a project at the community me in a\nYear which is a church or a ... you know it's just a ... ... ... do you enjoy seeing but you know big scene where the ease now for almost\nMillion ... [noise]\n... no Jew\n\nWell ... ... ... you\n\n\n[noise] [noise] [noise] [noise]\n[noise] ...\nIn the last\nMovie you know you'll yeah\nI mean\nAnd I just see me\n\n... me I\nMean\nYou're listening to W. A.\nR. S. searching twenty am Arab world [noise]\nWelcome to the double ACS daily news children's author and Nico Denise paid a visit to an unlikely story to read her new book whites camera Carmen we spoke with her to find out more about your presentation then so\nMy second time visiting an unlikely story on it and I'm here to\nMy second bucket a theory it's called starring Carmen this book is called lights camera\nUm it's about a little girl\nTo learn how to share the spotlight um who\nHas a lot of energy and creativity\nWho she um\nThat's her she had such trouble sharing the spotlight\nLoosely based on my own family and my own\nLoosely based on my own family and my own little brother\nSo today we're just going to read the book and\nTake questions do some crafts\nToday is the official release day of lights camera Carmen um came out with a burns books\nOn the first one came at a year ago so this is supposed to\nUm an unlikely story has wonderful kids programs and um they have a following kids that love to read that come in and enjoy meeting authors and if you look at their author roster of events just always fantastic\nWe just love it and we love supporting um local\nIndependent bookstores and this one is one of the best in our area and\nSo not too far away um we come and shop here and we've come to see authors here I have three daughters um my husband's a children's book illustrator so children's books are in our family and we we just love\nWe love this community it's a really it's more than just a bookstore is a community of readers\nSo I started out as a copywriter\nAdvertising believe it or not and I met my husband who illustrate a children's books have been so you went to Rhode Island school of design\nIn writing but not necessarily\nUm but the great thing about copy writing which makes it a little bit similar to picture books is you have to learn how to condense a story into fewer words so you have to understand\nI'm an economy of language of um\nLike a very tight beginning middle and end which wasn't that\n... story telling that I was doing so I decided I Would try to\nSee if I could do it to write for kids um and my husband gave me a lot of\nSee if I could do it to write for cats um and my husband gave me a lot of\nHealth and he started trying and I started writing and we worked together and eventually came up with a story which was our first\nWhich was um pays less potatoes [laughter]\nSo nice little young counting but [noise] um and we showed that to his longtime editor and she liked it and that became my first published\nAnd then after that I got involved in the community and\nMy own children so I was reading a lot of children's back then I just fell in love with my one of my favorite way of telling stories um I Love the combination\nStory um\nEver that's what I've been given everything\nThat they're for today's updating can watch all over contents by visiting our website to double easiest dot com by downloading the double in the U.S mobile lap or by visiting the double ACS Roku channel for double easiest news in Washington ... [noise]\nEvery one another day where the temperature doesn't change much pretty much what you see is what you get mostly cloudy today\nHigh temperatures right around sixty degrees but north east wind five to ten miles an hour mostly cloudy tonight\nFalling back to the upper fifties not much of a change and then we warm up tomorrow with increasing sunshine becoming breezy in the afternoon I in the mid seventies or warm Wednesday coming up sunshine\nTemperatures near eighty degrees and then the remnants of what will be hurricane Michael and a front bringing us range some time by leaders Thursday into friday\nPerhaps some gusty winds stay tuned\nOn that but overall not too bad today\nHowever if you like sunshine well I guess you probably won't liked it\nHowever if you like sunshine well I guess you probably won't like today with Thirteen twenty am I ... corridor\nIn order to accommodate working parents in school times and unlikely story in ... hostess Sunday story time on the first Sunday of every month story time consists of a half hour of stories songs and a simple craft and is recommended for ages two to six but all story lovers are welcome\nRegistration will open one week before only children need to register the next story time will take place on Sunday October seventh at eleven AM and run until eleven thirty to register for the event you can visit their website and unlikely story dot com [noise]\n[noise]\n[noise]\n\n\nRight\nJim blues must mean its accordion cooled off its accordion cooler must mean it's um the oh yeah ... that's\nWell you know you get\nYou get up in years you don't even remember what you had for breakfast and by the name but yes it is coach Dave and yes we are here once again\nAnother rainy Wednesday we tape on Wednesdays it seems every Wednesday for the past I don't know six years or so much rain but start raining right this minute but I'm sure you can start any time but anyway enough of that\nWe are we're doing the same show today and orange totally out of outside my comfort zone for the show but I Do some classic pop rock and roll music\nFrom way back when like fifties\nAnd sixties and I'm sure all your folks look into your grandparents proper told your all about the songs so\nFirst of all going to start with is a song\nThat was written actually co written but song by a young man named Rory orbit soon he was in the early sixties he was he was one of the\nTop rock and roll [noise]\nTop top rock and roll\nFor farmers of the time royal mission was blind but that certainly didn't stop him and the song is called pretty woman and it sold\nOverall about seven million copies now\nThere may be a little\nA little ... there\nAre definitely a copy but there was also a movie pretty warm it so I'm not sure if it was seven million copies before the movie because of the movie or after the movie but well give it a try anyway so let's do a\nLittle bit of pretty woman here we go through any\nSweet Caroline ... six to seven it was said that there are new diamond once said that uh\nThe inspiration for that song was when he saw a picture on TV of a President Kennedy's daughter Caroline but then a few years later he said well you know no actually I I I wrote it for my wife\nAnd I don't know what her name was but it wasn't cow alive but he said to write the words really had to change the name to Caroline so [noise] I don't know your guess is as good as mine [noise]\nAnybody have any idea what the day to day life is\nNineteen fifty four means well besides being the day after July Fourth\nAnybody buddy in Studio ... nobody knows\nWas probably the most important date in the history of popular and a rock and roll music because he young\nYoung fellow from Memphis, Tennessee was in the studio and the recording studio\nAnd uh he he had he had been to still be a few times before but nothing nothing was really happening and that he was in there for a session this particularly even and still not nothing's happening and that made their recordings and things but it's going nowhere [noise]\nThey had a fellow named Scott anymore playing guitar fellow named bill\nOn stand up vase\nAnd so they took they took a break to try to put things together so this young man started ... a little bit on his guitar silly around so [noise]\nSo ah [noise] ah Scotty more jumped in the bill Blass jumped in\nScotty more jumped in the ... jumped in and so therefore I Am a fellow named and did all the studios named Sam Perkins [noise]\nAnd ah he term and does his microphone on just like like Austin does to talk to me from a controller so what are you guys doing\nJoan enough and you know we're nowhere where we're just we're just messing around and say I'm Perkins says well you know whatever\nThe adorn finally be getting play it again because I Want to get it on tape\nWasn't the beginning\nOf a ... a fellow named Elvis Presley and so they're playing this thing\nAnd and Scotty more leans over to build black I said you know of this stuff gets so we'll be laughed right out in ... who's laughing now so this is the first saw that all of us ever recorded that was released as a recording and when I Do it with a little medley\nWith another Elvis song which was made popular fellow named Carl Perkins no relation to Sanford and that song is called blue sway children a little medley of those two solitary go [noise]\n\n\n\n\nDa\nLot of our don't stuck on my below swayed shoes please don't allow right moving right along Nineteen Seventy three\nDollar named Jim Crow ... very popular oddest late sixties early seventies\nGet a big big hit song\nUnfortunately\nHe did not live long enough to read all the benefits from it because in that same year the train gets ... died in a plane crash but the salt will always be associated with the Jim\nCrow cheat just bought a real bad dude out of Chicago named Leo ... hour\nOh ... what a bad cat he was yeah it was getting ... down towards the end of our time here today in the\nLast two years probably one of the most I conduct rock and roll songs out of that whole era [noise] and it was originally a quarter by a group called the created Clearwater revival\nIn Nineteen sixty nine and a young lady in Nineteen Seventy name Tina Turner\nDid her version of it actually became an almost his signature\nSong for Tina Turner and most most people are a lot of people anywhere they think of proud marry they think of teen or they don't realize that there is just to cover [noise] but I met Tina Turner launch a we had a neighbor who had a brother who had a small amused\nBut I met Tina Turner once we had a neighbor who had a brother who had a small amusement park\nAnd he brought I continue to turn it in a to door concert in the actor so if we wanted to go with you I'm sure why not so after the show we're backstage and were chatting with Arctic which was a very forgetful experience thank you and a soldier standing\nThere all of a sudden this small little person comes up and stand beside me and you know with with with the little group of Russian I looked out okay All right and I looked good and it was Tina\n[noise]\nNo they\nThey made one day they\nNa na na na na na na\nNa na na na na\nThey\n\nThey [noise] na\nNa na na na na na na na\nNa na na\n\nWhen you call me on the line I don't know about the no no no we\nHave a ... mile a mile\nI won't be coming around I get\nTo know the thing it's\nWell they come around I guess\nThe thing is ready to go and they will oh for\nThe man I Know you've got to know what maybe\nYou know never be\n\n[noise] when we bombed\n\nDon't know what\nLast\nThree\nDa\nDa dum la la la la\n\n\n\n[noise] [noise]\n[noise]\nAnd [noise]\n\nDo is uh\n\n\nOr he or she won't eat them ...\nComes with a double ... news children's author and Nico Denise paid a visit to an unlikely story to read her new book white secure more carbon we spoke with her to find out more about ... and so\nMy second time visiting an unlikely story on and I'm here to\nMy second book in a series called starring Carmen this book is called lights camera\nUm it's about a little girl\nTo learn how to share the spotlight\nHas a lot of energy and creativity\nWhom she um\nThat through she has trouble sharing the spotlight\nLoosely based on my own family and my own\nSo today we're just going to read the book and\nTake questions do some crafts\nToday's the official release day of life camera Carmen on came out with ... books\nOn the first one came at a year ago so this is\nUm an unlikely story has wonderful kids programs and um they have a following kids that love to read that come in at enjoy meeting authors and if you look at their author roster of events just always fantastic\nWe just love it and we love supporting um local\nWe just love it and we love supporting um local\nIndependent bookstores and this one is one of the best in our area and\nSo not too far away um we come and shop here and we've come to the author is here I have three daughters um my husband's a children's book illustrator so children's books are in our family and we we just love\nWe love this community it's a really it's more than just a bookstore or it's a community of readers\nSo I started out as a copywriter\nAdvertising believe it or not and I met my husband who illustrate a children's books he'd been you went to Rhode Island school of design\nIn writing but not necessarily\nUm but the great thing about copy writing which makes it a little bit similar to picture books is you have to learn how to condense a story into fewer word so you have to understand\nI'm an economy of language of um\nLike a very tight beginning middle and end which wasn't that\nCopier writing storytelling that I was doing so I decided I Would try to\nSee if I could do it to write for kids um and my husband gave me a lot of\nHe started drying and I started writing and we work together and eventually came up with a story which was our first\nWhich was um pigs love potatoes [laughter]\nSo nice little young counting books um and we showed that to his longtime editor and she liked it and that became my first published children's books\nThen after that I\nGot involved in the children's community and\nMy own children so I was reading a lot of children's books and I just fell in love with it my one of my favorite ways of telling stories um I Love the combination\nAnd one of my favorite way of telling stories um I like the kind\nStory I\nEver that's what I think I never had\nThat done for today's updating can watch all over contents by visiting our website to doubling the dot com by downloading ... mobile lap or by visiting that I Believe the U.S ... channel for doubling CBS News in Washington ... [noise]\nGreetings will have quiet conditions tonight more of the same with mostly cloudy skies but essentially dry lows in the mid fifties not much of a change in temperature lately however tomorrow there will be a change will have clouds to start and then suddenly clouds in the afternoon breezy wins out of the southwest\nYou know what that means warmer highs and the low in mid seventies for a short time tomorrow afternoon only falling back to the mid sixties tomorrow night getting a little humid and then warm and humid for mid October standards as we get into Wednesday or high on the upper seventies might even briefly notch eighty\nAnd then we'll have showers perhaps if you downpours as we go through the day on Thursday a front from the west quite humid and also we'll be monitoring Michael\nAs an entity it could come close to New England probably saying to ourselves but it'll add some juice to the situation Thursday Afternoon into friday early indications are all dry out friday night and turn cooler for Thirteen twenty am W. A. R. A. I'm Jim ...\nThe national diversity graduate fair will take place on October thirteenth from three PM to six PM at Rhode Island colleges Murray's center attendees can speak with graduate admissions representatives from local and national colleges and universities\nThey all have the opportunity to learn more about admission requirements application deadlines financial aid opportunities and more the fairest\nApplication deadlines financial aid opportunities and more the fear is free and open to those considering graduate school those wishing to agenda ... to register by visiting diversity college fairs dot com [noise]\nHello my name is Gretchen Robin and this was a program called we have to talk and today I have this very special guest and I want to introduce you Todd Kobus\nWelcome [laughter] when you were running for the city council you came in a knock down our door and we invited you when we get to know you and while those what a great person [laughter] for the city council I thought um\nAnd you are now nine months into\nYou know with ... I still very much for like a political newcomer so I appreciate this opportunity to go on here and I introduced myself a little bit\nWell I one of the things we did I Want to do for a long time to talk about leadership leadership in general not you know specifics 'cause there's there is something that we can learn there that will make us better meter is whether it's in our families or\nIn our community or you know\nAt our church or whatever um that are followers to 'em so you know there's some skills to some knowledge that goes with it and I thought you when you're three deployments to Iraq\nAnd only two ... went to Afghanistan one term Iraq\nAnd went to Afghanistan and how old are your kids then\nThey weren't around when I was in Iraq and um\nBut then my oldest was\nThey weren't around when I was in Iraq in um\nBut then my oldest was four when I was over in Afghanistan and uh it is interesting so I I left him at home with mom for ... for about a year and when she potty trained them and\n[laughter] it was a little piece of is yeah his childhood I bought you sell thank you had to do you go and serve the country\nIt was really a choice necessarily um I I definitely felt obligated to re enlist time and again it and\nLook at my military service and my decision to join the Army National guard as one of the the best decisions I've made my life for them it's it's taught me a lot and it's in the Army National guard is just the you know the one weekend about two weeks during the summer it's sort of thing\nIn Philly we wait for Eighteen months to go to Iraq or a year to go to Afghanistan and all of that but normally it's it's a part time thing um and it's really fascinating to sort of be working at a civilian job as a as a as a software guy and then about the way to go\nBe an intelligence analyst and have meetings with all sorts of interesting people\nDirections you [laughter] and nor Mrs lay their two completely different world\nThan a but it's also I I'm very proud of of that survey that I've done it and I I I met my wife and the army and like the joke that you learn how to drive in Iraq [laughter] was she in the army\nShe is she wasn't she she was over in Iraq with us\nYou know should understand no absolute absolutely are very much so um [noise]\nYou you have um a wonderful Facebook page and and I seen taking your oldest son to climb mount Washington\nAnd and I seen taking your oldest son\nTo climb mount Washington ... ... you know so I Would say that's a that's an example the family leadership\nOkay you know you and your wife lead your family you're near a natural leaders in that role one parent um all kinds of leadership though I'm Talking about a far Italian leadership and authoritative leadership\nInto that respect is is I think ... incredibly important so when this\nMarijuana issue was being heard in disgust before the full counsel for the final vote [laughter] um\nI was getting messages up into the day before and the day of saying if if this passes in this way that you know will veto it with if if you restrict it to five I'm\nI'm like I ... I I Want this to pass in in I think it's in the way that I prefer to see it but I knew some of the other counsellors were concerned about the the zoning aspects of it\nSo I stayed up late Wednesday night put together an amendment that there was a fairly long set of amendments to change it from\nBeing zones in the retail aspects of but don't use ...\nBeing zones in the retail aspects of adult use marijuana so to general business to restrict everything to industrial zones in I very much disagreed with that amendment\nBut I felt my fellow counselors would have made that amendment and actually on the day of three of them had said that they were you know feverishly scribbling notes to try to make that amendment so\nWe're starting to think of like you know how can we solve this kind of impasse that would seem to be developing\nWell and I disagreed with the amendment but I felt it was only fair in respectful to my fellow counselors to give them an opportunity to have the discussion on the couch so for me to give their ideas or chess I'm In it and I feel that is what democracy sort of all about um\nI disagree with it I made the amendment I argued my point that gets it and ultimately I lost and everything has been restricted to industrial zones\nNow for now are for this which is a brand new in the city and in the state and so\nWhy not give it a try like an experiment and then later on it can be change when people like more than they already with it I mean I'm I'm a raging liberal so [laughter] but I mean I can see the benefits of a compromise\nIt I did too and I was very proud of it because after that change it it I May of ... I didn't get what I wanted but ultimately the overall ordinance change passed unanimously and I was very happy that that we sort of putting together that\nMatter um in that and you have been a little bit or indirect effect on other is that you were in can\nPush and being noxious that you were going to continue to respect them\nPush and be of noxious that you were going to continue to respect them even though you\nDisagree and I could have tried to play games and ...\nIf an amendment was made and it was a perfect I could've been tack that aspect of it as opposed to discussing the ideas are based on the merits of the ideas from home so I thought that was important it was one of\nIt is the the one moment that I'm most proud of and so far not not necessarily passing the the ordinance itself but the way the Calderon other than work together ...\nSo what are the qualities that a person needs when they have to change their their mind or cooperate or collaborate in order to get a good decision\nWhy I've no idea [laughter]\nWhat are the I mean I I come from a ministerial background and so\nI'm thinking you have to have a certain humility I agree\nI very much agree I I think you know we can come in and say I know all the answers and I'm right and you're walking in and you know that leads to what we have in Washington [laughter] now and and um you know the authoritarian mentality down there\nThat everybody that disagrees should just roll over and play dead\nIs is poison I mean I think that's why\nCity councils are great because we have to live with each other you know you\nHave to go there on the trees are going to see\nEach other and and by you or compromising or being flexible then next time there's something they want you know there may be more give and take\nOr at least the merits of the ideas right will will with two guys are\nA nation given to different viewpoints than they were all\nI don't mean this in terms of personality is on the city council I mean general and how we get along\nHe is on the city council I mean general and how we get along\nI in that comes with the middle humility they like you said yeah yeah it's ... it's incredibly important yeah um I could use more of it but [laughter]\nIf you ask my wife [laughter]\n[noise] um but ... it's\nNot sure if she has ways of telling you that certainly in our spouses that me and my spouse\nMy husband is is is it might get desk guy didn't just about everything I Do you mean 'cause I Know he he sold fair and he's so kind and he knows how to put these things in the gentlest way\nAnd I don't get my feelings hurt and they don't come I backed out um but I Do come to that place of humility because of the respect that we share for one another\nIt's common set of values [laughter] it is\nYou talked about the the army values of loyalty duty respect\nLoyalty Judy respect\nThe fourth one is self uh self with service which is selfless\nService so which isn't giving over of yourself to a greater benefits and then we'll come to us he will benefit others and we may not get any benefit from\nIt looking at the overall benefit as opposed to any personal gain is um\nWhat's the best thing for our as a community that you know the question that a lot of leaders would ask themselves\nAnd there was at one point or a friend of mine has suggested oh why don't you go to this event or or do this in the there'll be great come reelection time to to show your ... and I told I was like don't ever make that argument with the like\nAnd I I told I was like don't ever make that argument with the like what's what's the\nIt has to have any meaning for you\nAnd you went to a um a veterans a event wasn't it\nA few of them yes ... and that means a lot to me personally\nIt anymore and he said you said one of them you will each you'll take your son to next time I was so beautifully done and it was such a beautiful program\nThat was the POW nine eleven event that was incredibly touching [laughter] um yeah and and I feel bad that I didn't bring them this time there was\nAnother time [laughter]\nBut I mean I think you know one of the things I like watching the show is I get introduced to people I wouldn't otherwise get to know and I get to reach me sent them to the public um and and the benefits of working in the city council is you find some amazing people\n[noise] it's it's really a\nIn an interesting group of people and it's been fascinating to get to know each of them individually as well as the multitude of people within the community that I wouldn't have met normally I mean I wouldn't have knocked on your door if it was it was a ... it's it's great and it's\nIt's personally very touching to me to to be the that much more involved in that community has set the example for my kids right right um it's super excited my my son Jake ended up running for ...\n... Facebook page [laughter]\nAnd he won in ... and it was I was so proud of both for just having the the nerve to\nAbout that yeah we have to be bold and he might as well learn that now I I\nLike people and he might have to learn that now I I loved it it was so proud of them not not necessarily not for winning book for having put himself out there and it's great to be fair it never happens to me\nThis week on double east yes one of the Massachusetts gaming commissioner Gil cameras resent the keynote address a United regional chamber of commerce this woman's expo Gail spoke about her experience leadership roles and what it takes to achieve change you can watch this program and all of our quality programs around the area in high definition on the double ACS mobile out\n\nWhen you call me on the\nHave I'm reading a found some I\nDon't want to be coming around and\nGetting to know when it's really who they will open\nI Know you've got me\nMe\n\nNa\n...\nIn there you can pay\n... the only thing\nDrink deep sleep do\nGet them to\nThe\nI Know that\nNo no\n...\n\nYou\nKnow she and\nDry leaves me no the the man ...\n... ... ... ... ...\n... to ... million now see you know what ...\n\nWhat the deal\nWell I\nWould say you were in the ... the drugs the\nWindows up good out of the ... the ... the\nThe ah to the good side of\nIt but\nI take you just no way\n\nDo is write him a\nDon't change the color of your\nDon't why\nI just want some more\n\nNeed to know them soon will always be the\nSame all someone that a\nOh what where things out your\nLead in the\n...\nHe and he\n... the man\n... dramas\nYou\n[noise]\n\nI'd\nDo without a job but the thing is\nThat the law you know the ...\nJust one more\n... than to\nKnow why don't you ...\n\n\n\n... ...\nHow deep\n\nYou're listening to W. A. R. S. Thirteen twenty I'm ... [noise]\nWelcome to the WTO daily news children's author and Nico Denise paid a visit to an unlikely story to read her new book why care more carbon we spoke with her to find out more about your person fisherman so\nMy second time visiting an unlikely story and I'm here to\nMy second book in a series called starring Carmen this book is called lake camera\nUm it's about a little girl\nTo learn how to share the spotlight um who\nHas a lot of energy and creativity\nLot of energy and creativity\nWhom she um\nThat through she has trouble sharing the spotlight\nLoosely based on my own family and my own\nSo today we're just going to read the book and\nTake questions do some crafts\nToday the official release day of lights camera Carmen um came out with a bronze books\nOn the first one came out a year ago so this is supposed to\nUm an unlikely story has wonderful kids programs and um they have a following kids that love to read that come in at enjoy meeting authors and if you look at their author roster of events just always fantastic\nWe just love it and we love supporting um local\nIndependent bookstores and this one is one of the best in our area and\nSo not too far away um we come and shop here and we've come to see author is here I have three daughters um my husband's a children's book illustrator so children's books are in our family and we we just love\nWe love this community it's a really it's more than just a bookstore is a community of readers\nSo I started out as a copy writer\nAdvertising believe it or not and I met my husband who illustrate a children's books he'd been you went to Rhode Island school of design\nIn writing but not necessarily\nUm but the great thing about copy writing which makes it a little bit similar to picture books is you have to learn how to condense a story into fewer word so you have to understand\nI'm an economy of language of um\nLike a very tight beginning middle and end which wasn't that\nCopy writing storytelling that I was doing so I decided\nCopier writing storytelling that I was feeling so I decided I Would try to\nSee if I could do it to write for cats um and my husband gave me a lot of\nHe started trying and I started writing and we work together and eventually came up with a story which with our first\nWhich was um pigs love potatoes [laughter]\nSo nice little young counting but [noise] um and we showed that to his longtime editor and she liked it and that became my first published children's book\nThen after that I got involved in the children's community and\nMy own children so I was reading a lot of children stocks and I just fell in love with that is my one of my favorite way of telling stories um I Love the combination\nStory um\nEver that's what I've been doing ever since\nThat day for today's updating can watch all over contents by visiting our website to double easiest dot com by downloading ... visiting the noble ACS Roku channel for double easiest news from Austin rocket [noise]\nGreetings will have quiet conditions tonight more the same with mostly cloudy skies but essentially dry ... in the mid fifties not much of a change in temperature legally\nHowever tomorrow there will be a change will have clouds to start and then something clouds in the afternoon ... wins out of the southwest you know what that means warmer eyes are the lowest bid seventies we're short time tomorrow afternoon always falling back to the mid sixties tomorrow not getting a little humid\nAnd then warm and humid for mid October standards as we get into Wednesday or high on the upper seventies might even briefly nudge eighty\nAnd then we'll have showers perhaps if you downpours\nMight even briefly nudge eighty and then we'll have showers perhaps if you downpours as we go through the day on Thursday a front from the west quite humid and also we'll be monitoring Michael\nAs an entity it could come close to New England probably saying to ourselves but it'll add some juice to the situation Thursday Afternoon into friday early indications are all dry out friday night and turn cooler for Thirteen twenty am W. A. R. A. I'm Jim Gordon\nIn order to accommodate working parents and school times and unlikely story in plain veil hostess Sunday story time on the first Sunday of every month story time consists of a half hour of stories songs and a simple craft and his recommended for ages two to six but all story lovers are welcome\nRegistration will open one week before only children need to register the next story time will take place on Sunday October seventh at eleven AM and run until eleven thirty to register for the event you can visit their website and unlikely story dot com [noise]\n\nWelcome to episode one of exploring mental illness everything you wanted to know but were afraid to ask ... community relations coordinator at their hospital and out of our Massachusetts and with me is\nDark mall hand and I am a sufferer of mental illness and I'm trying to be here to try to break some stigmas that go along with it so Kerry um what are we trying to where we trying to do with this podcast year\nDerek I really feel that this pie cast is meant to make individuals aware of mental health and mental illness in our communities to break stigma to educate 'em as somebody\nCommunities to break stigma to educate 'em as somebody who has a background\nA dairy diverse background a mental health um I can say that education outreach and community outreach are so important to the care and the continuity of care for individuals who are suffering from mental illness so I think we just really want it to get the word out there\nSo I'm for people who don't know us when we do a little bit of a background of ... you know nothing to wiping show 'em what brought you into this field\nTerry so I actually started off on with a desire to be an art therapist\nBecause I had a passion for our and I had a passion for psychology um when I went to college I did my major to art in psychology and just figured you know what I'll see her life takes me and I had the absolute blessing of having my first job working for a a clubhouse model and hope deal math\nAnd I worked with the chronically mentally ill population but even beyond that there is there's a deeper passion that I have for the population besides the experiences\nThat I've had working with these individuals my father my father is he diagnosed or individual with bipolar disorder and I seen him struggle throughout my entire life\nAnd I've always had this soft spot in my heart\nFor it in a perspective of mental illness is not just your label mental illness is just an aspect of you so from the outside world someone may see for instance my father and say that so and so that's where he has bipolar disorder\nBut I always knew him as dad that's my dad and he just happens that bipolar disorder that I strongly feel influenced my passion for understanding I got the human mind\nMy passion for understanding I got the human mind focusing on psychology and then leading into I'm leading to working with individuals with chronic mental health disorders\nAs I said in this field in Massachusetts for about five years\nAnd then decided to make a life leap I moved down to Pennsylvania and I had the opportunity to work with a very different population and I've worked with individuals with intellectual disabilities and challenging behaviors as well as kind of mental health disorders it gave me a very different aspect\nOf Human Services in health care [noise]\nUm I was a a case manager for\nThe majority of my time at the campus facility\nThat I had the opportunity to make a leap and moving more towards the\nAdmissions outrage community outreach marketing piece of the field which is quite a different step right to go from case management to marketing how does that work I offered him very unique and different aspect\nTo the role I had the opportunity if he truly both sides of or all sides of health care one of my things is often that facilities organizations or in the business of providing care\nOkay well come back we're going to have carry introduce our first guest who she knows a very well here it for a hospital\nAnd you'd like to welcome Rachel ... the el at full or hospital a two hour first pot cast\nAnd a ritual to start off how about a little bit about your background and the mental health field\nUm thanks for having me appreciate being here I'm a licensed social worker by trade 'em I've spent the last Thirty years of my career\nI'm serving behavior of clients in both a macro legislative work as well as micro doing clinical work with very high risk population so algae Beatty kids um and then sexual assault survivors and then lastly behavioral health patients in a psychiatric Hedy so I started in the psyche D's\nAnd fell in love with a behavioral health patience um primarily psychotic patients who are who I really enjoy working with\nHere at full or I think one of the most rewarding things about everything I've done is looking at how do we take a patient when they first arrive and then what are they looked like when they leave 'em and we create an environment where they can heal and access resources I mean that that is the bottom line of what we do here every day\nAnd um what is the biggest misconceptions about mental health care facilities\nUm I think there's so many but I guess the first I'd say is kind of the outdated view that were an institution and it's an institutionalized feel I think the great thing about four hospitals is actually used to be a family mansion back in the day and I was a community family here and so the old horse stables are actually a patient unit every single patience\nSo the old horse stables are actually a patient unit every single patients' rooms have windows but I think the truth is is that we are here to deliver compassionate care\nBy license clinicians and psychiatrists we're here to do good work and so we spend our days\nGo into groups and I'm Talking to physicians and doing therapeutic interventions mean that that's I think not a perception of people are sitting around medicated and not receiving services and not getting engaged and that couldn't be further from the truth\nNow is one person or on my own I've been trying to break the stigma of mental illness by becoming very open a talking about a very openly not being embarrassed about it I Know why breaking the stigma of mental illnesses saw him on why do you think it's so important and why is it so hard to do\nYou know I think the misconceptions exist about mental health um and it's rampant in our community because of the taboos what people believe I think it goes back to the institutional comments I just made\n'em but the truth is the vast majority of us us ourselves have a family member or friend who suffers from mental illness or substance abuse and so the truth is when we realized that it touches many many people in our lives and across all demographics\nUm socioeconomic genders race\nWhen we start to look at it and the impact that it has then I think people like you are opening people's eyes that that it does it impacts all of us I mean\nI have people who work for me or some of the most amazing employees I have who have mental illness and carry a diagnosis and they're productive and engaged and compassionate and I would say they even bring an added level of care\nUm to our patients because they understand\nOn what it's like to live in those shoes I think the disease impacts a massive amount of the people in our community in this facility works to treat those people in a compassionate patient centered way um and we also serve as a beacon in our community for those who are in\nThe compassionate patient centered way um we also serve as a beacon in our community for those who are in need or who seek help to say we're here walk in our front door you know let us assess let us off or resources are carrying it a couple of questions I did [noise]\nRachel how do you think gender plays a role in mental illness I think that's an interesting concept because um and when we look at gender and societies impact on gender um we have all kinds of conceptions about how men and or women should behave and so\nThose social contracts of gender we we actually makeup and so what we believe about gender today is not how people perceive gender fifty one hundred a hundred and fifty years ago or in different countries for that matter the truth is that impacts both men and women um but in some ways\nThe way it impacts can be different we have different expectations on how ... we we set those expectations I'm an act like we know how many should be um and when they act less than that we call them weak or other more inappropriate names\nSo it makes it harder for men to seek treatment and so we see 'em for depression and anxiety less men receiving treatment for depression anxiety you see more women receiving treatment and so it's our job at this facility with the help of people like Derek to say\nThis is an impact across the board because people experienced trauma um similarly and so how do we set the stage for a man to be able to walk in and say I\nNeed assistance with some of the stuff but also to honor that the vast majority of women have trauma histories and so how do we also create a facility and a team enter treatment team in physicians who are able to accept\nUm sexual assault survivors into this facility and treat them in a way that allows them to heal I think it's also important we were talking about gender to acknowledge that transgender gender community and so this facility is ...\nSo important we are talking about gender to acknowledge that transgender gender community and so this facility has worked really hard\nTo make sure not only we abide by state statute and abide by hate crimes but that we worked diligently to create a facility that accepts all people period until whatever that looks like man woman transgender patient who comes in here and can be expected to be treated\nAlong with best practice to not be re traumatized by coming into a facility that doesn't know how to engage all patience with a quality and respect and dignity\nCan you give us an example or even a story of of of something that you've seen where you have been able to address the gender roles this gender issue within a mental health facility or setting\nThem I think I'd go back to um the trans community and I think it has been practice that I'm trans clients are trends patients will be put in single room so we'll have separate and apart bathrooms I think certainly history has told us um that separate is not equal\nAnd so we've worked diligently here to honor someone's known gender and so we have a trans man who comes in um we're putting him with a male roommates access to the male haul 'em as well as access to mail bathrooms and so\nWe frequently will get pushback around that and say what about the other clients\nBut the truth is we navigate this every single day and a vast majority of different circumstances so people who are struggling with race issues and men and may make racial comments we appropriately placed patients in rooms where they're going to have the most success and sometimes with some of those around\nAnd that's the way it goes but setting the stage for every single person who comes in here to be treated with dignity\nTo honor their identity um honor the work that they need to do and create a healing space for them in fact to do that and we can't do that um if we set the stage from hello\nAnd we can't do that um if we set the stage from hello that we're not doing the right thing and not honoring who that human is and so I think it fall are we done an exceptional job all the way from ... to honoring people's preferred names um and how does that look\nAnd how do we set the stage on a unit for that to be carry through from beginning to end from admission from the very first time you walk into this facility to the day you leave an every single staff is on the same\nPage about what my expectations are of my staff about how we treat patients on but also studying the stage across the board for other patients who are on the you know who may struggle who may not have information who may not have knowledge about that I'm In a way that's appropriate in confidential but again honors that individual patient\nI have I have a follow up to that um how tough has a learning curve been with the transgender problems that the you know but you face here at the hospital right now I'm you know I mean I honestly I think\nThe learning curve is ongoing and I think it will be because you know I've done eligibility trainings\nFor hospital systems for schools for H R departments for Twenty years\nAnd honestly the training is I did Twenty years ago or a super different than the training I Do today because language changes um expectations change statute and legislation changes\nUm and the truth is more often than not it's the adolescent population of the gay lesbian by trans kids who kind of drive and push forward some progress so the language isn't the same as Twenty years ago and so\nThe learning curve is ever present quite honestly\nHowever I Will say that the best practices we put in place here\nKind of set the stage for expectations so we have a policy on how we engage and treat trends patients that addresses language pronoun use name use 'em while we can't change a healthcare card or a medical record that doesn't mean that we can't honor someone's name\nChange a healthcare card or a medical record that doesn't mean that we can't honor someone's name restroom room designation in a way that meets what their gender is so it's ever changing and were up for the task and I think we do it better than most quite honestly\nI think that it's been practice I'm not best practice but practice for a while for trans patience to be placed in single rooms and have access to single bathrooms\nI think all the legislation around that particular that have come from students and parents\nI'm litigating with schools shows that that's not an acceptable practice and so\nTrans kid or in fact now a trans patient shouldn't have to go use quote the principles bathroom or the nurses bathroom or be taken off the unit or be put in a single room now might not be an occasion when a transportation is appropriate there's lots of reasons is appropriate to put any patient in a single room for a vast majority of reasons\nHowever we should come from the place of we're honoring the gender of which they come in and identify as the name the pronoun and we move forward accordingly and it's quite honestly that simple\nPeople in on they're already in crisis right now no one is coming to flourish front door um because they're having a good day\nAnd so we need to be prepared literally from my front that staff through the nurses says hello while they walk on the unit to the first mental health worker they engage with all of those people to be here and holding and compassionate and engaged in full of information in creating a place that feels safe\nBecause that's that's the first step if you don't feel safe you're not going to you have no ability to work on anything and you're not healing um first and foremost the feel safe can we reduce anxiety to a place that you can start thinking about what are what are the things that I actively need to work on to feel better\nFunny you said talking about coming out because I was I'd um I had told Kerry it'll be five years in February that I came out on Facebook about my struggles with mental illness for the past Twenty years at that time\nAnd I got you know like two or three hundred likes I had all these private messages and I said I appreciate\nYou know what you folks but I didn't do it for like ... I didn't do it for I just want to let people know my car can only breakdown so times I kept lying you know I lost jobs lost friends I lost it was like a huge weight lifted off my shoulders\nBut then I got a lot of private messages about fifty to sixty private messages you know what I suffer from the same thing right so unfortunately but fortunately I was kind of an expert at the time on what they were going through\nSo now they would call me at midnight or one or two or three in the morning to him having an anxiety attack okay calmed down it's going to be okay I'm In coming out on Facebook you know that was\nThat was my big thing like I said it was a huge weight lifted off my shoulder and there was no blowed everybody's like proud of you you know and I knew some people knew but I don't think they knew to what degree in how bad it was\nAnd doing that you know people\nMurray and how bad it was and doing that you know people you know they check out hey how you doing haven't seen a baseball can awhile haven't heard from your while I'm having a tough time so like I said you know I just want in my life back\nThat was the biggest thing so I don't I don't understand why you know I I you know from when you said before you get called names and stuff like that but if you've got friends and you've got a great support system\nThey're not going to hold it against you got and granted I lost some friends but most of my friends when I came out and I told them what I was suffering from they did research on it so they could try to help me\nRight have a more engaged conversation\nRight they would go on the Internet and they just wouldn't say oh it's an excuse is it's an excuse he's using his\nHis anxiety depression and his panic as an excuse well no I'm not and if you've seen the hard work I've done over the past twenty five years you'll know I don't use it as an excuse\nI use breaking down my cars and excuse to cover up my mental illness don't cover it up anymore I wear like a badge I own it but it doesn't define who you know who I Am anymore\nYou know that was part of the reason so I I live in this community right I used to live six minutes down the road and I would drive by the hospitals consistently and actually only knew of this hospital because I also random behavioral health\nUm facilities in Rhode Island and so when I first got hired here I thought you know that that's my local grocery store next door um this is the main thoroughfare\nMore people need to understand what the White House on the hill is because when we start to understand that fuller is integrated in this community people who live and work here I'm living this community and so\nWhen Kerry came on the first thing I ever said to her as I went to community fair on our front lawn\nAnd lo and behold less than half a year later you know she produce four hundred people in fifty um community resource vendors and so and that's where I'm at you in\nThe um community resource vendors\nAnd so and that's where I'm at you and so that that's important right that's how we do this is come on my front lawn meet my staff\nSay hello carnival games for the kids let me show you who we are and what we're about and what we do here so that we can again we're always working to kind of reduced the stigma that you continue to talk about\nBecause the truth is people work at fuller because we are looking to help people make their lives better and people are here because they're struggling there's not anyone in this facility who isn't currently sick and so\nHow do we get them better and part of it is isn't a community fair is things like the semi colon projects so that we started to have some visibility around mental health and so we'll\nHave another community fair this summer we'll continue and invite people into our front doors to tour a facility to come on our front lawn to hang out with us um because the truth is that's the only way to start to break it down\nYou know I had to put us I put a banner out front that says walking welcome because I Want people to know that you can walk into our front door you don't have to make a call you don't have to get a PCP referral you don't have to go to an emergency department\nAnd that doesn't mean you're going to get hospitalized either it means I'm struggling can you help and our answer is always going to be yes what is it you need and how do we make it happen and you know my my staff kind of makes fun of me consistently but what am I saying as we come from a place of yes here\nAnd so can we make it happen the answer is yes can I help that patient the answer is yes can I get you to where you need to go next yes can I make you feel better yes\nAnd what we can't do it alone we can't do without the patients engagement we can't do it all out with a whole team um but the answer is yes we come from a place of yes how can I help yes come in my front door yes come and ask for help yes we will be there to answer\nWhat would you like people to know about fuller aside and you know you don't want people just to think\nTo know about fuller aside and you know you don't want people just think oh that's the house up on the hill with the crazy people go right so your your final thoughts what do you want people to get out of today's a message\nI liked him to see fuller as a resource there are engaged staff there are you know my CFO started here's a housekeeper and never left and he still has his housekeeping shirt on the back of his door\nYou know my director of facilities full or on the entire neighborhood out behind here and ah his mom was a nurse here and he grew up with full of rent and his mom one of those houses and he's never left here I'm that's what ... fuller\nIs a place that has engaged staff who are here saying we want to help we're here to help\nBut this community should know as we should be a resource you know you do not have to go to any do you do not have to go to a clinic you do not have to go to your PCP and it doesn't mean you're going to get hospitalized either we have a partial hospitalization program where you can go for the day I have an intensive outpatient program where you can go three times a day or do half days\nThere are many many options to get you help\n'em that don't necessarily end up an inpatient level of care however we have that if that's where you are as well\nAnd so if people could start to see fuller one is a place that's accessible because that's very important to me um but to as a resource um and even if it's just to go straight to outpatient\nHow do we help you set up that therapist appointment that has just been too hard for you to do on the outside because patients if they could have done it they would have already done it right no one's more committed to a patient's care than the patient themselves and so frequently I find if they could have made something happened they already have\nAnd so how does fuller offered that next step to actually get them that peace will ever whatever it is we should be accessible um and we should come from places yes Rachel I just\nHonestly want to say thank you for your ah participation today hearing you helps\nWant to say thank you for your ah participation today hearing you helps that confirmed the reason why I Know personally I'm here and I work um for this hospital\nYou are a fantastic leader and example in the mental health community and I have seen that firsthand I'm I think that the feedback that you provided today has been very insightful and I'm heartwarming when it comes to moving forward with mental health in our community and wearing his and breaking stigmas\nSo thank you again for joining us today we really appreciate it will appreciate you guys [noise]\nSo we want to thank our ritual legend that was some I'm very informative information that we had here uh today great first guest a great way to start off\nAs someone who will once again who suffers from mental illness who just want to let people know out there that you're not alone that there is help you just need to seek it and if you think there's something not right going on\nA better to be safe than sorry don't wait until you're at the point where there's no coming back from it there's a lot of help out there and and carries got a lot of good information right here right now about what you can do and where you can seek help carry\nThank you there uh and so for those that may live in the Arab are all great out of our community um you may be aware and may not be aware that there is a drop in the center of you're not alone dropping center\nAnd this was a collaborative between for their hospital that about police department and area organizations to offer services and resources to people and the greater out of our community regarding mental health\nAnd substance abuse disorder the you are not alone dropping center a is held the last Wednesday of every month at the bar a Unitarian universal is church at five oh five north\nThe of every month at the bar a unitary universal is church at five oh five north main street here in adult borrow\nFrom five thirty eight PM ah we focus essentially on just trying to get people to help that they need we offer um representatives and information from a tremendous amount of resources in the area\nFrom an inpatient level of care such as fuller to outpatient resources such as South Bay to community groups such as learned to cope\nUm if you like to learn more about the drop in center you can find us on Facebook I'm at a bar a recovery\nUm you can also contact us directly at five oh wait two two two one two one two extension one nine five one\nTo learn more about this shopping center and what would we absolutely welcome anybody in the community uh we do focus on anonymity you're more than welcome to come whether you're a family member or individual who needs help\nYou're listening to W. A. R. E. Thirteen twenty I'm ... [noise]\nWill come to the ... the only news children's author and Nico Denise paid a visit to an unlikely story to read her new book white secure more carbon we spoke with her to find out more about your ... and so\nMy second time visiting an unlikely story on and I'm here to\nMy second book in a series called starring Carmen this book is called lights cameras\nUm it's about a little girl\nTo learn how to share the spotlight um who\nHas a lot of energy and creativity\nWhom she um\nThat through she has trouble sharing the spotlight\nLoosely based on my own family and my own little brother\nThat today we're just going to read the book and\nTake questions do some crafts\nToday the official release day of life camera Carmen on came out with ... book\nOn the first one came out a year ago so this is\nAn unlikely story has wonderful kids programs and um they have a following kids that love to read that come in at enjoy meeting author\nAnd um they have a following kids that love to read that come in and enjoy meeting authors and if you look at their author roster of events just always fantastic\nWe just love it and we love supporting um local\nIndependent bookstores and this one is one of the best in our area and\nSo not too far away um we come and shop here and we've come to see authors here I have three daughters um my husband's a children's book illustrator so children's books are in our family and we we just love\nWe love this community it's a really it's more than just a bookstore is a community of readers\nSo I started out as a copywriter\nAdvertising believe it or not and I met my husband who illustrate a children's books have been so you went to Rhode Island school of design\nIn writing but not necessarily\nUm but the great thing about copy writing which makes it a little bit similar to picture books is you have to learn how to condense a story into fewer words so you have to understand\nI'm an economy of language of um\nLike a very tight beginning middle and end which wasn't that\n... story telling that I was doing so I decided I Would try to\nSee if I could do it to write for kids um and my husband gave me a lot of\nHe started drawing and I started writing and we work together and eventually came up with a story which was our first\nWhich was um pigs love potatoes [laughter]\nSo nice little young counting books\nUm and we showed that to his longtime editor and she liked it and that became my first published\nAnd then after that I got involved in the children's with community and\nGot involved in the community and\nMy own children reading a lot of children back then I just fell in love with my one of my favorite way of telling stories I Love the kind\nStory I'm\nEver that's what I think I never had\nThat done for today's updating can watch all of our contents by visiting our website doubling the dot com by downloading the doubling cs mobile lap or by visiting the double ACS Roku channel for noble easiest news in Washington ... [noise]\nRatings will have quiet conditions tonight more of the same with mostly cloudy skies but essentially dry lows in the mid fifties not much of a change in temperature lately however tomorrow there will be a change will have clouds to start and then suddenly clouds in the afternoon breezy wins out of the southwest\nYou know what that means warmer eyes of the low in mid seventies for a short time tomorrow afternoon only falling back to the mid sixties tomorrow night getting a little humid and then warm and humid for mid October standards as we get into Wednesday or high on the upper seventies might even briefly nudge eighty\nAnd then we'll have showers perhaps a few downpours as we go through the day on Thursday a front from the west quite humid and also we'll be monitoring Michael as an entity it could come close to New England probably saying to ourselves but it'll add some juice to the situation\nThursday Afternoon into friday early indications are all dry out friday night and turn cooler but Thirteen twenty am W. A. R. A. on ...\nOn October thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl ... the role of St John located at two Seventy one north main street in ...\nCarl ... the role of St John located at two Seventy one north main street in Providence\nIs is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guests will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at thirty Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n... ...\n\n...\nThe book bag a new baby\n...\nJob you\nKnow the\nNow now now now now now now\nOh no well no well no no no well\n\n\n[noise] and if you\nRight do not\n\nKnow along\n\n\n\nBut they sell on E. and then they sing much\nSo why do you\nAnd during the da\n\nDa da\nDe\nLa di da da da da da da da da da da\n\nWill go on\nThat too was a\nAnd the ... I mean you know\nThe the\n... the law\nThink it's so funny you say the body\n...\n...\n...\n... ... ...\n... you know\nNew young by ...\nThe\n\nNa\nDa da\n\n\nDa na\n", "year": "2018", "show_name": "no_show", "city": "Attleboro", "day": "08"}