{"month": "10", "state": "MA", "station": "WARA", "content": "\n\n\n\n[noise] [noise]\nTo fall to ...\nWould you please ...\n...\n... where in New\n\nYou know ...\n...\n... where do you\nDo\nYou're the first you're listening to W. A. R. S. Thirteen twenty am apple borrow\nA\nYoung man man a man gets a very long time to\nRead what they are man made a ...\nOr ...\n\n...\n\n...\nWell\n\n\n\n\nWell ... ... ... ... and\nNo\nIt was a lot\nNo no you\n\n\nA wall oh no no\nIn getting new\nDo it but the last\nI have done this fall when they must know\n\n... ... ... ...\n... ... ... ...\n... this um\nOr\nBook a call\n...\n... ... ... ...\n... will be ...\nOr ...\n... or ... [noise]\nYou know the deal that would be\nJumped on me you can't\nVote on the job\nJust so bad\nJust to show\nAre these the doctor and these are gone\nThey do the cooking\nBy John thing you need a big\nHis mom and\nThem go\n\nTo\nThe\nAnd this time there was a\nNineteen voting for just a three ...\nAnd how long will\nThe news that you know what to\nDay and she was saying when she\nThe\nOne\nMy\nHe was\n\n... so\nYou didn't want it is\nIs so\n\n\n\n\nRight thing to say\nTo really the guy was on that way\nTo the charm though the\nUm [noise]\nI Know\nAnd then then there's no new\nSpending on when they do\nOnce I came down to this virus or you\nUm to this wire or you\nKnow God he's your father to\nNo one can say give\nA long way\nMany rooms in the hell\nKnows\nWhat they want to chew gum alone\n\nMay do come around any\n\nThese\nIn ah in my head that nobody else in the [noise]\n\n\nIn a row the rule out any\nYou can hold on me\n\n[noise]\n\n[noise]\nAh\n\nUh [noise]\nNa\nNa na to those ...\n\n\n... as a\n\n\nUh [noise]\n\nI'm In the day that he ...\nWould just na\n\nNa na\nNa na\nUh\n\nYou\n\n...\n...\n...\nNa\nNa\n\nNa na\n\n\n... ...\n\nNa\nNa na na na\nNa\nNa\nNa na\n\nNa\n[laughter] and and\nAnd and and and and and and and and and\nAnd and and [laughter] and\nAnd and and the and and\n\nThere's two things are no ... she was here for ... and you\nKnow little gr drop by\nAnd I'm\nSure you did not close my\nDogs are good\nHall but most who will\nGets ... no\nFish the to the ...\nSweets there the\nTo the book\nRecord the\n\nRuben man drove reverberate hurdles\nYou're listening to W. A. R. S. Thirteen twenty am apple borrow\n... ... ... ... happened\nHow we\nWill have to be\nThey were like wow All right well what about what they did well Jesus wow you know we're\nAll with the fact that they have the\nAt the\nIn the ... and when you're doing\nWell well well when I was about well gee I didn't know about what\nYou do\nFor that but then\n\n[noise]\n[noise]\n[noise]\n[noise]\nBe\n\n\n\n\n[noise]\n[noise]\nThis\nTo\nGo with that that may be [noise]\nThe thing that\nWill be\n\n... ... ... ... ...\nYou know I\nNa\nDa\n\nAnd\n\n\nDa da\nJanet ...\nJana ...\n[noise]\n[noise] [noise]\n[noise] [noise]\nKnow men so you got\nYou know\nOn and you saw\n\nAnd\n... ... ... ... ... ... ... ... ... ... ...\nYou know much more than a\nHobby and your car and he should know much more than a\n... by ... I can be yeah\nOh yeah ... ... and bring the new on a airline news\nAgain and ready to do for a ... everyone knows I'm\nNo ... no lie\nYour rainy\nYou\nKnow what can I read the\n... ...\n... ... ...\n... a\n... ...\nIn the news business ...\nBut do\nYou do and maybe a long\nThat and then\nThings were done this either they\nIn the day\nDay when I read\nTime than ... than they are not\n... but then\nDa da da da\nDa de\nDa na na na na\n\nNa ...\nWho's the\nBut then that I read today I mean\nCome on man during the day\nAnd then\n\n\n\n\nAnd\n\nUm he ...\nNews ...\nOur own assumed\nYeah that that\nOh\n...\nTrips didn't move 'em\nTeach me how to\nYour little ...\nYou know ...\nCan be ... ...\nDon't remember\n\n... ... ... ...\n...\n... ...\n... ... ... ... ...\nWell ... ... ... ... ... ...\n... ...\n\nBut on the ball\nAnd don't bother\n\nLess\nNa na\n\nI don't know what the man\nIn a\nWill be in ... rather than\nThey are not a\n\nBut he ... and\nNot getting any\nBack I'm a ...\nMac I may well a\nMan of la la la\nI said but rather\nMe ...\n...\nWhat do you what not and that ...\nBe not getting me\nNot back I'm a ...\nNamed a law\nShane ...\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\nOh\nI'm In the region and my last night\n\nThe house\nAnd die on\nMe I'm a stay at home the piece that ran in and then\nThe the ...\nLaw me my ...\n... ... years in my ... my mind that way people die\nSeen the bond that\nNone of them ran then\nThey let\n'em know main nine others\nToo nice there\nAre deep let me know\nAnd you're going to study players make harder oh no\nNo no\nAnd di da\nDa da da da da\nDa da da\nNa na na\nNa na na\nNa na na\nRead in\nDo the the red\nNa na na\nNa\nNa na na\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nPeople receiving\nAll the right to have a real good time\nYou are listening to W. A. R. E. Thirteen twenty am Arab world\n[noise]\n\n\n\n\n\n\n\n[noise]\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nNeeds\nTo\nOther hand in hand I Do not\nThey do but\nGuy\nDa da da da da\nDa\nDa da da\nDa da da da\nDa\nDa da\nDa\nDa da da\n\nKnow five\nTo ... have you\nOn them and being\nDum la da\nNa da da da\nDa da\nDa da da da da\nDa da da da da da da da da da da da da\nDa da da da\nDa da\nI'm\nLegs ... ball on the ground\n\nDon't need you\nKnow did\nRead it that the cold\n\n\n\n\n[noise]\nIt it\nReally\nLaw\nAnd\nNa\n\n\nYou're you're you're\n[noise]\n[noise]\nDa\nDa\n\n\nGuy did\n\n\n\nBut he's been in\nAnd dock in three and\n\nShe China has\nBeen an honor to be\nAnd\nYou know\nWhen you think about it is fun and um she learned\nYear\n\n[noise]\nJudges when\nCouldn't\nDo\nThis do to change the\nBush's me you know there's you know\n\nA huge man\nEarly ... you know they\nJust why\nDo you\n\nHold on to the ...\n[noise]\n\nHold on to\n\nCan give you some really good\n\n\nKnow how oh\nGod\nReally [noise]\nMakes my heart going to\nMy mom was going to\n\n\n[noise]\nYou're listening to W. A. R. S. Thirteen twenty am apple borrow\nBoca\nWill be fine until the national but I'm\nI bet you do in the name was\nBe young men do you mean\nWho's not shy\nOf fun with the band loan me lying\n... S P like she will\n...\nAnd\n\n[laughter]\nFilling in more dominant good toy on this Monday\nDominic has earned a well earned a week away and where he's gone and no one knows but we do know he'll return right here behind these microphones next Monday\nI'm here for the weekend we've got some great gas lined up for you this week and we'll have all the information for you as well news traffic whether meteorologist Jim ... and I believe a traffic specialist Gina brown will be with us today\nAnd uh there's a lot happening and of course the top story is if you watched last night's game the Boston Red Sox are champions once again the red Sox cap off their historic season with the world series championship out in Los Angeles\nTheir sport in Fifteen Years\nYou know the red Sox got only ate his last night but they made them count including a couple of home runs by Steve Pearce\nA last night uh Jay even price who's been much Malaysia and and a very controversial with the red Sox got his Second World series win\nVery controversial with the red Sox got his Second World series win\nAnd uh all was joyous last night in the red Sox clubhouse as they celebrated their world championship in five games over the Los Angeles Dodgers\nLet's take a look at some of the top stories we're following at this hour in the AM Thirteen twenty newsroom north ... firefighters say a small fire that started in the basement of a home at one Eighteen grows street in North ... has caused by a furnace\nThat overheated which bark the blaze no one was hurt in the fire however north ... my personal said the house suffered smoke damage on the first and second floors one resident of the home was treated at the scene for a smoke inhalation no other injuries were reported\nRobots residents of the few items in their town meeting to vote on tonight voters there will decide at the time we'll spend a hundred and eighty thousand dollars to upgrades to the dispatch areas of the public safety building\nIn addition voters will be deciding on a proposed zoning by law which would create a new public utility overlay district\nThe meeting will begin at seven PM at the diet and ... with regional high school for companies have applied for special permits open recreational marijuana businesses in adult over all\nThe businesses Ashley farms actually extracts an Ashley's would operate as cultivation manufacturing and retail facilities\nBristol county wellness center has already received licenses for the cultivation and manufacturing of recreational marijuana\nPublic hearings for the pot businesses are slated at city hall for December fourth in national ...\nOh for December fourth\nIn national news a lion air flight with a hundred and eighty eight people on board crashed into the sea early this morning just minutes after taking off from Indonesia's capital\nThe crash is a blow to the country's aviation safety record Indonesia trans foreign ministry said the bowling seven thirty seven eight hundred plane\nWhich took off from your car to about six twenty in the morning crashed just dirt gene minutes later\nThe flight was headed to pang gal ... an island chain off Sumatra search and rescue vehicles have started a rescue attempt at this hour they're saying no survivors\nAnd thousands flocked to the soldiers and sailors memorial hall for a prayer vigil yesterday honoring the eleven lives of those last of the squirrel hill tree of life synagogue in Pittsburgh\nAuthorities say forty six year old Robert Bauer is charged twangy nine counts\nAgainst him in storming the synagogue an open fire he is currently in custody prosecutors are seeking the death penalty\nMeanwhile the Rhode Island department of environmental management is reported the two people have died one after a wave apparently swept or into the water at Fort whether all state park in Jamestown the other giant jumping into the water to try and savor\nThe two believed to be in a relationship or fishing from the rocks yesterday early morning when officials say a large waves swept the woman into the water the coast guard after a valiant search receipt of found the bodies but they were pronounced dead at the scene\nReceipt of found the bodies but they were pronounced dead at the scene the names of the victims have been withheld so family members can be notified\nResidents of Mansfield will see a big jump in their tax bill starting next year that according to select bend and Finance Committee members\nWho say part of the reason it will be the new thirty five million dollar public works in public safety buildings town manager Kevin ... says estimates are that industrial property would be paying a Levin point seven percent more in taxes next year\nWhile residential and only see a rise of one point zero nine presented the current tax burden split is maintain\nAlthough some estimates put the tax hike for homeowners it's six percent a public hearing on the taxes you in Mansfield has been continued to the boards November seventh meeting\nThe state has announced a forty million dollars in additional funding to cities and towns in the commonwealth they share for road construction and transportation and proven projects\nIncluding just over two hundred and forty two thousand dollars for the city of ... al\nAdel borough has received one point four five seven million dollars for additional road money this year the additional money was signed by governor Charlie Baker in a supplemental budget last week\nIn sports in our top story that you heard moments or gals World Series action Red Sox beat the Los Angeles Dodgers five to one to capture their fourth world series title in Fifteen Years\nIt is Monday morning October twenty nine thousand aging regulation is all Red Sox fans and Red Sox nation\nAnd the New York Yankees fan I Am currently looking up therapists and the yellow pages\nIt hurts yes it's sad [noise]\nBut we will overcome we'll be back next year [laughter] great years breach season hungry and wind [laughter]\nIn that thing [noise]\nOr the red Sox\nComb their fourth world series title in the last Fifteen Years or so uh we just said someone on the line let's go to the phone lines hello you're on W. A. R. A. hello hello you're on the ... gene twenty\nHello it's time for a little bit of traffic hallowed Gina brown good morning\nNice to hear your voice uh we've got some traffic already in Ninety five north on task to Ninety five that says I stop and go traffic there\nNothing unusual courses and on and off construction through the area likely also overnight slowing things down this continues his pockets and heavy traffic up through Mansfield and he is up and then you stop and go through Canton route one nuts\nThe man's feels that he is up and then you stop and go sit Canton rent one not bad just heavy through Norwood around battle of our our looking pretty good on the main thoroughfare getting into Providence it's quiet or there is a pocket of stopped traffic let's see if we had an accident\nAnd this is about halfway between one I'll fix and one twenty three things are pretty slow they're thinking about hanging over that way\nProbably got to take some time to clear so even if it does clear by the time you get there I Do expect residual delays expressed they invented Boston fall and overflowing an extra part of the coming up on the ground with an Thirteen twenty traffic\nAll right thank you very much Gina brown is traffic gets a moving along on this Monday morning commute Iranian Thirteen twenty W. A. R. A. if you just joined us welcome great to have you along stay with us\nJohn ... is on a much burned and a well earned recipes taking the week away and uh\nUh we wish him well and a safe journeys when he'll be back before these microphones\nNext Monday which I Believe is November fifth the day before election day speaking of the elections or they had a a a candidate's night last Thursday night I guess a a well attended and are the candidates kinda\nGave their remarks on their beliefs and what they want to do in office of course with city council you have a John Davis Nick lavoy\nAnd a tie Waterman going at each other for that a spot that Julie hall stepped down so there's an open city councilor large seat\nAnd then of course you have a Julie hall and the current state rep Jim Hawkins I guess they had some uh interesting words for each other that was quite a lively discussion\nI'm a interesting words for each other that was quite a lively discussion\nAnd ah I'm Glad they got a chance to talk and I I think later in the week we are going to have state rep Jim Hawkins in Studio and I would invite any of the other candidates chai Waterman Julie hall I'm Nick lavoy John Davis who was on Thursday of last week with me\nUm so if you want to call and just you know make some remarks about voting or what you believe in what you stand for all week long anytime you want to call then you certainly can we will\nGive you the uh ample air time that you all deserved twenty three after the hour we're at fifty seven degrees in the city of ... looking in some grace guys and rainy in the morning but meteorologist Jim Corman says son's going to poke through later this afternoon\nAnd shouldn't be a relatively nice on them and Jay and then of course tomorrow should be a little bit better\nHill monitor that weather and be calling us or a randomly to give us updates on our weather forecast all year are all week long fiber elites you chew Thirteen twenties the number to call and uh so much other things going on today and uh\nOne of the things that I'm looking forward to is the dedication and ribbon cutting ceremony for the ten mile river boardwalk\nThat's been scheduled for two o'clock that's a week from this Friday and the mayor and other city dignitaries will be there the ceremony will take place near the wall Street Bridge where the boardwalk connects\nOr as you might know the one point three million dollar walk is built on the street banks of the river of the ten mile river as it runs between wall and counties streets and it connects you to\nOf the ten mile river as it runs between wall and county streets and it connects you to a robin's riverfront park and bell for river walk\nWhich in turn connects do a path leading to Larson woods\nAnd mechanics pond offer riverbank road it's quite a scenic area I have seen it just from driving near there and it's really really nice so I Can't wait to get out there and\nTake a walk on this new um this do walk it's a it's going to be ah the ten mile river boardwalk and that's going to be great I'm sure it's going to connect to other walking areas eventually\nIn the city twenty five after the hour of six\nAnd if you want to call up and just a say a Red Sox you know if you want to rub it in our face here with\nThe Yankee fans that's okay too great year for the red Sox you earned it and uh\nYou know I watched a majority of the game's not all of the games because of my regular full time job\nBut uh I watch some of them and you could tell\nA the red Sox there was no nobody they weren't going to stop them you know hitting the pitching you had an altogether the chemistry of the team\nAbsolute a great year for the Boston Red Sox last night as a matter of fact uh I Believe a principal owner John Henry I think had said\nThat in his experience where the red socks that is that group of men are the best Red Sox team in their history absolute best team I don't know I I could debate that maybe I think the uh the\nThousand four team was quite remarkable\nI think the uh the two thousand four team was quite remarkable as well so\nUm anyway you could debate that all day here's some of the gas that will be having this week a little bit later on we're going to have a a Paul Jake's in Studio ... firefighter he's also the legislative agent for the union in Edinburgh\nAt eight o'clock we're gonna have a visit from attorney Brian hatch he is the attorney here in the city of ... that wrote the bylaws for the no compressor raw hold this station\nAnd he was on with us about a year ago we're going to kind of get an update from him as to what's going on in that issue and uh whether the gas companies or you know dealing with what happened up in Andover and north Andover [noise]\nI'm just wondering if that's going to slow down this attempt to bring that compressor station a down around the a C ... the area so he'll be with us so when you have a question for him just give us a call he'll be here\nA tomorrow so far we have recreation ... a director Dennis Walsh or it might be his assistant Tim Kilian here live in the studio\nAre going to be talking about the Halloween parties that occur on Wednesday night for the kids they are always great fun lots to do candy bobbing apples lots of game of very safe environment\nFor the young kids and they take place in to a different areas one of them I Believe is the front bar tech recreation center on ... street and the other one is down in South ... I think at one of the elementary schools but we'll get an update from east\nAnd south adult Pearl I think at one of the elementary schools but we'll get an update from either Dennis Walsh or chin Kilian from the recreation department here in the city of Alvaro there'll be with us tomorrow morning\nAt around eight thirty Wednesday we will actually on Halloween morning we're going to have an actual spiritual which in the studio\nAnd I don't want to get you confused she's not a practicing wiccan which\nBut she is a spiritual practicing which her name is Heather Meyer is and she's been doing this for a number of years she got to talk to us a little bit about what she believes in a little bit about witchcraft shouldn't be an interesting gassed\nOr her name is Heather Myers she is a spiritual which just in time for October thirty first during the morning\nAnd then on Thursday November first we ah we will have Gabrielle Allen with us\nOr she will join us around eight o'clock eight ten and she'll be talking about new hope they're a sexual assault and domestic violence center on ... street some of the things they do some of the programs they have and certainly with all of the\n[laughter] to do it again so anyway by the way this Saturday\nNovember a third of the ... arts museum eighty six park street downtown adult barrel will host it's twenty seven benefit art auction and that's this Saturday on the third the event is one of the museums largest fundraisers of the year and all proceed support it's humidity arts programs exhibitions\nOperations and museums school art classes this year over two hundred donations of art as well as specialty items around the block\nDoors open at five o'clock hors d'oeuvres will be served until six thirty when the live auction starts\nAnd uh uh\nI Believe the a museum director ... I think it's ... faucet ... foster is it\nA she always does a great job with this I'm going to actually try to call her and see if we can get her in here to talk more about that great fundraiser for the museum ... with you on AM Thirteen twenty\nW. A. R. A. it is a\nTwenty minutes before the hour of seven o'clock\nHere on on your local radio station and there's plenty of things going on in the area and uh we'll try to get\nThis some birthday announcements and some other items or if\nWe'll try to get to some birthday announcements and some other items\nOr if you tuned in to hear Dominic he will be back and I thank you for staying with us all week I think we've got some great informational shows and a lot going on live here at this radio station Paul Haley will be on a little bit later today at nine o'clock\nPaul Healy pontificate ing with Paul and the ...\nAnd he's got quite a lively show he always has something to say either about Donald Trump or [noise]\nOr whatever topic or multiple topics he chooses Paul will be here right after nine sometimes he has gifts on and then of course he has his large contingent of textures that to chime in on various topics so you can tune into Paul Healy coming up\nRight after nine o'clock today\nOr we will be hearing from meteorologist Jim ... a little bit later he likes to comprise the latest forecast\nHe gets all the data all over the numbers but what we have for you this far is that we've got some warning drizzle out there and ah\n[noise] ah ... temperatures are around fifty eight degrees\nOr he says ah you know this a gray and overcast condition will move out of the area probably by two three this afternoon we'll see some sunshine maybe high temperatures in the\nUh low sixties and then for tomorrow we'll probably have a little bit similar maybe some sun and clouds or let's go to the\nPhone lines right now good morning you're on W. A. R. A. hello\nHello\n... tried to call back would love to hear from you or the number again is five oh wait choo choo choo\nYou or the number again is five oh wait choo choo choo Thirteen twenty and will be here to the hour the power\nOf nine AM\nAnd the patriots as we mentioned play the or the bills tonight and the five and two patriots um they will play a new era field of the time of the game is at eight Fifteen tonight the last meeting the patriots won thirty seven to sixteen at Fox tomorrow\nAnd the television ESPN will be carrying it locally\nOn channel five\nSo we're about seven minutes before the hour seven o'clock because I mentioned before we will have Paul Jake's\nAn adult borough city firemen and he is also the legislative agents\nHe represents firefighters in the union so we'll talk to him about a variety of things coming right up right after the seven o'clock\nTop of the hour ID so John rapidly filling in for Mr Dominic ... let's see who's on the phone lines good morning you're on W. A. R. A. good morning\nTom of weather updated for you we've got some rain out there as we talked about a few\nMinutes ago and you've been mentioning a and also the threat of thunder and sure enough on radar now\nOr the last twenty minutes or so starting to see some ah thunderstorms down in the central Connecticut coast down towards old Lyme a and just around New Haven and they're moving northeast so\nUh we will have as a threat of a a thunderstorm this morning again not trivial without talking about anything heavy with high winds or anything but uh some Bob morning thunder and for getting thunderstorms any time in October is not too typical and getting it in the morning is a kind of unusual to do a little unusual this morning again not everyone but\nGetting it in the morning is a kind of unusual to so little unusual this morning again not everyone will get it but uh I'd say through about twelve o'clock because the threat of a few showers and again we'll watch that area under storms with a with for some people since they're probably sleeping in from being up last night maybe the thunderstorm Tom will be there wake up call the\nWhite [laughter] around eight or nine o'clock\nYeah there you know there were some people out there that are still sleeping away ... a sleep it off as it were All right we're going to reach the mid fifties this afternoon a wins will turn southwest of West is going to start to dry out as I said good news tonight clear falling down to forty ... issues of heavy freezes this week now\nWe're going to catch up obviously over the coming weeks and months but\nAfter getting two or three doses of freezing temperatures over the last couple of weeks this week will be mostly above freezing a high tomorrow about fifty so I'm going to the sunshine tomorrow a nice day with blue skies almost all the\nUpper East side of the northwest Ohio fifty and then again\nThe good news for Halloween at least at this point in terms of whether\nIt is not going to be cold is not going to be snowing on Halloween which it has done in the past rarely but it has snowed on Halloween we've also had nor'easter is on Halloween we've had always does on Halloween we've had very warm temperatures on Halloween and Tom we're going to be somewhere right in the middle about sixty or high on Halloween Wednesday\nAnd then a Thursday we're going to feature of the sixties mid sixties I think the warmest afternoon of the week is going to be Thursday before another weather system of stronger one moves and I think the rough weather this week is going to be on friday with rain heavy at times or some gusty winds and even the chance of thunderstorms then so\nFriday may be although not the exact same set up friday maybe similar to what we had on Saturday a potential strong winds will monitor that that could linger into early Saturday right now I'm a picking the or the ... for the weekend Sunday with sun shining\nRight now I'm a ... the uh the pick for the weekend Sunday when sunshine and temperatures back down to the upper forties cooler uh\nProbably forty below fifty somewhere around and\nTalk before we accept the clocks back next week and we have these dark mornings now\nI think you'd agree out looking outside of the street lights are still on you know we are uh you know ... by what six forty seven or ... whatever the time is and we're still dark out the other son will not come up officially today obviously we're not going to see it come up with seven for the team the sun will be rising this morning\nAnd so the kids at the school buses wanting this is talk about this every year\nSince they changed the times of setting the clocks back\nWe used to set the clocks back earlier than we do now so because of this the the small window of opportunity as the price we pay would delaying those those late afternoon ... afternoon situations are these dark mornings\nSo you want to be very careful this morning to 'em or not you personally but everyone listening ah with the outside of the bus stops or anyone walking sidewalks the trains and dumped on how to borrow\nA the only our again not even severely seven o'clock but it's still fairly dark out there so you want to be careful make sure you have your lights on either going to be really really through about eight eight thirty this morning and again or perhaps the wake up call for some with a thunderstorm so\nI kind of an interesting morning time to get a eating that wakeup call with thunder if you're still sleep it off\nAnd then also uh the fact that we have these dark mornings when we set the clocks back one our next weekend this upcoming weekend costs a reminder it's the weekend before the election\nOnce we do that then we'll have writer times for a little while in the morning but will also have a sunset next Sunday this upcoming Sunday sunset time will be a quarter of five in the late afternoon\nWell I Know what that is that's you know make sure those headlines aren't clean\nWell I Know what that is that's you know make sure those headlines are clean and you know when you're driving on the roads are the same like on yes the changing of the clocks moving them back the hour is wide November fourth the number\nOf whatever Sunday at two AM officially is so are we going to the fourth of July I Am okay or as a as as they say when you go to sleep so you don't ... I used to do something [laughter] yeah when you go that used\nTo wake up or that they they love to get to sleep till they go to sleep on on the Saturday it's always been a Saturday you know two am Sunday ... go to sleep Saturday Night but they've set the alarm at two AM to wake up so they could set the clock back and then go back to sleep\nBut like what are you crazy you know it's ridiculous the joke thing they like to know what they say if you do it at two AM will come on you don't have to do it to a gym that's why they tell you you know when I ... unless you forget do it before you go to sleep\nSo you don't have to set an alarm to wake up and get lousy sleep so you can turn the clock back and then go back to sleep\nAnd locally as you know a route one can get a little congested into a traffic not looking too bad here\nIn the local area we are at a ... about a minute to go before our top of the hour break and then we will have our first guest of the day Edinburgh firefighter Paul Jake's he's also the legislative aide to the union here and he's got some great news for you and a\nSort of things going on in the schools so a poll Jake's always nice to have a firefighter in Studio ... what what do we say good morning ... now make sure we get you're on the right my cars that you power\nThere yes it is good morning I'm thinking of having a few are losing ...\nW. A. R. A. Thirteen twenty am at a liberal on Tuesday October thirtieth from\nFive pm to ... pm the night and regional chamber of commerce will hold its twenty ninth annual taste of the region\nAt tri county regional both technical high school and Franklin tasted the region is an annual celebration of restaurants from all the sixteen communities that the regional chamber serves attend these will have the opportunity to sample food from a variety of restaurants that are members of the chamber\nLet's go inside the mind of a ten year old\nYou are hearing Gabby ... a year and she got that what you look down on McCain laughter for me that collapse Sarah yeah\nBut then they can and will be like ... like I came back a lot of great name I Wish I was called and they came there like\nI said hey why not heading into your back let that a seatbelt forget the company is like they see you now\n\nThe company is like the you know\nOne\nPiece at school today [noise] sometimes it can be tough to get through your kid but it's not impossible always make sure they're wearing your seatbelt even on shore drive's remember you have to you have the\nNever give up until they bought go on a message from the national Highway Traffic Safety Administration and be down and visit they record got gum slash kids buckle up more information\nAre you one of the thirty million Americans who skip breakfast every day we don't need to remind you that skipping breakfast can have a detrimental effect on your health the breakfast place located at one eighty seven pleasant street across from the show gas station has been serving their customers meals are made to order for over thirty is\nUsing vegetables from local farms and cage free eggs owner Casey dark ... opens the breakfast place every day from seven AM to one PM for breakfast and lunch\nAnd but those on the go all meals are available for takeout\n[noise]\n\n\n\n\nAll right we're back with view was a few minutes after the hours\nSeven o'clock reports were going to be interrupted here and thereby traffic reports and our weather forecasts but great and just say hello again to fire fighter poll Jake's who's also the legislative a dog or the ... liaison to the union and correct is that basically\nThey do they do you're the ... liaison to the union correct is basically\nA ... a legislative agent for the professional firefighters in Massachusetts oh welcome\nAgain to our studios here at W. A. R. A. Oh thanks for having me like you know we talked a little bit and you are doing something very important right after this tell us about getting into the schools and what occurs\nNo uh actually uh after this will be going into a some of the elementary schools are finishing up fiber eventually month\nFor ah you know teaching fire safety tips or to the students um we recently had our a fire department open house a self ... uh where we started talking about this show and um it was a great event open to Republican all the families and kids and everyone really enjoyed it\nBut we go into the schools are similar to ... uh it's called safe student awareness of fire education and we go into the schools in ah teach fire safety tips are at all levels and even to the seniors as well okay\nWe're talking about the open house you had do they ever enjoy going down there I have some grand kids that were there but the the the kids love the fact that\nThey can get on to the to the fire engines they take you around and show you how they work and I saw you spraying the whole is with the kids how exciting is that for the young people to to see\nReally up close what you folks do\nAll the kids love it I mean they they get to come in and as you said take part in what we do every day or you know and\nAs far as kids or you know they come in and have a great time and and just imagine having that feeling every day coming to work that's that's pretty much do we feel we come to work you know we have the best job in the world to us and uh really enjoy it so getting to share that experience with the other kids is a really good\nYou hold on I think every day that you don't have to go out and battle a five alarm warehouse fire or you know having or something like happened in ...\nI've alarm warehouse fire or you know having a something like happened in North of or I guess over the weekend there was a house fire there\nA where um the I guess it was a faulty a furnace and the basement with some smoke damaged but nobody was injured I'm Talking to us a little bit about uh\nYou know how you started as a firefighter why did you want to get into this business and what does it take in the way of education to begin a firefighter career\n[noise] no I as far as getting on the ah the job Massachusetts or for civil service department such as ... or if you take social service test and they give that every two years\nAnd then you uh get on the list on today's age we've come to wear a paramedics are are are the norm and really a need to have that level if you are one of a better shot at getting on 'cause a lot of places are hiring paramedics absolutely\n... being a paramedic or having that training is certainly a good ... for getting on a fire fire department basically absolutely okay my guest is Paul Jay Z and how long have you on the fire here\nUh almost twenty five years down so any finance ... while\nIn I'm sure you've enjoyed every minute of it has there ever been any I mean what is the most dangerous situations you occurred over the years that you can remember\nI mean uh you know it's it's been it's been a great career a look forward to a continuing it you know and and see what happens on the future brings you never know what you can expect every day uh it's different a different scenario everyday you never know what's gonna happen [noise] um it's been a lot of a tragic events in ...\nUh that we've had to respond to um you know some of the big ones that people may recognize you know such as a fire goes you know lots of let ah the gas explosion on George Street a lot\nAh the gas explosion on George Street a lot\nOf a lot of car accidents or even earlier a couple of this week and last week up on the highway and you know some tragic incidents there are so uh it's um it's definitely a team effort or we do our job together or we do our job\nMy best we can serve the public and are really glad you know like you said earlier we don't you know you don't want these things to happen and that's one of the reasons going into the schools doing fire prevention and trying to teach the youth safety tips so as they get older and they can prevent these things from happening\nBut with human error in accidents or you know that's part of what keeps our job going or fire\nSafety chips I'm going into the schools um I I was that taught do you go in and just talk to kids about here's what could happen we're in October [noise]\nDo you have a fireplace uh what's your heating system like uh how's the wiring how is that information\nI'm given to the children and how how do they reacted give us a little idea of how that process happens with the with the students on all levels\nIt's a there's many different ways um what we're doing right now is because of fiber venture month um but we can go in throughout the year and give individual classroom instruction so we can do that too we meet with the schools in the school department and the\nAnd get those set up but what we're doing right now is kind of on a I'm\nA a presentation level where like grades K wanting to get together as one group and then grades three and four get together as one group and we uh\nWe meet with all of them so it can imagine all those kids in those grade levels like stuck in four or five hundred kids some times in one one setting a which is you know it it's great I mean it's very energizing the kids really like it\nAnd uh we have a short a talk in the beginning\nUh we have a video a presentation than after we talk about the video different things\n[noise] uh we have a video a presentation or then after we talk about the video different things like stop dropping role smoke detectors crawl owners smoke\nOr things like that and then we actually take questions are especially with the younger grades I'm One of the statements over the years that I've come up with his state of the kids um you know the difference between a question in a story\n[laughter] there's a you know and you have a lot of questions but there's more stories and they're all what ifs so it's it's really good it's it's great and screen now you mentioned\nCrawl\nIn or if they're small so the kids learn that if there is a fire or they're in their bedroom and smoke is starting to build up get low on the ground and try to get themselves out of that situation correct\nAbsolutely you know they learn what the spoke detect goes off if there is a smoke and they wear to crawl low and or if the doors closed out open the door and shut the door for heat first with the back of their hand um then how to do ways out um then once you get out to have a meeting place so that everybody knows that they're out of the house with an adult\nDenise I've already discovered go to graduate dot org to learn how to find cultivate and train discreet pool of untapped Palin runs you buy the ad council and graduate life dot org\nAmigo is currently looking for qualified individuals to help fill various positions within the company located at thirty three Perry avenue Amigo was offering fooling\nPart time positions in addition to hurting him opportunities Amigo offers first second and third shift availability to help fit your needs in there's when you joined me go you will help to create a positive light and experience for all the individuals that we have the privilege of serving on a daily basis for more information on all positions available\nPlease call five zero eight four or five five six two zero zero or visit our website ... Inc dot org\nVoter registration drive was offered to juniors and seniors are out of our high school recently Congressman Joe Kennedy spoke to students about the value of being informed of local issues and politics and getting involved regardless of your political party\nThis week on double ACS watch age as civic engagement a presentation to promote the power of your voice in the responsibility to vote you can watch this program and all about quality programs around the area in high definition on double A. C. S. dot com\n\n[noise]\nWe are as a [noise]\nTwenty one minutes after the hour of seven o'clock\nWe are in a [noise]\nTwenty one minutes after the hour of seven o'clock on AM Thirteen ... W. A. R. A.\nStill dark outside politics is a meteorologist your core of and has been\nA giving us a little insight as to ah you know the time changes and it's still dark here at a Twenty one after seven if it were summertime it wouldn't be bright sunshine out there but unfortunately the darkness can bring\nA some some hazardous conditions certainly and that's one of the things you guys do I wasn't I didn't realize the firefighters\nA can and do quite frequently go to the scene of fire accidents what's or car accidents tell us a little bit about um you know why they're there and what are some of the responsibilities of say there is a two car crash on Ninety five or something you\nKnow we're we respond respond anything anything that's considered emergency by anyone is is what we respond to the nature of our job\nA part of that is a you know auto accidents and um we do our own EMS so we have our own ambulances mhm I'm so we respond as far as that and we bring a with us a ... company or a ladder company depending on the highway or the nature of the accident\nFor a vehicle expectation a patient stability um and then obviously transport and care and you know we it's a one stop shop get it all up yeah and it all done\nSo uh you know in the in in case of auto accidents how is the fire station notified is is a policeman there and they immediately\nReach you folks for assistance and the way of an ambulance or or maybe you need to spray some hazardous um materials out there to to um put a car fire out how are you guys notified when these car accidents occur rode the are the most common\nHow are you guys notified when these car accidents occur\nWrote the are the most common obviously as a nine one one uh everyone calls time on one uh mostly um you know we get notified by the public about passer by an end um state police on the highway a local or at least um who knew a greater doing their job and we uh we work well together\nSo they uh they also notify us and respond together absolutely five\nAll eight to two Thirteen twenties the number to call when you have a question or comment for our guest in Studio firefighter Paul Jake's he is also the legislative aide\nTo the unions for the city of adult boroughs firefighter and now they just ran a find the contract a good deal I I read and um most firefighters I Would think everybody's pretty happy with what's occurred in the in the way of the negotiations\nNo absolutely we've ratify the contract and uh now it's just in a you know the massive down the communication for the funding process of the council a and now that that just takes place and um [noise] and see a you know once that's funded than in the back on track and\nI Want to ask you a question that that may be a little off the beach or maybe you didn't expect\nFirefighters are all human beings they're all people they're all they all have I mean obviously great intelligence a lot of a lot of courage\nThere is I mean there's a lot of things going on in the city battle borough now in the way of all elections a city council mayor mayor Paul you're always been the mayor now for\nTen months a little more than ten months\nDo you hear from firefighters who said jeez I Wish this would occur I mean you guys do a job you know when you're out fighting a fire or you're giving chips\nYou guys do a job\nYou know when you're out fighting a fire or you're giving chips\nOn on um fire safety to kids\nYou're not out there going you know uh you know vote for this one or you know\nBut you guys have opinions about stuff how do you guys\nCarry all that you know there could be some people who are very conservative firefighters others are more liberal\nUm how do you keep all that in check when you're doing your job\nWell or when we're doing our job I mean that's obviously that's one hundred and ten percent focus is no\nYou know it doesn't matter um what political party are or what person or anything we were going to do our job on the same way under ten percent um personal personal opinions and stuff that you know what they say\nLike being at a a a family dinner you know you know talk about religion and politics right near the fire house you know everyone has their thoughts in but we uh we we try to stay away from that cars are living together for twenty four hours a day I'm can ah can be like what are some times where you want to know what to say the wrong thing are their chores\nOf the various fire houses other than the open houses you do is say someone and just an average citizen and out of our wants to go to twin village or down to the south ... station\nI'm can they go in on any given time in in look around and get a little bit of an education\nAbsolutely our house we're open twenty four seven three sixty five ... or\nYou know and you could always is a fire house we have numerous times people come in and visit a specially with their children or you know and it's it's a it's always great time that experience we talked about with our open house uh it's it's experienced every day in the firehouse wouldn't with individuals that come by absolutely hello you're on W. A. R. A.\nO. L. Thomas him with a quick whether update for you in right after he had a quick question from this short as that we're watching it a lot of the next batch of rain coming really\nIt's been from his contracts sure as they were watching it in a line of the next batch of rain coming through we do have a ... tons of storms that window western Rhode Island so I Would suspect in the next hour or so we're going to get some rain showers\nAre picking up again also with some of thunder and lightning is a weapon monitor that as always my to weather forecast this hour brought by Duffy who funeral and cremation services on her white O'Hanlon continues to create his vision of heritage\nSo out of the life of those who have passed the cells to create the celebration of their loved ones like feel free to visit to the pool funeral home they located at twenty ... just off north main street and see how they can change the way you think about funeral services you can call them anytime five oh wait two two zero one nine three\nAgain some heavy shower is not moving through no nothing like we had the last week\nBut certainly some rumbles have thunder and lightning within the next hour in the ... area\nAnd then a few more scattered showers through about twelve o'clock and then I expect the sun or to be coming up writer as the afternoon progress as mid fifties not bad temperature wise or then we'd dry up tonight with clear skies well becoming clear down around forty not a bad day to tomorrow all kinds of sunshine in fact northwest wins breezy\nAbout Fifteen twenty miles an hour high about fifty and then the good news for Halloween on Wednesday it's going to stay dry off what trick or treaters than anything else going on on Wednesday and we're going to make a run at sixty degrees as the wind's turned southwest are probably somewhere around fifty five in the late afternoon early evening and then the first day of November\nI Will get into the middle sixties with sunshine breezy conditions are next chance of a rain event after this morning looks to be friday\nThat one could contain some heavy downpours as we continue with this overall a rather wet weather pattern intersperse obviously with some sunny days uh that's part of the reason why we've had a lot of uh the wet leaves and some branches coming up trees and also we have to worry every time we have a wind event over the ...\nBranches coming off the trees and also we have to worry every time we have a window event\nOver the coming weeks of the some ... going down because of the very soft ground we have so again another round of showers within the hour Tom as we watch this area of thunderstorms not from here but uh as we've been joking earlier or some people that may not have woken up from the game last night might get woken by the thunder\nComing through and I have a question and I'll ask this before or this takes about\nCarbon monoxide detector is a and I had an incident many a few decades ago with it up in Vermont\nWould you agree that you know it's one thing with fire and smoke generally it's visible you can smell it obviously carbon monoxide\nIt's old English and you can see it should all carbon monoxide detector is just like some of the things we have an automobiles shouldn't have should they all have current readings\nAnd as time goes on you realize there's a lot of hidden things that you take home with you um whether it be a such things occupy\nA lot of hidden things they take home with you um whether it be a such things occupational cats are a few TST a lot of things that affect our members every uh every single day uh that we don't really uh really see a you know when when ah\nWhen we're out there are in the public\nBut the legislation made a ... cancer a work related injury so it finally as a as it should be recognized a across the commonwealth and a ... keeps our members and especially their families and that's really what this is about\nTo know that if you ah you know you go out and he served your community every day\nAnd uh you come home they found was going to be taken care of if a certain things like that happen to you [noise]\nAnd um it's really a it was it's really it's it is a good thing you know it's it's good for the families not that you want experience and hope we never get to use it but I'm\nA it's a it's out there so it's something that'll that'll help down the road what about\nEquipped with the latest with when you're battling a fire that you can be protected from those carcinogens and in bad chemicals that you know could occur is are\nNewer equipment people using I mean you guys where very very heavy type um pans you wear a long black codes\nYou have the smoke detectors if you go into a burning building or is or knew or knew or equipment that's used to safeguard against some of them\nNo absolutely I mean we we have a you know obviously we could afford to fires when three close are we have a full turnout gear 'em that as time goes ON Technology advances and it makes it better to protect us uh from you know forget like you mentioned the bunker beds and turnout coats and\nUm then we bring our own air you know what breathing apparatus a sep s\nUm then we bring our own air you know we're breathing apparatus a as CPAs are elements clubs all nine yards so we're pretty well insulated but um you know that stuff's still seeps through and it gets into your pores in your skin and uh that's uh that's really no escaping it to be honest with you ...\nOkay my guest is Paul Jake's on Thursday and\nFour to five thirty PM shadow elimination patterns are cast throughout the universe by the gravitational field the stars and galaxies this talk will unveil how these cosmic shadows carry clues about the existence of extra solar planets\nAnd a possible fifth dimension the auditorium will open at three thirty PM proceeding and guess are asked to arrive at the auditorium no later than three fifty PM the lecture will take place at Brown university's icy Ahram one Twenty one south main street on the eleventh floor\nAre you looking for more opportunity to literacy center is here to help we have free year round classes in English computer literacy and high school equivalency with the help of teachers and tutors you can prepare for your citizenship test\nMake a resume get ready for college or learn how to speak better English classes held during the day evening or an Saturdays view our website the literacy centered dot com or call\nFive oh wait two to six three six oh three the literacy center building a better community\nThe average time a resume spends on an age or managers desk is seven seconds and most of them are tossed aside now imagine if one of those resumes belong to you as a man who was\nLiving in a shelter juggling three how can he originally had something that you can't or if that resume was from someone who\nWere twelve hour shifts that there was like a company with my dad I'm Seventy two that taught me a work ethic that I care with me every day\nTwo that taught me a work ethic that I care with me every day\nWe rely so much on a resume yet it could never tell the full story of someone growing up where I did a lot of things could have gotten in the way of my goals but I learned to push through and that's what I bring to work every day\nSo maybe it's time we look beyond the resume and look to grads of life\nDiscover new ways to develop great talent that are so much more than what's on paper at grads of life that or a public service and now it's been brought to bike rides of life and the ad council\n\nDr Gary highland or will return to Richard's memorial library for a series of lectures titled papers the series starts with the federalist papers on Thursday October forth it will be followed by the pumpkin papers on Thursday October Eighteenth\nAnd the Pentagon papers on November first all lectures will take place at seven PM registration is required to attend these lectures if you'd like to register you can email librarian Maggie homes at ... homes at sales in\nDot org for over forty seven years Amigo and has been offering services and programs for children and adults with autism spectrum disorders and other disabilities located at thirty three Henry avenue an adult borough Amigo has been committed to building vital relationships ... their community ties on the local level\nAmigo provides day programs transitional planning and a continuum of services to support all ages for more information you can visit our website at Amigo ink dot org\nI'm ... now it's me the designer jeans and your class at the back of your closet what am I doing here what do you keep caviar in the back of your fridge with the catch up an old milk\nYeah I don't think so so what happened to you last I mean have you seen ... I used to somewhere in the Hampton and now I'm stuck behind a parent's let's see I never really fit you quite right\nAnd now I'm stuck behind a pair of slacks show I never really that you quite right at one of my pocket is so small you can't even squeeze their hand and do it all about the luck\nAnd I look good I Need to get back out on the scene so I can be seen you know going to fancy parties getting expensive I coffee's Sunday Sundays okay\nTake need a good well I can really make a difference\nYour donations to good will create new jobs training programs and education assistance for people in your community defined your nearest donation center go to goodwill dot org donate stuff create jobs a message from goodwill and the ad council\n[noise]\n\nFourteen minutes before the hour of eight o'clock join us for our next guest coming up after aid attorney Brian ad she'll be with us live in Studio to talk about the ... compressor role but that issue\nAnd ah it'll be with us talking about the bylaws where they're at and how the gas companies are trying to infiltrate with\nGreed is or was\nAnd the lockout absolutely\nRight a good point uh and with us right now is a city firefighter Paul Jay Z I'm we mentioned at the break you have the health and wellness um money coming into the city of aloe borough now what's that going to be used for the fifty thousand dollars\nAbsolutely a thankfully to a representative from Jim Hawkins and ... ...\nOh absolutely uh thankfully to a representative from Jim Hawkins incentive to ... ah we're able to in the last budget cycle to ah to get a fifty thousand dollar a minute him for an outer borough firefighters help them on this initiative [noise]\nUh this is going to um be a great thing a great thing for our city firefighters that will uh provide a updated a physical fitness equipment provide a cancer screenings for our members so we can uh\nYou know try to nip this occupation of cancer in the bud ahead of time and um other things like that in some of it hopefully will go into the same program as well as we talked about into the schools into actually the youth\nOff all that money becomes local money and then given right to the fire department\nSure no it's uh it it passed in the budget um signed by the governor and then it was a recently the letter has been sent from a from the mayor\nThe request of the money to a ... that the state house and then uh we have to uh we're able to cheat the other day and we'll be talking a paperwork and different things and information that they are required in order to get that actually in hand\nRight I Want to get back into what you're doing with the kids you're going to be at hill Roberts for they had one question than I thought of and it's only because\nI was riding around with a firefighter ... five six years ago\nAnd he had mentioned and it was wintertime and he had remark look at that or the or the fire hydrant needed shoveling now tell us how important that is to keep them shoveled out those fire hydrant are pretty much\nYour livelihood getting water where it's critically need\nAbsolutely uh and during the winter months with the snow or hide rates they get just like everything else they get very ... and um you know we carry obviously water on our engine companies but uh it's only for a brief moment so we have to what scientists to hide rents and to keep that cost and water supply\nIt's only for a brief moment so we have to watch scientists to hide rents and keep that cost and water supply to extinguish the fire [noise]\nSo uh in the winter obviously um shoveling out your hide rents is is huge it's key and ah you know if you have a hydrate that's in in your home or in front of your home or in front of your business just take a few moments you know it's it's tough when a shovel the driveway but take a couple of extra minutes go out there and clear off that hydrant because you never know uh never know what's going to happen\nRight away um some other things that you guys are doing you maybe talk a little more it's or something that I mentioned or is there are color or something that would like to ask the question the number is five a way to do two Thirteen twenty what are some other things that you're dealing with these days as legislative Asians\nYeah and and again no disrespect disrespect most police departments will not do that you have to you really have to know something a when it comes to police before they're going to tell you something that's probably to keep us safe as well wouldn't you think\nSure no I Would be ... percent that keep us safe I mean obviously grew out of our police are great group of individuals a great team and we work well together with them side by side every day for a public safety\nOr what they disseminating information it's entirely up to them by right uh we uh we have a weekend we're allowed to talk about and then say or to the public when they call as I'm sure they do as well uh but uh it's a great great group altogether well\nI Want to thank you on behalf of everybody here is W. A. R. raven and you're more than a couple of times I Know you've been on Elaine show and we're developing a good relationship with you to bring information to help the city or be safe I wanted to thank you so much for giving your timing is educating us on\nFire safety month and things that we can do to keep a fires away from our homes and businesses and keep our children and our loved ones safe\nNo thank you Tom and thank you or that we are a tune into all the citizens for allowing us to uh to get their message out there that are much and have a have a good session over there and he'll Roberts today thank you\nAll right we'll be back stay with us right after eight o'clock attorney Brian hatch and the topic will be no compressor a whole but let's get into that we haven't talked about that and about a year it'll be with us right after eight o'clock you're listening to W. A. R. A. amoral Providence we'll be right back\nListening to W. A. R. S. A. M.\nYou're listening W. A. R. A. M. battle\nOver thirty in the\nEarly eighties in history as a second\nBy Karl Rove is\nLocated at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guess will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at the Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy\n[noise] ranger station ranger speaking\nI reported a okay\nWell before I left my campsite fire Smokey Bear hunting\nSo you're drowned the far east spirited grounded again and felt that it was cold uh-huh oh yeah he likes it when people correctly put out their campfires he's pretty big on wildfire prevention is just letting you know you did good with a a hug butter\nI bear hug from Smokey Bear\n\nRight I'm going to let you go now I've got a lot of a ranger stuff to do [noise] or many ways to start a fire but once you're way to put it out learn how you can do your part it's Smokey Bear dot com\nOnly you can prevent wildfires\nSponsored by the U.S Forest Service I count on your state forester\nStaying at home surrounded by family and friends resting comfortably with your illness under control and support for your family\nResting comfortably with your illness under control and support for your family caregivers that's what most Americans want at life send hospice can make it happen with the help of hospice patients and families are like can focus on what's most important\nEnjoying life together and living as fully as possible\nFeel free to contact community in a hospice at five zero eight two two two zero one one eight\nYou can also visit community DNA dot com for more information\n[noise]\n\n\n\nAnd final hour on this Monday\nOctober twenty nine [noise]\nTwo thousand a gene regulation once again with the Boston Red Sox\nSee I can say world champions\nFor this year and of course as a New York Yankees all we can say is okay let's get there and get behind the batting cages and you know get it John\nOkay let's get there and get behind the batting cages and you know get it done get some practice will be back again next year I think we have a phone call and see what we have good morning you're on WNBA\nI'm a quick update for you you have heavy showers or\nModerate showers with them better thunder now rolling through much of the area coming right along the way I Ninety five card or\nBut again it's going to get a lot better this afternoon so just a sort of wait it out and they will be improvement for almost eighty years they've been a part of the greater out of our community assisting families them life's most difficult time stuffy pool funeral information services\nTwenty ... street in Alvaro brings you the forecast and report if you need green support information on designing a funeral having a permanent memorial and other issues that people can help you out there's a website Duffy USF why that pool P. O. U. L. E. we'll call them anytime five oh wait two two two zero one\nNine three reached the mid fifties today it's running on the upper forties right now across the area of low pressure which started out in central New York early this morning is now a crossing into the western part of New England that's what's setting off these moderate shower so again if you're going to be out certainly for the next one to two hours\nSome of that rain could come down and brief downpour\nSo just be careful and make sure you have your lights on tonight it'll fall down to forty seven states for a nice bright day tomorrow cooler though a high a fifty a dry a wind out of the northwest\nLow in mid thirties on Wednesday morning and Wednesday itself costs Halloween the daytime Ohio about sixty just heard Tom that the parade for the red Sox will be late Wednesday morning in Boston it should be dry for that\nTrick or treaters the weather looks dry in the mid fifties while elite afternoon Wednesday Wednesday evening and a taste of or perhaps late summer well maybe early fall on Thursday a high in the mid sixties with sunshine clouds late and Tom the next chance of widespread rain is friday later this\nLate and try and the next chance of widespread rain is friday later this week\nOkay well thank you so much meteorologist Jim Corman I didn't have that\nInformation on the parade and the bad news is that I may have to drive my wife to the person said I've been given those order if she wants to see ah the world series trophy you know where would that be up in the I'm right there where they're going to have already Boston yeah is it was the ...\nThe ... they're going to be on the ... I from what I understand I think I just heard that they're going to start a possibly going into the river and then come out and then go through Boylston Street and uh maybe end in city hall I think but uh I don't think they've worked the exact details of what I hear though it is going to be a either ten or eleven o'clock on Wednesday morning\nWhile and I'm sure thousands will be there I'm just concerned about parking maybe the train is the best thing I\nThink the train would be the better of the art of ... like that but again the weather last day of course that is also a Halloween this Wednesday or the weather should cooperate nicely it's not going to be cold no rain no snow\nOr maybe a bit of a breeze in the afternoon but overall not no big weather problems so we really just get through time and I'll have\nA one more update with you later this hour or we have some of these moderate to briefly heavier showers but this is really the last of it uh for until probably a friday when we'll get into more rain so against ah just put up with a little a couple more hours of the rain and then a gets better this afternoon\nAlright Yes sir thank you so much meteorologist Jim carbon\nFor that update on the weather and he'll be back again I Believe to Morrow here unless there's some major major catastrophe Jim always\nGives the last minute call you know something develops kind of course you'll have his mid day weather forecast for you right in about twelve o'clock or I'm Sorry\nMid day weather forecast for you write about twelve o'clock or I'm Sorry about yeah about twelve o'clock today that's after Paul he leaves program pontificate ing with Paul he'll be with you starting at nine o'clock\nIn just about a fifty two fifty\nTwo minutes or so current temperature reading is about fifty seven degrees slowly getting light out there but still very overcast damp streets or wet\nPlease be careful and keep your speeds down you don't want to be a statistical you don't want a genome round the reporting that you just had a fender bender or a crash on you know pleasant street or route one in North Alvaro\nOr we want to get you to work safe so here's some of the top stories we are following from the W. A. R. A. newsroom we are awaiting our guest a attorney Brian hatch should be here\nAre you looking for more opportunity the literacy center is here to help we have free year round classes in English computer literacy and high school equivalency with the help of teachers and tutors you can prepare for your citizenship test make a resume get ready for college\nCan prepare for your citizenship test make a resume get ready for college or learn how to speak better English classes held during the day evening or on Saturdays viewer website the literacy centered dot com or call\nFive oh wait two to six three six oh three the literacy center building a better community\nWhether it is race religion or sexual orientation human rights inequality is a constant struggle that has changed for him throughout history on November six Massachusetts voters will decide the future of protection for transgender people by prohibiting discrimination in public combinations on the basis of gender identity\nThis week I double ACS catch question three ballot presentation an initiative designed to promote freedom for all of the people of Massachusetts\nYou can watch this program and all of a quality programs for around the area in high definition on the double ACS mobile app\n[noise]\n\nTwenty one minutes after the hour of eight o'clock one of my favorites ... would be for others [noise]\nAll right thanks for staying with us all morning along on AM\nThirteen twenty W. A. R. H. wherever the filling in for Dominic a joy is on a well earned week vacation\nI told him before he left please please send us a postcard let's see if he does that\nUh he knows my address he knows where we live and he knows the kind of postcards that I like let's see if he actually brings a postcard [laughter]\nAnyway waiting for a attorney Brian hatch maybe we hadn't miscommunication hello world champion [laughter] you know I I just wanted to tell you Paul our our uh our New York Yankees are doing fine I heard a lot of them got volunteer work down in the Bronx\nSo could could could Aaron Boone is updating his resume as we speak [laughter] so I felt so did you watch the game last night and you're just celebrate yes\nYes and the flip phone wasn't full overdrive motives the Sixers myself and my six other siblings firing text messages back and forth over the course of the game but over something like a hundred and eighty two messages between seven of us\nWrite the great night great night at a finished before midnight that was good news [laughter] go aging innings goodness yeah I mean clearly the very best team in baseball this year this year boy I uh I I had to laugh though before\nHe got an a range of W way already I was listening to another station they're interviewing Vance and one said ah\nBeen a long way it's been a terribly long oil yeah sure what five years\nIt's been a long way it's been a terribly long way oh\nYeah sure what five years five years right for in the last Fifteen yes exactly right why ... becoming the new dynasty is\nBack in my day we had to wait ... years to win a title [laughter] and then we ... we didn't complain like these young ... a great night and it's interesting for those who are really into the red\nSox um [noise] the guy\nWho replaced handling Vermeer as yeah these peers\nYou know what the hell are we do and get on one of the best right handed hitter and the games who is this thirty five year old journey man he's played for like Eighteen teams yeah Steve Pearce are you kidding me\nAnd he goes on to win the world series and he absolutely played five games his re home runs an army eyes yeah seven in the last two games so yeah it's All right so you know my wife is very very happy she wants me to take her to the parade amongst demanding we're going to the for a while\nIs that something you've ever done for any of the championship\nAh the Celtics in eighty one\nI remember when the Celtics won the title in eighty one I was working in Charlestown ... I went for a lunch [noise]\nNever made it back to the office that day ... celebrating in a city hall plaza was Larry Bird still on the team then that was his first title oh that was his yes and that was when he uh made the great proclamation Moses Malone does eat [laughter]\nWell you know I'm Danny Ainge must have been on that seemed to not that one not anyone no he was eighty four eighty six okay but yeah so but that's the only big major parade I've been to I I Would recommend public transportation Tom\nYes auto figure driver to Boston Garrels throw because she's got a cousin up in Maine who has to have a pretty serious medical procedure at Mass General hospital on November second which is why I won't\nTeacher at Mass General hospital on November ... second which is why I won't be ... yeah ooh November first I'm Sorry I lie November's rushed right\nAh which I won't be another member for us to get help Carol with that but she was panicking that the duck boat parade and was going to be on November first and it would have been very difficult to navigate but it will be on Halloween\nSo a dress up like a mature adult and go to the ... yeah I I mean\nI'll let me ask you a question what did we wouldn't be in good taste to where my Yankee hat\nNo and I have no [laughter] no don't yet know Yankee gar not know Yankees socks I Would wear the Yankees hat if you wear a T shirt with a big bull's eye on it\nAll by race they were like hey I've survived all these years me Yankee fan in this area of the country it's a wonderful place to live there was one time that I was seriously\nVery very afraid and I felt like they were going to beat the balloons and you know out of me and that was the two thousand five season I took the train up there the red Sox did win the division but the White Sox won the world yeah the year\nWe were on a train and I had my Yankee hat and my brother was in my late brother Red Sox fan and we got off that train and we were heading like yucky way somewhere\nThere were Red Sox fans who were not real nice we were I was like oh no yeah it was the Yankees Red Sox Jeff game\nFor certainly they caught on to how tough you really are oh yeah I I was you\nKnow what thank God I can run because I I did not want to have any part I I've been up there in times where people like what your Yankee fan what they do and I landed on the street you know like\nYou were safer than dolphins fans at Shea Stadium in the seventies though All right I got an ... I mean research [laughter] All right we'll talk to you\nI got an ... I mean research [laughter] All right we'll talk to your nine o'clock okay when we go I'm twenty seven minutes after the our eight o'clock I guess someone got their signals mixed up maybe Brian hedge will not be here will try to reschedule him maybe later in the week\nAnd uh but if you have a comment or question anything you want to chat about it's okay with me the number to call his five a week to choose their genes funny or we can play some uh some cool tunes for you if you'd like\nA revealing some of the other I guess we're going to be having this week a tomorrow we will have a I Believe we're having one of the recreation directors or the associate director Dennis Walsh\nA or Tim Kilian will be here to talk about the Halloween parties happening Wednesday evening and the city of adult barrel\nAnd uh so they'll be here and then later in the week we're also have a\nUh the new library in the new librarian for the city of adults marrow Christine Johnson she is from Connecticut she has a long history\nOf working in libraries in the library system and she's terrific we're going to talk about the ... library and ah how accessible it is for people to go in and check out books and all the great things and maybe a little bit about the big read which just ended\nSo we'll be talking to Christine Johnson I Believe that's on Wednesday and Thursday we will have a no Wednesday we also have the spiritual which Heather Meyers on Halloween Jay a spiritual which\nUh Heather virus or she's going to come in and talk to her she's not a real which she's not a a like\nShe going to come in and talk to her she's not a real which she's not a a like a wiccan type which but she\nPractices are certain things dealing with witchcraft so we'll talk to her a little bit on Wednesday\nAlso tomorrow I'm One of the very very great organizations here in the ... will it covers the city of ... currently located in ...\nThe United regional chamber of commerce will be hosting it's twenty ninth annual taste of the region from five to eight Tuesday October thirtieth that's tomorrow evening at tri county regional vocational high school located in one forty seven pine street in Franklin the event will feature tastes from many area restaurants\nDot org [noise] decision ranger speaking\nI sure they're OK\nWell before I left my campsite putting on fire and keep their showed up and hug\nYou drowned the far eastern round it again\nAnd hunter so you're drowned the fire started grounded again and felt that it was cold uh-huh [noise] oh yeah he likes it when people correctly put out their campfires he's pretty big on wildfire prevention is just letting you know you did good with a a hug butter\nBear hug from there [laughter]\nRight I'm going to let you go now I've got a lot of a rancher stuff to do\n[noise] or many ways to start a fire but one sure way to put it out learn as you can do your part Smokey Bear dot com only you can prevent wildfires\nSponsored by the U.S Forest Service I counted and your state for\nThe benevolence in protective order of ... has been part of the Arab rural area since Nineteen oh six they have always been involved in community service in charitable fundraising giving back to our veterans supporting our seniors and providing youth enrichment opportunities such as soccer and who shoots\nFishing derby and dictionary projects will also providing academic scholarships the folks are over eight hundred strong locally and their members or their greatest asset to learn more you can go to Adam ... dot org remember oaks care Elks share your\nEyes Providence campus art and cultural program will host the documentary film Gen silent on friday November sixteenth from five thirty pm to seven thirty PM in the path auditorium on Washington street Gen silent as a documentary by filmmaker ... asks six el GBDs seniors if they will hide their friends their spouses their entire lives\nIn order to survive in the long term care system Gen silent discovers how oppression in the years before stone wall now affected older algae beat the people in what is being done about it and mission to the film screening is free\nThe average time a resume spends on an HR managers desk is seven seconds\nThe average time a resume spends on an age or managers desk is seven seconds and most of them are tossed aside\nNow imagine if one of those resumes belong to you as a man who was\nLiving in a shelter juggling three inch how can they originally that's something that you can't or if that resume was from someone who\nWorked twelve hour shift at the recycling company with my dad was Seventy two\nThat taught me a work ethic that I care with me every day\nWe rely so much on a resume you could never tell the full story of someone growing up where I did a lot of things could have gotten in the way of my goals but I learned to push through and that's what I bring to work every day\nSo maybe it's time we look beyond the resume and look to grads of life\nDiscover new ways to develop great talent that are so much more than what's on paper at grads of life that or\nA public service announcement brought to you by grads of life and the ad council\n\nClaudine those auto repair located at three ten south main street in Edinburgh is celebrating twenty five years in the auto and truck repair business\nOver the years ... you know and his team of mechanics of work to build a long lasting report with their customers from oil changes to diagnostics transmissions and routine maintenance on foreign and domestic cars and trucks bloody nose will keep your vehicle running\nClaudia knows how to repair five zero eight two to six eighty five forty five or ... auto repair dot com\n\nAll right let's take a look at some of the area of birthday [noise] celebrity birthdays [noise] no votes will birthdays today but hey [noise]\nBirthdays [noise] know vocal birthdays today but hey it is you a birthday\nToday [noise]\n[laughter] [noise] [laughter] [noise]\n[laughter]\nAll right remember if you're having a birthday today or any day of the week\nYou can email us here at W. air re you can call us you can send a a just a little note\nTo W. air am Thirteen twenty forty two union St Dominic will announce it\nOn a daily basis whether it's a local birthday or someone that you know is having a birthday we'd be glad to\nAir it to on this Monday October twenty died there's no local birthdays I Would like to say a happy belated birthday to my brother in law uh Ronnie brand Brianne he turned to a certain age\nAbout a week and a half ago so that's pretty good Ronnie continued success to you and hopefully or you're doing well and loved by all of your family so we say happy belated birthday I Believe his birthday was\nOctober nineteenth and uh but if you do have a birthday you can give us a call at five away to choose their genes twenty celebrity birthdays bluegrass singer musician Sonny Osborne from the Osborne brothers' he's eighty one years old today actor Jan ...\nFrom the television show The Simpsons he's sixty one today\nAnd rock singer essay Martinez is forty nine years old today an actress when\nMartinez is forty nine years old today an actress Winona Ryder\nForty seven years old she's forty seven forty seven [noise] those are some of our celebrity birthdays for today today's highlight in history\nI'm On this date back in sixteen Eighteen sir Walter Raleigh below the English court here military adventure and poet was executed in London for treason in Seventy and eighty seven\nThe opera Don Giovanni by Wolfgang ... Mozart had its world premiere in Prague\nAnd of course the great music from a\nFrom a Mozart's ah was played [laughter] fly\nOur next post at nine o'clock Paul Haley when he found out that Donald Trump was the next president of the United states a classic moment here on W. A. R. A. what else going on in this state in Nineteen oh one president William McKinley is assassin\nLeon ... left\nThe picture there or was electrocuted and in Nineteen twenty three the republic of turkey was proclaimed in Nineteen Seventy nine on the fiftieth anniversary of the great stock market crash\nAnd he nuclear protesters tried but failed to shut down the New York stock exchange\nAnd on this date in Nineteen eighty seven\nFollowing the confirmation defeat of Robert age board to serve on the U.S Supreme Court president Ronald Reagan announced his choice of Douglas H Ginsburg a nomination that fell apart over ... ah revelations of Ginsburg's previous marijuana use\nOverall elevate a revelations of Ginsburg's previous marijuana use now isn't that interesting speaking of marijuana you know that there are at least for companies that have the\nPermits are applying for their permits do have a a recreational marijuana as well as a medical marijuana in this area and that is certainly still a big issue\nUm I I've been listening to some of the candidates they definitely have a different opinions about it I Know Paul has a different opinion\nAnd um so that's going to be uh interesting to see\nA how that all works out is a cities and towns prepare to have actual medical marijuana cites a stabbed pushed indifference zoning areas of the towns and cities\nI Know one of them will be located here an adult or just down the street from us on\nA on a\nOn the street that uh joins parked street not going to be too far away\nAnd that'll be interesting to see how that all works out as well we're at a twelve before nine five oh wait two to two Thirteen twenty ... sitting in for dominant cut Choi who's taking a week away and he'll be back\nAh before these microphones next Monday Halloween is Wednesday we're going to have a real live which in Studio well she's not a real which but she's a spiritual\nPracticing which and it'll be fun to talk to her her name is Heather Myers and she is a spiritual which will be interesting\nThis is Heather Myers and she is a spiritual which will be interesting to learn how she practices what she believes in a coinciding with Halloween Jay you heard a little while ago\nThe a\nParade for the world champion Boston Red Sox I still have a little trouble saying that but the the world champion Boston Red Sox\nYou do have a really website you're where you can you know put stuff on their part difficulty we have a website Yeah Yup yup\nGreat John By the way friday night you know lost by ... what it was a good game yeah great great Catholic memorial team hall so I was trying to get over there I actually was in the Boston area friday night were you in West Rockford yeah where's the field that it's five twenty Baker Street\nOff of the VFW parkway I figured I was driving on the part way and I mean I couldn't hear the broadcast but I knew that you would be on I just didn't know where\nWay and and I mean I couldn't hear the broadcast but I knew that you would be on I just didn't know where where the where the hell was I should've goes and you're listening to W. A. R. A. Thirteen twenty am Mary ... All right thank you Paul Healy is next we'll be back tomorrow is six am [noise]\nBrown University who hosts the lecture cosmic shadows other world in a fifth dimension on Thursday November aid from four to five thirty PM shadow ... patterns are cast throughout the universe by the gravitational field the stars and galaxies miss talk will unveil how these cosmic shadows carry clues about the existence of extra solar planets\nAnd a possible fifth dimension the auditorium will open at three thirty pm for seating and guess are asked to arrive at the auditorium no later than three fifty PM the lecture will take place at Brown university's icy Ahram one Twenty one south main street on the eleventh floor\nAs humans we ask ourselves all kinds of questions but what if we were forced to ask ourselves that question every day that affected the outcome of the most basic things the most important things in our lives\nThe question is what is your sexual orientation or gender identity\nAnd the answers the difference between keeping your job or getting find the answer is the difference between staying in your home or getting evicted the answers the difference between receiving medical treatment or not\nBecause in thirty one states it's legal to discriminate against people based on their answer to this question\nAlgae Beatty Americans have the right to say I do but they don't have the same basic rights as everyone else\nGet the facts of beyond I Do dot org ... but the guilt foundation in the ad council\nYou sit down on your table\nYou sit down on your table you get your card twenty five squares hold the key which one would be I twenty five Seventy two we're lucky Thirteen which one will be the square that makes you jump up and shout\nOuts watch ten fourteen host bingo each Sunday at eight eighty seven south mainstream\nOpen to the public the kitchen opens at five PM well the variety of food available bingo started six PM prizes are awarded and proceed support else charities for further details you can visit adult borrow L. dot org or you can call five zero eight two two two fifty five zero to remember Alex care elk share\nDuring the conversation call by the way to to to Thirteen twenty that's by the way to to to Thirteen twenty or become a remote correspondent by texting seven seven four to eight seven six one nine for\nScientific getting with Paul and the ... I Am Thirteen twenty W. A. R. A.\nNew new\n\n[noise]\n\nGood morning folks and welcome to a Monday edition of pontificate him with Paul and the ... here at Thirteen twenty W. A. R. A. and all\nOver the world at W. A. R. A. radio\nAnd all over the world at W. A. R. A. radio\nDot com yeah\nOctober what the heck date is it\nLet's see\nIf the twenty ninth October twenty nine in the year of our creation of two thousand and a teeny Boston fighting Red Sox are the world champions won the world series last night for games to one over the Brooklyn knee Los Angeles fighting Dodgers\nThirty five year old journeyman Steve who the heck is hey pierce the MVP for the fighting Red Sox into David Price David Rice\nA felt redemption he did not feel shame as in\nSlap shot no no no he he felt redemption after starting his career all for eleven and playoff games\nOr did a great job for the fighting Boston Red Sox there it is I'm sure there'll be a little conversation there the a lovely counter McLaughlin of the ... ah was still us lumbering when I left the house this morning sleeping in well deserved my dear\nSo I left her a note\nI Love you more\nThan Sandy loves me signed ... that was the message I left the lovely Karen Maguire from this morning\nI Love you more than Sandy loves me signed ... there it is five oh wait two to one three to zero five a way to to to Thirteen twenty\nYou can also text the program at seven ... seven four to eight seven six one nine for that seven seven four to eight seven six one nine for\nUm\nUm\nYou know we go hold on to to to ah [noise]\n\nOn this day in Nineteen twenty nine\nThe bottom fell out of Wall Street and the stock market crash that brought on the great depression it was called black Tuesday has prices dropped didn't panic selling thousands were left instantly poor and the roaring twenties came to an end the depression when\nLast almost ten years\nAnd of course the depression was ended basically by the most destructive jobs program and the history of mankind World War two um the depression or the best movie I Know about the depression is a actually a boxing movie a Ron Howard film\nCinderella Man about a James Jay Braddock who won the heavyweight title in Nineteen thirty five\nKept trying to get my farther to watch it I don't want to watch them stupid boxing movie it was not want to Ron Howard's hits but it's the are the best film I've ever seen about the depression\nUm obviously the scenes that don't concern boxing a fabulous fabulous film Sam Rockwell who won an Academy Award right recently for a three billboards inhibiting Missouri I think\nOf course his greatest role was that guy flick men in a galaxy quest but yeah he was in that movie play someone who was a a\nFormer a millionaire who lost that all the stock market goes ... waving goodbye thank you Tom maniac why I oughta\nFive oh wait two to one three two zeroes the number five oh wait two to two third team twenty\nShow at seven seven four to eight seven\nThird team twenty Texas show at seven seven four to eight seven six one nine four had a nice day yesterday with some of the siblings\nAnd uh went out to my brother my place in Bellingham\nMy sister Mary was there from Jacksonville, Florida unfortunately my brother rich wasn't feeling up to make it he's undergoing chemotherapy treatment right now is little nauseous little tired could make the trip but it was great to see Mike and his wife Linda my sister Mary my nephew Matt\nMy nephew\nUh Jackson's wife Jillian and their two lovely twins drew and Mila good good all around today and um the Healy siblings and relatives were so so enthralled with each other\nThe television never came on nope we all knew we were going to be watching the world series last night's patriots weren't playing they're playing tonight so my sisters are Mary and Joan were especially thrilled especially thrilled\nNot\nOne second of football viewing took place during the family gathering a which always always makes it more palatable for my sister's stunning where are we here\nUm [noise] [noise] hold on hold on hold on [noise]\nGet anything set up to my liking the I'm Out of oral fighting blue volunteers a lost on friday night Tom was mentioning that to a Catholic memorial so they are out out of the division one south playoffs I think we're covering Boston College high school at ... this Friday night in a non playoff game there is a chance\nWe might cover either north out whole borrow who had to win over Whitman hats in the first round playoff game and or bishop thin\nHow did the shamrock stew think they got the when I'm not sure um [noise]\nThere it is what else have a gym or a corporate on course\nBut there it is what I was having a gym or corporate um course will be telling us\nA about October twenty two thousand eleven yes seven years ago a record breaking snowstorm in the northeast left nearly two million residents without power for thirty six hours I remember off\nLove newspapers Carolyn I get five of them a day five five most of our news is consumed by either reading the papers occasionally magazines and a radio I\nI'm very proud to say I get stunningly stunningly lift all of my news from TV 'cause well television news is the opposite of real life\nA small number of stunningly stunningly good looking people bringing us truly horrific news from all over the planet is bad new cells in real life is well real life is the exact opposite\nReal life is a bunch of us average looking people at fast on a good day I'm mostly doing the right thing mostly doing the right thing for each other in standing by unfortunately there are horrible exceptions what a terrible a weekend\nStanding by unfortunately there are horrible exceptions what a terrible a weekend was it Thursday or friday well friday the or alleged pipe bomber or was finally arrested fortunately no injuries there um\nWell I guess uh we learned it wasn't a false flag operation it wasn't put together\nBy those deceiving Democrats to make the Republicans look bad nope nope it was put together by yes yes one of those fans have him one of those fans have him lived in a van lived in a van down by the river\nYep lived in a van down by the river or in a strip mall parking lot are covered covered with a pro Trump\nOr Fox News nonsense very sad and then the horrific or murders at the temple in Pittsburgh over the weekend I was pleased to see that I'm a number of our young young adult Muslims are from a local mosque\nStarted a a campaign to ah contribute to the Jewish temple where the horrific murders took place and that really took off across the Muslim community I thought that was a a wonderful wonderful sign 'em\nBut uh that uh that killer and I don't use the names of the killers are in these situations I Am much much much more concerned with the victims um that one you can't and I don't hold Trump directly responsible for either but I Do\nI was sadly sadly horrifically disappointed and his response after them when he wasn't wasn't reading a teleprompter very very sad but the bombing I mean that guy was spending the rhetoric that Trump himself has been preaching I'm the synagogue murderer\nUh that Trump himself has been preaching I'm the synagogue murderer nope he was just a good old fashioned anti Semite heck he wasn't a fan of Trump either he thought Donald has too many he has too many Jewish people in his family you know\nJewish the Jewish religion but white guys who we referred to was the ... [noise]\nYes yes yeah they don't just have people of color also we've got to get some whites in there so they they choose the Jews are anti Semitic feelings are\nUp all over the globe unbelievable very very sad um\nBut the bomber I mean uh the uh the murder and the Jewish temple just a wow\n\nJust your average run in the mail anti Semite I'm sure there are some very fine people ... amongst the anti Semite\nI'm\nNineteen Seventy one oh wow really on this day Dwayne all men killed in a motorcycle wreck [laughter]\nThe next album was called eat a peach that's right he had a peach truck when he passed away Dwayne Allman oh\nGod tremendous ally guitar player or he was the real deal Dwayne all in the real deal I loved um remember a few years ago a PBS I'm not sure if it was wasn't front line but one of their documentaries was about a Muscle Shoals Muscle Shoals Alabama\nAnd to all the great music that came out of there pretty much the only place in Alabama with white people are black people good work together\nTo produce some great music and it's interesting one of the ah one of the musicians down there and muscle\nGreat music and it's interesting one of the ah one of the musicians\nDown there and Muscle Shoals talked about how uh when\nI'm older sweating yeah one Otis Redding came down there it was okay Otis Redding could go to the local bars with them even though he was just a black man because he was with and escorted by and trusted by a number of their good old white boyfriends or so that was okay they wouldn't talk to\nWas it Wilson picket a robust reading one of the two anyway they wouldn't talk too much uh but at least at least it was okay for him to be there or they drew the line they drew the line or when Dwayne Allman joined them\nYes a a\nBlack professional musician escorted by white musicians he was welcome but no long haired hippie fray sketched your long haired heavy freak out I hear a ... was not welcome there are so we started staying back in the studio and the other guys would go to lunch and that's when he came\nUp with the great great um cover Otis Redding cover of a hey Jude\nWhich which some say the great slide guitar jam near the end of that song that cover of hey Jude the Beatles hey Jude a lead to southern rock um\n\nPittsburgh shooter was not a Trump hater evolved ... is Jewish Yasser vodka converted when she married a Jared\nKushner you remember Jared the kid who wasn't accepted to Harvard 'cause we didn't have the grades to get in until until daddy wrote a check for two point five million bucks yeah\nYeah if I have a way to to to one three two zeroes the number five oh wait two to two Thirteen twenty anyway a love newspapers get most of my news from newspapers a goodwill in New Jersey received an interesting anonymous donation that turns out to be a rare colonial\nInteresting anonymous donation that turns out to be a rare colonial era artifact that's worth some big box\nAfter spotting the famed faded newspaper dated December twenty eighth Seventeen Seventy four what what year did he say I said Seventeen Seventy four think of that\nYep after spotting the frame faded newspaper dated December twenty eighth Seventeen Seventy four the store manager brought it to an appraiser who confirmed it was unquestionably authentic\nThe faded copy of the Pennsylvania journal not only has historical value like his article about the enactment of a bill to close ports after the Boston Tea party it also features some funny classified ads\nSuch as this is to give notice that my wife Phoebe has very much misbehaved south\nAnd not acted the part of my due to the wife reads one by Anthony love them I Do for it all to since trusting of her on my account\nFor I Will not pay any debt of the contracting wow\nSo I guess sometime around December twenty eight Seventeen Seventy four Anthony ... wife of course they don't mention her name here because that's back when women were property not people but it looks like Mrs Anthony Ludlum um snuck his credit card out of his wallet\nMight have gone to the local Sears and Roebuck I don't know maybe Montgomery Ward and um [noise] ran up a bunch of bills unauthorized use of the husbands credit card that's what I suspect I Do for a bit older sons trusting of hair on my account for I Will not pay any deaths\nI Do for the ... trusting of hair on my account\nFor I Will not pay any death of a contracting wow the appraiser has value of the two hundred and forty four year old paper at Eighteen thousand dollars noting that he only knows of three other edition of the paper being published from that day\nIt went up for auction on shop goodwill dot com with the starting bit of ten thousand dollars but the auction ended with no buyer\nWow I Know\nPeople don't value modern newspapers today the way we used to\nYou know what America was gray ha ha but really no buyers no buyers for a two thousand and twenty four year old authentic edition of the Pennsylvania journal\nThey're planning on putting it up again for auction sometime in the future I value increases leading up to the two hundred and fifty eighth anniversary of the declaration of independence\nAnd two thousand and six wow\nFive oh wait two two to one three to zero five away through through through Thirteen twenty\nAnd is that the one yes yes Gina Gina from Adel borrow you're listening\nI certainly hope so Gina is the foremost expert on squirrels in our listening audience\n[noise]\nIn memory of Elizabeth Warren is a great Allman brothers song writes agent sixty nine\n[laughter] [noise] well that's ironical [noise] yes those pesky squirrels around it again\nAre farmers bump bum bump bum bump bum you've seen those farmers insurance ads all kinds of those wacky insurance claims if your car is a regular victim of angry squirrel attacks you should think about getting farmers insurance we\nAn angry squirrel attacks you should think about getting farmers insurance we are barbers\nYou wouldn't believe it I buy like bonus stuff okay a lot of things you buy one and you get one I have killed on the coupon queen ... is calling me oh she went last week and she came back and shit guinea it's eight fifty dollars and the\nOutstanding I used to be a coupon king ... way back in the day when the kids were little we had a coupon box with thirty different categories\nYou know dairy and cookies bread or detergents all kinds of things met Marcy the Web guru of the show was currently or the second best a coupon king that I Know of you of course being on top as the coupon queen\nYeah my niece is get a kick out of it not shown that slip he is on the I don't know I said hey I Love you have to because everything's so expensive I don't know people are going to do that had three or four kids it's awful but I said oh yeah I stay fit\nWell that had three for ... I I said oh yeah I think\nWow [laughter] so what are you gonna who are you going to donate to the fifty bucks you save to I'd like to recommend the Paul Healy foundation [laughter] hey thank you so much Gina [noise] I'm I'm like you to a\nCertain she's got a doctor's appointment today fire up she fell at the mall on uh on on friday\nOh yeah\nAll right there we go of that story boy oh boy oh boy we're at the um\nThe to the to the to the\nFriday were at the south shore plaza we're going to meet for lunch or she was coming from an appointment and we're heading towards a the cheesecake factory\nYou know the aisle that that's down the aisle between the um or is it Men's Wearhouse or or milk and it's one of those men soup store on one side and then ... on the other that's the incredibly way we can expensive\nA restaurant that does great uh in downtown Boston not doing so well at the shore plaza not enough rich people\nAre but we're heading that way and there's a giant um the whole middle of the I always taken up but it's two thousand Nineteen black Corvette there rattling off don't ever enter those rivals\nYou know you signed those little what three by five sheets of paper with your name your email address your phone number put them in the box because you can witness Corvette and pay the taxes on it um you should see the small print on the back of those things\nYou enter that raffles for the free two thousand Ninety stylish black Corvette or you're going to start getting junk emails phone calls and literature in your mailbox\nGoing to start getting junk emails phone calls and literature in your mailbox off from everyone and uh you can't stop it because when you entered that raffle you signed signed your life away but anyway so this car with um\nThe uh you know like post and wrote restrainer around it are are are\nTaking up the majority of the hallway you couldn't go on the right side of the car 'cause the cleaning crew had a whole big things set up there so you have to go to the left way around and there was about a\nFive foot space for people to walk through about three feet of that was taken up by wet floor signs you know those yellow wet floor signs so you were supposed to walk through about a two foot space all the way over to the left\nYou know next to the walls of the ... that nobody goes to 'cause there aren't enough rich people and brain surgery to um keep that ... restaurant functioning and I'm so that was supposed to be the dry safe place to walk unfortunately nope that was drenched as well\nUm they had those a floor air blower thing is to try to drive the floor quickly but it wasn't aimed and the right direction so I just just as I stopped to deposit my a coffee into one of the\nTrash bins attached to one of the cleaning cars there are so cows a couple of steps in front of me and yup up\n... down on her right elbow crutch and I'm the woman mopping kind of look and never stop mopping didn't break stride but that's okay that's not our job to care for injured\nPatrons of the south shore plaza a that was the security people and others and a boy oh boy oh boy were they they're quick I mean while they were there quick so um\nA boy were they they're quick I mean while they were there quick so um they came we filed all the paperwork didn't call Morgan Morgan yet or Jim ...\nTerry you do any slip and fall cases we may need you will find out hopefully we can handle that without any legal involvement but does she smashed up her right elbow pretty good went to the emergency department at the old ... hospital and um\nTook the X rays of the elbow but it was two swollen up two swollen to see a there was any structural damage [noise] um so she's got an appointment today today where they'll redo the X rays and we find out find out\nHow much the claim is worth I mean how bad the damages to uh to her right elbow but you know she's a nurse I was Twenty one year oh claims adjuster keep your steak and more and more get outta here or there heavy hitter we don't need you know in the gym sock it all off\nPush comes to shove we'll call agents six five away to two to one three two zeroes the number five oh wait two to two Thirteen twenty\nOh and then\nMr blue pride ... Fontaine writes them too bad you have to work today I'm surprised Jim Jones did not give you the day off now I'm\nGetting on November first off mark Thursday November first I'm going to help Carol out that they were some things especially now that she's a operating one arm or did not much use of or major arm her right arm 'cause her her elbows not functioning properly\nMark says I stayed up until three thirty this morning because of our because our blood red Sox won the world series yesterday he had trouble sleeping a but your broadcast partner who fills in for you in the morning for your show was crying today because our red socks\nAre you in the morning for your show was crying today because of a Red Sox won yes that is Tom Rath pretty the great Tom rapidly filling in for Dominic ... all week so we can't fill in for me on Thursday November first I think we're going to do our best up an archived edition\nOf a typical eating with Paul on that day so quick answers from past shows hopefully we'll be entertaining but any who um\n[noise] the way home and passed away on this day and Nineteen\nSeventy one was it some hey hello ... just scared though but Jesus autonomy pressed his nose up oh I've got to let him in okay hold on I'll be right back here we go folks don't go away [noise]\n\nJames Freedman had to get into the building [noise]\nSo it's okay to knock on the window which took it away to get my attention you didn't have to stick your face up against the glass you know with what your nose gets also\nOne of the top of the spirit of Halloween I thought I'd try to scare you should get sixty successful hobby hey you know you ever see that cardboard cutout that I got floating around the arrow yes you realize how many veterans a couple of veterans I scared or putting that right at the front emphasis when you're walking yeah it looks like someone's just standing there looking at you\nAnd a female and mail that area so we don't I'm not you know I don't discriminate yes keep the recording agents away from me I did my service uh I've just\nYes keep the recording agents away from me I did my service\nI I'm just coming back from the the ... high school I got the interview I'm a student a empty on our about being a da ... suffering and daughters and in ... ... s excellent ah seems like every other day I'm going down to a real high to\nInterview a another student about the great achievements of ... as well as burns a lot to be said about the the caliber of the school system and the amount of ...\nYou know just to keep a balance because you've been doing a lot of work about all the wonderful things going on at ...\nFun things to there it is a\nA maybe two today about two thirty or so you can go to the detention center or detention Roman ... oh no no wait\nWhat time is it well school at what time in class and like I got to go on the up my kids uh I got to be out the door by like two twenty to thirty I I'd be otherwise I looked like a deadbeat dad picking the [laughter] it's like we don't want that we do not want that there it is All right we'll get high Oh thank you very much keep up the good work\nOr hey I got to ask you how the heck are you still walking from last night because again I personally I was ... you know like it's like a game last night\nNot as late as some of the others and hey you know a a ...\nBut if you have an early ... I I get up on the chickens like they're ... they're up around uh five o'clock sometimes even for\nThe ... yeah that's me now I usually get up at six o'clock today I slept in 'til six twenty six cents when the coffee maker is set and the smell of the coffee brewing wafting into the bedroom I bet you have ... news too don't you ... you probably turn on the news or sometimes if I Do I turn on a nest and\nSee if I turn on the TV the kids here that like an alarm clock dock mixed up and is PJ mass change the channel the harassment select turn off plus you know I like to begin the day with a nice book so for you yeah yeah yeah yeah so we actually we got you know the golden book series you'll gotcha yes\nListening to W. A. R. A. Thirteen twenty am Adel borrow\nBrown University who hosts the lecture cosmic shadows other worlds in fifth dimension on Thursday November aid from four to five thirty PM shadow ... patterns are cast throughout the universe by the gravitational field the stars and galaxies this talk will unveil how these cosmic shadows carry clues about the existence of extra solar planets\nAnd a possible fifth dimension the auditorium will open at three thirty PM proceeding and guess are asked to arrive at the auditorium no later than three fifty PM\nThe thirty PM proceeding and guests are asked to arrive at the auditorium no later than three fifty PM the lecture will take place at Brown university's ICU Ahram one Twenty one south main street on the eleventh floor\nStaying at home surrounded by family and friends resting comfortably with your illness under control and support for your family caregivers that's what most Americans want at life sand hospice can make it happen with the help of hospice patients and families are like can focus on what's most important\nEnjoying life together and living as fully as possible feel free to contact community in a hospice at five zero eight two two two zero one one eight\nYou can also visit community the N. A. dot com for more information\nDuring the conversation calls by the way to to to Thirteen twenty five I wait two to two Thirteen twenty or become a remote correspondence by texting seven seven four to eight seven six one nine for\nScientific getting with Paul and the ... I Am Thirteen twenty W. A. R. A. [noise] [noise]\n\n\nWelcome back [noise]\nTo pontificate ing with Paul and the ...\nThe other guy in the cowboy junkies Peter Timmons is fifty three years old today [noise]\nI never knew the guy's name and cowboy junkies\nWho cares about him he doesn't say but anyway he's fifty three years old today\nKen Carberry and his brother Kurt who own WC already in West or you know the station they fired me on April twenty seventh two thousand seven were members of the milk and players and last year a Milton players had a a\nHalloween party and he and his lovely bride\nAre dressed up like cowboys with a\nWell with fake fake a needle marks all over their arms at tourniquets on the arms and yes yes they were the cowboy junkies\nStudying but but we know some of it's\nNot a junkie gosh darn it well he is a junkie of one sort of the other eight whether junkie and that's the amazing Jim Corbin good morning Jim\nWanting Paul I was getting ready to\nJim core been good morning Jim morning Paul and I was getting ready to to to to to walk to yell at you this morning it was a brutal drive down in the rain but now it looks lovely out their lovely I tell you\nIt is getting better but speaking of weather junkies with monitoring for the last two or three hours of areas that have had a life ... last week or some rotation a loft in the clouds and in fact you may have been some water spot activity off a point Judith\nUh in South of Newport for about an hour ago and also uh there's also again uh just I felt isolated action but a possible water spout near Woods Hole\nAnd also a severe thunderstorm up on your midway a pass just to the west the battle battle these are popping up you're kind of late season popcorn type of action\nI wasn't up a liberal feature this'll be the last for a few days though but uh the tape right now selling with it you know the area and found that around ... twenty eight on there that was the section of town was called the ticket well that area\nWell what were you watch your language Powell watch [laughter] the ticket ... under the gun with a tornado warning now\nWhy why like last week again a lot of this is great our base and it's a lost but after the second time in two weeks I've been able to see looking south from your Mansfield a good amount of rotation in the clouds in the last hour in\nFact I did see I think I told you last week I saw that tornado ... from a distance wow it was shrouded in a lot of cloud that you could see the fast rotation are going\nFrom right to left and then left to right bottom line is or if you're going to be a heading out for the rest of today is going to improve but there is a severe thunderstorm warning out in fact all just west of Quincy right now uh uh\nWhere you were the other day at the game with rocks three under a severe thunderstorm warning I bring the follow up because it's a ... system and so the clouds to look a little metal thing they are voting rotation in the clouds again\nIran Medway near ... one oh nine if you know that area yeah again this is all moving away from adults are but\nMedway near ... one oh nine if you know that area yeah again this was all moving away from Adel barrel but uh it's an indication of pretty potent systems so uh one last gasp of rain is one more shower that's about to move into south west Rhode Island\nAnd that could clip parts of the area said another hour and that should be about it we're going to have a son poking through and then they'll fill back in with the sunshine in those\n... clouds for the rest of the afternoon going to reach about fifty five now I Know Tom strengthening the temperature all morning Paul fifty eight fifty down to the breeding that one that's in the window what's the thing in the window saying oh I don't mean saying what is ...\nAh yes thank you very much uh fifty eight degrees outside sixty eight degrees inside\nI think that one I'm going to have to come in or this weekend to reset it like a it's not fifty eight degrees outside it might be maybe it's in the mail box I don't know but\nHey ray [laughter] no but I Know but it is going to reach about fifty five this afternoon it's right now about fifty okay I thought the point being being on no real\nShow this week which is good news tonight falls to forty with clear skies or clearing out maybe a nice looking sunsets evening again scientists studying now with a quarter of six it will be setting a quarter of five this time next week now as we go into tomorrow beautiful day bright sunshine all day northwest wins a hive about fifty\nSo here we go again with these cool bright days followed by an occasional rain maker like to get over the weekend\nI bet on Wednesday as he is still the good news for Halloween Paul a good news in terms of no bad weather and I'll talk about what happened of course I mentioned seven years ago no bad weather this\nHalloween we're looking at sunshine breezy conditions a hive about sixty on Halloween of self and of course a a paralegal Red Sox will have their fun time in Boston on Wednesday late morning and the weather should be good for that uh fifty five degrees I'm thinking around six o'clock Wednesday evening the trick or treaters\nAgain that's an average time or within a few degrees or the mid fifties and then how about this we may be talking about\nFirst time I was in a few degrees of the mid fifties and then how about this we may be talking about here I say Native American summer returning\nOoh Thursday is no longer is that the I word it's the Native American summer on Thursday southwest wins sixty six sixty seven degrees with sunshine briefly conditions on the first of November wow what a Thursday the day after\nHalloween all saints day and then on friday that's our next chance of rain this fall all week as always because of course high school football again a friday evening there is a\nSomewhat of a decent chance of rain but if the timing is off it could be a little bit delayed or somewhat before so stay tuned on that early indications are the weekend Sunday is the sunny day Saturday could feature a little rain in the morning\nWhat's their British yeah you have\nBy the way you mentioned seven years ago and someone else had talked about or Texas or I gave you the information about it uh we had we had had what a year two thousand eleven was do you remember that year whether two thousand eleven\nNot as much as you do [laughter] well that's that's true yeah that's\nOne of his one of the events is the last day I was a channel sex but\nAnyway [laughter] eleventh what happened in Iraq no sarin\nRock and that was the that was the proceedings spring of ... someone took a sledgehammer to an old lady but no but seriously I that's what started it\nShe got a black guy but it was the land and I related Linda brought brought into Lenin or whatever so and you know those the city of sin Lynn but anyway let's talk about what happened again June first of two thousand eleven we had those tornadoes in Springfield yeah of course it's a couple of ... and a lot of damage some of it all the way into west or comedy\nThat and\nWelcome back about ... ball and the ... at ...\nAt least on guitar to know who's singing wedding wedding is the song written of course about the two thousand Eighteen\nFighting Red Sox who won the world series last night against the Brooklyn excuse me Los Angeles fighting Dodgers um\nBrooklyn excuse me Los Angeles fighting Dodgers I'm Jim corporate and I disagreed on the microwave oven earlier he's devoted to it to meet me I avoid the\nKilling machine and notice the microwave oven\nAs often as possible give me a toaster oven give me a toaster oven for having sex or another thing we're against here on pontificate him with Paul any pro Terry it artificial intelligence really really hey I Know guys\nLet's build machines and computers are that are smarter than human beings what could possibly go wrong\nWhat could possibly go wrong hold on let me get to this every four and\nAnother thing we're against a hero pontificated with Paul and the ... self driving cars self driving cars are you kidding me as we said before we already have self driving cars you know there are things called trains buses subways even taxis movers in lists for heaven's sakes [noise]\nUm but if you think your commute is tough now wow wow just wait until every car on the road is computer programmed\nTo follow the rules while wow\nMillions millions and millions of cars program to drive like our own beloved Tom Rath pretty\nYou think it takes you a long time to get somewhere now just wait in a recent survey by M. I. T. the Massachusetts Institute of technology who I used to be a big fan of but MIT or might be the world leaders and artificial intelligence yeah\nA according or in a recent survey by M. I. T. millions of people who were asked about the scourge known as self ...\nIT millions of people were asked about the scourge known as self driving vehicles and how they should prioritize when an accident is inevitable the results are revealing most people would prefer cars excuse me [noise]\nMost people would prefer cars that prioritize saving people over saving animals and may also lean toward saving younger people rather than older people wow\nSo the self driving car heading towards that intersection all people are in the road and self driving car determines ... all this isn't going to end well for the humans these jerks are about to get blood all over my bumper but then it has to decide which humans to hit\nDoes it hit the young oblivious millennials who have no idea of the cars coming because they're looking looking at their stupid smartphones are crossing the street\nOr or\nDoes the self driving car engage in age discrimination age discrimination in this nation it's another scourge\nAnd wipe out the old people they've lived their life anyway they have no covered age left in their knees [noise] actually might support this it's mostly old white people who voted for him\nWow yeah\nResponding to the MIT survey we're more inclined\nTo hope that the self driving cars or would save baby strollers pregnant women and doctors wow so if you want to protect yourself from a safe driving car\nWhile so if you want to protect yourself from a safe driving car or go to the store buy a doll buy a cheap baby carriage and always push that in front of you that will keep you safe or from the cars or or or ladies if you're not pregnant these costs will be designed to avoid pregnant women\nMight want are walking around with a pillow under your blouse or doctors doctors for those of you dressing up as doctors or can I borrow that white doctor's code that they all wear for those of you dressing up as sexy nurses you're on your own\nUm the people who took the survey we're less inclined\n[noise] um\nTo have the self driving cars save people of heavier weights and higher class people like executives wow wow so not only are we discriminating against old people\nNow we want the self driving cars to fat shame the citizens of this nation wow wow\n[noise] take out the large people first really really guess that'll make airplane travel more comfortable and higher class people like executives\nOkay I can get on with that for that I can that that I can I can accept that\nPart of the motivation part of the motivation of the self driving car is hanging the rich I'm okay with that\nUh when it comes to saving animals many people would rather the self driving cars save a dog then save a criminal wow so if you're going to Rob a bank and your dashing across the street to make you get away a dog costume wouldn't hurt\nThank you and your dashing across the street to make you a getaway a dog costume wouldn't hurt could save your life cats also ranked lower than both dogs and criminals\n[noise]\nWhich I understand again kittens I get how can you not love kittens cats cats yeah gosh what awful creatures the results also very between countries the preference to spare young people over old people\nAre were much less pronounced in places like Japan and Taiwan where they respect the elderly than they were in Brazil and the United states of America\nWhere we have contempt for The Elders for the wise ones wow and there it is a couple of remote correspondence that seven seven four to eight seven six one nine for aging twenty checks in from Fort Myers Florida home of the ... home of Fenway South\nRed Sox spring training or they send their love and congratulations to the Boston fighting Red Sox agent twenty didn't say fighting Red Sox I did but thank you agent twenty checking in from Fenway South in Fort Myers Florida\nAnd then Kevin Callahan rights sent you a long and rambling email oh my heavens wow\nOkay we'll get to that Kevin five away to two to one three two zeroes the number five oh wait two to two Thirteen twenty\n...\nMuch as we're against a self driving a ton of scars on this program I Can't think of a dumb idea where for the jets immobile but we're against autonomy driving vehicles I'm In a crash situation the cars have to be computer programs okay who do we spare who do we take out wow\nThe cars have to be computer programs okay who do we spare could we take out\nWow\nIt looks like a most people think according to an M. I. T. survey and I think an MIT survey means that only people would pocket protectors and or slide rules are allowed to participate in a survey of it they think the car should save\nYoung people had of old people young people have their whole lives ahead of them old people have no cartilage\nWow wow\nYoung people are going to vote for question three in the November ... election algae Beatty people are people too old people still think they were weirdos\nWow wow\nThink the economists cars should save dogs but not so much cats how do you think the economists car should be programmed who should they save who should they take out\nUm oh and then Mr blue pride rights and I'm very happy for you you have loyal listeners in Florida that's great you're darn right it's great and just for that just for that we're going to play a blue song when we come out of our ten thirty break and then they have a question for\nAh for Asian to twenty four Steve he is a science fiction writer so I'd be interested to know that who Steve thinks the economist vehicles to save and who they should wipe out\n\nAnd the way he started the or for\nThe email well now I have to read it as a ... coach Dave of accordion cool scene right here on double A. C. S. Fifteen TV\nDave writes all great prince of the airwaves flattery we'll get your everywhere\nAs you may or may not know during another lifetime beginning at age forty Iran my age in miles on my birthday wow of course knowing I'm a friend of David ... that should not surprise you have to go over a of Boston Marathon fame\nHowever after a while I got older and older and the doctors started cutting and the long runs faded into oblivion however the competitive juices did not so on November thirtieth Hi Dave la Brea coach Dave of accordion cool fame\nWill celebrate my Seventy seven birthday by playing the accordion for seven point seven hours that's seven hours and forty two minutes and not a single poke a song among them\nI Will begin at eleven AM and start every hour on the hour after that playing for Fifteen minutes out of every hour the last forty two minutes that will begin at\nSix PM\nSeveral musician friends will be coming in at different times to play at least one set with me the event is being held in the new the new conference room\nThe event is being held and the new the new conference room\nOf your okay of everyone else's also radio studio oh wow\nScheduled for the noontime hour is three time world accordion champion and Guinness record holder for accordion playing duration Corey pass a tour oh did he ever appear on the Lawrence Welk show Dave\nAs you will still be on the air when I Begin the event and if you'd like to interview Corey I can ask him to come in earlier before his ... slot at noon\nHe is very interesting and other avenues besides accordion playing and is a very good interview I'll write anything you anything you can do to help me promote the event will be greatly appreciated thanks Dave coach Dave accordion cool\nOr Gmail dot com wow well day we will set that up going to play accordion for seven point seven hours on a Seventy seventh birthday or Dave\nI used to be a runner Davis in great shape despite his recent shoulder surgeries are Dave Dave will be able to handle seven point seven hours of recording playing quite quite easily [noise]\nWell the audience be able to absorb and handle and survive seven point seven hours of recording music that that has a different story um oh you defend slip and fall claims agents six yeah that's what I did too\nI used to defend them as well but anyway\nCarol is just look we're just looking for medical bills call of covered any deductible she has to pay and uh well like for example lost wages because she's missing time\nHas to pay and uh well like for example lost wages because she's missing time from work to go to the doctor to see how smashed her right smashed elbow is you just send them\nAll right so you'll be happy with the type of um we won't use an attorney then which will be good news good news for the south shore plaza five away to two to one three two zeroes the number five a way to to to Thirteen twenty coming up to uh ten forty five\nSteve this is for you\nOn here we have another remote correspondence it's seven seven for\nOK okay agent sex um\nCoach day seems to be quite impressed with himself that on his seventies seventh birthday he will play the accordion for seven point seven consecutive hours\nUm agents six moving from his or taking off his attorney hat and putting on his marketing expert hat recommends is playing the accordion for seven point seven hours naked would be quite the accomplishment and could spur greater attendance\nAt that depends who's naked age and sex [noise] [noise] yeah Steve does this offend you\nAgain agent to twenty four one of our science fiction or writing fans and a vision impaired who gave me four gave me a couple of weeks ago when I forgot I forgot to mention it was national white cane day\nAlerting the rest of society to get your head out of your smart phone while driving watch the intersections and make sure you don't run over anyone using a white cane through an intersection so I'm interested to see if [noise]\nAnyone using a white cane through an intersection so I'm interested to see if\n\nAfter I read the story your reaction is yes yes punish those insensitive people or if your reaction is\nWhat are you kidding me [noise]\nYet another Halloween costume is being blasted for being\nInsensitive\nThere is a topic what holiday costumes did we wear with pride pride as kids were friends did that no more insensitive\n...\nThe latest offensive costume is that of a blind referee which is getting backlash\nBack last year I tell you for making a joke at the expense of blind children they're not making the joke at these expensive a blind children they were making a joke at the expense of while the blind referee who blows all the big calls the NFL just fired unofficial over the weekend he was so lousy wow\nMore on that but first let's go to the phone lines at five oh wait two to one three to zero good morning\nSpeaking of firing people ... [laughter] I just I think I just got voted off Twitter gosh wine but ah [noise] you know hate speech\n... well I I don't know you tell me this is what I tried\nOkay\nWhen president of the country and kind of a violent shady directly responsible for a new violence\nYes you think I should have gotten to that\nWell it's a very sensitive time Donna and they're trying to tone down the rhetoric but I Know you know the the Republicans conservatives are going to be saying what about Maxine Waters\nOh you know they're the Republicans conservatives are going to be saying we're both Maxine Waters she says me stuff what\nAbout people who could front so we're just trying to do no yeah well they're not in front of a norm board rally of thousands upon thousands of willfully ignorance that white people trying to incite violence\nWow I thought that says it is safe sightings and that shouldn't be allowed but you know there are there are not ... anymore if you look at you look at a specially the last thing he's got a little tiny group behind him\nAnd the uh the echo you can hear the echo in in the hall yeah it had another body then they're sort of thing that you know the sound and everything\nAnd they're not even there as volunteers daughter there are paid by George ... I mean the Koch brothers to be there [laughter] I Know I don't believe that they are there willingly but it is sad it is a there are so many people who are tend to Nuremberg rallies see how but I mean it might be some\n... exactly selling 'em they must be some people who enjoys being that if\nThey get seen on TV and you know they can probably a cousin will lead to watch 'cause I'm right here in a way that you really you know and they feel like they're important but the man is inciting violence and I thought that was against the law\nOnly at every opportunity I don't know for what he's doing is against the law it's against basic human decency at every turn 'em promoting allies in his first\nYeah you're not supposed to incite incite violence\nAnd if they're going to blame you for inciting violence on Twitter well again he never has to pay a price for anything he does it is part of his mystical con man appeal it's amazing you know we we have all kinds of people resigning and losing jobs over alleged alleged a sexual uh yep violations this guy isn't it\nThe ledge or sexual uh yep violations this guy isn't it fitted admitted in his own words on tape nope doesn't stick to him [laughter] yeah oh well\nThey're all the rules that he made to other people like if you don't admit that you didn't do it like the food and\nKevin ... that doesn't even applied for him so [laughter] oh well it's just crazy yeah ... yeah\nDid you did you say earlier are we talking about the Muslims who are getting money to the synagogue and stuff\nYes violence yes it is not one that is a lovely thing that's very lovely\nYeah I Wish Americans knew more about the Muslim religion well all they all they know its allies and the next election during the ignorance\nWhere we're going to that we've got a degree a little bit on that I mean I'm\n... I'm not a huge fan of Islam I don't think it's as terrible as we make it out to be here but I'm the one hobby form of Islam\nNot all Islam not all Islam the wasabi form of Islam practiced and exported by Saudi Arabia and most of the terrorists believing that more of a well hobbies Sunni Islam a hobby Sunni Islam is is\nOn Halloween and an age of twenty from Florida [noise]\nWho Asian twenty twenty I'm going to save your remote correspondent for the other side because that's a political one that's not a remote correspondent about [noise]\nYes the fragile feelings of people whose feelings were hurting with are terrible mean insensitive Halloween costumes [noise]\n\nYou're listening to W. A. R. S. Thirteen twenty am ...\nOn Thursday November eighth six thirty PM Pam Holland presents discovering cousins using DNA to Richard the memorial library in North out over all this talk will show how to explore matches and use the tools available at the major DNA testing companies\nIt will focus on practical ways to discover relatives in order ... cousins for more information or to register you can email librarian Maggie homes ... am homes at ... dot org\nDoes your back hurt after a long night sleep has your mattress seen better days\nIs your current bedroom furniture a mixture of different furniture sets the betting Centre located unpleasant street and proud sponsor of this radio station in high school sports off as a wide array of mattresses along with beds bedroom furniture and odd size mattress isn't box springs you can reach them online at ... dot com or by phone at five\nZero eight two to six eight zero nine zero\nJoin the conversation call us either way to to to Thirteen twenty five a way to to to Thirteen twenty or become a remote course\nThat's by the way to to to Thirteen twenty or become a remote correspondent by texting seven seven four to eight seven six one nine poor punch in the getting with Paul and the ... am Thirteen twenty W. A. R. A. [noise]\n\nWelcome back to pontificate him with ball any roller terrier here\nThat's habitual offender [noise]\nBy Ted Nugent person I find offensive\nUh Halloween costumes are they not Halloween costumes anymore or are they now are they now instruments\nOf offense [noise]\nAre we habitual offenders [noise]\nYes are we habitual offenders when you dress up for Halloween or we hurting the [noise]\n\n\nYour costume hurts my [noise]\nTo cross to emerge my feelings wow what about my needs [noise]\n\nWow well apparently Amazon responded to the backlash of their blind referee costume they quit\nResponded to the backlash of their blind referee costume they quickly remove the costume from the site noting all sellers must follow our guidelines\nWow what do you think is that pretty distasteful the blind referee is that intentionally offensive to young blind children [noise]\nHow do you feel about the blind referee costume folks do you think it's funny\nOr distasteful man\nI mean if you're a sports fan you have complained about officials before do you think Colleen costumes are getting to\nPC politically correct these days have you ever dressed up in a costume in the past that you think wouldn't fly today what was it I mentioned mine I not once not twice was a hobo complete with the stick with a little uh gunny sacks thing on the end of the stick\nWhich was a good place to put extra candy when I was a little drummer boy\nWas that being offensive two small boys who wanted wanted to go to war and blow the snot out of their enemies but gosh darn it were old enough yet did that hurt their fragile feelings when I was the tin man from the wizard of Oz\nWhen I was the ten men of the wizard of Oz was that offensive was that offensive\nTo God's creatures that don't don't have metal or ten in them was that costume um support us support of the evil fossil fuel industry because the man costume to Tim and can't function without oil oil\nOf the most horrible things on earth next to plastics which are made for oil stunning wow a couple of more and more correspondence it's seven seven four to eight seven six one nine\nTourists want it to seven seven four to eight seven six one nine four oh I'm\n\nHaitian fifty five well God anyone dressing up as Liz Warren you might offend owners of jeep Cherokee\nReally what if someone instead of walking with their rotten little crumbs crushing spoiled brat kids on Halloween Night instead of walking from house to house is escorting them from house to house\nIn their jeep Cherokee and they see see\nSome little girl in the lives with Warren costs too well that's offensive to them [noise]\n\nDoes anyone else have audio pro problems with you being so loud music an ad so soft have to keep\nAdjusting the volume or smart speaker yet it's somewhat turn this microphone up I've oh my gosh why is that plus six decibels today someone did turn that I'm you know what I'm Sorry\nSettings are or what I'm usually used to agent or fifty five\nAnd yeah I'm just noticing that\nMike six one I'm using was turned up six extra decibels hoops didn't notice that rats rats will try and do better\nFive oh wait two to one three to zero five a way to to to Thirteen twenty okay agents six I get offended watching baseball when the catcher gives a secret signal to the pitcher so secretive\nAnd isn't that offensive visa my words now not age and sex isn't that offensive to young blind children they can't see the catcher giving the signals\nWow they can't see what used to be relatively quick process one finger fastball to finger curveball three finger change up to now an endless endless series of deceptive hand signals\nAn endless endless\nSeries of deceptive hand signals which takes forever to try to fool the batter\n\nAnd then Jim carbon says won't be long before dressing up as a witch or a ghost will offend some people for a ridiculous reason well dressing up as a witch offends anyone who practices the religion of Wicca\nReally really all which is a raw glee please have we learned nothing from blend of the good which of the north in the wizard of Oz and dressing up as a ghost dressing up as a ghost that could offend the fans of X. files wow\nFive oh wait two to one three two zeroes the number five a way to to to third team twenty coming up at eleven thirty a\nBecca routes will be joining us candidate for mass state Senate Norfolk Bristol\nAnd a Middlesex district or Richard Ross from rent them has held that seat I think let's see Seventeen Seventy six with a declaration of independence Seventeen\nLate eighties when the war finally ended I think he's been a state senator and in a ... from ... in that district I is it Eighteen twenty four I think it's Eighteen twenty four that's what I'm going with\nAnd a Becca Rausch\nA is a challenging him for that piece of five oh wait two to one three to zero five a way to to to Thirteen twenty\nUm\nThat's something for my brother rich on an unrelated matter these Halloween costumes every going too far too far in saying what is and it's not out of bounds it goes back to that question a cinco de Maya last year when those terrible horrible vicious in\nTo that question a cinco de Maya last year when those terrible horrible vicious insensitive moral\nYale professors war some bread rows and fake mustaches is there anything in the history of the world that could be more offensive to Mexicans\nWow yep\nWe have a president who can tell us they're all rapists and murderers coming here to steal your women and your jobs and the American way of life that's fine\nThat gets thousands upon thousands of willfully ignorant fat white people sharing it his Nuremberg rallies but no no no we can't have college professors wearing some bread rows and fake mustaches\n[noise] isn't it amazing you act like a racist blow hard and your praised [noise]\nYou put on a stupid Halloween costume and your terrible wow\nThe thing so I went back a couple of days later just to grab myself a single Miller light or whatever and I says and I and I notice he put outside of his uh establishment\nHe said America is are adopted homeland we thank you for allowing our family to immigrate here wow\nWe are Sikhs we are not to be confused with Muslims\nYour patronage has greatly appreciated and I'm paraphrasing what else was on there but ... says I thank you for welcoming us so I said no ma'am I go so how's it been going he goes all we've\nWe've had a few a derogatory comments and I go such as uh niece's sand and words and things like that and I and he goes\nYou know he goes it's kind of be it'd be expected\nBut he says I appreciate the fact that you know you told us about the American flag and he had a whole bunch\nOf them just posted around the perimeter of his gas station and I said Raj there's a lot of ignorant people in this country unfortunately but I says I Will never forget the time when I showed up to your gas station and they filled up both tanks and realized I left my wallet at home\nAnd as you've been coming here for four years now why don't you think you really think you got a rotten [laughter] no no no but I says I I'm I'm Glad for you you know he goes\nYeah he says it's it's an awful time in this country right now and I'm America strong um America was resilient and we'll get through it and lo and behold you know\nUm you know it's everywhere I've gone everywhere I've gone in this country though you do see people that are from India and Pakistan running convenience stores\nThe people that are from India and Pakistan running convenience stores\nAnd unfortunately there were members of the Sikh community who were murdered after nine eleven yes\nIt has it in California and a a highway rest stop a man was beaten to death because in the only the only way you can stop this kind of hate\nThat is going on in this country right now is when you you when you ... ... and you know I'm not a sanctimonious liberal yeah I'll be damned if if I hear someone\nDropped the N. word or a a derogatory term term towards um Mexicans or a juice oh no I'm the first guy to say hey that's unacceptable totally on again\nThat's out of the bounds of basic human decency and there it is but that's\nA it's very depressing I have one theory on how to stop the spread of hate and horror I'm not my band men theory you've heard that one before but I'm I'm Wondering when I become benevolent czar if I should ban the inter Web 'cause it used to be if you're a member of one of these nut case fringe groups it took a lot of work\nTo get in touch with your other members of your not case fringe group you know you had to grapple not that\nThat is true and luckily ah the Ku Klux Klan if\nWe go back to the Nineteen fifties I mean my wife's from Alabama she's black and she can tell you that with regards to that state to be a state trooper in those days it was a prerequisite you had to be a member of the clan\nWow yeah absolutely you know\nSame thing with Mississippi I mean luckily ah things have changed but you're old enough to remember CB radios right yes ...\nIn the seventies when they went through those praises well what ended up happening that was a form of communication basically social networking everybody was really nice on the CB radio and then about three\nSocial networking everybody was really nice on the CB radio and then about three months later they just turn to\nA whole bunch of where\nYou would never talk to somebody ah in in a face to face the way that they would talk to one another on CB radio as in how to Tom notice\nI was a salesman or to radio shack in in um Fox for all off of route one forty at a radio shack there and I used to turn on the base station or closing up at night yeah listen to these radio Rambo who you know\nJust trash talk one another and that's what's happened to Facebook would face book came out originally\nYou got a hold of your old friends and wow look at this he's got kids you know you look at this he's got a nice home and and if it got political\nA rat's look at this his wife is better looking than mine crap yeah [laughter] yeah I've lost his hair [laughter] yeah I used to look like the bright girl in high school or our look like Homer Simpson [laughter] wow\nHey Tom last thing and then I got to go to get ready for our next gift you know in the movie the blues brothers those members of the Illinois Nazis yes we all hated they yes they really had to work you know how long it took them how much time it took for them to get together\nNowadays with the intern Web now now it's very easy for them to to get together and many think they're very fine people um the into Web\nTalk about a double edged sword it has access to all of the knowledge in the world and what do we use it for porn and posting angry ... very very sad\nYeah it is I I well I I I'm ... after this past week and what happened with a shooting in the synagogue bomber\nI think mankind it's going to be like a ... bad Charlton Heston movie of the planet of the I think we're just going to to notable Iran's gonna develop a nuclear weapon they're going to blow up Israel and then [noise]\nNovel Iran's gonna develop a nuclear weapon they're going to blow up Israel and then everything's just gonna go to hell yeah um I think I'll be in the mountains of West Virginia okay but none of my my own little hall or in my own little world\nI think Saudi Arabia is a bigger threat than Iraq but your point remains valid Tom thank you so much for calling and have a great day I Will take care of their egos\nFive oh wait two to one three two zeroes learner verifiable way to to to their teen twenty bursting bursting into the studio uninvited\nBut fortunately she's the FCC monitor of the program and is a trained professional show she will speak into the microphone hello Margaret how well well I have to give you the bums rush 'cause we have a guest coming up soon but what do you have there on your hands only\nEight yes\nUm movie of a man called Ove\nHuh what's it about man\nOkay I don't know you haven't seen it yet you'll find out who you know\nSexual alright Well Margaret normally we spend more time with you but I've got to get to this break early and it but it's so good to see you\nAnd take care and don't you go changing how old are your um how are you to gifted or three gifted children\nShe shaking her head I guess she doesn't believe that all three are gifted anyone I put me in a I'm\nA ... well you know the only\nOkay well [noise]\nNapkins I'm all over the strange yeah that's\nOf [noise] they want to take away your freedom because they love you they love you yeah I\nKnow right there will be back after this and Thirteen twenty W. A. R. I. moving on from offensive Halloween outfits moving on from offensive things that shouldn't be offensive and moving back into local politics as we will split you speak to democratic candidates\nOffensive and moving back into local politics as we will split you speak to democratic candidate for Senate a Becker Roche\nAnd boy oh boy oh boy I Hope I'm not pushing her name Margaret ah Andrew campaign manager cat climb a Rebecca is a democratic candidate for state Senate or Norfolk Bristol and Middlesex um\nDistrict or enter opponent is the incumbent since we determined Eighteen twenty four Richard Ross of rent them we'll be right back after this on Thirteen twenty W. A. R.\nS.\nDogs and bringing up their own ... and James you to use that as\n\nLand those kind of\n\n\n[noise] you're ...\nOh you weren't ready for a break you know I was okay oh wait about now fine you're listening to punch advocating with Paul and the ... I Am Thirteen twenty W. A. R. A.\nRhode Island college will hold their full open house on Saturday November third from one PM to for thirty PM in the very center prospective students will have the opportunity to meet one on one with faculty and staff to learn about programs in student services students can explore Rick's campus tours of the quad\nFind a performing arts center residents holes in the rec center there will also be academic presentations and an informational presentation admissions in financial aid\nStaying at home surrounded by family and friends resting comfortably with your illness under control and support for your family caregivers\nAnd comfortably with your illness under control and support for your family caregivers that's what most Americans want at life send hospice can make it happen with the help of hospice patients and families are like can focus on what's most important\nEnjoying life together and living as fully as possible feel free to contact community in a hospice at five zero eight two two two zero one one eight\nYou can also visit community the N. A. dot com for more information\nChest fall now seven seven force wake Seventy six one nine four but don't expect the reply because he's old and has a flip phone hey I'm Thirteen sweaty W. A. R. A.\nYes um I Am\nSupported by many of our elected leaders including more Healy who is a fighter for the people at these\nBills the name wrong but we still [laughter]\nWow ... ... out of there it is [laughter]\nUm I'm also endorsed by the Sierra Club and the Massachusetts women's political caucus and the Massachusetts Teachers Association the American federation of teachers are the Massachusetts AFL\nTeachers Association the American federation of teachers are the Massachusetts AFL CIA oh I'm I'm missing a bunch I'm sure I have been endorsed by many many many organizations that are fighting on the ground to make sure that people get a fair shot at living our happiest healthiest live to protect the environment and advance\nMay you know the uh transportation systems and education and\nTeachers and workers' rights these are all the things\nThat are crucial to people living good live and frankly that is the job of a legislator get out there listening to people work together find commonality and then make positive change for all of the people living in your district and and frankly the\nCommonwealth of large okay now what motivated you to run against senator Ross and I guess by that I mean do you see senator Ross is one of those reasonable Republicans like Betty poor you're around here Julie hall or around here a candidate for a state rep and the second\nAh Bristol district more Charlie Baker as an old fashioned ... Republican or do you see your opponent Mr Raasch\nAs one of those um [noise] that corrupt crazy ones for Freedom Caucus or or one of those Republicans who I don't know where their parents went wrong and raising them actually support\nHim you don't really need to headphones or lessen until we get a phone\nCall or that there is a kind of like um they make me feel like I'm you know in the radio zones yeah um\nBut no one motive vote motivated to run against Richard ... he's been there you know he's been a public service a long long time in my view he's one of the more reasonable Republicans not what it indicates ones what's he doing wrong and what can you do better\n[laughter] sure I appreciate that question let Mr us as a nice guy right he runs a funeral home of course he's a nice guy he works with people at some of the most challenging moments of their lives and we have really different ideas\nSome of the most challenging moments of their lives\nAnd we have really different ideas about what good legislation looks like right I Believe strongly that we need public education funding reform\nI Believe that we need particularly evidence yet again over the weekend that we need some commonsense gun violence prevention I'm very proud to be among demand action gun offense candidate\nAnd you know we need active leadership to make sure that we are protecting our environment and in fact investing in our public transportation system it's not accessible transportation when folks down here in Edinburgh can't get to Boston on public transit for less than thirty bucks that's really expensive and\nYou know I Believe in women's health care and reproductive freedom and that is something that I'm hearing from people all across the district that people are really really worried about right I mean\nOur bodies are on the line here and um my opponent if he had agreed to a debate with me I Would have you would have heard a lot of these differences\nAnd you know the differences we we can all be nice people in fact we we were all nice folks and we can still have very reasonable\nDifferences in terms of how we approach the job in general and also the various points of policy that in some cases really make or break people's lives\nUm we're going to get to a break and just one second we're back on the other side with Becca roast use a candidate\nFor the uh Norfolk Bristol Middlesex state Senate seat currently held by Richard Ross of rent them you can call the show at five oh wait two to one three to zero and you have to do with the way to do five o two Thirteen twenty or you can touch the show and become a remote correspondent at seven seven four\nTo eight seven six one nine for the seven seven\nSeven four to eight seven six one nine for that seven seven four to eight seven six one nine for before we go to the break out what office do you hold a need and what is your political experience\nI Am an elected town meeting member and need them and I'm In the middle of just completed two of my three years of my term\nExcellent okay and I said you have two children yet how old are they\nAre the older one is just coming up on four and a half and the younger one is going to turn three in January which one do you love more [laughter]\nI Love them both they are just amazing wonderful can ...\nYou got to deal with the tough questions and the ... we're going to take a rod nine forty five break we'll be back on the other side with Becca she'll be here till the show ends at twelve noon on Thirteen twenty W.\nA. R. S. nailed the dramatic pause [noise]\nSorry it's time for a break on AM Thirteen twenty W. A. R. A. more of pontificated with Paul and the ... next\nOn October thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl T bogus a cathedral of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guests will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at thirty Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy are you\nPolicy argue one of the thirty million Americans who skip breakfast every day we don't need to remind you that skipping breakfast can have a detrimental effect on your health the breakfast place located at one eighty seven pleasant street across from the show gas station has been serving their customers meals are made to order for over thirty is\nUsing vegetables from local farms in cage free eggs owner Casey dark Conti opens the breakfast place every day from seven AM to one PM for breakfast and lunch\nAt those on the go all meals are available for takeout\nYou're listening to pontificate with Paul and the public period I Am thirty one a W. A. R. A.\n\nWelcome back to pontificate ing with Paul any pro which area we're still playing songs with veal or feelings in the title cars are very concerned about people whose feelings are hurt by Halloween costumes no but we're taking a break for that discussion to talk to Becca Roche spell the last name\nAre a U. S. C. H.\nPeople want any information on your campaign has candidate candidate for the state Senate or the Norfolk Bristol Middlesex a district how did they get in contact with you\nYeah you can go right over to the website it's ... dot com that one word be all one word B. E. C. C. A. R. A. U. S. C. H. dot com or you can also shoot us an email at campaign at ... dot com and we'll be right back\nTo where the heck you campaign manager this morning ... Klein and she's sleeping in or something [laughter]\nI Know she is definitely not [laughter] we've already been in close contact with our our whole team I'm incredibly proud of my team\nUm and they are all each in their own right phenomenal individuals and we come together as a really fantastic team and I'm incredibly proud of everything that we've accomplished um and we are all\nEverything that we've accomplished um and we are all you know full steam ahead heading into these last days of the election\nOr just to get people in general idea of your political viewpoints mom was ripped through in the lightning round series a lightning round of the um because I Want to get more information about your your positions but I think this was a good way to set the table the ballot questions on the November sixth ballot or get washed and one\nQuestion wins at the exact number of patients that nurses or should be assigned to or or get the hell out of their way and let hospital administrators who knows how to run hospitals set the limits and not thousands of voters who don't know a darn thing about hospital management where do you stand on that one\nSo you know I Want to preface what I'm about to say by saying that I as you know I'm a mom I've had two young kids I have been in and out of the hospital more time since the first one was born he'll tax day when the when the second one was born you know in like a ... year period more times in that period\nThan ever before in my life combined\nUm and I know from personal experience how important it is to have nursing staff you know with you and helping you among the way\nUm and I really really appreciate all of the health care that that I have received in so many other people have received particularly here where we have some of the best healthcare institutions in the country\nAnd be careful because with about forty years your kids are going to be saying I've spent more time in ... a nursing home [laughter] that my mom [laughter]\nFair point across that bridge when we come to it um I also really really firmly believe is in our democracy and and the way our government is structured\nAnd having worked in the executive branch um I have CNN closely and frankly also saw this in my work in the ... in the private sector um the interplay between the executive branch and the left\nIn the ... in the private sector um the interplay between the executive branch and the legislature and the judiciary\nAnd I believe that if government is going to mandates a minimum ratio or ... or ... depending on how you look at it but a minimum ratio or a maximum ratio\nUm of staffing in facility and men and should be done in regulation and not in statute which is how we for example regulate the number of children that can be in a daycare facility or\nTens and making sure that once in office at the state level we can play meaningful legislation in place so that people actually get to shake that each and every one of his desserts particularly our kids particularly working folks veterans and everyone in between\nThere it is that's Becker Rausch agent eighty six right since she sounds like a great candidate but what about her opponent do we get to hear his ideas are yeah we have reached out to Richard Ross\nBack at us and get to hear his ideas across the debating platform 'cause he won't do that but oh well I'm also opioid issues help for addicts ah we're out of time so very quickly should we deal with opioids as a public health issue or should we just get tougher and punish these people\nThis is a public health crisis like we have never seen before and it should be addressed that way\nThat go rush thank you very very much or if they feel I can call in to the show before November sex\nAnd uh this April or check out the ... the fringe theater on highland ad in a need them at the Episcopal Church it's a funny it's a fun English form of a farce and pets though and I've been in that show the past few years when I look forward to it Becca Rausch dot com running for state Senate in the Norfolk Bristol Middlesex\nUm district thank you thank you for having me hey All right folks that's going to wrap it up\nAnd a Amy Goodman is next with democracy now I'm Thirteen twenty W. A. R.\nHey\nNail the dramatic cause you are listening to W. A. R. A. Thirteen twenty am Arab world\nAs we wind down the month of October temperatures will be near or a little above average will have fun and clouds the rest of the afternoon a breeze out of the west south west a high in the mid fifties cooling off to about forty tonight not too tough to take with\nSkies becoming mostly clear and lots of sunshine tomorrow ten and a half hours of it that's it but\nIt will be out there high temperatures in the upper forties a breeze out of the northwest clear fall into the low in mid thirties early on\nHe's a breeze out of the northwest clear fall into the low in mid thirties early on Wednesday morning Halloween day itself son John becoming breezy in the afternoon a high of sixty looks like about fifty five on an average do the early evening hours for trick or treaters and how about this for Thursday so I'm John breezy\nEyes limit sixty some rain by Thursday night for Thirteen twenty am W. A. R. A. entrepreneur been a joy\nBe\nFrom let's say my God this is democracy now this is the most horrific crime scene I've seen in twenty two years of federal here just fish and members of the tree of life Senegal conducting a peaceful service in the place of worship brutally murdered by a gunman targeting them simply because of their fingers\nPittsburgh is in mourning after a gunman opened fire at a\nSynagogue on Saturday morning killing eleven Jewish worshipers and the deadliest anti Semitic attacks in the United states history\nMoments before the master\nPosted a message on line\nThe Jewish organization highest which helped resettle\nRefugees from around the world\nWill space with two highest volunteers in Philadelphia rabbi\nAre eleven coronary and Davis lobster a retired doctor we think uncle of Stephen Miller\nLewis helps flush some of President Trump's most hard line anti immigrant policies then to Brazil which I err both to NATO a far right former army officer who openly supports dictatorships and torture has\nBeen overwhelmingly elected to be Brazil's new precedent\nWillingly elected to be Brazil's new president\nTook to the streets soon after the election results were now [noise]\nI Am in morning not for me for Brazil which doesn't deserve this doesn't deserve to ignorance the Brazilian people are ignorant Brazil owns a lot to lose\nWe'll speak with the intercept Glenn Greenwald about how the election of both to NATO threatens the future of Brazil's democracy all that and more coming\nWelcome to democracy now democracy now\nFor the war and peace report I'm Amy Goodman Pittsburg Pennsylvania is in mourning after what's being described as the deadliest anti Semitic attacks in us history\nOn Saturday a forty six year old white man named Robert powers allegedly stormed the tree of life synagogue in Pittsburgh squirrel hill neighborhood yelling old Jews must die as he opened fire on worshippers preparing for ... services\nSwat officers arrived on the scene of carnage twenty minutes after the rampage began and detain ... hours after a shootout\nBowers had an A R Fifteen semi automatic assault rifle and at least three hand guns at the time of his arrest\nThe eleven victims range from fifty for ten Ninety seven years old six others were injured including for policemen\nOn Sunday some twenty five hundred people gathered for memorial services to pay their respects and call for healing this is Pittsburgh Mayor Bill could do to\nBe approved ... we need to be looking at is how we to the guns which is the common denominator of every ... shoots\nTo the guns which is the common denominator of every mass shooting in America is the use of rules that are looking to express screech rude three murder\nJust before the shooting rampage the gunman Robert Bowers rode on a far right social media site called gab\nHighest likes to bring invaders in that kill our people I sent can't sit by and watch my people get slaughtered screw your optics I'm going in he wrote\nHighest refers to the Hebrew immigrant aid society a humanitarian aid nonprofit group that's provided assistance to refugees coming into the United states for more than a hundred thirty here's\nJust last month highest can then President Trump for capping the number of refugees allowed into the U.S this year at just thirty seven thirty thousand\nWriting President Trump has once again betrayed America's history in global leadership and providing safe haven for innocent human beings fleeing violence and persecution unquote\nOn Saturday President Trump said the shooter should face the death penalty and claimed if there'd been armed guards inside the Senate God the results would have been different little\nTo do with the disease or all of your production is the result would have been\nThere will always are just so it's just such a\nSome kind of a projection shows\nMovies that are very much different to Georgia is\nA group of Jewish leaders has told the president that he is no longer welcome in Pittsburgh until he denounces white nationalist eleven members of the Pittsburgh affiliate of bend the arc of Jewish partners\nEleven members of the Pittsburgh affiliate of bend the arc of Jewish partnership for justice wrote the letter to Trump\nThat reads in part are Jewish community is not the only group you have targeted you've also deliberately undermined the safety of people of color Muslims L G Beatty to people and people with disabilities\nYesterday's massacre is not the first act of terror you incited against a minority group in our country\nThey're letter came after Trump cheered on a group of young black Republican leaders at the White House East Room on friday\nAs the war and I got hats and shouted Soros and lock him up\nIt was a reference to George Soros the billionaire financier liberal philanthropists who was a frequent target both Republicans and neo Nazi groups cirrhosis Jewish survived the Nazi occupation of hungry before becoming an advocate for refugee writes this is President Trump at\nThe White House ... event on friday the gold global\n... like I like to blow to [noise] I like the globe\nDo we have to take care of all people we have to global issue [laughter]\nThe Fox Business Network has pulled an episode of the Lou Dobbs tonight program\nAfter a member of the right wing organization judicial watch made anti Semitic remarks attacking George Soros\nOn Thursday Chris feral described the state department as cirrhosis occupied territory to Lou Dobbs and House Republican majority leader Kevin McCarthy has the lead it a tweet he posted last week suggesting three wealthy Jewish democratic donors were trying to buy the mid term elections\nA tweet by McCarthy posted Tuesday and delayed and Wednesday read we cannot allow Soros dire and Bloomberg to buy the selection get out\nCannot allow Soros dire and Bloomberg to buy the selection get out and vote Republican November six hash tag Naga\nMcCarthy tweeted also referencing Tom Steyer and Michael Bloomberg\nAnd Jefferson town Kentucky\nA white man arrested for shooting and killing two African American customers at a grocery store last Wednesday was seen unsuccessfully trying to enter a predominantly black church shortly before his shooting rampage\nPolice say fifty one year old Gregory Bush was captured on surveillance camera trying to force open the doors of the first Baptist church of Jefferson town for several minutes before turning his attention instead to a nearby Kroger supermarket\nThis is the most horrific crimes you know seen in twenty two years ... members of the tree of life is going to go conducting a peaceful service in a place of worship brutally murdered by a gunman targeting them simply because of their food\nJust before the shooting rampage the gunmen Robert powers\nJust before the shooting rampage the gunmen Robert powers wrote a message on line saying highest likes to bring invaders in that kill our people I Can't sit by and watch my people get slaughtered screw your optics\nI'm going in highest refers to the Hebrew immigrant aid society a humanitarian aid and nonprofit group that provides assistance to refugees coming into the United states for more than a hundred Thirty years\nHe posted a message on gas ... frequented by neo Nazis white nationalist and far right users kicked off Twitter for racism or harassment\nThe shooting rampage cops I hate filled weak in America\nOn Wednesday a white man with a history of violence fatally shot to African Americans at a Kentucky grocery store following in a parent failed attempt to attack a black church\nOn friday authorities arrested and the Trump supporter named Cesar ... accused of mailing fourteen bombs address to CNN and political opponents of President Trump\nIncluding the Clintons the Obamas I'm as well as George Soros Tom's dire senators Camelot Harris as well as a senator Cory Booker of New Jersey and others for more we go to Philadelphia, Pennsylvania where we are joined by to guess\nDr David ... is with us he's a retired nurse psychologists who's volunteered with highest in Philadelphia helping refugees resettled there\nHe's also the uncle of Stephen Miller a key political advisor to President Trump who has pushed for a crackdown on immigrants David Gloucester recently wrote a piece for political magazine headlines Stephen Miller is an immigration hypocrites I Know\nIt's political magazine headlines\nStephen Miller and integration of crap I Know because I have\nAnd we're also joined by ... he's a rabbi caught FedEx and a guy in West Philadelphia has worked with high ass as well we welcome you both democracy now David Glasser let's begin with you and your response to what took place pet spark and Saturday morning\nAnd our\nMorning before I began I'd like to express my condolences to my many friends and relatives in Pittsburgh and specifically in this world ... region where they live\nWe've now been subject to the consequences\nOf\nLeaders abandoning their moral responsibilities questions being asked what happens when hate speech becomes legitimize and it becomes acceptable in our political discourse to condemn and vilify innocent people on the basis of race religion or national origin or color\nThe answer is made itself very clear and the last two days and then the last week with a pipe bomb or a tax upon and political\nOpponents of Mr Trump\nMr Trump has made it his policy to vilify the human eyes Hispanics Muslims and non whites calling them subhuman animals for that or an ... country like so many insects or rats make no mistake about it\nThis is the same kind of propaganda that is identical to the races France Nazi Party rallies in Germany in the Nineteen thirties\nNow Trump's business and poisonous messages to his supporters inclines innocence when this\nInflammatory betrayal was sprayed over societies claims in this\nInflammatory the trailer sprayed over our society's climbs innocence now\nThat this uh this political gasoline catches fire and people get hurt and killed\nHim horrified by it I'd love to say I was surprised but I'm not\nMore shocking lay\nThe Republican Congress has tolerated his electric\nCars vilification\nWe're been their cries of outrage\nTheir so called responsible people in our country and are in positions of political leadership their silence has been deafening\nI Would say that the\nSilence tends to legitimize the crazy conspiracy theories that hate speech the\nThreats that violent acts of the most noxious white nationalist elements of the American political spectrum\nMr Trump does even on a shamed\nTo tell us that among the chanting Nazis in Charlottesville there were many find people drawing a false moral equivalency\nBetween those who are protesting against those kinds of actions and not just themselves should we now be surprised at well armed white not nationalist begets\nA isolated isolated finalist loners are\nSeeking validation for their empty lives that they that they act out on their heads I think not\nMr Trump didn't pull the trigger in the synagogue he didn't mail those bombs but for the first time in fifty years she's made big of a hate speech in America legitimate tool of political manipulation is endless barrage of excited hatred threats in lies has consequences as we have seen\nI regard Mr Trump is hopeless moral in this or indifferent to the deadly consequences of this inflammatory conduct\nTrump was hopeless moral initial indifferent to doubly consequences inflammatory conduct put those politicians know better still do not so much for don't stand up and lovely denounces who's rich\nWho don't belong to the laws are hypocrites there ... or ... or more loudly the court room rubber\n... worked for was\nWhen you have to prove your options are most ... most literal loudest most different to skirt around murdered\nA double agent orange Dr David Gosar um the shooter um\nBowers made\nHis jets made his justification very clear I mean he tweeted\nMinutes before and doesn't use tweet by news gab\nOr going into this synagogue I'm saying he wanted to kill all Jews but specifically going after a Jewish organization called high us which stands for the Hebrew immigrant aid society a group that you work for as well as our next guests are in love for an hour\nI'm at and he immediately made the link\nBetween Jews and immigrants ... helping immigrants coming into the country I'm among his gab posts he said I have noticed a change in people saying illegals that now say invaders he wrote the six days before\nUm he said I like that\nAs he referred continually to the caravan of people coming up on you were particularly close to the story in an unusual way era volunteer for high us or you work with refugees Jewish and\nTara for high us or you work with refugees Jewish and non Jewish from all over the world trying to resettle and the United states and your\nNephew Stephen Miller is one of closed at President Trump's closest advisers particularly on the issue of immigration\nOn your headline and the political pace this is before the attack this weekend Stephen Miller is an immigration hypocrite I Know because I'm his uncle\nCan you talk about this linkage that power made from June to Jewish organizations bringing in refugees he called Ben invaders language that President Trump himself has used\nYes let me tell you a little bit about Ohio is um\nHas helped to rescue my family about a hundred years ago now serves to protect desperate refugees worldwide I'm proud to be on to her for them\nAlmost every American families in the United states apart from those who came unwillingly of slaves and apart from those who are Native Americans everyone else came here by and large the flea danger of Persian hunger and fear\nAnd together those folks a built in motion for her wars in advance the cause of freedom and justice in the world we must not turn our backs on this this fundamentally American Muslim or let opportunistic had sold politicians turned us against them\nWords on the statue of liberty should be remembered give us your tired your poor your huddled masses yearning to breathe free\nSo I Am particularly horrified and angrier about cynical political or slowing tradition of poor people trying to escape from oppression\nPolitical exploitation of poor people and trying to escape\nFrom oppression\nWe can solve all the problems in the world but we can certainly United States has a large powerful wealthy country very good at absorbing immigrants as you can find as you can determine just by going out in the street and asking anybody\nYou see where did their family come from originally were graded absorbing immigrants and we need to do our duty to help people who are desperately fleeing from it's horrible conditions as my family did hundred years ago\nI mean it's interesting in your piece you write that Stephen Miller would not be here and press and try to senior advisor integration act changed that warrants for immigrants being allowed into this country on the family found out then surviving Holocaust and being brought here\nAnd they wrote are Jewish community is not the only group he was targeted you've also deliberately undermined the safety of people of color ... people people with disabilities yesterday's mask or not the first act of terror you inside it against a minority group in our country\nNot the first act of terror you win cited against a minority group in our country they wrote saying that unless he run ounces says a white nationalism on that he can't come to Pittsburgh\nYeah\nYou know this is these are the kinds of connections we need to be making because we actually have power in numbers we not only need to get out the vote but we need to be showing up for each other at the gathering we had on Saturday Night the calvary center of our dear friends and allies\nUm are Muslim and Christian clergy and neighbors came and they spoke and they sing to us and they shared words there were about a hundred of US President and in in the moment where our words failed us they said we we stand by you we will be standing stone um and and really offered you know the words of\nYou know Jewish liberation from a hundred years ago which is that we will outlive them we will do this in the streets together that we are not alone in this Jews are not alone in this people of color are not alone in this immigrants are not alone in this I was thinking about this and\nThink connection to my own work related to immigrant justice I spent some time earlier in August that the U.S Mexico border I'm as part of a clergy action to um be providing she meant to be resisting this administration's criminalization of humanitarian aid on the U.S border\nAnd um what we know is that the criminalization of immigration\nIs directly connected to the the violence that's being perpetrated against trans bodies against people of color against black bodies\nOut in public space which has been going on um you know for as long as basically the U.S has been in existence there's been um the the the violence against a black and brown bodies has been condoned by the state and this is a time where we need to rise up and resist that and reclaim\nReclaim a sense of connected safety that is not built in state power but that's built in our relationships of solidarity interdependence [noise]\nDidn't and he was ...\nTo ask also about what happened\nDidn't and he was\nTo ask also about what happened this remarkable moment on friday afternoon most aren't paying attention because the um uh the accused I'm\nA bomber Cesar ...\nUm had been arrested and said there was a lot of attention on this van that he was living in that had all these targets on it and a pro Trump signs he was at a Melbourne, Florida a Trump rally recently um but at that soon after that President\nTrump was in the East Room with a young black\nLeaders and he basically led a mini rally as he attacked global is and the young people wearing ... hats make America great again a chanted cirrhosis and lock him up\nThis was in the White House on friday I think it was Wednesday that Trump in the middle of the night tweeted on when you're putting the word and bombs in quotes and saying this is taking attention away from what we want to focus on right the caravan um uh the threats as he perceived them\nOf persecuted people coming up into this country\nWhat what we're seeing is Trump Trump coming further and further out and saying his true colors that we saw last week that he he came out of the national and we know the word that becomes before national is white nationalist and we we know they used the term global list is directly\nOr a longstanding attack on Jews as an anti Semitic slur that's been used and we've seen the same strategies in in the ... of of media and manipulation that that Hitler and using the Nazi Party to rise in Germany\nAnd so I really hold 'em Trump and the entire Republican Party and their silence I'm complicit for these acts of violence and this murder the blood is on their hands um it's not\nI'm complicit for these acts of violence and this murder the blood is on their hands um it's not just about getting guns guns out of out of out of dissemination it's actually about changing the discourse of who's in power um this is not a side project this actually is the project of its administration\nAnd and we need to be speaking out and saying Trump any to denounce white nationalism and we need to hold accountable all of our elected officials and frankly we need to unseat them and changed the face\nOf who is in power in this country because of this violence is not happening in isolation and as we're seeing it's escalating terribly um this past week has been devastating and it's an assault let us on our bodies but on our souls and one of the things that we have\nIn our in our ethical tradition is that in a place where people are not not acting human we need to strive to be human and we need to stay connected to our humanity we need to build this world from love we\nWe just have one minute but Dr David glass or do you want to publicly address your nephew um Trump's senior adviser Stephen Miller I'm here\n[noise]\nWe'll continue with the most would drop and trying to get across for the last movie monsters\nAre actually on acceptable to utilize featured bigotry toward rooms for political loans shallow Charbonnier rushing around version\nWhich tours and there's two country destructive to social are are complete repudiation of her own ground and your own broached\nDr David ... thank you for being with us uncle of Trump's senior adviser Stephen Miller on Dr Gloucester volunteer with high us a rabbi Ari love for an Ari rabbi called FedEx and a guide and West Philadelphia also works with high us who was on the border\nI'm also the highest ...\nI'm also the highest ... that were held all over the country last week I Know that a rabbi up for an hour is plenty one in November ... in Philadelphia\nOn and the significance of this to Pittsburgh temple of life synagogue participated in this as well we will continue to follow the story when we come back we'll be joined by Glenn Greenwald in Rio de Janeiro Brazil\nPresident Trump just tweeted his congratulations to ... the far right a now president elect of Brazil stay with us\n\n\nYou hear\n\nBattle with the punches the democracy now I'm any good minutes we turn to Brazil were ...\nBrazilian van ... says democracy now I'm any good men as we turn to Brazil were far right former army officer who openly supports dictatorships and torture has been overwhelmingly elected president\n... election marks the most radical political shift in Brazil since military rule ended more than Thirty years ago he won fifty five percent of the vote easily to feeding Fernando ... of the leftist workers' party but not as campaigned on a promise to end corruption and crack\nDown on crime but many fear the future of democracy in Brazil is in danger\nFor decades Wilson out as openly praise the country's former military dictatorship one saying the dictatorship should have killed thirty thousand more people he\nAlso has a history of making racist ... comments has spoken in favor of torture has threatened to destroy and prisoner banish his political opponents he's encouraged police to kill a suspected drug dealers once told a female lawmaker she was too ugly to write he also said\nHe would rather hear that in the Senate died in a car accident than learned that his son is gay on Sunday nights Airbus for NATO claimed he would help liberate for sale\nOf joy to me if you\nAre my witness that I Will be an advocate for defending the constitution for democracy for freedom and this is my problem is it's not one of the political party is not the word of a man it's an oath\nTo your they don't have to do\nThe best idea was to\nWe will liberate Brazil and the foreign ministry from the ideology of its international relations that it's subject to Brazil to in recent years Brazil will no longer be different from the countries of the developed world or the\n... floors below their eyes\nWill seek bilateral relations that adds to the economic and technological value a Brazilian brothers we will restore international respect for our dear Brazil balanced\nBillion brothers we will restore international respect for our dear Brazil\nThousands of protesters poured into the streets of Sao paolo and other cities in Brazil to protest both set out us election start\nI Am in the morning not for me but for Brazil which doesn't deserve this it doesn't deserve this ignorant the Brazilian people are ignorant Brazil owns a lot to lose the\nAnd that's where this pillar among others like Milo you're not bliss and um\nOther neo Nazis who are banned from Facebook and Twitter have migrated to and it's kind of become a hub of that and in the wake of this uh Pittsburgh shooting they've now been censored in a sense by private\nFinancial firms that ... process their payments in private to the Internet companies that won't host their sight any longer it's an attempt to suppress these views\nWhich never really works rather than trying to address them or contain them or defeat them\nAnd a precedent trends as response to what took place\n[noise] and a precedent trends as response to what took place in a progressive Jewish leaders and pet spring saying do not you are not welcoming Pittsburgh until you renounce white nationalism\n\nSo I mean you know I President Trump posted between this morning that I thought was I'm so far over the line we have lived his boss of all I have been somebody who's been\nYeah so I mean the thing about CNN being the enemy of the people in the wake of this type bombing like I said I'm more cautious about blaming Trump\nFor language delayed in prayer but we're going to do part to democracy now ... or and tell us your prize winning journalist claimed ...\nWhether it is race religion or sexual orientation human rights inequality is a constant struggle that has changed for him throughout history\nOn November ... Massachusetts voters will decide the future protection for transgender people by prohibiting discrimination in public combinations on the basis of gender identity this week I double ACS catch question three ballot presentation and initiative designed to promote freedom for all of the people of Massachusetts\nYou can watch this program and all of a quality programs from around the area in high definition on the double ACS\nMobile out you are listening to W. A. R. A. Thirteen twenty am Arab world\nAs we wind down the month of October temperatures will be near or a little above average will have sun and clouds the rest of the afternoon breeze out of the west southwest a high in the mid fifties cooling off to about forty tonight not too tough to take with skies becoming mostly clear and lots of sunshine tomorrow\nTen and a half hours of it that's it but\nIt will be out there high temperatures in the upper forties a breeze out of the northwest clear fall into the low in mid thirties early on Wednesday morning Halloween day itself sunshine becoming breezy in the afternoon a high of sixty\nHalloween day itself son John becoming breezy in the afternoon a high up sixty looks like about fifty five on average do the early evening hours for trick or treaters and how about this broad Thursday sunshine breezy eyes in the mid sixties some rain by Thursday night for Thirteen twenty am W. A. R. A. I. G. corporate enjoy\nOn Thursday November eighth at six thirty PM Pam Holland present discovering cousins using DNA at the Richard the memorial library in North out over all this talk will show how to explore matches and use the tools available at the major DNA testing companies\nIt will focus on practical ways to discover relatives in order so ... cousins for more information or to register you can email librarian Maggie homes at him homes at ... dot org\nAnd\n\n[noise]\n\n\nDa\nDa da da da\nDe da na na\n\nDa\n\n\n[noise]\n\n\n... well\n... ...\n... ... ... well ... ...\nOh they're the ones that are that are really\nCalled la la la\nLa la [noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n\nI don't know\nWhy but I\nAnd\n\nThat\nAnd that's why I\nDa da da da\nDa da dun dun dun dun dun dun\nDun dun dun dun dun\nDun dun dun dun\n[noise]\n\n\nI\n\n\n\nNot\n\n\n[laughter]\n\n\n[laughter]\n\nOld are you\n\nWay oh label\n\n\n...\nA\nDa\n\n\nThan I Am the man I don't know\nOh [laughter]\n\nNo\n\n[noise] Mm\nThey deny that to\nMe was the the school\nThe BBC above ground pool loans magic and spend the anger is Letty and now the centers\nSee\nMore than just one\nBe as brilliant as a parade truly value I Am\nElaborate managed to\nA\nYou're listening to W. A. R. S. Thirteen twenty am Arab world [noise]\nWalking to the daily news I'm just really got to be ready Thirteen wanting radio host also a former question one of the animal public library Orange Beach in a representative from each side of the debate and questions from the audience\nHe was also a girl junior um been pretty well in the community I have a radio show here on W. A. R.\nI'm been pretty well in the community I uh have a radio show here on W. A. R. A. Thirteen twenty\nAnd today we're having an open forum regarding the question one ballot initiative that is a nurse the patient a ratio is currently the the only ... exist as the ICU to nurse but this will go across the boards to a surgical units in in general we have two organizations with us\nOr the Massachusetts nurses association who are in support of it and we also have the American nurse association those that are opposed to about an issue\nIt's important to know this particular initiative because it's going to be on this this coming elections a balance question one you've got your vote for your politicians and everything and so forth but you also have your ballot questions will be voting on as well\nI had a lot of community members ask me questions about this so I figure to having a former would be good so it looks like we have a pretty good turnout advertise through social media in general and then also just word of mouth and this is meant to be an educational not confrontational event\nAnd I really thought that was important to emphasize that I'm Still get emphasized it even more when we get out there so uh my radio program at the same thing it's more educational and informative for community so I'm Glad we have this opportunity to do so\nThat the protests update you can watch all of our content by visiting our website double A. C. S. dot com by downloading the double ACS mobile apps or by visiting the double ACS Roku channel [noise]\nAs we wind down the month of October temperatures will be near or a little above average will have sun and clouds the rest of the afternoon a breeze on to the west southwest the high in the mid fifties cooling off to about forty tonight not too tough to take with\nSkies becoming mostly clear and lots of sunshine tomorrow ten and a half hours of it that's it but\nIt will be out there high temperatures in the upper forties\nTen and a half hours of it that's it but it will be out there high temperatures in the upper forties a breeze out of the northwest clear fall into the lower mid thirties early on Wednesday morning Halloween day itself sunshine becoming breezy in the afternoon a high of sixty looks like about fifty five on average do the early evening hours for trick or treaters\nAnd how about this for Thursday sunshine breezy\nEyes in the mid sixties some rain by Thursday night but Thirteen twenty am W. A. R. A. I. G. corporate and drawing\nOn October thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl T bogus a cathedral of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states guests will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at thirty Roger Williams University School of law he has written and spoken extensively about both the second amendment and gun control policy [noise]\nBeep beep beep\nBeep beep\n\n\nDo\n\nIt they\n\nTuesday and\n\nWhen\n\nAnd\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\nAnd\nThe the people in Hollywood one oh one will be held on Thursday November to these two thirds yeah before\nThirty PM attending students learn how to apply to any college they will be instructed on the college application process from start to finish attendees local learn about meeting application deadlines applying for financial aid finding it applying for all this\nThese will also learn about meeting application deadlines applying for financial aid finding it applying for a scholarship right in the college essay and getting college recommendation [noise]\n\n\nMama you know\nName [noise]\nCan you know from what I mean well\nOne that I've never\nI think to play like\n\n\nFell down I ... I don't know\nCan you\nI\nMean what were you\nMay see\nDon't lose someone else to\n\nWe're\nYou can have all the boat\nThe ones that can choose and the law I don't know ... ... what else do you watch you know\nCan look\nThe line\nWhat's real\nOn a game or\nYou love and\nMain street\nSome ...\nThat but you know these months away from me you know I don't mind the local news\nMan walking down the street and just one short attention got a short little fan of attention as well learn they don't know where my wife just barely won a prize die year will be my role model now that in my role model is go\nDown the Alan Thomas Rose Bowl that will that these are all all alone\nYou know it goes to that was an actor then there was an allegation\n[noise]\nI Walk down the street and the strange world maybe the maybe the first year\nDoes need to be glad that you know Kurds to be here the barn in around ... do\n\nDay and then the architecture debating it into a really nice today in\n... [noise]\nBurden\nMy name is Chris Wyoming and I'm the manager of the elder dental program we're inviting any seniors residing in Massachusetts who are sixteen older\nTo attend our free dental screening clinic in taunton on Saturday October twentieth from a forty five AM\nTo one PM participants will receive a free dental screening and have an opportunity to speak with a dentist and the clinics relax and friendly setting participants will be screened for oral cancers and have a chance to receive free that you're cleaning\nFor more information called seven seven for two zero three one three to six the free dental screening clinic is organized by the elder dental program a project of the community the NA\nMe\nAnd my right\nNow\n[noise]\n\nYou're listening to W. A. R. A. Thirteen twenty am Arab world [noise]\nWalking to the daily news on things written W already Thirteen twenty radio host policy ... ... a former question one of the out of a public library foreign featured a representative from each side of the debate and questions from the audience\nWhen he was also a girl junior um been pretty well in the community I have a radio show here on W. way already Thirteen twenty\nAnd today we're having an open forum regarding the question one ballot initiative that is a nurse the patient a ratio is currently the the only racial it exist as the ICU a nurse but this will go across the boards to a surgical units in in general\nWe have two organizations with us or the Massachusetts nurses association who are in support of it and we also have the American nurse association\nThose that are opposed to about an issue\nIt's important to know this particular initiative because it's going to be on this this coming election is a valid question one you get your vote for your politicians and\nComing elections a balance question one you got your vote for your politicians and everything and so forth but you also have your ballot question is will be voting on as well\nI had a lot of community members ask me questions about this so I figured having a former would be good so it looks like we have a pretty good turnout advertise through social media in general and then also just word of mouth and this is meant to be an educational not confrontational event\nAnd I really thought that was important to emphasize and I'm Still gonna besides even more when we get out there so uh my radio program at the same thing it's more educational and informative for our community so I'm Glad we have this opportunity to do so\nThat's the protests update you can watch all of our content by visiting our website double A. C. S. dot com by downloading the double A. C. S. mobile apps or by visiting the double ACS Roku channel [noise]\nAs we wind down the month of October temperatures will be near or a little above average will have sun and clouds the rest of the afternoon a breeze on to the west southwest a high in the mid fifties cooling off to about forty tonight not too tough to take with skies becoming mostly clear and lots of sunshine tomorrow\nTen and a half hours of it that's it but\nIt will be out there high temperatures in the upper forties a breeze out of the northwest clear fall into the low in mid thirties early on Wednesday morning Halloween day itself sunshine becoming breezy in the afternoon a high of sixty looks like about fifty five on average do the early evening hours for trick or treaters\nAnd how about this for Thursday sunshine breezy\nEyes in the mid sixties some rain by Thursday night for Thirteen twenty am W. A. R. A. I'm Jim carbon enjoying\nOn Tuesday October thirtieth from five pm to ... pm be native regional chamber of commerce will hold its twenty ninth annual taste of the region at tri county regional vote technical high school in Franklin tasted the region is an annual sets\nThat tri county regional vote technical high school and Franklin he said the region is an annual celebration of restaurants from all the sixth in communities that'd be nice to regional chamber served attend these will have the opportunity to sample food from a variety of restaurants that are members of the chamber\n\nOf\nShame shame\nShame\nShame shame\nShame [laughter] [noise] I Do a\nLot less but we're not going to go [laughter] [laughter] no but I\nDidn't know what was the young girl she was saying they do\nA better under Shane watching all\nShe was saying they're no\nTo go\nBack she we'll\nFind out what\n\nUp\n[laughter]\nThe young people that are\nShe she no one wants to know\nTime and change what you need to know\nTime they don't want to say no stranger and all\nAnd\nWhat they've done and they're no\nThe\n\nThe\nWere down in the same age\nYou\nLot [noise]\n\nKnow things that they need to rule I'm On a banner who died in\nMaine in Wayne ... man\nWill be\nThere that\nDo they know the ... to ...\n... the man and\nYou don't need I don't find ... I can look at the time man\nThat's not on the\n\nKnow ...\nWe can\n\n\n[noise]\n\nWill be\n\n... to ...\nTo\nSome to\nAnd I\nDon't\nRead\nBe we don't\nWant\nThey didn't do less well known\nThe\nYou good the bad\nWant to be an issue\nI go to\nI don't want to resolve who knew\nI don't want to resolve who knew\n... ... ... ... ...\n... ... ... ... ... ...\n... ...\n... ... ... ...\n...\nJudge who who\nAre on the\n... ... to\n... and\nSo\nThe two so\n[noise]\n...\n... ... ... ...\n... you reach a\nDrama sweet you stay with me\nAnd gene or\nShow on may\n...\n...\nYou know by the channel and ...\nShaun ...\nYou know where is my\nA\nMan oh\nDr Gary highland dirt will return to Richard's memorial library for a series of lectures titled papers\nThe series starts with the federalist papers on Thursday October forth\nIt will be followed by the pumpkin papers on Thursday October Eighteen and the Pentagon papers on November first all lecturers will take place it's seven PM registration is required within these lectures\nIf you'd like to register you can email librarian Maggie homes at ... at sales in dot org [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\nThe summer and\nUm we live in in\nMy in my late ...\n\nTo ... di\n... tiny\n...\n\n... do\nYou can\nRead na\n\nWay\nKnow\nThe moon\nThen\n\nKnow\nAll\nThe\nMedia\nWhen you pull the\n... she\nTo kill a\nYou know\nCar\nYou\nAll know\n\n\n[noise]\nKnow\nYour eyes problem in the arts and culture program will host the documentary film Gen silent on friday November sixteenth from like thirty pm to seven thirty PM in the ... auditorium on Washington\nThe November sixteenth from five thirty pm to seven thirty PM in the path auditorium on Washington street Gen silent as a documentary by filmmaker stew Maddox that asks six LDP seniors if they will hide their friends their spouses better entire lives\nIn order to survive in the long term care system Gen silent discovers how oppression in the years before stone wall now effects older algae beat the people in what is being done about it and mission to the film screening is free\n[noise]\nUm [noise]\nShe is so it was so my\nMoon it brings ...\nTo me and say\nBoy that's [noise]\nFound their na\nDogs ...\nAs a rule that was one of\nYour children watch the sun\nFrighten them saying good I think\nFound that\nThere that\nNa na\nNa\nNa na na\n\nYou're listening to us or Thirteen twenty am apple borrow [noise]\nWalking to the daily news on jinx written WMA Thirteen twenty radio host policy Carol ... former question one of the out of our public library born featured a representative from each side of the debate and questions from the audience\nWhen he was also a girl junior um been pretty well in the community I have a radio show here on WB already Thirteen twenty\nAnd today we're having an open forum regarding the question one ballot initiative\nThat is a nurse the patient a ratio is\nCurrently the the only racial that exist as the ICU a nurse but this will go across the boards to a surgical units in in general we have two organizations with us or the Massachusetts nurses association who are in support of it than we also have the American nurse association\nThose that are opposed to about an issue\nIt's important to know this particular\nAnd those that are opposed to about an issue\nIt's important to know this particular initiative because it's going to be on this this coming elections a balance question one you got your vote for your politicians and everything and so forth but you also have your ballot question is will be voting on as well\nI had a lot of community members ask me questions about this so I figured having a former would be good so it looks like we have a pretty good turnout advertise through social media in general and then also just word of mouth and this is meant to be an educational not confrontational event\nAnd I really thought that was important to emphasize that I'm Still gonna besides it even more when we get out there so uh my radio program at the same thing it's more educational and informative for our community so I'm Glad we have this opportunity to do so\nThat the protests update you can watch all of our content by visiting our website double A. C. S. dot com by downloading the double A. C. S. mobile apps or by visiting the double ACS Roku channel [noise]\nAs we wind down the month of October temperatures will be near or a little above average will have fun and clouds the rest of the afternoon a breeze on the west southwest a high in the mid fifties cooling off to about forty tonight not too tough to take with\nSkies becoming mostly clear and lots of sunshine tomorrow ten and a half hours of it that's it but\nIt will be out there high temperatures in the upper forties a breeze out of the northwest clear fall into the lower mid thirties early on Wednesday morning Halloween day itself sunshine becoming breezy in the afternoon a high of sixty looks like about fifty five on average do the early evening hours for trick or treaters\nAnd how about this for Thursday sunshine breezy\nEyes in the mid sixties some rain by Thursday night for Thirteen twenty am W. A. R. A. I'm ... and drawing\nOn Tuesday October thirtieth from five pm to eat PMDD United regional chamber of commerce will hold its twenty ninth\nSuper thirtieth from five pm to ... pm the native regional chamber of commerce will hold its twenty ninth annual taste of the region\nAt tri county regional vote technical high school in Franklin tasted the region is an annual celebration of restaurants from all the sixteen communities that the United regional chamber serves attendees will have the opportunity to sample food from a variety of restaurants that are members of the chamber\n[noise]\n[noise]\n[noise]\n\n\nReally [noise] coach Steve here\nAccordion cool here and here we go again\nLittle seed Jim blues things to get us started well today I'm going to do a theme show and this is a theme that we've never done before we've\nKind of walks around it a little bit no pun intended but we've never done this particular theme that we've done Latin theme we've done a follow up tempo theme\nBut today we're going to be playing or a whole bunch of balance you know I Hope I don't put everybody just sleep but\nThese are going to be pretty song love songs so let me just a little ladies\nJust kind of you know do something I got I got to talk to the guys right now okay fellows listen\nThat okay they don't get like this what you do All right okay\nI put your arm around you know your your your wife there right sitting on the couch watching us\nAt ... and ... and then they were the other hand you you you hold her hand okay then you look right into arises I play for the next half hours I'm quite all these beautiful love songs and then you know what's going to have well she's going to look at you\nAnd she's going to think that you would just like you did twenty thirty forty fifty years ago when you were dating\nJust like you did twenty thirty forty fifty years ago when you were dating\nWell maybe anyway let's let's just get shot okay after a strong everyday written the Nineteen fifty four great great jazz piano player named ... garner\nAnd this was originally written as in ... I had a year or two later because there's such a pretty strong\nThey add in words and lyrics toward\nNineteen fifty seven\nYoung man named Johnny Mathis recorded there and or course during those years just about everything journey map this recording became a big hit but this was probably one of his biggest very pretty tool okay get ready guys very pretty tool called\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\nNo ...\nWell you know when I put this show together a doesn't take too long to go through these tall so I think we're going to have time for a little bonus bonus to today don't charge as usual out charge so\nPicketing and widely used as as your favorite bonus to get a big price for that person that comes out on top I Know next to Nineteen fifty five it was written in the same year Frank Sinatra and they had he uh he had an album and one of his biggest hit the album\nI let him he ah he had an album and one of his biggest hits album of the same name had the tone is calling us Stay with the piano one is I think in the wee small wow was of the morning pretty ... I\n\n\n[noise] no\nThe\nYeah no we small hours in the morning that's what I miss ... audio pretty tall\nRight going back to Nineteen thirty for for this too and I guess I came from the film not sure what the film was probably wasn't a too popular what the song did become popular\nPretty ballot for all the years I get more of those those jazz jazz ballads that just about everybody and anybody who is ever song by song song the song disarm a shot at a financial\nCalled I only only advice for you right by the at the second world yeah yeah [laughter] like oh here we go I only have ...\n\n\nUh uh uh\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\nYou only have hours for a way to do it I never I never\nThought I Would get down towards the end of our time and I think this next song is very appropriate shots and\nTo play at the end of the show because it's cold that's all that's all it's all going to be\nLike Jane fifty to a young man named Nat King Cole over him\nNineteen fifty three yeah to be here to show that can call what's a jazz piano player was not of all colors one night some guy said look what we can you sing such and such showing his voice nor by I don't sing is I'll give you a hundred bucks so I figured\nThat was the beginning of that king coal career as a local issue that's all\nThey\n\n\n\n\nUm\n\n\nIn a while but then it was a\nAnd then\n\n\n\n\n\n\nAll of a lot of a plan\nBargain\n\n\n\nThen just boil while you're just for a while\nYou know and\nLaurie guy\n\nYeah\nAnd that made\n... June\nNo\n\nYou're listening to W. A. R. A. Thirteen twenty am Arab world [noise]\nWalk into the daily news on James Freedman WMD Thirteen twenty radio host policy how the foreign question one at the republic library foreign feature to represent our from each side of the debate and questions from the audience\nWhen he was also a girl junior um been pretty volunteer community I uh have a radio show here on W. A. R. A. Thirteen twenty\nAnd today we're having an open forum regarding the question one ballot initiative that is a nurse the patient a ratio is\nCurrently the the only racial or exist as the ICU to nurse but this will go across the boards to a surgical units in in general we have to organizations with us on the Massachusetts nurses association who are in support of it and we also have the American nurse association\nThose that are opposed to about an issue\nIt's important to know this particular issue because it's going to be on this this coming elections a balance question one you got your vote for your politicians and everything and so forth but you also have your ballot questions will be voting on as well\nI had a lot of community are members ask me questions about this so I figured having a former would be good so it looks like we have a pretty good turnout advertise through social media in general and then also just word of mouth and this was meant to be an educational not confrontational event\nAnd I really thought that was important to emphasize I'm Still get emphasized it even more when we get out there so um my radio program at the same thing it's more educational the uniform and for our community\nSo um my radio program at the same thing it's more educational and informative for our community so I'm Glad we have this opportunity to do so\nThat's it for days update you can watch all of our content by visiting our website double A. C. S. dot com by downloading the double A. C. S. mobile apps or by visiting the devil ACS Roku channel [noise]\nI every one cloud will melt away early this evening revealing clear overnight falling down to a seasonally cool forty degrees wins will diminish tomorrow a lot of sunshine almost one hundred percent of it\nUnfortunately only a little more than ten hours of it but it should reach about forty nine in the afternoon a pretty good breeze out of the northwest clear cool low in mid thirties tomorrow night and right now\nWednesday Halloween day sunshine becoming breezy in the afternoon a high approaching sixty likely somewhere in the mid fifties but trick or treaters as the sun goes down on Wednesday evening staying dry but a bit of a breeze\nAnd how about this for Thursday sunshine increasing clouds quite breezy but in the mid sixties showers by later Thursday night and a windy shower read a mild on friday the thirteenth twenty W. A. R. ray I'm Jim corporate\nOn October thirtieth at six thirty PM the center for reconciliation will host the hidden history of the second amendment a presentation by Carl ... cathedral of St John located at two Seventy one north main street in Providence\nThis is a free discussion on the history of the second amendment and how it intersects with the history of slavery in the United states gas will also have the opportunity to learn from local organizers about gun control activism today\nCarl gee bogus is a professor of law at thirty Roger Williams University School of law he has written and spoken extensively about both the second amendment\nLaw is written and spoken extensively about both the second amendment and gun control policy [noise]\nHello my name is Gretchen Robin feeling this is a program called we have to talk and today I have this very special guest and I want to introduce you Todd Coleman\nWelcome [laughter] when you're running for the city council you came in a knock down our door and we invited you when we get to know you and while it was what a great person [laughter] for the city council I thought I'm\nAnd you're now nine months in tune\nYou out with her and so I still very much for like a political newcomer so I appreciate this opportunity to go on here and I introduced myself a little bit\nWell I one of the things that we that I wanted to do for a long time to talk about leadership leadership in general not you know specifics 'cause this there is something that we can learn there that will make us better leader is whether it's in our families or\nIn our community or you know\nAt our church or whatever um that are followers to 'em so you know there's some skills to some knowledge that goes with it and I thought you would your three deployments to Iraq\nOnly two ... went to Afghanistan one term Iraq and went to Afghanistan and how old are your kids then\nUm they weren't around when I was in Iraq and um but then my oldest was four when I was over in Afghanistan and uh it is interesting so I left him at home with\nAnd I stand in a\nIt is interesting so I I left him at home with mom for ... for about a year and when she potty trained them and\n[laughter] it may be a little piece of is yeah his childhood I bought you felt that you had to do to go and serve the country\nIt was really a choice necessarily um I I definitely felt obligated to re enlist time and again it and\nLook at my military service and my decision to join the Army National guard is one of the best decisions I've made my life for a while it's it's taught me a lot and it's in the Army National guard is just the you know the one weekend about two weeks during the summer it's sort of thing\nIn Philly we're way for Eighteen months to go to Iraq or a year to go to Afghanistan and all of that but normally it's it's a part time thing um and it's really fascinating to sort of be working at a civilian job as a as a as a software guy and then found a way to go\nBe an intelligence analyst and have meetings with all sorts of interesting people\nDirections you [laughter] and nor Mrs lay their two completely different worlds\nYeah um but it's also I Am very proud of of that service that I've done it and I I I met my wife and the army and like the joke that you learn how to drive in Iraq\n[laughter] was she in the army she if she wasn't she she was over in Iraq with us and no should understand no apps absolutely are very much on a\nYou you have um a wonderful Facebook page and and I seen taking your oldest son to climb mount Washington ... ... you know so I Would say that's a that's an example the family leadership okay you know you and your wife lead your family\nAnd is able to family leadership okay you know you and your wife lead your family you're near a natural leaders in that role one parent um all kinds of leadership though I'm Talking about a far Italian leadership and I'm Sorry ... leadership if you ever thought about that\nI I don't know the difference but I Know um if somebody\nTells you to do something a force of the ... in ... years ago for all day and you're supposed to obey you're not going to do that to your full potential in ... and whatnot as opposed to was it in ...\nI ... you know like ... parents if we've been around children we know a lot of our children we love children then we're you know we read up on how to be a good parent and and we just bring all those skills to the floor for that task well it's a\nPort in anything you do as much as possible has meaning and you have you ever ... and all those things yeah absolutely yeah\nYeah but a mindful late to do that that absolutely um it's here all day and then it's kind of mindless it can be\nSo in the only reason I hesitate is sometimes I'll push my kids to do something and say we're going to go do this and it's not until where at the top of mount Washington that they're like oh this was the coolest things I've ever done yeah\nWell I think that's that's that's our bar attained his leadership is like I Know these kids will come alive out there in the woods\nAnd I don't necessarily agree with that style of leadership but sometimes you have to I Choose to use that to to get my kids out on the adventures of any sort of I I think those\nEd ventures of any sort of I I think those those life experiences are incredibly important\nWhen you are the authority when you're the parents they have limited knowledge so a certain amount of authoritarian leadership is is I Would imagine appropriate I never thought of that before [laughter]\nWhy not give it a try like an experiment and then later on it can be change when people like more familiarity with it I mean I I'm a raging liberal so [laughter] but I mean I can see the benefits as a\nCompromise it I did too and I was very proud of it because after that change it it I May of ... I didn't get what I wanted\nBut ultimately the overall ordinance changed passed unanimously and I was very happy that we sort of supporting came together for that matter um in that\nAnd you are doing a little bit or indirect effect on other is that you were in can\nPush and being noxious that you were going to continue to respect them even though you\nAnd I could have tried to play games and if an amendment was made\nGames and it would be\nIf an amendment was made and it was a perfect I could've been tack that aspect of it as opposed to discussing the ideas are based on the merits of the ideas from home so I thought that was important it was one of\nIt is the the one moment that I'm most proud of him so far not not necessarily passing the the ordinance itself but the way the Calderon other than work together ...\nSo what are the qualities that a person needs when they have to change their their mind or cooperate or collaborate in order to get a good decision\nWhy I've no idea [laughter]\nWhat are the I mean I I come from a ministerial background or so\nI'm thinking you have to have a certain humility I agree\nI very much agree I I think you know we can come in and say I know all the answers and I'm right and you're walking and you know that leads to what we have in Washington [laughter] now and and um you know the authoritarian mentality down there\nThat everybody that disagrees should just roll over and play dead is is poison\nI mean I think that's why city councils are great because we have to live with each other you know you we\nHave to go there on the trees are going to see\nEach other and and buy you a compromising or being flexible the next time there's something they want you know there may be more give and take\nOr at least the merits of the ideas Frank will will with two guys are ...\nGiven to different viewpoints than they were on and\nI don't mean this in terms of personality is on the city council I mean general and how we get along\nI ... in that comes with the middle of humility to like you said yeah yeah it's it's incredible\nHumility to like you said yeah yeah it's it's incredibly important yeah um I could use more of it but [laughter]\nIf you ask my wife [laughter]\n[noise] um but ... it's\nNot sure if she has ways of telling you that certainly is [laughter] I mean not in our spouses\nThat me and my spouse or my husband is is is it might get desk go hide in just about everything I Do you mean 'cause I Know he he sold fair and he's so kind and he knows how to put things in the general is way\nAnd I don't get my feelings hurt and they don't come I backed out um but I Do come to that place of humility because of the respect that we share for one another\nIt's common set of values [laughter] it is\nYou talked about the the army values of loyalty duty respect\nLoyalty Judy respect\nThe fourth one is self uh self with service which is selfless\nService so which isn't giving over of yourself to a greater benefits and then we'll come to us he will benefit others and we may not get any benefit from\nIt looking at the overall benefit as opposed to any personal gain is um\nWhat's the best thing for our as a community that you know the question that a lot of leaders would ask themselves\nAnd there was at one point or a friend of mine has suggested oh why don't you go to this event or or do this and it will be great come reelection time to to show your ... and I I ... I was like don't ever make that argument with the like what's what's the\nIt has to have any meaning for you and you\nWent to a um a veterans uh\nDoes it mean for you and you went to a um a veterans a event wasn't it\nA few of them yes ... and that means a lot to me personally\nIt anymore you said you said one of them you will you you'll take your son to next time I was so beautifully done and it was such a beautiful program\nThat was the POW nine eleven event that was incredibly touching [laughter] um yeah and and I feel bad that I didn't bring them this time there was\nAnother time [laughter]\nI mean I think you know one of the things I like doing the show is I get introduced to people I wouldn't otherwise get to know and I get to reach me than than to the public um and and\nThe benefits of working in the city council is you can find some amazing people\n[noise] it's it's really a\nIn an interesting group of people and it's been fascinating to get to know each of them individually as well as the multitude of people within the community that I wouldn't have met normally I mean I wouldn't have knocked on your door if it was it was a ... it's it's great and it's\nIt's personally very touching to me to to be that that much more involved in the community is set the example for my kids right right ah it's super excited my my son Jake ended up running for ...\nAccount your Facebook page [laughter]\nAnd he won in and it was I was so proud of both for just having the the nerve to\nDo it well say I have to be bold and he might as well learn that now\nI I loved it um it was so proud of them not not necessarily not for winning but for having put himself out there in ...\nNo not necessarily for winning but for having put himself out there and it was great about failure it never happens to me\n[laughter] to press Blaine hopeless celebrity is that these are the emotions that we battle when we lose a loved one the admiral community being a offered a workshop that focused on various exercises and techniques to promote healing as well as self compassion after someone close to you has passed away\nJoined ... this week as we showcase five tools for human grief guilt and loss a presentation based on insights from outer boroughs big re book five guys you can watch this program is all about quality programs around the area in high definition on the double ACS Roku channel [noise]\nKnow being being\nAnd then\nDidn't do do do do\n\nThey did\nIt\nBang bang you\nNo\nCity in\nDay\nIn day and I'm sure\nWill be in day\nTo day in the wall or\nDo you think she got the\n[noise]\n[noise]\nThey're like\n\nLa\n\n\n\n\n\n[laughter] for\nHer\nTen ten ten\nPage [noise]\n[noise] I\n\n\n\nA and I\n\n\n\n\nI'm\nA\n[noise]\n[laughter] [noise]\nAnd and\nAnd\nKnow\n[noise] um [noise]\nI think\n\n\n\nGo\nYou are listening to W. A. R. E. Thirteen twenty am apple borrow [noise]\nWalking to the daily news on things written W already Thirteen ... radio host also Carol ... a former question one of the out of a public library foreign featured a representative from each side of the debate and questions from the audience\nWhen he was also a girl junior um been pretty bold and community I have a radio show here on W. A. R. H. Thirteen twenty\nPretty well in the community I have a radio show here on W. A. R. H. Thirteen twenty\nAnd today we're having an open forum regarding the question one ballot initiative that is a nurse a patient a ratio is currently the the only racial or exist as the ICU to nurse but this will go across the boards to a surgical units in in general\nWe have two organizations with us or the Massachusetts nurses association who are in support of it and we also have the American nurse association\nThose that are opposed to about an issue\nIt's important to know this particular initiative because it's going to be on this this coming elections a balance question one you've got your vote for your politicians and everything and so forth but you also have your ballot questions will be voting on as well\nI had a lot of community members ask me questions about this so I figured having a former would be good so it looks like we have a pretty good turnout advertise through social media in general and then also just word of mouth and this was meant to be an educational not confrontational event\nAnd I really thought that was important to emphasize that I'm Still going to ... and even more when we get out there so um my radio program at the same thing it's more educational and informative for our community so I'm Glad we have this opportunity to do so\nThat's it pertains update you can watch all of our content by visiting our website double A. C. S. dot com by downloading the double A. C. S. mobile apps or by visiting the double A. C. S. Roku channel [noise]\nEvery one clouds will melt away early this evening revealing clear overnight falling down to a seasonable cool forty degrees winds will diminish tomorrow a lot of sunshine almost one hundred percent of it\nUnfortunately only a little more than ten hours of it but it should reach about forty nine in the afternoon a pretty good breeze out of the northwest clear cool lowered mid thirties tomorrow night and right now Wednesday Halloween\nCool low in mid thirties tomorrow night and right now Wednesday Halloween day sunshine becoming breezy in the afternoon a high approaching sixty likely somewhere in the mid fifties but trick or treaters as the sun goes down on Wednesday evening staying dry but a bit of a breeze\nAnd how about this for Thursday sunshine increasing clouds quite breezy but in the mid sixties showers by later Thursday night\nAnd a windy shower read a mild on friday the thirteenth twenty W. A. R. ray I'm Jim corporate\nYour eyes Providence campus arts and cultural program will host the documentary film Gen silent on friday November sixteenth from five thirty pm to seven thirty PM in the path auditorium on Washington street Gen silent as a documentary by filmmaker ... asks six LDP the seniors if they will hide their friends their spouses better entire lives\nIn order to survive in the long term care system Gen silent discovers how oppression in the years before stone wall now effects older algae Beatty people in what is being done about it and mission to the film screening is free [noise]\nAnd welcome again to exploring mental illness everything you wanted to know but were afraid to ask I'm Derek mall and I'm here with\nCary balloon Kerry how are you doing today I'm going in conflict there carried a you know a little off um functionally depressed let's put it that way ups and downs but uh you know it's how you are it's how you come back from that stuff so I gave myself a a day\nBut you can't let yourself get you know more than one day because of the day turns into two turns into a week and it turns into a month\nSo I'm I get myself a day yesterday and you know down here and you know to these new game yeah you're trying to let people know that I'm I feel a little lost right now but that's okay and that's a natural feeling and outgoing\nI feel a little loss right now but that's okay and that's a natural feeling you're not going crazy when you feel lost it just you know mental illness you know you can control it but they're mitigating factors that happened and you've got to focus in on all your training\nI didn't want to let it get out of hand so I made up a you know I'm seeing my psychologist tomorrow so I'm trying to be very proactive at this point because I don't want to let it get any worse which I I doubt it will\nBut you know you just you do with it and um you know I'm here which is good didn't cancel so uh that's a positive thing for the day so why don't you introduce our ah I guess that you've brought in a today thank\nYou so with us today we have Dr Scott health name Dr Hudson is the medical director at ... hospital doctor how can you do want to tell us a little bit about yourself and your background with mental health\nWell it's a pleasure to be on the show when and to get a chance to meet Derek and to talk to the audience I've been a psychiatrist for about Thirty years I I keep losing count because every year it goes up a year and a as it came came to Brown University as an undergraduate than to medical school\nHere then went on to Yale University to complete my psychiatry residency program and had been residing more or less in the\nUh Rhode Island or or their southeastern Massachusetts area working in those areas so it's nice to be here talking to the audience is and and I I'm struck with Derek ...\nObservations about both where he kind of is taking his own pulse as it were on barometer kind of saying himself but I'm going to get up today and in and do this whether you want to call it a task or a source of pleasure\nBut my thoughts were that probably even by the end of just spending or however many amount of time you do the pod cast for just by nature of doing it in gauging it and participating hearing yourself hearing us I I'm going to guess that you will feel bad\nTeaching it participating hearing yourself hearing us I I'm going to guess that you will feel better because it it's going to give you a sense of purpose and and give you a sense that you continue to move forward instead of waking up in the morning thinking of yourself as just sliding back so I'm Glad to be on the show and I'm certainly glad that you\nGot out of bed and are making this happen because that make it happen for everyone here\nThat was one of the things that was important to me that you're a psychiatrist and your psychologist like I have both an out patient ... butler hospital they monitor my meds and then I have my psychologist [noise]\nThe thing is and we had touched upon this last show you your doctors don't want to see just when you're good they need to see you when you're bad to as much as I felt bad today I felt the need to tell people that you know hey I'm not doing too good today but I can still function I can still get out there\nAnd this means a lot to me so people know listen it's okay to feel bad it's just how long you let yourself feel bad which is when you get into trouble\nSo just by getting up today knowing that I had to do this and getting out you know as I was driving over here I felt already better because I was out the sun was out at the window cracked open the you know the cool air so and this is important to me 'cause I hopefully you know people can hear this and and and learn a little bit from it so\nI agree that you know sometimes I Will have patients that will say well doc I didn't want to I don't want to tell you I was feeling bad I I didn't want to feel like you weren't doing a good job as a doctor like dude it's not about it's not about me and my feelings it's about what you're experiencing so I support there when it's time to see your doctor you you you want to lay out where you are and\nAnd that doesn't mean by the way that every time now you you talked about your psychologist that\nOf course as a psychiatrist I'm also able to use medications and I think sometimes people are afraid well if I tell my psychiatrist I'm having a bad day he's going to change all my meds he's going to go up on my meds and when I tell people and and by the way some psychiatrists do but what I tell people is look\nThat's what I tell people ... by the way some psychiatrists do but what I tell people is look you're entitled to have a bad day or even a bad week it doesn't necessarily mean that we have to change medications\nOr we need to take a look at what's going on what the stresses are and then maybe a maybe medication changes need to be thought of but there may be other ways of approaching that don't include medications\nYeah my psychiatrist said I ... butler um they said the exact same thing you know they'll they'll look at my file\nAnd they will make a good judgment you know what you're having a bad week there's no reason to change the meds if there was some adverse psychological differences that they would notice and mean I've been at butler for a Twenty years and I've been with my psychologist for twenty five years\nSo and they share information which is the best thing\nSo if they're thinking about a minute change I'll tell them you know can you called that my my doctor\nAnd at least talk things over and then they come to a great conclusion and they realize you know listen you just got to get out if you functionally depressed that's better than just being depressed and staying in so I'm Glad that you're one of those doctors who realizes also that just because you have a bad day\nDoesn't mean that oh my God we got to you know up his meds\nSo our topic today is actually clinical depression and which is one of the reasons they want to get bring Dr hertz behind kick discuss further what exactly is the definition of clinical depression\nWill you know wouldn't psychiatry we we don't have the luxury of somebody coming to me as a doctor and I said well let me just send you for blood work let me just send you for an X ray will figure out what your diagnosis is\nAre and that has the knowledge to help them solve it I can really go a long way to make somebody feel like they're back on the tractor getting better ... are good but they're not the only answer\nAnd that's something that I definitely live in ... in in a few minutes says is successful treatment and and treatment models that you've seen\n'em you know I think that we encounter a lot in society that sticks that mentality whereas if I get on a regime and I feel better and better and it's done it and I'm short and so I'm going to stop my treatment because I feel better\nUm I think that when it comes to chronic illnesses you know we we continue to struggle with people who feel as though once had better they can ... their treatments become optional are are now in ... would you agree with that\nThink it's a risk most researchers believe that if you've had her first episode of depression\nThat you should be staying on that medication if you needed medication to get well and they should be saying on medication for nine months a two year a and if you've been to therapy ... therapies really helping\nYou don't turn around and say okay I'm feeling better now let me just stopped seeing a therapist you work with the therapist and you'd kind of negotiate around when would be a good time to start cutting back with treatment how will I Know when I'm feeling worse what can I Do to get better at about fifty percent of people that have a depressive episode may not have a another recurrence\nFifty percent of people that have a depressive episode may not have a another recurrent episode\nHowever if you're one of those people who've had a number of episodes than with each episode you have the chance of having a recurrence goes up and say what a certain point most doctors will say it makes sense for you to ... to be on an antidepressant medications and stay on antidepressant medications\nIn that case I agree with you sometimes people will say well now I started back on it and I'm feeling well again let me stop ah I think that's unfortunately that's that's just not how this particular illness works and I gave the example of myself\nYour listeners can't see me but I have very light skin so I'm very prone to sunburn\nIf I go out in the sun I have to wear sun block and I've got to wear a hat and I have to do that every day\nSo it is it's not like I can say to myself okay for the last month I view sun block every day I went to had every day I haven't got a bit of sunburn I'm past that now tomorrow I can go out without some block and a half you know my susceptibility getting sunburned doesn't go away just 'cause I managed to\nHave no problems with it for a while it's it's they're it's they're all the time and I need to manage it all the time and I obviously major depression is a lot different than having fair skin\nBut the point is that because you're feeling better because you've managed it doesn't mean that it's okay to withdraw the thing\nThat may be helping you feel better and healthier you need to do that under the supervision of your doctor\nYou know I I Know that I have a chemical imbalance\nAnd I think people don't realize when they get off the image cold turkey\nThere is a weaning down point that you have to adjust to you can't just get off your medicines and that's going to bring the symptoms back probably sometimes even worse and it was one time I was on seven different anxiety meds for my anxiety my panic attacks and depression I'm Down to two\nDifferent anxiety meds for my anxiety my pack up the tax and depression I'm Down to two\nBecause I have a checklist now I Know that I'm going to have them every now and then\nBut if my brain has been so trained to go through my checklist to make sure it's not a low blood sugar\nTo make sure it's not a high blood sugar to make sure it's not my heart and I go down that and by the time on them and going down that the panic or the anxiety is done in the same thing I Do with my depression okay what am I feeling what did I Do last night while I tape shows that I Would normally watch\nRight that's a sign I've been over sleeping and then I make you know I I write down in the journal I make my costs corrections\nBut but as far as getting off the meds people don't realize if you get them off cold turkey the side effects\nCould make you feel even worse\nThan what you came in for a ... average you agree with that you know you\nCan you can you have a double whammy you may have withdrawal effects that are going to feel a lot like depression and then in some cases the depression could come back and even if you choose to pay for them to get off them you still want to do that in consultation because\nYou know my my thought is\nGood for you you went from seven minutes to two and you're probably feel just as good if not better on two meds but that doesn't mean you can go from two to zero without that doctors consent because it may be that those two meds are one of those demand is the difference between being able to function and becoming suicidal\nWell it's funny that you bring that up because there was one time when I thought I was completely broken and that there was I was never going to get over this and and I know that this is going to be I'm going to have this 'til the day I die but I can still live a productive life\nBut there was one time when I said you know what to hell with all this I'm just going to get off my meds and I and I went off all my meds and that's where I first attempt at my suicide and a funny story I had was off all my meds and I started taking my pills and I had a panic attack\nOf all my meds and I started taking my pills\nAnd I had a panic attack because I was afraid I was going to die and I was just like on his right of course you idiot you're gonna die you're taking pills so I put my pills back and I will not you know I'll never do it again because I Know it was dumb thing to do I call my therapist left messages for them at four in the morning told them what I had just done\nAnd they were condemned\nTo reach out to any family or friends in the interim because I think when you're in that situation if you're a therapist isn't available you want to reach out to\nYeah I'd I'd I'd hold my mom got and woke her up I'm sure lives down the gate but total what I had done but I was laughing so she was scared but I think she had a sense that she knew that and and all my friends you know I share that with my friends and told them you know nothing is that bad where you need to do that\nAnd um I can laugh about it because it was actually really funny to me when\nAnd it saved my life because I mean here I Am having a panic attack afraid to die and I'm just like so I also called nine one one I went to the hospital I take in less than some people take for a normal dose\nSo they said you're going to be a little sleepy and the following day I went to both butler into my psychologist and they just wanna make sure I had a plan in place which I did they were very happy with everything that had gone on\nAnd I would I Would never do that again\nI'm you think about it but now it's just it's just not the it's just not for me\nWhile you're on your may underestimate the effect that people will say doc I don't think these measures are doing anything for me I still feel lousy and obviously that's not my goal my goal is for people to feel good\nBut but what they'll say is but then I stopped my meds and I realized oh my God now I remember what lousy years yeah so you're kind of have this this memory that gee even though you're thought as the Mets aren't doing anything in comparison to what life is like without them they really are helping that's important to keep in mind\nSo given that brought up a a a good point when you were talking about political ...\nKeep in mind so given that brought up a a a good point when you were talking about chemical imbalance I think we hear a lot about chemical imbalance says and I and and I think I Would like to know more Dr ... about the science behind fashion\nWell we use the phrase chemical imbalance to to help kind of get rid of the mystery of mental illness and to also understand that there is some type of biological some type of chemical foundation for our current belief system in and it's it's a model that's worked in terms of figure out how to get people well\nIs that there are certain neural chemicals in the brain neurotransmitters namely serotonin and nor up in ...\nThat are associated with people feeling relaxed in energized a calm and even free of depression\nAnd that the theory is that some people for one reason or another aren't generating enough of these feel good chemicals or they are for some reason they don't have the proper receptors in their brain to make use of them\nSo it's one way of increasing feel good chemicals is to do things that feel good\nSo people that uh exercise regularly and there's one study that showed that people with regular exercise responding just as well as a people that take an antidepressant Zoloft\nOr to their depression so exercising regularly eating proper foods having regular regimented life doing meaningful things like volunteering or more even doing exciting and engaging things like ah\nGoing skiing or sky diving you know those things can energize somebody make them feel positive and they actually can change brain chemicals we can we learn ways using therapies to alter people's brain chemicals\nOr during the depression but likewise these medications can also\n[noise] er during the depression but likewise these medications can also change brain chemicals and sometimes people want that short got that like I don't really want to die and I don't I don't want to eat well ah I Want to be you know two hundred pounds overweight and I want to sit around and watch TV all day just give me a medicine that's going to make me feel better\nOr in my experience the medicines don't work as well if you're not taking care of yourself at the same time so the brain chemicals respond to ... but they also respond to behaviors and actions of the individual\nBecause of serotonin in the endorphins will start to kick in you know make you feel even better you know when I when I'm feeling down like I walked in the park this morning and I knew I had to be up today and I decided to just take a walk to make myself feel better and to motivate myself to get here today I was outside I felt a lot better than being locked up in my apartment ... you've got to get out there and\nSome people will say well you know my depression is so bad that it prevents me from getting out there and I think that sometimes the real the real double whammy as like I Know I should be doing these things but my depression feel so bad and then I Would say basically well at that point you don't ask yourself how you feel\nDon't do a little self analysis they do I feel like walking today it's simply a matter of saying\nI have to walk you know Sunday's come and uh I have to take out the garbage because the garbage man comes on Monday I asked myself on Sunday nights I really feel like taking out the garbage tonight I I have to do it because of I don't I'm stuck with garbage for another right so you don't want to necessarily if you're trying to get in some regiment of behavioral therapy\nIt before we wrap I think that the next ... final question I have seen as mentioned Simmons seek help well it's never I mean if you're not\nSure whether you should seek help go ahead and ask a you know unless you're watching house in everything in the world makes you think that you need help\nOr in which case you should still ask for help us\nYou know I'm ... ... if your friends and your family are coming up to saying I'm worried are the first time they may say it you may just say will stop worrying but if you're hearing it from several different people or someone you love her trust\nYou know if my wife says ah Scott I think you're being a Salt Key lately you know then I'll reach out to my friend is my is my wife right or you know my right\nAnd my friend who usually say Scott your wife is always right\nAnd this is the his strategy for me staying married and happily so if you're if families and friends are saying I think there's a problem you should listen to that\nIf you are used a certain kind of way of viewing the world and it's changed significantly everything feels like it's gray or uh you can't enjoy things the way you used to or it may be signs of depression and you may have a reason you may say yeah but you know I I\nYou know I've lost a loved one or I had a recent job change and sometimes those can be normal reactions but if those normal reactions go on day in and day out and start to affect your daily ability\nTo function it's time to ask for help\nI just wanted to add to that I think also on on on that note that friends and people around if they think something's wrong and don't be afraid\nOh that friends and people around if they think something's wrong and don't be afraid to to pony intervention or do something to help these people because we had to do that with my mom she was an alcoholic\nAnd she you know you have the problem you have to know you have the problem and then finally got family friends together and got her on the street now and I think that can go with mental illness also if you're pushing somebody away you know you might want to try to help them out it's better to be safe than sorry\nSo I guess what you're saying is on the other side of it or can you do anything to help your friends who appear to be suffering from psychiatric illness and the answer's yes absolutely uh whether it's a one on one talk or to get other friends and families together um even to call\nYou know if I'm a spouse in I'm worried about my spouse or I may call the primary care doctor and I may say look\nI'm my wife's coming in for a visit next week I'm worried about these things you know the doctor I you know I said make your own decision as a doctor but I just thought it was important for you to notice and and hope and trust that the doctor will take that into consideration\nWhen does it become emergency well it becomes an emergency when someone stops taking care of themselves they're no longer able to er nurse themselves properly start losing weight\nUm they stopped eating they stopped going to work\nOne of the biggest emergencies if it's a young mother with a a baby because ah maybe getting postpartum depression and not only is the mother at risk but the baby itself is at risk\nAnd of course uh if somebody starts to get to the point where they feel like life's not worth living and feel totally hopeless and the next step is often are beginning to think of ways of taking your own life\nOr which point you should definitely get help because there is help for you\nAnd we will definitely have an opportunity to talk more about the resources in a moment and later I can share with that with Derrick you or harmonica talent\nThe moment and later no I didn't share with ah with Derrick your harmonica talents\nYeah or your well your share their Monica ... see if I have a a monitor in my pocket letters I don't think I really do much for ... or ... or\n... [noise]\nThat's great thank you so much Dr house than Iraq so thank you again for joining us today\nAnd again we were meeting with Dr Scott ... medical director at ... hospital in Edinburgh Massachusetts [noise]\nAs we are wrap up our biggest thing here on our podcasts is to let people know that they're never alone that there is always help out there and you carry 'em why don't you told folks home some of the resources that are available to them\nThere is a plethora of resources out there folks um whether you are in the ... area in Massachusetts or across the country there is a significant amount of awareness um that is around mental health issues in addiction\nSo I can say that you know in our local area we have all types of care with inpatient level of care um we had a patient counseling we have emergency services\nAnd we have addiction treatment centers one of the ways that we thought the community would benefit from dating additional resources or access to resources was through\nYou need to benefit from gaining additional resources or access to resources was through developing what's called a a drop in center\nIt's called the you are not alone dropping center this is a collaboration between Arbor fuller and the ... police department um to bring together those resources I was talking about into one\nOne room one location the drop in Santa model it's happens once a month the last Wednesday of every month from five thirty to eight PM at the murder Unitarian universal is church it that's five oh five north main street for folks I don't know\nAnd what we do is we open up our doors to the community and say hey we understand that there is mental illness and addiction and substance use and abuse is\nIs chronic and more frequent and more um well known than people realize or do realize and maybe don't share\nAre afraid to share their stigma around admitting that you know my my child may have an oath weight issue or my my wife may have bipolar or have depression for instance\nSo what we're doing with the drop in center model which is something that recently came about in Massachusetts\nA is to offer a consistent resource where people can come we absolutely emphasize the importance of anonymity you can come to our dropping center you do not even have to give your name you can come for yourself for volunteer treatment options\nYou can come on behalf of a loved one we have a trained volunteers and guys to help\n'em you know guide you through the resources will have there and I think the best part is the fact that we actually have these fantastic resources around us in the room with representatives\nWho can answer questions connect them connect into services or whatever the cases and there's there's follow up as well um and just to name a few types of resources\nThere's there's follow up as well um and just to name a few types of resources we have South Bay community services are before hospital nor cap lodge high point treatment centers and seven hills to name a few and in fact\nAh we also offer an arcane training\nWhich I highly recommend for anybody who um resides with somebody who has the opioid addiction um you are more likely than say a medical doctor or a medical person to encounter a loved one first hand who has an overdose\nThe turning is free the Nike and it's free um and we're more than happy to to help for additional questions regarding services and a red mental health or substance use or abuse\nOr we have various uh contact information that we can offer you for questions regarding our podcast today you can contact us at mental illness at W. A. R. A. radio dot com\nOr for questions directly for an impatient level of care of patients services I Am available I carry Baluch community relations coordinator you can reach me at five oh wait seven six one eighty five hundred extension two three five for for information regarding the you are not alone dropping center\nYou can contact myself directly again at the number that was just mentioned where he can go on our Facebook page at at a bar recovery and messages and reach out\nTo wrap this up if you're not in the Massachusetts area\nAnd you think you have a problem just dial nine one one get the ambulance out there tell them how you're feeling and they're there to help and they're going to find you a mental health care facility\nUm for those people hopefully we're getting more listeners than just in Massachusetts but you know around the country hopefully dialing nine one one don't be embarrassed about it I mean they're there to help them they're going to just explain your problems\nAnd they're going to get you to the right facility\nThey're there to help and they're going to just explain your problems and they're going to get you to the right to ... and I I think that's one of the most important things and like I said you know um we had help\nOr to let you know that that you're not alone so um want to thank Dr Scott Hoffman offer coming in for Kerry blue I'm Derek mall here and and um this has been exploring mental illness everything you wanted to know but were afraid to ask and until next time be well [noise]\nThe contents of the explosion mental illness part cats provides general information a discussion about medicine health\nAnd related subjects the content provided in the podcast it's associated website in any links material or not intended and should not be construed as medical advice this park I should not be using any legal capacity no guarantee is given regarding the accuracy of any statements were opinions meat on this broadcast rights associated website\nIf the listener or any other person has a medical concern they should consult inappropriate licensed health care professional the views expressed on this project you're not represent their views are opinions of ... cable systems\nYou're listening to W. A. R. A. Thirteen twenty am Arab world [noise]\nWalking to the double your daily news and James Freeman WMA Thirteen twenty radio host powerful Guerra Ella former question one of the out of our public library born featured a representative from each side of the debate and questions from the audience\nWhen he was also a girl junior um bin ... pretty well in the community I have a radio show here on W. way already Thirteen twenty\nAnd today we're having an open forum regarding the question one ballot initiative that is a nurse the patient a ratio is\nCurrently the the only racial it existed is the ICU a nurse but this will go across the board to a surgical units in in general we have two organizations with us or the Massachusetts nurses association who are in support of it than we also have the American nurse association\nThose that are opposed to about an issue\nIt's important to know this particular initiative because it's going to be on this this coming election it's a valid question one you've got your vote for\nGoing to be on this this coming elections a balance question one you've got your vote for your politicians and everything and so forth but you also have your ballot questions will be voting on as well\nI had a lot of community of members ask me questions about this I figure to having a former would be good so it looks like we have a pretty good turnout advertise through social media in general and then also just word of mouth and this was meant to be an educational not confrontational event\nAnd I really thought that was important to emphasize that I'm Still get emphasized that even more when we get out there so um my radio program at the same thing it's more educational and informative for our community so I'm Glad we have this opportunity to do so\nThat their protests update you can watch all of our content by visiting our website double A. C. S. dot com by downloading the double ACS mobile apps or by visiting the double A. C. S. Roku channel [noise]\nI everyone clouds will melt away early this evening revealing clear overnight falling down to a seasonable cool forty degrees wins will diminish tomorrow a lot of sunshine almost one hundred percent of it\nUnfortunately only a little more than ten hours of it but it should reach about forty nine in the afternoon a pretty good breeze out of the northwest clear cool low in mid thirties tomorrow night and right now\nWednesday Halloween day sunshine becoming breezy in the afternoon a high approaching sixty likely somewhere in the mid fifties but trick or treaters as the sun goes down on Wednesday evening staying dry but a bit of a breeze\nAnd how about this for Thursday sunshine increasing clouds quite breezy but in the mid sixties showers by later Thursday night and a windy shower read a mild on friday the thirteenth twenty W. A. R. ray I'm Jim corporate\nOn Tuesday October thirtieth from five pm to eight PM be regional chamber of commerce will hold its twenty ninth annual taste of the region at tri county regional vote technical\nCommerce will hold the twenty ninth annual east of the region that tri county regional both technical high school and Franklin piece of the region is an annual celebration of restaurants from all the sixty communities that the regional chamber serve attend these will have the opportunity to sample booth or variety of restaurants that are members of the chamber\n[noise]\n\n\nThe\nWe didn't do why\nWhy do\nYou\nWe know\nNot why\nWhy not but it\nWhy not why\nWhy not get\n\n\n\n[noise] why\nBe talking\nDa da\nDe ... to go and\nLa la la la\nLower ...\n[noise] been\nRaining all\nWill make\nHappy\nKnow but now my my\nWell they\nDo not\nHave been\nAnd the guy\nWill be back\n... and then one of them and they take\nYour hands down by\nNow I'm On\nThe plane so learn\nFrom\nHoping that day [noise]\nI think you'll see\n[noise]\n\n[noise]\n[noise]\nBut the thing\nThat you would leave a bond that up\n\n\nI can do to get up on that you\nOut about things you know when to be dying to get on the\nDa da\n\n\nThe\n[noise]\n\n...\n\n\n... ...\n\nWell\nWell\nI'm On\n\nOwn bone and getting a job and just go by you know we're going to find me with my mom and dad extended dress codes that", "show_name": "no_show", "year": "2018", "city": "Attleboro", "day": "29"}