{"month": "10", "state": "NY", "station": "WRUR", "content": "... ... ... ... ... ...\nAnd\nA year in just ... votes they\nNeed a\n... said they saw me\nJay ...\n... the eyes Buner number\nJust ... ... ... ... ...\n\nBad news is so\nSomeone said there's a man\nA ... ...\n\nMe to go\nMile will decide\nI made\nWhen you asked me to say what I already had\nUm one side is the last\nDays Jay and ...\n... children number\n...\nDays during\n...\nI've been here like the news\n...\nHi\nMy friend your mic how can you spare piece rent co production the fur peace ranch W will you be public media a concert producer ... account the rainiest theories producer is ... ... ...\nAudio engineers run ... ... Adam Reach\n... ... ... ... ... ... ... ... ... ... ... [noise] ... ...\n... ... ... ...\nThis is different radio W. R. U. R. S. and an HD Rochester\n\nRemembering the enemy and fats domino who brought New Orleans rhythm and blues into rock and roll also British guitarist Albert lea you grew up with American music on radio and came to the U.S agree the new rich you watch the roots rock I mix bitter joined me for American roots for the Iraq [noise]\nYou can't force yeah different radio\nRob rayner your host or used to say and I'm an extreme we're going to have some in Studio performances from iron wine is what the three D. plus music for Mavis Staples new ... Thompson enter each week a journey discussion with language that and more next time I ...\nMhm [noise]\nThe morning\nAnd by the way you are you are ... Rochester [noise]\n\nMm [noise]\n\nSupport for the Grateful Dead our comes this week on the Capitol theater in court jester New York Brooklyn power bunk army Turk was makes their kept debut on friday October nineteenth supporting their new album liked in the city opening the show the organ virtuoso Corey Henry and the apostle events information and picking up to Capitol theater dot com\nThe cap is also went up the second show ... friends on Thursday December twenty seven but Melbourne seals Eric grass no John capitalistic Jay Lane Jennifer Kurtz we'd eat ramen ordeal friends with the cap December twenty seven\nSecond show added by popular demand tickets are available at the box office in the Capitol theater dot com\nAdditional support comes this week I'm lily bail bonds handmade chocolates recognized as one of America's top ten chocolate cares by pastry art and design\nAnd build toward winning creations include the eighty percent dark star bar the Seventy percent rambling rows and more made by his forehead L. I. L. L. I. E. B. E. L. L. E. farms dot com\nThe whole\nDo with\nLeisure time this week is on\nThere would be a\nLaw suits\nCertainly\nDon't want to\nThere\n\nTime around there's\nMore\nTo do it and you got to proceed to\nTo go\nThree in the journal", "show_name": "Grateful Dead Hour", "year": "2018", "city": "Rochester", "day": "21"}