{"month": "10", "state": "NY", "station": "WRUR", "content": "What do you get a little Robert so long\n... ... ... ...\nA mother that had done all well again\nThe Mona up you know\nWrote an adventure I must know\nWhy\n[noise]\n[noise] [noise]\n[noise] [noise]\nSo much right so I'm going to close out with\nThis song which is designed to show you the connection between the different artists Willie Brown played these notes like this he did the same notes I'm going to do three artist and the same set of notes basically three notes opted Willie Brown played this [noise]\nAnd then telling me jobs and play the same ... like this\nAnd Robert Johnson did I'm like this Mm\nSo you don't always say well they're playing the same thing because the styles were\nSo different so I certainly remember you know early Muddy Waters it was just like Robert Johnson and his name was McKinley Morgan feel did you know\nWhen he first started recording and this is the song I wrote called I'd be bone\nAnd literally here that connection when he was once blank acoustic lose do that Robert Johnson sound\n\n[noise] Mm\nWell I Know I'm a mean old baby machine all no I hear\nYou don't real mother we don't even tell my kids\nHow about ...\n\nWhat do you do [noise]\nWell I Know I'm I'm you know based on the shelves\nThat OJ bin Laden I\nDon't know if you know I'll be\nA writer you\nMm I\nDon't know what do you do [noise] Mm\nMm\nWhat do you\nTell me you know last time I'd be\nI'd be found a ride you\nDon't care what you do mhm\nMhm [noise]\n\n\nWhere they've anybody asked you to compose this is our\nCalendar is ...\n...\nHave you found a ride you\nKnow Mm Mm I\nDon't know what\nDo you do [noise]\nMm\nMm [noise]\n[noise] [noise]\nMm\nLive from your book how can inspire piece ran to the coal production the fur peace ranch and W. will you be public media the concert producer in the cabinet on the radio series producer is Rushdie Smith\nAudio engineers and ... ... an atom\nWrench ... ... ... ... ... ... ... ... ... ... ... ...\n... ... ... ... [noise]\n\nThis is different radio W. R. U. R. S. M. and H. D. Rochester think for a moment where else would you turn if one day public radio wasn't here for you\nDon't you know the chance to help make sure that they never caught joined us a new member Monday when you can do your part to keep this resource alive and well whatever you decide to invest will be doubled thanks to a day long matching grant you had you could end up winning an Amazon smart speaker\nIf you've ever thought about supporting us vital resource new member Monday is your day to step up and be part of it\nIs Reverend hurt your host for Andrew suggests right and I'm an ex program we're going to have a live studio performances from iron and wind as well as deep wash music for me was stables pneumonia solar rich Thompson enter into your guest weaker Charlie discussion with lingering slim better more next time on extra care\nFor\nMorning and by the way you are you are and how they're managed to Rochester\n[noise]\nSupport for the grape all that our country speak from Louisville farms handmade chocolates recognized as one of America's top ten chocolate tears by pastry arts and design movie builds award winning creations include the eighty percent dark dark bar the Seventy percent rambling rows and more made by his forehead\nL. I. L. L. I. E. B. E. L. L. E. forums dot com\nAnd from real gun music label that brought you all those Dix picks and road trips releases over the years finally taking the plunge into grateful deadline\nThey're releasing Dix picks thirty four recorded eleven by Seventy seven in Rochester in six helping to hundred and eighty grand vital set master by David Glasser air show the box includes a four page lp size insert\nAnd it's limited to Fifteen hundred in number copy it's available at real gone music dot com\nAdditional support come just wait from the Capitol theater and Garcia is in Port Chester New York Michael ... and spearhead bring good vibes musical sunshine did the cap on Thursday October eleven and a priest muggy takes their shredding gyms to the cabinet southern avenue\nOn Sunday October fourteen every Wednesday is Grateful Dead night Garcia events information and ticketing at the Capitol theater dot com [noise]\nThe cat is also announced the second show with ... friends on Thursday December twenty sevens with Melbourne CEOs Eric crash no John capitalistic Jay Lane Jennifer hearts weigh\nIn weedy brame oh deal and friends at the cap December twenty seven second show added by popular demand tickets are available in the box office in the Capitol theater dot com [noise]\nThe children\n\n\n\nRocket\n\n\n\nAnd he ... down in the ... [noise]\nShe had Ruben Ruben Ruben was another little\nRoom\nI don't know it must have been the ... [noise]\nAll of them know who knows the were the [noise]\nI don't know we'll get most of the day and the roads are\nThe rules of the ...\nFor a while\nI don't know but the most they\nCould not believe her the\nRoad to ... [noise] a\nLot of the\nTen years away as rose Bush ...\nThinking well how we may blow it all good company but tell them no matter what you know they've been told to\nMe ... lean need\nThe roses and ... I don't know most of the road\nMaintenance ...\nBrown I don't know maybe you\nKnow could have done the most\n[noise]\n\nOne day in a glass and when does\nNo one is to blame\nOr in print from the strange how no one threatened\nIn [noise] [noise]\nMaybe [noise]\nThe road ... loan brown\nI don't know my dad\nWas\nAll a no was it could not leave where they\nRow row\nRow row row [noise] and Italy\n[noise]\nShe had to live in ... alone around\nI don't know maybe I\nCould not leave and [noise]\n[noise]\n\nTwo songs from tails at the great rubber enters the first album by Grateful Dead lyricist Robert Hunter released on route record in Nineteen Seventy four\nIt must have been the roses was adopted by the dead who first performed it in February of Nineteen Seventy four we began with two more attracts from the amazing new grateful that box set Pacific Northwest Seventy three Seventy four the complete recordings\nAvailable now via dead dot net\nYou wait woman enough to take my man Loretta Lynn classic as from June twenty six Nineteen Seventy three and that intense around and around us were made twenty first Nineteen Seventy four this is a great relief documenting a peak time and Grateful Dead musical history\nPlease stay tuned for somebody to release grateful that music from the summer Nineteen eighty eight when the great but that our continued\nTo [noise]\nTo\nBomb\nPlan\n\nThis week when you get stuck in the second who we are hearing here some familiar tunes at first toward the end of the show gets really obscure trickier skier we don't have in a band psych Sigmund when we do have something almost guaranteed ... before\nMoving some grace slick with the great society coming up to that this week when you get stuck in a second don't care who the harm it [noise]\nAnd I cannot do we are you are ... Rochester\nMaybe the tri state we\nWe can\nNot only press visits the mountain stage this week along with the Jill Silvio you're more like red wanting blue and Todd ... Hi this is Natalie ... joined me this weekend like performance I meant to\n\nThe grateful that our I'm David Gates were about to get started on the complete hundred released recording of July Fifteen Nineteen eighty eight at the Greek theater in Berkeley, California this was the first three shows all of which were benefits for the ... foundation\nThe wrecks foundation is still doing great things in the world you can find out more at ... dot O. R. G. it's seven Fifteen eighty eight on the Grateful Dead our enjoy [noise]\nOh\nWill look\nThe\n\nCould kill Shakespeare ...\nThey got\nDa da\nSay you know she's the\nBe the hottest yeah\nMind\nThe last\n\nMatter of hours chair bound to\nShield them\nTwenty below the\nBig bowl and they\n\nTold me there\nDog it'll\nJob to the\nAnd the\nThe person who has made this do we look for in a\nLong\nOther one is preserved they learn\nPretty good you\nKnow a mother up and read\nGuy\nBut they do learn really [noise]\nBlood\nA stay at home because they\n\n\n", "show_name": "Grateful Dead Hour", "year": "2018", "city": "Rochester", "day": "14"}