{"month": "10", "state": "NY", "station": "WRUR", "content": "\n\n[noise]\nThank you so much [noise]\nHad a wonderful time been within night and you got a real treat coming shortly a couple of announcements first of all I Want you to join the infection too fantastic musicians for their help we're together all\n[noise]\nAlso um we brought some CDs will be in the silo their afterward to a signed them for you\nOr we recommend that by the way it activates the C. D. to be signed [noise] that's how you know you'll get the full stereo ... effect that we worked so hard to achieve so don't buy 'em and run hanging around will sign then we'll\nDo silfies we ... we don't believe in singing to declare preaching to the choir it just doesn't work for us we all know the true of global warming we know\nWhat it is that it's real we know that we're causing it all of that is so clear that the last thing you need is a song saying\nWatch outdoors world is getting warmer so we thought what would be more fun was to it or the other side of the argument\n[noise]\nPeople keep complaining a bunch a Chicken Little decline changing afraid this chicken it'll lead to our demise so they decide that to me it's just more left wing science lies so before another ...\nYears perhaps you'll permit us patriots too when I\nWas so bad about a beach in Boulder they ever have to worry about December getting colder ... January tan ... each Puerto Rico with the keys or you can\nWhich by the way won't be there anymore\nThere's diverse dream on the ... a little thicker sunscreen you'll\nKnow wider had\nWhat's so bad\nWas so bad about the coast of Oklahoma log along the boardwalk and\nSavor the aroma from the whales down in Dallas knew the lobsters in Milwaukee last a long hard sushi and sip and soybean Augie\nHomer bears in prairie dogs the pictures truly splendid\nTrend in one of the the the way the lord and we saw the little blubber while we choose that\nWhen I was so bad\nNot so bad about that\nWhen you know we all arrived why worry about the fact is one so bad about that man I don't\nWhat's so bad about the Appalachian ... lands that used to be the highlands sit\nAnd then I ... down some beer and on the ship it in a speedboat round no more in a modern near a\nTime to quit your business rather them right said I\nWill not mine and come over to the right side you know\nI had to do it when he beach John rat roulette\nBond some water wings flip flops imperative that\nRuin a rejuvenate came back and relax\nLead the party in our right to\nLot so bad about that\nI'm I'm Bad at the good times\nCome on baby that Israel yeah so\nTime I'll bet you that in a row\nNo no no I'm not alone badly yeah they\nKnow bad you know man I don't know they go down the road\nBad about that\n[noise]\nLive from Norman countenance fur peace ranch coal production on the fur peace ranch and W. will you be public media the concert producer is an ethic how can you the rainiest theories producer is rusty Smith boom\nAudio engineers rusty ... and Adam Rich [noise] ... ... ...\n... ... ... ... ... ... ... ... ... ...\n... ... ... ... ... ...\nThis is different radio W. R. U. R. S. M. an HD Rochester\n[noise] for Halloween a gene ... spirit\nWho knew and haunting Phantoms in technicolor dreams are gas in the bay area ... our rockers Shannon's McLean plus music from Miles Davis and Howlin' Wolf and Dr John in the Grateful Dead joined me for the ... on American roof of the Iraqi [noise]\n\n... ... pm and different radio\nIt's Rob rayner your host for who's the cafe on the next program we're going to have used up from Amy held the legendary voice William down with a brand new track also Amy Ray Canada springs entering studio guests of the week to live in Nashville and America ... John Hi and that um\nNixon I used to be in\nThe morning and by the way you are you are not Lehman HD Rochester [noise]\nThis is\nAnd\n[noise]\nAnd the\nPlayers go we\nNeed to\n\nSupport for the grateful that our country this week from the Capitol theater in Port Chester New York yet the lead authors to musical bloods apple at at the cap on Saturday November third\nGet the let out as a group of passionate professional musicians have captured the essence of Zeppelin and of course every Wednesday is grateful that night uh Garcia's events information and ticketing up to Capitol theater dot com\nThe cap is also announced the second show by popular demand with ... brands on Thursday December twenty seven when Melbourne seals Eric grass no John capitalistic jail ain't Jennifer hearts weigh in ...\nHotel and friends of the cap December twenty seven tickets are available at the box office and at the Capitol theater dot com\nAdditional support comes as weight from Louisville farms handmade chocolate recognized as one of America's top ten chocolate tears by pastry arts and design\nLowly bells award winning creations include the eighty percent dark star bars Seventy percent rambling rows and more made by heads warheads L. I. L. L. I. E. B. E. L. L. E. farms dot com\nAnd then and\n\nOoh\nA new [noise]\nAll around to see\nThe new\nOne for me [noise]\nRead\nThe band I saw\nWell first received as you\nWell are\nSmog is bad news there is a really\nThen was the um [noise]\nUm there was no\nProblem no [noise]\nNo I mean you\nDon't you don't\nKnow\nWho the\nUm\n\nNot clear to\nMe from\nSleep you\nKnow I'm a\nMan named you\nNow have a job for\nIt was a\n\nMan I'm\nBarely due to\nLaugh too [noise]\n\n\nAs soon\nHe would be John\nTo go\n\nLord of the job of you is there any way\nThey\nDown the road\nNow John ... only smoke\nThe boys necessarily\nWhat to do with the no ... no no\nNo and we're not\nKnow you've\n[laughter]\n\n\n\n[noise]\n[noise]\nOoh ...\nSees [noise]\nGrateful that if the Greek theater in Berkeley July fifteenth Nineteen eighty eight oh have more from his wonderful concert for you in next week's program and I'll have some more great GED from Nineteen Seventy three for you when the Grateful Dead our continue\nIn New Hampshire\nMan\n[noise]\n\n[noise] ...\nThis week when you get stuck in the military you can you hear a lot of regrets shows two years where we started one end of the spectrum and work our way back when you're at a time like we do it over and over really wants to we move forward\nYou learn new artist sets either through other unusual show this time around that's this week's stuck in the psychedelic here with her from\nThe chance\nIf we are your abdomen HD Rochester\nKey Amanda Shires joins us on the next\nStage along with the war in three D.\n... and the Israel and then you decide Mrs ... joined me this week and lived there for me one state tomorrow afternoon it to a different ...\nIt's the Grateful Dead at work I'm David gas here's another tracks and the amazing Pacific Northwest box set this is from six twenty four Seventy three at the Portland coliseum enjoy\n\nThat\n\n[noise]\n\nUp to\nMe so\nTold you so really\nHave like a game\nSo\nWhy not\nJust when I\nYou see\nSo so", "year": "2018", "show_name": "Grateful Dead Hour", "city": "Rochester", "day": "28"}