{"month": "10", "state": "WI", "station": "WFAW", "content": "Fort Memorial Hospital in Fort Atkinson are specially trained to care for prenatal visit [noise] routine at high risk pregnancies labor and delivery plus post part of the\nFord healthcare has been designated that baby friendly facility one of only a handful in the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience you can enjoy all the comforts of home starting with his spacious private sweet experienced the hydro therapy\nBefore and after ...\nPlus for health care has restaurant quality food service twenty or something [noise] leaves visit ward healthcare dot com forward slash the\nTo\nGet ready and the next sixty seconds you're about to become armed and dangerous what will be your weapon of choice questions that's right questions questions that exposing scare off predatory mortgage lenders questions like\nIs that pre painting penalty or a balloon payment or taxes and insurance included a loan payment I Need all the ... ... eligible for a lower interest rates\nNow predatory lenders are still on the hunt for new victims so if you're about to refinance or our first time homebuyer ... armed with questions and shop for your mortgage with confidence getting more questions that protect that eight six six to to to fair that's eight six six two two to three to four seven or go to\nAnd some shop for your mortgage with confidence getting more questions that protect that eight six six to to to fair that's eight six six two two to three to four seven or go to questions protect dot org that's it the minutes almost up you're looking more lethal already question everything protect your own\nA public service announcement Bronx you by the national fair housing the lines on the ad council\n\nTime ... do you have a lot when you were born Africans\nAnd online at nine forty WMA W. dot com\n[noise]\nThis would be\nRebellious zones Jeffrey ... leader of the tree of life synagogue and the squirrels hill neighborhood cheerfully recites a prayer for the ... at a memorial service in Pittsburgh last night thousands of\nPeople go to the ... the soldiers and sailors memorial hall on the campus of the University of Pittsburgh many other than being outside in a whole grain\nMyers who is in the synagogue when authorities say forty six year old Robert powers walked in armed with an assault rifle in free high powered\nBoost does when the shooting began authorities say Myers tried to save as many of us cover against us you could but most of those in the back to to make a\nHe said he jumps right behind the day is as soon as they interrupted dialing nine one one serving as first responders pies and here's what he saw was indescribable and what I asked\nHim about that horror whether he had any psychological counseling himself said I don't have any time I have too many funerals the class\nAs for the suspected gunman Robert powers he's expected to make his first appearance in federal court this afternoon like six of the victims he was wounded and the gunfire hit several times by police it was rushed to a hospital and those undergoing surgery it's not clear if ours will be arraigned in court\nOr bedside at the hospital I'm Pete combs in Pittsburgh now with more news here's Michelle France and\nThe man accused of mailings effected type bombs is expected in court this afternoon in Miami DC's kind of ...\nVideo obtained exclusively by ABC News shows package bombs suspect Cesar ...\nDuring the same week you've accused of targeting prominent Democrats the door host on the job of older gentlemen's club in West Palm Beach Florida City obscene greeting customers and flipping through papers early friday morning hours later FBI agents took him down\nYou're listening to maybe ...\nHey I'm Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he's diagnosed with cancer stage four\nAnd here's the thing he had switched earlier from medical insurance to medical care where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work\nOur medical bills exceeded a hundred and sixty thousand dollars Medicare members shared all our bells\nAnd it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you because the hardest times of your life I just don't know how I could have done it without measure\nIt's so worth looking into there's a reason this is growing so fast so if you want to find out more here is a number for you\nEight seven seven twenty six Bible that's eight seven seven to six B. I. B. L. E.\nAnother world series cram for the red Sox after beating the Dodgers in five games over\nAn hour after the game ended thousands of Red Sox fans continued ... champion celebrate in the stands behind the visitors' dugout\nUnbelievable I mean\nThis is a Red Sox fourth world series wins in two thousand or taking the victory on those three thousand miles away from home returning to Boston as champions once again Alex Stone ABC News at Dodger Stadium a man\nWho survived to fall down a mine shaft in Arizona is now talking about surviving that fall and being stuck for two days ears ABC theory oh the most people wouldn't even look down at one hundred foot mine shaft but most people aren't John what else about\nIt now and so that's a long way down there\nNot only did the sixty two year old amateur prospect or look down at he fell down at ending up with a number of fractures and and all too close encounter with more than if he rattlesnake when you're in\nClose quarters in no way to get out and you got to come up with something court\nFriend found him forty eight hours later why Dale is still in the hospital but his doctor say he'll be fine ... President Trump has called the new president elect of Brazil to congratulate him ... both narrow a former army captain who also\nDespite being stabbed during the campaign one officials say the conservative both a narrow won by about ten point this is ABC nice\nDo you owe more than ten thousand dollars in back taxes the IRS have special programs in place that could eliminate or reduce your tax dead by thousands of dollars for the call to a TA you can stop the wage garnishment levees in ... now the IRS is currently accepting reduce settlements and other favorable programs you may qualify for a substantial savings to get\nThe help you need if you owe the IRS ten thousand dollars or more coal ADA to see if you qualify eight hundred eight\nZero five ten fifty five that's eight hundred eight zero five ten fifty five eight hundred eight zero five ten fifty five I'm Michelle France and ABC News\n\nNine forty W everybody do you\nDo you have a W morning news\nIt's currently forty two at six o five hour forecast today calling for partly cloudy skies very comfortable\nFive fifty two will get more from the weather I whether it's that are coming up in just a couple of minutes and sports what a tough way to lose a football game yesterday for the Green Bay Packers we'll have details coming up [noise]\nI Know for W. F. A. W. news in this week\nHere's Jake Gerard good morning Jake\nGood morning Gary uh Janesville couple was arrested on tentative drug charges after police executed a search warrant Friday after residents Janesville police executed a search warrant at four thirty one Madison street officials say\nThe target of the search warrant was forty five year old Jen Mariano often AKA Miami officers observes often and his girlfriend thirty nine year old Anna Lisa and Martelly leaving the residents in a vehicle and conducted a traffic stop to take the two into custody according to the release\nOfficers search the house and found drug paraphernalia over a thousand dollars in cash in several electronic devices well often was arrested on tentative charges of possession within tend to deliver cocaine maintaining a drug trafficking house or vehicle possession of drug paraphernalia and possession of a controlled substance\nMartelly was arrested on tentative charge possession within tend to deliver cocaine\nOfficials have identified the Milton man who died Thursday morning and it crashed in the town of harmony Seventy eight year old phrase oil Hillman was taken to a local hospital where he died a short time later ... results of the autopsy confirmed that Hillman died from injuries sustained in the crash the crash remains under investigation\n\nMadison police say a Twenty one year old man has died after he was\nTo stand in the crash the crash remains under investigation\nMadison police say a Twenty one year old man has died after he was shot in a downtown parking ramp over the weekend\nPolice say the man was shot in the states three campus ramp early Sunday Morning authorities say Steven Villegas of Madison was pronounced dead after being taken to a hospital with a gunshot wound to the torso no one has been arrested\nMadison police chief my cold was asking for the public's help finding the suspect please do not believe the shooting this random it's Madison's fits homicide of the year and the shooting happened soon after the annual Halloween celebration freak fest wrapped\nUp the\nDodge county sheriff's office is investigating an officer involved shooting that wounded a man in beaver dam beaver dam police were called to a domestic incident friday night\nSheriff Dale Schmidt says the officers quote reacted to the situation and involving a firearm and quote and that preliminary information shows that law enforcement fired shots\nAuthority said thirty five year old beaver dam man was shot in the lower extremities he was taken into custody and transfer it to you W hospital for treatment of non life threatening injuries one officer suffered minor injuries trying to take cover\nThe incident is being investigated\nThe Boston Red Sox out of the world series jams for the fourth time since two thousand four after Steve Pearce and David Price led them to a five one victory in\nGame five in Los Angeles fears homely twice of took the series MVP honors by going deep three times and collecting seven runs driven in over the final eleven innings\nThat's filling my life and uh you know this is what you are you going to wishing that you could be a part of something like this and within that special group of guys out there to celebrate with them that was it was awesome\nPrice scattered three hits over seven plus ... blank the Dodgers after David Freese let off the bottom of the first with a home run the Dodgers have lost in the last\nTwo for classics and haven't won the championship since Nineteen eighty eight\nMilwaukee Brewers outfielder Christie and yell at each was the Hank Aaron award winner of the national league while Boston Red Sox the H JD Martinez to call me ... and the American league yell at you have three twenty six with thirty six home runs and one hundred yen runs driven in leading the national league in batting average and slugging percentage\nOn the ice the Houston or I should say the image of dollars pulled out of two and when asked Chicago on comic David Gold fifty three seconds into overtime\nAnd tell but stopped thirty one Kevin ... his third goal of the season was less than ten minutes to go to break a one all tie and lift the University of Wisconsin whitewater men's soccer team to win win over August data\nWhite water will return to action Wednesday night for the final regular season match when they host plant filled at seven o'clock\nArea results from the W why a steak cross country me Saturday in Wisconsin Rapids in division two boys results the Jeffery Segal city sixth as a team individually wheels manning of Deerfield Cambridge was twenty second and the girls division to team results\nJefferson was seventh lake bills finished eleventh well division three dodge Lewis third Marshall came in six\nIndividually Fort Atkinson gentle love joy finished thirty eighth and the division one competition by ... it's who was Twenty one hundred and twenty first in division two and Johnson Greek junior Hannah constable was temp\nIn division three enjoy the ghetto claims for spots a NASCAR season ending title raised by winning at Martin's bill bumping leader Martin Truax junior as they cross the finish line Denny Hamlin through the second followed by Truax Kyle Busch\nAnd Brad Keselowski and\nThat sports you're on nine forty W. F. A. W. N. nine forty W. F. A. W. dot com are forecast today partly cloudy skies high of fifty two right now in southern Wisconsin\nWe are at forty two W. F. A. W. new Siamese six Twenty one as we do every Monday morning at this time we bring in ... and we find out our brand new pair of the week good morning Sarah\nHow we're doing fine and who is our pedal the week this morning\nThe Harper\nCalled\nBrown [laughter] very\nHot you can get really quiet how hot does her caregiver here [laughter]\nLoves died and cuddled and ... in fact um when\nWhat her caregivers and volunteers clean her cage at the shelter she will literally climb up on their shoulders and stay up there while while they clean it's pretty cute so Harper is um she says a C suite funny adorable little kitty\nUm another really cool thing about her um she has had a litter of kittens so as happens a lot of times the kittens have already been adopted so Harper is waiting for her forever whole after having a sitter and taking wonderful care of her kittens\nUm for that reason our shelter has a really cool program called bomb\nLeft behind oh there you go I liked that absolutely so any cat who has had a litter of kittens for adoption fee\nIs always half price so that's a little incentive to try to get so the wonderful love us like Harper though flooding homes that they deserve to kittens leave our shelter pretty quickly because\nUm I don't know if you've ever seen little kittens play but there's really not a whole lot much cuter than that so kittens to get adopted really quickly sometimes among us and the older cats\nUm it takes a while I'm One of the really I was going to give us a little that may be people listening light not know about the humane society of Jefferson County\nThere is no ticking clock on how long is an animal and stay with us meaning that there is no time limit 'em we literally have had cats at our shelter for over a year before they followed their forever home now we never want to have a cat for over a year that's a long time to be at the shelter\nBut um but there's still a ticking clock for these guys however long it takes to find a home that's just the way it is but we'll keep them safe comfortable and happy until the right person does come along and and adopt them\n... Senate exception to the ruler most humane societies like that\nWell you know here and we're pretty lucky in this area that there are a lot of stray cats but they're not a lot of street God but um with our ... our shelter um I Would I Would say were really fortunate that we can say would not super overcrowded\nUm ... unfortunately they do not have that luxury and the you know I I mean bigger shelters in\nBig cities I mean they get it all fifty at a hundred animals a day sometimes wow I mean that's just me crazy\nYou know being in a small rural area like us I'm certainly not the case now I'm not going to say we don't have a lot of cats right now because we've probably got close to a hundred but um yeah they'll they'll be there until they find home which I think is awesome\nYeah that is terrific well sounds like you have another winter there is there a\nWay to yes so if you're interested in coming into made Harper we do open to the public from one to six every Monday through Saturday and I just want to add really quickly this one is Halloween and we have trick or treat but the animals that day\nSo any hits that come with this at us and costs to go get a three and a treat to take home to their furry friend and a bunch of shelter animals will be in Halloween costumes and it's pretty darn cute\nI bet it is I bet it is a fight on Wednesday All right sounds good we'll check in with you again next Monday morning out alright ... this morning with harbor this week's pick of the week usa W new Simon six twenty bucks\nWednesday night it would be ... by ... to ... this is Douglas joined the Wednesday night at seven and eight forty one brew house you'd want to be joined by head goes gambling and then she goes employers one six point five border quarterback will go to show this Wednesday night at\nForty one room she might want to want to point five and I'm On a dime WWW dot com [noise]\nMaybe you know the sharply lower on Friday after this morning earnings captive\nBrutal and vote a week on Wall street the Dow Jones industrial average finish this session nearly three hundred points lower a twenty four six to ... the standard and Poor's five hundred took a bigger comparative hip losing forty seven points the composites relative loss or just over two percent was even heavier\nSam's Club is going high tech announcing a new shopping experience at a store embellish Sam's Club no less customers buy goods from the companies up well inside the store\nThe Dallas ... for the latest shopping technologies Sam's Club\nOr trial that begins today in Denver could have far reaching effect on the medical marijuana industry\nA couple of planes that cannabis business near the southern Colorado home is driving down property value is because of the stench and attorney for the business do argues that tax valuation show the property value is actually increasing ... ABC News\nNine more to do when you wherever you W and nine forty W wherever you W dot com\nBishop they brought to you by Monica ... with a one or two\nAnd a pianist Hank issue we age you know\nI Know that for the brown field the paint that's really base age you melt company is being challenged by the national milk\nProducers federation claimed that their products are easier on human digestion than conventional milk\nAnd national advertising division has referred to advertising claimed to the Federal Trade commission for further review after age who refused to participate in a review and clean and MPs to England beer gun tells brown field\nWhen you are casting aspersions on other producers and other products for reasons that don't have scientific grounding that in some ways undermine the credibility of milk as a beverage is that the real issue\nMinnesota ... producers incorporated in that scene in New technology to produce more cheddar cheese new genes that will increase production tell most three hundred thousand pounds and in ... Minnesota plant\nYou want to see any than Kashkari ... says ended the weak lower except for ... butter demand continues to increase because of holiday baking needs and crumbling or become tight\nSheets production the mid west his lightning milk supplies damp who'd milk production varies with seasonal weather shift and prices in the Dr ... marketing Denny\nI noticed that hadn't been updated for a while but it hasn't changed inside of the northwest for currently forty two here at nine forty W. F. A. W. N. nine forty W. F. A. W. dot com and before we go any farther this morning a special congratulations going out to a whitewater high schools Jacob your\nGM and you argued your or winning a national proficiency award and diversified horticulture at the FFA convention going on in Indianapolis and congratulations on that is a great honor so congratulations to Jacob do more I Hope I'm pronouncing your name right Jake and uh that is a truly a great honor from the FFA\nThere's a lot of people at convention so oh yeah a win an award like that as a pretty cool deal though are regulations ... got his picture up on our website this morning to so\nThere you go hey a couple of things coming up here up first of all today the fair haven lecture series celebrating one hundred and fifty years of whitewater faculty\nWill continue today the lectures have the theme inspire engage and transform\nAnd today the topic will be learning communities more than textbooks and it will be presented by ... times and associate professor of special education so that's going on at three o'clock today a fair haven in whitewater are also starting today and we were talking a to a gym last week if my memory serves me correctly\nI Believe is as neighbors program will be celebrating it sixty six year and it's helping more low income families and their children than ever before they're taking applications starting today volunteers\nWill be in the office taking phone calls between that and for a Monday through friday from now through December fourth of the office number is nine two zero six seven for for for nine nine that's nine two zero six seven for forty four Ninety nine\nYear six hundred and fifty nine families in over Eighteen hundred children were help\nOr through either the adoptive family program or the toy and food give away for Christmas neighbors wow you'd like to adopt a family\nOr you can do that as well again the same number to call is nine two zero six seven for for not for for nine nine the toy distribution program will take place on Thursday December thirteenth that'll be a Jefferson County fair part\nSo or if you'd like to make a monetary donation you can do that as well to a PO box one Seventy seven and Jefferson by three five or nine but a truly a terrific program that we started sixty six years ago and a\nContinues to grow strong here in Jefferson County absolutely yeah that is pretty Eighteen hundred kids huh yeah yeah it's it's amazing when we were talking to a gym um\nI guess the number or as far as the families and kids being served has been relatively the same as it has gone up a little bit over the last several years but it smelled somewhat steady sure so but that is a terrific program that they put together and of course will be a drop off location again this year\nLike we have in previous years for Christmas neighbors and uh we'll hear\nSome somebody around the station on the twelfth of December will take everything out to other locations would be a both the premier inn badger bank FCC you city county credit union and Jefferson some a credit union they mills\nA grim went forward Watertown American family insurance and Jefferson or Deerfield lake males market and of course you're W. F. A. W. radio so we're very happy to be a part of that and of course if you'd like to\nDrop off toys I'm generally used clothing you know mittens scarves hats are always good to it and also to they can use wrapping paper believe it or not because they have to wrap up because they don't want the toys wrapped\nWhen you drop 'em off that's a big thing don't wrap the toys because they they need to see what it is shared all they can sign up to the right person and a age group and I think ... the the tough age group is the uh\nTwelve Thirteen fourteen ... it's got to be like pre teen ... yeah that's a that's a tough age group so uh but if you like you're more information just contact Christmas neighbors\nUp in Jefferson getting things underway today starting at nine o'clock this morning All right Jake and I'll be back we'll have more for you here on the W. F. W. morning news coming up in just a couple of minutes partly cloudy skies high of fifty two today in southern Wisconsin\nNow we're at forty two WFAN W news time has six forty three\n... there's a huge land auction coming up that you're not going to want to miss joined your friends from the seventies group for a large land auction of hickory hill farms in Jefferson County [noise] the three hundred and eighty five plus eight years will be sold in five ... selling free and clear for twenty nine feet this land auction will be held a neighbor's really pizza out over thirty first one PM [noise]\nMore and more information ... group and see a fool description and listings ... group dot com that's S T E S E S groups dot com [noise]\nMe Jim Weiss who experience to severe accident and was in need of help\nA lot of people around me and I said I've been hurt color ambulance\nThat's where doctors the bronco and the staff at orthopedic associates afford healthcare stepped in we're facing a challenging problem in this case Jim had a total hip done several years back and he ended up bringing the stump heartless femur bone the options are to either replace the federal component or stabilize it was\nJim had a total hip done several years back and then he ended up breaking the stump ordinance femur bone the options are tied to replace the owner or stabilize searchable hardware that was a successful surgery allowing gym to return home once again actually did rather well the feeling\nThat we get to see patients come back after surgery is very rewarding\nHave nothing but good things to say about ... show or am I going to want to drive thirty miles or see a doctor when I can get the same treatment right here in Fort Atkinson\nVisit board healthcare dot com forward slash joined ...\nIn Denver scented gunmen\nRoberts ours is expected to make his first court appearance this afternoon he's facing twenty nine federal criminal counts some that could carry the death penalty after Saturday shooting massacre at the tree of life Senegal getting killed eleven people and injured six now there's\nSadness in shock standing in for this community ABC zany robot is in Pittsburgh with more on the big powers\nNow in federal custody facing charges that victims ranging in age from fifty for ten Ninety seven eighty six year old Sylvan Simon and his wife eighty four year old Bernice killed in the same place they wed six decades earlier and December Nineteen fifty six stories\nThey hate appears to be the motive behind the attack and now looking into his background and social media posts\nCording to law enforcement officials Robert Bowers had no criminal history it appears he purchased his weapons legally he had no family no real friends a man no one ever seem to notice CDC\nGot men on the shelf ...\n\nNovember is a big bump for ... family dental Marjorie janitors but these upcoming events on Saturday November ... looked for the ... holiday parade as they had a treat to toothbrushes and then on friday November thirtieth ... showing their appreciation to veterans by providing a day a free dental care to\nBench to veterans please call nine to zero five six three twenty nine twenty eight to schedule on the plane but prior to November thirty at ... family dental on Madison Avenue ... [noise]\nMany things can improve the worth of your home but at the end of the day the basic rule of real estate hold location location location the real estate group truly a has the top neighborhood features that will boost the value of your home things like the walk ability of\nYour neighborhood your neighborhoods amenities community pool a park and the number one way and neighborhood can up your home's value good schools\nYou know you are and what we did it by we energy before the Eighteen we energy cookie buildings here did when we energy dot com to find a location near you only energy energy you can depend on the LA\nRams remain the NFL's only on being team after twenty nine twenty seven when or where the Packers at the coliseum\nYesterday I'm Bill Scott what sports Greg's are aligned booted up thirty four yard field goal just over two minutes left to put the rams in front and time Montgomery than fumbled the ensuing kickoff return after being instructed not to bring the ball out of the end zone Packard didn't get a chance at another comeback bowling the three three and one\nThe ... um no two minute we actually talked about it as a famous clearly part of the situations and most other boy well right now you know what that's what those games come down to this order decisions and ... and that decision situation she'll tell us try to try to make a point\nMike McCarthy's often struggled as well managing just ten points in the first half Aaron Rodgers through just one touchdown pass in the last he was asked about close laws against the NFL's best team gets to galvanize the Packers\nMe urgency us to figure so maybe that does that but there's no ah moments in game from a loss in my opinion you know we can play with anybody but we knew that before this game I was there some revelation ago okay now yeah we can probably play with the rams no we can play with anybody son just pointed to the parents really play well Packers\nRemain when lives on the road they had to New England next week the patriots will cap off this week where they Monday Night road game at buffalo Wisconsin out of this week's top twenty five pools falling to thirty of in the coach's poll and thirty seven in the writers poll badgers\nFalling thirty one Seventeen at Northwestern on Saturday there five and three overall three and two in the Big Ten ... shows the Toronto Raptors advisor form tonight a\nMatch up of the NBA two remaining on beaten teams and Wisconsin women's hockey team that got Minnesota for one yesterday to gain a split in there to gain weekends series has the bond arena the badgers now nine and\nRadio network a lot can happen in six seconds rodeo rider traumatic basketball\nAnd the world record holder console them six seconds just how long it takes for an Eighteen wheeler traveling at a safe speed to come to a complete stop\nBoard certified lactation consultant on that\nShow you the wonder how long term health benefits of breastfeeding from a child and from the mother board healthcare and provide support for miners and their families ... through our nurses ...\nVideos online resources and\nLeaves visiting board healthcare dot com forward slash\nOver here for Halloween [noise]\n\nLittle girl will be getting some users of its up a new option bikes after a San Francisco trial run to ride share company agreed to by jumped bikes and on demand electric bike company where they are available customers will be able to rent bikes through the super at\nThe dock let's bikes can be left and locked almost anywhere and that's raised concerned that they could clutter up the city skate the company's still needs\nLocal approval nine forty WFAN W nine ... W W warn Afghans\nAnd online at nine forty W. W. dot com [noise]\n[noise]\nFrom ABC News\nI'm Michelle friends in shock still rippling through Pittsburgh after the attack on the tree of life synagogue that left eleven people down\nEveryone's well this dream\nOf God I Believe that does something like this could ever possibly happen rabbi Jeffrey\nMyers was leading the service when gunfire broke out Saturday tales ABC News he tried to get people to take\nThe people who were towards the front of the sanctuary the number that were there I'd quickly tried to evacuate them up towards the back of the century\nABC News chief national correspondent Mac gotten on scene and says he accused attacker faces a hearing this afternoon on ...\nHours in stable condition having been shot a multiple times\nBut are authorities say he is in good enough conditions to actually face hearing today it's unclear whether or not that will be at the hospital for at the federal courthouse in Pittsburgh he faces twenty nine federal charges including for murder and for homicide in\nMiami another hearing this one for the man accused of mailing suspected pipe bombs to prominent democratic lawmakers\nOutside James Lawrence king federal judge says building here in Miami we'll wait the appearance of Caesar say are in court today as a Michelin parents will likely be very brief and process oriented\nBut there are two main questions one whether he will waivers extradition to New York as a U.S attorneys in the southern district of New York that are expected to handle his case\nAnd to whether he will request to bail and if you will get it\n... human remains now being recovered off the waters of Indonesia after the crash of a lion air passenger jet is\nParticular aircraft was less than two months old and not only was it so he knew but it's a new model of ... seven thirty seven to ... it's a model that got improvements but nothing substantial ... like a totally new airplane\nThat they'd be the aviation consultant Steve can hear you're listening to ABC News\nAnd I'm Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he was diagnosed with cancer stage four\nAnd here's the thing he had switched earlier for medical insurance to medical care where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work our medical bills\nExceeded a hundred and sixty thousand dollars met his share members shared all our bells\nAnd it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you through the hardest times of your life I just don't know how I could have done it without him at a sure\nIt's so worth looking into there is a reason this is growing so fast so if you want to find out more here has a number for you\nEight seven seven twenty six Bible that's eight seven seven to six B. I. B. L. E.\nPresident Trump has offered his congratulations to the new president elect to Brazil [noise]\nThis was the last decade\nCandidates on the left wing blame corruption scandal an economic crisis and the far right populist sound racist authoritarian rhetoric and nearly died I stand on the\nThe main issues corruption and crime and they found shy about was the man for the job\nOf our ABC News reddish in\nTrouble for Mercedes after federal officials say they were slow to get out the recall information\nMercedes Benz is taking too long and notify more than a million customers about vehicle recalls and that's why the national Highway Traffic Safety Administration says it's opening an investigation into the German automaker under law the company has sixty days to notify\nCustomers of recalls and says Mercedes took too long a Mercedes spokesman told the Associated Press a customer safety is the company's highest priority\nAnd said it will work closely with the government on the audit Ryan Clarke ABC News\nCaravan of thousands of migrants and Mexico is expected to resume its slow march toward the U.S border today it's still hundreds of miles away further south hundreds of migrants trying to cross the border from Guatemala into Mexico have clashed with troops there at least one migrant has been killed\nThis is ABC News\nConfused by all the talk about a good night's sleep\nThere's a lot of new mattress company but they're all missing something\nThey're missing expertise introducing tomorrow the new mattress and sleep system from ... tomorrow was grateful even delivered right to your door rather tomorrow mattress for three hundred sixty five nights risk free at ... dot com used promote awake Borbor whenever twenty five\nDollars off tomorrow sleep dot com [noise]\nI'm Michelle France and ABC News\nIs some counties news NPR nine forty do you ever you know you\nKnow you know you morning news\nIt's forty two it's seven oh five are forecast today partly cloudy high of fifty to maybe a chance of some rain moving into the area by tomorrow we'll get more Ron Paul promptly when he joined us later on this hour here on dying forty W. F. A. W.\nStands for it's a tough way to end the ball game for the Green Bay Packers in Los Angeles yesterday will have reaction\nTime now for W. F. A. W. news brought to you by Ford healthcare for help your family help and community out and buy Johnson bank in Fort Atkinson infer Michael quiz here is Jake Gerard ...\nMorning Gary uh Janesville Kabul was arrested on tentative drug charges after police executed a search warrant Friday after residents Janesville police executed a search warrant at four thirty one Madison street officials say the target of the search warrant was forty five year old ... often AKA Miami\nOfficers observed often and his girlfriend thirty nine year old and Lisa M R tell leaving the residents in a vehicle and conducted a traffic stop to take the two into custody according to police\nOfficers search the house and found drug paraphernalia\nThe MR tell leaving the residents in a vehicle and conducted a traffic stop to take the two into custody according to police officers search the house and found drug paraphernalia over a thousand dollars in cash and several electronic devices loft was arrested on tentative charges of possession within tend to deliver cocaine maintain into drug trafficking house\nPossession of drug paraphernalia and possession of a controlled substance Martelly was arrested on tentative on a tentative charge of possession within tend to deliver cocaine more news after the\n\nNovember is a big bump for ... family dental mark your janitors but these upcoming events on Saturday November ... look for the ... the Fort Atkinson\nLighted holiday parade as they had out treats and toothbrushes then on friday November thirtieth ET family devil is showing their appreciation to veterans by providing a day a free dental care to vet veterans please call nine to zero five six three twenty nine twenty eight the scheduling appointments prior to November thirtieth\nAt ... family dental on Madison Avenue poured Atkinson\n... are you having trouble with me getting more shoulder pain\nDoctors who brought a lot more than ... associates and the center for joint replacement only afford healthcare we really work with\nPatients to determine whether the treatments going to be for them to decide whether the replacement or if they're going to hold off on it [noise] or Center for ... brings a complete team of orthopedic surgeon collectively seven decades of surgical experience in special\nTogether working to create the best possible outcome for our program coordinator is with us from preemptive education and through your ... [noise] every step of the way to get you home\nArabic associates or over on patient satisfaction rapid recovery and return home room it was one of the high schools they\nWeren't healthcare more therapeutic associates and lived there for joint replacement serving Fort Atkinson and surrounding communities visit for the health care dot com\nOr health care [noise] for him\nAs officials have identified the melted men who died Thursday morning in a crash and the town of harmony Seventy eight year old ... element excuse me was taken to a local hospital where he died a short time later\n... results of the autopsy confirmed that Hillman died from injuries sustained and the traffic crash crash remains under investigation\nMadison police say a Twenty one year old man has died after he was shot in the downtown parking ramp over the weekend police say the man was shot in the state street campus ramp early Sunday Morning authorities say Steven Villegas says Madison was pronounced dead after being taken to a hospital with a gunshot wound to the torso\nNo one has been arrested and Madison police chief Michael is asking for the public's help finding the suspect\nFive and I might add ... W. F. A. W. dot com [noise]\nIt's not a matter of if but a matter of when every athlete experiences have meet Dr shelter um worth appealing associates and sports medicine only add more to health care we take care of patients from the weekend warrior to the elite athletes\nAre all sorts of different joined that Lincoln had problems and pains we come to a shared decision as to what is their best whether that be\nSurgical or non surgical nurse Marti medicine program involves many different team members for\nNursing highly trained physical therapists to Moscow is called a radiologist we were going to take good care of each individual one procedure that are you ... for easy of surgery the newer type of technique which is called the ... I don't mean to you as as long as there's there's a lot for\nSomething to the main thing that lead back to their sport reliably and a little more comfortable\nFor health care orthopedic associate sports medicine observing ward Atkinson and surrounding community visit for the health care dot com\nForward you know here [noise]\n\nPeople there's a huge land auction coming up that you're not going to want to miss joined your friends from the seventies group for a large land auction of hickory hill farms in Jefferson County [noise] the three hundred and eighty five plus acres will be sold in ... selling free and clear for twenty nine the this land auction will be held and neighbors grilling pizza on October thirty first one PM\nMore and more information ... group and see a fool description and listening to ... group dot com that's S T e M A s E S groups dot com [noise]\nIt was all three now than the sharply lower on Friday after disappointing earnings\nUse all three now on the sharply lower on Friday after this morning earnings kept\nA brutal and followed a week on Wall street the Dow Jones industrial average finish this session nearly three hundred points lower a twenty four six eighty eight the standard and Poor's five hundred took a bigger comparative hit losing forty seven points the NASDAQ composites relative loss in just over two percent was even heavier\nSam's Club is going high tech announcing a new shopping experience at a store in Dallas Sam's Club now let's customers buy goods from the company's ... inside the store\nThe Dallas location also will serve as a test lab for the latest shopping technologies that Sam's Club\nA trial that begins today in Denver could have a far reaching effect on the medical marijuana industry\nA couple of claims that cannabis business near the southern Colorado home is driving down property values because of the stench and attorney for the business do argues that tax valuation show the property value is actually increasing Jim Ryan ABC News\nW. F. A. W. news time coming up on seven twenty two this morning are for gas with Paul traveling from the weather I weather center is brought to you by Jim carpets they're located on some main street in downtown port Atkinson well\nWe kind of a kind of a bitter day yesterday with the wind and rain and so on and so forth kind of put a damper on trick or treating here in ... uh Paul looks like today's going to be a pretty nice fall day though\nAfter Lance looking out pretty nice off here with a break subsided some cloud cover out\nOf the day to day yet or otherwise a high temperature about fifty two as wins out the wife developed at five the path that I partly cloudy forty one\nStill looking at pretty seasonal tap sadly not follow in mid fifties through the clouds of Berlin that are scattered showers mainly in the afternoon to borrow that with the southwest has a Fifteen [laughter] showers are possible and a two day event that will have down to forty\nThat looking at break out of cloud cover Wednesday night about fifty seven for that Halloween forecast temperatures fall off of that through the end of the way\nAround fifty a partial on Thursday and if he likes that it ... hours here later that we care to friday I Would hide in the upper forties friday I mean that that's probably\nAll right sounds like we're going to have a nice day today so enjoy it while you're candles leaves are really starting to fall right now to Paul\nYeah those wins of after they certainly are that progress\nAnd they certainly did a ball thanks a lot will talk about our morning\nAbout ... probably from the weather I weather center here on nine forty W ethics\n\nNovember is a big ... family dental mark your candidate for these upcoming events on Saturday\nNovember ... look for the ... the Fort Atkinson\nLine at Halloween parades as they hand out treats and toothbrushes then on friday November thirtieth ... family dental is showing their appreciation to veterans by providing a damned free dental care to Benjamin veterans please call nine to zero five\nSix three twenty nine twenty in scheduling appointments prior to November thirty in the family dental on Madison Avenue board Atkinson\nRight down in southern Wisconsin might wins out of the northwest are currently at forty two this morning here at nine forty W. F. A. W. W. W. new time is seven twenty four and of course with Michael er or being a away from us here for a couple of weeks or so we've had to do some rescheduling of some of our morning magazines that I Know one that is\nA very important that we were going to have last week um regards referendum coming up in the jumpers in school district in we're very happy to have mark Robinson and Mike filling it with us this morning or good morning gentlemen thanks for joining us this morning\nThe morning the morning thank you for the opportunity\nAbsolutely of course next Tuesday is election day and this of course has become I guess unfortunately routine for the school districts and and mark I guess I'll lead off with you or how did you have pretty good luck in in getting this referendum put together the question put together and you feel comfortable with the going to the ballot next week\nYou know I really do I think there's been a lot of communication is going on whether it's a a a public forum and things on social media Facebook we the only other information on a website Miller as old as I really feel like we've got the information out and we let our ... a good informed decision\nAnd I know you've had some pretty good success over the last couple of years with referendum and in either one of you can kind of explain what do you ask what are you actually you're looking for as far as the question is concerned when what what are you looking to accomplish\nWell this is a a\nHundred and fifty thousand dollars a parade or a referendum where increases so is that one fifth of the first year\nIt's double that stuck in your triple the third and quadrupled before and we arrived at that number to that grand total of three but one million we arrive at the number through Robert W research a job or a school district and forecasts that we wouldn't be a short break with one million dollars for years from now\nAnd so we knew that was the way I should or we sat down the team as a school board and uh All right let's say it doesn't pass a one two three one million dollars for the call\nHave to look like and we looked at that and that's really the main reason I brought my fellow with me because clearly a of a number of those cuts would have to come from a lot of courses\nAt all levels middle school and high school or to kill early and ah and like being with her teacher this would be a program that would certainly have to be looked at as a cop\nMight do you a tear to comment on on what mark sent\nA market is absolutely correct a school is earlier that\nDid not pass referendum many cuts are made in that classroom increases are elected programs were caught the biggest positives to Jefferson high school and then the increase in ... in our tech and career classes\nAre more students wanting to learn the skills they can use in construction field manufacturing and engineering and then Jefferson has made a commitment\nTo put in a family that will also teach high tech skilled in three D. praying and grading and seen the machine so those things are for the students\nTo increase the or their abilities their skills and we see on a highway twenty six court and to the east and to hell in ... to the west Johnson creek\nAnd Cambridge a menu manufacturing areas in need of a skilled labor and um they even helping a punishment program has been developing so\nTo have that take a step backwards would be a pretty uh hurtful to the students and their opportunity to a career\nAnd mark we should mention too and I think you may have already commented on it but this is pretty much just an operational referendum in other words is trying to keep what you already have and maintaining that for the next several years\nThat's correct is that the al ... or ... or any of the Saudi structures this is literally to remain exactly where we're at over the course of the next several years to maintain the programs and keep the stuff that we currently have\nA very good and that'll be coming up on a Tuesday of next week on the ballot when people go to the polls anything else you want to add to mark her mind\nAll right very good and that'll be coming up on a Tuesday of next week on the ballot when people go to the polls anything else you want to add a marker bike before we let you go this morning\nWe're really really call it is very\nWell thank you very much for joining us this morning I Know you've explained it very very well so hopefully people have a good understanding when they head out to the polls next week mark role of a sudden my feeling thanks again for joining us this morning here on W. F. A. W.\nThank you very much thank you\nAll right and of course at I'd be coming up on the election day next week next Tuesday the ... be opening up at seven o'clock in the morning we'll have more or something that when we get closer to it the next week\nOur forecast today we're looking at partly cloudy skies high of eighty two in southern Wisconsin\nMay be a chance to some scattered range hours later in the day tomorrow and the temperatures still remaining a pretty much the average for this time of year at fifty six right now we're at forty two this morning nobody would have said that what you knew ... seven when he died Wednesday night it's split\nGreat a seasonal card Halloween right around the corner there\nThat's right also with the birthday yesterday from old ... we have a Lexus Wagner happy birthday like so then she sends us a picture of sea life park in Hawaii and that looks like it's probably I'm guessing as that adult one that looked like a dolphin the yeah so I had some kind of a dolphin\nJay Leno work here and a play about I Wonder if this will be for Sunday I Wish I was in Hawaii right now huh that's another oh come on now yeah it's not so but I Love and fall and I do like fall I although I could have done away with the windy and crappy weather we had yesterday are I have a birthday went from yesterday June Hardwick\nCongratulations Jew that's right All right one card in the mail today so I won't put you through the effort of having to draw but it is a J. J. probes to beaver dam has a bird at\nAge ... and this is a picture of a saint Mary among colonel church in ... Michigan was built in Nineteen sixty two\nIt it'd be it's a big tourist attraction it's a unique near oriental type of a construction\nI was going to say it looks a very unique idea totally the whole building is arched ... down the center like\nIt must have a very very high peak in the ceiling in the chapel there but anyway so and we had congratulations to Jay Jay probes to beaver dam are subway birthday winter for today All right\nA couple of other uh birthdays to talk about on the twenty ninth day of October uh including a singer Melba Moore a she was a very popular back in the sixties and seventies\nAlso actor Richard Dreyfuss is Seventy one years old today a lot of movies for Richard Dreyfuss absolutely mhm yep I've come to Josh comes to mind for me when that first comes to mind but he's had another a lot of other great movies as well\nSee close encounters the third kind I think\nCould be I don't know I have to look at I always the different my movie information to Mike [laughter]\nMaybe he can communicate with us somewhere\nOr actress Kate Jackson is Seventy years old she of course was one of the original Charlie's Angels on television I also had another sitcom as well\nAfter that I after Dan Kass dilemma is a sixty one years old today he's done so must stand up comedy he's also had some uh appearances on TV playing characters and so on and so forth but probably best known as one of the voices\nOn the Simpson of that and there's a lot of people that do voices yams yeah there are some that do multiple voices there are some that just do single boy says oh let's see here actress ah\nAh an older he uses fifty nine years old today she of course was on General Hospital the daytime soap and another few things in the evening as well or actresses Julie Fisher is a fifty one years old today a came to prominence when she was on the Ellen DeGeneres sitcom\nThat came out before Ellen had her I talk show or she was also on the sitcom till death as well and she's also Carrie Fisher's sister as well into a truly Fisher is a fifty one years old today actress well known a wider is a forty seven years old today she's been a number of different movies as well\nMost she was in a stranger things and that's like serious probably the most recent\nGemstones that's right ah actress Tracy Ross is a forty six years old today she's on the television program Blackfish he's also of course the daughter of Diana Ross\nAnd or acquiesce a actress I should say Gabrielle Union forty six years old today she's a very accomplished actress in her own right with a number of a great to movies and TV program\nChris I should say Gabrielle Union forty six years old today she's a very accomplished actress in her own right with a number of a great uh movies and TV programs\nAnd she's also married did wane wait there you know ... ... so you are those are the birthdays that we have for this twenty ninth day of October but congratulations going out to a Jude hard wake up for a job or the winter from yesterday and Jay Jay probes to beaver dam\nSubway birthday winter for today absolutely enjoy those subs have saluted you\nBet if your birthday is coming up let us know about it is your name address a birthday on a postcard ... for for decades and five thirty five thirty eight getting low on cards folks give us your direct mailing address and get it to us at least a couple of weeks in advance so we have it in time for the drawing I'll be back with sports coming up next on W. F. A. W. [noise]\nNo it's not a matter of if but a matter of when every athlete experiences have meet Dr shelter um worth of beating associates and sports medicine only add more to health care we take care of patients from the weekend more to the elite athletes\nAre all sorts of different joint handling it problems and pay and we come to a shared decision as to what is their best treatment whether that be\nSurgical or non surgical nurse Marti medicine program involved in many different team members from\nNursing down entirely dream physical therapist to Moscow skeletal radiologists we were to take care of each individual one procedure that I realized breezy of surgery the newer type of technique which is called the ... to me that you as as long as there's there's not much\nDoubt remain in that leads to another sport reliably and a little more comfortable in\nFort healthcare orthopedic associate sports medicine observing for napkins and then surrounding communities visit for the health care dot com forward you know here [noise]\n\nPeople there's a huge land auction coming up that you're not going to want to miss joined ... group for a large lead auction of hickory hill farms in Jefferson County the three hundred and eighty five plus acres will be sold in five ... selling free and clear for twenty nine feet\nThis land auction will be held and neighbors grilling pizza on October thirty first one PM more and more information ... grew and see a fool description and listings ... group dot com that S T e M A s E S group dot com [noise]\nIs nine forty oh you want to use for [noise]\nTime I ... for a quarter of bubbled on a kickoff return was a big blow to the Green Bay Packers hosted backing off the beaten Los Angeles rams Montgomery is mistake of the rams to hold on for twenty nine twenty seven when Packers coach Mike mccarthy on the\nPhone bill and there is a ... I'm Still two minutes we actually talked about it as a team of slowly part of the situations that both sides of the ball handle right now you know what that's what those guys come down to the shorter decisions and ties and that decision situation and I'm sure we'll try to try to make a play ramps\nArraigned the NFL's only on beaten team as they improved wait no ramps to attend point lead before rags airline drilled it thirty four yard field goal was to all five left\nAaron Rodgers through for two hundred eighty six yards and one touched down the Packers fell two three three and one they'll traveled to New England next Sunday night Mitchell Trybulski through for two touchdowns with the bears defense was outstanding and a twenty four ten victory over the jets\nThe New Orleans saints are six one after Alvin ... twice and Sheldon rankings delivered to therefore sex and thirty twenty when the Minnesota Vikings biking\nReceiver Adam feeling had another record setting performance with one hundred three yards and a score but his red zone fumbled on the second quarter is set up the go ahead touchdown Russell\nWilson through three touchdown passes\nAnd the second quarter to put the Seahawks head and a twenty eight fourteen victory over the lions\nThe Boston Red Sox are the world series champions for the fourth time since two thousand four after Steve Pearce and David Price led them to a five one victory in game five at Los Angeles last night fears Homer twice took the series MBP honors by going deep three times and\nCollecting seven runs driven in over the final Lebanon invest\nFilling my life and uh you know this is what you are you going to wishing that you could be a part of something like this but the that special group of guys out there to celebrate with them that was it was awesome\nPrice scattered three hits over seven plus innings and black the Dodgers after David Freese let off the bottom of the first with the home run the Dodgers have lost the last\nTwo World Series having wonderful classic since Nineteen eighty eight\nMilwaukee Brewers outfielder Christian yellow which was the Hank Aaron award winner of the national league well Boston's Red Sox ... Martinez took only honoring the American league yell at you have three twenty six with thirty six home runs and one hundred ten runs in leading the national league in batting average and slugging percentage\nIn the NHL the authors pulled out of two when when at Chicago on comic David fifty third a goal fifty three seconds into overtime can tell but stopped thirty three shots\nKevin me scored his third goal of the season with less than ten minutes to go to break a one off by and let the whitewater men's soccer team too uh too and went over August data whitewater return to action Wednesday night for the final regular season match when they host plant fill at seven o'clock\nThe W. I. A. stay cross country meat was held Saturday in Wisconsin Rapids area results including boys a division to jeopardize eagles finished sixth as a team individually will is banning of Deerfield Cambridge was twenty second and\nDivision two girls team results Jefferson was seventh lake bills finished the eleventh and division three Dodson was third Marshall came in six individually for decades since gentle love joy finished thirty eight individual\nOne and white water is Nicole ... was a one hundred twenty first and division two and Johnson creek junior Hannah constable was temp\nIn division three and joined the ghetto playing one of the forest sponsor NASCAR season ending title race by winning it Martinsville Speedway\nBumping leader Martin Drew acts junior as they cross the finish line Denny Hamlin thirty second followed by ... Bush and Brad Keselowski and that sports here on nine forty W. F. A. W. nine forty W. F. A. W. dot com\nIt'll be partly cloudy today high of fifty two right\nNow we're at forty two W. F. A. W. news time is seven forty nine\nGet the latest from limbo on the titles hungry for this is Wisconsin radio networks for ... ville Scott joined me every Monday through friday at eight twenty in the morning and five twenty in the evenings to nine forty W. F. A. W. for your connection to the Packers and the titles on a report\nDoctor Jennifer ... primary care provider\nI really love my job that gives me an opportunity to spend time with patients really get to know them I see them on their good days on their bad days and I have the opportunity to help them through that\nI like her family and every one from\nVery much enjoyed the community or for that comes on and I enjoy community Madison\nSo it was a good fit for me to come here for health care [noise]\nMy personal philosophy in regards to medical practice and taking care of patients pretty sure that we're listening to them as a primary care physician I get to take the role of\nCoordinating care for patients when it comes back and tell me that what we did for them has how they're feeling better in the back part of our dogs we get to really help people and know that what we're doing makes a difference [noise]\nFind out more about Dr Jennifer winter\nFort healthcare dot com\nFor [noise]\nHi everyone I'm right here and I had in\nMind that are the guys are talking about ... you know that here twenty thousand Americans of cancer are searching for their like fading narrow now how we can help it's really really all you do then go to get them life dot org and requests for free you can fly the phone\nLine ... do you have a job where you born Africans and online at nine forty dollars you know use our job [noise]\n[noise]\n[noise]\nI'm Michelle Brandon first hearing that debt for this afternoon for the man\nAccused of killing a lot of people in a shooting rampage at Pittsburgh synagogue Saturday be the chief national correspondent committed\nThey're going to law enforcement officials Robert powers had no criminal history it appears he purchased his weapons legally he had no family no real friends a man no one ever seem to notice hours\nFaces twenty nine criminal charges ABC's Pete combs has more from rabbi Jeffrey Myers who was leading the survey\nRabbi Myers has less than ten minutes after several services began Saturday here and the dozen or so congregants attending the service heard what they thought was a metal coke rock falling and the reception hall\nWithin the next Fifteen seconds a\nSound repeated and it was the parents to me that time just instinct I guess that that was not the sound of a piece of metal folding that it was a rapid fire\nSeven people were killed right there in the pews Meyer says he doesn't know why he survived perhaps he says it was to fulfill God's purpose becomes ABC News Pittsburgh\nA hearing is also sent this afternoon in Miami first days are stay at the man accused of spending several suspected pipe\nBomb or enforcement officials now believe ... van covered in political posters stickers may have been the makeshift workshop where he constructed the devices in the end it was a soul fingerprint on the device mail to congresswoman Maxine Waters that led investigators to the suspect maybe\nThe Victor ... rescue officials in Indonesia now say they don't expect to find any survivors after the crash of a lion air jet carrying one hundred and eighty nine people on board\nThe seven thirty seven Mac said had just been delivered to the low cost Indonesian airline in August the president of lying air saying that the jets had what he described only has a technical issue on its last flight but it was a problem that was fixed\nABC's David curly you're listening to ABC News\nDo you owe more than ten thousand dollars in back taxes the IRS a special programs in place that could eliminate or reduce your tax that by thousands of dollars for the call to a TA you can stop the wage garnishment levees in tax liens now\nThe IRS is currently accepting reduced settlements and other favorable programs you may qualify for a substantial savings to get the help you need if you owe the IRS ten thousand dollars or more coal ADA to see if you qualify eight hundred eight zero five ten fifty five that's eight hundred eight zero five ten fifty five eight hundred eight zero five ten fifty five each\nTime to join the millions of people using zoom video conferencing\nDuring a news conference room puddle room or executive office into a new we've flown was HD video crystal clear audio and wireless sharing it'll even work with your existing hardware store your meetings with a single touch or using new voice command feature films started meeting huddle happy\nVisiting zoom dot and us is that of your resume room trial today that zoom dot US zoomed video conferencing\nWith a migrant caravan still making a slow march through Mexico and hundreds of miles away from the U.S border ABC's Jim Ryan says border patrol agents are about to get more support\nThe Pentagon already has begun a deployment of eight hundred military personnel tobacco border patrol agents already stretched to their limits now comes toward that some armed militia groups plan to head to the region to confront undocumented immigrants people in one town in Arizona have posted signs telling the militias they aren't welcome\nABC's Jim Ryan Germany's Chancellor Angela Merkel says the term will be her last Angela Merkel has held the post since two thousand five her current term runs out in three years a shooting at a supermarket\nWe'll be her last Angela Merkel has held the post since two thousand five her current term runs out in three years a shooting at a supermarket in Kentucky is now being called a hate crime here's ABC's Ryan\nBarone percent town police chief Sam Roger spoke with ... grits at First Baptist church over the weekend it's the same church kroger's shooting suspect Gregory Bush allegedly tried to enter before shooting to African Americans at the nearby grocery store metro councilman David Kramer\nImportant that we set up and say that\nThe Gregory Bush's of the world don't speak for us\nWe don't believe that in any way shape or form anything makes is appropriate or acceptable\nCase is expected to go to a grand jury sometime this week right borough ABC News ...\nBrazil new president elect getting a congratulations call from President Trump he won the election yesterday this is ...\nCan you remember the last time you had a great night sleep\nHow you felt the next morning\nMore energized more alive\nField the difference a deeper sleep daily with the new tomorrow mattress designed by the world's leading sleep experts at ...\nAnd delivered right to your door thrive tomorrow mattress for three hundred sixty five minutes risk free at tomorrow's sleep dot com used promote awake for for one hundred twenty five dollars off tomorrow sleep dot com\nI'm Michelle France and ... [noise]\nThis is Joe and counties news until nine forty do you ever do you\nDo you have a W morning news\nIt's forty two at eight oh five are forecast today partly cloudy high fifty two will get more for the weather I whether it's that are coming up in just a few minutes in sports tough way to lose the Packers play so well in California yesterday but come up short and Boston when the world series details coming up\nW W news this morning ... by ... or they're located in downtown\nFort Atkinson infer Michael clash here's\nJake Gerard good morning ... good morning Gary\nUh Janesville couple was arrested on tentative drug charges after police executed a search warrant friday at their residents\nJanesville police executed a search warrant at four thirty one Madison street according to officials the target of the search warrant was forty five year old Jen Mariano often AKA Miami\nOfficers observe Lofton and his girlfriend thirty nine year old Anna Lisa M R tell leaving the residents in a vehicle and conducted a traffic stop to take the two into custody according to the release\nOfficers search the house and found drug paraphernalia over a thousand dollars in cash and several electronic devices Lofton was arrested on a tentative charges of possession within tend to deliver cocaine maintaining a drug trafficking house or vehicle possession of drug paraphernalia and possession of a controlled substance\nMartelly was arrested on a tentative charge of possession within tend to deliver cocaine more news after the\nOfficial said my done a fed the identified the Milton men who died Thursday morning in a crash in the town of harmony\nSeventy eight year old ... el ... was taken to a local hospital where he died a short time later preliminary results of the autopsy confirm that home and died from injuries sustained in the traffic crash the crash remains under investigation Madison\nPolice say at Twenty one year old man has died after he was shot in the downtown parking ramp over the weekend police say the man was shot in the state street campus ramp early Sunday Morning authorities say Steven ... of Madison was pronounced dead after being taken to a hospital with a gunshot wound to the torso\nNo one has been arrested Madison police chief Michael is asking for the public's help finding the suspect\nPlease do not believe the shooting as random as Madison fits homicide of the year\nThe shooting happened soon after the annual Halloween celebration freak fest wrapped up\nThe dodge county sheriff's office is investigating an officer involved shooting that wanted to demand in beaver dam beaver dam police were called to a domestic incident friday night sheriff Dale Schmidt says the officers quote reacted to a situation involving a firearm\nAnd that preliminary information shows that law enforcement fired shots authorities say thirty five year old beaver dam man was shot in the lower extremities he was taken into custody and transferred to U. W. hospital for treatment of non life threatening injuries one officer suffered minor injuries trying to take cover the incident is being investigated\nMilwaukee is sending love and support the Pittsburgh and is Jewish community a public gathering will be held tonight to more than those killed at the tree of life synagogue it'll be held at seven PM at congressional congregation Beth Israel near to meeting Glendale\nMeanwhile the Milwaukee Jewish Federation says security has been stepped up since Saturday is attacking Pittsburgh even though there's no reason to believe the local community is at risk\nCarrying the California Polytechnic State University football team crashed on take off from relief from Toledo, Ohio killing twenty two of the forty people that are ...\nAh Nineteen sixty four these made off with the star of India and other gems from the American museum of natural history in New York the star and most of the other gems were recovered three men were convicted of stealing those items oh let's see here in Nineteen Seventy nine on the fiftieth anniversary of the great stock market crash\nAny nuclear protesters tried but failed to shut down the New York stock exchange on this day ... did you hear music\nDude here's one for you in Nineteen eighty three pink Floyd dark side of the moon became the longest running album on the billboard music charts with a total of four hundred and Ninety One week\nWow that record has since been broken but that was there a long time and then\nNineteen Ninety eight Senator John Glen at aged Seventy seven roared back into space\nThe shuttle discovery re tracing the trail he at least for America's astronaut thirty six years earlier isn't that amazing that's a wonderful story\nI I you know I'm the type of guy I think if I was an astronaut and made it to space and be like you know what I'm gonna hang it up\n[laughter] you know John Glenn was a that was that that way at all yeah a ... he was he was a great hero World War two as well wow and in two thousand for Osama bin Laden and videotaped statement directly admitted for the first time that he ordered the September eleventh attacks\nAnd told America the best way to avoid another Manhattan was to stop threatening Muslim security so that was on this day in two thousand four\nAnyway that as their day in history here on nine forty WFAN W nine forty W. W. dot com\nBust a very interesting things happening as state definitely yeah that's for sure All right Jake will have more forests coming up with a few minutes here on W. F. A. W. we're looking at partly cloudy skies pretty much a average high temperature for today a fifty two maybe a chance of some scattered rain showers are developing leave tomorrow and into tomorrow night\nRight now we're at forty two here at nine forty W. F. A. W. news time a Twenty one that means it's time for the ... report with Bill\nFrom Wisconsin radio networks idle time right now with the latest from land here feel\nThe Green Bay Packers play good enough to win for most of\nThe game but the late fumbled by time Montgomery on a kick off to the way of final opportunity for Aaron Rodgers to try to drive is seen in the scoring position for another late come back when the rams pulled out the victory twenty nine twenty seven at the coliseum at the rams were kicking off up to two oh five love to play and the directions to time Montgomery were very clear\nTo plan narratives was ... um you know two minutes we actually talked about it as a famously early part of the situations ... ball handle right now you know what that's what those have come down to the decisions and ... and that decision situation and I'm sure we'll try to try to make it hits\nMontgomery stays in the end zone Rogers gets a chance for the comeback and most believed the Packers would have gotten it done more reaction after this here's bomber and landowners on true\nWe purchased land about three years ago and there was a whole farms that on there with trees were going to clear last week and farm so we thought we knew where the ... so he didn't call to get a located in the work on our property led to the damage of a light crucified fortunately no one was hurt but it could have been much worse never assume\nThe location or depth of underground line's always relate one one or does it before you dig dot com before you start wearing a message from the pipeline operators brags safety campaign\n... they found the badgers high school sports and so much more on Wisconsin radio network listening daily deals got brings you having the coaches interviews recruiting up to a\nLocker room news highlights from the game we got it off here on Wisconsin radio network we don't just focus on the veterans' day to need to learn more about the\nNFL and so much more which is what we do we are and don't forget to check out in Wisconsin radio network dot com for even more info fewer say your support with guns in radio network\nLevel of frustration after Sunday's Los was high a few weeks ago Mason Crosby stood up and took his medicine chapter missing for field goals and an extra points yesterday time Montgomery nowhere to be found in several teammates weren't looking to defend them either like white out on the Adams\nObviously I mean he's not trying to follow them all but you got to be smart to choices I um I Know he'll learn from it but the same time that doesn't change we're having\nSome encouraging performances like that a rookie jai your Alexander it'll have to be even better with a trip to New England this Sunday I'm Bill Scott more from titled sound tomorrow on the Wisconsin radio network [noise]\nLet's talk about America not ... or tweet or the issues that gets ... how\nIncredible our country laughter right down the line to winding confined [noise]\nWhether you come home to rally steady stream streamlined\nThe small town every line deserved to win in a coon\nGreen deriving community\nAnd we all share and the responsibility to ... reports from one of her head to another\nOne block than\nMe I keep America us all\nThe nonprofit ... millions of people just think you see I'm lettering improve recycling I'm to unify our community\nBecause every mindful accent entertain about ...\nHow to you can join keeping their can get a call at ... dot org together we can do to you to fall fangs\nKnew all now non users are looking up before the opening\nBell investors try to shake off last week's motion sickness stocks ended sharply lower on Friday after disappointing earnings kept a volatile week\nThe Dow Jones industrial average finish the session nearly three hundred points lower the S. and P. five hundred took a bigger competitive hit losing forty seven points that as the composites relative loss of just over a two percent was even heavier\nThe U.S government is investigating Mercedes Benz claiming the automaker has been slow to mail a recall notice is a nearly one at a half million vehicles\nNTSB says the automaker exceeded time limits for mailing out those letters Microsoft says it will continue to provide its technology to the U.S military despite concerns from some employees that advances in artificial intelligence could empower weapons to act on their own\nMicrosoft says the U.S should have a strong military with the best technology Jim Ryan ABC new\n... are you having trouble with me getting more shoulder pain meat doctors have brought a lot more than ... associates and the center for joint replacement only afford healthcare\nWe really work with patients to determine what the treatments going to be for them to decide whether the replacement or if they can still hold off on it [noise] or Center for ... replacement brings a complete team of orthopedic surgeons collectively seven decades of surgical experience\nOr if they can hold off on it\nOr Center for ... brings a complete team of orthopedic surgeon collectively seven decades of surgical experience in special together working to create the best possible outcome for our program coordinator is with us from preemptive education and three or ... percent of the way to get you home\nArabic associates or overall picture action rapid recovery and return home room it was one of those they\nWeren't healthcare more the ... Center for joint replacement serving for napkins and surrounding communities visit board healthcare dot com\n\n... how about you as a W dot com\nWe all know to watch out for email fishing scams but what are the top brand spoof by scammers and what are the most popular days they send out their bogus emails the answers will surprise you Kim commandos your Monday consumer tech update get the best night sleep ever guaranteed Casper dot com Carlo coach Kim\n... secure published their annual fishing report and revealed the top five goofed brand scammers use to steal your money on the list Microsoft Pay pal Netflix bank of America and Wells Fargo and cameras are now marketers sending fake emails on specific days to increase chances of success\nMicrosoft fishing emails peak on Tuesdays and Thursdays Netflix phishing attacks happened during the weekend and banking fishing attacks peak Saturdays and Sundays very clever bank customer support lines are typically closed on the weekends making it harder for the target to verify the authenticity of a bank phishing email\nI'm Kim commando everyone\nKnows sleep is important especially for your health\nThe mattress you sleep on effects whether you'll have a good night's rest or not and that's why I Want to tell you about my new Casper Sleep mattress I sleep cruel and comfortable every night thanks to the unique combination of farms that provide the right pressure relief and a line that\nAnd I know that once you try Caspar you're in love yours as much as I Love mind switching to Casper it's a no brainer it's a high quality mattress at an affordable price Casper ships right to your door for free in a small how do they do that size box\nAnd if you don't love it they'll pick it up and refunds you everything sleeping on a mattress is the best way to try it for cash for it to the test of your own home for one or two nights which free go to Casper dot com and use ... camp for fifty dollars towards the purchase of select mattresses\nThat's Casper dot com promote Kim get fifty dollars towards the purchase of select mattresses terms and conditions pie that's Casper dot com ... Kim [noise]\nDoes that sound of a school they'll bring to mind home room lunchtime the day's end for the end of school entirely as in kids dropping out ...\nWe just don't have the personnel to ah to care take care of ... quite frankly Michael hasn't\nHasn't scheduled that far out so we don't really have anything lined up but we do have a couple of regular gas or the doctor decay but it'll be end tomorrow and I know he has a special guest a and a Jake is going to be working today with Dr Susan Johnson from whitewater becoming it\nThat's right yeah I'm gonna take a crack at morning\nMagazine she uh she's going to be talking about what's going on in politics around the world and of course here in the country with election day just over a week away so as Ross so we'll have a love a smattering of mourning magazines you were in there as we wait for Michael to recover and make us pay back to the radio station so anyway All right Jake will be coming up or just after nine o'clock this morning\nYou're on nine forty W. F. A. W. W. F. A. W. news time is eight forty\nDr Jennifer wing primary care provider or health care\nI really love my job I guess they need to spend time with patients really get to see them on their good days on their bad days and they have the opportunity to help them through that\nVery much enjoy the community at Fort Atkinson I enjoy community medicine\nSo for me to come here for health care [noise]\nMy personal philosophy in regards to medical practice and taking care of face to be sure that we're listening to them as a primary care physician I get to take the role of\nCoordinating care for what it comes back and tells me that what we did for them has how they're feeling better probably the hardest job we get really people and know that what we're doing makes a difference [noise]\nFind out more about Dr Jennifer winter\nAt Fort healthcare dot com\nSport [noise]\nThat was like what we're doing makes a difference [noise] find out more about Dr Jennifer winter\nAt Fort healthcare dot com\nSports\nHi I'm director David still with today's tip for kids from the American Academy of pediatrics children loved to play\nBut then you know players important for healthy brain development playhouse children learn language math social skills in lower stress\nThis is good for kids and their parents the next time your child wants to play with you say yes it's one of the best parts of being a parent for more information on child development this healthy children dot org or talk with your pediatrician\nDone back in the Pittsburgh synagogue shooting that left eleven dead and six others injured is set to appear before a federal magistrate this afternoon ABC daring to turkey would detain Robert\nBauer space is twenty nine federal charges twenty two of which could get him to death penalty he had no prior arrest record but his record on social media paints a chilling\nPortrait of hate Jews are the children of Satan he posted on ... popular among fringe groups who believe mainstream social media sites into their views the FBI said Bowers was not on their radar\nAnd the weapons he used in the attack appear to be legally purchased\nThe close knit Jewish community and scroll hill turning to one another last night thousands attending a vigil the honor victims ranging in age from fifty four Ninety seven\nTwo brothers among those gun down along with still than Simon now his wife Bernice killed in the same place they wet six decades earlier President Trump condemning the attacks calling the pure evil he's expected to travel to Pittsburgh later this week I'm Michelle ...\nWednesday night it looked cool one oh six point by white water quarterback let's go to show\nThis is Gary Douglas ... joined me Wednesday night at seven or eight forty one brew house whitewater I'll be joined by head coach Kevin ... an assistant coaches and players it's cool one oh six point five you W whitewater quarterback political to show this Wednesday night at seven and eight forty one brew house in white water\nAren't cool one oh six point five and I'm On a dime forty W. F. A. W. dot com [noise]\nRanger station I reported air hog okay my campfire and smoking to me\nSo you're drowned the fire started ground it again and felt that it was cold I mean it's just like you know you\nGet from Smokey Bear\nI'm going to let you go now\nAre many ways to start a fire but one sure way to put it out to learn how you can do your part Smokey Bear duck\nSponsored by the U.S Forest Service I jumped in your state forester\nYou are and more to buy we energy before the Eighteen we energy ... here we energy that come to find a location near you we energy energy you can depend on the Green Bay Packers had the best team in the NFL\nThe rams on the roads but wound up losing twenty nine twenty seven at the coliseum yesterday I'm do scholars sports Packers events came out strong playing one of their best games in the season but the ... and special teams didn't hold up their end of the bargain linebacker clay Matthews thought they had it when\nWe're thinking when you know four down to ... and the boys in a market down and getting it to win and lose in that fashion will return it over on special theme is a\nHard time Montgomery decided to return to kick off against coaches orders with two oh five loved to play he bumble ending the Packers and quarterback Aaron Rodgers potential comeback been\nVery disappointing a plate and lose the game but it's definitely a recorded opportunity for us to go down in the end when attackers\nMay windows on the road they pulled all three three and one overall and are at New England next week\nPlaying without Alex ... broke the badgers northwestern thirty one Seventeen wildcat scoring Seventeen points off Wisconsin turnovers and the nation's leading Roger Jonathan Taylor held to a seasonal forty six rushing yards and need a streak of seven straight one hundred yard games for Jonathan Taylor Wisconsin guard Michael beat\nHer when you know you put it all out there and everything went smoothly just at the end of the day the ... I guess it's a little easier to swallow but when you know there was just so much stuff I used a shooting yourself in the foot turnovers all that makes it that much worse because you know should want Boston\nRed Sox are the world series champs de de just five games to dismantle the Dodgers they clinched there for a championship in Fifteen Years with a five one victory in LA last night bucks host Geraldo advice or form tonight between a match up with the NBA two remaining on beaten teams\nThe badger women's hockey team the Minnesota for one Sunday at my arena earning on weekends when you've got you got the radio [noise]\nThe results are in for Wisconsin statewide testing students in the parental choice programs have the highest compare to scores across the state\nWhen compared to their public counterparts gyms in Wisconsin parental choice program have court higher on the Haiti for the third year in a row we spoke with many parents who were thrilled with the results and are really thankful for the opportunity to private schools across Wisconsin provided them\nGreat thanks Amy it sounds like congratulations are definitely in order to find out more on the program visit\nChoose your school W. I. dot org\nAnd I'm not saying I mean you sound like taking me to the doctor when I broke my foot leading me alone when I Want it to be alone and now as a grown up I'm thankful\nFor being able to take care of you like air mom for teen media therapies for understanding from time to simply want to be alone\nRules change without us noticing that is why AARP gives you the information to provide even better care for your loved one in eight or ... dot org slash caregiving brought to you by a A R P anyhow comes\nHere in southern Wisconsin the weather can change at any job [noise]\nThat's why nine forty W W keeps you up to date twenty four seven and winter here whether develops\nWe'll break into programming with the latest from the weather our weather's better and and the national weather service when the weather takes their turn you can earn through nine forty nine forty W. F. A. W. dot com\nAre the things that come upon\nAnd there's a wide scientifically I see something funny you say how\nFor my community for my family for each other\nApart level or\nSomething or something\n[noise] I'm more now on the Westwood One radio network in Cincinnati Ryan Patrick led to look into your choice thirty four thirty four tie with the remaining\nTo be too much time do as an adult\nIn March the singles down the field to set up a forty four yard game winning field goal as time expires another piece when another four touchdown\nFor Patrick my home this time it gets the Broncos also Wilson had a perfect castle rating in the Seahawks win over the lions in London the eagles stop the jaguars the Steelers handled the brown Carolina down Baltimore the bears handled the jets and Washington is breathing easier and even if he was a win\nOver the joint Marlene back on the coast ran over the raiders\nCivil war the bears handled the jets and Washington has really been easier in a unit fees was when I was a giant Marlene back on the coast ran over the raiders those owner Li says Cisco\nRamsey taxes to shake undefeated and then I kept the safety of age their loss for the Minnesota Vikings by this as\nBut his mother to pack of night vision had lamb says up to ten dollars off because we're all going longer nights\nVisibility luckily our head lamps up superior elimination which helps reduce the chance of an accident see better drive safe for the ten dollars off to pack up all night vision had like all the parts that for no\nNo [noise]\nJust reading a book stores for him to white [noise]\nTwenty four seven three sixty five Europe and Adam every day so you don't want something like Medicare part D to lay down\nAt Walgreens will take care of your Medicare part D prescriptions saving you time and money", "year": "2018", "show_name": "WFAW News", "city": "Fort Atkinson", "day": "29"}