{"month": "10", "state": "WI", "station": "WFAW", "content": "I'm John trout Westwood One news [noise]\n\n\nOh Dr Jennifer ... primary care provider or health care\nI really love my job I guess they need to spend time with patients really get to know them and I see them on their good days on their bad days and I had the opportunity to help them through that\nI like taking her family and everyone from\nVery much and joined the community for napkins and I and join community medicine\nSo it was a good for me to come here for health care [noise]\nMy personal philosophy in regards to medical practice and taking care of these have to be sure that we're listening to them as a primary care physician I guess you take the role of\nCoordinating care for patients when it comes back and tell me that what we did for them has how they're feeling better probably the best part of our job we get to really help people and know that what we're doing makes a difference [noise]\nFind out more about Dr Jennifer winter\nAt Fort healthcare dot com [noise]\n[noise] I'm boarding WMA not while you were born Africans\nAnd online at nine forty WMA doll you Don job [noise]\n\nWebsite that some suspicious items are found in the students' Walker Monday morning so students were told to leave the building classes were cancelled the district superintendent said the school was evacuated after court and unknown substance in a glass jar was founded side of students locker\nNo entry was being allowed to the high school until authorities cleared the building an update on the districts website says agencies have completed the search and after school activities will go on is scheduled\n\nMadison police officers have arrested at Twenty one year old woman for the fatal shooting of a man in a state street campus parking rap early Sunday Morning police say Twenty one year old Steven Villegas was taken to a hospital with a life threatening gunshot wound up you're being shot in the torso at around two AM on Sunday\nOfficials said he died at the hospital officers arrested Kenny R. I. S. cats and Monday morning as a suspect in the case of official said surveillance images and information from witnesses led to the identification of gas and officers say gets in was taken into custody without incident she is facing charges for first degree intentional homicide\n\nA construction worker rescued after getting trapped in the trenches recovering the Milwaukee fire department\nWas called Monday when the man became stuck up to his waist in clay he was taken to the hospital with a leg and back pain officials say the man was with a crew constructing a sister\nYear on Fox scored twenty points and the ... at a Nineteen for the gangs who had scored Miami Seventy seven to fifty five in the middle two quarters and one on the heat home floor for the second consecutive season\nAnd finally do Marta Rosen has thirty four points and nine assists as the San Antonio spurs what sort of thirty point out thirty one point outburst by Dallas where do you look at ... in one Thirteen went away overtime victory over the mavericks on Monday Night\nMarkets Eldridge at uh twenty points at San Antonio won its second overtime game the Rosen ... battles in the final minutes of regulation and into overtime in a game that included tend lead changes and twelve\nTies that's it for sports coming up next they'd be Wall Street now you're on nine forty W. F. A. W.\nHigh school football players here it's W I Am a high school football playoff action friday night on call one eight six point five as the lakeside Luther warriors host the hedging crimson tie\nCatch all the action starting with the Ford healthcare pregame show studying at six fifty lakeside losing playoff would fall is brought to you by speeches bidding Cambridge and lake bills by lake mills market your American family insurance agents ... office products in Fort Atkinson and the drugs joined Jefferson I'm\nCool one oh six point five and nine forty W. F. A. W. dot com\nFrom ABC News Wall Street now a flare up in trade fears saw equities reverse earlier against and then turn sharply lower before hearing losses ahead of yesterday's closing bell in all a nine hundred points swing for the Dow Jones industrial average\nWhen the dust settled the Dow ended with a two hundred and forty five point loss at twenty four four forty to the U.S and the five hundred gave up Seventeen point and the deaths that composite finish Monday one hundred and Seventeen points lower\nApple hopes to fill out your holiday shopping list today the company has an event in Brooklyn at is expected to introduce several new devices last month apple rolled out updated iPhones to apple watches today the focus is likely to be on I pads and max adults think apple will bump up the specs on its I've had pro and could refreshed the ...\nBook at back many computers Twitter may be ready to get rid of the like button that is what CEO Jack Dorsey told a Twitter event recently he thinks it could help improve debate on the platform generally an ABC News\nNine forty W. F. A. W. N. nine forty W. F. A. W. dot com [noise]\n... first strained relief hearing poaching [noise]\nI Am Nicole has not for the brown field theory on ... [noise]\nHe wants the a half to ... cheese her chance at part of the trade mitigation food purchases tribulation\nProgram the more than seven point six million dollar purchase ... four point one million pounds of prime teen delivery for food banks and other food assistance program between December and march\nQuaker Oats Willie releasing an oath average January and turn it in just four years ago the company partnered with the dairy management incorporated and the milk processor education program every mountain making oatmeal with mount and mount much faster than there are tiny quaint little Larry\nNo longer in partnership with the gallery check off\nNot making oatmeal with milk and to melt moustache on their own kind of a Quaker men Larry no longer in partnership with the Gary check off\nQuaker Oats has refrained from marketing their Pepperidge smell\nCooperative working together has exempted eleven requests for ... cents remember collapse and we'll move more than six hundred and forty thousand pounds of chattering Monterey Jack cheat two hundred and Seventy five thousand pounds of butter and one point one six million pounds of whole milk powder\nDelivery it's contracted for November through April to Asia North Africa and South America\nLast three now future resent the Chicago mercantile exchange started the week well we're following the negative tone last week's market\nNovember close Twenty one tenth lower and fourteen eighty seven December down fourteen and Fifteen Thirteen January eleven cents lower and Fifteen oh eight\nBarrels or down one and three quarters for Monday at a dollar twenty three and a quarter flunk then change that one fifty one and a half butter down three quarters in the Senate to twenty two and a Half Men than dry mouth can change shed any six and three quarters and driveway unchanged shed forty seven percent\nI'm Nicole has slapped with brand feel\nNow on exciting new\nMarketing strategy for for his\nStrategy is getting ready to strike fear in the hearts of every other company selling the guard\nFor energy so profound\nWill succeed can disagree on it [noise]\nWell it's not really that exciting board that bold\nBut here it is make better seed corn sell better seed corn\nYou see it whistles hybrids we don't do a lot of fancy marketing we let our hybrids speak for themselves and right now we have a complete line up of a leap corn hybrids that are second to none\nHybrids designed to meet the specific challenges facing corn growers in your area so that's our strategy plain and simple\nNow are you ready for the big finish [noise]\nHybrid\n\nBack with you here on nine forty W. F. A. W. John archer inject Gerard and\nJake are you ready for some spooky Halloween stories I Am so ready All right uh the town of Huntington New York has decided to change its name to Huntington\nMe in a good oh yeah I like\nThe news the news reports the change comes from a suggestion made by seven year old girl Angelica Cunningham was all smiles after hearing that Huntington agreed to the one day a name change for parents urged her to suggest to change a but she says she didn't think\nThat town officials would [laughter]\nThat's nice of them to just be like you know what that's a great idea where do that [laughter] I mean you when you're when you're town's name is Huntington you have a unique opportunity right exact can make that change like um do you know we're\nNew London is a uh I I don't exactly know where it is but I have a friend who's from New Hampshire a and for St Patrick's Day every year they change their name to new Dublin there you go and it's they they go crazy or they patched is I just I think stuff like that is fun yeah it is it it you kind of you got to have fun with it and yeah you know calling me coming up\nJust a small enough town that doesn't you know you're not you're not affecting anything you know we're not changing it for a day\nAnd you make a seven year old life right yeah like you think you could do it yes yeah like that I Love that she says she didn't think that it\nGives us why would it be right right [laughter] but I think\nIt helps that she was seven I think if a if a thirty year old guy went in there and said hey we should call at Huntington for the day they'd be like get outta here [laughter]\nAll right well coming out of a Orlando\nApparently or excuse me coming out of Utah or if you have too much candy and you and you feel like you need to offload at Shaw Utah apparently has the largest share of children between five and Fifteen Years old which is considered prime trick or treating age\nYeah I Would I Would agree with that so if you need a place to go give out candy Utah seems like a good the lowest ratio apparently is DC we're only one in a lemon residents are trick or treating age between five and Fifteen ... so stay away from D.C during Halloween a lot more adults they're apparently yeah but you know I feel like\nIf I Lived in D.C I'd probably want to put on a costume and and walk around and see if I can get some candy like everything seems so\nLike serious just enjoy enjoy some fun for a day yeah\nWell they did have a I Know they had a I don't know it was trick or treat really but they had like Halloween at the White House and the kids were coming up and get candy from a a President Trump and uh uh the first lady millennia\nYeah it's pretty cool yeah what a bunker one to\nOne of the two yeah yeah yeah yeah sorry um but yeah so they did that that was nice of them you know a little bit of festivities for the kids they're\nAbsolutely one more note if you're having too many fun science candy bars the place to be as California it has the most kids\nWhich is five million kids in the state of California on my between five and Fifteen so Utah has the highest proportion of like kids do adults right California five million is the most kid looking for some candy I unfortunately gave all minor way already\nYeah we got we got a Ziploc bag full of stuff still at home or you I'm reserving that for me I was going to say I'm a little upset you didn't bring some more now I think I could do it I guess I could bring some candy you're right I dropped the ball I Would appreciate\nThat Jake alright well coming up at the bottom of the hour we'll have another news update you're on nine forty WFAN W\nMm it's not a matter of a matter of when every athlete experiences may meet Dr shoulder I'm worth of beating associates and sports medicine only afford healthcare we take care of patients from the weekend warrior to the elite athletes\nFor all sorts of different enjoying than Lincoln problems and pay and we come to a shared decision as to what is the best treatment whether that be\nSurgical or non surgical nurse sports medicine program's involves many different team members from nursing down entirely train physical therapist to Moscow is called the radiologist we work together to take good care of\nEach individual one procedure that I realized freeze your surgery the newer type of technique which is called the ... side to me that he was a smaller version there's less of a stop paying and it could lead bachelors born reliably L A little more comfortable for healthcare orthopedic associate sports medicine serving ...\nFind out more about Dr Jennifer winter\nFord healthcare dot com [noise]\nFor [noise]\n\nFunerals the name of the victims of the synagogue attack in Pittsburgh President Trump in the first lady will be there this afternoon ABC News chief national correspondent match government is in Pittsburgh\nMayor council members many of them are asking the president to delay his trip at least until\nEverybody is buried here and the funerals are over but there are others who said that he is welcome still is the president's initial reaction to the shooting that seem to focus on putting armed guards in places of worship instead of focusing on sympathy\nFixing to upset so many people here in Pittsburgh funerals\nAre set for today the rest are scheduled through the end of the week the FBI is now reaching out to potential targets of the man suspected of sending out several mail bomb sources tell ABC News that suspect Caesar say I kept a long list and that ban\nOr the caravan of migrants still making it slow marched through Mexico the Pentagon now says over five thousand troops will be at the southern border by the end of next week Sherry Preston ABC News\nHigh school football players here is that what you want a a high school football playoff action friday night on call one eight six point five as the lakeside Lutheran warriors hosts the hedging crimson tie\nCatch all the action starting afford health care pre game show studying at six fifty lakeside listening playoff football is brought to you by ... by John bakery in Jefferson fleet country heating and cooling in Jefferson County ...\nOut of here and like bills and jam garbage in Fort Atkinson on cool one of six point five and nine forty W. F. A. W. dot com\n\nYou are and more to buy me energy is what a scene we energy throughout the book is here we energy dot com defined location near you we energy energy you can depend on the Milwaukee Bucks plane without\nSorry you said that a coup both knocked off the Toronto Raptors one twenty four to one oh nine and the battle of the NBA two remaining beaten teams ... sports her son illegal shoulder scored Nineteen points in ... rebounds is the bucks improved a seven to know but he hit Nineteen forty five ... distance guard milk and bread been\nPoor playing with a high level but ah you know for the rest of the season it doesn't mean much we got to keep our head down to plant hard to plan together and sort of stick to what got us to this box\nAt Boston on Thursday Packers return or time Montgomery says the decision to run Sundays kick off out of the end zone was not a selfish one he says he made a mistake by not taking me but thought he was too close to the goal line Montgomery of course mumbled the rams went on to win\nMontgomery said he disappointed that some of his teammates have decided to talk behind his back instead of face to face and he's frustrated that the issue is trickling down to his family to\nPeople are sending messages to my wife and people are making comments on posts about my son I'm getting phone calls you know people from the houses to stay because apparently people are making threats on third pissed off at the state of humanity right now\nPackers take on the patriots on Sunday night and Fox borough New England won in Buffalo last night twenty five to six people in Brownsville we not from head coach Phil Jackson or offensive coordinator Todd Haley both were fired on Monday defensive\nCoordinator Gregg Williams will take go run an interim basis Wisconsin plays a second to last home game of the year this Saturday against Rutgers badgers five and three after last weekend last two northwestern Ohio State coach urban Meyer said Monday he feels fine and will definitely be back on the Buckeye sidelines next season brewers outfielder Tyrone tailored to their forty man roster\nPitchers wait ... dollars an outfielder\nCurtis Granderson them like the free agency just got to go to the radio [noise]\nHi I'm Danielle from we energy and I'm excited to tell you that our pneumonia team for keeping this year we're celebrating the cookies and I knew the anniversary [noise] teaching ran past that will make your holidays tend to little leader in the army\n... get an extradition location near you learn more we energies dot com [noise]\nPeople you can track energy you can depend on his message was made for like a ... W E the energy group [noise]\nMany medicines used to treat colds and flu contained acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver so always read the label that don't take acetaminophen if you drink three or more alcoholic drinks every day\nAnd to learn more lives if that's the dot Gov slash OTC pain info on message from the U.S department of health and Human Services food and Drug Administration [noise]\nMm Mm nine forty W. F. A. W. N. nine forty W every W. dot com\n\nAnd maybe see for this we're here to fight Thompson was light\n\nMaybe see for this chance to fight\nThompson was lights out of the United center scoring fifty two points in breaking the NBA record for most reason a game with fourteen eclipse teammate stuffing curry who set the record in twenty sixteen\n\nNinety five point seven the game Golden State beach Chicago one forty nine one twenty four\nA tight contest in Buffalo before safety Devon McCord he took on to the house spoiling the bills retiring sermon Thomas's Jersey tired [laughter]\n\nOn WB the pants won twenty five six\nThe world series trophy is finally landed in Boston at the red Sox beat the Dodgers in LA on Sunday this says ADC sports apparel firings in Cleveland the browns parted ways with it and tells you you actually in an offensive coordinators Todd Hayley the donor Jimmy ... says the team isn't punting on the season this is\nNot throwing into the town a it's a rebooting if you will opportunity to give them a fresh start for these last day games\nJak she was the fourth Brown's coach to be fired since twenty twelve Gregg Williams has been named interim head coach near triple double for Lakers star LeBron James he finished with twenty eight points ten more than eight assists with Jimmy Butler had other ideas draining a dagger free late\n[laughter]\nOn WC CEO Minnesota dust solve LA one twenty four one twenty a milestone moment for blazers big men you shift ... who knocked down his first career free\nTwin lakes drivel eight seconds issue blaming swings after dark each time it takes another three from the way they bury it is the first career three pointer for use ... we've been waiting for that one for a while\nOn K. P. O. J. Portland beat Indiana one oh three Ninety three\nA battle of beyond beings in Milwaukee the bucks scorching the raptors from beyond the arch tongue a franchise record with Nineteen threes Milwaukee won one twenty four one oh nine to improve the seven into their best starts since the Nineteen Seventy one Seventy two season spurs me the math one Thirteen want to wait and oh gee\nLuggage we pass fail again once again one of ...\nMm it's not a matter of if but a matter of when every athlete experiences pain meet Dr shoulder more therapeutic associates and sports medicine only add more to health care we take care of patients from the weekend warrior to elite athletes\nFor all sorts of different enjoying that Lincoln had problems and pay and we come to a shared decision as to what is their best dream and whether that be\nSurgical or non surgical nurse Marti medicine program involves many different team members from nursing to them [noise] highly trained physical therapist to Moscow is called a\nRadiologist we work together to take good care of each individual one procedure that I realized breezy all surgery the newer type ... maybe which is called the all by telling me that you ...\nThere's a lot ... than going to get that at least that there was born rely on the L A little more comfortable in Port healthcare orthopedic associate and sports medicine deserving\nMore down to an end surrounding communities visit board healthcare dot com forward you know here\nChildren who grow up in poverty are part of a destructive Franco childhood poverty creates adults poverty creates childhood poverty\nAnd on and on and ... is a ... thank God worldwide millions of children live in an extreme poverty\nChild burned into national we find that unacceptable\nAnd we knew all we can [noise]\nTwenty five countries and he has vigorously fighting poverty and improving the lives of over ... million children and their families [noise]\nOur program support fairly talented get down and children's health and education\nAnd we help strengthen the economic security uh family childhood poverty creates a comedy creator childhood poverty but it turns into national we are committed to breaking distracted cycle\nContains childhood poverty must not become\nTomorrow and learn more\nChild find dot org\nWe've never from Kansas how are they ready to move I\nOr if they can hold off on it or Center for ... brings a complete team of orthopedic surgeons collectively seven decades of surgical experience in special together working to create the best possible outcome program coordinators what'd you remember of education and three or ...\nPercent of the way to get you on\nThe big associates or overall visual faction rapid recovery and return home room it was one of the items they\nWeren't healthcare more therapeutic is ocean center for joint replacement serving for napkins in and surrounding communities visit for the health care dot com\nAnd health care for helping\n\nPeople there's a huge my dogs are you coming up that you're not going to want to miss joined your ... for a large land auction of hickory farms in Jefferson County [noise] the three hundred and eighty five plus years will be sold in ... selling free and clear for twenty nine feet\nThis land auction will be held and neighbors grilling pizza out I go through the first one PM more and more information contractors seventies and see a fool description and listening to ... group dot com that's S. T. V. S. [noise] dot com [noise]\nThis is where your Green Bay Packers football all season long justice you how\nAre you going to have [noise] [noise]\nI'm forty dollars you have a newborn Africans\nAnd online at nine forty WMA use our job [noise]\n[noise]\nSherry pressed in the first funerals half of the deadly attack in the Pittsburgh synagogue\nBegin today three of the eleven victims will be laid to rest as the president plans to visit the city\nHas an interest in the first lady will make a brief visit to Pittsburgh today on the ground for just about three hours there are no official detail somewhere that Trump's will do and who they will meet with but the president said he would visit wounded police officers in the hospital\nThere was a small cloud of controversy hanging over the president's trip\nPittsburgh mayor William ... said he didn't want the president to be a distraction from the funerals that began today but Rahm I Jeffrey Maier is he was leading a service in the tree of life synagogue during the shooting said Monday that the president is welcome ... ABC News the White House and outside that synagogue\nEnemy or off came to Pittsburgh from Israel where he was a soldier\nNow he stands outside his neighborhood synagogue the tree of life with dozens of other people morning or does eleven congregants one of the reasons who came and it was for peace and quiet and so it's a little ironic we're up doesn't regret his decision but he does have a few questions what is the root cause of this\nI think there's a major problem with the mental health on this country and I think that's really what should be talked about here and it's not being paid combs ABC News Pittsburgh more than\nFive thousand troops are being ordered to the southern border by weeks and as I care about migrants continues walking through Mexico warnings or going out to a possible targets of male bombing suspect Caesar saying I K BCS Victor Oh can do in Miami says this comes after ... first quarter parents\nAccording to a law enforcement source the FBI has compiled a list that belongs to seize or say out of potential target a lengthy list that includes celebrities media figures and other politicians and the FBI has gone down that list and Ord every single person on north\nCarolina sixteen year old due in court today accused of shooting and killing a classmate named Charlotte area high school\nYou are listening to ABC News\nYou guys can hear from the hip typecast today's growth who would win at three mile bicycle racing eleven year old girl or last year's winner of the Tour de France\nIt all depends on the bicycle that depends on their vehicle both on a ten speed and the ... going to win every time but but the race around the trade sickle and the eleven year old when every time you see it's not the driver each the vehicle when it comes to generating revenue it's exactly the same\nIf you have a job or a small business you are writing a tricycle you can only go so fast\nIf you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy simple they choose to only right ten speech when it comes to helping people create their next revenue model both for joining recommend income store as a can't miss when it comes to putting people in a ten speed could your household or business using additional revenue model that doesn't solely depend on you\nIf so you need to check out in come store dot com best income store dot com\nThe president says he's not looking at changing the rules around who can be a citizen President Trump tells acts feels that with an executive order he may be able to end the practice of becoming a citizen by virtue of being born in the U. S. A. B. C. chief White House correspondent Jonathan Karl\nSupreme Court has never directly ruled on this question of whether or not the somebody born to undocumented immigrants where he is a citizen but that is certainly when the interpretation is in the fourteenth amendment the president for one thing is certain cannot change the constitution with an executive order ...\nSandy field says a week away from the mid term presidents getting ready for a busy few days of campaigning the\nPresident planning a nonstop campaign tour with just a week left to the midterms he'll shore up Republican support in Florida, Missouri in West Virginia then over the weekend making stops in Montana Georgia Ohio and Indiana by election day the president will have held more than fifty rallies since he was sworn into office and even more fundraising\nMusician furlough named unhappy with President using his song happy USA Today says he has sent a cease and desist letter after the song was used a campaign rally on Saturday\nAnd on a second time in as many months apple is set to roll out some new devices just in time for the holidays have already shown us that he iPhones and a couple of hours the company is expected to introduce new and improved I pads revamped Mac books and Mac many computers\nThis is ABC News\nDo you owe more than ten thousand dollars in back taxes the IRS a special programs in place I could eliminate or reduce your tax that by thousands of dollars for the call the ADA you can stop the wage garnishment celebrities in tax\nLiens now the IRS is currently accepting reduced settlements and other favorable programs you may qualify for a substantial savings to get the help you need if you owe the IRS ten thousand dollars or more coal ADA to see if you qualify eight hundred eight zero five ten fifty five that's eight hundred eight zero five ten fifty five eight hundred eight zero five ten fifty five\nI'm Sherry ... ABC News\nIs jars and counties news nine point do you ever you know you\nDo you have a W morning news [noise]\nYou here on nine forty WFAN W John archer filling in for Gary Douglas on the morning news today news time has seven oh five\nComing up later on this hour all have a look at sports but first we got to get some local news the news this hour has brought to you by Fort healthcare for health your ... family health and community health and in the newsroom\nJake good morning John last night the first congressional district debate was held at U. W. whitewater Iraq counties Kirk Denmark theater Republican Brian style and Democrat Randy Bryce fielded questions\nLast night the first congressional district debate was held at U. W. whitewater Iraq counties Kirk Denmark theater\nRepublican Brian style and Democrat Randy Bryce fielded questions from moderators Dr Susan Johnson from you W why water and Bob heck from the Wisconsin radio network regarding middle class wages and taxes Medicare immigration climate change and others\nBryce made specific verbal jabs towards south for his work in law while style targeted Bryce was working the rallies that took place in twenty eleven Clinton resident done Michael shared his views\nThe debate was very good the main focus that you could see I'm Brian versus brandy his Bryant's problem solver [noise] I don't think Randy brings anything to the table I don't think he can solve anything I don't think you can think about anything he's always about the lower class\nPrices former Democratic opponent Cathy Myers also shared her opinions on the debate\nI thought that our Randy did a very good job I thought that he looked prepared and he looked a\nA confident and I also feel as though you know ... ... is always a great thing this was you know democracy at its best when there is hey you know exchange of ideas and positions and argument in a good positive constructive way they both took some shots at each other but they also shook hands at the end of it\nTo debate lasted approximately one hour and sold out the theater the two candidates are racing for Paul Ryan seat in Congress who announced earlier this year that you would be retiring more news after this\n\nNovember is a big bond for ... family dental mark your janitors for these upcoming events on Saturday in November ... looked for the ... the Fort Atkinson\nLighted holiday parade as they had a treats and toothbrushes then on friday November thirtieth ... family dental is showing their appreciation to veterans by providing a day a free dental care to bench veterans please call nine to zero five\nSix three twenty nine twenty eight this scheduling appointments prior to November thirtieth and ... family dental on Madison Avenue ...\nStudents at a southern Wisconsin high school have been evacuated and the bomb squad some into the building these dry community school district posted a notice on its website that some suspicious items were found in a student's locker Monday morning so students were told to leave the building\nClasses were cancelled the district superintendents the school was evacuated after quote an unknown substance in a glass jar was found inside of students locker\nMadison police officers have arrested a Twenty one year old woman for the fatal shooting of a man and a state street campus parking ramp early Sunday Morning police say Twenty one year old Steven ... I guess was taken to a hospital with a life threatening gunshot wounds after being shot in the torso at around ... am Sunday\nCatch all the action starting up afford healthcare pre game show studying at six fifty lakeside Lutheran playoff but Follies brought to you by jak furniture in Watertown and by watching an ace hardware liquid Chevrolet viewing enjoy as dogs in lake meals on one of those six point five\nAnd nine forty seven usa W. dot com\nFor health care is baby friendly working with the world Health Organization and UNICEF or the health care is one of only a handful of hospitals in Wisconsin that has been designated and maybe friendly there's a focus\nFrom prenatal to earth after care nurses will provide information about bathing safety\nAnd health family members can help out around the house\nComponent to being baby friendly as breastfeeding there are several international board certified lactation consultant on that\nThey'll show you the wonderful long term health benefits of breastfeeding\nFrom child [noise] and for the mother board healthcare and provides them more than others and their families wanting for some through our nurses courtroom\nPamphlets videos online resources animal\nLeaves visited Fort healthcare dot com forward slash\nLord you know their counting\n\nOn NBC News Wall Street out of flare up in trade fears saw equities reverse earlier against and then turned sharply lower before pairing losses ahead of yesterday's closing bell it all a nine hundred point swing for the Dow Jones industrial average\nWhen the dust settled the Dow ended with a two hundred and forty five point loss at twenty four four forty two yes and the five hundred gave up Seventeen points and the deaths that composite finish Monday one hundred Seventeen points lower\nApple hopes to fill out your holiday shopping list today the company has an event in Brooklyn at is expected to interest\nUnder Seventeen points lower apple hopes to fill out your holiday shopping list today the company has an event in Brooklyn and is expected to introduce several new devices last month the apple ruled out updated iPhones and apple watches today the focus is likely to be on either pads and max\nAnalysts think apple will bump up to ... pro and could refreshed the book at back many computers\nTwitter may be ready to get rid of the like button and that's what\nYou'll Jack Dorsey told a Twitter event recently he thinks it could help improve debate on the platform generally an ABC News back here on nine forty W. F. E. W.\nNew Simon seven twenty and it's time to take a look at your southern Wisconsin weather forecast from the weather algae weather center\nAnd look at Africa pretty mild here for to ask I borrow before temperature records live back here by the end of the week friday but still a break from cloud filled and today with developing showers but a couple of thunder showers possible\nIf it gets that after they would have time frame after Iowa fifty seven today with all the forty wanted I always showers that evening\nBack the eyes of fifty six with partial clouds Wednesday for Halloween ... thirty six partly cloudy Wednesday night in a quiet and fairly consistent with our cafeteria Thursday to make this cloud of upper forties route fifty with partial friday\nBreak for the Saturday as I could see the rain showers coming here for thought they stay right or on the ballot probably\nHey thanks very Thanks Paul uh All right hey Jake so\nWhen I talk a lot about movies or when we're doing the show together so have you seen anything new lately anything interesting\nUm I saw the new Halloween movie last weekend ooh yeah and I'm a I\nKnow where you're talking about this one of the time I'm excited to see mid nineties right on the rise movie that'll be coming up um yeah other than that I haven't checked out anything super recently now so I haven't seen venom yet I Want to see venom\nVenom looks good I've got to see it eventually I haven't seen it yet yeah or just over the weekend like I said my uh I have the house to myself well me and my cat that my cat and talk to them [laughter] but er I went over to a red box and I uh I was trying to figure out what I wanted to do and I saw hotel arguments oh you do that\nOr I didn't see it but I saw some trailers for it and it looked pretty good it was a lot different than I than I thought yeah I remember the premise yeah I Do um hotel of like hit men\nBase yeah so it's like you know the I don't want to I don't want to spoil this for anybody who was a recent a movie coming out but\nBasically yes it's a it's a hotel which which doubles as sort of an infirmary for criminals right basically you you pay\nA what I Would assume is an exorbitant amount of money [laughter] to be able to come to this place whenever you're injured and it's set in the future so there's like lots of futuristic ways to\nTo fix people like they're like three D. printing a liver for a new guys liver at one point in the day and I'm like ... like this is it it's kind of that was the first thing was different is it was in the future I didn't know that I don't I don't remember like getting that vibe right\nAnd the other thing that was interesting about it um\nWithout I don't want to give too much away the ... the setting was really interesting it's in the future it's set in California\nAnd it surprised me at first and then as a kind of got into it I was like okay so they're using they're using the setting as being California so to kind of\nInform some stuff about the about the film share a that was very interesting that I didn't pick up on right away but I made it very interesting than it was um was a little more violence than I was just acting I maybe they're not thinking hard enough about the movie but\nYeah I had a feeling it would probably be fairly a fairly violent pretty intense\nYeah uh there's um again I don't want to spoil anything there's one scene in particular a with Jeff Goldblum [laughter] oh yeah I forgot to yes no and he comes in late okay and it is like I didn't even remember he was on the cover of the DVD box that I forgot all about him until his yeah\nUh there's this particular scene with him or like we were saying like comedic actors doing a little more ... I don't know if Jeff Goldblum super can need it but like he's somewhere in the middle yeah he's like he's like a funny guy that does action movie right right I don't know like yeah I Will go with that but uh he there's a scene within\nThat that was a little intense for me\nGotcha I enjoyed it I uh I think we should mention too you said you ah watch\nThe bucks games last night bull all let's talk about the ... and uh the books are obviously killing at right now\nThey are a first seminar do start since the Nineteen Seventy one at Nineteen Seventy two season this ties are franchise record for a search of a season and if we win against the Boston Celtics we will have officially had the best branch I start the Milwaukee Bucks history\nWow that's a it's definitely possible I Know I've just been um I haven't been watching the games are but I [laughter] I get updates sense of my phones here and every night it's like I look and it's like oh they want to get in a you\nKnow and it's you know the the crazy thing about it isn't in last couple of years the bucks would always play they would play at the level of their competition share so you could expect them to be competitive in a game against the raptors or like I went to the er the game against six there's a couple of nights ago you you could expect them to be competitive\nIn kind of hold their own again all their own erase levels of writing a play right but then the thing that would always happen and it's like we were five into and we're going to go play the Orlando Magic right land or magic or terrible [laughter]\nAnd you're just not just tied in New in the back of your mind that wow we're going to be awful this game okay oh I'm going to say we're gonna we're gonna be like oh it's the magic and the ... would beat us yeah and then we have to\nYou know show up the next day and be like are we really that good we just got right lost by Fifteen to the magic but that didn't have to we blew out the magic we blew out the Sixers we just blew out the Toronto Raptors that were league's best team last season\nAnd we did that without Younis yeah thankfully had some sense like I don't know if you saw the video but he was a little irate\nOr at the end of the game against the magic you took an elbow to face a lot and I didn't yeah yeah it's a I was actually I was at that game to uh you can get pretty cheap tickets seems yeah you know and I'm I'm a fan of it\nBut ah you had he took it over to the face he got knocked out like he even said I'll walk out he was on the ground it did not look good you got up he played like another two minutes and then he sat out and then\nCoach brood nose or send him to the locker rooms that how you got to go get right tested right they ran the tests or he was fine but he was upset that he couldn't go back out and play share even ended up playing a little bit in the fourth quarter\nWhen we were up by like twenty five which was just write him wanting to play right and then he woke up the next morning and said wow I think I might have a concussion so no I'm In the\nThey put them in the NBA extinction protocol which means that he couldn't play in yesterday\nYou woke up the next morning and said wow I think I might have a concussion so no I'm In the they put them in the NBA extinction protocol which means that he couldn't play in yesterday's game but we don't play until Thursday so he might be back out there but I'm just happy that he\nHe had the sense to to uh take care of his head out [laughter]\nYou know what we managed to win one game without you honest but I don't like\nOur chances that way right now I don't want to press that kind of injury absolutely so right now\nAh and I'd just to the last thing before we going to break here I think is hilarious that if the brewers was still playing in the world series right now nobody would have watched the bucks when yeah it'd be ... the whole state would be up against the brewers and I think that that's just\nYou know it's been a long time since the brewers I don't know if it's ever happened when the brewers and the and the bucks have been good at the same time\nYeah I don't certainly not in a time that I can remember how exactly\nWell All right\nConsulate and\nSo it's a country that's in NATO but yet it's you know it it's a a Islamic country it's on the border of the of the middle east and Europe\nAnd so it'll be interesting to see kind of how turkey continues to develop they are you know pretty a mortal enemies of Saudi Arabia so uh they're caught up in some of the dynamics and but you know it's it is nice to see a photo of ruins and haven't been ruined by somebody in modern times\nYeah absolutely [laughter] well anyway happy birthday again Ross nor the Fort Atkinson enjoy your six inch subway sub and uh we got some other birthdays if I'm not mistaken\nWe have we got some famous birthdays are today movie director Claude Lulu she's eighty one rock singer grace slick in Seventy nine\nRhythm and blues singer Otis Williams of the temptations is Seventy seven oh to swimming leaders some of the temptation stuff on a on cool when I was six five I Believe absolutely actress Joanna ...\nSeventy five broadcast journalists Andrea Mitchell Seventy two\nMusician Chris slate of Asia Seventy\nTwo [laughter] you know these guys are really not that old yet a relatively uh you know you've got to look at it from your own perspective but keep telling yourself ... [laughter] come on her ... she never changed [laughter]\nVery nice actor let Leon ... sixty nine actor Harry handling sixty seven country singer T grand brown sixty four\nActor Kevin ... sixty one there you go yeah on name Iraqi done yeah right\n[laughter] that's starting to get into some some of the some of our stuff actor Michael beaches fifty five a rock singer slash musician Gavin Ross veil of Bush fifty three\nA comedian Ben Bailey forty eight actor Billy brown forty eight country singer calf of the Osborne of she daisy is forty two I listen to country music or that name is not familiar to me but I'll have to look them up now now have the name of the band\nOr actor Gael Garcia Bernal forty\nA business executive in presidential advisor Ivanka Trump thirty seven there you go when since we mentioned around here today already yes we did actress Fiona debrief or door if it's thirty seven actor Sean ... is thirty seven ... actress Janelle ... parish Janelle parish\nIs thirty alright are famous birthdays for today and come back yeah hopes are are coming back we'll have a sports here on nine forty WFL W [noise]\n\n\n\nNovember is a big bond for ... family dental marketing janitors but these upcoming events on Saturday November ... look for the ... the Fort Atkinson\nLighted holiday parade as they had a treats and toothbrushes then on friday November thirtieth ET family data showing their appreciation to veteran by providing a day a free dental care to bench veterans please call nine to zero five\nSix three twenty nine twenty eight and a scheduled on that point but prior to November thirtieth at ... family dental on Madison Avenue ... [noise]\n[noise]\n[noise]\nAll right John archer back here with you for W. F. W. sports today news times seven forty to\nBegin to look at some sports around Wisconsin the buck stand defeated by getting the best of the Toronto Raptors one twenty four to one oh nine in a battle zone beatings adviser for a Monday Night or Sonny lease over scored Nineteen points and grab ten rebound as Milwaukee improved Seventy no drawn to fail the second one\nThe bucks play the Celtics Thursday in Boston\nBackers return or time Montgomery says the decision to run Sundays kick off out of the end zone wasn't a selfish one he says he made a mistake by not taking any but thought he was too close to the goal line\nMontgomery fumbled and the rams recovered to seal the game now the Packers are preparing for another tough road test this Sunday night against the patriots and Fox borough Green Bay is three three and one overall but oh and three away from limbo field New England beat buffalo Monday Night for its fifth straight when and leads the AFC East ethics and to\nWisconsin played at second place excuse me a second to last home game of the year this Saturday against Rutgers the batteries are five and three after last weekend's one Thirteen so jeeze excuse me thirty one Seventeen loss of northwestern you W will be on the road the next two weeks at Penn State and Purdue before finishing up at home with Minnesota\nMoving on\nDevon McCartney returned an interception eighty four yards for a touchdown and the New England patriots defense smothered the Buffalo Bills in ... in a twenty five to six when on Monday Night games wide scored on a one yard run and the patriots relied more on Stephen ... legs and Tom Brady is armed for their fifth straight when which improves their AFC East leading record the six and two\nBrady finished twenty nine I'm forty five for three hundred and twenty four yards but was held without a touchdown pass in the first time the season\nPass Cassie had four or five feud goal attempt including two from the twenty five yards including two from twenty five yards after new England's Dr stalled inside Buffalo's ten buffalo lost his third straight and dropped it to in six words were start since opening the twenty tenth season with eight losses\nAnd Hugh Jackson has been fired as coach at the Cleveland Browns ending a run a futility nearly unmatched in NFL history\nJackson who went three thirty six and one and two plus seasons was dismissed on Monday by general manager John ... with the backing of owners deemed Jimmy Haslam the browns also dismissed off into coordinator Todd Haley and name defensive coordinator Gregg Williams the interim coach elite was in his first season on Jackson staff after spending the previous six in Pittsburgh\nJackson's firing came day one day after the browns lost their twenty fifth straight road game twenty of them coming with Jackson in charge the browns have not made the playoffs since two thousand two amid a slew of coaching changes have lost three straight games after a promising start to the season\nAnd moving over to the NBA play Thompson broke teammates Stephan Perry's NBA record with fourteen three pointers and scored fifty two points in just twenty seven minutes to lead the Golden State warriors to a one forty nine one twenty four victory over the Chicago Bulls on Monday\nTowns and set the mark when he nailed three with just under five minutes remaining in the third quarter he was then mobbed by teammates as the players headed to the sideline for a time out with the warriors leading one Thirteen to sixty nine\nVery had Thirteen three pointers with a win win over New Orleans on November seventh twenty sixteen Thompson was fourteen of twenty four for a long range after hitting five thirty six through the first seven games and shot Eighteen of twenty nine overall he finished eight to ... excuse me he finished eight points shy of his career high\n\nIn other MBA news been Simmons at Twenty one points twelve rebounds and nine assists and the Philadelphia Seventy Sixers flashed a little of last year's playoff form in a one Thirteen Ninety to win over the Atlanta Hawks mark ... scored a season I was sixteen points for the Sixers\nGarry Harrison Ford twenty three points and came up with a big steel late to help the Denver Nuggets hold off the shorthanded New Orleans pelicans won sixteen one eleven after nearly squandering and Eighteen point lead John Mary chipped in twenty three and nickel the joke is shut twelve points in tennis is for fifth double double in six games\nThat Collins matched his career I was Seventeen points and see Jim a column also had Seventeen to lead the Portland TrailBlazers two one oh three Ninety three wind over the Indiana Pacers the blazers have won three straight in the series and eight of the last nine against the Pacers\nJimmy Butler had five of Minnesota's eighth three pointers and the fourth quarter to finish with thirty two points and help the timber wolves hang on to beat LeBron James and the Los Angeles Lakers won twenty four to one twenty\nArlene's any towns that twenty five points a season I sixteen rebounds and four blocks for the timber wolves who played some ... defense just in time to fend off late push from James before time NBA MVP had nine excuse me a ten of his twenty nine points in the fourth quarter after missing his first five shots of the night\n\nTim heart away had twenty ... excuse me tomorrow to a junior at twenty five points of NATO fist and the New York Knicks role to their second when the season being the Brooklyn that's one Fifteen to Ninety six\n... added sixteen points and then his cancer had Fifteen and Fifteen rebounds off the bench for the next were dropped five streets in spending Atlanta in their season opener\nWillie ... Stein squirts twenty to twenty six points and grab Thirteen rebounds buddy you got a twenty three points in the Sacramento Kings ran past the Miami Heat won twenty three to one Thirteen\nYear and Fox score twenty points and the manager bleak I added Nineteen for the gangs who I'd scored Miami Seventy seven to fifty five in the middle to borders and one on the heat home floor for the second consecutive season\nAnd finally the Marta rose and have thirty four points and nine assists and the San Antonio spurs withstood a thirty one point outburst by Dallas Ricky ... in a third one Thirteen one oh wait overtime victory over the mavericks on Monday Night\nMark Salter Jetta twenty points at San Antonio won at second overtime game the rose in the dumps which battles in the final minutes of regulation and into overtime and again that included ten lead changes and twelve ties\n\nThat set for sports and then the next ABC News headlines here on nine forty W. F. A. W.\nFor health care is baby friendly working with the world Health Organization and UNICEF or the health care is one of only a handful of hospitals in Wisconsin that has been designated as maybe friendly there's a focus on the continuum of care\nWhitewater quarterback club coaches show this Wednesday night at seven\nAnd eight forty one brew house in white water on cool and one of six point\nFive and I'm On a dime boarding W. F. A. W. dot com [noise]\nThe ... Center for healthcare is the best choice doctors and nurses before healthcare great expectations birthing center\nFort Memorial Hospital in Fort Atkinson are specially trained to care for free middle visit [noise] routine high risk pregnancies labor and delivery plus postpartum\nFor health care has been designated up baby friendly facility one of only a handful in the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience you can enjoy all the comforts of home\nStarting with a spacious private sweet experienced the hydro therapy before and after ...\nPlus for health care has restaurant quality service twenty four seven [noise]\nPlease visit ... healthcare dot com forward slash being for health care\n\n[noise] I'm warning WMA W Warner\nAnd online at nine forty dollars going on [noise]\n[noise]\n[noise]\nI'm Sherry pressed in with the president and first lady said to visit Pittsburgh\nThis afternoon the first funerals for the victims of the synagogue attacker starting this morning rabbi Jeffrey Myers will lead the funerals ABC News chief national correspondent met got ... in Pittsburgh says the rabbi was there when the gunfire began he heard\nEverything you heard the screens of his congregants as they were shot one of them was Bernice assignments she's eighty for her husband whose name is Sylvia and saw him and he was eighty six she said my husband is has been shot him in almost instantaneously afterwards her screens or silenced by gunfire he heard all of this happened more\nFrom ABC's Pete combs in Pittsburgh\nHow legal student grew of a member of the tree of life congregation Jewish shattered Saturday dues ... people were killed six wounded in this holy place the first night I couldn't stay at my house alone she's been standing here with the cold for almost six hours I came here\nTo love and love hundreds of foreigners who come here to leave flowers ... workers with the story of David on them erected in front of the police tape on the sidewalk and\nOne for each show that people killed here the tree of life be combs ABC News Pittsburgh the FBI\nNow sending out warnings to everyone named on a list founded a van and Melbourne suspect Cesar ... ABCs Victor Oh Kendall says this comes after another suspicious package was sent to CNN authorities\nDo say that it appears to be very similar to the other devices found even though say is in custody there is the possibility of more bombs still making their way through the mail system\nThe Pentagon is ready to send thousands of troops to the southern border by the end of the week NBC Tim Ryan\nCustoms and border protection has been notoriously overworked tend to under staffed and officials worried about the arrival of migrant caravans will overwhelm the system the troops eventually fifty two hundred ... will provide transportation surveillance and logistical support to the border patrol\nSearch crews and in in Asia back in the water looking for more of the wreckage after a passenger jet crashed you're listening to ABC News\nOil and gas investment about a high degree of risk inner city will only for qualify SEC accredited investors if you're an FCC defined it credited investor getting ready to do your taxes and wish you had more deductions you can take action now\nAnd start planning for twenty eight teams with one hundred percent IRS approved deduction invest\nWith encore energy if you're a high net worth FCC to find a credited investor who's interested in participating directly with a proven operator and are qualified to make an investment of at least two hundred and fifty thousand dollars in these called encore energy eight hundred eighty three eighty five eleven eight hundred eighty three eighty five eleven\nEach time time to join the millions of people that need happy with a new video conferencing zoomed gives you flawless video crystal clear audio an instant sharing across any mobile tablet or desktop device but the best thing about two inches worse the ditch the distraction\nJoined the movement and need to have eaten zoomed video conferencing Lizzie zoomed on us to set up your free account today that zoom dot US zoom video conferencing\nMan is now under arrest in Wisconsin accused of breaking into the home of a teenage girl missing for more than two weeks fair and counting authorities say I'm the same day the murder parents of Jamie costs were laid to rest of\nThirty two year old men broke into the costs family home and took items including Jamie's clothing authority spotted demand entering don't be a surveillance video round two AM officers order demand to come out and arrested him Kyle Jackie Anna's faces account a burglary and felony count a bail jumping the ban has been cleared of any involvement in the disappearance of Jamie clause and the murders of our\nParents triborough ABC News president is now taking a hard look\nAt changing rules around citizenship\nTrump says he's looking to use an executive order to end the right to US citizenship for children born here in America to non citizen parents the president spoke about this in an interview\nIt is order ... and the right to US citizenship for children born here in America can non citizen parents the president spoke about this in an interview with the U.S\nTo kill us it's ridiculous and it has to end\nThe fourteenth amendment states all persons born or naturalized in the United states are citizens of the United states president cannot change the constitution with an executive order and one of the Supreme Court has never directly ruled on this question of whether or not somebody born to undocumented immigrants would be a citizen\nIn the interpretation of the fourteenth amendment ... ABC News the White House changes at Walmart and time for the holidays the company says instead of waiting in checkout lines it'll station workers and some of the busiest parts of the stores\nAnd let people pay right there in the eye out this is ABC News\nDo you owe more than ten thousand dollars in back taxes the IRS a special programs in place that could eliminate or reduce your tax dead by thousands of dollars for the call to a TA you can stop the wage garnishment levees in tax liens now\nThe IRS is currently accepting reduced settlements and other favorable programs you may qualify for substantial savings so get the help you need if you owe the IRS ten thousand dollars or more coal eighty eight to see if you qualify eight hundred eight zero five ten fifty five that's eight hundred eight zero five ten fifty five eight hundred eight zero five ten fifty five\nI'm Sherry Preston ABC names [noise]\nThis is some counties news nine forty W. W.\nW. W. morning news [noise]\nW. F. A. W. morning news today news times during the ... coming up later on this hour I'll take a look at sports and will do today in history but first we got to get to the local news and then the newsroom once again it's Jake Gerard morning jak\nMorning John last night the rational district debate was held at U. W. whitewater at rock counties Kurt Denmark theater\nRepublican Brian style and Democrat Randy Bryce fielded questions for moderators Dr Susan Johnson from you W why water and Bob head from the Wisconsin radio network regarding middle class wages in taxes Medicare immigration climate change and others\nBridesmaids specific verbal jabs towards style for his work in corporate law while style targeted prices work in the rallies that took place in twenty eleven\nClinton resident done Michael shared his views\nThe debate was very good the main focus that you could see I'm Brian versus Randy is Bryant's problem solver [noise] I don't think Randy brings anything to the table I don't think he can solve anything I don't think you can think about anything he's always about the lower class\nPrices former Democratic opponent Cathy Myers also shared her opinions on the debate\nI thought that a Randy did a very good job I thought that he looked prepared and he looked a\nA confident and I also feel as though you know bait is always a great thing this was you know democracy at its best when there is a you know exchange of ideas and positions and argument in a good positive constructive way they both took some shots at each other but they also shut cans at the end of\nThe debate lasted approximately one hour and sold out the theater the two candidates are racing for Paul Ryan seat in Congress who announced earlier this year that he would be retiring more news after this\n\nCongregants family friends and strangers back to synagogue in suburban Milwaukee to commemorate the lives lost and the shooting attack in Pittsburgh on Saturday all of them one thousand seats were filled that congregation Beth Israel near to meet in Glendale Monday Night and hundreds more people line the walls in entrances for community gathering hosted by the Milwaukee Jewish foundation\nSome more stickers that red stronger than hate crime members held hands and lifted their arms and a show of solidarity against the hate them motivated a gunman to kill eleven people and injured six at the tree of life synagogue in Pittsburgh\nThe Wisconsin economic development corporation has awarded the Wisconsin women's business initiative corporation and eighty thousand dollar grant supported the growth accelerator program which will help ten entrepreneurial team started to grow their businesses the grants will enable W. W. B. I. C. to conduct to intensive ten weed growth accelerator classes with five teams in each\nOne this fall and one in spring of twenty Nineteen during the program teams will develop their business models by engaging and consumer testing integrating input from customers mentors and advisors and communicating their findings to potential investors\nAt the end of the program teams will present their pitches to qualify for a seed grant of twenty five hundred dollars to five thousand dollars\n[noise] students at a southern Wisconsin high school have been evacuated and the bomb squad some into the building that\nI have not my favorite things to say about Dr soprano so why am I going to want to drive thirty miles to see a doctor when I get the same treatment right here in Fort Atkinson\nVisit Fort healthcare dot com forward slash joined for health care for him\nBack with you here on nine forty WFL W John archer with Jack Gerard and decay even and it's time for today in history today is Tuesday October thirtieth three hundred and third day of twenty Eighteen means there are sixty two days later in the year\nThey highlight in history on October thirtieth Seventeen thirty five according to the new style calendar the second president the United states John Adams was born in ... Massachusetts a brain tree branches what a what a name I Know I don't know what it means that a new style calendar was there a calendar change earlier\nAnd that I can tell you but I'm we'll take their word for it that ...\nAll right in Nineteen twelve vice president James that Sherman running for a second term of office with President William Howard Taft died six days before election day he was replaced by Nicholas Murray butler but kept the Republican candidate ended up losing in an electoral college landslide Democrat Woodrow Wilson ...\nVery interesting in Nineteen forty five US government announced the end of shoe rationing effective at midnight that is\nRationing shoe rash that exactly what I think it is I I Would assume that it rationing shoot yeah well probably\nWhat it meant was that a leather a that time would have been a commodity that was needed for the army chair and uh again almost\nAll the products are all a natural um resources were were controlled because of the war so it's hard for us to imagine because we have access to so much\nA during the the war it was very difficult to get gasoline for example um you know to to find shoes because a lot of the industries it turned to making products for the war and so it was a very difficult in a very unusual situation that we haven't really lived through in our lives\nYeah moving out in Nineteen sixty one the Soviet Union tested a hydrogen bomb the sar bombarded with a force estimated at about fifty ... Soviet party Congress adamantly approved a resolution ordering the removal of us the stones body from Lennon soon\n[noise] you know which is interesting because Stalin was out as someone in a who was revered in the Soviet Union or he was obviously one of the uh dictators of World War two who was vicious in terms of how he treated his own people\nBut ah installing ... city became a renamed I think back to St Petersburg there but it gets ... and that was another indication that Stalin was out and ah the Soviet Union was moving on from there was a pretty difficult times\nSo it's kind of cool this last year at school I took a class on Russian Cinema mhm on so I got to watch a little bit of movies created during the Soviet Union which were very dark themes were very intense but ended a cool thing I noticed is just because I I was sort of heat in on Russian terms\nI don't know if it's still there but in the Milwaukee Airport general mental airport there was a a a painting or like a like a sculpture that was sent from St Petersburg but from selling grabbing called that so and then we sit artist from Milwaukee sent one over there as well\nOff I just thought that was 'cause I would've I Would have read that and I would say oh that's a city in Russia but it was at St Petersburg it's one of the big cities in Russia I never got renamed I Would have never known that\nYou know and I'm not sure whether it was stolen garage that the name of St Petersburg which changed or was Leningrad [noise] but uh they they kept changing names the city of Stalingrad was where uh the the Soviet Union stopped the Nazi invasions to end the battle of Stalingrad was one of the most uh\nA destructive and I'm a horrendous in terms of the loss of life for a\nVehicle in Russia and essentially leveled the cities here than\nIt did and uh some I've I've been reading a book on the battle of Stalingrad and or the approach of the ah the Soviet Union army at the time was one in which they didn't allow\nUh their own soldiers to in any way a retreat right they would shoot them and so it was a pretty pretty vicious circumstance\nYeah absolutely yeah I think you're right but I think it was Leningrad but All right we'll move on in Nineteen Seventy four Mohammed Ali knocked out George Foreman in the eighth round of a Fifteen roundabout in kings I as a year known as the rumble in the jungle to regain his world heavyweight title\nThere you go in and of course uh Mohammed Ali was coming back to that time from having been stripped of his title because he would not into the draft right and I go into the army and eventually the courts would find with him that that was a unconstitutional\nAnd he would be allowed to fight again and ah in would continue on with his record if nothing else he always had a a a turn of the phrase [laughter]\nAnd I think are just as important\nMany years later the George Foreman grill\nWhat are some on the market or just as notable I think\nYeah I think you know if you're talking about the important events in the history of boxing\nRight Laurence Mormon Gretel is George Foreman grill number two and I think you're right\nAll right in uh in Nineteen eighty five schoolteacher an astronaut\nChrista McAuliffe witnessed the launch of the space shuttle challenger the same ... that would carry her and six and a crew members to their deaths in January Nineteen eighty six when I was in school actually did a a a report on that and I read a Ronald Reagan's speech that he gave the nation after that and it's\nYou know just moving and and exactly what you'd imagine a a person who has to have to address the nation after that tragedy with sound\nThe way I it's probably it's it's listed as one of the top ten speeches from the twentieth century American speeches and the fact that came in at number seven and Reagan did such a a a beautiful job of capturing the different moods yeah of the time in that speech and these are certainly\nA role model for how the president has to be the console ruined chief\nIt that's one of those pieces of video footage that is just still so a haunting to watch\nWell and for a good different generations for my generation it was the assassination of John Candy you remember where you were as a young man or a child shirt or for others the it was\nThe is the spaceship blowing up and they get you know when they were elementary schoolchildren it really leaves a different kind of impact on the child than it does sometimes on adults right and that's one of those events where people say well I remember where I was in what was happening right when I found out or I watched it explode\nAnd another I mean for me the obvious one was nine eleven not there you go you know I was in like third grade I think and I ...\nI watched it explode and another I mean for me the obvious one was nine eleven there you go you know I was in like third grade I think and I remember it perfectly to zero day oh yeah yeah I was a first grade so yeah I remember\nGoing home to my grandma's house or in the middle of the day which was strange but I I don't have much recollection right now hearing my mom and dad talk about it right absolutely\nAnd finally we have a one year ago today former Trump campaign chairman Paul Manafort\nAnd a former Manafort business associate Rick Gates were indicted on felony charges including conspiracy against the United states as special counsel Robert Mueller's investigation into Russian interference in the twenty sixteen election revealed its first targets and of course that a is an ongoing story in those really knows what's going to come after this election\nAnd we'll see as the soap opera continues yeah yes it does All right that was today in history thank you very much they can Jake\nWill be coming back to the top of the hour with another news report here on nine forty W. F. A. W.\n[noise]\nFrom Wisconsin radio networks for his title down right\nNow with the latest from land here still\nTime Montgomery has been accused of this plane is coaches who killed them to not bring the kick off by the end zone near the end of the game on Sunday and online media reports said Montgomery did his own thing after he was seen throwing a tantrum on the sidelines after being pulled out of Sunday's game\nI was frustrated I'm not down to the players but frustrated I've never thought he won in the sideline number ... bunkers out coaches that's not what I Do however I got a little frustrated I wanted to make a play I wasn't I wasn't planning very much and I wasn't able to make a play and I was frustrated about that I don't fully understand what my role is right\nNow Montgomery didn't talk after the game but he had plenty to say yesterday he and his family received social media threats if you'd like to hear from his teammates that made anonymous comments about him but he's not going to seek them out he said\nHonestly if they wanted to be known and they would have said they would have made it clear I personally don't buy into that we talk about Ben brothers human beings and how did that and the other and that's not what happened I don't know maybe that's what they do in their family that's not what I Do a mind no one ever said anything to me so I'm thoroughly disappointed in the speculation\nI'll let more from titled town after this here's farmer and landowners John proven\nWe purchased slammed about three years ago and there was a whole farm set on there with trees were going to clear last week and farm so we thought we knew where the ... so he didn't call to get a located in the work on our property led to the damage of a light and provide fly fortunately no one was hurt but it could have been much were\nNever assumed the location or depth of underground line's always in the late one one for a visit before you dig dot com before you start wearing a message from the pipeline operators brags like the campaign looking for the latest updates\nFrom the capital to catch up on local stories for the details from last night game no need to shop around for the bad thing was going to new Wisconsin radio network is the one ... everything happening in the badger state\n[noise] a construction worker rescued after getting trapped in the trenches recovering the Milwaukee fire department was called Monday when the man became stuck up to his waist and clay he was taken to the hospital with back pain officials say the man with the with the crew constructing a sister and as part of the city screen stormwater management techniques\nAnd former vice president Joe Biden is encouraging Wisconsin nice to vote early after a rally in Madison this morning body will travel to Milwaukee for a similar event at the laborers local one Thirteen US Senator Tammy Baldwin and democratic candidate for governor Tony ... are also expected to attend with the news this is Jake Gerard\nThank you very much Jake level look under southern Wisconsin weather\nHere's a look at your southern Wisconsin forecast powered by whether ... dot com more cloud cover built into the area today with some showers moving in there in the afternoon with high the upper fifties south Wednesday at ten to Fifteen then\nShowers taper off tonight with low near forty one that will see more clouds that some sunny breaks on Wednesday with a higher fifty six with North West winds throughout the day on Wednesday night with partly cloudy skies off off the thirty six for a low ... probably a nine forty WFL you\nBack here on nine forty WFL W. it's time for a morning magazine preview we got the cave and inject Gerard here guys what\nAre we having this afternoon and well we're going to take a look at ah something special to this season the you might say that scary time of the year uh Morrow of course is Halloween and we're going to take a look at Halloween by the numbers and then we're also going to look at another\nScary time of the year uh tomorrow of course is Halloween and we're going to take a look at Halloween by the numbers and then we're also going to look at another scary event and that's the upcoming election one week\nSo hardy earlier scarier you know it's it's definitely trick or treat time and write about the election that seems to fit you know we'll see how it goes well we're going to take a look at Halloween and then we're going to talk about uh the election one week out and kind of where things stand in Wisconsin with our Senate race our governor's race the attorney general race\nThe uh first congressional district so are there some interesting races going on and Jake and we'll talk about those\nNow I have a quiz for you guys are ... and what's going to see you know you go yeah I figure you're young enough that you ought to be we still really into Halloween sure how ... how many people do you think will be ... in terms of the American population in terms of ... percent\nWill be involved in handy now can be a on Halloween whether that's last weekend or tomorrow\nOr I'm going to go ahead and say twenty percent oh I'm gonna say forty percent you\nAsked them into Seventy percent wow well we'll hire the yard ... [laughter] you know a little bit closer what percent do you think will be carving pumpkins at some point year oh ah well I'm going to go thirty five percent\nI'll say thirty percent are oh you're both a little bit under your clothes or forty five percent which also surprises me because you know I've carved a few pumpkins when my kids were young and I literally have no interest once you get past that ... yeah\nI uh I'm someone invites me to cover pumpkin like they're better be snacks there too because [laughter] just just covering the pumpkin if you have you ever eaten the pumpkin seeds oh yeah there were that's what my dad would habits do\nThat's why I don't I don't like pumpkin seeds that's why I don't like arguing with my dad would be like you got to eat this and I I don't watch it and make you eat it raw nah yeah you would just like oh well I don't know how that happens you want to cook the fears the last question that is\nHow much money do you think Americans will spend on Halloween this year oh man I\nGot one of ... Halloween overall is one of the ... more affordable holidays I Would say I'm I'm gonna say is it a total for ... oh my gosh a couple of million I'm going to guess\nOne hundred million yeah you know guys ... you can tell it's party time because the estimate is that Americans are going to spend nine billion dollars ... shallow lean is actually\nOne of the more expensive holiday is because in will see this in Jake and I'll talk about it the spending on candy the spending on costumes the spending on a Halloween cards\nI don't I never get one yeah it'll never will get Halloween cards and uh so we'll take a look and then there's the spending on decorations much like\nI was going to say I mean if people are throwing parties that gets pricey but\nWell you you you until we'll talk about where they're spending will break it down and finally uh you know we're gonna talk a little bit about the some other aspects of Halloween including water the of the top five scariest films ooh and then what are the top five family friendly Halloween films gray well\nJohn and I will ah will be able to ...\nGives them into it for that conversation that's what I got to talk about movies a lot on the show I Want to see if you like the scarier you like the ... better are sounds good\nAll right well we'll have that for you coming up later on here on nine forty W. F. A. W.\nO. Dr Jennifer ... primary care provider or health care\nI really love my job I guess an opportunity to spend time with patients really get to know them and I see them on their good days on their bad days and I had the opportunity to help them through that\nViolates family everyone from\nVery much enjoyed the community for that and I enjoy community medicine\nSo it's a good for me to come here for health care [noise]\nMy personal philosophy in regards to medical practice and taking care of patients sure that we're listening to them as a primary care physician I get to take the role of\nCoordinating care for patients when it comes back and tell me that what we did for them has how they're feeling better probably in the back part of our job to really help people and know that what we're doing makes a difference\n[noise] find out more about Dr Jennifer winter\nFort healthcare dot com\n\nSaturdays murder for hitting Gaza first can roll began since about an hour and a half the eleven Dick tendons will be late to harass throughout the week I'll drink Lipman is one of the people in the tree of life synagogue who survived the attack\nAre still holding our prayer books and Larry our prayer shawl [noise] um [noise] we're we're trying to disguise ourselves as as bags or clothing ... bags from\nPresident Trump and the first lady will travel to Pittsburgh this afternoon to offer their condolences search crews are back in the water and Indonesia looking for the wreckage of the lion air passenger jet that crashed just off take half ABC aviation consultancy can you test the plane was brand new\nIt's a brand new find not only in the sense that it was just off the production line it's a new model of the venerable seven three seven so investigators are going to look very closely to make sure that there was no design flaw that may have come out and caused this crash at this point there's no reason to believe that\nOne hundred eighty nine people were on board it's believed all were killed Sherry ...\nWhere are you here with\nCameras and counties news and talk\nForty WFAN W [noise]\n\nIf you are and more to buy me energy what a scene we energy throughout the book is here did when we energy dot com defined location near you we energy energy you can depend on walking\nBucks plane without the honestly that a coupon knocked off Toronto one twenty four to one oh nine and a battle of on meetings at five served forum last night I ... got Nineteen points in ten rebounds ... Ilya so but they remained the leagues only on beating deem at seven in ...\nJust a second one game at a time when the amount of time and then you hungry as a unit were not satisfied and we're not trying to go undefeated we're just trying to go one game at a time\nThat's down ... points head coach Mike ...\nNo it's great for its on you know I think he had a little bit of a tough you know but you see them with you know just being banged up not being able to practice and I've been able to play on several pre season games and he wants to play so badly and he's so I'm just such a great worker competitor all those things so for him I thought he was huge and the first half a\nPack or is that the day off today have returned to practice tomorrow is they start preparing for Sunday night's game at New England meanwhile time Montgomery didn't talk to reporters after Sunday's game but met with them yesterday afternoon Montgomery ladies disappointment a teammates who are questioning his character behind his back instead of having a discussion face\nTo face Montgomery says he won't address the issue with his teammates\nHonestly if they wanted to be non and they would have said they would have made it clear I personally don't buy into that we talk about being brothers we talk about being a family and things in house and how does that and the other and that's not what happened I don't know maybe that's what they do in their family that's not what I Do I'm On the one ever said anything to me no one ever came to me so I'm thoroughly disappointed in the speculation\nBadgers getting ready to host Rutgers Saturday they will be without notice\nNo one ever said anything to me no one ever came to me so I'm fairly disappointed in the speculation\nBadgers getting ready to host Rutgers Saturday they will be without nose tackle the ... second polo and often to tackle cold bang land and both injured in the law said northwestern pronounce quarterback Alex Warner broke remains in the concussion protocol brewer that outfielder Tyrone tailor their forty man roster and Wade Miley geo Gonzales Lee Curtis Granderson all\nMy free agency Scott who's Johnson video [noise]\nAdopted us kids presents what to expect and you're expecting a teenager learning the lingo\n... short for being one hundred percent shorts or certain as in how to prevent a puppy ...\nPi always why\nDon't you don't want to be seen to be a perfect parent dozens of teams in foster care let me just the same thing that I talk to you as kids dot org and brought the by the U.S department of health and Human Services down to you as a kid and the ad council\nGetting your hunter education certification is easier than ever count the department of natural resources offers", "show_name": "WFAW News", "year": "2018", "city": "Fort Atkinson", "day": "30"}