{"month": "10", "state": "WI", "station": "WFAW", "content": "Craft club invites you to drop into the white foster public library community room anytime between three thirty and five thirty PM Thursday October twenty fifth to create a false lung cancer is open to his ... however children under age eight must be accompanied by a parent board acts and community theater is kicking off it's only Eighteen twenty Nineteen Jesus was\nAppalled musical big band at the movies and the medley of title ... hit singles from films made during the golden age of Hollywood\nWoman says will be held in the first United Methodist church in Fort Atkinson tickets are Fifteen dollars at the door or ten dollars on line for\nThe W. F. A. W. community calendar was brought to you by American wholesale furniture and Fort Atkinson offering made in Wisconsin symbol mattresses for just three Ninety nine\nNine boarding WMA not what you were born Afghans\nAnd online at nine forty WMA W. dot com [noise]\n[noise]\nFrom Haiti name's\nSherri ... President Trump brand threatened to close\nThe southern border over immigration concern the secretary of state starts a Central American tour\nSecretary of state Mike Pompeo touched down in Mexico city as President Trump continues to threaten to send troops to the southern border\nMore than we do our borders not only are working to\nPay or Mexican and Central American tour to improve relations and work on the issues that drive so many migrants north comes as the president threatens to cut aid to Honduras Guatemala and El Salvador if they don't stop there\nBut we should have and work on the issues that drive so many migrants north gums as the president threatened to cut aid to Honduras Guatemala and El Salvador if they don't stop their citizen ABC's\nKind of ... secretary of state Mike Pompeo is also denying reports that Turkish authorities share it with him all the all the alleged killing of journalist him all cause she'll be in the Saudi constantly and assemble day\nI've seen a transcript cookies foreign minister also says his country has not shared any audio recording President Trump is praising the Republican congressmen for physically assaulting a reporter and an international outcry over ... disappearance President Trump told the rally in Montana he supports congressman Greg GM forte saying\nWe endorsed Greg very early but I had heard that he body slams a reporter [noise] in\nFort they pled guilty to a misdemeanor assault for that incident last year President Trump Thursday said\nBody slammed my cat [noise] she and\nFour days running against Democrat Kathleen Williams in the race for Montana's soul seat in the house Brian Clark ABC News nearly a hundred women who say they were sexually harassed or abused by former USC gynecologist George Kendall are suing the school alleging and ignored decades have complained seconds\nNice my core that this could have been prevented not only for me but to the other women share it with me and the ... century the others hundreds of others outside\n... about five hundred current and former students have now made accusations against him till you're listening to ABC News\nAnd Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he's diagnosed with cancer\nStage four and here's the thing he had switched earlier for medical insurance to medical care where Christians share each other's medical bills to the question for Jordan and his wife Jenny was is this actually going to work our medical bills\nExceeded a hundred and sixty thousand dollars met his share members shared\nAll our bells and it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you because the hardest times of your life I just don't know how I could have done it without them at a sure\nThere's a reason this is growing so fast so if you want to find out more here has a number for you star star three to four star star three to four messaging data rates may apply called star star three to four\nDefense secretary James Mattis says an insider attack in Afghanistan well we can security there\nThey're these attacks by a man in an Afghan military uniform killed the well known police chief in Kandahar Province tenant general Abdul Raziq who defense secretary James Mattis called patriot\nFries you wash the patriots for Afghanistan\nBut ah I don't have a long process\nNot telling reporters that the U.S remains committed to an Afghan led peace process despite the incident which occurred shortly after ... attended by the top us commander in Afghanistan to Americans were wounded in the attack the Taliban claimed responsibility allegedly flop on ABC News Singapore\nThree strikes and you're out may no longer be the case in California which will reportedly reconsider the life sentences for thousands of non violent offenders is NBC's Alex Stone\nUnder the plan up to four thousand non violent criminals here in California who have three strikes against them would be allowed to try for parole\nThe Associated Press obtain court documents indicating that some criminals who right now we're in prison for life could get the chance said freedom a court ruled the third strikers must be included in a voter approved amendment requiring borough considerations for any person convicted\nOf a non violent felony offense Alex Stone ABC News Los Angeles says is ABC News\nEach time time to join the millions of people that need happy with his new video conferencing zoomed gives you flawless video crystal clear audio and instant sharing across any mobile tablet or desktop device but the best thing about new pitches works to ditch the distraction and joined\nThe movement and happy new video conferencing visit zoomed us to set up your free account today that zoom dot US zoom video conferencing I'm Sherry Preston ABC News\nCoverage than counties news NPR nine forty W. W.\nW. W. morning news\nAged forty six at six o five are forecast today calling for a chance of scattered rain showers man to hire fifty five will get more on the weekend forecast from the weather I whether that are coming up in a couple of minutes and sports for space elimination tonight at Miller Park\nVantage round one of the W why ain't football playoffs will have a preview let's get to\nThe news room on this Friday Here's Michael Klisch good morning Michael\nGood morning guy and water down the wrong river went back to haunt born three feet from four points for the deals to the afternoon and it's expected to stay in the action flooding stage for most of them is a next week\nThat Jefferson the river dropped slightly to ten point to evade still minor flooding expected to drop to the action stage on Sunday\nAt Fort Atkinson still at sixteen points for feed minor flooding and not expected to drop to the action stage of sixteen feed until next Wednesday like cars can on dropped slightly ten point eight feet still expected to slowly recede for the next week but still remain in minor flooding\nNational Weather service forecasts based on past precipitation unexpected precipitation for the next twenty four hours the greater Wisconsin committees annual discover whitewater series half marathon half marathon relay and five K.\nWas held in September twenty four at the banquet in which the jets were presented to the bench charities was held last night\nJeff night said this was a record year for funds raised working for white water wellness that's all housewife water lead astray hawks of water club and the white water school district\nSix fear most or reduced price Seventy thousand five hundred dollars so we are five hundred so you're sort of charity partners will be recently retired so hard\nSo we're very happy about that and we feel pretty confident that we can sustain and continue to build those racing\nNight says he expects the event will get bigger and better\nHundred volunteers have joined in the search for the girl whose parents were shot and killed in their home Darren ... Gerald requested to help the volunteers and the hope of finding clues as to the whereabouts of Thirteen year old Jamie clause was on a suspect in the case\nHe said the investigators believe she's alive but in danger\nRepublican Governor Scott Walker and democratic challenger Tony ... the state superintendent meet tonight for the first to do debates democratic US Senator Tammy Baldwin and Republican challenger Leah ... mayor made for the third and final debate tonight\nThe first of two debates democratic US Senator Tammy Baldwin and Republican challenger Leah vote may or may for the third and final debate tonight Scott Walker is shrugging off criticism from former cabinet secretaries\nFormer Wisconsin an economic development corporation CEO all jade and co signed a letter with former correction secretary ed wall and former financial institution secretary Peterbilt steady criticizing Walker if supporting Democrat Tony ...\nThe governor says the criticism just shows he welcomed differences of opinion\nI mean what are the advocate for gas tax increase I didn't have a problem with people in my cabinet have different viewpoints on issues that would\nBe former department of transportation secretary mark got leader who has not endorsed ... but who has said Walker was not truthful and increasingly inaccurate and comments about transportation funding Bob ... Wisconsin radio network\nState Department of workforce development reported yesterday was ... unemployment rate was three percent on September ... August walkers pointed to the low unemployment rate does he makes his case for a third term\nResident in Donald Trump's approved a federal disaster declaration due to flooding in storms across Wisconsin in August and September the Washington Post reports advisors told Trump not to hold a rally in Wisconsin\nYou know two stars lined up and we've got a ball python um you know going to get a day off and are and some of our guys are going to get multiple days off and be ready to go into a two game stretch\nOur broadcaster nine forty W. F. A. W. starts at seven oh five since the inception of the wild card for baseball teams trailing like Milwaukee have won a league championship series\nThe world series only ten out of thirty nine times the Boston Red Sox are going back to the world series for the first time in five years bottom\nFour winged victory at Houston in game five of the American league championship series JD Martinez split the red Sox have had with a solo sat on the top of the third\nThree innings before ... slammed a three run Homer off loser Justin ... David Price scattered three hits over six shutout innings for his first victory and well career post season starts\nAdam Wainwright will have to become a free agent before his contract agreement with the St Louis cardinals can be finalized when rights agreement has been put on hold because it's guaranteed salary could not be reduced by the more than twenty percent\nIf he remains on the roster continuously the W. I. A. football playoffs began with level one action tonight in division to water terrible host whitefish bay and division three jeopardy symbols that guy Catholic memorial at Waukesha south\nWill have that game I cool one of six point five starting at six fifty this evening and division forward Turner will be a lakeside low diet like bills will have reports on both those games tonight\nAnd division five pound Byron eagle will be at ... and division six\nCambridge ... and in the division seven Cambria freezing will be at Johnson creek Aaron Rodgers has been named the FedEx air player of the week you through for four hundred twenty five yards and two touchdowns and the thirty three thirty victory over San Francisco Monday Night\nRogers completed a game time touchdown pass to divide the Adams with limited fifty five to go then\nMoved his team eighty one yard setting up Mason Crosby game winning field goal ... touchdown passes a season and only one interception Josh\nRosen last night had two interceptions return for\nFirst quarter touchdowns and finished with five turnovers as the Denver Broncos beat Arizona\nForty five ten the Milwaukee Bucks bring their new look off incense and promote your players that their brand new five super arena for the home season opener tonight at seven thirty bucks to be going for two wins into games as Indiana visits a new arena they reach out and Wednesday night one Thirteen to one well ban and the NHL last night\nLate in Keller scored a third period goal and had an assist as\nCounties tap the Blackhawks for one gory Crawford lost in his first NHL game since suffering a concussion last December he other three shots on twenty or three goals rather on twenty nine shots\nWe have high school football today Jefferson will take a Catholic but Mario our coverage starts at six fifty I Do a cool one of six point five and a course on W. F. A. W. tonight\nHave Milwaukee Brewers baseball as they will take on\nThe Los Angeles Dodgers game six of the national league championship series are broadcast\nStarts at seven oh five were looking at a chance of scattered rain showers today hire fifty five here tonight law forty tomorrow chances scattered showers early in the day otherwise\nCloudy and forty four right now we're at forty six this morning there were nine forty W. F. A. W. nine forty W. F. A. W. dot com bubble usa W news time is six twenty two\nWhite want her ... year Saturday as homecoming at hall of fame game ASL\nGOP WWW ... six twenty\nTwo wind farm Saturday as homecoming it hall of fame game as the war\nIs getting ready to join already got one of six point five forty healthier pregame show started again one forty four on Broadway you buy\nCoverage drinking water and by Ryan subtle like one of those ... Dr Martin died forty W job [noise]\nPeople there's a huge minority but you're not going to want to miss you and your friends for ... for a large my doctors of hickory farms in Jefferson County the three hundred and eighty five ... years will be shouldered by drug free and clear for twenty nine\n... neighbors really reach a particular thirty first and one PM for more information contractors\nChevy answer your description ambushing ... group backup that S. T. V. S. [noise]\nYou know it wasn't on the markets to download down three\nHundred twenty six points it six drop in the past eight sessions it hadn't been down almost five hundred points the NASDAQ fell a hundred fifty eight and the S. and P. gave up forty crude oil futures fell a dollar a barrel to close at sixty eight sixty five\nAmong the Dallas worst performers IBM caterpillar and Home Depot and say the main reason for the continued bleak mood among traders\nWorries about how much more the Federal Reserve will continue to raise interest rates and that's a conundrum to a Congress because of the Fed's action are actually the sign of a robust economy the central bank is expected to raise rates once more this calendar year\nKleenex maker Kimberly Clark says it will re branded man science tissues after consumers complained that the name was sexist look for Kleenex extra large tissues in the months to come but some things will change the teachers will still be described as confidently strong\nStereotyping or ABC News [noise]\n[noise]\nShe knows the perfect combination before during or after the game get pizza fresh faster not from either of our piece of locations in lake males or Cambridge\nSlash and\nEnjoy the game with a classic researcher decent today ... ... dot com and\nKnow\nThe guy is still a threat and its effect on an unborn child can be devastating so we're taking our doctor's advice on how to protect our unborn baby from deacon a birth defect\nMosquitoes since ... so we're insect repellent long sleeved shirts in Long Branch and dumped standing water use window shrinks Horatio to prevent the spread from section use condoms especially one pregnant I'm not taking a chance of being a let's keep stopping Chico visited CBC dot Gov slashed prevent this message from the Centers for Disease Control and prevention\nNine forty WMA W nine forty W every W. dot com\n[noise]\nTo dairy margin protection program has paid more they share in the past three years combined\nI'm Nicole ... with a brand field theory on state ... Ga had paid more than two hundred and fifty million dollars to dairy farmers so far this year that the margin protection program\nWorld outlook board chair Seth Meyers ten margin to between milk prices and feed costs for the remainder of the year are expected to stay above eight dollars should not trigger more payment\nThe way and even the butter market in the near term are providing some product price support we reduced she's price a little bit we've got large stocks of cheese or brain the market and so at the end of the day what you end up with is also mixed clash milk prices USDA's\nOctober outlook report is projecting increase milk production and climb a law the owner price generally unchanged\nAnd dairy farmer grouping using a mentor ship program to expose young people to possible theory careers Tracy pro with professional dairy producers tell Springfield it's an opportunity for college and technical school and students they shadow a dairy farmer and also attend the PT POW conference\nReally open their eyes to the opportunities in the area that the\nSheet that they've had students from Wisconsin eastern Iowa inch northern Illinois and many students have no prior ... experience\nGlasser emails future is at the Chicago mercantile exchange closed or Thursday October down in ... Fifteen sixty five\nNovember eleventh tenth floor accepting the the three December down a diner fifteenth ... January Fifteen cents lower at the team forty three barrels we're down to three quarters of a than a dollar twenty six and a half\nLong seven cents lower at a dollar fifty to butter town three and a half cent that twenty five and bad dry milk and changed at age six and three quarter and dry weight also and changed at eighty seven and a half a cent I'm Nicole ... with a brand feel\nNo one works harder to help you achieve your goals and expand your possibilities we know how challenging and rewarding farming and this way of life could be\nYou won't find financial experts with more acknowledge\nThe rural route [noise]\nNo one enjoy seeing you succeed more than we do\nBecause we are more than financial expert we're neighbors\nUp to the financial partner dedicated to hand active in the community\nBecause it's our community to\nCome to your financial you don't just champion this way of life we limit [noise] why we have such a passion for helping the egg in rural community make dreams come true\nWhether you're just starting out\nOr on your way to building a legacy we're here for you and wishing you estimate and bountiful harm and\nLearn more computer dot com [noise]\nTrademarks of Columbia financial unequal credit offered to the\nWire and Saturdays homecoming game as to wash\nDishes to join the army but that can be one of the coin by for no fear ... start to get one forty four on football is brought to you by forty one room house and ... all one word and\nBuy for your job or should rocket while we're on one of those the only five and I'm On a dime forty W. dot com [noise]\nAre but the whitewater a league of women voters\nOr wants you to go to their website including the link voting in elections to find the answers to questions\nLike who was on the ballot and how to register for voting in addition to candidate questionnaire for the state assembly district forty three is available that candidates representing both parties are invited to complete and of course we'll have candidates for a district forty three at our foreign coming up\nOn Wednesday evening yes they'll both me there ... I think this is going to be a an excellent but actually it's a debate that we're holding mhm and uh one of those seats is wide open joke lake fish decided not to run and uh I I think we've got six good candidates for\nThe it'd be very fascinating that'd be six thirty Wednesday night at the ... room in Jefferson All right we'll let Mike rest up his throat he'll be back with another guest coming up in a couple of minutes there are nine forty W. F. A. W. looking at a chance of scattered rain showers today high of fifty five\nA clear and forty tonight tomorrow not so bad they are looking at a chance of showers early in the high a forty four right now we're at forty six WFAN W news time is six forty\nW. F. A. W. community calendar is brought to you by furnish one two three in Watertown need a little help make life easier with live chairs in power which liners now at the lowest price possible\nSt Vincent's fall in the Fort Atkinson Girl Scout troops are joining forces for the season of giving drive Sunday October twenty first from eleven AM to five PM Girl Scouts will collect donations of newer gently used winter coats mittens hats\nShoes and boots and closing of all sizes as well as personal hygiene products\nToys baby items and non perishable food donations please drop off your items that pretty school side parking lot Tuesday October twenty third plan to attend the next step face the fall lecture and title an introduction to levels that are Latino featuring Latino food and dance the event will begin at seven thirty PM at the Fort Atkinson club located at two one oneself water street ease\nThe W. F. A. W. community calendar was sponsored by American wholesale furniture and\nFort Atkinson making life easier with live chairs in power are climbers now at the lowest price possible [noise]\nHeld a news had secretary of state my palm pale heard an alleged audio recording of journalists Jamal ... alleged murder inside that sounded constantly can assemble but the secretary of state denies that I've heard that they\nSeem to work his foreign minister says his country is not shared any audio recordings with U.S officials secretary palm pale is in Mexico now when the first leg of the Central American tour addressing immigration is President Trump threatened to close the border to stop the caravan of Honduran migrants reportedly headed for the U.S [noise]\nAt a rally in Montana last night President Trump praised Republican congressman grand gene forte who pleaded guilty to assault in the journal is last year\nOf the election or just before\nAnd I said oh this is terrible is that it was the elections and I said well wait a minute\nI Know Montana pretty well I think it might help them for the hunting for re election is\nThe state's loan house member I'm Sherry Preston ABC names\nAre you having trouble with me getting more shoulder pain meet Dr ... Bronner of the biggest social and the center for joint replacement only add more to health care we really work\nWith patients to determine whether the treatments going to be for them to decide whether the replacement or if they can hold off on it [noise] or Center for ... brings a complete team of orthopedic surgeons collectively seven decades of surgical experience and special events\nTogether working to create the best possible outcome for you a program coordinators what are you from preemptive education and through your ... [noise] every step of the way to get you home\nArabic associates or over on patient satisfaction rapid recovery and return home right now is one of the highest in state for health care more therapeutic association and Center for joint replacement serving four down to an end surrounding communities visit for healthcare dot com\nOr health care\n\nThe brewers will try to stave off all of the nation tonight at home when they host the Dodgers game six\nOddly at al CSI bill Scott what's for its weight mileage starts for the brewers a trail the Dodgers three two in the best of seven series\nRed Sox punching their ticket to the world series knocking out Houston for one last night to win that series in five games Red Sox will host game one of the world series next Tuesday at Fenway week seven out of the NFL season kicked off last night with a route Denver led thirty five three and a half went on to beat Arizona forty five to ten\nBroncos into for game losing streak while the cardinals bought one in six Packers and thereby weaken won't be back until Monday there three two and one will face back to back road games against the rams and the patriots upon their return after Monday's when Aaron Rodgers has a more effective ground attack moving forward would do them some good\nYou know we're throwing the ball a bunch and uh you know I'm thinking too many shots so we need to find a way to get the ball out of my hand a little quicker and you know status run a little bit more I got to you know continue to try and do it quicker and we're going to find ways to run the ball in more than two\nBucks play their home opener tonight against the Indiana Pacers at five serve for both teams want to know\nWhere are we going to find ways to run the ball on more than two\nBucks play their home opener tonight against the Indiana Pacers advice serve for both teams want to know\nBucks won their season opener at Charlotte one Thirteen and one twelve on Wednesday twenty Third Reich football badgers host Illinois and big jet action tomorrow you lied I rank last until the parents in the Big Ten the badgers ground game should force against Illinois which is a lot of average one Ninety nine point five yards again through six\nJonathan Taylor said he's feeling good about halfway mark in the season\nThat great and that's one of the biggest fangs by Harvey on drugs that Chris anyone get married they can make a that's for the ... made a phrase tomorrow I make a clay so it's just a matter of\nAnyone getting in there and being able to run the ball well consistently and that makes that much more dangerous than I'm running game because no matter who is and you have to respect them because they can make a play fifteenth\nRank hockey bad years down the road this weekend there Clarkson tonight bill Scott Wisconsin radio network [noise]\n\nMen under the age of thirty five you know would really impressed ... the\nThe ladies when the guy has a few drinks the leader gets pulled over for bus driving that could cost you rent ten thousand dollars in fines legal fees and increased insurance rate goes let's grab dinner in a movie I Know you drive more carefully when you're bust\nYou've proven that hundreds of times and a woman in ... that kind of confidence and you practice at us to be given company does pull you over slowly\nClearly hand politely like good evening office or\nA woman in Myers that kind of force and one woman doesn't find that you call it bugs even though the law calls the drunk you can get ten thousand dollars you buy along with any chance of having a girl\nBecause nothing says I'm a catch more than a guy who lives in his parents' basement incomes it's my place\nBugs busted and broke because bus driving is drunk driving a message from the national Highway Traffic Safety Administration and the ad council pay the Wisconsin\nBadgers play here ... from eleven shotguns at forty\nSaturday\nThe Wisconsin Badgers host the Illinois fighting ... catch all the action with that advice starting in ... Wisconsin badger football is drawn to you by GM carbon badger base which is to bring her ... her hand builds your insurance in Fort Atkinson nine forty W. F. A. W. N. nine forty W. F. A. W. dot com\nMaples there's a huge land auction coming up that you're not going to want to miss you and your friends from the seventies for a large lead auction of hickory hill farms in Jefferson County the three hundred and eighty five plus years will be sold ... selling free and clear for twenty nine ... this land auction will be held the neighbors grilling pizza Cooper thirty first and one PM\nFor more information ... group\nAnd see a bull description ambush thinks ... group backup that S T E N E S groups dot com [noise]\nNine forty WMA W and nine forty W. F. A. W. dot com\nOr maybe the short list for cancer to\nThe Boston Red Sox are going to the world series after beating the defending champion Houston Astros in Houston Thursday night that's hurt on W. E. are getting more\nI failed divers had the big blow up for your own shot in the six\nEight strains that has won in the air to fail back those cats and\nA JD Martinez Homer does well in Boston won the series four games to one they'll take on the national league championship winter in the world series starting on Tuesday LeBron James losing to the trailblazers in his Lakers debut\n\nOn ESPN LA seven ten games for twenty six and grabbed twelve ... twelve Damien ... drop twenty eight and Portland's one twenty eight Nineteen when this is ABC Sports in the NFL Thursday night the Broncos snapped a four game losing streak with a win an Arizona grows\nA quick draw for forty five forty courses on\nOn K O way to pick sixes were Josh Rosen meanwhile Broncos wide receiver Emanuel Sanders both caught and through a touchdown passes the Broncos routed the cardinals forty five ten\nAnd the saints on Thursday placed receiver Ted didn't junior on injured reserve within the injury back to the NBA the Seventy Sixers got their first one of the season in their home opener against the bowls\nSharks for three shocked to hear me no joke\nOn WPN thirty points for Joel and be in a triple double from Ben Simmons Philadelphia won easily won twenty seven wanna wait Kelly all and I got a last second lay up to go as the heat spoil the wizards home opener\nThe question minimum age requirement more specific information there's only one winter per household every thirty days however I don't you wherever you W reserves the right to extend the rule on any specific country has some contests may have additional requirement winters are responsible for any taxes penalties must be claimed within thirty days complete loser Oregon has rules are online\nNine forty W. W. dot com\n[noise] the W. F. A. W. community calendar is sponsored by furnish one two three and Watertown featuring made in Wisconsin Ashley bedroom sets with had board dresser and near for just for sixty nine [noise]\nCrafts love invites you to drop into the white foster public library community room anytime between three thirty and five thirty PM Thursday October twenty fifth grader fall function is open to a ... view however children under age a must be accompanied by a parent for ...\nYears kicking off it's only Eighteen twenty Nineteen Jesus was a fall musical big fan of the movies and medley of titled phones and\nSingles films made during the golden age of ...\nBe held in the first United Methodist church in Fort Atkinson tickets are Fifteen dollars at the door or ten dollars on line\nThe W. F. A. W. community calendar was brought to you by American wholesale furniture and Fort Atkinson offering made in Wisconsin symbol mattresses for just three Ninety nine nine forty W wherever you W for not doing too\n[noise]\nI'm Sherry ... then you hear it or not a Turkish Thor says secretary of state\nMike Pompeo did hear a recording of journalism all cause she'll be murder inside the Saudi constantly in Istanbul up the secretary of state denied that permit day\nSeen no transcripts Turkey's foreign minister says his country is not shared any audio recordings with U.S officials at a campaign rally in Montana President Trump praised congressmen who physically assaulted a reporter last year saying anyone can do a body slam is his tight\nThe act of violence against journalists as the president was celebrating that last night rally or something the multi ton of congressman himself apologized for last year leading guilty to a misdemeanor assault talented I'm a newspaper who's journalist was attacked the guardian is warning that in the aftermath\nOf democracy has shown to possible to these comments could invite close assaults on June ... across the world and say\nMrs in and now President Trump continues to threaten to close down the southern border or send in the military of thousands of Honduran migrants continue to make their way toward the U.S and tempers flare up the White House's sources said there was a shouting match between chief of staff John Kelly and national security adviser John Bolton over at\nThat fight between the president's ... apparently said okay we're new worries about possible White House departure but sources tell us that either ... Kelly had any plans to resign without over this site has said\nHe's married Bruce the navy says the USS Ronald Reagan has resumed flight operations after a helicopter crashed on the flight deck during an emergency landing and say none of the injuries considered life threatening the Justice Department investigating clergy sex abuse and the Catholic Church in Pennsylvania\nA federal grand jury issued subpoenas this week to Roman Catholic leaders across Pennsylvania seeking a trove of sensitive documents and testimony about past abuse case and that's ABC's\nDavid right you're listening to ABC News\nHey I'm Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he was diagnosed with cancer\nStage four and here's the thing he had switched earlier for medical insurance to medical care where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work our medical bills\nExceeded a hundred and sixty thousand dollar Medicare members shared all\nOur bills and it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you through the hardest times of your life I just don't know how it could have done it without them at a sure\nThere's a reason this is growing so fast so if you want to find out more here has a number for you star star three to four star star three to four messaging data rates may apply call star star three to four\nRwanda becoming the latest country to announce a gender balanced cabinet where women make up fifty percent of the post East African nation has received international recognition for female representation in government with women making up sixty one percent of parliament members\nOutgoing UN ambassador Nikki Haley poke fun at her boss in the current political climate at a white tie gala in New York last night\nAs a member of Trump's cabinet it is a thrill to be out to dinner without being harassed feels that\nShe was invited to the Alfred P Smith memorial foundation dinner because they wanted an Indian woman but President Trump and said that Senator Elizabeth Warren failed her DNA test hundreds of fans swarmed the card Eby and Brooklyn as their apprehended out free winter coats and the cold Brooklyn\nNight on the first real cold snap of the season hundreds of kids and their parents school night pressed against barricade waiting hours for their\nIdol the rap sensation Carty be lifted herself out of poverty and she was heading here to south Brooklyn to give away coach at the cusp of a winter but for many it wasn't about the coach she spent hours here in the community center and on that cold light of metal barricades a few more pictures and she was gone ray of light and hope for hundreds here that's\nAmy Seitz Josh Iyengar Prince Harry and scale the Sydney harbor bridge to raise a flag marking the arrival of the Invictus Games the sporting event for injured that\nThis is ABC News\nResults not typical do you owe the IRS more than ten thousand in personal or business taxes and you can't afford to pay\nGet taxed representation the industry experts with negotiating with the IRS within a rating with a better Business Bureau call today and the IRS will be contacted the same day putting a stop to bank levees in wage garnishment called attach representation hotline that eight hundred by five six seven zero eight nine eight hundred five\nFive six seven zero eight nine that's eight hundred by five six seven zero eight nine\nI'm Sherry Preston ABC News\nThis is Joe and counties news until nine forty do you ever do you\nDo you have a W morning news\nIt's currently forty seven at seven oh five are forecast today chances are scattered rain showers high fifty five\nWill get more on the weekend forecaster ball traveling when he joined us in a couple of minutes in sports will here for more heart football coach Kevin bonuses they have home coming to borrow picking on River Falls the stadium and we'll preview tonight [noise] high school football playoffs but\nFirst W. F. A. W. news with Michael Klisch brought you this morning by Johnson bank in Fort Atkinson and by Fort healthcare for help your help family health and community health good morning Michael\nGood morning died or greater whitewater committees and you will discover whitewater series half marathon half marathon relay and five gay was held in September and the banquet in which the checks are presented was last night\nHalf marathon half marathon relay and five K. was held in September and the banquet in which the checks are presented was last night and Jeff night said it was a record year\nOr six fear and this year we're going to be distributed by seven thousand five hundred dollars so if we can survive on her and so you're sort of charity partners will be received five ... five\nSo we're very happy about that and we feel pretty confident that we can sustain and continue to build those racing\nWere working for a white water is wellness or W. three bedroom house whitewater leads Jay ... as a aquatic globe\nThe white hawk or white water Unified School district more news after that\nA hundred ... joined the search for a girl whose parents were shot and killed in their home Baron county sheriff ...\nSaid they hope to find clues as to the whereabouts of Thirteen year old Jamie clause who is not a suspect in the deaths he said investigators believe she's alive but in danger\nRepublican Governor Scott Walker and democratic challenger Tony ... state superintendent meet tonight for the first of two debates democratic US Senator Tammy Baldwin and Republican challenger Leah ... Mayer meats for their third and final debate tonight\nWalker shrugs off criticism from former cabinet secretaries\nFormer Wisconsin an economic development corporation CEO all jade and co signed a letter with former correction secretary ed wall and former financial institution secretary Peter build standing criticizing Walker if supporting Democrat Tony ...\nThe governor says the criticism just shows he welcomed differences of opinion and then what are the\nAdvocate for a gas tax increases I didn't have a problem with people in my cabinet have different viewpoints on issues that would\nBe former department of transportation secretary mark got leader who has not endorsed ... but who has said Walker was not truthful and increasingly inaccurate and comments about transportation funding Bob ... Wisconsin radio network\nThe state department of workforce development reports Wisconsin unemployment rate was three percent in September same as August walkers pointed to the low unemployment as he makes his case for a third term\nDonald Trump's approved a federal disaster declaration due to the flooding in storms across the state in August and September the Washington Post however reports that advisers told Trump not to hold a rally in Wisconsin the\nPresident has scheduled a make America great again rally for next Wednesday evening at Central Wisconsin airport in most any advisors according to the post argued he'll be wasting his time because they believe Governor Scott Walker\nTogether working to create the best possible outcome for a program coordinator is with us from preemptive education in three or ... [noise] every step of the way to get you home\nArabic associates over on patient satisfaction rapid recovery and return home ranks\nAs one of the highest state Fort healthcare Martha ... associates and Center for joint replacement serving Fort Atkinson and surrounding communities visit for the health care dot com\nAnd health care [noise] my how\n\nPainful there's a huge land auction coming up that you're not going to want to miss joined your friends from the ... group for a large land auction of hickory hill farms in Jefferson County [noise] the three hundred and eighty five plus acres will be sold inside track selling free and clear for twenty Nineteen\nThis ... neighbors grilling pizza on October thirty first one PM for more information\n... grew and see a fool description and listening to ... group dot com that has he ... he asked through dot com [noise]\nYour company is maybe family dentals primary concern they understand the optimal oral health begins with your regular visit and to make those visits more relaxing enjoyable ... Danley dead allow offers tempered venue\nWhen you arrive you some Airbus a blanket net pedal calorie snacks and refreshing ... family dental even offers laughing gas for those with ...\nThey want you to put your fears of ease during your visit\nGet to know each family dental and ... schedule your appointment today call and I do zero five six three twenty nine twenty eight [noise]\nCalifornia company is hoping to build the world's first luxury space hotel and they're looking to do this it is within five years\nA California company is hoping to build the world's first luxury space hotel and they were looking to welcome visitors within five years the Aurora stations cabin will be thirty five feet by fourteen feet\nGas will enjoy zero gravity amazing views of earth and sixteenth sunrise and sunset today the going rate nearly ten million dollars for a twelve days say\nAbout eight hundred thousand dollars per night the first four months so that in just four months\nMaybe even a ... in the market now\nClosed down three hundred and twenty six points it's six drop in the past eight sessions it hadn't been down almost five hundred points the NASDAQ fell a hundred fifty eight and the S P gave up forty ... a barrel to close it sixty eight sixty five\nAmong the downs worst performers IBM caterpillar and Home Depot and say the main reason for the continued bleak mood among traders\nWorries about how much more the Federal Reserve will continue to raise interest rates and that's the conundrum two economists because the feds actions are actually in the sign of a robust economy the central bank is expected to raise rates once more this calendar year\nKleenex maker Kimberly Clark says it will rebranded manned science teachers have to consumers complained that the name was sick says look for Kleenex extra large tissues in the months to come but some things will change the teachers will still be described as confidently strong\nCarry out all the ABC News\nNobody wants to do but you knew Siamese seven twenty two time for a look at our weekend for gas with Paul probably for the weather I weather center brought you this morning by Jim garbage in downtown for ... well we had a pretty nice day here for a couple of days in southern Wisconsin and a looks like this weekend is a little bit better than we thought it might be Paul\nYes to look at the colder here in the lottery condition Saturday and a couple\nOf hours maybe a little mix precept potential Saturday So this is going to be colder start that the weekend but things to get out for his hair and bid on Sunday and Monday and Tuesday as well and my the fifth the is coming back into place so early one day of the blustery colder weather\nOr they get through if we can stay with the clouds today and some scattered showers high temperatures in the mid fifties\nSouthwest way I feel bad about Fifteen to twenty five\nBut I partly cloudy about forty temperatures on Saturday I said about the lower forties fries as well say some clouds that for partial side the rain showers mixed race if possible through mid day on Saturday if we stay with North West when the Fifteen to twenty five\nSaturday nights load and the upper twenties that back in the sunshine Sunday forty eight for the high mid fifties Saturday and dry air Monday and Tuesday with more high in the fifties and the way I mean I Would just fall probably\nWell at least is cold snaps going to last ... last two too awfully long this weekend\nThat's right yeah and I have on here about two days stretch feeling more cold than than a former capitals back they're\nGonna like that Paul thanks a lot have a great weekend everybody there\nAren't that ball traveling from the weather I weather center this morning here on nine forty WFL up\nMore health care is baby friendly working with the world Health Organization and UNICEF more health care is one of only a handful of hospitals in Wisconsin that has been designated in maybe friendly there's a focus\nOf care from ... to burn after nurses will provide information about bathing seasoning\nAnd how family members to help out around the house\nCan moment to being made me friendly is breast feeding there are several international board certified lactation consultant John\nMiller show you the wonder long term health benefits of breastfeeding from China and for the mother board health care and provide some more and their families twenty four something through or nurses muscle more than ...\nVideos online resources and\nLeaves visiting more health care and ...\nNose gear down\n\nRight now in southern Wisconsin though like wins out of the southwest we're currently at forty seven year at nine forty W. F. A. W. N. nine forty W. F. A. W. dot com ball was talking about some rain now there's some rain showing up on the radar right now especially to the southwest of Madison to the east\nOf Monroe out in Lafayette county Iowa county moving off towards the northeast so we could see some showers here in uh southern Wisconsin by mid morning we'll keep an eye on that nobody wants to do what you do Siamese seven twenty five Michael is back with another guest in the morning news Michael\nThank you Gary and on the line with us we you know when you're white water philosophy professor Chris minor good morning crews morning Michael and then tomorrow it is Saturday morning belongs to me that he'd like Boston Public librarian for that it is and is what will be discussed\nWell\nWe're discussing the ever popular at ever intriguing topic of reincarnation\n[laughter] and\nAh we've probably had a conversation many centuries or\nYes a lot of people believe firmly in it\nYeah I'm a probably billions and billions and billions of people are pretty popular a block the owner of let's say however you want to cast that out in a Asian kind of religious practices so early in the ... and ... and uh in Buddhism\nIncentive for getting truly McLean Shirley maclean who's written several books on her ties lives\nOh yeah right yeah so that's pretty interesting um there's a whole\nAnd there's lots of philosophical implications and with like ... represents that needs to be a place for her to be\nViable um though I uh the person's lenient Morrow Melanie Garcia and a ... from what I Know she has lots of knowledge about that aspect of this will be in the past lives then\nWhere do you do it when you die and then like holding chamber some places than your reincarnated you made less again and go up and go down and the whole notion of karma caused but just\nNew there are people who are of course who claim and parents lives they were always somebody famous like number Napoleon or they were a Alexander the great or somebody like that but there are many people who just ah we're normal people in a parent's life more say they were\nWell I don't know [laughter] there's um there was a guy named you eat in a while ago documenting lots of these kind of I don't recall the paranormal cases but he says like\nAnd I think that's medicines or where or three thousand reincarnation cases um a lot of them I mean I I did not read all these cases but I read like a battery assault and a lot of them were not famous people they were just I don't know\nA lot of them I mean I I did not read all the cases but I read like a battery and a lot of them were now people they were just you know\nRegular people I mean maybe maybe a little bit richer than they were in their life\nFor them for a life or or maybe at one was like a French non mhm yeah a couple of centuries ago so I probably berries or ... in the western world we might have different connotation thoughts about what is\nThe religion\nThey make it up so I that's on the conversation Marjorie pretty interesting thing with the exception than what may be right what may be wrong um but yeah apparently we've all had passed live and maybe our upbringing our western upbringing has\nMay birthday and she sends us a picture of the male born cricket ground the hallowed ground as thousands of cricket in football fans throughout\nAustralia looks like it's just a good old American football stadium there but does a pretty impressive crickets\nBigger than football or I um actually they called cricket football I Believe it don't they\nKnow soccer they called yesterday yeah they've Gulf above cricket\nYeah those cricket matches can go on for days as I can yeah so anyway hey congratulations out to a million of rule of Jefferson today's subway birthday winter enjoy that's all right to handle the cards in for tomorrow we started out in ... with Alex do all the birds ... Alex\nOr this will be right up the alley wizards and are warriors years well designed yeah interior of\nThe war broke with Syria him the museum of London uh-huh alright isn't that the surprise me yeah a little crazy there ah let's see here from a Jefferson with a birthday for tomorrow we have burned his ... birthday Verna\nAsked she sends us the recipe for\nOhio Buckeye candy All right [laughter] ... yeah one and a half cups of peanut butter one box of confectionery sugar\nOne sticker margarine and one package of dipping chocolate so there you go Mm wow I like that yeah they have to try that out none a single ingredient not object to [laughter] no I think they all work pretty well for me\nAnd then finally when the birthday from Fort tomorrow we have Trudy and home\nWell truly happy birthday and that this is the Venetian guns Ceylon and it's from a twenty seven or eight or twenty seven BC\nOh All right well they are a a map what is it\nIt's a picture a it's a um [noise] what\nDo you call those things with the with like a lion with a person's head on it and\nWings so it's been a gargoyles oh okay yeah something like\nThat right ...\nRight anyway I get a mixed up I could take a guess but I had a long way yet phone calls yeah we would matter of fact I ran into it my coach his show last night in a white water\nA gentleman I didn't catch his name by the way but he he's the one that likes to call us when we make was it was [laughter] or we don't have something right I shouldn't say make mistakes and to give us the answers when we're stumped I think is a better way to put it\nSo we thank him very much for that indeed to keep him in business [laughter] exactly [laughter] we keep a very busy guy anyway back to our birthdays congratulations out to add like stall of Fort Atkinson\nAre subway birthday winter for tomorrow joined that's all right let's get it to other birthdays today artist Peter Max is eighty one years old today\nHuh been quiet for a while you haven't seen a lot of his work for a while anyway a actor Michael gambling in Seventy eight years old today I'm not familiar with them but apparently he's been in all the Harry Potter films\nOkay I Know the name I mean I Know I recognize it but\nI don't I think I saw said he was played a professor or something like that like oh wait a minute is he a Brit\nUh I have no idea I think I got 'em and yeah okay\nI don't know if he's going to be in Jefferson this weekend or not but uh this is this weekend I guess I'm actor John let's go is Seventy three years old today\nOn those ... yes he's done a lot of fun stuff\nA senior Jeannie she Riley is Seventy three years old today\nOh a harbor valley PTA yeah men came out of nowhere with that song ... do you have the secretary\nBe three years old today oh a proper valley PTA yeah that came out of nowhere\nWith that song ... do you have the secretary for somebody in a in the business and ... come up\nWith that's right it was a secretary for a record executive out in Nashville yeah\nSay I got a son that's ... yeah yeah recorded let's hear what it sounds like one number one I Believe\nYeah a retired boxer Evander Holyfield fifty six years old today\nI guess that's been a long ...\nA comedian Chris ... from Saturday Night live forty eight years old today\nAnd actress Jillian Jacobs from the ah television program community or she is thirty six years old okay none of that\nYeah so those are the birthdays today but a happy birthday going out to mail you a Amelia ... of a ... percent are birthday winter for today and Alex stall or for that can set our birthday winter for tomorrow congratulations\nAlright if your birthday is coming up let us know about it that is your name address and birthday on a postcard ... five three five three eight [noise] makes you give us your direct mailing address one birthday proposed got pleased with the birth date on it\nAnd get it to us at least a couple of weeks in advance so we have it in plenty of time for the drawing board said a minute on W. F. A. W. [noise]\nPeople there's a huge land auction coming up that you're not going to want to miss joined your friends from the seventies group for a large land auction of hickory hill farms in Jefferson County [noise] the three hundred and eighty five plus acres will be sold in five ... selling free and clear for twenty Nineteen [noise]\nThis land auction will be held neighbors grilling pizza on October thirty first one PM more and more information ... group and see a fool description and listening\nTo al ... group dot com that's S T e M M E s group dot com [noise]\nYour governor ... primary concern they understand that optimal oral health begins with your regular visit and to make those visits more relaxing enjoyable ... family did allow offers uncovered venue\nWhen you arrive juice from Airbus a blanket neck to have a calorie second refresh my ... family dental even offers laughing gas for those with ...\nThey want you to put your fears of ease during your visit\nGet to know each family dental in Fort Atkinson schedule your appointment today call and I do zero five six three twenty nine twenty eight [noise]\nIs that what you want to use [noise]\nWait ballet is headed back to the ... with the Milwaukee Brewers try to stave off of the nation against the Dodgers and the national league championship series tonight looked at it ... it will be the first picture to start back to back games in the same postseason series\nSince Nineteen thirty mile though pitch to just one batter on game five on Wednesday before the brewers turn to their bullpen the Dodgers are going with left handed in June ruined rematch if game to starters manager Craig council says they're pitching staff has in good shape or a possible to game series we've\nGot you know to starters lined up and we've got a little town that I'm you know going to get a day off and are and similar can you guys are going to get multiple days off and be ready to go into a ... a two game stretch our broadcaster\nNine forty W. F. A. W. starts at seven oh five since the inception of the wild card for baseball teams trailing like Milwaukee\nHave only one of the league championship series or a World Series ten out of thirty nine times and the American league the Boston Red Sox are going back to the world series for the first time in five years\nFollowing up all and victory at Houston in game five last night JD Martinez put the ... the head with a solo shot on the top of the third three names before ... slammed up three run Homer off loser Justin Vernon lander David\nPrice scattered three hits over six shutout innings for his first victory and twelve career post season starts Adam Wainwright will have to become a free agent before his contract agreement with the St Louis cardinals can be finalized when rights agreement has been put on hold because his guaranteed salary cannot be reduced by more than twenty percent\nIf he remains on the roster continuously\nThe W why a football playoffs begin tonight with level one action around the state in division to Watertown will host whitefish bay and division three Jefferson takes on Catholic memorialize Waukesha south\nHave that game for you on cool one oh six point five starting at six fifty this evening and division for Turner will be a lakeside low that will be at lake bills\nWill have updates without any pack on both those games are cool and a six point five and nine forty W. F. A. W. division five tonight Pam Ira eagle on the road it may villain division six Cambridge plays host to dodge land and in division seven ... will\nBe a judge and create Aaron Rodgers has been named the FedEx airplay or the week you\nThrough for four hundred twenty five yards couple to touch down to the thirty three thirty victory over San Francisco Monday Night Rogers completed a game tying touchdown pass to develop a Adams\nA minute fifty five left then drove his team Eighteen yeah or eighty one yards I should say setting up basing Crosby game winning field goal he has a dozen touchdown passes the season and only one interception last\nNight Jeff Rosen ... return for first quarter touchdowns and finished with five turnovers adds a Denver Broncos beat the Arizona Cardinals forty five ten\nThe Milwaukee Bucks bring their new Lakoff and sense of ... players to their brand new Pfizer arena for the home season opener tonight at seven thirty bucks to be going for two wins into games as Indiana visits a new arena they beat Charlotte Wednesday night one Thirteen to one well\nAnd in the NHL last night Clayton Keller scored her third period goal had an assist ... stopped the Blackhawks for one or a crop or lost in his first NHL game since suffering a concussion last December he yelled at three goals on twenty nine shots brewers baseball tonight game six against the Dodgers will have it for you at seven oh five\nIran W. F. A. W. high school playoff football today I cool when I was six point five Jefferson versus Catholic memorial airtime is at six fifty plus we'll have updates from lake mills and the lakeside Lutheran games tonight\nOn both stations forecast calling for scattered rain showers today hire fifty five\nRight now there is some rain out to the southwest of us and we're at forty seven this morning here at nine forty WFSU W nine forty W. F. A. W. dot com bubble usa W and use time seven forty eight\nShop for the best meat in town this Halloween ... century downtown lake milk meat always comes in fresh never frozen and it's always USDA infected try tenders you the USPA center ... only a dollar Ninety nine a pound that quick meal pay that same one Ninety nine price\nMemorial join ... full of poor health care pre game show starting at six fifty times cool one of those six point five and nine forty W. F. A. W. dot com Jefferson eagles football these raunchy you buy find time bakery and catering filled it applied hand widows hamburgers Danny Jefferson standby Ryan's I don't care and lake meal [noise]\nSee entertainment news looks like Halloween is going to slash up the box office this weekend tracking as the sequel earning anywhere from fifty five Seventy five million\nDollars maybe more which would be the best opening ever for a horror movie in October and by far the best opening for any movie Halloween series this equal starting Jamie Lee Curtis is the only film opening why this weekend the timely team drama the hate you give is expanding across the country\nFor those who prefer to chill at home that ... dropping a couple of series today including the second season of the critically acclaimed true crime donkey series making a murder and for comic book bans the streaming services launching season three daredevil\nWeekly says we all know that's the next Super Bowl halftime show and she said no because of the nearly controversy\nLuther Supergirl intimate villain will be introduced in season for the cw superhero series and happy birthday to address Gillian Jacobs turning thirty six today I'm Jason ...\nNine forty WMA W for napkins and online at nine forty WMA W. dot com\n[noise]\nSherrie Westin that President Trump is making immigration that key mid term election issue\nResident Trump rally to supporters in Montana threatening to take swift action against the caravan of three thousand Honduran immigrants headed north\nI'm willing to send a military to defend our southern border to\nPresident promising to shut down in the U.S Mexico border to stop the migrants many fleeing violence and poverty the president and secretary of state Mike Pompeo who's in Mexico for the first leg of a Central American tour praised the Mexican government which set federal police to us border with Guatemala to intercept the caravan cannot smoke in the ABC News Washington\nTurkey's foreign minister said the country has not chair to any audio recordings with us that purport to prove the murder of missing journalist Jamal 'cause she'll be inside the Saudi consulate\nABC News has been told exclusively the secretary of state Mike Pompeo\nAllegedly heard an audio recording all the righteous motor during meetings and Ankara according to a senior Turkish official who spoke enormously be official at the pump ... which also given a transcript of the recording [noise] which I have an electric pump ... vigorously denied claims that they\nWent out for comment yesterday the White House referred questions back to the state department's\nABC's in panel former Trump campaign chair Paul Manafort is due back in ... courtroom to decide whether he will be sentenced on fraud charges before or after he completes his cooperation with prosecutors the government wants a delay but a judge expressed concerns about that floodwaters persist in central Texas says the state braces for even more rain\nLake Travis has taken on more water than the city of Austin normally uses for years the\nBCS Victor can do an additional three or four inches of rain forecast for this weekend Afghanistan's election commission has postponed Saturdays elections in Kandahar for at least a week following that deadly attack that killed two senior officials including its police chief you're listening to\nABC News\nExperience relief or muscle cramps at CERN is used their works relief the fast acting bum is proven to prevent and relief but and leg cramps gender works relief today and the pain relief violent Walmart CBS writing and Walgreens pharmacies for their works really\nDot com each time to join the millions of people using zoom video conferencing\nTurn aims died conference drew puddle room or executive us and they do is do we slowly HD video crystal clear audio and that widely sharing it'll even work with here today the hardware store you're meeting with a single touch or use do new voice command feature he started meeting huddle happy\nVisit zoom diet and us to set up your resume room trial\nToday that zoom dot US zoom video conferencing okay\nAmerican turn first in the morning during the day on\nMorning America learn how\nGot your ticket yet a cool nine hundred and Seventy million on the line for tonight's mega millions drawing\nIn a way and that\nSeems to be the general consensus after people by their tickets but some think the bigger the jackpot the worst your odds of winning when Mike or getting a statistical professor at Berkley City College in California says that's not true\nYour chances of winning always stay the same whether you can win more money is the jackpot grows\nJason Collins says he really plays the lottery but the jackpot is just too good not to take a chance I never really think we're going to win in that you never know like the the saying when they'll play Sherry bowling is open to strike it rich I'm ready to try and pour so I'm ready to try and keeping the dream alive\nTaught anti ABC News starting this year Texas teenagers are required to take a class on how to handle police traffic stops\nA series of deadly interactions between police and civilians here and elsewhere prompted Texas lawmakers to come up with a curriculum at at sixteen minute video\nFor you know I was reading over\nWhich airs on Syria will to lead\nYoung drivers you know what to expect if there is ...\nAt at sixteen minute video free rein over\nWhich as long as they're willing to let young drivers you know what to expect if there are stopped by the police want something to CD forty five I'm also ... status for filing a complaint for a compliment about an officer generally an ABC News outlets\nRussian President Vladimir Putin's former bodyguard has rejected an opposition leader invitation for a TV debate after challenging him to a dual the general sense he wants an actual dual [laughter] not a public discussion\nThis is ABC News\nResults not typical do you will the IRS more than ten thousand in personal business taxes and you can't afford to pay\nGet tax representation the industry experts with negotiating with the IRS within a rating with a better Business Bureau call today and the IRS will be contacted the same day putting a stop to bank Lebanese and wage garnishment called the tax representation hotline that eight hundred five five six seven zero eight nine\nEight hundred five five six seven zero eight nine that's eight hundred by five six seven zero eight nine\nI'm Sherry ... ABC News\nIs jars and counties news NPR nine forty do you ever you know you\nSee he's WNBA W morning news\nIt's currently forty seven at eight oh five are forecast today calling for scattered showers well today high fifty five and there is rain right now in western Dane County also in green county heading in our direction we'll get more in the forecast from the weather I weather center coming up and sports\nDo or die game tonight for the breweries game six of the play offs and high school football\nPlayoff getting underway in round one tonight will have a preview coming up let's get to the news room with Michael class news brought to you this morning by Krieger jeweler in downtown Fort Atkinson good morning Michael\nGood morning Gary the greater whitewater committees and then you will discover whitewater series half marathon half marathon relay inside Kay was held in September and last night was the bank wedding in which\nChecks are presented Jeff night said this was a record year\nIt was a six figure most or we're going to be distributed by several thousand five hundred dollars so if we increase to five hundred so you sort of charity partners will be received five ... five\nSo we're very happy about that and we feel pretty confident that we can stream and continue to build who's racing\nRecipient partners whitewater a working for whitewater wellness or W. three bedroom house whitewater lead astray hawks aquatic club and the whitewater Unified School district more news after\nDr Jennifer ... your primary care provider for health care\nI really love my job I guess than African to spend time with patients really get to know that I see them on their good days on their bad days and they had the opportunity to help them through that\nI like taking care of family everyone from\nI'm very much enjoy the community for that concern that I enjoy community medicine\nSo it's a good fit for me to come here for health care [noise]\nMy personal philosophy in regards to medical practice and taking care of patients to be sure that we're listening to them as a primary care physician I get to take the role of\nCoordinating care for patients when it comes back and tells me that what we did for them has house and they're feeling better probably the best part of our job we get to really help people and know that what we're doing makes a difference [noise]\nFind out more about Dr Jennifer winter\nFort healthcare dot com\nFor [noise]\nThe the rock river from Watertown delay concentrate on is essentially unchanged its in either a minor flooding or actions\nFlooding stages and predicted to stay in that area for at least the next week probably much longer one hundred\nVolunteers have joined the search for the girl\nParents were shot and killed in their home Baron counties serve Chris rich Gerald\nSaid that the whereabouts of Thirteen year old Jamie clause is important she's not a suspect and her parents dance and investigators believe she's alive but in danger\nGovernor Scott Walker shrugs off criticism from former cabinet secretaries\n... former Wisconsin economic development corporation CEO all jade and co signed a letter with former correction secretary ed wall and former financial institution secretary Peter ... criticizing Walker if supporting Democrat Tony ...\nA ... a ... it's Seventy three days that\nUh let's see here yes you're right that those drugs are not affecting you at all not at all them are Seventeen eighty one out of the state British troops under general lord Cornwall is surrendered at Yorktown, Virginia asked the American revolution neared it's and\nYeah yeah I'm I'm reading a book I picked it up from the wall was telling the Historical Society book sale at the fair [laughter] us which I always wanted to read Seventeen Seventy six it was a Pulitzer Prize winner about Fifteen Years ago or so and it's about that one a year\nAnd uh it's amazing we we won that war\nThe way Seventeen Seventy six when it started pretty good in Boston with bunker hill and ... Lexington and Concord but then they blockaded the harbor and uh then it went pretty good they are brought in some cannon for report like on the road which Ethan Allen talk and\nDrove them out they went to New York however and then it was downhill from there while I'm just ... it's amazing we made it through that year the British thought it was over\nUh in New York by midway through the summer well this is done they can recover from this mhm that's how close it was\nWow that's interesting yeah uh in Ninety or make that Eighteen sixty four Confederate Lieutenant General ... a early soldiers attack union forces at cedar creek Virginia union troops were able to rally and defeat the Confederate in that attack what year that was in the Eighteen sixty four\nYeah mhm bringing the war to the south\nThat's right a Nineteen fifty three the raid ... Ray Bradbury novel Fahrenheit four fifty one set a future where books are banned and burned by the government was first published by Valentine books on this day\nYeah legendary for four or five one is the temperature at which books ignite oh really yeah I didn't know that yeah a a burst into flames at that temperature just\nTake a bus down their own yeah well if you got to eat them up to that\nI see All right interesting ah Nineteen sixty seven us space probe Mariner five who passed Venus I'm this day [laughter] miss it again [laughter]\nI don't know if they weren't necessarily going to land on Venus I think they just wanted to get pictures of it\nWell when they missed that that was their story I see okay [laughter]\nNineteen Seventy seven the supersonic Concord didn't miss it made its first landing in New York City on this day in day to do in a given yes\nNineteen eighty two automaker John DeLorean was arrested by federal agents in Los Angeles accused of conspiring to sell twenty four million dollars of cocaine to salvage is failing car business\nYeah the car did not to\nThe L'Oreal wasn't quite the automotive genius people thought he was ... or the car look good but it did not perform according to\nA the experts are the way it should do you expect to a sports car to perform and the costs a lot of money and people were buying them yeah as long as he did so lip it's\nUh yeah it had those hatched doors if they're a member of the kind of opened up instead of opening out\nYeah ... back to the future yeah that's right that's about the only movie illiteracy uh [laughter] I delorean are and\nThat's right and in Nineteen eighty seven in the stock market crashed as the Dow Jones industrial average punch five hundred eight points or twenty two point six percent in value\nBiggest daily percentage last too close to one thousand seven thirty eight in what came to be known as black Monday yeah well jeeze where we are now we're up over twenty thousand I think now I'm yeah something like that this was eighty seven eighty seven yeah\nI was I'm working downtown Minneapolis at the time um I had a four O. one K. um but a lot of people thought they could do better on their own\nAh this explain to him very clearly no you can't [laughter] I ... I knew a lot of people that got burned badly down in that yeah uh it rebounded so I think they probably get most of them I Would think you know\nIn let's say they panic too much and uh you know did something foolish but yeah a lot of times I mean an over the years you write out that stuff generally yeah pretty well you know if you get yourself place well and\nAnd the words of Warren Buffett and they asked them how do you get so rich well when people are selling I buy ... when people are\nBuying I sell yep there you go I just cheap and I sell it high [laughter]\nAnd that's the way it works and indeed yeah All right thank you Michael Michael will be back Cassie takes another cough drop at eight thirty with another news update you're on nine forty W. F. A. W. we're looking at scattered rain showers today hire fifty five radar shows rain starting to age its way towards Jefferson County this morning matter of fact a it's\nA pretty heavy rain in southwest a Dane County right now also in a North West a green county and parts of a Lafayette in Iowa county making its way towards us here in southern Wisconsin\nNew Simon say twenty four time now for the ... brought with Bill Scott brought you this morning by Deerfield piss in an archery in downtown to you\nKnow it's not a matter of a matter of when every athlete experiences pain meet Dr ... associates and sports medicine only add more to health care\nWe take care of patients from the weekend warrior to elite athletes for all sorts of different enjoying that Lincoln had problems and pains we come to a shared decision as to what is their best treatment whether that be\nSurgical or non surgical nurse Marti medicine program involves many different team members from\nNurse wants them to highly trained physical therapist to Moscow is called a radiologist we work together to take good care of each individual one procedure that I realized freeze your surgery the newer type in town meeting which is called the ... the smaller incision there's lots of course\nNot remain badly factor there's more reliably and a little more comfortable in\nFort healthcare orthopedic associate and sports medicine serving ... surrounding communities visit for healthcare dot com forward you know [noise]\n[noise] [noise]\n... radio networks for his title down right\nNow with the latest from land here we'll [noise]\nThe Packers were in the middle of their vi week off and won't be required to be back to work until Monday when they face the rams next week Aaron Rodgers is hoping to shed the brace that he's been wearing down that left me\nI just so darned good loving thirty to brace off after the by but we'll see a see how it responds tomorrow in this week and next we can probably get some sort of an image of it again and for that would be nice to be feeling great come a next week a Wednesday\nRogers on where he feels the Packers are pets is at the by week\nWill refining our identity on our phones regardless who put up some big numbers the last couple of weeks and found a way to move the ball a little more efficiently and get to find the involved a and a and Jimmy obviously involved a little bit more we still got a ways to go into ... bills\nGot a lot more from titled town after this\nI'm probably okay to have one more drink before I drive home [laughter]\nA bill Scott ... more from titled town after this\nI'm probably okay to have one more drink before I drive home [noise]\nProbably okay I open the windows day alert [noise] mouth [laughter] step out of the car please [noise] I probably made a mistake\nProbably okay and then okay when it comes to drinking and driving the warning sign shop and how they have a car or a friend that's driving drunk driving and that that ... have I Can't stop\nDependable experience\nSome radio network you can count on our candidate team of reporters can bring you the stories that matter to you and your family with an understanding of the community and decades of experience our staff is connected to the new we're dedicated to finding the truth and delivering the facts because that's who we are\nThe what we do as an hourly for updates on the Capitol breaking news sports highlights so much more power staff whose fault which one step ahead you were saying you're a new Wisconsin radio network\nReceivers triggered Davis and Jake ... are both eligible to be designated for return from injured reserve and they're both eligible to return to practice and can rejoined the fifty three man roster anytime after the rams game next week ... had the better training camp at Davis\nCould have more value when the team's returned game the average twelve yards of game last season Randall\nCobb and ... Williams of combined whoever just five point three yards per return in the first six games was back to work next week John bills got a lot more from titled Tom then those kinds of radio network [noise]\nNow just before the opening\nBell NASDAQ guessing the Dow futures point to a higher start to the trading section on Thursday the Dow Jones industrial average plunge three hundred and twenty seven points to close to twenty five three Seventy nine the standard and Poor's five hundred gave up forty and one half\nAnd then as the composite dropped two percent of its value to end the day at Seventy four eighty five\nAhead of the mid term elections Facebook is trying to fight fake news on two fronts engineers and researchers in a west coast war room or combating misinformation while third party humans fact checkers in Philadelphia are sorting through posts\nAmazon executives have made a fresh round of visits to several of the twenty finalist sports five billion dollar second headquarters project\nThat has fueled added anticipation as Amazon ... decision in the process that stretch out for a year the visits over the last couple of months included New York city Newark New Jersey and Chicago Jim wrong an ABC News\nNine forty W. W. dot com now is a really\nBad time to buy and I had a Mac book a Mac Mini or air pot you need to wait until October thirty first came to man with your friday consumer ticket date get tech news and security alerts would the free commando pod cats have bailed on apple pie cast and Google Play\nRefugee status there and the campaign for Montana Congress and Greg June fourteenth President Trump praised the Republican for physically assaulting a reporter last year and\nThat is outraged grows up to the disappearance of journalist ... from a Saudi constantly\nOn these wages that rally yesterday President Trump was asked if he was the show she said it certainly looks that way to me it's very sad\nBut ... didn't need for more time saying the Saudis can we say a full season I'm Sorry investigation and now new details that pitch a time member of the Saudi royal families owns who rushed to the incident has said he\nSits in Palin assembled senior tickets official tells ABC News secretary of state Mike Pompeo has heard alleged Adil ... murder a ton pale and the Turkish foreign minister denied that Jerry ...\n... is several valuable members to the team and are now offering more products are more knowledge and move support\nTo help you and your business and as we entered the next evolution of dairy land there's one thing that will never change\nThey do the best job of working with you it and having your back feeling like a family are very loyal when they tell you know do something they follow through with it but I trust them either a racehorse has some answers he can get for me I feel confident because of that\nI've always enjoyed very way on everyone was so easy to talk to and I was talking to a family member or friend helped me oh any way possible\nTo have you been a customer for ... minutes when you with ... family and we always do what's best for families then\nYou would ... family and we always do what's best for family then now\n... one ... one for me to\nLearn more at ...\nDot com warriors and wizards festival the portal tier fandom warriors and wizards where the world's they'll die science fantasy need cash playing virtual reality tell me the Germans in Wisconsin It's October nineteenth the twenty first order wristbands on line at warriors in the wizards festival dot com [noise]\nThe birthing center at Fort healthcare is the best choice doctors and nurses and the port healthcare great expectations birthing center at Fort Memorial Hospital in Fort Atkinson are specially trained to care for\nPre made all this routine high risk pregnancies labor and delivery plus post part of me\nFor health care has been designated up baby friendly facility one of only a handful in the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience you can enjoy all the comforts of home\nStarting with the ... private sweet experience to hydro therapy you know\nBefore and after ... plus for health care has restaurant quality food service twenty four seven leaves visit ward healthcare dot com forward slash being poured healthcare\n\nThe brewery lead to him again is found in the world series for the first time since Nineteen eighty two I'm Bill Scott what sports they trail the Dodgers three games to two and the and I'll see as hosting game six at Miller Park denied Dodger third baseman adjusted Turner says every game of the series has been a grind\nCome into the series we knew we were playing a really good in the Milwaukee law club and ah they're playing there but they were buying our but baseball when you were going to be a good series and and I was going to be tough and we're battling were ... were granted and finding ways to trash run across weight\nMild gets to start for the brewers tonight winner of the series will take on the red Sox in the world series Boston winning the A. L. C. S. four games to one over the Houston Astros\nAnd they won the elimination game last night in Houston for one the red Sox hosting game one\nOf the world series on Tuesday bucks when their season opener in Charlotte Wednesday tonight they play their home opener pacing the Indiana Pacers advice or form twenty third drink football badgers hosting Illinois and big tent action at camp Randall tomorrow afternoon the badgers often struggled in last week's law said Michigan guard Michael Dieter\nSuicide so that we are back that my service on St pays or got to be clean as we can really make it and then ... you gotta make plays out I mean that just comes from the resorts to practice and and just guys playing confident in and putting their lives and playing faster than say\nAfter sweeping twelve drank Boston College at home last weekend the hockey badgers went from ... to fifteenth and the country but coach Tony Granada says so what are\nThe only thing that matters is that we focus on our team getting better you know like I said I don't think our team newly planes number twelve Boston College and just went out and play and worry about ourselves\nBadger that Clarkson tonight second rate badger women on home I started with two game series against Princeton ... arena tonight Big Ten volleyball tonight nights ranked Wisconsin playing host to fifth rank and defending the NC double a champion Nebraska at the ... girls\nThey team tennis tournaments starts in Madison today Scott Wisconsin's radio network [laughter] [noise]\nIt's it's in men under the age of thirty five you know would really impressed is the\nThe ladies when the guy has a few drinks the leader gets pulled over for bus driving costs you around ten thousand dollars in fines legal fees and increased insurance rates there goes let's grab dinner in a movie now I Know you drive more carefully when you're bust\nYou've proven that hundreds of times in a woman in Myers that kind of confidence and you practice how to speak given company does pull you over slowly clearly them politely like good evening office or\nThe woman Myers that kind of force and one woman doesn't find in the door to move the ukulele buzz even though the law filled the drunk\nYou can get ten thousand dollars getting by along with any chance of having a girl because nothing says I'm a cat's more than a guy who lives in his parents' basement and comes it's my place\nBugged busted embroiled because bus driving is drunk driving a message from the national Highway Traffic Safety Administration and the ad council\nMoral ... can cause complications ... family did remind you to do your homework on what complications can develop before you get an oral piercing the possibilities in food allergic\nReactions bruising swelling tattered is simply to increase placard calculus can occur overtime jewelry could also costs to the ... consult Dr ab ab ab family dental and Fort Atkinson with any questions or concerns you may have before you decide to get an oral\nPiercing call nine to zero five six three to nine to eight today\nI'm Scott Hanson with NFL Network now on the west was won radio network\nVon Miller called it on Tuesday at the Broncos delivered on Thursday Night Football\nDenver's defense pouring two touchdowns recovering two phone calls and added three interceptions and six sacks a final from the desert forty five to ten over the Arizona Cardinals meanwhile the bears are hoping to have their defensive Wrecking Crew ready for the patriots\nCollege back on the injury report on friday he missed his second street practice with him right ankle injury Mac has never missed a game and his five year NFL career\nThe dolphins are being investigated for their handling of Ryan Tannehill shoulder injury last weekend\nAn injury that will cause the Miami Beach and missing second game in a row and coach Adams case telling reporters Thursday they are not looking as surgery as an option to suspend NFL Network now on me was one radio that [noise]\nThe IRS doesn't mess around if they want your money they'll take it they can take your paycheck and bank accounts to even threaten your home or business and it's about to get worse the IRS just tired an army of new tax enforcers so if you owe back\nTaxes smartest thing you can do is called optimal tax relief optimum has access to a special IRS tax assistance program called the fresh start initiative and their clients that qualifier\nSaving thousands even tens of thousands one call starts the process just up the demand letters stop aggressive collection actions and stop that army of new enforcers from targeting you but don't delay it's important to act now while you still have options stopped him I say rated with the better Business Bureau optimize already resolved over a half\nBillion dollars in tax for their clients get your life back call now for your free consultation\nCollege under three six four Ninety One eighty eight eight hundred three six four Ninety One eighty eight eight hundred three six four Ninety One eighty eight\nTop Democrats released [noise]\nSome restrictions apply for a complete details of the\nWhite Marmara ... Saturday it's homecoming and all of the game as the war hawks\nThis is getting ready to join the army that can be the one of six point five forty healthier pregame show starting at one forty four on football is brought to you by a forty one brew house in ... whitewater and buy from your bank in Jefferson\n... game show starting at one point were on the ball is brought to you by forty one room house and home or as you want to buy for the injunction rock and roll we got a call ... and I'm On a dime forty WNBA W. dot com [noise]\nWas ... years old at the top of my game and I got everything\nTo look forward to hold I got a question for you did you register with selective service you know give me a break hold those big plans you got to hold his big dreams forget of\nAbout it if you need student loans job training forget about it\nGovernment jobs forget about it if you're an Eighteen year old guy and you are not registered you can't even get your driver's license renewed in most states and you can become a citizen if you're an immigrant so he has to be the wall if you're at a computer takes like committed to get it done that as as as dot dot\nNo computer no excuses told her to post office ill out of selective service registration form and drop it in the mail done", "year": "2018", "show_name": "WFAW News", "city": "Fort Atkinson", "day": "19"}