{"month": "10", "state": "WI", "station": "WFAW", "content": "Or and healthcare is one of only a handful of hospitals in Wisconsin that has been designated friendly there are so focused on the continuum\nFrom green aid to burn [noise] nurses provide information about\nHow family members to help out around the house\nMean frankly there are several international board certified life on the\nShow you wonder how long term health benefits for breastfeeding from China and for the mother healthcare remind supporting\nBefore I'm through our nurses\nVideos online resources\nAt least visited Fort healthcare dog I'm all\nFor it you know like how\nDo you think community theater in the fall musical mentally title song single major Holly this will be held in the first United Methodist church in Fort Atkinson on\nOctober twenty six thirty pm Saturday after twenty seven ten to Fifteen dollars that the ten dollar online\nAnd you will fall will take place on Saturday after over twenty seven of Jefferson County one of the treaty vaccination sixty dollars given first come first served this Sunday Cambridge highest church on west water street\nAnd given a first come first served basis and this Sunday October twenty eighth Cambridge nights Columbus is hosting a pancake breakfast at St Pius church on west water street in Cambridge starting a nine thirty AM enjoy pancakes sausage eggs coffee milk and OJ for only five dollars to me it was for you to kids ages\nW. F. A. W. come the cap on there is also on line has nine forty W. W. dot com\nNine forty W. F. or you don't want you for not doing\n[noise]\nSharing tests and the president of turkey now falls the killing of a reporter in the consulate in Istanbul ferocious ABC's Tom rivers is that the foreign\n... he's president says Saudi officials started planning to murder ... days before his death in Saudi Arabia is sound bold constantly as to the Saudi team identified as having flown in shortly before the show ... death president ... through a translator saying the\nFifteen and Eighteen people should be and taken into a snake and to call it into a key it from the Turkish end international law\nHe says diplomatic immunity does not give cover for murder adding the Vienna Convention wouldn't allow it Tom rivers ABC News at the foreign best\nMexican officials drawing the line in the sand for the group of migrants still about Seventeen hundred miles from the U.S border ABC's Mack got been traveling with the group says they're all being told to accept asylum in Mexico or go back home\nHigh ranking members of the federal police say they they do not want a violent confrontation with these migrants they're very aware as as the entirety of Mexico and probably many parts of the world [noise] that there are families here there are thousands of women and children among this group\nPresident Trump stumping for an old adversary in Texas\nPresident Trump now saying he goes in beautiful to in Texas to admitting he and Senator Ted Cruz and differences but not any more\nThey got past [noise]\nAnd then ...\nAnd I'll tell you what nobody has helped me more\nPresident promising more jobs and tougher borders if Texas real looks to cruise to feel the ABC News\nRelease in Wisconsin now asking for two thousand volunteers to help and the search for missing Thirteen year old Jamie closet disappeared last Monday the same day her parents were found murdered in their home death of a sixty one year old New York woman vacationing a Club Med and the Turks and Caicos now being investigated as a murder\nYou're listening to ABC News\nHey I'm Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he was diagnosed with cancer\nStage four and here's the thing he had switched earlier from medical insurance to medical care where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work our medical bills\nExceeded a hundred and sixty thousand dollars met his share members shared\nAll our bells and it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you through the hardest times of your life I just don't know how I could have done it without them at a sure\nThere's a reason this is growing so fast so if you want to find out more here is a number for you star star three to four star star three to four messaging data rates may apply call star star three to four\nNorthern California judge has changed the ruling against the maker of the popular pesticide you know against\nThe jury awarded grounds ... Wayne Johnson two hundred and eighty nine million dollars in a landmark case the jury finding Monsanto's round up and ranger pro weed killer ... non Hodgkin's lymphoma\nMonsanto now owned by ... tried to get the verdict overturned by the judge is refusing on Monday saying the verdict against Monsanto remains in place\nThat there is enough evidence of the products contributed Johnson's cancer but the judge is reducing that two hundred and eighty nine million dollar verdict down to Seventy eight million dollars and like stoning eighty CNN\nSome new warnings about credit cards ahead of the holidays the holiday shopping season is just around the corner and credit card companies have a gift for customers higher interest\nRate not only did they just recently right they're expected to rise again and come December\nActually do with card rates dot com says now may be a good time to look for a new card with zero percent introductory right it's\nKind of like paying cash it in some kind of get a mind of interest free credit\nBut don't remind you to use that card wisely and to remember that net zero percent rate is eventually going to rise ... ABC News former\nPrices right votes Bob Barker reportedly in the hospital a spokesman tells USA Today the Ninety four year old is suffering from extreme back pain this is ABC News\nIt's time to time to join the millions of people that need happy with zoom video conferencing zoomed gives you flawless video crystal clear audio and instant sharing across any mobile tablet or desktop device but the best thing about them which is worse to ditch the distraction enjoying\nThe movement and happy with a new video conferencing visiting zoomed us to set up your free account today that zoom dot US zoom video conferencing I'm Sherry ... ABC News\nThis is Joe and counties news NPR nine forty do you ever you know you\nKnow you have a W morning news\nIt's currently thirty seven at six o five on your Tuesday our forecast another sunny day in southern Wisconsin by around fifty will get the full forecast for the weather I weather center company up in just a moment\nStands for it's a box of wonder if third straight to start with what he Eighteen twenty Nineteen season will have reactions from the new Pfizer form coming up\nBut first W. F. A. W. news in for Michael\n... this morning here's Jake Gerard good morning Jake good morning Gary the rat county medical examiner's department released the name of the woman who died in a two vehicle crash last friday Seventy four year old Marilyn Mitchell of melt in was pronounced dead shortly after she arrived at a local hospital\nThe incident happened in Janesville had Milton avenue and rest that drive it around eleven forty four AM preliminary results of the autopsy confirmed Mitchell died from injuries sustained in the crash Janesville police ... county medical examiner's department are still investigating the deaths\nOf Janesville woman was killed in a crash in ... county friday morning the rock county medical examiner's office said Monday that fifty year old Amanda Stewart Ryan\nDied after a single vehicle crash that was reported it at about six thirty AM the crash occurred in the four thousand block of West highway fourteen and the town of Janesville Ryan was taken to a local hospital where she was pronounced dead a short time after arrival according to officials\nAre hoping for as many as two thousand volunteers to help and the search for a Thirteen year old Wisconsin girl missing since her parents were killed in their home investigators believe Jamie costs was taken from her home near barren on October fifteenth\nHer parents had been shot to death tips led authorities to call for another ground search on Tuesday authorities are also seeking information on two vehicles that may have been traveling near the clause family's home on the ...\nHis led authorities to call for another ground search on Tuesday authorities are also seeking information on two vehicles that may have been traveling near the clause family's home on the night of the killings one that's a red or orange dodge challenger and the other as a black for an edge or black accurate M. D. X.\nMarion County sheriff Chris Fitzgerald called them vehicles of interests but did not elaborate authorities have released\nThe name of the sixty eight year old man who apparently drowned in a kayaking accident while duck hunting in western Wisconsin the cross county sheriff's office identifies the victim as Jim Schuster\nAuthorities say Schuster end is thirty four year old hunting partner were duck hunting while kayaking and all across the river near banger on Sunday gym shoes just kayak became entangled in a tree causing the kayak to tip and submerged\nHim a liquor\nStore employee and customer robbed at gunpoint early Sunday afternoon and the Dane County city of fish birds fish for police say officers were called that around twelve Fifteen pm to liquor town on Williamsburg way on reports of an armed robbery officers say man entered the store brand machine of silver semi automatic handgun and demanded money\nOfficers say a customer was also held at gunpoint during the robbery\nInvestigators say the man fled the store with an undisclosed amount of\nCash Madison police use to police started to attract the man but he has not been found\nBefore and after ...\nPlus for health care has restaurant quality food service twenty or some leaves visit healthcare dot com forward slash baby\nThe\nPeople there is a huge land auction coming up that you're not going to want to miss joined your friends from the seventies group for a large land auction of hickory hill farms in Jefferson County [noise] the three hundred and eighty five plus acres will be sold in ... selling free and clear for twenty nine feet this land auction will be held a neighbor's really pizza ... thirty first one PM\nMore and more information ... group and see a fool description and listening to ... group dot com that has the\n\nNovember is a big bond for ... family dental mark your janitors for these upcoming events on Saturday November ... look for the ... the Fort Atkinson\nLighted holiday parade as they hand out treats and toothbrushes then on friday November thirtieth ET family devil is showing their appreciation to veterans by providing a day a free dental care defense veterans please call nine to zero five\nSix three twenty nine twenty eight the schedule on the plane but prior to November thirtieth at ... family dental on Madison Avenue Fort Atkinson\nHe drove for [noise]\nOh you want to use for [noise]\nYeah and I signed a good liberal at thirty one points at Fifteen rebounds Chris mental ... late three quarters of the buck survived a theory a second half rally by\nNew York to hold off the next one twenty four to one Thirteen bucks coach Mike ... a\nLot of different guys are made big shots you know some passes that were pretty impressive and feel like everybody contributed all five guys on the court and when we're playing like that all five guys together that's when we're out our best\nMiddleton was sufficient in scoring thirty points going seven of aid from beyond the arc added global only add one three but it came at a big spot giving a beating Milwaukee the lead for good midway through the fourth period Tim heart away\nJunior led the next with twenty four points\nCans it starts with twenty Eighteen Nineteen season is the number one ranked team and the Associated Press top twenty five pre season basketball pool the J hawks earn thirty seven sixty five first place votes in results released yesterday Kentucky Jackson and number two followed by ... Duke and Virginia to round out the top five\nA jury in New York will continue deliberations today and the trial of three men charged with conspiring to cheat\nMajor college basketball programs by paying young athletes to sign with school sponsored by Adidas attorneys for the defendants say their clients broke NCA rules but no laws the scandal led to the firing of coach Rick Pitino and Louisville\nRemain Packers goes by McCarthy says he expects Aaron Rodgers to be a practice today Rogers wants to lose ... he's been wearing because that's a decision for the medical staff the Packers leave for Los Angeles on friday McCarthy said there's a reason why the rams are undefeated playing very\nWell for phase is I mean does is flowing into statistics and walk upon when they're doing you know the one in the film ... also scoring points and fill seven Sachs won't ... ... they're all all three phases or point well\nThe Dallas Cowboys have acquired Oakland receiver Omari Cooper for a first round draft pick raiders general manager Reggie McKenzie said Monday his team will get to pick in the twenty Nineteen draft last night Matt Ryan through a forty seven yard touchdown pass\nRaiders general manager Reggie McKenzie said Monday his team will get to pick in the twenty Nineteen drought last night Matt Ryan through a forty seven yard touchdown pass the Martin hall had been Coleman broke loose and thirty I'd run and the Atlanta Falcons beat the New York giants twenty three twenty\nForty nine twenty went over in Illinois has moved to Wisconsin Badgers up by three spots number twenty of this week's Associated Press football pool Wisconsin still is a good shot to defend its title the big ... conference west division the badgers bring up three in one conference record into Sunday's game at Northwestern Wildcats are foreign won Iowa and Purdue are tied with Wisconsin\nThe Wisconsin women's hockey team is back at the top of college hockey pull this week the badgers swept Princeton well top rank carts and spent the weekend series with St Lawrence shocking the Golden Knights out of the number one spot\nWisconsin held on to the top spot on the poll for Eighteen straight weeks last season this makes five straight seasons that the badgers has been at least some time ranked number one in the country\nAnd it's looking to be cold per game one of the world series but at least the red Sox and Dodgers will probably a boy and the rain forecast for tonight golf or the temperatures to be around fifty for the first pitch just after seven o'clock hour time it will go off during the game to the high for days there is a fifty fifty chance of rain during the afternoon but it is expected to pass\nBy game time and that sports you're on nine forty W. F. A. W. and I'm forty W. F. A. W. dot com\nWe have no rain in our forecast plenty of sunshine today high near fifty more the same tomorrow right now we're at thirty seven this morning with the light went makes you feel like thirty one W. F. A. W. news time it's six twenty three Thursday night\nIt's the cool one oh six point five you W whitewater quarterback club coaches show this is Gary Douglas joined me Thursday night at seven egg shells in Fort Atkinson I'll be joined by head coach Kevin Bush and assistant coaches and players it looked cool one oh six point five ... W whitewater quarterback let's go to show\nThis Thursday night at seven thousand Fort Atkinson on cool one oh six point five and nine forty W. W. dot com [noise]\nFrom all over you know the standard and Poor's ... has\nNow extended is losing streak to four days giving up twelve points on Monday the Dow Jones finish the session one hundred twenty seven points lower twenty five three Seventeen tech chairs lifted the NASDAQ Composite nearly twenty points to Seventy four sixty nine\nMarijuana stock suffered broad and sharp losses Monday despite early indications of strong demand full legalization in Canada appears to have taken the shine off the sector\nWatch for air fares to rise in two thousand Nineteen and you can blame it on cruise ships the cruise lines will switch to a cleaner burning diesel fuel next year to comply with new rules on emissions analysts say that could squeeze jet fuel prices which are already up forty percent this year\nRising mortgage rates in slowing home sales are expected to put a drag on the home remodeling industry next year Harvard University's Joint Center for housing studies says spending is expected to slow down throughout two thousand Nineteen generally an ABC News\nWednesday night night for DWI the devil you along with the Fort Atkinson Jefferson and Watertown chambers of commerce the daily Jefferson County union and the American association of university women will bring you a candidate debate or simply seats thirty three thirty eight and forty three the debate will begin at six thirty for the ...\nThe assembly candidates debate Wednesday evening at six thirty nine forty W W and nine forty W. W. dot com [noise]\nNine forty W. F. A. W. N. nine forty W. F. A. W. dot com\nPrimary leave with a brown field theory up the economist says the dairy industry is headed in the right direction for milk prices to improve next year mark Stevenson is the director at the center for Jerry profitability at the University of Wisconsin\nThe milk production growth is slowing stocks are getting pulled down more cleaning things a little bit and maybe we'll have some room I don't think for a major price increases and twenty Nineteen but maybe by the end of it\nHe says while the USDA's October milk production report was up slightly about Thirteen thousand cuts in the number of milk cows in the major producing states is good news Stevenson says the twenty five said spread recently between blocks in barrels has been tied to a decrease in processed cheese demand for millennials and an increase in overall cheese consumption\nBack in Nineteen Seventy we were just a little over Lebanon pounds per capita today we're about thirty seven pounds per capita that's a half a pound of cheese per person per year that we've increased consumption that's huge\nOr the other one point seven million pounds of cheese that whole milk powder is being exported from the U.S\nCooperatives working together that's a great deal with this twelve separate export deal the products are contracted for sale the buyers in Asia the middle east North Africa at Oceana between down April but dairy markets were doubt that the Chicago mercantile exchange Monday October class three meals a day or two cents to fifty fifty three\nNovember down eleven to Fifteen forty to December down died at Fifteen forty to January ... thirty three but bill futures from February through September range from zero to ... cents lower\nDry weight was down in a nickel to fifty two and a half per pound forty five blocks up three quarters of a sudden to one fifty and a half\nForty five blocks corrupt three quarters of a set the one fifty and a half\nBarrels we're down to three quarters that's at one twenty four great W butter was down four and a half to two Twenty one and a half now that Dr milk was down a quarter Seventy eighty seven I where he leave with the brown field dairy update\nLook around you this land is born this crime discount this car or disarming as you were growing\nSo when people say American family insurance protection thing [noise] we shake hands because we protected and you're insured\nDream fearless American family and\nAmerican family mutual insurance company as I entered operating company six thousand American Parker Madison, Wisconsin\nFor more than a hundred and Seventy years rape seat has been looking out for farmers we use our knowledge and expertise to help guide you through the ups and downs of life on the farm like when you wake up to find your livestock has started a rock band [laughter]\n\nOut you've got enough to worry about let us take care of your seat rank seat\nHi Scott Walker here\nUp in a small town and my mom grew up on a farm sign on the farming is more than a business it's a way of life\nSo that's going on at the white foster public library or tomorrow is near the many things that are going on lots of stuff going on that's for sure hey by the way we got a second here before we have to move on uh I Know you had a chance to get up to Jefferson over the weekend\nAt the Harry Potter fest or excuse well all I Apologize the formerly known Harry hotter faster warrior wizards that's a [laughter] sorry about that [laughter] um yeah no it was okay it was a good time I'm\nI'm a smoke with Scott Kramer there and we uh we got to cut from I'm there for the news the other day does it get any idea of a tendency for that ... you know I\nDidn't he didn't give me an exact number ... are based off of what I saw it was\nA decent amount of people there was a steady stream the the way I describe it it's none of the buildings were packed but there was a steady stream of people throughout the day I mean there was an orange people were coming in on the buses and some um which I think is pretty\nExcellent considering how crummy the weather will yeah in a bad ass Saturday was not a good man it was really bad so uh but fortunately everything was indoors which was nice those heated I'm sure a barn type buildings yeah um but yeah it was fun there is a\nPlenty of attractions my friend and I went and we checked out a bunch of stuff and it was it was a good\nTime what good congratulations on the another successful event in jeopardy ... I Know that they were planning\nI think they were planning at about forty thousand a year ago wind up getting about fifty thousand I had a little bit different situation a year ago because things were kind of spread out more throughout the city right as opposed to this year because of the weather having we have so much concentrated over at the county fair part\nRight right yeah and unfortunately the weather is a huge factor with events like that just because if it's not sunny and warm out everything's got to be indoors and um it just makes it tough yeah people yeah [laughter]\nYeah that's for sure yeah by the way a the a\nPrimary election day or not primary election general election days or two days two weeks from today\nOur coming up tomorrow night of course ah W. F. A. W. radio along with the the chamber's from Port Jefferson Watertown a you W and the daily union will be presenting another uh candidates debate this will be for the state assembly and its districts\nThirty three thirty eight forty three and we have a all six represent or else six\nCandidates they're a matter of fact I Believe uh thirty eight has the open sea that if I remember her thirty three or thirty but anyway that's coming up tomorrow evening six thirty at St Bernard ruin FCC you in a Jefferson and we'll have a live for if you can't make it up ... lives ram at six thirty\nRight here on nine forty W. F. A. W. N. online at nine forty W. W. dot com should be very interesting\nIt should be I'm looking forward to hearing what all the candidates had to say in a scene with the public has to say\nYeah very excited to because we were able to get all six candidates yeah which is nice to meet you too for each of those three seats\nAnd a word on the street is since uh Michael is currently out of commission that you're going to be a moderating\nThen that's the word the ... the word is well we'll see\nWe'll see how that goes yeah a little ...\n[laughter] you get a degree and care [laughter] [laughter]\nYeah that's right now I just need some question yeah give me some questions all together and I can handle that from their All right ah Jake it I'll be back in a couple of minutes you're on the W. W. morning news we're looking at some of these guys who they hire around fifty right now we're at thirty seven W. F. A. W. do stop at six forty ...\nIt's not a matter of if but a matter of when every athlete experiences pay me Dr shelter um worth a beating associates and sports medicine only add more to health care we take care of patients from\nThe weekend warrior to the elite athletes are all sorts of different joint problems and pains we come to a shared decision as to what is their best treatment whether that be\nSurgical or non surgical nurse Marti medicine program involves many different team members from nursing highly trained physical therapist to Moscow is called a radiologist we were to take good care of each individual\nOne procedure that I realized freeze your surgery the newer in time and time which is called the ... I didn't mean to you ... there's a lot for something and that leads back to their sport\nReliably and a little more comfortable in healthcare orthopedic associate sports medicine serving Fort Atkinson and surrounding community visit for healthcare dot com forward you know [noise]\n\nNovember is a big bond for ... family dental mark your janitors for these upcoming events on Saturday November ... look for the ... the Fort Atkinson\nLighted holiday parade as they had a treats and toothbrushes then on friday in November thirtieth ET family data showing their appreciation to veterans by providing a day a free dental care Tibet veterans please call nine to zero five\nSix three twenty nine twenty eight this scheduling appointments prior to November thirtieth at ... family dental on Madison Avenue Fort Atkinson\nNow than ever of origin office so he was\nAnd at ... family dental on Madison Avenue Fort Atkinson\nDowntown recording came on his show he was pope murdered in a ferocious manner presidents rich ... early ... speaking this morning and accusing a team from Saudi Arabia planning the killing for several days the\nInternational conscience will only be satisfied when everyone is held accountable ... and the person or the people who gave the instructions\nPresident Arab on also speaking talking why the body has not been found yet in southern Mexico\nMigrants now over seven thousand strong one company went continues its march through the U.S border\nMexican officials now say the migrants either have to accept asylum in Mexico or go back home and western part of Mexico bracing for hurricane will I expected to make landfall today as a category for storm\nI Believe in Wisconsin are expanding the search for Thirteen year old Jamie cloth now missing for more than a week the call has gone out for two thousand volunteers joined us search today cherry Preston ABC News\nThursday night it's a cool one oh six point five ... you'd have water quarterback club coaches show this is Douglas joined me Thursday night at seven eggshells in Fort Atkinson\nI'll be joined by head coach Kevin Willis and assistant coaches players it's cool one oh six point five whitewater quarterback or go to show this Thursday night at seven thousand Fort Atkinson\nOn cool one of six point five and nine forty WMA W. dot com [noise]\nIf you are and what do we go by we energy he we energy throughout the book is here did we energy that come to find a location near you we energy energy you can depend on\nThe bucks into their game of fourteen to three run last night to knock off the next one twenty\nFour one Thirteen advisor forum on bill Scott what sports you understood that a coupon thirty one Chris Middleton thirty to move the bucks two three and oh to start the season box to give up a Nineteen point halftime lead before the late run wanted to give\nCredit to New York they're they're playing really hard there well coach so they're making shots are playing well so far but it is you know credit for the next um but you know how can we be better and not put ourselves in that situation of Nineteen\nMike ... bucks which the Sixers tomorrow night Packers getting ready to take on the un beat rams in Los Angeles on Sunday they moved everything up a day will fly out to LA on friday instead of the normal Saturday traveled day no place for their next by games on the road defensive Bactrim on Williams says it's a tough schedule ahead but the focus is on Sunday\nThe stretching there now we can do by we've got to face all those things that we can do on that one time you know we can look ahead to next we can talk about Tom Brady right now you know is the rams you know we understand what's coming up but that dust off with the rams though that's what we're focused on Wisconsin\nDown the road this Saturday at northwest during the badgers or may nineteenth on this week's top twenty five coach's poll\nThere are three in one and trailer wild catching the Big Ten west by a half game more injury concerns for the badgers nose tackle our second polo status for Saturday's game is up in the air after you suffered electing ankle injury well being tackled after intercepting the passing the win over Illinois head coach Paul Chris\nBut he's making progress in ... will continue fighting on see the truth that was the older you know other than ... to it and see what happens as we progress as those guys you just hope that continues\n... World Series gets underway today I Boston Red Sox playing host to the LA Dodgers failed but he's the\nSaid some radio network one in three adults in America have pre diabetes but most don't know it to let people know it can be reverse before it becomes type two diabetes professional basketball player Julius Randall is doing everything in reverse\nAmong we don't care for the first one [noise] ... [noise]\nI don't recommend it\nIt's the reverse of [noise]\nAnd it took me months and learn how to speak in reverse like this\nYear than almost for diabetes types who was living in Mumbai\nIn other words my mom has been living with type two diabetes for almost ten years so together we want to say to the eighty four million Americans at risk exercise and healthy eating can help reverse pre diabetes starting about taking a simple one minute recess or do I have a pre diabetes dot org\n... pre diabetes awareness partners Betty\nEach day researchers making new discoveries they bring it closer to the moment when all cancer patients can become survivor [noise]\nSome day they take small other huge discoveries lead to a giant leap for this progress small steps and giant leap happening with the help of clinical trial\nClinical trials are fundamental path to progress and the brightest torch researchers have some light their way towards better too\nUnder long term health benefits of breastfeeding from child [noise] and for the mother board healthcare provides support and their families twenty four seven through our nurses\n... videos online resources animal\nPlease visit board healthcare dot com forward slash baby born over here for helping\n\nPeople there's a huge mind auction coming up that you're not going to want to miss you and your friends from the ... group for a large lead auction of hickory farms in Jefferson County the three hundred and eighty five plus years will be sold in five ... free and clear for twenty nine\nThis land auction will be held and neighbors grilling pizza on October thirty first one to him for more information contractors grew and see a fool description and listening\nTo ... group backup that's S T e M B. S. [noise] dot com [noise]\n[noise] I'm forty WMA W ...\nAnd online at nine forty W. N. dot com\n[noise]\nFrom Haiti teeny\nSherry passed in demand for answers from the president of turkey this morning of the\nDeath of reporter Jamal ... at the Saudi consulate in Istanbul ABC thing in panelists there he says president aired on laid out some of the facts and the case this morning\nThis as a team was sent in advance a he went on to say that the information so ... points to a ... perpetrated against a choking now interestingly he didn't offer any proof buddy but some of the claims that are being made to the media\nPresident ever to walk through a translator says\nFirst thing they do is to remove the hard disk and the camera system of the concert last night in the meantime a democracy monkey was telephone eleven days to come from his appointment on that day\nThe caravan of migrants marching through Mexico may be headed for a confrontation with Mexican police maybe she's met government is with the care of that now\nFifteen hundred miles to the nearest us border and so far Mexican authorities have allowed people to go through on the impeded by overnight the Mexican interior ministry saying it will be hand rounding people up unless they register for asylum but\nThe folks here say that asylum means deportation back to Honduras and that means we might see a confrontation in the days ahead\nPresident Trump campaigning for Senator Ted Cruz in Houston, Texas talking about immigration and cruises opponents Beto O'Rourke\nSays he's actually a radical open borders left wing or that's what\nPolice in Wisconsin looking for a pair of cars that could be connected to the disappearance of Thirteen year old Jamie cloth\nBaron county sheriff Chris Fitzgerald announcing the cars spotted on surveillance video near the home at the time Jimmy cost his parents were killed include a red or orange two thousand two thousand fourteen dodge challenger and a two thousand six to two thousand ten black board edge or two thousand four to\nTwenty ten black accurate and B acts ABC's Ryan Burl they're asking for thousands of volunteers today you're listening to ABC News okay\nTurn first in the morning it during the day\nMorning America America\nThe experience really from muscle cramps concern is used their works relief the fast acting boom has proven to prevent and relief button leg cramps gender works relief today and the pain relief violent Walmart CBS writing an Walgreens pharmacies for their works really dot com\nIt's time to time to join the millions of people that need happy with his view video conferencing who gives you flawless video crystal clear audio an instant sharing across any mobile tablet or desktop device but the best thing about two pitches worse to ditch the distraction enjoying\nThe movement and you can happy with zoom video conferencing zoomed us to set up your free account today that do die us do video conferencing\nNew accusations of torture being leveled against the Palestinians ABC start down a Miller is in Jerusalem with the story\nA two year study the human rights watch found the Palestinian authority and Hamas routinely used torture and arbitrary arrests to silence dissent by activists and political rivals the report includes interviews with a hundred and fifty Palestinians\nFrom the west bank and Gaza most ... detainees human rights watch says devious his could amount to a crime against humanity by the Palestinian authority who joined the un convention against torture when Palestine became a un non member state Giordano Miller ABC News Jerusalem\nHeld tonight tonight the drawing for the record one point six billion dollar mega millions jackpots across the country people heading to their local market convenience store or gas station to get their mega millions ticket Jose Reagan's in Maryland among them\nTotally crowded here I was able to sit here and get a ticket as fast as I was for\nThese players in California they're dreaming of debt payday\nHis work ... hours without money I'm\nHearing the world I'm going to retire the\nOdds of winning about one in three hundred million mark grandma lard ABC News I'm a big organizers in Tokyo have struck bronze they want to use recycled materials for all medals that are headed out my twenty twenty games now they say they have enough to make all the bronze medal but they only have about half as much gold and silver as they need\nThis is ABC News\nDo you owe more than ten thousand dollars in back taxes the IRS has special programs in place that could eliminate or reduce your tax dead by thousands of dollars for the call the ADA you can stop the wage garnishment levees in ... now\nThe IRS is currently accepting reduced settlements and other favorable programs you may qualify for a substantial savings to get the help you need if you owe the IRS ten thousand dollars or more coal ADA to see if you qualify eight hundred three eight zero five ten fifty five that's eight hundred eight zero five ten fifty five eight hundred eight zero five ten fifty five\nI'm Sherry Preston ABC News [noise]\nThis is Joe and counties news NPR nine forty do you ever you know you\nKnow you wherever you W morning news\nCurrently thirty six and seven oh five are forecast today another beautiful autumn day in southern Wisconsin plenty of sunshine high around fifty more of the same in store for tomorrow\nWe'll get more from Paul traveling when he joined just a few minutes here on nine forty W. W. W. up at sports books make it three in a row to start the new season as they knock off the New York Knicks last night we'll have details\nComing up WFAN uses half hour brought to you by Ford healthcare for help your house family help and community in for Michael close It's MORNING here's Jake Gerard morning Jake\nGood morning Gary the rat county medical examiner's department released the name of the woman who died in a two vehicle crash last friday Seventy four year old Marilyn Mitchell ah Milton was pronounced dead shortly after she arrived at a local hospital\nThe incident happened in Janesville had Milton avenue address that drive it around eleven forty four AM preliminary results of the autopsy confirmed Mitchell died from injuries sustained in the crash Janesville police in ... county medical examiner's department are still investigating the deaths more news\nThe birthing center at Fort healthcare is the best choice doctors and nurses are the Ford healthcare great expectations birth ...\nThe birthing center at Fort healthcare is the best choice doctors and nurses at the Fort healthcare great expectations birthing center\nFort Memorial Hospital in Fort Atkinson are specially trained to care for prenatal visit [noise] routine at high risk pregnancies labor and delivery plus post part of me [noise]\nFor health care has been designated that baby friendly facility one of only a handful in the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience [noise] you can enjoy all the comforts of home starting with the ... private sweet experience the hydro therapy\n[noise] before and after ...\nPlus for health care has restaurant quality food service twenty four seven [noise] please visit for healthcare dot com forward slash being [noise]\n\nTo a ... a woman was killed in a crash in rock county friday morning there are county medical examiner's office said Monday that fifty year old Amanda Stewart Ryan died after a single vehicle crash that was a report it at about six thirty AM\nThe crash occurred in the four thousand block of West highway fourteen in the town of Janesville Ryan was taken to a hospital where she was pronounced dead a short time after arrival officials say\nAuthorities are hoping for as many as two thousand volunteers to help in the search for a Thirteen year old Wisconsin girl missing since her parents were killed in their home investigators believe Jamie clause was taken from her home near barren on October fifteenth her parents had been shot to death\nTips led authorities to call for another ground search on Tuesday authorities are also seeking information on two vehicles that may have been traveling you're the clause family's home on the night of the killings one is a red or orange dodge challenger and the other is a black Ford Edge or black accurate and the acts\nBearing county sheriff Chris Fitzgerald called them vehicles of interest but did not elaborate\nAuthorities have released the name of a sixty eight year old man who apparently drowned in a kayaking accident while duck hunting in western Wisconsin the lacrosse county sheriff's office identifies the victim as Jim Schuster authorities say Schuster and his thirty four year old hunting partner were duck hunting while kayaking and all across the river and near banger on Sunday\nGym shoes just kayak became entangled in a tree causing the kayak to tape and submerged him\nA liquor store employee and customer were robbed at gunpoint early Sunday afternoon and the Dane County city of Pittsburgh Pittsburgh Police say officers were called at around twelve Fifteen pm to liquor talent on Williamsburg way on reports of an armed robbery\nOfficers say a man entered the store brandishing a silver semi automatic handgun and demanded money officers say customers also held at gunpoint during the robbery investigators say the man fled the store with an undisclosed amount of cash Madison police used a police dog to attract a man but he has not been found\nReally and probability or ... or so that it really is the area of mathematics I find intriguing\nUnderstandable a useful or buy a theoretical mathematics ... algebra is a challenge here's the problem we're at times I think\nNot given enough emphasis to that not only in our schools but at times in our families and the advantages that come from studies like that which affect the ability of the person to see a rise\nAnd apply in ways that uh help them and many other places is a loss for our society and so you know any way that we can increase that kind of education including the need for more teachers\nWho can teach high level mathematics and a mix a heck of a difference and so it is something we should be alarmed yeah\nBy the way the average score on the ACT math has dropped to its lowest level in Twenty years twenty point five on the scale of one to thirty six American students scored Twenty one point one and twenty twelve and twenty point seven a year ago system that I put it in perspective\nAnd don't know if you have it Gary but I assume that there are some other countries in which the students who are much higher and good being that again is usually due to the emphasis given often in some of the Asian countries\nNow that's true All right that they're going to be back with us in a couple of minutes we'll talk about a topic that that was going to be discussed later today and we'll also find out more about our forecast that comes up for the moment as well W. F. A. W. news time is seven\n\nNovember is a big bond for ... family dental mark your candidates for these upcoming events on Saturday in November ...\nLook for the ... the Fort Atkinson lighted holiday parade as they had a treats and toothbrushes then on friday November thirtieth ET family data showing their appreciation to veterans by providing a day a free dental care to best\nAs they had a treats and toothbrushes then on friday November thirtieth ET family data showing their appreciation of veterans by providing a day a free dental care to vet veterans please call nine to zero five\nSix three twenty nine twenty eight this scheduling appointments prior to November thirtieth and ... family dental on Madison Avenue ...\nFrom news wall now this Saturday Moore's five hundred has now extended is losing\nStreak to four days giving up twelve points on Monday\nThe Dow Jones finish the session one hundred twenty seven points lower uh twenty five three Seventeen tech chairs lifted the NASDAQ Composite nearly twenty points to Seventy four sixty nine\nMarijuana stock suffered broaden sharp losses Monday despite early indications of strong demand full legalization in Canada appears to have taken the shine off the sector\nWatch for air fares to rise in two thousand Nineteen and you can blame it on cruise ships the cruise lines will switch to a cleaner burning diesel fuel next year to comply with new rules on emissions analysts say that could squeeze jet fuel prices which are already up forty percent this year\nRising mortgage rates in slowing home sales are expected to put a drag on the home remodeling industry next year Harvard University's Joint Center for housing studies says spending is expected to slow down throughout two thousand Nineteen generally an ABC News\nSomebody with a W news time seven twenty to our forecast this morning with Paul ... from the weather I weather center and Paul we've got a string of a couple of really nice days coming up here in southern Wisconsin\nJoined a few more days here for just below average here but not too bad off here at that high temperature today around with a way that our quest five range tonight clearance guy laying around thirty one\nWith a light northwest and the outlook in a way out and about it with a light northeast when throughout Wednesday night for thirty increasing cloud still they noticed on with the highest do about\nThat friday and Saturday in the rain showers hospital both don't and I can say with a higher than the upper forties route taken a threat to the weekend probably\nYou know beat to be just a little bit below normal is awfully nice considering er about twenty degrees below normal last week\nDoesn't feel bad after about the fact that like over\nAbsolutely Paul thanks a lot will talk again tomorrow morning\nAlright that's Paul ... from the weather I weather center this morning here on nine forty W. F. A. W. right now in southern Wisconsin we wins out of the northwest today to occur in temperature thirty six makes it feel like twenty nine here a dime forty W. F. A. W. and nine forty W. F. A. W. dot com news time years seven twenty four and as we've been talking about uh\nWe've had to do a little bit of program juggling here ah\nDid you ah compensate for some uh situations we're dealing with right now but I asked ... even if he would come in a little early for us this morning or because they were scheduled to be on MORNING magazine which we're going to preempt today a but Dick I Know you had a very interesting topic that you were going to talk of talk about and hopefully we'll be able to reschedule that come up short coming up shortly\nYeah we really are are Michael I we're looking forward to this topic it's one that I discovered when I read a a op ed piece in the New York times David Brooks David Brooks if you don't know him as one of the leading conservative columnist in the country and he wrote a piece about research study by a group\nCalled more income and and the research study is called hidden tribes and hidden tribes look uh their research it broke out the United states in a way that showed a couple of different aspects\nOne is that this ... that we have more in common than we think that although we do have differences of opinions about most everything in life and especially politics we have a lot more income and but what he found was that what this study found was that the extremes\nYou find the loudest voices and in this case they discovered that those the loudest voices were often rich white guys\nAll right and so on the far left ... left about eight percent of the population mix up that group on the far right\nOf six percent of the population is a very extreme conservatives they're very wealthy they're better educated more wealthy than the general population there are much more focus on politics and their funding a lot of what we see on television\nAnd so David Brooks said well we've got going on is a civil war between rich white guys [laughter] and in a sense when we look at the television commercials and the attempt to influence elections that to their ... that that's who's funding it and we know some of the names of those books\nYou know and their ... their study was trying to reinforce that when we talk about regular folks who are most of us running around this planet in this country we don't fit into that a description but we also don't spend as much time\nFocus on some of these issues and we're not as ideological and some of these other folks on the extremes\nAnd so we want to talk with the the researcher hid researcher I'm more in common about this study and its implications for us and and and how do we deal with this knowledge you know one of the great attributes of of solid research is that we learn more about ourselves\nAnd I think it's also a very important that we realize\nThat we do have more income and then we can have differences about whether we support this candidate or that candidate or this policy of that policy but in the end there's a lot more going on and maybe we find ways to work together rather than separated ourselves and refusing to talk\nYou know we don't have a whole lot of time here but I remember that a number of presidential candidates are in the past jak would you know be on one side or another but by the time they got their nomination and the general election we brought around they all became more moderate right to try to hit that middle ground that you were talking\nIt was All right and now we're starting to see a we have been seen a less of that mhm especially with President Trump or who you know has pretty well stayed where he was in the election\nIs not moderated that much and we're seeing more of that and that's part of the dilemma we're in right now is it both parties have been pulled to the extremes\nSometimes by the advertising by the rich white guys\nBut also by others and uh those uh silos is I call them you know everybody's getting their own silo and the last thing they wanted to do is in any way interact with those other guys well when we started doing that too much\nWe then have lots of problems and um uh when I speak to the rotary today at noon and whitewater I'll be talking about\nSome aspects of this and on Thursday I have another lunch in speech\nThis to the Methodist Church in whitewater and I'll be talking about what can we do to change the the the atmosphere in our politics in our society there's so much going on year and I think this research project and Michael and I we're looking forward to it and we'll reschedule it a different time\nWill give us a chance to to dig deeper into some of the reasons\nThis research project and Michael I we're looking forward to it and we'll reschedule lives in a different time will give us a chance to dig deeper into some of the reasons we're having so much trouble just talking to each other about politics yeah isn't that amazing it really is\nAnd as a Dick mantra burger into effort to try to reschedule that I'm hopefully in the near future\nYeah well I think we will we will will will get something worked out and you can get Michael set up in his hospital [laughter]\nMaybe get this guy working therefore we're young like that if it doesn't interfere interfere with all the monitoring and so on and so forth well thank you for that I appreciate your insight on that and we'll talk more about that little bit later on\nA Jake is standing by he's filling in for Michael this week he has the latest in the W. F. A. W. newsroom coming up our forecast today sunny skies high around fifty more the same tomorrow as well\nNow we're at thirty six this morning W. F. A. W. news time is seven twenty ...\nIs ah the crab trees the crab trees in may the ...\nThe official tree of Fort Atkinson did you know that you were born and raised here in Fort Atkinson\nI did not know that I'm Sorry to say are these\nCrab fisheries actually in Fort Atkinson\nYeah and I think this I Want to say this is in front\nOf NASCAR I think if you look they're Dick I think it's a you know I think it's an older I think it's an older picture of Nashville before they did all their remodeling out I'm a Janesville evidence here but I think ah 'cause like if you look in there you can see the flagpole right in the middle there right now and that's a good guess yeah\nAnd then uh let's see here either that or it's a McCoy part one of the two I I I'm not sure which one\nAnd then the other one other birthday that we have today is from Port is well it's ...\n... and uh this picture is certainly not from Fort Atkinson [laughter] a pair zebras\nUh looks like a a mom and her full maybe a anyway I'm from the Lincoln Park zoo in Chicago that's right mhm so when you're here that's not in Fort Atkinson\n[laughter] and then what is the one zebra or have some like pigmentation\nYeah so what is your traditional a black and white ... and then the I don't know if it's a fork half what whatever you call the offspring or looks like it's almost orange but I don't know if that's just the sunlight on it or not I could be what happens\nWhen they're young and then they're available\nAfter they develop ... species ... uh you want to pick one day\nAll right [laughter] that's how we have passed the cards around everybody in the studio this morning and somebody's gonna come up with the winter and the winner is Suzanne McKechnie\nOf Fort Atkinson so happy birthday and congratulations Suzanne as though we will send you out of should typically the male good for six inside but subway All right uh just a handful of birthdays to talk about today or one of which is soccer great pay late ... from the seventies and sixties how old are you think pale a\nMan I'm going to say on the sea sixty\nA little bit older than that Seventy eight okay yeah ...\nIt's interesting I didn't realize how young he was when he first mhm late in the Olympics and on the Brazilian team he made a film about his life\nAnd you can see him and his ... it it's a worth watching ... partly for the actual scenes he does appear in the film not as themselves\nBut he does appear in a in a cameo but it's it's an interesting film and especially about the character of the Brazilian team and the problems between those who are of European heritage and Brazil\nAnd then those who are of native here at like ... and then of course of that first grade Olympic ... a victory\nFor his team when he was so young yeah so it's worth watching uh just to see that\nInteresting concept making a cameo in a film about you as a producer is that's right ah speaking of producing weird ... of celebrating the birthday today here it's the only nine years old today\nJust got his start in the Hollywood walk of nudity yeah All right just this uh the Syria did\nStuff after a Ryan Reynolds he is forty two years old today\nTV personality Meghan McCain who's currently on the view and of course the daughter of a former the late Senator John McCain is a thirty four years old today and I've thought of this one out here because uh I don't know if they're going to do this one I'm sure Jake well I did not know it but ... thanks to research I know that immediate Clark\nIs thirty two years old and she said oh sure at away 'cause I knew right away game of Thrones yeah it sounds rather\nI Know that immediate Clark is thirty two years old and she said oh sure either way 'cause I knew right away game of Thrones yeah owns rather [noise] so yeah that's right ... to thirty two yeah\nAnd I thought game of Thrones was about what's going on and saw the rent [laughter]\nThat's that's the other version of it so anyway so those are the birthday winters that we have today but to congratulations going out to Suzanne they kicked me of Fort Atkinson she is our subway where the winner of the day now if your birthday is coming up let us do about it since you name address and birth it on a postcard of ...\nFor for the Atkins in five three five three eight [noise] makes you\nGet it to us at least a couple of weeks in advance so we have it in time for a drawing these include you're correct mailing address one birthday proposed Scott I'm pleased with the birth date on the car [noise] I'll be back with sports after this WFAN W [noise]\n\nNovember is a big bond for ... family dental mark your candidate for these upcoming events on Saturday\nNovember ... look for the ... staff of the Fort Atkinson\nLighted holiday parade as they had a tree toothbrushes then on friday November thirtieth ... family data showing their appreciation the veterans by providing a day a free dental care divest\nVeterans please call nine to zero five six three twenty nine twenty eight to schedule on the plane but prior to November thirtieth at ... family dental on Madison Avenue Fort Atkinson [noise]\nThe birthing center at Fort healthcare is the best choice doctors and nurses and afford healthcare great expectations birthing center\nFort Memorial Hospital in Fort Atkinson are specially trained to care for prenatal visit [noise] routine at high risk pregnancies labor and delivery\nPlus post part of me [noise]\nFor health care has been designated up baby friendly facility one of only a handful in the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience [noise] you can enjoy all the comforts of home starting with his spacious privates we experienced the hydro therapy\nBefore and after ... plus Ford healthcare has restaurant quality food service twenty four seven [noise]\nPlease visit ward healthcare dot com forward slash [noise] for health care\nHer [noise]\nAnd I tell you what do you use for it [noise]\n... about thirty one point to Fifteen rebounds Chris Middleton sank a pair of late three quarters of the buck survived a theory a second half rally by the next to hold off the York one twenty four one Thirteen bucks coach Mike ... a lot\nOf different guys are made big shots you know some passes that were pretty impressive and feel like everybody contributed all five guys on the court and when we're playing like that all five guys together that's when we're at our best\nMiddleton was sufficient in scoring thirty points going seven of April beyond the yard\nYeah and I had only one three but it came at a big spot giving and beat in Milwaukee the lead for good midway through the port period time how do we junior Leatherneck see at twenty four cans it starts to twenty Eighteen Nineteen season as the number one ranked team and the Associated Press top twenty five pre season basketball pool\nJay hawk CERN thirty seven sixty five first placed votes and released to the poll Monday\nA Kentucky jak suited number two ... at Duke and Virginia rounding out the top five\nA jury in New York will continue deliberations today in the trial of three men charged with conspiring to cheat major college basketball programs by paying athletes to sign with school sponsored by Adidas attorneys for the defendants say their clients broke NCA rules but no laws the scandal but the firing your coach Rick Pitino at Louisville\nGreen Bay Packers coach Mike ... says he expects Aaron Rodgers to practice today Rogers wants to lose the knee brace that he's been wearing but\nAt that as a decision for the medical staff the Packers elite from Los Angeles on friday McCarthy says there's a reason right now why the rams are undefeated lander\nAll through phases I mean does is loaded the statistics and when I Walk upon when they're doing you know the one in the film ... also scoring points and\nFill seven Sachs won't ... ... they're all all three phases are playing well\nThe Dallas Cowboys have acquired Oakland receiver a mark Cooper for first round draft pick raiders GM Reggie McKenzie said Monday his team will get to pick in the twenty Nineteen draft\nLast I met Ryan through a forty seven yard touchdown pass the ... hall seven Coleman broke loose on a thirty yard scoring run out of the Atlanta Falcons beat the New York giants twenty three twenty forty nine twenty went over to Illinois has moved the badgers up by three spots number twenty in this week's Associated Press football\nWisconsin still is a good shot to defend it sat on the Big Ten conference west division the badgers bringing three in one conference record in Saturday's game at Northwestern Wildcats are foreign won Iowa and Purdue are also tied with Wisconsin\nThe Wisconsin women's hockey team is back at the top of college hockey pull this week the badgers swept Princeton well top ranked Clark since for the weekend series with St Lawrence knocking the green nights out of the number one spot Wisconsin held on to the top spot in the pool for Eighteen straight weeks last season\nAs makes five straight seasons at the badgers has been at least some time ranked number one in the country and it's looking to be called ... one of the world series but at least the red Sox and Dodgers will probably avoid the rain forecast for tonight call for temperatures to be around fifty for the first pitch at seven or nine local time or central time\nOr it will be cool off during the game to in the high forties there is a fifty fifty chance during the afternoon of rain but it's expected to a\nLot of the area by game time\nAnd that sports this morning here on nine forty W. F. A. W. N. nine forty W. F. A. W. dot com\nNo rain in our forecasts at least for the next couple of days sunshine today and tomorrow high both days around fifty year next chance of rain maybe late on Thursday or into friday wins out of the northwest that ate our current temperature thirty six makes it feel like twenty nine this morning\nAt nine forty W. F. A. W. we'll get an update from ABC News coming up at the moment W. F. A. W. news time seven forty eight\n[noise] get the latest from limbo on the titles Honda reports this is Wisconsin radio networks for ... Scott joined me every Monday through friday at age twenty in the morning and five twenty in the evenings I'm nine forty W. F. A. W. for your connection to the Packers on the titles on a report\nTitled report is drawn to you by Deerfield pistol naturally in downtown Deerfield and by premier banks in Jefferson rocking while we're counties nine forty W. F. A. W. [noise]\n[noise]\nSee entertainment news on the train ride to pregnant and Amy Schumer is going to be voting for choose the actress and comedian made the pregnancy announcement on Instagram and tied it to a get out the vote campaign this will be baby number one for her husband Chris Fisher they married in February Drake takes on the Beatles with his latest ... record now is the most billboard hot one hundred\nSingles charts top cans in one year twelve\nYou was tied with the Beatles number twelve comes with drinking\nA featured artist on bad bunnies MIA which they do to number five will have to wait a little longer\nFor the Wonder Woman sequel Wonder Woman Nineteen eighty four pushback from November of next year to June twenty twenty Warner Brothers has the switch to take advantage of a summer day\nThe Oscars found the producers getting bigger springs or Donna ... will produce for the first time with Glenn whites ... producing he's the guy who proposed to his girlfriend at the Emmy this year now they just need to name a host spend the money and I will name you want them to the new game of Thrones store clerk turn thirty two today I'm Jason ... and\nYeah I Wonder what would happen if a former state representative who's a medical\nGot his own radio show\nTo know more listen to stuck in the middle with anti drug and so that every weekday afternoon from three in July ... W W can be a part of the program and to me to be stuck with anti talk politics movie reviews are pretty much whatever is making news\nThat stuck in the middle with any Jorgensen live stream of show and listen to cast a nine forty\nF a W nine forty WMA W worn out games\nOnline at nine forty W. N. dot com [noise]\n[noise]\n[noise]\nI'm Sherry ranked in Turkey's president laying out what he knows and the death of a reporter at the consulate in Istanbul\nThe information and the evidence that we have so far collected [noise] indicates that John ... was slain in a vicious violent under\nPresident air to walk through a translator this morning says a team of southeast planned the attack for\nDays ABC's Ian panel isn't it simple\nYeah the the suspect we sent to to close my suggestion is to have these Eighteen people to be investigated in coal here now that was a request north a demand crucially\nHe did not directly criticize the Saudi king pull the crown prince or indeed they're recounting of events and he did not blame them either\nIn southern Mexico the caravan of migrants now growing too about seven\nThousand caring Trevor says President Trump has been talking about the caravan on the campaign trail as\nHe rallies Republican voters over the final sprint to election day President Trump is making false claims and talking about that caravan of migrants in Mexico the president said this Monday Night in Texas\nDemocrats had something to do with it and now they're saying I think we made a big mistake because people are seeing how bad it is how pathetic it is\nBut there is no evidence that Democrats or anyone paid the several thousand migrants can make a dangerous journey north heron cameras ABC News the White House search\nFor a missing Wisconsin teenager Jamie cloth gone since your parents were killed is ramping up\nTwo thousand volunteers will search or rural area Baron county for any evidence that may be connected with the case they're telling volunteers to be prepared to walk on an uneven terrain and to dress warm investigators announcing Monday they're looking for to be a ... spotted a camera that may have been near the home at the time of the murders\nAnd you see is Ryan Pearl the death of a New York all my vacation at Club Med and the Turks and Caicos now being looked into as a murder you're listening to ABC News or\nYou more than ten thousand dollars in debt feel like you're on a never ending treadmill sing in one place and never getting ahead with those minimum payments you feel like there's no\nWay out don't let the credit card companies bully you any more there are programs in place to help you get free of your debt\nAnd you don't have to pay the entire amount you owe the program a total financial freedom can help you get dead free and months instead of decades get off the debt treadmill and stop the harassment\nGet free of credit card debt signature loan department store cards Internet loans and medical bills call now at eight six six eight four four Seventy three forty four for free information for about ten years total financial freedom has helped\nThousands they're a plus raided by the better Business Bureau to get off the endless cycle without having to declare bankruptcy you'll have the right to settle your debt for a mere fraction of what you owe called total financial now\nAt eight six six eight four four Seventy three forty four\nThat's eight six six eight four four Seventy three forty four\nHurricane will is about to make landfall in Mexico's west coast is a powerful category for store maybe the chief meteorologist ginger Xie says over the next few days it'll blitz across Mexico and hit parts of Texas already dealing with heavy flooding and won't\nBe when anymore just rain with a little trial that kind of and bring up to four inches not just in Texas but other than that and it says that they had floods\nIn central Texas have been blamed for at least it to death but he's in the Dallas area are hunting for a road rage attacker who pulled out a gun ABC Jim Ryan has that story\nOn a crowded the interstate twenty in Arlington between Dallas and Fort Worth an SUV you had a car involved in a minor accident the driver of the SUV got out and charged toward the other vehicle the victim rolled his window down\nThat's when the suspect produced a hand gun says Arlington police lieutenant Chris cook the wife in the car began screaming asking don't shoot please don't we have kids\nThat's when the suspect produced a handgun says Arlington police lieutenant Chris cook the wife in the car began screaming asking don't shoot please don't we have kids in their car and the suspect fired one round striking our victim and\nBefore driving away the victim had a grazing wound to the head that is expected to be OK\nGenerally an ABC News Dallas\nBMW now recalling one point six million cars around the world and they fear instead of fluidly could conjure fire no injuries have been reported the recall affects our fifty thousand cars that were sold here in North America\nAnd just branch over the sea is opening up today on the other side of the world that connects Hong Kong to the Chinese mainland stretches thirty five miles isn't ABC News\nDo you owe more than ten thousand dollars in back taxes the IRS at special programs in place that could eliminate or reduce or tax that by thousands of dollars for the call to a TA you can stop the wage garnishment levees and tax\nLiens now the IRS is currently accepting reduced settlements and other favorable programs you may qualify for substantial savings so get the help you need if you owe the IRS ten thousand dollars or more coal eighty eight if the if you qualify eight hundred eight zero five ten fifty five that's eight hundred eight zero five ten fifty five eight hundred eight zero five ten fifty five\nI'm Sherry ... ABC News\nIs some counties news nine forty W. W.\nW. W. morning news\nIt's thirty six and eight oh five are forecast today plenty of sunshine higher around fifty will get more from the weather I whether centered coming up in just a couple of minutes in sports the bucks had an IT point lead almost let it slip away but they pick up their third one of the season [noise] we'll have details coming up\nTime now for W. F. A. W. news in for Michael ... here's Jake\nGerard good morning Jake morning Gary the rat county medical examiner's department released the name of the woman who died in a two vehicle crash last friday Seventy four year old Marilyn Mitchell of Milton was pronounced dead shortly after she arrived at a local hospital the incident happened in Janesville at\nMilton avenue and wraps that drive that around eleven forty four AM preliminary results of the autopsy confirm Mitchell died from injuries sustained in the crash Janesville police in ... county medical examiner's department are still investigating the deaths more news after the\nUh Janesville woman was killed in a crash in rock county friday morning the route county medical examiner's office said Monday that fifty year old Amanda Stewart Ryan died after a single vehicle crash that was reported that about six thirty AM\nThe crash occurred in the four thousand block of West highway fourteen and the town of Janesville Rhein was taken to a local hospital where she was pronounced dead a short time after arrival according to officials\nAuthorities are hoping for as many as two thousand volunteers to help and the search for a Thirteen year old girl\nMissing in Wisconsin since her parents were killed in their home investigators believe Jamie clause was taken from her home near barren on October Fifteen her parents had been shot to death tips led authorities to call for another ground search on Tuesday\nAuthorities are also seeking information on two vehicles that may have been traveling near the cloth family's home on the night of the killings one is a red or orange dodge challenger and the other is a black Ford Edge or black accurate empty acts Marion County sheriff Chris Fitzgerald called them vehicles of interest but did not elaborate\nAuthorities have released the name of a sixty eight year old man who apparently drowned in a kayak an accident while duck hunting in western Wisconsin the lacrosse county sheriff's office identifies the victim as Jim Schuster authorities say Schuster end is thirty four year old hunting partner were duck hunting while kayaking in little across the river near banger on Sunday\nGym shoes just kayak became entangled in a tree causing the kayak to tip and some merge him\nA liquor store employee and customers were robbed at gunpoint early Sunday afternoon in a Dane County city of Pittsburgh Pittsburgh Police say officers recall that around twelve Fifteen pm to liquor town of Williamsburg way on reports of an armed robbery\nOfficers say a man entered the store brandishing a silver semi automatic handgun and demanded money officers say a customer who was also held at gunpoint during the robbery investigators say demand fled the store with an undisclosed amount of cash Madison police used a police dog detract demand but he has not\nBeen found there we're seeing\nCounty sheriff's officers applauding deputies after they saved a suicidal man's life sheriff say deputies used a tourniquet to stabilize a Nineteen year old from the town of Norway who cut his wrists early on Sunday show U.S officials say all deputies are trained in how to perform emergency medical procedures including the use of tourniquets\nThink we'll leave that alone All right let's get through our day and history thank you there are today is Tuesday the twenty third day of October two hundred and Ninety six day of Tony Eighteen which would mean there are sixty nine days left in this year\nI was on this day in Seventeen oh seven that the first parliament of Great Britain created by the accent union between England and\nScotland held their first meeting no interest in ... I don't think England and Scotland getting along right now and they don't have any long since that meeting yeah that's right ah this is a very interesting Nineteen Fifteen tens of thousands of women paraded up Fifth Avenue in New York City they demanded the right to vote\nYou know a struggle began back in the Eighteen thirties and they would take until Nineteen twenty when the amendment would be passed and they would be able to vote in the ... as a nation in the first in in a presidential election in certain states like New York they had been allowed to vote before that\n... it was on this day in Nineteen forty one that the Disney film Dumbo was released on this day uh let's see what else happened in Nineteen forty two during World War two written launched a major offensive against access forces in Egypt resulting in\nAn allied victory on this day\nYou know that uh that campaign actually was the uh allies first campaign\nWhere there was a landing in Africa and they decided to go into North Africa rather than going into either France or Italy and that was very controversial stone wasn't happy but uh the Americans were ready and this would be their test case mhm\nOr two years later in Nineteen forty four of the world war two battle of lake tea golf began resulting in a major allied victory against Japanese forces\nThat famous photo of general Douglas MacArthur waiting as shore and keeping his promise to return to the Philippines was taken\nAt that time or the general was waiting the largest naval battle ever was beginning the battle was an epic between the Japanese imperial navy and combined us an Australian forces that bought in four separate engagements near the\nIslands of late T some are and lose on between October twenty thirty twenty sixth of Nineteen forty four both\nOn land and sea Japan last decisively its air force and navy were hobbled into battles and became and capable of presenting a serious threat to allied forces and without control of the Philippines the Japanese were denied access to the oil feeds I'll be Indonesia and the lifeblood of the Japanese war effort\nAnd a lot of time in planning went into stage in that photo of\nHim getting off the boat [laughter] [laughter] that's for sure you know they were probably more a photographers there than there were actual uh troops at that time [laughter] oh let's\nSee here in a continuing on in our day in history it was on this day in Nineteen sixty two that\nA twelve year old named little Stevie Wonder recorded his first single for Motown Records it was called thank you for loving me all the way\nRight cause your band play that uh we don't play that we might be able to work then okay in a catalog\nAnd and you know what is it about little Stevie Wonder little Richard you know there's something about the concept either of youth are little yeah well\nThat's for sure uh Nineteen Seventy three very significant day in presidential politics Richard Nixon agreed to turn over the White House tape recordings subpoenaed by Watergate special prosecutor judge John J. ...\nYeah of course was a result of the dream court decision which was unanimous who said you got to do that yeah\nMhm and that's what we found out about Seventeen missing minutes well\nYou know that's right if you've got to understand that his secretary had to put one foot here and another arm over there and it's you know the answer to the phones and by golly it just go to ... to\n... sometimes mistakes happen you know you just\nHelen woods was that I think it might have been yeah I Believe her name was amazing how you remember certain names all history again something with three o'clock in the morning of a Nineteen\nEighty four musician Bob guild off watched a documentary on the BBC about Ethiopia spam and he was so moved called his friend it made your and together they wrote the charity song do they know it's Chris\nWhich has become a standard it's wish I had that reaction when I watch documentaries I usually just watch another one 'cause they're hundreds of ... [laughter] are you looking for song inspirations is that what you're yeah I mean yeah maybe that's maybe I should channeled documentaries into the songwriting\nNow there you go Nineteen Ninety five a jury in Houston convicted or your land to solve our of murdering a piano singer star Selena a salad are serving a life prison sentence in two thousand and one of the nation's anthrax scare hit the White House with the discovery of a small concentration of spores at an offsite mail processing center\nAnd finally understand two thousand six former Enron CEO Jeffrey Skilling was sentenced by a federal judge in Houston to twenty four years four months for his role in the company's collapse eventually ten years was cut off skillings prison sentence and he was released to a halfway house in August of this year\nAnd then you might remember the ... is the brother of of then weather man in Milwaukee\nI didn't know that yes okay so there was a Wisconsin connection wow I didn't realize that interesting of course the new ballpark and Houston was Enron Field when it first opened up and while\nThat quickly just yeah it interesting that you asked quite a bit of controversy\nI think when when that first payment for naming rights didn't come they decided for you know I think we'd better go to minute maid and see\n... in the next day and around no longer existed as right\nAll right that Saturday in history will be back with the debt came and coming up with a few minutes\nWe'll talk more about uh what was scheduled a day for mourning magazine will do that after this nine forty W. F. A. W. time now for the title pound report here's bills\nFrom Wisconsin radio networks idle down rubble now with the latest from land here bill\nPackers returned to work on Monday preparing for Sunday's game against the rams in Los Angeles the Packers moving everything up day they'll head to LA on friday\nAll the travel yeah we got over three weeks of heavy travel so trying to take advantage of come off of our\nMike McCarthy's Packers spent Monday weather across the hall worker south scout measure allows players and coaches from the other side of the ball to grade each other leaders\nAre very receptive of the information that they can and it's it's been a very healthy process some others who really only tell me or you can really doing in the best one that we've nerves were doing and the off season in and turning campus about smoking got actual live in ... you know get the last six games so it's a good\nThing rookie gyre Alexander learned that he's got a lot to learn\nThat you raise about and I thought I thought I had it all figured out let 'em you know they they for me that I I was oh so and then\nHave more from titled town after that you wait quietly so you're getting impatient in two hours and still nothing you hear it it's close you see movement you sit tight because save hunting is no\nIt's been two hours and still are nothing new here it is close you see movement but you sit tight because save hunting is no accident with all different hunting season job and your fellow hunter's can be in a stand\nOn the ground or in a blind to not shoot at movements and be aware of what's in front of your target and why didn't beyond it Wisconsin DNR adventures and memories enjoy Wisconsin's wild side\n[noise] many medicines used to treat colds and flu contained acetaminophen\nA pain reliever and Peter reduce are found in hundreds of over the counter and prescription medicine but taking too much or more than one medication containing a feed them that have been her day can damage your liver\nSo always read the label that don't take a seat and then if it if you drink three or more alcoholic drinks every day and to learn more that that the dot Gov slash OTC painting so message from the U.S department of health and Human Services food and Drug Administration\nWill Packers coach Mike mccarthy says he doesn't anticipate Jake tomorrow or Trevor Davis to return to practice this week both around ... reserve and are now eligible to open the window to practice but once and I are player returns to practice that counts as one of the two I are designated to return spots\nThe Packers may not be ready to make that move where the current crop\nOf receivers performing well I'm Bill Scott Horton titled how to Morrow Wisconsin\nFrom ABC News Walden Reno dog who just want to punish you start\nTo the trading day as a two day rally for China's stock market fell apart and provide questions about economic growth in the world's second largest economy on Monday the S. and P. five hundred extent that it's losing streak to four days giving up twelve points while the Dow Jones industrial average finish the session one hundred twenty points lower twenty five three Seventeen\nTech chairs though lifted the NASDAQ Composite nearly twenty points on Monday to Seventy four sixty nine [noise]\nWith Amazon twiddling its list of potential sites for its new second headquarters down to twenty according to reports real estate investors are getting ready to place their bets summer pooling money so they can be ready to buy once the winter was announced others are focusing on an area in Virginia consider to be a leading candidate\nWhen it comes to terrorists the U.S steel industry is better than most of getting what it wants the wall Street Journal says the oil producers in the U. S. where most successful at getting officials to take items off a list of products from China being hit with tariffs generally an ABC News\nNine forty W. W. dot com\nThe very first so called chord cutters got rid of their land mines the next wave cancelled cable TV and now court hunters or a need for their Internet connection but is it for everyone can command with you can see where tech update get extended interviews in tech news with the free command a pod cast veiled on apple pie and cast and Google Play\nThanks to cell phones about forty six percent of all homes no longer have a landline\nAnd of course as Americans we've always been different\nWe we didn't want to be like Europeans but I'm In any case ah you know the research suggests that we have more in common than we think and that's probably are saving grace\nIs people who at times are different whether we we look different or we were educated differently or we belong to a different church\nThere's always a tendency to want to separate and isolate\nWhat the research suggests is that when we step back and look at each other we start to say hey wait a minute we're much more alike than we are different now we started to come back together and it's been America's strength for a long time our ability to come together\nSo Michael I Want to talk about this he calls it hidden tribes and uh it really I think a big issue for the climate political climate in this country\nHow do we get past a these perceived differences to kind of re unify the country around common values All right\nAnd as we mentioned earlier today we're well effort to reschedule that a matter of fact hopefully we can get it done with the election day two weeks from today hopefully we can get it done prior to that will\nA matter of fact Jake and I are going to tackle that but we get off the air today and try to get some things are rescheduled and so on and so forth so thank you for coming into this morning and uh we look forward to being able to get the author on\nA sometime in the near future great All right very good ah Jake will be back you'll have more during the noon hour today here on nine forty W. F. A. W.\nOur forecast we're looking at some of these guys high round fifty more of the same to borrow is well before things cool off a little bit and maybe a chance of some light rain by the weekend\nYou know but you are forecast we're looking at some of these guys high round fifty more of the same to borrow is well before things cool off a little bit and maybe a chance of some light rain by the weekend right now we're at thirty six W. F. A. W. news time as a forty one\nHigh school football players here nobody why a playoff football friday night on nine forty W. F. A. W. has done that Luther warriors playing host uber valley\nJoined ... and for the Fort healthcare pre game show starting at six fifty lakeside losing playoff football is brought to you by piece of it in ... in Cambridge by like middle market American family insurance agent ... office products in Fort Atkinson and by the drug store Jefferson\nNine forty WNBA W nine forty W. F. A. W. dot com\nIs now in ... the the case it murdered reporter Janelle ... this morning Turkey's president laid out some of what he knows say BC senior foreign correspondent in panels and assemble\nAfter weeks of speculation and constantly king he said and the information evidence we gather until now shows that ...\nWas the victim of a murder which was ... she plans directly contradicting the Saudis have been saying which that this was somehow managed slow and said that this was an attempt to stop and shouting and leaving a they put him in a chokehold anti died in\nA caravan of migrants moving slowly through southern Mexico toward the U.S border has now grown too about seven thousand people Mexican officials are demanding that they apply for asylum their\nWisconsin police are asking for two thousand volunteers today to help in the search for missing teenager Jamie cloth she vantage more than a week until after her parents were found dead and training is opening now on Wall street with Dow futures putting down over four hundred points I'm Sherry ...\n\nNovember is a big bond for ... family dental mark your janitors for these upcoming events on Saturday\nNovember ... look for the ...\nHoliday parade as they had a treats and toothbrushes then on friday November thirtieth ... family dental is showing their appreciation to veterans by providing a day a free dental care to benched veterans please call nine to zero five six three twenty nine twenty eight this scheduling appointments prior to November\nThirty in at ... family dental on Madison Avenue ... [noise]\nThe birthing center at Fort healthcare is the best choice doctors and nurses that the Ford healthcare great expectations birthing center\nFort Memorial Hospital in Fort Atkinson are specially trained to care for prenatal visit routine high risk pregnancies labor and delivery plus post part of me\nFor health care has been designated\nUp maybe ... one of only a handful and the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience you can enjoy all the comforts of home starting with the ... private sweet experienced the hydro therapy\nBefore and after ...\nPlus for healthcare has restaurant quality food service twenty four seven please visit ward healthcare dot com forward slash being\n\nYou are and we did it by we energy for the Eighteen we energy throughout the book is here did when we energy dot com to find a location near you only energy energy you can depend\nOn baseball's World Series gets underway tonight it's Fenway in Boston non bill's gone with sports\nFair of luck to you take the mom in the opener ... sales going for the red Sox and Clinton current job for the Dodgers\nBucks year or two or three and I will start after knocking out the next one twenty four one is Thirteen last night they let a Nineteen point halftime lead disappear before closing the contest on a fourteen to three run to pull out the victory fuck shit Seventeen of forty three point distance that's forty two and a half percent point guard Eric blood so\nIt has changed so when I go home for dinner day man is basketball and nobody go I was saying you know soon the ball um you've got to ... you know I was to seven so go so you know in a big threat and so he's got a king you know having a ...\nWisconsin hockey sophomore Sean ... proving that sometimes good things coming small packages ... two goals in each of the last two games giving him five in four games this season the score just six times all of last year the coach Tony Granada set of five three one fifty three duties finding ways to score\nAnd he doesn't always find three hundred and fifty pounds I think that that is as and undersized player who you'd have to forget that you're undersized player yet to play like a bigger player you can't be scared of anything you have to have no fear you have to be courageous enough to go to the dirty areas and pay a price to score\nThree one badgers Hills Michigan check this weekend but season ticket sales for men's hockey games with the coal centered down last year a losing season so six percent drop in season ticket sales\nFor this year badger women's hockey team right number one in the country as they head into their weekends series against rival Minnesota the badgers ought to an HMO start Packers back on the practice field this afternoon to start preparing for Sunday's game against the rams they're pushing everything\nUp and date a lot of the team to travel west on friday instead of the normal Saturday\nScott Wisconsin's radio [noise]\nHi I'm Danielle from we energy and I'm excited to tell you that our ... year this year we're celebrating the ... anniversary featuring right past that will make your holiday little leader to pick up your\nCookie but get a distribution location near you learn more and we energies dot\nCom [noise]\nPeople you can track energy you can depend on his message was made for like a ... W we see energy group\n[noise] think about the first time you\nRate holiday ham radio and\n[noise]\nOh I Know that we're now in the what what one radio network\nWithout a playoff on Monday Night football at the party and the first session Atlanta four or five other next six Dr against the New York giants beneath us doing their part to second Eli Manning\nFor tossed to file for the last uh twenty three is forty the falcons they hadn't been there by the much needed me while I'm are headed to Dallas the raiders play the Sims I told her white out to the cowboys on Monday for more than I think first of all will now have five number one salacious and the next two years [noise] got boys\nWhy out to the cowboys on Monday for one night the first of all now have five number one selections and the next two years I'm always looking for those who target the closure of soy\nFlush all is is this all sounds he could be over somebody does load on Monday Bush has the boy is really that was expected to side like Mark\nOn that one now on the radio [noise]\nNot many things scaring me kid vampires where walls children\nNot one bit but you know it does scare me downtime inefficiency scares the living daylights out of me that's why use Granger are America's number one source for industrial supplies\nPlus they got the inventory management solutions that keep us running so we've got up time we've got a fish and see we got productivity when it comes to keeping your facility running ... got your back\nColor quick ranger dot com to see for yourself Granger are the ones who get it done\nIf you or someone you know is struggling with addiction please call this toll free number right now eight hundred three nine zero nine five to eight that eight hundred three nine zero nine five to eight by calling your addiction team you're taking the first steps to recovery to help you need to be one Callaway eight hundred three nine zero nine five to eight make the", "show_name": "WFAW News", "year": "2018", "city": "Fort Atkinson", "day": "23"}