{"month": "10", "state": "WI", "station": "WFAW", "content": "... may may be rethinking their hall of presidents exhibits America or in the morning for friday October twelve twenty Eighteen is produced by Tom DeLay our senior producer is Kevin Delaney I'm John trout Westwood One news [noise]\n\n[noise]\n... W W community calendar is brought to you by American wholesale furniture and Fort Atkinson making life easier with lift chairs and power recliner is now at the lowest price [noise]\nTomorrow come to the free community pancake breakfasts from eight to eleven thirty am at the lake ... market cafe enjoy all you can eat pancakes along with two sausages coffee juice for milk and help raise funds to strike out suicide is\nBowling fundraiser is tomorrow from three to six PM at the bowling alley in lake mills the costs to twenty dollars per person in teams of four to six folders also tomorrow in Fort Atkinson attend the governor record celebration as a horde historical museum from ten AM so for me I Am learned about the Wisconsin I experiences in battle in the home front during the civil war\nThe W. F. A. W. community calendar was sponsored by furnish one two three and Watertown need a little help make your life easier with lift chairs in power recliner is now at the lowest price\nI'm boarding WMA out while you were born Africans and online at nine forty WMA huge on job [noise]\n[noise]\nFrom Haiti the name of\nSharing haven't done the remnants of hurricane Michael are all gone now\nFrom Haiti seeming\nSharing tests and the remnants of hurricane Michael are all gone now mostly\nOut over the ocean but the toll left behind is huge at least eight people killed and that's expected to go up well over at one point six million power outages across six states as well I'm\n... combs and Panama City Kimberly also is riding the storm out at home with a three year old son was terrifying but little Jeremiah insists he wasn't scared\nI was in our house\nAnd he says that's why she wonders when ...\nWe don't have a charger we don't have a generator we're picking on average Jeremiah comforts are\nHorrible\nMoments after I left Kimberly Jeremiah free busloads of National Guard troops the gambling mood nearby peak combs ABC News Panama City Florida\nABC News chief meteorologist ginger disease in Mexico Beach Florida\nAnd we were not able to get out ourselves because our vehicles like all of the others and the town were taken with a storm surge and we couldn't even find the one that we under\nPope Francis has now accepted the resignation of Washington DC cardinal Donald Wuerl has been at the center of several sex abuse scandals including questions about cover ups while he was bishop in Pittsburgh\nThere may be new evidence that missing reporter Jamal cause show he was killed inside the Saudi consulate in assemble turkey is ABC News chief global affairs corresponded Martha ... this morning the Washington\nPost is reporting Turkish officials claim to have audio and video evidence that Turks describing to their us counterparts video showing a Saudi security team detaining 'cause she'll be in the consulate\nThe sounds of torture ending in a murder on an audio recording according to the post\nStock markets may be poised for a rebound after two days slide that saw the Dow dropped over five percent futures pointing up also up the trade gap between the U.S and China growing last month over thirty four billion\nYou're listening to ABC News\nHey I'm Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide and Alaska and he goes to the doctor a true story goes to the doctor and he was diagnosed with cancer stage four\nAnd here's the thing he had switched earlier from medical insurance to medical care where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work our medical bills\nExceeded a hundred and sixty thousand dollars met a share members shared all our bells\nAnd it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you through the hardest times of your life I just don't know how it could have done it without measure\nIt's so worth looking into there's a reason is growing so fast so if you want to find out more hearing as a number for you\nEight seven seven twenty six Bible that's eight seven seven to six B. I. B. L. E. Britain's Windsor Castle decked out for another royal\nSays you have a daughter of Prince Andrew and Sarah Ferguson nice in line to the throne is getting married this morning the same place for Prince Harry and Meghan Marco got married back in may\nThere are new questions being raised about services that after our DNA ABC's Brian Clark has the latest on a new study genealogy\nWebsites like twenty three and me and my heritage count their service is a way to learn more about your past\nBut even if you haven't shared your information with those sites there is a good chance that you could be identifiable if you have European ancestry a new study published in the journal science says sixty percent of people from that group are identifiable because so many of their extended family members have input their own information and DNA\nMore people are now flying the friendly skies in luxury maybe the stereo owning or with more not too long ago a lot of first in business class seats on airlines were occupied by people who were upgraded from cheaper seats not anymore and carriers are pouring money into amenities that make\nFlying a lot nicer for people who pay more money for their tickets delta says that's one reason for it better than expected third quarter earnings an economy it's still cramped quarters and higher fees\nFor extra services stereotyping or NBC News hang more won't be a problem if you win tonight's mega millions jackpot eight is now the third biggest ever\nAt five hundred and forty eight million dollars\nThis is ABC News\nOil and gas investment of all the high degree of risk enter suitable only for qualify SEC accredited investors if you're an FCC defined accredited investor\nI'm Sherry ... ABC News\nYou ever you know you [noise]\nDo you have a number you morning news [noise]\nIt's currently thirty six at six o five are forecast growing for ... guys today and cold Hi I'm only forty two will get more on the weekend for gas coming up from the weather I weather service in sports brewers announced their pitching rotation for the championship series and it's the final week of a high school regular season in football I'll have\nTo you is coming up let's get to the news room this morning and Michael clash good morning Michael\nGood morning a special meeting of the ... city council that twelve thirty this afternoon to approve replacing a water main city engineer Andy Sally says the problems started last week\nOn ... street uh near the intersection of Roosevelt on friday night [noise] um [noise]\nAnd the main ... faster than we were unable to stop the uh the flow of water out of the of the\nMain so we're going to replace the main from Roosevelt to about ... street or on L. C. and get everybody back in the water\nBecomes those expected to approve a contract with red for construction for the emergency replacement\nRock river and wanted to own up to four point seven feet this morning and the action stage and still expected to peak at four point eight feet next week Jefferson's in minor flooding up slightly ten point six feet and still expected to peak of the moderate flooding stage of eleven feet but not until Saturday\nThe weather service says the rock and for that concern Pete yesterday at sixteen point seven feet mine and flooding it said sixteen points six feet this morning and expected to grow up very slowly over the next week\nLike costs can owns peak at eleven point own two feet moderate flooding than expected it rubbed very slowly over the next week cutting minor flooding on Tuesday\nThe national weather service forecasts are based on past reciprocation and expected precipitation for the next twenty four hours\nWisconsin farmers either crops are being weakened and ruined by the nearly two months of wet weather and this year's harvest is a miserable costly experience the hot dry conditions in July and August set the stage\nThe nearly two months of wet weather and this year's harvest is a miserable costly experience the hot dry conditions in July and August set the stage for the damage by the heavy rainfall and standing water\nA Jefferson man arrested and facing sentencing for a fourth offense O W why\nDavid Jamie Rio's been bound over for a trial for the force O W why a hit and run resisting an officer disorderly conduct and criminal damage to property he pleaded not guilty yesterday to all charges in Jefferson County court\nHe's back in court on November ...\nBoy that consent police report said twenty dollar bills and they carry him began on Monday and some of the larger retailers all the bills have the same serial number and the parents of three crease lines across the bell although there's no evidence of that actually having ever been folded\nThe color is a little off there's no magnetic strip available and the money feels more like paper than cloth belief\nIn the town of Oakland looking for eighty three year old John Randall as seen leaving his home Wednesday morning his vehicle was located in Dane County and the town of LVN he's described as white five foot ten weighing about two hundred twenty pounds grey hair and his allies\nThe Packers football and W. F. A. W.\nHigh school football week nine last night Johnson creek rolled over Whalen academy sixty seven nothing as cash Lewis defeated Deerfield fifty four to six denied in the ... stone but on a girl that water town an edge would it be Milton\nAnd the rock valley today ... percent of white water that came on cool when I was six point five and six fifty in the capital conference tonight Luther ... lake bills lakeside takes a load at that game will be won a key nuclear as smart as subtle will be a Cambridge in Waterloo will play a non conference game\nAgainst ... and the trail wasted I Am Ira eagle on the road at ... or by tell all Princeton green like\nWide receivers ... Randall cop out recovering from injuries with both participating and Thursdays Packers practice Alison clear the concussion protocol but it's still dealing with a sore hamstring quarterback Aaron Rodgers had a set back with a strain name\nYeah kind of a setback to last week the end of the week I got to be in the ... group again today a lot of good work and ... and I just opened a pretty good back out there tomorrow in and out of the feel good friday and practice Saturday and you're going to get to go back to where I was to try\nAnd died in Jimmy Graham are still expected to play against San Francisco on Monday Night last night Carson went through for a season high three touchdowns in the Philadelphia Eagles uh voted their first three game losing streak since twenty sixteen\nBeat the giants thirty for Thirteen Wisconsin coach ball crest asked the badgers to sixteen wins in Seventy road games since taking over the program the only lost at Michigan two years ago\nComes into Saturday's Big Ten showdown rank fifteenth of the country with a foreign one record an undefeated in conference play but also dealing with a lot of injuries missing his daughter due to a sanctioned and loads of inexperience on defense kick off it set for six thirty tomorrow night coverage on cool one of six point five starts at four thirty\nAnd in the NHL last night Jason ... and an assist including a breakaway back ... three twenty five and overtime to lead the wild ... for three comeback win\nOver the Blackhawks high school football tonight will have a ... percent at white water that's a cool one of six point five starting at six fifty also will have plenty of updates from the ... game I both W. F. A. W. during the brewers game\nAnd during the high school game a cool when a six point five is well brewers baseball against the Dodgers six thirty five tonight\nFrom Miller Park also coming up in about forty minutes we'll hear from head football coach\nKevin bullets as the war hawks are on the road adult Claire tomorrow and we'll be talking with Kevin at seven times this morning you're\nOn W. F. A. W. forecast today cloudy skies high forty to Chile and clear tonight low thirty three and about oh maybe a little bit of sunshine and fifty one right now we're at thirty six W. F. A. W. news time it's six Twenty one\nWhite water ... Saturdays a war hawks are on the road I don't care who won six forty five will be there\nThis is Douglas joined me from ... far for the for no fear free game show selling its will forty four hundred probably brought to you by feels to insurance in Fort Atkinson first citizens and receive side humming ghrelin whitewater and by Ryan Reynolds hearing like cool one oh six forty five minute nine forty W. F. A. W. dot com\nMe Jim Weiss who experience to severe accident and was in need of help or a lot of people\nJim Weiss who experience to severe accident and was in need of help\nA lot of people around me and I said I've been hurt calling ambulance\nThat's where doctors them run out and the staff at orthopedic associates afford healthcare stepped in we're basically a challenging problem in this case Jim had a total hip done several years back and then he ended up breaking wisdom partners femur bone the options are tied to replace\nThe federal component or stabilize with surgical hardware and it was a successful surgery allowing gym to return home once again actually did rather well the feeling\nThat we get to see patients come back after surgery is very ...\nI have nothing but good things to say about ... show or am I going to want to drive thirty miles to see a doctor when I can get the same treatment right here in for\nA visit board healthcare dot com forward slash joined for health care\nFor him\n\nMaybe new for you know in an ugly week for ... the Dow Jones industrial losing\nEight hundred thirty one points on Wednesday\nAnother five hundred forty point yesterday the index close Thursday at twenty five or fifty two standard and Poor's five hundred lost two percent of its value yesterday the NASDAQ Composite felt Ninety three points to finish the day at Seventy three twenty nine\nPresident Trump calls this whole a correction quote caused by the Federal Reserve with interest rates Adel has raised rates three times this year the president calls the fed out of control\nFilters profits are flying high the airline says revenues were up ... percent to a third quarter record high of nearly twelve billion dollars much with the increase is coming from better sales have seats in dealt is first class cabins and Walmart has a new deal with MGM to create exclusive shows for its digital streaming service called voodoo\nWalmart already allows users to buy a written nearly two hundred thousand movies up first from MGM a series remake of the eighties comedy Mr mom generally an ABC News\nNine forty W. F. A. W. N. nine forty W. F. W. dot com\nThis update brought to you by what particular bit of water\nYour ... primary concern they understand the optimal oral health begins with your regular visit and to make those visits more relaxing enjoyable ... family did allow offers uncovered venue\nWhen you arrive usually Airbus a blanket calorie second refresh my ... family dealt even offers laughing gas for those with the ...\nThey want you to put your fears of during your vision\nGet to know each family dental and for that can get to Europe or but today call and I do zero five six three twenty nine twenty eight [noise]\nHe went he ain't for camping melt production for this year in March to hire and dairy farmers increased the herd size hand to mouth perpetuate the expected they increased identical had slept with the brown field\nTheory opting in attempt to supply demand report ... battering way prices higher for twenty Eighteen and Nineteen because it's better to me but the the lower because the water supply\nCensoring prices were lowered for this year nonfat dry milk prices are expected to stay the same do any Eighteen almost prices for cats and a range of sixteen three find the sixteenth forty five no thing unchanged from the previous report\nThe dairy check off that Seventy percent of consumers want to meet a former which is why they are encouraging farmers to participate in national farmers day three next Schaffner with the dairy management tell Springfield for the past two years they've embraced national farmers stay on October twelve to ... to ...\n... the picture share their story you know has tightened national family day\nShe than their survey also found seven out of ten Americans think it's important to note that consumers to produce the food and more than half of people more interested in moving to a farm\nClassroom out future at the Chicago mercantile exchange closed at lower Thursday pressured in part by lower global market price since ... parish supply and demand report\nAnd sober down Ninety cents at Fifteen sixteen thinks November down Thirteen Fifteen Seventy six December down fourteen and Fifteen eighty January nonsense lower ethics team Seventy find\nBarrels were a habit that higher rent a dollar thirty seven blocks the penny lower at a dollar sixty five butter up ... percent said to twenty six and three quarters non than dry mouth one and a quarter percent higher and eighty seven than driveway unchanged and fifty six and a quarter\nIdentical which brand feel\nLook around you this land is born this crop discount this farm disarming as Hugh Grant\nSo when people say American families Sherman's protect thing we should because we protect that usually would ensure\nThree fearless American family and get\nAmerican family mutual insurance company as I entered operating companies could seizing American Parker Madison, Wisconsin\nThat rank she'd we've supported our farmers for more than a hundred and Seventy years our knowledge and expertise will help guide you through the ups and downs of life on the farm like when you discover your head and house has become a gambling house dog Jerry [noise]\n[laughter]\nGot to worry about let us take care of your seat rank sheet\nGreen Bay Packers play golf [laughter]\nIt's Monday Night football as the Packers oh San Francisco a level field\nAre broadcast with weight and Larry starches just after five o'clock Green Bay Packers football is Roger you by remote outdoor power and we bought our home in ... and ... out and gentle every bill nine forty W W [noise]\nMm it's not a matter of if but a matter of when every athlete experiences pain meet Dr shelter a more therapeutic associates and the words medicine only add more to help care we take care of patients from the weekend warrior to the elite athletes\nFor all sorts of different enjoying that Lincoln had problems in pay and we come to a shared decision as to what is their best treatment whether that be\nSurgical or non surgical nurse sports medicine program involves many different team members from\nOf course they will and a town of October fest without a polka band I do write so it just\nDoes not avenue and then the other ... caps off the weekend with their pancake breakfast Sunday Morning from seven to eleven that'll be the fire station\nOn Milwaukee's street in Fort Atkinson coming up on Sunday Morning see the fire trucks that's right but could be a lot of fun there's a lot of stuff going on All right Michael ... back to the guest forest coming up with a couple of minutes here on W. F. A. W. uh once again want to remind you weigh a brewer baseball tonight\nOn WFL W six thirty five they host Los Angeles to open up the national league championship series or we will not be able to broadcast the ... stone game because of that but ... will be there and Brad Will be voting and reports throughout the board game tonight\nAnd also throughout the Jefferson whitewater game which will beyond cool one of six point five starting at six fifty this evening W. F. A. W. new time uh six\nDr Jennifer ... your primary care provider or health care\nI really love my job I guess they need to spend time with patients really get to know them and I see them on their good days on their bad days and they have the opportunity to help them through that\nAre very much enjoy the community at Fort Atkinson and I enjoy community medicine\nSo it was a good for me to come here for health care [noise] my personal philosophy in regards to medical practice and taking care of patients to make sure that we're listening to them as a primary care physician I get to take the role of\nCoordinating care for patients when it comes back and tell me that what we did for them has how they're feeling better probably the best part of our job we get to really help people and know that what we're doing makes a difference [noise]\nFind out more about Dr Jennifer winter\nFort healthcare dot com\nFor [noise]\nWarriors and wizards festival the portal to your fandom warriors and wizards where the world's upside science fantasy meat costs playing virtual reality going to jump in Wisconsin It's October nineteenth the twenty first order wristbands on line at warriors and the wizards festival dot com\nYour comfort ... primary concern they understand that optimal oral health begins with your regular visit and to make those visits more relaxing enjoyable ... dead allow offers a covered venue\nWhen you arrived juice from your body a blanket calorie second refresh my ... family dealt even offers laughing gas but those were they ...\nThey want you to your fears of eased during your visit\nTo get to know ab family dental import act has given your appointment today call and I do zero five six three twenty nine twenty eight [noise]\n\nLooking to try something other than straight lines when it comes to designing a room the experts at HGTV suggests trying Polly Dunn\nCoffee table side tables even lighting fixtures with these shapes are coming into style the table you could arrange them in such a way to create more space you can also create fund lay out with ... on them and to [noise]\nIn my lane for only the lab and zaps in well over at one point six million power outages ABC's Maggie rule Lee is in Panama City Florida here in Panama City it just seems like it's block after block that's been destroyed\nEvery home you look at it has some type of destruction whether it's a massive trees it's fallen right on top of it or the roof it's been blown off not one person here that hasn't been affected by the store and the pope today accepting the resignation of Washington DC cardinal Donald Wuerl Joshua McElwee\nIs Vatican correspondent for the national Catholic Reporter he says world has been at the center of several sex abuse scandals with Pennsylvania\nGrand jury report is actually a shift in the late eighties and early nineties came under scrutiny particularly his handling of federal priest at the time who had been accused of a piece on his condos with minors\nMarket futures are now pointing to a higher open after a two day slide it costs the Dow over Thirteen hundred points and all I'm Sherry Preston ABC News\nAnd\nThe Southern Poverty Law Center is out with its annual year in hates report and it shows a big rise in the number of hate groups across the nation it counts nearly one thousand different active\nHate groups across America a jump from the year before neo Nazi groups are up to twenty percent in part due to President Trump's involved and they have the kind of ideas that motivate sympathizers the Law Center a think communities are organizing to combat that hate groups\n[noise]\nUh Portland, Oregon woman is asking Amazon how it's Alexei could've reported the conversation your family was having then that's that forwarding to a random person on a contact with Amazon says Alexa misinterpreted a background conversation that thought was send messages plus\nShe had an election in every room in her home and requested a refund for devices [noise]\nOh man requested a refund for devices [noise]\nThe brewers are the next round of the playoffs tonight ... Scott what's boards below\nThe Dodgers in game one of the NFL see as the other hand the ball to left hander geo Gonzales\nOr we liked the matchup against their line up and it's no secret that we're going to use our pitching a little differently than traditionally than the traditionalist would light and so the the the person I said that we liked was was you on the phone you know we were asking you to go out there and and get a bunch of al how many you know just the Albert see our goal is\nTo manager Craig ... sudden pitching game one for the brewers\nPretty cool story of my perspective it's pretty cool to represent the brewers and exactly what it is you know they they wanted me to be a part of this and and I was excited to to know that uh I'll be going around\nDodgers go with Clinton Kurt Shaw LA went for the three against the brewers the season\nBig Ten battle of rank teams tomorrow is the tenth rank badgers visit number Thirteen Michigan and the badgers beat up Nebraska last week to go to foreign one Michigan down Maryland new improved at five in one\nBadger defensive end Isaiah Loudermilk has already been ruled out of that game with a leg injury Carson went through for three touchdown passes as the eagles ended a two game losing streak they\nBeat the giants thirty for the Thirteen last night Packers returning to the practice field on Thursday getting ready for their Monday Night contest against the San Francisco forty niners Packers rates the red zone sixteen times this season but have only eight touchdowns to show for head coach Mike mccarthy\nAre going to do better job coaching off a good point yeah you always just go first then you go back for every call and you're looking somewhere overturns you had on there for all the extra troops as part of it through so they were the most important thing is we're getting dollar so or you know but we were ... I think we all recognize um\nHockey badgers open their regular season of the coal center tonight facing tenth rank Boston College in the first two\nGames series the bucks play their final exhibition advice or foreign tonight against the Minnesota Tim Scott this constant radio network\n... jak\nGas jak it's been a great summer you've taken impeccable care of your yard but now it's time for your gas power tools and collect your car to enjoy their off season over Ninety five percent of gas contains ethanol grades in those little is thirty days causing sludge moisture and corrosion stay bill storage check\nStay but saving engine starts season after season for sixty years in running snow blower\nCafe or a few of them are sold\nEvery year there are commercials reminding everyone to hunt safely but the truth is it's not up to every one\nIs how do you recall firearms as if loaded always point a Muslim let us say direction be certain of your target and what's beyond and keep your finger outside the trigger guard until it's safe to shoot hunting safety is up to you don't just be aware of the safety measures followed\nSaid hunting is no accident and\nLearn more from the Wisconsin DNR DNR dot W. I. dot Gov\nMe Jim Weiss who experience to severe accident and was in need of help\nA lot of people around me and I said I've been hurt color ambulance\nThat's where doctors the bronco\nAnd the staff at orthopedic associates of port healthcare stepped in we're facing a challenging\nProblem in this case Jim had a total hip done several years back and he ended up breaking stumped partners femur bone the options are tied to replace the ... on a more civilized with surgical hardware was a successful surgery allowing gym to return home once again actually did rather well\nThe feeling that we get when we see patients come back after surgery is very rewarding\nI have nothing but good things to say about diverse Ron oh so am I going to want to drive thirty miles or see a doctor when I can get the same treatment right here in Fort Atkinson\nVisit board healthcare dot com forward slash joined poured health care for him\nIf you have hard water the lime scale not only leads white spot the plugs pipes and breaks down appliances costing you hundreds of dollars in energy and wear eliminate\nLives scaling other water issues like brown standing bad odors and lead with hydro care water products available from wave homes illusions weeds affordable systems don't use salt or chemicals you'll love the way your water taste smells and looks satisfaction guaranteed\nFor more information go to good Clearwater dot com that's good Clearwater dot com\nNine forty W. F. A. W. N. nine forty W. F. A. W. dot com\nMaybe she's going to listen to\nA division battle in the big apple Philadelphia spoiled and break out game for giants working Kwan Barkley who had two hundred twenty nine total charge Carson went and free touchdown\nAnd the opportunity for first time use hunters between the ages of ten to fourteen and participate in a limited gun deer hunting portions of Dorsey cars county party in November handling patients will be accepted October Fifteen through the twenty six for more information called six seven four seven two six zero the to randomly selected hunters and their chaperones\nWill be required to participate and to our orientation with Jefferson County\nPark staff to review the rules of the foundry and property\nApplicants must also that's a valid with guns and gun pay [noise]\nThe W. F. A. W. community calendar was sponsored by American wholesale furniture in Fort Atkinson making life easier with live chairs in power climbers now at the lowest price fossil\nDr Jennifer ... primary care provider for health care\nI really love my job that gives me an opportunity to spend time with patients really get to know them and I see them on their good days on their bad days and I have the opportunity to help them through that\nI liked her family everyone from\nAre very much and joined the community or for that comes on that I enjoy community Madison\nSo it was a good for me to come here for health care [noise] my personal philosophy in regards to medical practice and taking care of patients pretty sure that we're listening to them as a primary care physician I get to take the role of coordinating care for\nPatients when a patient comes back and tell me that what we did for them has how they're feeling better probably the most part of our job we get to really help people and know that what we're doing makes a difference [noise]\nFind out more about Dr Jennifer winter\nFort healthcare dot com\n... [noise]\n[noise] I'm forty dollars you have a newborn Africans and online at nine forty W. W. dot com\n[noise]\nFrom Haiti seeming\nSherrie Westin ain't new reality for parts of Florida after hurricane Michael\nAll of the things the fabric of life that we use every day to go about our business none of that is functional zero mark\nBowe and his head of emergency services in Bay county where Michael made its landfall NBC's peak combs is there\nMany storm victims here still don't have cell phone service trapped in their houses and unable to call for help at this point all they can do is wait for rescuers who faced a herculean task of shopping their way through a forest of down trees trees that have fallen on houses and they'll choke the roads of one neighborhood after another\nThey roads where people who refused to evacuate are still waiting to be rescued the\nDeath toll from Michael now up to at least eleven over a million and have power outages have reported across extinct Washington DC cardinal Donald Wuerl is stepping down the pope accepting his resignation this morning and then several sex abuse cover up scandal here's ABC's David Wright\nWorld leaves his post in disgrace having come under sharp criticism and that Pennsylvania grand jury report this summer for allegedly covering up dozens of abuse cases in Pennsylvania when he was bishop of Pittsburgh in a statement today world said his resignation of permits the local church in Washington to move forward\nNew evidence and the disappearance of reporter Jamal ... turkey the Washington Post says Turkish officials have audio and video evidence that points took a shaggy being murdered inside the Saudi conflict any assemble ABC chief global affairs corresponded Martha Raddatz\nTurkish media releasing surveillance video they say shows Fifteen Saudi nationals entering the compound on the same day a possible hit squad according to Turkish reports President Trump said us investigators are in Turkey and working with the Saudis to find out what happened ...\nFutures pointing higher this morning you're listening to ABC News\nAdmitted you probably want to eat healthy but getting enough organic fruits and vegetables into your diet every day is not only time consuming and expensive\nThat's why in Texas super food we've created a blend of the best USDA organic vine ripe and fruits and vegetables powerful enzymes in probiotics and energizing herbs all in a convenient capsule or powder we call it Texas super food complete organic\nHigh on natural path to Dr Denis black and I invented Texas super food almost Twenty years ago with one goal in mind\nTo help people like you really busy lives get the all natural nutrition that every one of us needs and deserves so if you can't Walter don't eat all you organic fruits and vegetables everyday Texas super food complete organic makes eating healthy easy\nSee our whole line of quality nutritional products of Texas super food dot com or call us\nAt eight five five Texas fifty five ... five five Texas fifty five Texas super food dot com\nPresident Trump has his eye in the midterms today are then John been back on the campaign trail today he'll sit down for a private meeting with supporters and later hold a rally outside Cincinnati this is the third rally of the week for the president and he's on the trail against Saturday for a fourth rally in Kentucky\nIt's their jumps expected to keep up the pace over the next three and a half weeks leading up to the mid term elections Karen ... ABC News the White House\nQuestions in Georgia about fifty three thousand voter registrations Georgia secretary of state Brian Kemp who is also running for governor has put them on hold after the state passed a law saying a voter registration and a driver's license must match with Toys R us gone for the holidays ABC thought and says a lot of stores are swooping in retailers\nAre trying to grab a piece of the nearly three billion left on the table buy toys are us so rather than give up more ground to online game of Amazon companies like target Wal Mart and party city are wrapping up their offerings I had a pivotal holiday season party city open fifty tore city pop up shops with interactive\nDisplays Walmart says thirty percent of its holidays tour assortment will be new target will devote extra space with five hundred stores for bigger toys but hold on Toys R us might be resurrected a group of lenders that now control the iconic toy store decided but rebooting the chain would have more value than selling it off for parts taught it ABC News\nRow wedding bells at Britain's Windsor Castle once again princes you Janine ninth in line to the throne got married this morning\nThis is ABC News\nOil and gas investments all the high degree of risk ... only for qualified SEC accredited investors if you're an FCC defined it credited investor getting ready to do your taxes and wish you had more than ... you can take action now\nAnd start planning for twenty eight teams with one hundred percent IRS approved deduction invest with on court energy if you're a high net worth SEC to find a credited investor who's interested in participating directly with approve an operator and\nAre qualified to make an investment of at least two hundred and fifty thousand dollars than police called encore energy eight hundred eighty three eighty five eleven eight hundred eighty three eighty five eleven\nI'm Sherry Preston ABC News\nCoverage than counties news NPR nine forty do you ever you know you're\nGonna do you have a W morning news states\nCurrently thirty five ... five are forecast\nToday cloudy skies high of forty two maybe a bit of sunshine tomorrow in fifty one and then rain and forty seven on Sunday ball traveling joined us about Fifteen minutes also coming up in sports we'll hear from more hockey football coach Kevin Bush time now for W. F. A. W. to use the Michael ...\nSmall trolley joined us about Fifteen minutes also coming up in sports we'll hear from them for hockey football coach Kevin ... time now for W. F. A. W. to use the Michael ... this morning\nBy foreign health care or health your how family health and community out and buy Johnson bank in Fort Atkinson good morning Michael\nGood morning Gary a special meeting of the Florida Atkinson city council at twelve thirty this afternoon to approve replacing a water main city engineer Andy Sally says the problem started last week\nA main break on the street a near the intersection of Roosevelt on friday night [noise] um [noise] and the main or an ... type faster than we were unable to stop the uh the flow of water out of the uh out of the main so\nWe're going to replace the main from Roosevelt too about Lucille street or on L. C.\nAnd get everybody back in a good water\nComes those expected to approve a contract with bread for construction for the emergency replacement more news after [noise]\nThe birthing center at Fort healthcare is the best choice doctors and nurses and the Fort healthcare great expectations birthing center\nFort Memorial Hospital in Fort Atkinson are specially trained to care for pre natal visit routine at high risk pregnancies labor and delivery plus postpartum\nFor health care has been designated that baby friendly facility one of only a handful in the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience you can enjoy all the comforts of home\nStarting with the ... private sweet experience the hydro therapies before and after ... plus for health care has restaurant quality food service twenty four seven please visit ward healthcare dot com forward slash the [noise] for health care\n\nTo get an update on the wrong river add water town it's up to four point seven seat this morning and the action stage and still expected to peak at four point eight feet next week\nJefferson's in minor flooding up slightly this morning to ten point six feet and still expected to peak at the moderate sledding stage of eleven feet but not until Saturday\nThe weather service says the Iraq at Fort Atkinson peak yesterday at sixteen points seven feet minor flooding and it said sixteen points six feet this morning and it's expected to drop very slowly over the next week\nLike costs can ... the data Levin point oh two feet moderate flooding and it's expected also to drop very slowly over the next week hitting minor flooding by possibly Tuesday\nMe Jim Weiss who experience to severe accident and was in need of help\nA lot of people around me and I said I've been hurt Carly ambulance\nThat's where doctors the bronco and the staff at orthopedic associates support healthcare stepped in\nWe're facing a challenging problem in this case Jim had a total hip done several years back and he ended up breaking the stump partners femur bone the options are to either replacing the federal component or stabilize with surgical hardware\nAnd it was a successful surgery allowing gym to return home once again\nActually they'd rather well in the feeling that we get to see patients come back after surgery is very rewarding\nI have nothing but good things to say about it Dr ... Ron oh so am I going to want to drive thirty miles or see a doctor when I get the same treatment right here in Fort Atkinson\nVisit Ford healthcare dot com forward slash joined for health care\nYour comfort is easy family dentals primary concern they understand that optimal oral health begins with your regular visit and to make those visits more relaxing enjoyable ... family dental now offers a comfort venue\nWhen you arrive to some Airbus a blanket and that kind of a ... second refreshed ... family dental even offers laughing gas but those were they ...\nThey want you to put your fears of eased during your visit\nTo get to know each family dental and Fort Atkinson schedule your appointment today call and I do zero five six three twenty nine twenty eight\nWarriors and wizards festival the portal tier fandom warriors and wizards where the world of science fantasy meat cats playing virtual reality coming to you ever seen Wisconsin It's October nineteenth the twenty first order wristband on mine at warriors and the wizards festival dot com\n[noise]\nTeens to twenty first order wristbands on line at warriors and wizards festival dot com\n[noise]\nNow these consumers can tells you after seven point two million dollars in refund thanks to an MTC settlements\nThe company behind the famous as seen on TV police blanket as being forced to pay its customers that amount in refunds SEC allege that also are marketing group misrepresented indices customers with a tad settlements fights unauthorized charges and failure to adequately disclose material terms of the offer\n\nMaybe new will now is in an ugly we were ... industrial losing eight hundred thirty one points on Wednesday for another five hundred forty point yesterday\nThe index close Thursday of twenty five or fifty to the standard and Poor's five hundred lost two percent of its value yesterday demands to composite felt Ninety three points to finish the day at Seventy three twenty nine\nPresidents from coal to solve a correction quote caused by the Federal Reserve with interest rates panel has raised rates three times this year the president calls the fed out of control\nDoltish profits are flying high the airline says revenues were up ... percent to a third quarter record high of nearly twelve billion dollars much of the increase is coming from better ... seats in delta is first class cabin and Walmart has a new deal with MGM to create exclusive shows words digital streaming service called voodoo\nWalmart already allows users to buy a rent nearly two hundred thousand movies up first term MGM series remake of the eighties comedy Mr mom Jim Ryan ABC News nobody wants a W\nNews times seven twenty to our forecast the weather I weather center with ... brought you this morning by GM carpets are located on main street in downtown for the Atkins and Paul Julie star to the weekend will we see any sunshine at all here in the next year so\nYes they will get some break the vets are here for the next couple of days but uh looks like a\nIt is going to be certainly some colder weather that's got to stick around with eyes the forties and have fear for is a right to the middle of next week here for today high temperatures about forty three with a cloudy skies breaks and pay for that Senate spots as well as our last Wednesday at five Fifteen part of the classic can I thirty three\nAfter I called starts Saturday breaks us on that either fifty one I went to south west way to Fifteen\nForty on Saturday Night 'cause it gets the iffy rain showers life if you if you showers are sprinkled Sunday caught in colder otherwise high temperatures at about forty five on Sunday mid forties Monday from break the side that backed around fifty for those highest Tuesday and Wednesday out this fall probably\nSo in a word or to bundle up for the weekend\nYeah it's called but ah at least a no major rain events here rather for the next several days ahead\nYou know that's certainly a good news rubber still very high here in Jefferson County All right thank you all have a great weekend we'll do it again Monday morning\nI get back into\nAlright ... from the weather I weather center here on nine forty W F\n[noise]\nBMWs are often known as the ultimate driving machines that sooner computer might be taking the wheel\nThe company is moving forward with this latest research and development facility focused primarily on semi autonomous self driving technologies gadgets Roberto Baldwin says it shows the company is serious about the fact they're developing theme W plans to double its fleet of autonomy vehicles by the year\nRight now until the Wisconsin we have wins out of the west at six our current temperature thirty five does make you feel like thirty this morning\nWere nine forty W. F. A. W. W. F. W. news time seven twenty four and Michael is back with\nAnother guest Michael\nThank you Gary on the line with those ... W whitewater philosophy professor Chris minor in the morning prevention\nMorning Michael how are you\nWonderful and tomorrow Saturday morning philosophy ten o'clock at the white foster public library if you walk in and there are dogs in the room you're in the wrong room\nA dog that while the dogs in Morrow too yes yup now you go on to the library and make a star left them down the hall nobody assign there'll be a sigh yes now what is the topic tomorrow\nA topic that uh has like gold on that cycle but we uh we will at times to fall back on it and then many of the time uh this little this kind of pop in what we're doing the existence of God\nThere's a question are we kind of tiger last week that mhm why is there something rather than nothing at all and we kind of the cosmology stands at it you know I thought they bang and multi ever a well this week we're going full theological theological philosophy a philosophical I mean there's a\nSometimes there's a fine line between the two but yeah I'm gonna I'm gonna lead it Morrow and I'm going to\nBring my full arsenal of reasoning and rationality for why is more more justified to believe that God exists\nThan not 'cause we can't you know I mean there's people that I was saying that they got it this is not exist but at the heart pills while but I think you can have arguments way one way or the other night about this argument for wanting to take away\n... seats and anyone listening right now that has an opinion on this and I think there's a quite\nA few a drop by and we'd like to hear from you ...\nOh yeah I'm a topic the topic I think there's a lot of people because you know they have their base or they're\nNot they and they feel like you know these are really personal beliefs and don't want to either by both of them or that was the question or a friendly group and then we have our share of bantering back and forth but\nUm you know I I Hope people especially it's on new that wants to come you know we don't\nDo personal attacks there's nothing like that it's wherever your police are spray I mean we've asked for either and a question things\nBut that's a good thing or whether anyone to believe in God it's the question of whether you believe in God or don't believe in God issue the question because I didn't believe it's simply that were flavor of ice from the like the terrorists but believe in God\nHas matters I mean no matter what his life and stuff and so I think people would want to\nUh I always find it to be a good thing to test was based either way um because wherever you come out on the end all be stronger for it so\nWill point we don't just ask why do you believe in God we ask why don't you believe in God\nWe go both ways brio I mean that's very important because we don't know the answer either end of that spectrum and so in in the end it's all\nOf you know what are your reasoning for this and so that everything's fair game I think some people may be scared especially if they hear that this is the last\nWhat are your reasoning though everything's fair game I think some people maybe scare\nEspecially if they hear that there's a lot of the thing that everyone has their stuff out yet yeah people are believing in God that's true at all and I'm going to be put in a line of ... it's more likely it'll even believe in God and I got a whole\nLine of argument then rationality is for it\nBut of course you do [laughter]\nI'm looking forward to that but\nI Am too I guess are they wait and see you tomorrow morning like like a philosophy professor click a cruise mine are we going to the big one tomorrow\nYeah sounds like he is a armed and loaded for it\nI mean well he's expecting\nA lot of different answers from a lot of different sides there were so many answer this question\nThat's for sure yeah and do a don't confuse it with the reading with the dogs tomorrow either no not right now [laughter] you know dogs allowed All right thank you Michael Michael ... back in a minute W W news time is seven to one\nHas a new one on me yeah and I went on me too but boy it's pretty amazing it is isn't going anywhere subway birthday winter for today is from\nA lake mills Rachel start okay rare earth day when a report today now we've got a couple of courage and the drawing for tomorrow October thirteenth\nWe start out in some of it in with Patricia Gilbert happy birthday Patricia ah this is a a pelican it certainly is [laughter] that could have been taken on the rocks are going to say see I'm Out on the rock river every once in a while\nAnd also if they're not supposed to be there and it's kind of a surprising site to when I was your last caller David for several years now\nPeople still has had did you notice that when it comes out there just to just south of town is where you usually see bird of Louisiana yeah the other end of the river [laughter] and uh let's see another birthday for tomorrow is from Fort Atkinson with every ridell me birthday Debbie ... she sent us a picture of Michael when he was an infant\nOh and that is made about that I actually put on the Gerber boxer yeah that's right that's back when you add hair [laughter] actually it was a way I see okay well it it it gets you very well yeah that would not bad anyway are suddenly birthday winter for Saturday is Patricia Gilbert of subtle and enjoy that's right\nAh those are the birthdays that we have for today and tomorrow we got a few other birthdays\nTo talk about uh for this a friday the twelve and\nDo we start out with a one of the ah one of the members of this and do all that has some great hits back in the early sixties [noise]\nSinger Sambo formerly of salmon Dave yes eighty three years old today for what ... what a group they yeah they had some great songs back in the early sixties also are celebrating birthday today second generation broadcast journalist Chris Wallace oh here's a Seventy one years old today\nHe is yesterday as well [laughter] that's right [noise] still going strong to a singer and actress Susan Anton sixty eight\nYears old today home very very ... and the other members aren't a lot of movies and TV shows him seventies\nActor Hugh Jackman celebrating his fiftieth birthday today very busy ... uh actor Adam Rich he was a child star and eight is enough and he was the I think he was the youngest child on that program and another a youth after\nHer camera in is a forty eight years old today he was on the growing pains of\nTelevision program so those are the birthdays today bud alright happy birthday going out to a Rachel stark of lake mills are subway birthday winter for today and Patricia Gilbert and Sullivan of Earth Day winter for tomorrow enjoy those are All right if you're a birthday is coming up let us know about its energy name address birth it on a postcard of ... for\nFor the Atkins in five three five three eight makes you give us your direct mailing address one birthday for postcard please please put the birth date on it and get it to us at least a couple of weeks in advance so we have it in plenty of time for the drunk [noise]\nSports coming up with a couple of minutes on W. F. A. W.\nW. F. A. W. community calendar is brought to you by furnish one two three in Watertown need a little help make life easier with lift chairs in power which liners now at the lowest price possible [noise]\nThe Jefferson County parks department has an opportunity for first time use hunters between the ages of ten to fourteen can participate in a limited gun deer hunting\nOf ... county park in November applications\nWill be accepted October Fifteen through the twenty six for more information called six seven four seven two six zero to randomly selected hunters and their chaperones will be required to participate and to our orientation with Jefferson County park staff to review the rules of the hunter boundaries and the property\n... will be required to participate and to our orientation with Jefferson County park staff to review the rules of the hunt foundries and the property applicants must also that's a valid with guns and gun ... [noise]\nThe W. F. A. W. community calendar was sponsored by American wholesale furniture and Fort Atkinson making life easier with live chairs in power are climbers now at the lowest price possible\nAutumn is unfolding in all its glory doing this a moment of it visit SSN health Davis do a Dean I care and save one every ... on a complete pair of glasses a sharp new pair of eyeglasses can give you a whole new outlook on life\nThey've got a new pair of eyeglasses at S. S. M. health David Stuart dean today and enjoy the beautiful fall season with a great new ...\nTake advantage of the ... and see your life clearly furry offerings delivered to visit as asked them how to act on Forty Tales [noise]\nNine ... W for [noise]\nThe Milwaukee Brewers and the Los Angeles Dodgers have set their rotations for the first three games of the national\nLeague championship series she on ... will get tonight's openers start against the Dodgers he'll go against Clinton Kirsch off brewers manager Craig council\nOr we like the matchup against their line up and it's no secret that we're going to use our pitching a little differently than traditionally the traditionalists for life and so for us the the the first massive that we liked was was you on the phone you know we were asking to go out there and and get a bunch of out how many you know just ...\nMilwaukee goal was weighed Miley against the engine you were you for game to follow by who leashes sheen against Walker viewer and the third game of Los Angeles are broadcast it starts at six thirty five here on nine forty W. F. A. W. the St Louis cardinals have agreed to a one year deal with that um Wainwright bringing the veteran right ... the\nOnly major league teams ever pitch for the thirty seven year old ... fifth on the teams career laced with one hundred forty eight wins and over sixteen hundred strike out with the brewers advancing to the end all cs there are number of broadcast changes for this weekend coming up tonight will have brewer Dodgers you're on nine forty W. F. A. W. starting at six thirty five\n... considered starting football game will not be broadcast however ... will be calling in reports throughout the brewers broadcast\nAnd during the ... percent of white water football game on cool or one of six point five\nNow tomorrow game two of the brewers and I'll see as can be heard on nine forty W. F. A. W. that starts at two thirty five the Wisconsin badger football game and Michigan will be moved over to cool one of six point five that'll be starting at four thirty and street on line at nine forty W. F. A. W. dot com and on Monday Night because of Packers\nMonday Night football game three of the brewers and I'll see ask have you heard on cool one of six point five starting at six o five\nHigh school football week nine got underway last couple of games in the area Johnson creek shut out wait on the economy sixty seven to nothing\nAnd asked cash Lourdes over Deerfield fifty four to six to nine of the ... when I Want to grow travels to Watertown and built in well played host to edge would in the rock valley conference that I had a game you can hear on cool and a six point five Jefferson will be at white water\nIn the Capitol tonight ... bills lakeside will take on low died that game will be won a key nuclear as bad as subtle will be Cambridge Waterloo was in that conference play hosting Santa more in the trail ways tonight Pam Ira eagle on the road at Monticello Princeton and a green light\nWide receivers Toronto Adelson and Randall Cobb are recovering from injuries both participating in Thursday's Packers practice Alison\nHas cleared the concussion protocol but it's still dealing with a sore hamstring quarterback Aaron Rodgers he had to sit back with a screen name\nYeah kind of a setback to last week the week I got to be in the ... group again today a lot of good working with me and I just hope and ah [noise] they get back out there tomorrow and and I have a feeling that friday and in practice Saturday to go back to where I was to try\nAnd try to engineer Graham are expected to place Monday Night against San Francisco\nLast that Carson went through for a season high three touchdowns and the Philadelphia Eagles uh voted their first three game losing streak since ... sixteen they beat the New York giants thirty four to Thirteen\nWisconsin coach ball Chris has led the badgers to sixteen wins in Seventeen road game since taking over the program one loss however was it Michigan two years ago Wisconsin\nComes into tomorrow's big game rank fifteenth and the country with a foreign what record an undefeated in conference play but also dealing with injuries are missing starter due to a sanction and loads of inexperience on the defense kick off his for six thirty tomorrow night coverage starts at four thirty again a cool one of six point five tomorrow last\nNight and the NHL Jason ... two goals in an assist including a breakaway back under two thirds of three twenty five and two overtime to lead the while do it for three comeback win over the Blackhawks we have high school football tonight Jefferson whitewater that's not cool one of six point five or baseball tonight\nAgainst Los Angeles and the championship series our coverage at six thirty five here on W. F. A. W. and I both stations that I Will have updates on the Fort Atkinson extorting football game\nWith breakfast Herman our forecast today calling for cloudy skies high of forty two it'll be clear and chilly tonight low thirty three by or we could see some sunshine and the highest fifty one right now we're at thirty five this morning here at nine forty W. F. A. W. N. nine forty W. F. A. W. dot com news time is seven forty\nYour comfort is ... primary concern they understand the optimal oral health begins with your regular visit and to make those visits more relaxing enjoyable even deadly dead allow offers a comfort venue\nWhen you arrive you some Airbus a blanket ... calorie second refreshment ... family dental even offers laughing gas for those with the ... they want you to put your fears of ease during your visit\nGet to know each family dental and Fort Atkinson schedule your appointment today\nCall and I do zero five six three twenty nine twenty eight\nNo it's not a matter of yes but a matter of when every athlete experiences pain meet Dr shelter um worth of beating associates and sports medicine only at more health care we take care of patients from the weekend warrior to the elite athletes\nAre all sorts of different joints and Lincoln had problems and pains we come to a shared decision as to what is their best treatment whether that'd be\nSee entertainment new box office this weekend we are going to have to start from scratch you ready to go to the moon\nCritically acclaimed Neil Armstrong ... first man the views and it will likely tough the new releases\nTracking the twenty million dollar range but am I get some competition from Jack Black animated goose bumps two hundred dollar when I was opening Jeff Bridges and John Hammond established drama bad times at the el royale last weekend's then I Will likely finished first with the star is born in seconds [noise]\nSame Coogler staying richonda a little longer he'll report Libby back to write and direct the sequels Disney marvel movie black\nPanther no release date yet a ton of exploration the CBS show FBI one of the first new shows the TV season to get picked up for the full season CBS as most launched a new show tonight on TV it's starting to the final season of the cw is critically acclaimed crazy ex girlfriend\nCan be done happy fiftieth birthday today the Wolverine Hugh Jackman I'm Jason ... and\nI'm quoting WMA W for napkins\nAnd online at nine forty WMA dot com [noise]\n[noise]\nSherry left in the remnants of hurricane Michael now virtually all out to sea but leaving behind\nDamage stretching across six states at least eleven are dead and over a million and a half power outages reported ABC's Pete combs is in Panama City Florida [noise]\nWas hurricane Michael twisted the railroad crossing into on recognizable shapes the tracks on either side are completely block quite fallen trees\nThe streets here in Panama City are also blocked by storm to making them absolutely impossible in some cases the military has to use heavy equipment to move the story out of the way but that's incredibly slow going\nThe market's open up an half an hour futures are pointing higher after too tough days on Wall street to cut that out by over five percent this is new number from Washington show China's trade surplus with us hit a record thirty four point one billion dollars last month economists think some of that may be American companies putting in orders headed those terrorists\nThe pope this morning accepting the resignation of Washington DC cardinal Donald Wuerl after several sex abuse scandals here's ABC's David right\nIt looks like he will remain a cardinal even though he loses his post as archbishop of Washington DC\nHis immediate predecessor cargo Theodore Carrick lost his job as a cardinal when credible evidence came to light earlier this year that he had abused a minor himself years ago\nFirst lady Melania Trump tells NBC News in an exclusive interview that she doesn't have time to dwell on allegations that the president cheated on her\nBabies not concerned and focused on mine and my mother and his lady\nHave much more important thing to think about them to do\nPresident Trump has denied all the allegations the Washington Post it now reporting that Turkish officials say they have audio and video evidence suggesting that missing reporter was killed in this how the consulate in assemble you're listening to ABC names [noise] this\nIs a special announcement for all Americans who'll back taxes to the ... states pay attention there's a special toll free hotline shut up especially for you this hotline will give you free information on how you can legally reduce or eliminate your tax that called the taxpayer hotline today\nAnd eight hundred for for one Nineteen forty three grab a pen or put the number and your cell phone eight hundred for for one Nineteen forty three you'll speak with qualified professionals who tell you how to stop the collection calls\nLetters bank ... wage garnishment and they'll deal directly with the IRS on your behalf so you don't have to even if you haven't found returns were you already earned a payment plan\nYou can still get relief new iris settlement policies that open the doors for a fresh start but hurry this won't last forever and your tax problem will only get worse if you do nothing or try to handle it yourself it makes a big difference in who you call\nSo called the taxpayer hotline today for free information eight hundred for for one Nineteen forty three eight hundred for for one Nineteen forty three\n... attack\nThe power of hurricane Michael reaching all the weight of a man and Oklahoma history I'm Ryan ... among the thousands of homes demolished by hurricane Michael was a condo owned by Jake Crandall of suburban Tulsa, Oklahoma he was watching TV coverage and saw his plays ripped off its foundation last year his Tulsa fitness club was destroyed by a tornado\nHad to totally relocate a gym rebuild them business he approaches\nHis run ins with the weather philosophically\nBuildings are building there's nothing that a hug while I'm due to lift the sphere to somebody and yes\nHe plans to rebuild his vacation home in Florida generally an ABC News\nThousands of voters in Georgia are now wondering if they will be able to cast ballots on election day in ... Georgia law says voters registration must match their driver's license Abdul Rashid salon says I'm In a dilemma now\nWhere I really don't know if I come here on election date of salt if I'll be able to vote\nThe registrations are being put on hold by the Georgia secretary of state Brian Kemp who was also the Republican candidate for governor\nWedding day when's your cats all\nThe British royal family gathering for the wedding of his daughter a Prince Andrew and Sarah Ferguson she got married to her fiance Jack Brooks bank and\nApple may be working out a way to fight robo calls\nNo I don't know ... Sarah Ferguson she got married to her fiance Jack Brooks bank and apple\nMay be working on a way to fight robo calls it as a reporter they filed for technology that would allow felons to detecting possibly reject them\nThis is ...\nOil and gas investments about a high degree of risk inner city will only for qualify FCC accredited investors if you're an FCC defined it credited investor getting ready to do your taxes and wish you had more than ... you can take action now\nAnd start planning for twenty Eighteen with one hundred percent IRS approved deduction invest with encore energy if you're a high net worth SEC defined accredited investor who's interested in participating directly with a proven operator and\nAre qualified to make an investment of at least two hundred and fifty thousand dollars in these called encore energy eight hundred eighty three eighty five eleven eight hundred eighty three eighty five eleven\nI'm Sherry ... ABC News\nThis is some counties news NPR nine forty WMA W.\nW. W. morning news\nCurrently it's thirty six at eight oh five are forecast today cloudy and cold high of forty two downright chilly tonight at a clear skies with all those thirty three and then maybe some sunshine for tomorrow\nTo get more for the weather I whether that are coming up in just a couple of minutes in sports the brewers have their pitching rotation set for the side of the playoffs tonight and it's the final night of the regular\nSeason for high school football we'll have details coming up WFL W news this morning brought you in part by Krieger jeweler in downtown ... good morning Michael\nGood morning Gary there'll be a special meeting of the Florida and concern city council at twelve thirty this afternoon to approve replacing a water main city engineer Andy ... says the problem started last week\nA main break on the street a near the intersection of Roosevelt on friday night [noise] um [noise] and the main or an ... type faster than we were unable to stop the er the flow of water out of the uh out of the main so\nWe're going to replace the main from Roosevelt too about Lucille street or on L. C.\nAnd get everybody back in a good water\nCouncils expected to approve a contract with bread for construction for the emergency replacement more news after [noise]\nThe birthing center at Fort healthcare is the best choice doctors and nurses and afford healthcare great expectations birthing center\nFort Memorial Hospital in Fort Atkinson are specially trained to care for free middle visit [noise] routine at high risk pregnancies labor and delivery plus postpartum\nFor health care has been designated that baby friendly facility one of only a handful in the entire state of Wisconsin the birthing center wants you and your baby to experience individualize care while making sure the whole family\nIs part of the experience you can enjoy all the comforts of home\nStarting with his spacious private sweet experienced the hydro therapy [noise] before and after ...\nPlus Ford healthcare has restaurant quality food service twenty four seven [noise] please visit ward healthcare dot com forward slash being [noise]\nBecause\nThey're getting a look at the rock river water town is up to four point seven seat this morning and the action stage and it still expected to peak at four point eight seat next week Jefferson's in minor flooding up slightly at ten point six feet this morning still expected to peak the moderate sledding stage\nOf eleven seat but not until Saturday\nThe weather service says the wrong at Fort Atkinson peak yesterday at sixteen point seven feet minor flooding said sixteen point six feet this morning and it's expected to grow up very slowly over the next week\nLike ... feet that eleven point zero to seat moderate flooding and it's expected also dropped very slowly over the next week hitting the minor flooding stage probably on Tuesday the national weather service forecast based on past precipitation and expected precipitation\nFor the next twenty four hours\nWisconsin farmers say crops are being weak in the end even ruined by nearly two months of wet weather and some are calling this year's harvest a miserable costly experience a hot dry conditions in July and August set the stage for damaged by heavy rainfall\nAnd standing water ... man facing of foreign sometimes O W why\nDavid Jamie Rio's has been bound over for a trial on multiple charges including hit and run resisting an officer disorderly conduct and criminal damage to property he's pleaded not guilty to all charges he's back in court November eighth\nIt has a Nineteen on this Friday morning Michael twelfth day of October two hundred and eighty fifth day\nOf twenty Eighteen which means there are eighty days left\nIt was on this day and fourteen Ninety two according to the old style calendar that Christopher Columbus expedition arrived in the present day Bahamas\nYes mhm uh what is it by the other gal and the Julian ... I'm not sure are women which calendar are we on\nUm I always get mixed up I I Do [laughter]\nOnly doing them thirty days I think to get there he month a stream which was and he did the same thing after that but it does right straight to the Bahamas or took the pilgrims three months they almost died\nYeah isn't that something a Seventeen Ninety two on this day the first recorded us celebration of Columbus Day was held democracy try centennial of Christopher Columbus is landing\nYeah mhm\nI was on this day in Nineteen fifty seven Michael the little Richard announced that he was giving up rock and roll per religion you later was ordained as a minister but eventually went back to playing rock and roll right ... because five years later he\nPlayed a gig in Liverpool within unknown local band called\nThe Beatles opening up\nFor 'em [laughter] yeah how 'bout that ha a Nineteen\nSeventy one the rock opera Jesus Christ superstar opened up at the mark ... theater that was on Broadway on this day\nAnd a seven Nineteen Seventy three president Richard Nixon nominated house minority leader Gerald are for to Michigan to succeed Spiro Agnew as vice president\nKnow overwhelmingly approved a everyone loved\nAh Gerry Ford or only in the course of became president the on the unelected mhm a president we've ever had\nServed for a brief time I saw it I still think he's ... deserves more credit than he gets a the time he took that seat and uh we were better off when he left when he yeah I think that he did things that were good for America and that's right\nNineteen eighty four British prime minister Margaret Thatcher escaped an attempt on her life when an Irish republican army bomb exploded at a hotel in Brighton, England that killed five people\nI don't know ... thanks a lot of guts to try to take down the iron maiden name shared\nA Nineteen eighty six the superpower meeting in ... Iceland\nEnded in a stalemate with President Ronald Reagan in Soviet leader Mikhail Gorbachev unable to agree on arms control or a date for a full fledged summit in the United states\n... interesting yeah Nineteen Ninety seven singer John Denver was killed when the uh his privately build aircraft crashed in Monterey Bay California he was only fifty three years old\nPrivately built yes ...\nI've heard I've heard stories that he did build it I've heard stories that he was collaborating on it yes\nOh boy I didn't know that yeah mhm yeah I was\nI thought it was an ultralight is what it was but yeah I'm not I'm not positive on as I remember I ... maybe even experimental\nYeah but yeah yeah right [noise] uh\nTwo thousand one NBC announced that an assistant to anchorman Tom Brokaw had contracted the skin form of anthrax after\nOpening up a threatening letter to her boss containing the powder ooh what a waiting yeah\nAnd finding on this day in two thousand seven former vice president Al Gore and the UN's inter governmental panel on climate change won the Nobel Peace prize\nOr sounding the alarm over global warming yeah mhm and I was in two thousand seven mhm alright remembered well yes that is our day in history here on W. F. A. W. Michael will be back at eight thirty with another news update for us this morning\nBody and cold today high forty two in southern Wisconsin right now we're at thirty six WFAN W and use time his aide twenty three time now for the ... report with Bill Scott\nFrom Wisconsin radio networks for his title town now with the latest from last year's meal [noise]\nSecond year Packers safety Josh Jones on a recent shows that he should play more in part because he's a second round draft pick my ... he had his Thursday news conference said Jones has to keep working and be ready to\nLike the fact that George Jones is pissed off 'cause there's no playing it 'cause if you want and then I'd be concerned so the fact that these hungry and he wants to get out there I think it shows you something about him but there's more to do with the\nPackers getting ready for their Monday Night game against the forty niners Randall ... returning to work and they worked in the rehab group yesterday which is a good sign that Aaron Rodgers could add more of his weapons available this week I'll have more after this [laughter]\nWhy would you like to go during and during the couple of months ago really zero tolerance is\nHarsh message I remember the clue to all of our kids right [noise]\nNo not really too\nAnd we don't tell them what we expect them why they shouldn't drink [laughter] how are they gonna taught me here you have more information visit underage drink enough sense to go try\nLooking for the lady's face from the\nCapital to catch up on local story for the details from last night's game no need to shop around for the best thing was gone for new Wisconsin radio network is the one ... everything happening in the badger state\nListen to this Wisconsin radio network station for hourly updates on this story that matter to you and visit Wisconsin radio network dot com twenty four seven to check out events happening across who say we got everything from legislative elements\nThat big tent up to ... even ... news archives yours day your news with guns in radio network\nThe Packers through five games are averaging twenty three points to contest quarterback Aaron Rogers says that's not going to cut it\nBelow and we kind of stuck at that number you know that a couple of times twenty to twenty four way up to twenty nine and wait to I'm not quite the standard and we've spent a year over the years I've often said everything we can have an office where they were going to have come out of training camp I told the guys we corners can be a work in progress Packers\nNeed to be better in the red zone as well they're sixteen trips inside the twenty yard line rank and the upper third of the league scored a touchdown\nIn those sixteen trips Packers worked through the weekend that face the forty niners Monday Night more than that match up on Monday on the Wisconsin waiting on the\nNews will you know watch some recovery from two days of plunging stock prices\nDow futures are pointing higher by more than two hundred points\nAspect futures or proportionally stronger than that and the standard and Poor's five hundred looks to open more than twenty points higher the advances in the past that composites outlook before the opening bell can be a tribute to analysts upgrade so Netflix and Microsoft Microsoft apple alphabet and Twitter shares we're all up to ... percent or more\nIt's apparently not if but when Sears will file for bankruptcy Reuters reports that seat you Eddie land for is exploring a bit for some of the retailers businesses in real estate once it files for bankruptcy Sears annual sales have dropped nearly sixty percent and the Justice Department's top aide to trust lawyer says Time Warner is attorneys threatened to quit\nOnce it files for bankruptcy Sears annual sales have dropped nearly sixty percent of the Justice Department's top Eddie trust lawyer says time Warner's attorneys threatened to quote employee personal attacks if the agency tried to block the company's eighty five billion dollar merger with AT and T. generally an ABC News\nThe W. F. A. W. community calendar is brought to you by furnished one two three and Watertown need a little help make life easier with live chairs in power which liners now at the lowest price possible\nThe Jefferson County parks department has an opportunity for first time use hunters between the ages of ten to fourteen can participate in a limited gun deer hunting\nPortions of ... county park in November applications will be accepted October Fifteen through the twenty six for more information called six seven four seven two six zero to randomly selected hunters and their chaperones will be required to participate in to our orientation with Jefferson County park is asked to review the rules of the ... founder east and the properties\nApplicants must also be that's a valid with guns and gun ... [noise]\nThe W. F. A. W. community calendar was sponsored by American wholesale furniture and Fort Atkinson making life easier with lift chairs in power climbers now at the lowest price possible\nNine forty W. F. A. W. dot com\nWas only six more friday's until Black Friday today a sneak peek at some of the deals we know about so far can commandos consumer ... get the free can add up high cats them on apple pie cats and Google Play this week the best legitimate ways to make money at all\nThe time to find your Black Friday shopping is right now TVs are always on Salem crying I'm expecting to see a forty inch for K. smart TV for less than one hundred and fifty dollars and Seventy inch TV will be under eight hundred\nNow crown books in Android powered laptops will be in the one hundred dollar range windows laptops with intel processors and the goodies well started two hundred and fifty dollars for sure Amazon will put their echoes fire TVs tablets an e readers on sale\nAnd plan on shopping online not only do online sellers have more product in stock he won't have to throw it down like its hockey night if things get tense and the aisles\nI'm Kim commando\nEveryone knows sleep is important especially for your health\nThe mattress you sleep on effects whether you'll have a good night's rest or not and that's why I Want to tell you about my new Casper Sleep mattress actually cruel and comfortable every night thanks to the unique combination of farms that provide the right pressure release and a line that\nAnd I know that once you try Caspar here in love yours as much as I Love mind switching to Casper it's a no brainer it's a high quality mattress at an affordable price Casper ships right to your door for free in a small how do they do that science box\nHere on nine forty W. F. A. W. we're looking at cloudy skies today and are not very warm high of only forty two and they'll be chilly tonight with clear skies and thirty three right now we're at thirty six W. F. A. W. would use time is eight thirty nine\nWhitewater ... Saturdays oh war hawks are on the road that over there and one of those six forty five will be there\nThis is the only done this joined me from ... far for the health care pre game show selling its will forty four on football they brought to you by feels due for insurance in for that can say first citizens ... and ... whitewater and by Ryan Reynolds hearing like cool one of those six forty five minute nine forty W. F. A. W. dot com\nMm it's not a matter of yes but a matter of when every athlete experiences pain meet Dr shelter um worth of beating associates and sports medicine only add more to health care\nWe take care of patients from the weekend warrior to the elite athletes\nAre all sorts of different joined paddling in at problems and pains we come to a shared decision as to what is their best treatment whether that'd be\nSurgical or non surgical nurse Marti medicine program involves many different team members from nursing staff highly trained visible therapists to Moscow scalpel radiologists\nWe working together to take good care of each individual one procedure that out you lie is free CEO surgery the newer in time and time which is called the ... the ... the smaller fish and there's lots of course not remain calm and laid back to their sport reliably and a little more comfortable in\nFort healthcare orthopedic associate sports medicine observing ... and then surrounding communities visit for the health care dot com forward over here [noise]\nWarriors and wizards festival the portal to your face\nThe routing community visit board healthcare dot com forward healthier\nWarriors and wizards festival the portal to your fandom warriors and wizards where the world's they'll die science fantasy make cuts plenty of virtual reality coming to Germany in Wisconsin It's October nineteenth the twenty first order wristbands on line at warriors and the wizards festival dot com\nYour ... family dentals primary concern they understand the optimal oral health begins with your regular visit and to make those visits more relaxing enjoyable ...\nWhen you arrive juice from your but a blanket neck covering that can refresh my ... family dental even offers laughing gas but those were they ...\nThey want you to put your fears eased during your vision\nGet to know each family dental import academic schedule your appointment today call and I do zero five six three twenty nine twenty eight\nOpening now when you're pointing higher up for two days have sharply lower training that lost over five percent about Thirteen hundred points over the past two days clear skies over the Florida Panhandle shining although work that's left after hurricane Michael FEMA administrator Brock Long just smoke he says part of the focus now will be on health care\nLaw hospitals took a tremendous hit we been I'm assisting to state and local governments to evacuate patients get them stabilized I'm it's my understanding that we've also set up what are called decompression units over three\nRight now um these are basically ... senators to backfill medical support where we've lost the capability of the of some of the hospitals death\nToll after Michael's march through six states is now at least eleven crews are working on well over a million and a half power outages as well\nThe Turkish government may have audio and video evidence showing that are missing reporter was killed in the Washington Post says Turkish officials say they have recordings from inside the Saudi conflict and assemble ... it was last seen Jerry Preston Amy\n[noise]\nYou've bought a new home congratulations before you start moving those boxes follow these gifts from the truly a real estate pros get names and numbers the contractors from your realtor realtors often have the best list of plumbers painter and more that you'll likely need down the road\nReplace all the batteries in your smoking carbon monoxide detectors or replace them with new ones and take a walk around the block and introduce yourself to your new neighbors\nThe brewers are the game on the national league championship series against the Dodgers at Miller Park tonight down bill Scott what sports they'll send geo ... dollars to the mound against the Dodgers Clinton current job you\nGot to give them the best you got and the way I told councils like any way you need me any style of pitching arm in you know this is an opportunity I get to share with a bunch of great guys and hopefully I'm you know we can send your success and keep riding the high that we're living right now so\nI think that um for me I Want to be part of it any way possible and I think that whatever companies me to do to pitch and get out I Want to be their\nBreweries when three and four against the Dodgers this season but finished with the best record in the national league brewers payroll or wanted with ten million the smallest of the four teams remaining in the baseball playoffs\nDodgers currently spending one hundred eighty seven million player salaries Boston top some of his\nUh two hundred thirty three million ten Frank badgers will be without defensive and I say a Loudermilk on Saturday Night at Thirteen Frank Michigan they'll also have several game time decisions in their secondary the same secondary that surrendered four hundred and seven passing yards against the brass could last week the badger linebacker T. G. Edwards says there's no lack of confidence in that group\nNo not at all and I think that's part of being a D. V. and I found out that front to get pressure to make sure that they don't have to cover for fixing the place so I think they did it and got his job as we could ask for them and I know the races for\nHockey badgers open their season of the cold center tonight against ... Boston College badgers play Fifteen of their first sixteen against ranked opponents coach Tony Granada said Boston College will be a good measuring stick for his young team\nThey skate thing a great talent that I don't know if it's a test her for us but it's certainly a great indicator of where we will be able to compete with the ah the league teams in the nation this year so I'm looking forward to it where to grade class to two years have been country great games with them and I'm sure it'll be entertaining me for ...\nBucks at ... Mohammad trimming the roster to Nineteen players they'll close out the pre season tonight against Minnesota advice or poor you got the sounds of radio network\n[noise] attention men under the age of thirty five you know would really improve residents of\nThe ladies when the guy has a few drinks and later get pulled over for both driving costs you around ten thousand dollars in fines legal fees and increased insurance rate goes let's grab dinner in a movie now I Know you drive more carefully when you're bust\nYou've proven that hundreds of times in a woman in Myers that kind of confidence and you practice how to speak if a cop does pull you over slowly clearly politely like good evening officer\nAnd a woman in Myers that kind of force\nAnd one woman doesn't find it at the door of all the ukulele bugs even though the law tilted drawn\nYou can get ten thousand dollars you can buy along with any chance of having a girl because nothing says I'm a catch more than a guy who lives in his parents' basement and comes it's my place\nBugged busted embroiled because bus driving is drunk driving a message from the national Highway Traffic Safety Administration and the ad council ...\nAre you having trouble with me him more shoulder pain meet Dr ... Bronner ... associates and the center for joint replacement only got more health care\nWe really work with patients to determine what the treatments going to be for them and to decide whether the replacement or if they can still hold off on it\nOr Center for Jordan replacement brings a complete team of orthopedic surgeons collectively seven decades of surgical experience and special together working to create the best possible outcome for your program coordinators what are you from preemptive education in three or ...\nPercent of the way to get you home\nThat was a big associates or over on patient satisfaction rapid recovery and returned home rights as one of the highest in the state\nBoard healthcare Martha ... associates and Center for joint replacement serving Fort Atkinson and surrounding communities visit board healthcare dot com\n\nI'm Scott answering what NFL Network now are the Westwood One radio network\nThe eagles were back to their winning waste on Thursday night after losing two in a row they stormed back with these high thirty four points against division rival New York football giants the final from the Meadowlands\nThirty four to Thirteen it was it good news for Philadelphia veterans offensive lineman Jason Peters suffered biceps injury during the third quarter\nPeter Smith the majority of last season after suffering a torn ACL and M. C. L. in his white meat\nAaron Rodgers missed practice on Thursday says he had a setback for his knee injury Rogers telling reporters helped to be back on the fields friday and\nHopefully be good to go Monday Night against the forty niners Green Bay did get back to autumn oh Alison Randall comeback after ... for the limited after missing last week's game it's just an NFL networks out on the west was won radio that\nAnd Randall come back after ... for the limited after missing last week's game it's just an NFL networks out on the west was radio that [noise]\nNothing decorating they apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to grade this and it's easier than ever with age lists male max the patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases in muscle sauce and twice\nThe reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym\nAnd in the bedroom take your manhood to the max by try your first dirty diaper bottle free shipping and handling not ten days not Fifteen days but of full thirty days supply free when you text the word fast to Seventy nine Seventy nine Seventy not\nFiling a formula that boost total testosterone if you'll results with age will smell ... to attach please decrease use for your free bottle text fast to Seventy nine Seventy nine Seventy not text S. A. S. T. to Seventy nine Seventy nine", "year": "2018", "show_name": "WFAW News", "city": "Fort Atkinson", "day": "12"}