{"month": "10", "state": "AZ", "station": "KOFA", "content": "Or we also broadcast on the Arizona community radio network at eighty nine point five FM K Jay Z a drag William Ninety point one F. M. K. J. D. P. Prescott navy point seven ... kj decay Kingman and Ninety One point three FM in Flagstaff\nSunny skies and humid today highs reaching up to Ninety five they come north east wind blowing throughout the day with mostly clear skies in the evening it all over around sixty six in Kingman sunny skies ties reaching up to eighty three and northeast wind up around six miles per hour blowing into the evening was clear skies no love around fifty five\nIn Prescott sunny skies behind you're Seventy six months to clear in the evening love around forty six but some light variable wins in Flagstaff sunny skies hind you're Seventy today mostly in the evening what they'll do around thirty eight\n[noise]\n\nTo\n\nMusic from Mickey Yamanaka gets called ice storm her CD Mickey M. I. K. I. she is on piano bill Stewart on drums in Orlando the slamming on base steep melted joints that group on fights on a few cuts on this CD as well\nThe I have it you're listening to jazz what they want it is terrific to have you with us\n\nWe have ... Nash and his quartet recorded it does each club Coca Cola in March of twenty Seventeen that's the name of the CD I've a disease club Coca Cola with Ted\nOn a variety of read instruments Alto sax clarinet flute pick a low weren't wall says I'm vibes Gary per se son piano Rufus read on base and that will put on drums here's the opening cut Ted counts it off it's it's too called organized crime [noise]\n\nHow much name ...\nNo no mine\n...\nNo um\nAnd I think to myself\nWould oh wonderful I'm\nDon't want to know a\nLittle more on um\nNo one from um [noise]\n\n\nWhat a wonderful version of ... John but to east for me to see the Hollywood African and what a wonderful world John piano and the company you're self as he thinks those wonderful lyrics\nHow different that version is of course from Louis Armstrong's the classic rendition done many years ago now and other people John makes its own there\nFor Hollywood African what a wonderful world John but the state's featured on a recording with the jazz at Lincoln Center orchestra you music of John Lewis well here is John Lewis\nAnd the modern jazz quartet John Milt Jackson co founders of classic\nMill gun fights John a piano perceive Don basic Kenny Clark on drums the original makeup of the modern jazz quartet\nThis goes back to the mid Nineteen fifty for this record\nRichard makeup of the modern jazz ... jets just goes back to the mid Nineteen fifty for this recording one of their best known to ... John's best known to junk\n\n\n\n\n[noise]\n\n\n\n\n\nA Nineteen fifty for recording with the modern jazz weren't checked and John go that opens up the classic prestige album John go from the modern jazz worked at John Lewis piano Milt Jackson ...\nGo that opens up the classic prestige album John go from the modern jazz quartet John Lewis piano Milt Jackson vibes perceived on base and Kenny Clark on drums the original modern jazz quartet jungle\nWas the first name of a guitarist named jungle Reinhardt who died in Nineteen fifty three and this is John ... tribute to bat guitarist probably one of the first recordings made in December of Nineteen fifty four of what is now definitely a classic jazz to John go\n\n\n\n\nPerfect\n\n\nFor her book during the\nTo turn\nTurn\nTurn\n\n\nWhat are you sure they're speaking English and German to his German audience\nThe German audience being in Bremen, Germany in Nineteen eighty three and what are you soon as he said Katrina ballerina or watch three four to one of many great things that he gave us\nWhat are you there and drop it grew Miller on piano stepper James on base and Tony read it on drums\nThis Tuesday D. set it's called live in Bremen Nineteen eighty three but not released until two thousand Eighteen certainly glad to have this out Michael Cuscuna produced this re issue\nAnd lights on the back of the book that's amazing concert is a testament to all that is great about what do you show up very very true indeed\nYou're listening to jazz with age one here is John ... late and his mom gets drop and light blue\nNo no no no no no\nNo no no no\nNo no\n[noise]\nMhm [noise] mhm oh\n\n\n\n\n\n\n[noise]\n", "show_name": "Jazz with Neil Tesser", "year": "2018", "city": "Yuma", "day": "27"}