{"month": "10", "state": "AZ", "station": "KOFA", "content": "In a community radio network at eighty nine point five FM K daisy a drink Williams Ninety point one F. M. J. D. C. P. Prescott Ninety point seven F. M. J. D. C. K. king then in any one point three FM Flagstaff\nMostly clear tonight and you're my love around sixty three that Wendy tomorrow with sunny skies behind your eighty six in ... partly cloudy all over around fifty for tomorrow sunny skies but behind you're Seventy two a bit Wendy ... out there with one gets up to thirty one miles per hour\nIn Prescott partly quiet each idle over around forty five tomorrow mostly sunny but behind you're sixty seven and a bit breezy in Flagstaff partly cloudy this evening all over I'm thirty eight there is a thirty percent chance of showers tomorrow mostly sunny but the high end you're fifty eight\n\n\nFriends [noise]\n\nThat gets on tenor saxophone Charlie Bird on guitar and the album that they may together in Nineteen sixty three called jazz samba which was really the beginning of Americans love affair with the ... thank God\nYou're doing the jazz when Neal Chester here's something recent from a Brazilian saxophonist and composer ranger his name is Jay up we'll never\n\n\n\n\nWant to do\nMy making love\nPlenty and Dr Jay her album embrace to blow you featured her versions of ... of songs from the great American song book here's another written by Cole Porter as was that one from van Morrison\nSo do do do around ...\nTo be around go how are the\n... may or may\nSoon be chained up on\nBut I just get a check though you\nChange from ...\nI'm sure\nA man may well be a\nGood kid and he's\nA general how your rent\nNa na na na\n\n... fighting about uh\n\nThen about a man\nTo be\nReally cool yeah\nDo play\nNew a\nNew system\n\nThe low then there\nWas a good uh you\n\nCan rent a man\nA\nMan\nMy\nYou know and the\nTwo\n\nA month ago a deal I'm Around the\nCheck\n\nI don't know\n\nIt's only a paper Luna that terrific stole from Lester Young on tenor saxophone so terrific is so low that Eddie jumpers and later put lyrics to it and share\n\n\nKnow to mystery and we were\nMedicaid they\nOne day at all although\nYou hear all and you you jump\n\n\n\n\n\nNa\nIt's Art Blakey Jazz Messengers and one of the best albums that that group recorded and remember that group includes many different chapters are like huge Jazz Messengers was banned from the Nineteen fifties\nRight through the late Nineteen eighties and there were many great musicians who were part of it in different the ensemble fall under the name Jazz Messengers but even so you're going to make a list of the five or six best Jazz Messengers albums this one should be on it it's called the big beach\nIt's from Nineteen sixty with me Morgan on trumpet Bobby ten minutes at the piano Jimmy merit on base of course was Art Blakey on drums\nAnd a winning shorter on tenor saxophone who had recently joined the band at the time of this recording in Nineteen sixty those wind shortage composition called Leicester left town which was written in honor of Lester Young who had passed away a Thirteen months before this recording session\nSo it was too young died in Nineteen fifty nine in Nineteen sixty nine when shorter recorded this tune for the first time\nWith Art Blakey Jazz Messengers Lester left town at the beginning of that set up three we heard Charlie Parker one of the Lester Young great proteges\nAnd a recording of lady be good for Nineteen forty Charlie Parker would the Jamie ... orchestra one of the earliest recorded so low\nIn his ... and in the middle of the ... as I mentioned a radical transformation you could call it a a metamorphosis on the two lady be good but actually the guys who wrote is called the mood of amorphous is when they handed it to the ... led by James Moody the tenor saxophone us\nUp for this recording with James Moody's modernist James Modi didn't play solo on it as it turns out they burned the trumpet solos was one\nSo that's a for this recording with James ... modernist James Moody didn't play solo on it as it turns out they burn the trumpet so this was one of the co writers and you also heard Cecil pain I'm baritone sax\nThose things Iran jazz menial task I mentioned earlier you were listening that the DJ higher album is called a far from over featuring BJ Irish section ... had been named the album of the year in the NPR jazz critics poll a here's a good example of why\nWe also want to catch on the Arizona community radio network at eighty nine point five FM kj the aid raped while in Ninety One FM kj ... press get Ninety seven FM cage eighty K. Kingman and Ninety One point three FM black stuff\nMostly clear tonight new model Loeb around sixty three a bit when you tomorrow with sunny skies behind your eighty six in ... partly cloudy all around fifty for tomorrow sunny skies but behind you're Seventy two big Wendy ... out there with one gets up to thirty one miles per hour\nIn Prescott partly cloudy China Loeb around forty five tomorrow mostly sunny behind you're sixty seven and a bit breezy in Flagstaff partly cloudy this evening lower I'm thirty eight thirty percent chance of showers tomorrow mostly sunny but the high end you're fifty eight\n\n\n\nNa na\nTo generation represented on this album from Harold may burn the yeah that was in his eighties as is the drummer Jimmy Cobb whereas\nThe basis that read this and the tenor saxophone Eric Alexander are both the mirror\nEighties as is the drummer Jimmy Cobb whereas the basis that Reeves and the tenor saxophone us Eric Alexander are both the ... mid forties perhaps hitting fifty Israel may burns album called to love and be loved it the title track\nYour during the jazz with Neil ... and this is the Baylor project\nFrom the [noise]\nNo [noise]\n\n\nYou know\nMy son has long\nAh yeah I'm sure a\nMan and then I\nKnow who are\nRich as the nine\nLet's just say hey\nShane\n\nWell the pretense Miller quartet with the John Coltrane composition Liberia here's Jeff Brad field and hurry from his album African flowers\n\nThe first person in the wrong\nPerson and the energy to\nNeeds to be the deeper and deeper searching\nFor me to\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\nBut [noise]\n\n\n\n\nAnd Janice Justin Coughlin from their duo album synesthesia which came out at the end of two thousand and Seventeen years I'm not going\nOh\n\nI\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\nEighty nine point five FM McKay Jay Z a Drake Williams Ninety point one FM cage easy the Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three of them Flagstaff\nMostly clear tonight new model of around sixty three a bit Wendy tomorrow with sunny skies behind your eighty six and king tonight partly cloudy all over around fifty for tomorrow sunny skies but behind you're Seventy two a bit Wendy ... out there with wind gusts up to thirty one miles per hour\nIn Prescott partly cloudy China Loeb around forty five tomorrow mostly sunny but behind you're sixty seven and a bit breezy in Flagstaff partly cloudy this evening Loeb around thirty eight there is a thirty percent chance of showers tomorrow mostly sunny but the high end you're fifty eight\n\n\n\n\n\n\n[noise]\n\n\n\n\nJust not really in the trio comprise Amy out the facts on the Missouri the basis of ... and on drums Jeremy Cunningham they called the album triangular him\nIt was recorded in Chicago where all those musicians live and you're right here on jazz with menial task here where we have some more music from Chicago for another trio coming up next\nThis one led by pianist Paul ... all the album is called flow\n[noise]\nNa na\nThe bus rode dream\nRichard Li oh\n\nMalone and then\nWas\n\nJust one Medina here's Ron Miles\n\nThe\nTo protect\n\nTo talk to people\nRule\nTo work for the rest of the book with with us to talk to your\nWhen the\nA week to go to the\n\nDe\nDe la ... de\nMan\n\n\nThem to\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise] Mm\n[noise]\n... ...\n\n...\n[noise]\n[noise]\n\nOr no no no no not at\nTalk\nThing\n\n\n... ...\n...\n\n\n...\nMm Mm\nMm\nNa na\nFor\nA\n\n\n\n...\n\n\n\n...\n\n\n... is from an album called Sonny Rollins next album\nThere were so title because the people who have been wondering when it's sunny round going to release his next album\nThis one came out in Nineteen Seventy three at the end of a period of several years was one of so many rounds it's periodic sabbaticals and he had been away for music people were wondering whether they be back well he came back\nFor that album which creature George tables on piano Bob crunch on base and David Lee on drums and studying and is exquisite version of skyline\nSo he runs was famous for those unaccompanied condense is either at the beginning or end of a tune that version of ... had an other company could ends up on both ends and it's one of the reasons it's really a one of the great recordings and Sonny Rollins is just got graffiti\nYou're doing the jobs Bill Tancer here is Jerry burden [noise]\n[noise] [noise]\nOoh [noise]\n\n\n", "show_name": "Jazz with Neil Tesser", "year": "2018", "city": "Yuma", "day": "30"}