{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the Arizona community radio network at eighty nine point five fab kj the age ... Williams\nNinety point one FM J. J. D. V. Prescott Ninety point seven ... kj decay Kingman in Ninety One point three of them in Flagstaff\nSunny skies today in Yuma high near Ninety degree partly cloudy skies in the evening with the Loeb around sixty seven twenty percent chance of showers throughout the day in Kingman today mostly sunny skies hind you're Seventy seven and a bit breezy out they're mostly quiet in the evening Loeb around fifty eight slight chance of showers in Prescott today mostly sunny a high and you're Seventy\nBreezy in the evening about twenty miles per hour wind gusts with mostly quiet he's got a little round forty six slight chance of showers in ... partly sunny hind you're sixty in the evening mostly cloudy hello around thirty nine\nThere is out the saxophonist and composer Jeff Newell from his CD called Jack the ripper\nAnd uh the last two on the CD as a matter of fact it's called pops B. U. S. s S. Jeff are now do Steve newly on on piano Larry Cole base and rich white it can drums welcome aboard you're listening to jazz with Dave one great to have you with us\n\nAll things going very well for you and we hope the music makes it all even better I Love the CD by Christian McBride big band called bringing it but you're the opening cut getting to it\n\n\n\nMean what you say music by bad Jones and played there by Russell Malone that's from his CD sweet Georgia Peach Russell Long guitar Ron Carter on base Kenny Baron on piano when Louis Nash on drums how 'bout that for work Chet\nHow about this for real money Alexander on piano rape brown on bass and herb Ellis on guitar\nIn the Nineteen eighties and early nineties they build themselves as triple treat came out with several CDs on the Concorde jazz labels crippled treat one two and three or something for triple treat three muddy Alexander's to renewable [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nNineteen fifty eight or seven to be exact the the lawyer spoke worked at the five spot in New York monk piano Johnny Griffin on tenor I met up with my league a base in white hands on drums history making set riverside records was there for it\nThat was from the album ministerial show the first two albums put off by reverse\nThe history making such riverside records was there for it that was from the album mysterious to the first two albums put up by riverside for most steps the other being so lonely if you're an action\nI had a chance to talk to the great Johnny Griffin a couple of times but I never asked him about the sex that's my mistake I'm sure there were some great stories that she had about playing with Mr monk you're listening to jazz with big one\nAnd up next the sand new some quintet with Sam ... notes that on vibes ... James genocide base Billy ... drums\nThe CD is called Sam I Am and the Tunis called I thought about you know\n\n[noise]\n\nMm\n\n... ...\n\n\n[noise]\n\n\n\n\n\nNa na na\nNa\n\n\n\n\n\n\nSays\n", "year": "2018", "show_name": "Jazz with Neil Tesser", "city": "Yuma", "day": "20"}