{"month": "10", "state": "PA", "station": "WVYA", "content": "Here on WB I ate and stay tuned is Jasmine cure a scaled down in about ten thirty PM WB I Am FM will be doing some transmitter maintenance and will be off the air for a while though W. B. Y. A. W. T I O N O W up um\nP. A. you will remain on the air uh so uh if you're listening at a WB I ate there'll be some\nDowntime is we do some electrical work at the w._b. I transmitter site around ten thirty or so\nBut stay tuned into jazz from cures girl coming up momentarily on WB ... [noise]\nThe w._b. I Am Sam eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre Eagleton W. B. Y. eight eighty nine point seven FM Williamsport W T I O idiot ... Mansfield and they will give you Ninety One point five ...\n\n[noise] well no\n\nAbout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\nName\nNa na\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is W. B. I. F. M. eighty nine point nine and W. B. I. A. F. M. H. D. one Scranton Wilkes Barre equal WTY eight eighty nine point seven ... Williamsport W T I O eighty eight point three I've had ... Mansfield and W. P. A. U.\nNinety One point five ... like while the ... act\nWith translators in Clark somebody Ninety point three\nAnd pots bill at Ninety four point nine and on the Web at W. B. I. A. dot org\n... ... ... ... ... ...\n\n\n...\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\nMm\n[noise]\n\n\nMm\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] and [noise]\n\n[noise]\n\n\n\nMm\n\n\n\n\nMm\nMm\n\n\nMm\nMm\n\n[noise]\n\n[noise]\n\n[noise]\nMm\nMm Mm\n\nMm\nMm\n\nMm Mm Mm\n[noise]\n\n\n\n[noise]\n\n\nLet's say it's W. B. I asked him eighty nine point nine and W. B. I. A. F. N. H. D. one Scranton Wilkes Barre Eagleton\nW. V. Y. eight eighty nine point seven FM Williamsport double duty I oh eighty eight point ... Mansfield\nAnd W. P. A. U. Ninety One point five ... with translators and wells girl with one of those three point five and Louis bird at one hundred Twenty one and all the way up at W. B. I. A. dot org [noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nThis is W. B. I. F. M. eighty nine point nine at W. B. I. S. H. D. one Scranton Wilkes Barre April ... W. B. Y. eight eighty nine point seven eight and Williamsport\nW T I O eighty eight point three at the main square Mansfield and W. P. A. U. Ninety One point five in Palmyra township with translators in east scrounge\n[noise]\nThey say it's W. P. I. S. M. eighty nine point nine in W. B. I. E. S. M. H. D. one Scranton Wilkes Barre eagles W. B. Y. eight eighty nine points ... Williamsport W T I O ... Mansfield and W. P. A. you know the one point five ... my retention\nWith translators in east Strasburg get Ninety three and Bethlehem at one point and on but we do you feel like a dumb\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\nMm [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\nMm Mm\n[noise]\n[noise] [laughter]\n[noise] [noise]\n[noise]\n[noise] [noise]\nMm\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\nSo does\n\n", "show_name": "The Chiaroscuro Channel simulcast", "year": "2018", "city": "Williamsport", "day": "04"}