{"month": "10", "state": "PA", "station": "WVYA", "content": "Eighty eight point three if that means Burke Mansfield at W. P. A. U. Ninety One point five FM Palmyra township streaming live at W. V. I. A. dot org we're in Wales borrow at what a three point five listener supported public radio W. V. I. A. ask them\n\nWhat is it cloudy this evening with a forty percent chance scattered showers for the overnight lows in the upper thirties partly sunny on Sunday with a twenty percent chance of mourning rain and snow showers highs and the lower forties\nPartly cloudy and Sunday night with Lowes in the lower thirties mostly Saudi on Monday was hiding the lower fifties\nAnd mostly Claudia Monday Night was losing the lower forties you are listening to ... ... [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\nKeys to the\n\n\n\n\nMhm\nI'm\nTo do\nMm\n[noise]\n\nBe there for that and indeed and you didn't you didn't know that it would be that they didn't\nThat he needed needed and then\nThey needed\nThey\n\nAnd then in the mid ... and then they they\nHave it in the bank\n\nDa\nDa da da\n\nDa\nDa da da da\nDa da da da da da da\n\n\n\n\n\n\n\nDa\n\n\n\n\nDa da da\n\n\n\nDe de de de de de\nDe\n\n\n\n...\nDi di di\n\n\nOut of nowhere\nYou know all\nLong\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] oh\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n...\n\n[noise]\nShe you\n\nNot this is W. B. I. A. F. M. eighty nine point nine and W. B. I. A. F. N. H. D. one Scranton Wilkes Barre Eagleton\nW. B. Y. eight eighty nine point seven eight and Williamsport W T I O eighty eight point ... Mansfield and W. P. A. U. Ninety One point five at Palmyra township with translators in wealth girl with one of those three point five\nAnd Louis bird at one hundred Twenty one and all the way up at W. B. I. A. dot org [noise]\n\n\n[laughter]\n\n[noise] [laughter] [noise]\n\n[noise]\n\n[noise] [noise] [laughter]\n... ... ...\n[noise]\n[noise] [noise]\n\n[noise] [noise] there\nA\nAnd they're just um\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n... to\n... [noise]\nFor them to be\n\nAnd\n\nA\n[noise]\nLet's say it's W. P. I. F. M. eighty nine point nine at W. B. I. F. M. H. D. one Scranton Wilkes Barre handled in WTY eight eighty nine point seven FM Williamsport W T I O eighty eight point ... Mansfield and W. P. A. U. Ninety One point five at him Palmyra township\nWith translators in east scrounge work at Ninety four point three and Bethlehem at one point seven and on the Web at W. B. A. dot or\nWe have a very special treat especially me ... first here all the instruments teacher now good friends\nTo join us for this that it didn't lose the\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nMm mhm\nMhm Mm\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\nMm [noise]\n\n\n[noise]\n\n\nThey say it's W. B. I. F. M. eighty nine point nine W. B. I. A. F. M. H. D. one scratching Wilkes Barre he'd gotten WTY eight eighty nine point seven FM Williamsport W T I O idiot point three have him ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township with translators\nIn Allentown at Ninety nine point three and some very at one oh five point seven and around the world Wide Web at W. B. I. I. dot org\n[noise]\nMhm Mm mhm Mm\nMm Mm Mm\n\n[noise]\nMm Mm Mm\nMm Mm Mm\nMm\n\nMm\nMm Mm\nMm Mm\n[noise] Mm Mm Mm [noise]\nMm Mm\nMm Mm\nMm Mm Mm Mm Mm\n[noise]\nMm\n\nMm Mm Mm\n\nMm\nMm\nHe ...\nHe did it they ... [noise]\n[noise] [noise] [noise]\nThe ... the ...\nThe the [noise] the the ...\nAnd ... ...\n... Mm\n\nMm\nNo that's funny [noise]\nUm it's national\nLoving score on it\n[noise]\nTo\n\nBe used as tools [noise]\n\n\nBeautiful to take a ...\n...\nYou\n\nAnd I'm thinking\nWould my\n...\n\n\n\nTo love this\nBeing\nThe\nIt's a problem with them and they\n\nJust charge angel easily\nFor\n\nSometimes thinking\n\nI let you go\n\nTo those would be good\nNews is to\n\nIn the ... mhm mhm\n[noise] ...\n... ... ... [noise]\n\nMm Mm\nMm Mm Mm\nMm\n\n[noise] ... ... ... ...\n...\n... ... you know a\n...\n... ...\nHe made [noise] [noise]\n...\n... ... ... ...\nMaybe ...\n\n... ... ... ... Mm Mm Mm Mm Mm\nMm\nMm to [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n\nWe think we are in like\nThis is W. P. I. F. M. eighty nine point nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre equal WTY eight eighty nine seven ... Williamsport W T I O idiot point three ... Mansfield and W. P. A.\nNinety One point five percent Palmyra township in like woman ... packed\nWith translators in Clark somebody Ninety three and pots bill at Ninety four point nine\nAnd on the Web at W. P. I. A. dot for\n\n[noise]\n\n[noise] well\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\nOf all for the phone from her\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nDa\nDa da da na na\nNa\nNa\n[noise]\n\nThink the w._b. I Am FM eighty nine point nine W. B. I. A. F. M. H. D. one Scranton Wilkes Barre Eagleton W. B. Y. eight eighty nine point seven at the end Williamsport W T I O idiot point three up in Maine ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township\nWith translators in Allentown Ninety nine point three and some very at one point seven in the world Wide Web at W. B. I. A. dot for [laughter]\n[noise]\n\n\nI'm who grew\nSomebody very\nMuch sweet sweet\nSweet sweet sweet\n... would it would have been the story she wouldn't let you be able to look stupid you mix of people would never be the food\nTo believe that movie was about Jimmy to lead the lead\nBeen saying don't\nStill mainly people\nShare that everybody would be willing to\nShare their being demeaned though last year the girl's name what am\nDo to recruit him in the mood in\nLooters a\nYou been able\nFew close you know\nYou're going to Japan and you grab the bans\nThey're going to just be able to go with the judge integrated they\nI mean\n\n\nThe w._b. I asked him eating nine point nine and W. B. I. S. M. H. D. one granting Wilkes Barre equal WTY eight point seven ... when you're poor W T I O ... Mansfield W. P. A. U.\nNinety One point five percent palm I recount shouldn't like one of the pack\nWith translators and Clark summit in Ninety three and pots bill at no point in my hand on the Web\nWPRI a dog or\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nMm Mm\n\nMm\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n[noise] I'm In the first person to person\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[laughter]\n[laughter]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n[noise] it's not just leave\nThis world as far as like you say you strip searched highly Caesar makes a few years we just return\nOn central time at\nLeast several years Mr\nMom I'm Jewish [noise]\n\nHe\n\n\n\n\nMan hey you\nKnow\nThe keys [noise]\n\nMind\nDrums on\nThat no one [noise]\nMy name is Jean ...\n...\nWith no man see\nMinutes you know\n\n[noise]\n\n\n[noise]\n\n\n\n\nYou need to\n\n\n\nDo\nI'm a\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\nBen [noise]\n\n[noise]\n[noise]\n\n\nYeah they do\nThey they they they don't have the da da da da da da da da da da da da da da da da da da\nDa da da da\nDa da da da da da da da da da da da da da da da da da da\n\nDa da da da da da\nDa da da da da da da da da da\nDa da da da da da da\nDa\nDa\nDa\nDa da\n\n\n\n\nGot a boy\n\nJohn nice all the negative\nThat we\nYeah along with Jane negative name on the euro\nAsia the scary thing [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\nTo do on\n\n\n\n\n\n\n\nEspecially it's W. B. I. S. eating I Know I and W. B. I. F. M. H. D. one Scranton Wilkes Barre equal W. B. Y. eight eighty nine one seven ... Williamsport W T I O ... Mansfield in W. P. A. U.\nNinety One point five at Palmyra townships like while the ... act\nWith translators in Clark summit in Ninety three and tax bill at one point nine and on the Web at W. B. I. A. dot org [noise]\n\n\n[laughter]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise] they say it's W. B. I. S. eighty nine point nine and W. B. I. E. M. H. D. one Scranton Wilkes Barre\nW. B. Y. eight eighty nine seven eight and when you sports double duty I old ... ... Mansfield and W. P. A. U. Ninety One point five ... ... my retention with translators the wells barrel when one of three point five\nAnd ... at one point one in the wind at W. B. A. dot org [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\nMm [noise] Mm\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\nMm Mm\nMm Mm\n[noise]\nI hear [noise] thank you very much\n[noise] I hear\nYou very much and I don't\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\nAnd\nA\n\n\n\nDo do\nDo\nDo [noise]\n[noise]\n\n\n\nSo low that\n\nMore than\nThan they\n\n\nAre\n\n\n\n\nThen\n\nUh\n\n[noise]\n\n[noise]\nMm Mm Mm\n\nMm\nMm ... ... ... ...\n\n\n\n\nDa da\n\n\n[noise] oh\nOh oh oh\nLook I asked my old friend Daniel Moses bobcat hey baby I you're you're doing good and plenty of time with it\n[noise]\n[noise] do you\n[noise]\nMan we used to\n\n\nMan we used to have some great ties together in this wonderful oh let's say you know that's ... that's right he was a good old boss weatherman wonderful\n... a month before time for you it's just they laid there to say they're\nAlways on time never related to yeah you gotta wait oh I didn't leave enough it was hardly and while he was a pro life things done right yeah and you soon Lauren that was everything was done\nThan the proper way after being without him outlandish bans getting some rather than ever where you come and it was like to get along with having liposuction joined ...\nAnd ... said they would let them build up the way they haven't worked land and that's where I didn't know how to hustle you still with us you told me not to come down to do with me to bring your base and I brought my base down then it was you do that in ...\nTo put on my second ... kept an eye on every voter arose bus out during our way whereas one is in a whiskey and they're always receptive to music and not have been over the whole book with clients\nWill an old foreign hustling to an outline a trailer it was brought back to my ... how to make a quick dollar and a half atmosphere\nYou're told me to take out your base go on the walking the saloon nobody invited us we just walked in and use it taking these out and and we used to play and it was as long as you're saying that's\nAll of my heart to Taiwan that mellowed the ... the\nBottom line\nTo bring them back and find memory ... do you do\nWhen we were ... years ago many of them was on the town of ...\n[noise]\nWe refer in running guy but oh\n\n... ... ... ...\n... ... friends who are there other than to your friend that you have to do that we have a\n... I'm going to be I Know what what do you listen to it\nOnce I was listening\nThat guy that saying oh no my thing is one more time for them and they didn't get to meet you [noise] once again\nI'm a mom or [noise] ... I Love that ... not all the deep into the heart of my\nHead and brings you back in\nMy memory in when we were ... on his own and Robin ... Madison where do you are offering reading guy but oh\nWe\nAre in a minute or\nTwo ... two friends who are there other than you can bet ... there were too badly and\nHe was a\nWhen they want\n[noise]\n\n[noise] um [noise] um [noise]\nUm [noise]\nOh that's great yeah you bring to my eyes and she had Jacob yeah managed specially if you got draws trouble you know Joel later yeah when you're a confuse the tune it makes you drink some booze or John Yoo SARS\nYou understand the value of a madman and understand that we've been married for many years and I know you've been married any\nShift in nine years and I've been married fifty on in my old lady's face I don't ever remember being single man you may man it's rough but they keep a straight through it and why you better believe it or most times Iraq when I started my arguments every day you wake up and yeah I can I can imagine but that's life you've got to keep your street just [noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\nIt's W. B. I. F. M. eighty nine point nine in WB I Am in each one Scranton Wilkes Barre Eagleton W. V. Y. eight eighty nine point seven eight and Williamsport W T I O eighty eight points ... Mansfield\nAnd W. P. A. U. Ninety One point five and ... with translators in wells girl with one of those three point five\nAnd Louis bird at one hundred Twenty one and on the way up at W. B. I. A. dot or\n\n\nShe ... and ... and\n\n\n\n\n[noise]\n\nNot\nThe [noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\nThey say it's W. P. I. F. M. eighty nine point nine at W. B. I. F. M. H. D. one Scranton Wilkes Barre handled in WTY eight eighty nine point seven in sand Williamsport W T I O U D ... Mansfield in W. P. A. U. Ninety One point five Palmyra township\nWith translators in east Strasburg it Ninety four when we treat in Bethlehem at one point seven and on the way up and do you feel like a dollar or\n\nDo they do\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] but then they\n\n\n\n\n\n\n\n\nLittle\n\nBit\nAnd then let them build\nThem\nAnd then\nThen they then they\nTwo\n\nOr\nIn the middle of the\nPlant in the mid ...\nOlder to burn all those who was on\nThe term [noise] that we're going to know when\nThe boom\nBoom boom boom boom boom boom boom don't confirm that has come back to ...\nMember of the main\n...\n\n\n...\nBut then it doesn't mean\n[noise] thank you thank you you're really on guitar [noise] Jay Leno or don't face [noise] and I'm John Fox thank you [noise]\n\n\nI Know\nBut as you say All right I guess the last three months ago\nAll my life ... nothing exciting is it all\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n", "show_name": "The Chiaroscuro Channel simulcast", "year": "2018", "city": "Williamsport", "day": "21"}