{"month": "10", "state": "PA", "station": "WVYA", "content": "Songs about the weather on tonight's mixed bag here on WB I Hope you enjoy the set\nI just don't have we heard Michael ... with a great song called the weather channel we wrapped up a tent which begin around nine thirty or so with Lisa Lauren nights version of the Beatles oh here comes the sun from the up my own twist than the summer heat done by the late ... when the circus comes to town\nThan David Stuart in Barbara Gaskins a piece called grace guys from the album called the big idea\nThen I got to get the least one song about snow in we heard snowed in from Dr by driving through the snow\nOr mark are really from the um called hope and other casualties\nThan it was a song called let it rained by Eric Henson recorded here WB I ate in Nineteen Ninety seven for our music series with greater accounts and just now Michael drilling another hunger music veterans for music is an album released called little movies with something called the weather channel\nTo meter logical song so pure joy to let's say for two nights mixed bag for the savings George Graham inviting you to join us tomorrow night will start off with a bluegrass he set at eight thirty to mixed bag new releases ended nine are hungry music segment for the week presents an encore with singer songwriter pianist [noise] um [noise]\nAn attack more to join us for that [noise]\nThis is W. B. I. F. him eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre hateful to W. B. Y. eight eighty nine point seven if and when humans port W T I O eighty eight point three ... Mansfield and W. P. A. U. Ninety One point five in Palmyra township\nTime now for ... already in progress\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nMm Mm\nMm [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\nCan you can\nMm\n\n\nDa da da da da da da\n\nDa da da da\n\nMhm Mm\nMhm Mm\nMm Mm Mm mhm mhm mhm\nMm Mm Mm Mm Mm Mm\nMm Mm mhm\nMm Mm Mm\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm\nMhm mhm mhm Mm\nMm [noise]\n\n\n\n[noise]\n\nEspecially the W. B. I. F. M. eighty nine point nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre equal WTY eight eighty nine point seven ... Williamsport W T I O eighty eight point ... Mansfield and W. P. A. U.\nNinety One point five ... lake wallet pop back\nWith translators and Clark somebody Ninety three and pot spill at Ninety four point nine and on the Web at W. V. I. A. dot org\n[noise]\nGame it is and\n\nAnd they say it's W. B. I. F. M. eighty nine point nine and W. V. I. A. N. N. H. D. one Scranton Wilkes Barre needles in\nW. B. Y. eight eighty nine point seven eight and Williamsport double duty I oh eighty eight points ... Mansfield and W. P. A. U. Ninety One point five at Palmyra township with translators in wells barrel when one oh three point five\nAnd Louis bird at one point one in on the way up at W. B. I. A. dot org\n\n[noise]\n\n\n[noise]\n\n\nDays\n\nThe day\n[noise]\n[noise]\n\n[noise]\nDa\n\nAbout\n\n[noise]\n\nThe the new\n\nYou know\nIn the young lady you know\n\nNa na\n\n\n\nHe\n\n\n[noise] Mm\nMm\n\n\n\nNot let you remember the other songs she taught me how to say what was in the law usually man you got your saying something that I can say you say you've been as good as men get ten dollars and he's going to give us if you can say something and it was as long as I say I never oh yeah they're all religions are like ms blue\n... well\nGoing to give money none of jelly roll jelly roll and\nRemember anything I wouldn't be here you can you teach your kids to see you so you can do\nLot of money to be today will be the lowest she went away to me [noise] and you say milking be a good boy a brand new the toilet and ice skates\nThat was my pride in India and so a new students in you do see people on the hanging around them roller I'm ... I couldn't do it and to eat and the time do you do what I ate do do you um do\nReading in the\nYou know to be cancer in ... when I go and I do know about it and do not know this jelly rule you know show up to date when they end up then [noise]\n[noise] [noise] oh\n[noise]\n\n\n\nSo a news is you do to keep 'em on the hanging around 'cause we don't around feeling good about John and I love you but I have to to you down [noise]\nMy general each suite which is yeah yeah he can choose not to be and we do but I Know they give nobody knew what it is yeah Lee rule we\nKnow general due to the beach\nIn the\n\n[noise]\n\nThe\n[noise]\n\n\n\n\n...\n\n\nWho ...\nWho\n'em\nThe\nPeople who will\nWill people\n\n...\nBoom who ...\nBit\n\nLiberal and\nBoom\nBoom boom boom boom boom boom boom boom boom boom\nFor\nCall went to\nUm\nWho who um who\n\nAnd and and\n\n[noise] [noise]\n\n\n\n\nAnd\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\nMm\n\n\n\n... been one\nKnow that it's grown now you can they do not think young I got the thing and you've got to be named Josie ... let me have been together\n\nAnd\nAnd get them out when\nThe habit why should they be\nMore\nKnows about it well now you've\nWith them about how many other\nBut\n\n\nBut that's record this too as a ballad institution I used to do with it like the last ... which is not the old piece we hope you enjoy it if you're Donald ... [noise]\n[noise]\n\n\nCan\n\nIn many\n\n\n\n\nAnd\n[noise]\n\n\n\n\n\n\n[noise]\nMm\nMm [noise]\n\nNa\n\n\n\n\n\nThen\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]", "year": "2018", "show_name": "The Chiaroscuro Channel simulcast", "city": "Williamsport", "day": "02"}