{"month": "10", "state": "PA", "station": "WVYA", "content": "So join us for that and stay tuned to jazz from cures girl coming up\nThis is double ... FM eighty nine point nine that will be on a F. M. H. D. one Scranton Wilkes Barre hazel to W. B. Y. eight eighty nine point seven if at William sports W T I O idiot went three if it means ... Mansfield and W. P. A. U. Ninety One point five ... ... ...\n[noise] [noise]\n\n\n[noise] [noise]\n\nMm\n[noise]\n[noise]\n\n[noise] Mm\n\n\n\nMm\n\n\nMm\n[noise]\n\nMm Mm\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[laughter]\nMm\n\n\n\n\n\n...\n[noise]\n\nThis is WB I Am Sam eighty nine point nine at W. B. I. S. H. D. one Scranton Wilkes Barre he's often W. B. Y. eight eighty nine point seven eight and Williamsport double duty\nPoint nine at W. B. I. F. M. H. D. one Scranton Wilkes Barre Hazelden WTY eight eighty nine point seven ... than Williamsport W T I O eighty eight point three at him ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township\nWith translators in east Strasburg it Ninety four forty three and Bethlehem at one point seven and on the Web at W. B. A. dot or\n\n\n[noise]\n\n\n\n\n[noise]\nAnd do\nThem\n\n\nCould you\nRead in the gym and\nDo do do you convince people\nTo go with you know\nMost of the Muslim world in order\nTo do with the\nAll\nTo too much\nWant to talk about whom independent or to move\nWay in which people who would want to\nDo do do do you go into business with the new\nPresident who go to ... to ... to ... when you were going to be\n[noise]\nThere are many\n[noise]\n\n\n\n\n\n\nI\nDon't a part of that guy [noise]\n\nMhm [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nAnd\nThen\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise] she's going to school go get them\n[noise]\n\n\n\nYou know I Need\nMay\n\nI have a maybe not\nThe sweet on you know\nWires you blow on um [noise]\n\nThis is W. B. I. F. him eating point nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre equal WTY eight eighty nine one seven ... Williamsport W T I O ... Mansfield and W. P. A. U.\nNinety One point five in Palmyra township in like mom and pop back\nWith translators in Clark somebody Ninety three and pots bill at Ninety four point nine and on the Web at W. V. I. A. dot org [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nLet's say it's W. B. I. S. P. M. eighty nine point nine in W. B. I. A. N. N. H. D. one Scranton Wilkes Barre Eagleton\nW. V. Y. eight eighty nine point seven eight and Williamsport W T I O eighty eight points ... Mansfield and W. P. A. U. Ninety One point five ... township with translators in ... one of those three point five\nAnd Louis bird at one point one in on the Web at W. B. I. A. dot org\nAnd now you meet is going to Georgia\nTech [noise]\n\n...\n\n... Mm Mm\nMhm\nMhm mhm\n\n\n[noise]\n[noise]\n", "year": "2018", "show_name": "The Chiaroscuro Channel simulcast", "city": "Williamsport", "day": "26"}