{"month": "10", "state": "PA", "station": "WVYA", "content": "This is double ... FM eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre Eagleton W. B. Y.\nEight eighty nine point seven FM Williamsport W T I O idiot ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nThey say the w._b. I asked him eighty nine point nine W. B. I. A. F. M. H. D. one Scranton Wilkes Barre he'd gotten WTY eight eighty nine point seven eight and Williamsport W T I O idiot points ... Mansfield and W. P. A. you know any one point five FM Palmyra township\nWith translators in Allentown at Ninety nine point three and some very at one point seven in the world Wide Web\nI'm Ira township with translators in Allentown in Ninety nine point three and some very at one point seven in the world Wide Web at W. B. I. dot org\nOh\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] ...\n\n\nDa da da da da da da da da da da dun dun dun dun dun dun dun dun dun dun dun served\nIn the\nAnd the minute I mean do you do need to do to ... maybe even in the middle\nOf a\n\nThen\nDa da da da da da da da da da\n\nDa da\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise] they say it's W. B. I. S. eighty nine point nine in W. B. I. E. M. H. D. one Scranton Wilkes Barre eagle\nW. B. Y. eight eighty nine seven eight in Williamsport W T I O ... Mansfield in W. P. A. U. Ninety One point five in Palmyra township with translators in wells barrel when one of those three point five\nAnd Louis bird at one point one on the way up at W. B. A. dot org [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n...\n...\n... ... [laughter] [noise]\n\n[laughter]\n\n\n[laughter]\n[laughter]\n[laughter]\n[laughter]\n\n\n[laughter]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\nLet's see it's W. P. I. F. M. eighty nine point nine at W. B. I. F. M. H. D. one Scranton Wilkes Barre he'd gotten WTY eight eighty nine point seven eight and Williamsport W T I O eighty eight point three at him ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township\nWith translators in east Strasburg it Ninety four point three and Bethlehem at one point seven and on the Web at WPRI a dog or a\nThem\nMm Mm Mm Mm [noise]\n\nAnd men\nBang\n\n...\nMan they they ... they\nHad a job we'll do that they\nWould let him ... de\nLa ... Jew living near the ... thing goes\n... come on law and let the wet and John bring hobby a woman did me", "year": "2018", "show_name": "The Chiaroscuro Channel simulcast", "city": "Williamsport", "day": "11"}