{"month": "10", "state": "PA", "station": "WVYA", "content": "We invite you to join us tomorrow night will be here at each with the new releases of the day and then we'll be open for requests will be here tomorrow night until eleven PM so join us for that and stay tuned into jazz from ... coming up next on WB I\nThis is W. B. I. F. M. eighty nine point nine W. B. I. F. M. H. D. one Scranton Wilkes Barre hazel W. B. Y. eight eighty nine point seven if and William sport W T I O idiot point three of them may ... Mansfield a WPN ... Ninety One point five FM Paul by retention\n[noise]\n\n[noise]\n\n\n\n\nMm\n...\n\n\n\n[noise]\nNa na\nDa\nYou know from my home\nWhen he was going\nTo the\nNew ... who who\nWho who who who who\nWho\nWho who ... who you know to her for\nOr who\nWho who\nA man\nWho knew\nYou remember\nDo\n... ... ... you\nHave added\n\nMe and\nHe learned\n\nBe a\n\n\n\n\n\n\n\nTwo man and\nThe men\nAnd\nWomen\n\n\n\nI guess we're not out on the ground [noise] man not face [noise] which is\nA [noise]\nAnd that that was his evening we've done everything we can do to you\nWe really enjoyed reading well you know you've been Johnny thank you very much\n[noise]\n\n[noise] ... well no\n\nBut\n\n[noise]\n\n\nAnd then\nCan do\n\nI don't know what's going to\nAbout oh about a third or fourth\nOne of the weapons are old enough for both of her own or\nWork on in the world for\n\n\n[noise]\n\nFifteen W. B. I. F. ... eighty nine point nine and WPRI FEMA ski one granting Wilkes Barre equal WTY eight eighty nine point seven ... Williamsport W T I O idiot point three ... Mansfield and W. P. A. U.\nNinety One point five percent Palmyra township in like one of the pack\nWith translators in Clark somebody Ninety three and pots bill at Ninety four point nine and\n... like ... packed with translators and Clark summit at Ninety point three and ... at Ninety four point died down on the Web at W. V. I. A. dot org\n[noise] Mm\n[noise]\nMm\nMm [noise]\n\n\nMm well they know what does all of them\n[noise]\nMm\nMm\nWhere God Knows\nVery well music you got to eat the right kind of food the plate is missing\nYou can practice or you want to read well you got the ...\nGone bread I'm I'm a\nBlack guy see and read things that are right\nNow we're\nOf losing ... you know that kind of phone\nAnd and most of the\nThere's no there were no snow around by the conflict\nBetween man and woman but then I went on to talk about the man who was smoking too much smoke cigarettes night and day unfortunately some of them had NO NAME and\nI'm sure you know what can we talk in a\nMistake and smoke one they brought in from Pakistan Mm for them as me for four weeks away their moms know that they call nine one one\nMm oh we don't know what that is in your neighborhood but in the Bronx way out there that's a dangerous not bother to\nNine one one everybody's running some people running the get out of the way other people running to see what's happening but when they brought an assassin paid an woke him up and they start getting a sad story\nHad somebody who was around what a record of ... while he was talking to the police they took down everything you're saying ... wrote a song that is the way it goes so watch on my ...\nMember\nOh\nYeah it was a\nMm yes\nMy my my\nRabbit Johnson only get\nIt was a very badly for\nJust a head\nOn my mind\n\nBut when I woke up this morning\n\nBut when I woke up this morning [noise] not on\nI Know when I Won the lottery I wrote that had so much money\nHe was a very ...\nIt was in my head on my math\n\nBecause when I woke up this morning\n[noise]\nNot one now and\nAnd\nI jumped I went to the White House said in the president's chance when he came in what is such a phone and they say the new I'm Glad you yeah to the\nBloody was the rain man who\nYes a dream of mine on my mind\n\nBecause when I woke up this morning and you know when the\n\nA draft we had applied everything wasn't nice food we had the the potato salad with black hat season right but\nYes the mind you know my my [noise]\nYes but when I woke up this morning\n[noise] the one thing what good\nAnd\nI Know that I got married ... raised up their family and my wife had about ... what did you not have down one\nIt was a [noise] just fine\nBut when I woke up this morning [noise]\n\n[noise] Mm\nMm\nMm\n\n\n\nWell they say it's W. B. I asked him eighty nine point nine and W. B. I. E. S. M. H. D. one Scranton Wilkes Barre Eagleton\nW. V. Y. eight eighty nine point seven eight and Williamsport W T I O eighty eight points ... Mansfield and W. P. A. U. Ninety One point five at Palmyra township with translators in wealth barrel with one of three point five\nAnd Louis bird at one point one and on the Web at W. B. I. A. dot org\n\n\nSay oh\n\n\n\n\n\n\n\n...\nNo\n\n\n\nWith translators in east Strasburg it Ninety four when we treat in Bethlehem at one point seven and all the way I don't you feel like a duck\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n...\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\nGo\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise] ...\n\n\nWhen", "year": "2018", "show_name": "The Chiaroscuro Channel simulcast", "city": "Williamsport", "day": "05"}