{"month": "10", "state": "NY", "station": "WAMC", "content": "You're listening to the b._b._c. world therapists and here's what's happening in the studio it's week\nI'm joined one film and TV commercials are to be in the studio with you on them from the\nSocial game development company\nKing [noise] how does composing for film and TV compared with composing for moving game [noise]\nAnd this ... at feeding the world's seven don't come [noise]\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany\nW. R. U. N. H. D. Ninety point three rooms in Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WC el ... Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. N. C. H. D. one oh three point nine tie kind of rogue W. M. H. D. one by one great aren't in\nW. W. E. S. H. D. A. D. point nine mount Kisco W. A. N. D. H. D. Ninety point one Stanford W a an art ... Brewster and WAMC am fourteen hundred Albany\nGood morning for all the pressures Saudi Arabia faces for the disappearance of a writer the kingdom has one prominent defenders\nHarrison the Supreme Court justice Brett Kavanaugh the president says if the Saudis here we go again with you know you're guilty until proven innocent I'm Steve Inskeep\nAnd I'm Noel King also this hour weeks ... mirage didn't hear the winner of the Nobel Peace prize he's only twenty\nFive years old but she's on a mission to dry and into atrocities committed against her you know the people the federal deficit jumps in to be happening in my finger pointing in Washington will get\nSome answers when somebody's having he\nThirty nine years old today and the news is next\nLive from NPR News in Washington I'm Dave ... secretary of state Mike Pompeo is an ... today for a meeting with Turkey's president on the disappearance of Saudi journalist ... NPR's Peter Kenyon says the talks come a day after ... was in Saudi Arabia to try to get answers\nBum pale arrive from Riyadh where he met with king some on and crown prince Mohammed bin some on on the show you disappearance Turkish authorities have said they have audio and video evidence to show that he was killed inside the consulate\nThe Saudis deny wrongdoing and have yet to respond to media reports they're planning to acknowledge show gays accidental deaths during questioning\nFollowing President Trump's suggestion that wrote killers may have been responsible the New York times linked for Fifteen Saudis who arrived in assembled a day of the show ... disappearance to the crown prince Peter Kenyon NPR News Istanbul\nThe death toll from hurricane Michael is now up to twenty six authorities in Bay county along the coast in the Florida Panhandle say at least twelve people were killed by the category forms for storm there it includes Mexico beach in Panama City\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nShoot against members of one of Mexico's largest drug cartels they were accused of trafficking into the U.S tons of cocaine mess and heroin laced with Fenton all the documents were announced by attorney general Jeff Sessions\nThese cartels everyday are taking advantage of our poor southern border to move and push their illegal drugs for large profit billions of dollars tens of billions of dollars expanding suffering and death in our country\nThe Trump Administration is offering a ten million dollar reward for information leading to the rest of the cartels leader who's known as el men show he runs a least go new wave of gender Russia on sales of recreational marijuana are now legal in Canada has damned carp and Chuck reports the change took effect this morning\nAs the clock struck midnight in different time zones hundreds of Canadians who had lined up to be the first to buy marijuana legally celebrated people in New Finland where the first to by legal marijuana\nAnd count down to the magic hour were held in major cities in Toronto there was a New Year's eve style party my puffing poor painting class in Vancouver and protest from those who aren't happy with the age restriction of Nineteen or older\nBut some provinces such as Ontario are critical the police still aren't equipped to reliably screen for drug impaired driving and the recent surveys adjusted that nearly eight out of ten Canadians have no interest in smoking legal part\nFor NPR News I'm Dan carp and Chuck in Toronto\nWall Street is coming off a day of sharp games the Dow added five hundred forty seven points or more than two percent the S. and P. five hundred also rose more than two percent its largest one day advance since late march this is NPR News\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including morning night and stretch fashion retailers nationwide more a dream wave chair dot com and the ... foundation\nSupport for Stargate comes from the ... ... drivers now have access to membership levels and include digital cookbooks crossword puzzles online access and much more Times Union dot com slash membership\nThe orchestra now performing Aaron Copeland Lincoln Portrait just before election day November third and fourth of the Fisher center at Bard College the orchestra now dot org\nAnd the ... museum of picture book guard Amherst, Massachusetts celebrating the golden anniversary of the very hungry caterpillar with a new exhibition and activities coral museum dot org [noise]\nStarting October Seventeen [noise]\nThe seasons are changing on Mars today is the first full day of winter in the planet northern hemisphere the new season follows what turned out to be a nasty autumn Mars has season for the same reason earth does the planet is tilted on its access\nAs it orbits the sun the north and south poles take turns dipping toward the sun as a result the northern and southern hemisphere take turns getting more and less sunlight creating season\nThe seasons are more complicated than those on earth though that's because Mars follows a more lopsided orbit around the sun the planet is closest to the sun during northern winter and fire that during summer customers and the winters are mild there in the north than in the south\nThe changes in sunlight can trigger big dust storms as the surface warms it creates\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nSpring equinox on Mars a storm world to live in the northern hemisphere by the end of June it in circle the entire planet rovers on the surface solid day turn on most tonight\nThe sun vanished from view and the sky turn dark red is taking months the dust to settle out of the atmosphere\nCreating a hazy winter in the northern hemisphere\nLooked for Mars to the left of the moon as darkness falls this evening it looks like a bright orange star it will be even closer to the moon that they set after midnight\nOur Web address it started dot org for the University of Texas at Austin McDonald Observatory I'm Sandy would [noise]\nSupport for starting to come from community advocates for sustainable energy present in the renewable energy and sustainable living fair Saturday October Twenty years from ten to four don't stewards more information stuff\nAnd why pipeline started marching\nMassachusetts General hospital ... research ... develop treatments for complex conditions to help patients get back to their mind revolutionizing care Mass General\nAnd feel good local food from small farm delivered weekly the workplace and community locations whipping out people changed the way they eat while supporting small state\nField dash goods dot com\nIt's seven minutes pastime [noise]\n[noise] this is MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep what's the real purpose of a diplomatic mission by Mike Pompeo\nPresident Trump sent the secretary of state to look into a murder but at least in public Pompeo has offered many smiles while not asking very many questions Saudi Arabia is suspected of having a writer killed so Pompeo flew to Riyadh for and apparently friendly meeting with crown prince Mohammed bin Salman\nIs just not for a little while we're both [noise] as I said show\nToday pump pale has moved on to turkey where the writer Jim all cause showed G with last seen walking into a Saudi conflict\nAnd this murder is complicating relations with a country that the Trump Administration depends on\nNPR's Michel ... is traveling with the secretary of state and she joins us from the airport I Believe with Ankara turkey I've ever show either they've okay so uh my palm pales in Turkey has been talking with reporters about this trip through quick trip through Saudi Arabia let's hear what he told reporters a little bit earlier\nTold me they were going to conduct a thorough\nComplete transfer an investigation\nThey made a commitment to to hold\nConnected to any wrongdoing that may be found\nAccountable for that whether they are\nSenior officer official\nUh they've promised accountability\nOkay so they're going to hold people responsible accountable and secretary of state Mike Pompeo was in the room in Riyadh with people who allegedly no everything did he learn anything\nTravelers they're or measles outbreaks in many parts of the world including Europe vaccine should be updated before traveling\n... G. O. V. slash travel but our brothers seven out of the brands and one Brooks recovery location for sixty years and counting net direct sales and service of new in pre on cars and trucks it's hard to beat the dog the darn brothers dot com flakes to locks passion\nTo find ways supporting the variety of a hands on classes offered up the around that folks school in like Lucerne I tend to ... and travel tips as lakes to lock dot org I Love the\nTerm bio mass woods to warmth and homes and businesses throughout the northeast today self stoking automated would eat with boilers dot com and click heart hall Arts Center visiting these Sharon springs poetry festival through October twenty of reaching Billy Collins Tracy Kate Smith and more and more ...\nDot org slash poetry morning thanks for joining us for MORNING EDITION would this Wednesday October Seventeen hundred abuse or engineer 'cause my bone\nOr producer Elizabeth helping you weather forecast for news channel Thirteen relatives polka\nGoing for mostly cloudy skies around the region windy scattered showers about today are really high in the fifties and temperatures fall\nInto the forties mostly cloudy windy scattered rain showers some snow showers in the mountains tied lows in the upper ... to lower thirties [noise] it was a freeze warning in effect\nFor midnight tonight to nine AM tomorrow for the Hudson River valley tipsy area up through the capital district including the Saratoga England's falls areas for one\nSupport for streaming on WAMC come from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the prime of your belly and beyond Davis financial G. R. P. dot com\nAsian bringing it into the ruins [noise] digital news coming up at five thirty three [noise]\n\nSupport for NPR comes from the station and from the door it's do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health\nFrom the state of Joan be crock who's requests served as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century [noise]\nFrom the public welfare foundation committed to advancing justice an opportunity for people in need more information at public welfare dot org\nAnd from the Conrad Hilton foundation working to improve the lives of disadvantaged and vulnerable people throughout the world learned more at Hilton foundation dot org\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep good morning when the Nobel Committee said the ... there was one of the recipients of this year's peace prize they cited her courage\nShe refused to accept the social codes that requires women to remain silent out of the shades of the abuses to which they had been subject to the\nFour years ago as ... street fighters enslaved thousands of women and girls in Iraq many were repeatedly raped and sexually abused in other words\nNot humor odd was one of those women she was only Twenty one years old at the time and from a tiny but ancient religious minority group the ...\n... people that they are very ...\nDigits on is simple life they they can they can leave we any group in Iraq in human hand but and they are they're very ... these people in the state yeah they just want\nTo leave in in peace and fixing\nTo feel safe I talked to him rot and NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace prize with the help of an interpreter she spoke mostly in ... which is her native language about what she now hopes to achieve\nUm diminution um we have set it over and over that it's important for us the justice is done out of the six thousand he is he the women who were abducted by I said we hope to see at least one ISIS number who did this to one me as a woman\nBe punished for the crimes they committed against using the women and we hope to see them in court in public I think it is easy\nTo see winning the Nobel Peace prize as a kind of combination or end of a person's career you've you've done what you said how to do\nIn your case at twenty four years old that is clearly not true you clearly feel like you have a lot less to do what is next for you after winning the prize\nAnd I'm twenty five twenty five yes [noise] and ...\nAfter I delivered method and we have as a community delivered our message that we would like to see the reconstruction of our homeland and ... take place and to provide security for ... said that they can go back and we would like to see this never happen again not to any other community\nSupport for streaming on WAMC come from Davis financial group broadening the base financial planning and wealth management services to individuals families and business owners and the prime of your belly and beyond Davis financial G. R. P. dot com\nOr a ... I can just simply say I am angry cheap because that word only will not describe how much we have suffered life but what I can say is that we are right we have the right to speak about this we have the right to deliver a message\nIf anger doesn't quite capture it what is the word what do you feel every day\nOr what chemicals to showed him up you know like I said what makes us feel good at least is that we are delivering a peaceful massive die we are not delivering a message to hurt anyone when I meet with students and the presidents and anyone\nI speak about what happened to us and I deliver my message with a clear conscience that I advocate for people\nDuring our half hour interview not humor odd seemed at times pretty shattered but also strong she says that strength comes from her UCD identity she calls the rape of using the women and the murder of UCD men including many people in her own family a genocide\nShe wants these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes finds herself frustrated\n... sometimes I feel that my message has not been clearly heard that's what that is not my fault because I feel like too much is going on in terms of woman being victims and it's not the first time and certainly it's not the last time\nAnd perhaps every year a woman someplace in the world or groups of woman or thousands will be victims of sexual violence or terrorist groups and so I feel like this is not new to the people and it's not going to be the last time and people have become numb to this kind of news\nI'm your mother your mother was killed by the Islamic state and I wonder when you think about her now\nWhat do you think she would think about everything that you've done what do you think she would think about you having won a Nobel Peace prize being the voice of the ... community to the rest of the world how do you think your mom would feel\nIn some of the ... when I received this news it was around probably five\nAM in the morning and the U.S and the first thing I did was look at her picture and cry but because they felt they needed her heritage day and not just her with the eighty woman they eat him or women that were with her\nAnd that we're all executed for no reason just for being is easy and for being older women I feel like they will be proud\nProud you were twenty five years old you've just gotten engaged congratulations things your life is not what you thought it was going to be just a couple of years ago what kind of life do you want for yourself now [noise]\n... Ah yes we have gotten engaged but it's still difficult for me to deal with all of that whole much as much as they try to come close to finding a simple life\nThings come up and then we have to deal with them and they'll continue this work but I Hope that I can I Want to learn English I work on my English in school and I want to create a family with my fiance and being able to live a simple life and just be safe\nI Hope you get exactly what you want to\nIt was really a pleasure\nMore than half of North Carolina votes were cast early in two thousand six team for two thousand Eighteen lawmakers altered the rules in ways that could lower turnout here's Alexandra Olga member station WFSU\nTo prepare for early voting election director Adam Reagan in Gaston county just north of Charlotte is testing voting machines by running sample ballot through them [noise]\nThese machines were meant to be in five early voting locations throughout the county but the new law requires all sites within a county to be open from ... pm during the week and as a result raking can only open three sites this election\nEarly but he was very popular in ... county and and I would have loved to have more early voting locations it came down to having were locations you know helping more voters versus are British Sherry responsibilities to the county\nSome democratic lawmakers see this as another attack on voting rights and its state where a voter id redistricting and early voting rules have all been struck down by the court at various points in the last few years\nDuring a Jew and debate about early voting democratic state representative Amos Quick said the requirement that if one sided open on the weekend the rats also have to be could discourage counties from having any weekend hours\nWeekend early voting as them refer and has been for a certain population and certain populations who's right to vote as not only been outlawed it would have been rejected in a recent court decision\nHe's referring to black voters and appeals court ruled a twenty Thirteen law that among other things cut early voting by a week targeted African Americans with quote surgical precision but Republicans who champion this law argue they're only trying to minimize confusion here state representative David Lewis also during the Jim debate\nWhat we set out with the issue to do is to be able to make it more reliable and dependable voters would know that the early voting ... or ... in the county was open from ... I'm In the morning to the um the evening\nThe law has some bipartisan opposition run riot and the Republican Party chair of ... county about fifty miles north of Charlotte the county has had to cut its early voting sites in half frustrated as to where to go would use and he says even though this may not seem like an unfunded mandate\nThat's exactly what it translates to being at the end of the day\n... counties with smaller election budgets like ... are disproportionately affected by this change well individual location maybe open longer there will be Seventeen percent fewer sites this election MIT political scientist Charles Stuart that third says that for voters convenient Trump's hours\nAnd there's a lot of research that's been done that suggests that whenever you move a polling place further away from a voter that are less likely to vote there\nStewart says the rule change could simply shift turn out to election day which could mean longer lines at the polls in a state where voting rights have become such a political hot potato elections officials say they just go with the flow Becky Gallup Harris the election director in ... county\nDue to court cases legislation all of that kind of thing factors in and it just seems like we always has something to lecture and that takes us in a different direction\nThe question remains will voters adapt as easily for NPR News I'm Alex ... [noise]\nIt's NPR news\nThis is Paul taught he'll WAMC pioneer valley bureau chief following natural gas explosions and fires in the ... valley Massachusetts utility regulators order an independent inspection of the gas pipeline infrastructure in the entire sting moving doors by governor big but I think the court would be really important\nClimate activists say the gas companies should concentrate on fixing leaks\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nWilson superintendents through our adventure typically programs in school leadership new ... slash graduate\nHistoric ... street on ... street presents gruesome stories of infectious diseases that plagued early neutral nighttime tours through October twenty eight you cannot street Donald to register your pain management pain management for chronic pain and spine Karen private office setting with doctors Charles going to be set free and why pain free dot com\nAnd made in more Newport with heat that supports artisans and emerging companies from America and around the world with a gallery for their jewelry gifts in women's fashion and made in more on Facebook\nThe center for economic growth working to help businesses access resources they need to succeed in the capital region announcing their annual meeting Monday October twenty nine in Albany CGI dot O. R. G. for information\nColumbia memorial health providing a comprehensive joint replacement experience from consultation through recovery at officers in Hudson and kept skill and ability to vote him at Columbia memorial health\nDot ORG and Clarkson University capital region campus union graduate college is now approaching university graduate programs in business healthcare management data analytics engineering education bioethics defies convention ... much much [noise]\n... just fall canals WAMC regional forecasts calling for mostly cloudy skies windy scattered showers today really high in the fifties and temperatures will fall into the forties\nMostly cloudy windy scattered rain showers tonight some snow showers over the mountains lows in the upper twenties to lower thirties and a freeze warning in effect for midnight tonight to nine AM\nTomorrow the Hudson River valley from Poughkeepsie area up to the capital district including the Saratoga ... areas from Washington County in southern which field counties\nSupport comes from the beacon cinema Pittsfield, Massachusetts entertaining the Berkshires with a wide variety of films and community events beer and wine the little little shows that we can cinema dot com for detail [noise]\n\nSupport for NPR comes from the station and from the ... foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John D and Catherine team MacArthur Foundation recognizing exceptionally creative individuals this year's MacArthur fellows and more Information Center at Mac found dot org and from the listeners and support this NPR station\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King there are reports of a surge of new Ebola infections and the Democratic Republic of Congo\nToday and emergency committee of the world Health Organization is meeting to advise on whether the outbreak should be declared a public health emergency of international concern and ... eyes and then has the story\nThe W. H. O. has only sounded the alarm that's way four times most recently in twenty sixteen when he got arrested in Latin America and before that in response to the twenty fourteen twenty Fifteen Ebola outbreak in West Africa that infected more than twenty eight thousand people\nThis outbreak and the ... the much smaller about a hundred and eighty confirmed cases that far but it's centered in a particularly challenging area\nThe pros and the ... the twentieth shovel conflict\nPeter salon I as a top official with the ...\nAs one million of eight million residents\nAnd that has been it more than twenty you shovel conflict\nPeter salon I as a top official with the W. H. show\nAs one million of a million residents internally and it's a highly stable and secure part of the Democratic Republic of Congo\nAnd armed rebel group called the allied democratic forces has been launching attacks on government forces UN peacekeeping troops and also civilians now so on and says despite that when Ebola first surfaced in early August\nWe're quite confident we would get on top of me up for\nThe government W. H. O. and partner organizations launched a major effort to treat infected people and administer and experimental vaccine to anyone who had had contact with them the strategy started to show success\nAnd then what happened in September is we had\nSeven or eight major attacks\nViolent attacks by the rebels including one in a city called Benny where they killed more than twenty people mostly civilians\nThe population have been interested enough is enough\nPeople who for years have felt completely abandoned by the government and the international community started turning against the health workers who were seen as an arm of the government people would say\nLook you can't even go to a physical security\nWhy should we go along with this unfamiliar anti Ebola campaign you're pushing\nNow salon stresses that the vast majority of people are still cooperating but rumors that started the vaccination campaign is actually a plot to spread the disease members at a safe burial teams were attacked with rocks and severely injured and often after rebel attack whole neighborhoods shut down in protest\nWindow to love to move in the streets of barricaded by young people sometimes burning ties are objects and sometimes for the ... other weapons\nIn the last week and a half the effects of this has started to become clear with not just a rise in the number of new cases each week but ever more cases who contracted Ebola from someone the W. H. O. had not previously known about\nThat's the situation that the emergency committee that's meeting today has been asked to assess David Hayman is an infectious disease expert in an advisor to the W. H. O.\nSome fielded by calling a public health emergency were increased political importance of the event will possibly increase the mobilization of funds the W. H. I was asked\nFor thirty three million dollars to help neighboring countries prepare for the possibility of it spread across their borders and declaring this kind of emergency could also have a wider affect\nIt may also help and increasing the security in the area\nIn the family birthplace of their view hospital in Britain marriage in Massachusetts the collaborative obstetrician nurse with remodeled childbirth and holistic medically supported environment for sure health systems dot org slash family first place [noise]\nMorning free WAMC fall fund drives next now and then re six o'clock [noise]\nThis is Northeast Public radio WAMC up ... points we Albany W. R. UNH the Monday\nPoint three ramps and Utica W ... W O ... Ninety One seven Middletown WC EL each day you know the one nine ... W ... Ninety three three character Harry ...\nOne of five one great Barrington W W E S H the idiot nine months to go it'll be ... Ninety point one Stanford W winning and are idiots by\nBrewster WAMC am fourteen hundred Albany\nDear dear friends everybody\nWho's out there everybody who in the glove everybody who's been following this every single moment knows what\nWe are about to do we're about to end the fund or wherever you are\nJust remember you've been telling us all week long you told us when we were collecting money during the during the lock box phase you toll is\nNow the wonder of the morning panel and\nJoe Donahue and the group and the people who come in every day and who you need so desperately so by nine o'clock this morning we have got to end it Hi I'm Alan I'm ray you're voluntary [noise]\nMan in our front drive you're on the beginning of the three hundred thirty six thousand nine hundred and one dollar [noise]\nFor those of us who are math challenge to how much is left in the whole drug sixty three\nThousand Ninety nine American dollars\nWow no now can we do it we can [noise] can we do it now we can All right I'm telling\nYou they're out there and people are saying let me help you in any way\nCan we do it now we can All right I'm telling\nYou they're out there and people are saying let me help you in any way I can\nWe just heard I've just been handed this from ah from from our wonderful friend Carey mad again up pine plains New York where I was once trapped in the middle of the night\nThat's right ran out of gas on planes and I was with my friend Peter Davis and a couple of other people were on our one night one day off from camp products house\nAnd we got to find planes are we ran out of gas and we went into the but then there was of course no gas station open so we went into a bar and the guy says hey it'll cost ya I don't remember what it was Fifteen dollars then I'll give you a little bit of gas gets a little bit of gas\nSo when we came with a little gas can we build it up we were saved and he said now if I were you like get outta here real fast [laughter]\n\nI don't know where he got that gas out there right now but [laughter] Buddy Guy from somewhere anyway\nWe're not at a gas and as you know we have done remarkably well we had a million dollars that we needed to raise of five hundred thousand in lock box with so close we can touch it\nAnd that we need this radio station why because this radio station is us it's all of us it is our community is individuals' it's mothers who are making breakfast as we speak\nIt's it's fathers and uh and who are making other breakfast in other homes see what I did there um and I'm In in each case um we know that we're all together on this radio stations we've all made it together is ours\nAnd now we have to finish it\nAnd we can finish should Joe was rounding up a panel as we speak I'm making it clear that we can do this and we can\nIf everybody decides so we heard from Kerry American gay Madigan says I don't know what I can do here Allen but if it if you can raise by seven thirty this morning twenty five\nThousand dollars I'll give you five thousand\nAnd whatever we have to give you we will get you wherever you want we'll give you um\nI I hate to do it because I got yelled at by my buyer of person on my board I got yelled at by a I got yelled at by the staff\nWe did Allen's show gonna package yesterday um and a package number one yes and it was extraordinary and I know that I Know that will do it again if anybody is around to help us do it\nWhat are we should have a number two well it's actually much sugar numbers on a ... that's good yeah that's why we're lawyer for really that's good as far as uh yeah so anyway um so so that's\nWhat we need now how many minutes we have we ever had an hour and we are eighty five minutes about an hour and a half\n... an hour and a half a little less than an hour and a half now\nIf you want everything in the store you can have it we're emptying out the freezer it's the end of camp Bronx house we're going to give you a big feast a and and and we need you need your now to end the ...\nUnless of course you know what to fund drive unless everybody is saying you want the panel but you don't really want it that much um\nThis morning yeah we want it and we need it we've got a president who is off the rails off the rails\nUm this morning yeah we want it and we needed we've got a president who is off the rails off the rails are we doing the most extraordinary things\nSpeaking directly to our grandchildren and their children and saying\nThere is no such thing as climate change there is no such thing as climate change oh well maybe there is a little climate change but it'll turn itself around\nMeanwhile the panhandle is in ruins it looks like in Florida it looked like a bomb was dropped on it um we have sees royal sees that that um or eighty five degrees\nUm which we've never seen before if we've seen them I don't remember men I'm all\nI can tell you right now this is a crisis and we have a president who grabs women by the you know what and who is proud of it and who's and it's very interesting you take a look at the polls the men like him women\nCan't stand them in the in the polling and I'm with the women I'll tell you right now this is just too much and we have by some circumstances been saddled with this guy\nBut in any case it is now ... eight eight six six in the morning by seven thirty if we raise it to the twenty twenty twenty five thousand dollars could we raise twenty five thousand dollars Kerry met again a pint plains where at once I got the gas will will do any needs you know\nTo he'll he'll give us five thousand dollars you know I remember\nMy auntie and our dog ski six [laughter]\nAnd ... six\nJumped out of the car one day she had a Chrysler Imperial which she gave me really if you really love at first I was a Chrysler Imperial you got eight miles to the gallon and it was a tank or you could go fast and you wouldn't think you were going at all\nAnd uh and uh it was the first model which had electric windows\nOh yeah I live in a large very first one um\nAnd I remember ... her car\nAnd he started to well it was terrible hee hee hee hee hee hee\nWe're at a gas station we were yeah and he left Latin and began to laugh about the gas is you're kidding me there was some gas on the ground the labs it up you left the gas\nHuh and well you know it was ... just began to run around and you started to run\nRound and round and round ...\nLaptop the gasoline which is not a good idea we have a ... year [noise] and laughter for that and I started running around in circles does that mean you can tell us what happened but you've got to run\nAround and round and round and round and round and round and round round round\nFaster and faster and faster 'til all of a sudden they just lay on the ground why what happened well often is that what happened\nNow you blew it Kerry Kerry [noise] what happened when he ran out of gas [laughter]\nLadies and gentlemen at the end of the fund drive but no but not one phone is ringing\nAnd we are birds in the wilderness we are sitting right here and we are waiting and if you want them to sugar package you can have it\nWhat is it what's involved in um if you're going to a packet ... got it okay am up with us you know ... in Michigan a package you'll never see this again but we got to get through this you get the umbrella okay oh there's W. A. M.\nIn Michigan a package you'll never see this again but we got to get to this you get the umbrella okay oh this debate away and he gets the same on the Murray these stock the Murray sock right the umbrella\nAnd the bag that she'd go back and the bad guy now that you go back to the grocery bag and a whole forty and not\nJust a grocery bag is the grocery bags that is so small that goes into such a small to mention right that when you're in the parking lot it over to the big wide or over to the\nAll right and uh anonymous from Sherry valley we're ... we're looking forward to the end of the drive is getting the package\n... adult socks right the Chico bag that we've got you covered umbrella every every phone has to be going off\nYou're never going to see this thing you know okay not in this lifetime may I may get fired because of it because the board doesn't like the fact that I'm giving away the store when I when I felt that the profits anonymous from pleasant valley where everyone's smiles\nThat you've covered WAMC umbrella Murray the dog stops the WAMC Chico back you know why they named in Chico in this case because he needed the money went into that struck Chico mark you always have money went\nThe WAMC Chico back you know why they named in Chico in this case because he needed the money went into the that's a chicken mark you always have the money went into that yeah there are a little gambling issue yeah one eight hundred three two three nine to six to\nA and M. and Kathleen infringe snacking burgers or Fort Edward deep bond rock and they say getting the Chico back the umbrella and the dog stops and anonymous from Berlin New York\nBoth my children are listening to WAMC a listener since the Medical College ... and getting the Chico back the umbrella and the dog stops terrific [noise] mark Fitzgerald house cave looking for um for animal looking for him\nLooking for um what's that bond a boss James Bond sports\nThis'll end Jemma one eight hundred three two three nine to stick to his getting the we've got you covered umbrella Chico bag and ... All right anonymous from Lackawanna ... in Pennsylvania did it by the end or Web ... election\nLack of ... instead of LA see All right fine okay one eight hundred three to green nine to sit out his calmed down a anonymous from Charlotte moms where everybody is Charles wanting to do for a nine to six do watch some of our great friend\nBarbara about you know I'll take 'em out barber and Marshall ah Barton or religion or a of a realistic about about out of the\nSuicide WAMC everyday at home and in a car very generous to getting the whole package the ... the dog socks that you go back the umbrella of murder dog socks to Chico back the umbrella in other words you got to\nDo yeah to fall back all shark allowed one hundred and three two three nine\nSix two are anonymous from late them where everybody goes around in circles fantastic station great programming listening\nTo it from Syracuse is is more morning companion swimming\nUnder three two three Ninety six or any of the fund drive folks but here's what has\nHere we have already raised we needed twenty five thousand dollars by seven thirty were down to the Twenty one thousands have been pretty good that's pretty good twenty minutes one eight hundred three two three Ninety six to wherever you are please get on a phone and save us from ... or [noise]\nOne eight hundred three two three nine\nTo six to ... Marianne from Albany there's so much good to say guess what they're getting WAMC umbrella the merger dog socks and the WAMC Chico bag Allen was should it matter of fact AS number one okay\nUh I'm John ... care of a ... bill in honor of Suzanne I Love it when people do that like a one\nEight hundred three two three nine to fix this All right one eight hundred three two or three Ninety six years now carry Madigan\nI just got this ... says five thousand dollars if we can do a twenty five thousand it's not going to be enough money by seven thirty this morning and we only have\nAnd this is what gets me nervous the good news is down to Twenty one died right the bad news as we only have a a you know about that sixty seven minutes right to vote one eight hundred and we want to end the fundraiser we want to have the panel\nI Do call last night that we have a panel is it absolutely we can do it our group will do it everybody's always talking about the panel and how important it is to them so everybody will maybe four to five dollars and ten dollars a year\nNow one eight hundred three two ... two six two hundred dollars or more you get the full package one eight hundred three two three nine to sit right that's what you're getting okay ... and\nIt's\nA it's a wonderful it's wonderful it's all wonderful you know we try we try our best a and we'll do our best\nBut it'll take everybody to do their best this morning 'cause that's\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nine five seven five one zero to register\n... of them as bad as bill New York like over programming and we'd like her one eight hundred three two three nine to six to\nPlease please everybody please morning people please understand we're on the precipice of ending the fund drive but we can only do it if by seven thirty this morning we have raised twenty\nFive thousand dollars that gives us Twenty one thousand dollars to go and if everybody will do something then we'll have our roundtable we'll have our panel\nAnd we can do it and without you we won't because as we have said many times here\nWe're all in this together and boy do we mean we're all in this together we all made it we all are\nGoing to sustain it the same way we sustain our kids the same way our children will sustain that kids you know the best people in the world are listening to this radio station\nOne eight hundred three to three to six to one eight hundred three two thirty nine to ... [noise] it's up to you and we were all in this together were chain we don't know if there are weak links we will make it\nIf you can put something in that would be great I never told you how much or if it's five dollars is five dollars [noise]\nTwo hundred dollars and you get the element of sugar in a package number one one eight hundred three ... three nine to six doors raise that this morning Sonoma sugar one eight hundred three to three to six and David you'll keep an eye on how many we have left are you OK\nAnd a dawn of salt point a one eight hundred three two three nine to six to a\n... point where\nEverybody is well season no right well either well see that today or has hypertension problem or one it doesn't have any ice on the old driveway one other made quite an or as a hypertension ... okay when your doctor you know one no I Know one thing on Monday [noise]\nOh yeah do doctors every time he writes what'd you say two doctors on a medical Monday people always go up a little doctors\nAre some people say talk 'cause yeah 'cause you're a doctor to at the same kind well my ...\nMy mother in law and we were riding in a call this the true story and my I said I don't think you're like me that much\nAnd my mother in law said to me well we had always hoped Roosevelt would marry attack and and and and and and roses and said I didn't marry or die she said no that's a fully died three two three nine to six to one and\nThree [noise] nine to six to but in the end we're all in this together rights were all in this together I Love my mother in law who's a great big but\nOkay that was that was not like her she was great then comment nasty you know saying oh she guys I served break is not necessarily compromise like she was humorous okay a great sense of humor in a nasty you serve it off away one eight\n... two six to so many one's called me and said you know I'm a mother in law in I resent that yeah and I said all mother in laws are not the same morning hundreds of eight to nine to at least as far as we know one eight hundred three\nYeah and I said all mother in law is they're not the same world hunger three to ... to at least as far as we know one eight hundred three three Ninety sixty but this mother in law of the great one\nOne eight hundred she carrying literally kept me on my toes yeah one thing I Would say that what you said that you oh I thought you said she was asked I didn't say that oh okay you know when they do 'cause the tone of it I thought maybe it was a little friction there\nWhat you want to lose the mother in law and [noise]\nOne eight hundred three eight to nine to sex too okay I'm\nSarah from Hurley is getting a the the umbrella she says she wants to um ... uh uh interested in from a rose boom New York rose boom is not only the Hearst come from rose boom rooms blood ... but Roseburg of thanks for all you do huge fan of live from me or wait wait don't tell me and\nFresh air and and Barbara layered approach kept seeing or\nGetting married or dogs socks [noise] we've got you cover umbrella and the Chico bag\nOne eight hundred three two three nine to ... an added a little something you know one eight hundred three two three nine to six to now we have to make this to remind me remind you if you're just waking up I'm we heard from came out again and said if if\nIf you can buy seven thirty this morning raise twenty five thousand dollars to help and fun drive so that I can log on to the ... I can listen to the pound one eight hundred three eight nine ...\nI Want to just for the head of this note okay alerting I'd say socks that are part of the package that are for humans not the dog owner you know we say dog socks but it's a picture that allegedly Murray on the Sox yet WAMC logo these are for the last of course\nYou got a very very very very very big dog yes one eight hundred three eight to nine to see but then you need to bear what then you need to pair well get to hear because you got for dogs have the four legs when\nDisturbing as three sixty five so I might as well you used to treat it rained accomplish those do you have to say ...\nOf ... New York mayor Allen or you you are tireless we are very very pleased with the work to do really and Mary and I love you for that thank you very much not everybody feels that way much Jay most of us one eight hundred\nThree two three nine to six two ladies and gentlemen we have Fifteen minutes to go now\nWe need a hundred and eighty four of you we have five hundred thousand listeners we have been hearing from you over and over again [noise] get off the air get the panel back when we really need them so if you could do something whether it's five dollars or a thousand we've seen both of them this morning one eight hundred three two three nine to ... you know\nA thousand dollars is just three dollars a day yeah three dollars a day that's all it is you could do it on time so much down so much a week month\nOne eight hundred three to three to rent one eight hundred three ... three nine to six two\nSo a thousand dollars so I say to you\nAnd I said was all humility all the humility that lives within myself\nCan mean thousands dollars way under three three nine to supply so I said get me a thousand dollars one eight hundred three two three nine you can do it one eight hundred three two three nights in six or you could do five dollars whatever you can do yup wherever you can do\nWhen I see those five dollars I always cry 'cause yeah you know we have to me this morning said they were\nYou know they they need help to feed their family and they're doing five dollars one eight hundred three do three nine to six to you know what we all made this radio station we all use it together and it really is something that brings us together\nSo if you could just\nYou could just\nUnderstand the concept because that's what I'm begging for not taking the money I'm begging for the understanding I'm begging for the understanding that this country is in real trouble now\nAnd that our grandchildren and our children\nReally screwed out of their inheritance by a president who doesn't believe in climate changes oh well yeah maybe there's a little climate change but it'll turn itself around you hold up a ... a liquor store and you go to jail for most of your life\nYou create a climate where people are dying the panhandle where the oceans are roiling and you face no consequences at all let me tell you right now something better change they just better when it or to redo three nine to six to\n... a big ... Theodore cooking am a red hook New York we just love everything about WAMC and we thank you getting the\nPackage yeah what's in that package ... and you get yourself a WAMC we've got you covered on\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for what three four nine nine six six zero zero\nNet stuff about the movie protects you know if you're making it up\nRight I Want to look at the right to\nYou also going to marry the dog soccer these are to be clear socks for humans that have a vague resemblance to Murray on them and also directly like nor do you also have a WAMC Chico back which is a grocery bag or you can reuse holds up to forty pounds if you're at the cinder block shop you want to go to block\nIt will hold one for you I was talking to Murray us and then went home I was in\nDog tired all all of our dog tired I got home and I said I Want to talk to you I Want to say these\nI showed on her side and Murray the dog who does speak English yes he learn how to read it at the\nAt the ... the new south virtual literacy a place network network yeah he did and he started to cry voice I never I never thought I never thought in my short dog's life\nI Would ever be so honored to have a pair of socks named Eddie cried it's pink little tone was hanging out of the ... and we usually think and sold them all he was he was crying job or a little ... terrific worlds cutest dogs are known\nAnd and and ... there he was he was crying I'm he says I said what are you crying about he said\nI'm Crying about my late cousins that food ran out of the one eight hundred butterfly offering nine to know but don't bump but after I was serious one eight hundred degree do blaming but I'm bomb hey look what\nOkay ladies and gentlemen the seventeenth as is the [noise] LA down we've got forty six\nMinutes to do this and forty six minutes to do it in and came out again will give us five thousand dollars if we can do it by seven thirty by seven thirty and that ain't long from now so morning people let's get going here you know I get depend on it you want to know the weather in the morning you want\nTo hear or you want to hear David Guest Dina your David one eight hundred three two three Ninety two I'm On the air you want to hear it all one eight hundred three on three nine to six to you got to do it one eight hundred three two three nine to six to\nAnd Anita ... he's I don't know what I'd do without it at night and early morning that's where the neatest said Anita thank you Anita made me cry and he said I don't know what I'd do without it\nUh and and getting the ... and we did think the ... already okay one eight hundred regions ... two six to ... you think that\nPeople should always be named after what their original profession was what do you mean oh well like a you know like a you know somebody who may bacon they should be named vacations\nOr Miller who was a mailer yeah right now so I think it will be back autos highest right shark without a devil means little that was your profession way back when I think that's what they're not even today some would say\nBack in the old days that would they would do yeah what they'd be devil's advocate Mari Adele Mario this doesn't happen without the excellent volunteers more M. and M. yes we don't have enough ... but I don't know okay I knew more eminent as as as okay\nUh have you back the umbrella ended the dogs ... and none of the ... Massachusetts retired\nOkay uh more eminent as as as a pack\nA day that you go back the umbrella ended ... anonymous delivered Massachusetts retired on an entitlement sorry I Can't afford more hey anonymous you did great and I mean great and Carolyn ... wins in New York one eight hundred three ... three nine to stick to lay down and we're not going to make we only forty four\nSarah from this guy you know one eight hundred redo greener thinking Sarah one eight hundred to three nine to stick to a big thank you uh uh on behalf of all of us volunteers listen up let's give a began to heroin Seligman and George giant middle grow New York\nHave agreed to three nights in your radio whoa one eight hundred three two three nine to six to we can do this look we need a hundred and Seventy three people like he's like an awful lot of people might have five hundred thousand it doesn't\nCome on and take a leadership role\nShow everybody what this says and say you care about our environment you care about our panel in the morning you want the stuffing the package whatever whatever your reason but every phone has to be ringing or we're not going to make it we only have forty three minutes to do it in and now I remember what's a what's a foot here\nTo go in the whole fund drive a one eight hundred three two three nine to sixty we just need your help we can end the fund drive by nine o'clock this morning a carry Madigan says that we can take this twenty five thousand dollar chunk out of it it would be ...\nPanel was that Joe and Alan and the cast of regulars whoever might show up there on short notice when eight hundred three short one eight hundred you know you'd go with that sure didn't again and we know you're going to be here I was covering the\nThere you go with that seat you just did it again why you just said oh we know I said like short stuff and and they said we know you know I\nKnow you're always short out is but yeah no you're you're you know what you were in Iran told them you know we've been here a long time you are what are you here on when you're ... you're trying to one eight hundred\nThree nine to ... and thank you do anonymous from choking New York getting the package money to go ... W and future if you go back and we've got you covered him ... rose Rosemary forest of Amsterdam they all went down to Amsterdam give up the good work it does help and uh again came out again we'll\nPut five large one five large thing about that process that's a lot of money it's a good chunk and that will help us down then we'll be within striking distance of the end of the ... one eight hundred but seven thirty this morning and that doesn't give us much trying it gives us forty one minute so wherever you are\nJust say what is this radio station mean to me now folks are going to be honest with you I don't want to go negative ear because when they go low we should go high but there are those people out there who would love to see this radio station disappear we hear from them\nWe know about it I'm not going to get into specifics but I can tell ya\nWhen it's time comes you'll hear all about one eight hundred three two three nine to sixty but what I can tell you is\nWe're here because our group for all of us together\nHave joined hands from the first day in Nineteen Seventy nine when we started to do it and we said okay we're going to have a fun job I don't remember the guy who was running WAMC said to me\nAnd then little by little Jordan began to change pretty soon\nYou know pretty soon he was loosening up right now he's a slob unhappy [noise]\nYou know in a good way [noise]\n\nYou know and the old days rose Ellen I Would go to the Friendly's remember when there was a friendly with the\nGreat bank it was sort of famous for from yeah well I Know that we don't give it a number first yes eight hundred three two or three nine to six to now the friendly because a friend and a and you know is after tank would or something you go in\nAnd I would get a rare hamburger and they made it on red remember those little I Love and and then you get a chocolate bolted jump and you said your wife\nThe right thing and said her so Roosevelt do you want some chocolate malted because if you do take it now now you get one of your own or take it now\nShe said I don't want any I don't want any of your job ... right now you know there is a certain way one eight hundred three ... three nine to six if there was a certain way in which you approach a chocolate malted there is symmetry to it every sip\nHundred three ... three nine to six if there was a certain way in which you approach a chocolate mall that there is symmetry to it every sip\nLeads to the end [laughter]\nYeah well then of course you know is this going oh I don't yeah of course you do so you're going down to the end you take ... take a little piece of hamburger and now you come down to the end and you're sitting next to your beautiful wonderful life\nWho told you\nThat she did not on any of your mouth that the whole symmetry of bringing them all said oh I was down to the very end right and what are you here you take your [noise]\nYour eyes and you find them on the clock for a minute [noise] that's located here right\nAnd she and grab that last piece of more than what you have been leaning of silver the and higher\nTime one and everybody can relate to this 'cause you're all have a road though one way or another one eight hundred three two three and then link to sit on the radio on and so just by next time right one eight hundred that's right what you should but then she called us spendthrift you know what I mean one eight hundred three to green I ...\nI didn't want a malted right you're you're a an enabler she called me an enabler if I got to\nTell you that she would have sort of yours all that's the great hypocrisy a Shia one eight hundred three ... one eight hundred line one eight hundred\nCall the wife of a hypocrite audience that's what I didn't call it happened okay that's fine too even with the age where you want to say well it's interesting we can roll back the tape in divorce court and we'll see what happens\nOne eight hundred three two ... two six alright\nAlright twenty seven minutes we'd fourteen thousand nine hundred and eight dollars\nOkay can I ask for failing to man thousand dollar one eight hundred three two three you can do it you can one eight hundred three two three Ninety six to just a few will help us get us and the game ritual every one eight hundred redo three nine to sixty right okay [noise]\nOkay a group and a ... and Jennifer a\nLoop and Jennifer ... del mar okay we've got you covered umbrella of to go back by the time the U.S he's putting me well maybe I could come up with\nA animal and why don't you discuss that well I Do to legal okay go ahead and early ...\nRadio WAMC FM HD Ninety point three Albany W. R. you win a T Ninety One three rounds and Utica WAMC AHD not important on Kingston W O a storage do Ninety One point seven Middletown\nWC yell HD Ninety One point not watch Berg WC again HD Ninety three point three kind of Joe Harry W. A. N. C. H. D. one oh three point nine talk on the road a\nWAMC wage the one oh five point one red Barrington WWE S H da da da da da da de ... Stanford W ANR eighty eight points by Brewster WAMC am fourteen hundred Albany an online at WAMC dot O. R. G.\nLadies and gentleman\nI don't know we want to end this fund drive and we can do this with your help\nWe need fourteen thousand seven hundred and Ninety five dollars we only have twenty six minutes to do it in and I know we can\nI Know we can in order to help out I Am going to risk amber is rat amber is the boss of the fund dry right\nAnd when she gives you one of those Amber Alert [noise] it is an Amber Alert or ... you you are really in trouble and and uh she just gave me one of those look like hold or what I wanted and were all given you're one of those looks All right\nAnd you you are really in trouble and and uh she just gave me one of those look like what I Want to enroll given you're one of those looks alright\nAllen's much sugar enough package number two number two I'm taking Allen's which are going to back in the number one\nOff the table OK here comes the son of a show gonna yet the winter is coming yes the winter is coming yes so if you call right now\nYou can get mature than a package number two one and here's what it is\nA WAMC winter\n... years we'll get a ... yes when I was with the logo on it\nIt's and bombs and blazes in blazing Iranian bombs writer and embroider ... or ... ... which bothering me well don't know if mom embalmed ... it's a beautiful\nYou put his hat on in the winter and you will never have cold ears again ... okay you get the\nCat the hats right and you get ... get wild\nTanglewood we're just doing it on there and we weren't put it onto your feature like camping down 'cause my\nAh there there's a there's a blanket no this is more of a summer blanket to be fair Ronan\nOr use it in the winter games in the summer okay you could put it looks like Saran Wrap in two thousand year old right\nYou could put it on the ground you can lie on it or you could ah one eight hundred three two three you get the hat and the uh uh\nWAMC blanket for one hundred dollars but that's a good ... good for you\nNotice how all the phone's ringing yeah one eight hundred three noticed that get that you get the hat right right you get the hat you get the blanket alright alright one eight hundred\nTo three nine to says well obviously one eight hundred three two three nine to six to now for all of you think you've got all the WAMC swag this is something different this is a beautiful blanket not only that it rose up\nIt has a theme of no closing oh yeah on it you know they can close it yeah and so you can carry it around wherever you go you never know when you're going to a blanket right one eight hundred three is right you could use it in the which some what happens what happens\nWhat happens if you get caught in a snowstorm in your car won't go right you have this blanket right or you have a blanket\nAnd you have the hat exactly\nSo you'll be warm in those last lonely desperate hours\nOne eight hundred three two three nine to\nGood morning or if you had of course if you had what\nOh now she's you know I'm not going to OK okay amber says we thought more highly alright I ever wanted to handle it also so\nShe says here's what you're getting the sugar baggage dumber too many you get your blanket right try to get your winter hat rack\nAnd you get\nYour mouth gray long\nI Love the I've never seen it shocks which are these look you get your amount gray laws\nAre a lot of air of stocks\nAre great they got the trees that then the thing that stop of the mountain\nAnd the logo these are beautiful winter soccer okay I Want to we only got twenty two minutes that's the most I can do All right one eight hundred three nine to see what their hot and blend okay one eight hundred three just horrific experiences but she'll gonna to now if you're doing it online you have to refer to it as Alan\nFrom the sugar in a package and number two\nOne eight hundred three two three none more than this I cannot do for it\nNow if you're doing it online you have to refer to it as Alan from the sugar in a package and number two one eight hundred three two three nine more than this I cannot do for you\nIn fact I even I Am a sounded that amber came around and so usually quite a\nA circumspect about having things away she came in and she said okay if you could do that you're going to have a splendid ladies and gentlemen Twenty one minutes to go a lot of time in a lot of money to raise the short amount of time there one eight hundred three two three nine to six two\nBunny hug 'em ... new polls New York to Alan you are great political genius thank you re you have the\nKind of hard and I love food Fridays much a re gee so you do food friday every Friday assert maybe that will account for it what well what do you mean well the one eight hundred three to bring it to me\nWhy are you trying to darken my kind heart no not at all and agreed to three nine to ... I think it accounts for some things though that\nEight hundred three to three to six to the shark dot with sugar packages number two is on the board\nBoy we've got a lot of money to raise the around with okay we need a hundred and forty four people and we only got Twenty one minute to everybody you love your station\nOne eight hundred three two three Ninety six or let's do it let's make it happen we really need you by seven thirty this morning we needed to have raised twenty five thousand dollars a down to less fourteen thousand always goes quicker than the end but\nUh uh didn't say whether we can use and you were saying that that was my Mother Teresa and butter ... would burn New York we enjoy the programming especially rain and Joe racial or that was John Allen was grateful for your program listening for Thirty years getting old package\nAnd again thank you very mad again we'll give very many\n[laughter] oh God I Love your or running or is it a nine to say to a [noise] a Matthew ... of a nice green book New York is getting mature going to Pakistan but to\nCarry met again with us five thousand dollars we only got ten minutes to do it and ladies and gentlemen you know a hundred and seven if you if you've got a thousand dollars or five hundred dollars on if it's your now is the time because the fund drive is almost over\nAnd we can really in jail when girls so I have I haven't got a ... a month now I I was very ill I was over in Amsterdam\nAnd I saw something that was Flemish ends wondering who won in energy to every now and Jews\nOkay from April ... think that that that was very helpful getting a ... a and carry it would give us five thousand dollars a wonderful carry on wonderful yes when every one eight hundred three two three nine to stick to hey get\nOn a phone hey maybe we'll get off the table move it move it move it All right\nSo come on everybody let's go one eight or nine minutes and twenty eight seconds to do it in\nA year okay awesome look of a mountain of Massachusetts at the end you can't you know of a a month and thank you thank you okay Anita from maple correctly or can't live without the station get\nOut the vote and is um and by the way isn't\nSet a mouthful I needed said vote by vote vote vote let's go any ... packet of began to another from North Hampton mass at nine thousand these now nine out of your mind carry Madigan will give us five thousand dollars he got eight eight minutes and forty eight seconds ago\nEverybody on the phone let's go by seven thirty this morning Kerry says if we\nCan do what you give us five thousand dollars\nA shooter cold spring or New York\nI Love the station getting Allen's Michigan a package number two\nOne eight hundred three degree nine to six to and by the way folks just say oh no we never plans we made this went up as we were going or one eight hundred three hundred to ... yeah well you know you're pretty good at that right Shawn merry of good to the park is getting much sugar package number one\nHis mother is answering phones you write\nA sex bomb Marianne Eric in talking to you know we love WXXI just\nOn food writing promoting our feel good food good book loves re grass\nWage cuts not on it is nice user Pamela Howard Greenfield center a big thank you W and she's a key part of my day every day and by the into Web coming in from the into Web\nThe remarks coming in now and not a big field in support of wander Fisher river sample anonymous from Greenfield sending you\nKeep up the good work Toby groves of trauma and thanks to Joe and the roundtable getting sugar package number two All right [noise] ... Rosen ... New York a public school education shopping doubling up for public radio getting regular going back to\nA anonymous from April park thanks for driving me in every morning and getting the sugar\nRadio getting regular going back to\nA anonymous from April park thanks for driving me in every morning and getting mature than a pack and\nNumber two ladies and gentlemen come on now we have seven minutes to go we're not going to make it everything's we will not make it everything on the table ... you've got to do okay here we are now this is a thousand these but we only have seven minutes to go\nJon Collins he screamed Bush is\nGetting much you're going to package number two are of great this is wonderful anonymous from great neck New York I Love to wake up to Alan's political commentary in the morning and we're not allowed to read his name oh this is a public official\nEvery time you give us enough parents that we all know what are the only one hand he's the comptroller of the state I grant you see those again\nOne eight hundred three eight to nine to three one eight hundred three two three nine to six to\nOne eight hundred three two three Nineteen sixty come on come on come on baby of this is wrong this is just wrong he eighty eighty nine people right now with a hundred bucks come on folks if you got a thousand get us in the game do whatever you can come on this is the end of the fund or if you want the panel\nThis morning now's the time you got to tell us everybody on the phone Kerry said if like seven thirty that's what it is seven thirty one eight hundred degrees you know nine states um\nHow much are we add one eight hundred off in the whole drive well ... yeah ... will come on all kinds of All right no getting right now are right\nFor good reason a thank you though a repeat you're always there for us and this you know\nOnly station I listen to how could I not pledge okay one eight hundred we can only tell you how much we can make this twenty five thousand we need to eighty seven people now we only have five minutes to do it and I need you now\nI Need you I Love you a new one eight hundred three two three Ninety two six to ... green and willing to Vermont let's wait wait don't tell me thanks for being they're getting the ...\nRole suck all yeah we're in\nThe country of ... thank you for keeping me sane he's getting Allen's sugar packaged them into what's in that very clear\nOkay you're going to pair of WAMC mount gridlock socks which are beautiful you're going to a nice WAMC winter cap\nAds you gotta WAMC blanket which is good for summer for winter you could take it over to the Tanglewood or you could sit outside or in a snowy lawn or doing nothing anonymous from Amsterdam called and knowing downrange loves most everything you think that's a shock shot it could be shot that you could be could be Terry Gross they don't like you know one\nEight hundred three two three and now you're talking one eight hundred three two three nine to ... to getting the umbrella one eight hundred three two three Nineteen sixty okay we've got four minutes cigar well come on come on come on and everybody on the phone\nStephanie mugging allies of ill\nSends out support for every early head start for all early head start programs as at WAMC than our tax dollars support is getting at WAMC tote bag when you're going to bring to the ninth and tenth legendary ... eighty four people we have four minutes to go I Need you on a phone or WAMC NATO or\nWhy are you doing this to me one eight hundred three to\nGreen who's retired yeah how's your back my back is hurting one eight hundred but that's all right ... I did\nOkay this is setting and now you're getting a little relief no point in having three\n... three nine to six you know everybody on the phone we're doing fine come on everybody had a phone let's go let's go somebody's got a thousand I Know somebody's got a thousand one eight hundred three two three nine to six to one eight hundred three new nine to six to every phone is working to get on those right come on what these\nAre going over you know what I heard last night where what what what what hurry up the boys last night gave away a somebody one of the Marie ... an ounce bottle I really yeah you get them are in our Bible and you can have one\nOne eight hundred three two three nine to six to three minutes and forty two seconds everything on the table will count one eight hundred three two three nine to six two\nThree nine two to three minutes and forty two seconds everything on the table will count one eight hundred three two three nine to six to one of them three two three nine to six to\nA nursing castles in New York Thanks to everyone for all the help and uh and encourage them to keep going on one eight hundred three two three nine to six people All right ladies and gentlemen eighty three of you know three minutes to go away and every three to three Ninety six to\nWe can do that we can have the roundtable this morning I needed to\nOne area three two three nine to six to one eight hundred three two three and a salad brothers also saying ... to to run we got health for that so we don't play okay good pheromone it wouldn't be too bad for that yeah you know some people have no sense of humor that's just one thing that's for sure that grungy of north than than Vermont is getting the\nHe's getting a bar in the dark side to Chico bag and the umbrella okay now that you had to make sure that I don't want one thing I'm sure\nIf you can't get through to do it on the Internet like just worsens Elizabeth from Albany New York and rose Ellen I liked the opera wait wait don't tell me and roundtable W very important thank you for all you do really is a gentleman eight thousand to go one eight hundred three two three nine to sixty\nTwo minutes to do it in one eight hundred three two three nine to six to\nOne eight hundred three ... three nine to ... to a boy and a seven times Patt a sister a\nOkay pat from Albany New York I think you're doing a great job we think you're doing the rank you think that one in seven thousand now served as his two minutes ago one eight hundred brings you agree not to stick to okay where's amber\nAmber is coming to visit the delay to get the signal one of the office ...\nEight hundred three two three nine to six to\nSeven thousands you know one minute ... seconds to go\nFrom for example I wouldn't hold back times [noise] a first name only called again a shell of ...\nGermans I Love them and I love Amherst one eight hundred three ... three nine just exist in getting the sugar package number two okay Amy of Weaver town where everybody has a room of ... I guess you listen to every day on a way to work okay one eight hundred three Tuesday nine to two oh here's every now\nAnd but you can you call him carry up\nAnd ask her if we can use the here and then if we can use we can have an extra\nTen or Fifteen [noise]\nThat do it anonymously from a real part thanks for all you do I encourage everyone to vote thank you getting him the trigger package anonymous announcements ... springs Allison from Saratoga of anonymous in Springfield central New York jets Alison ... springs routers he area\nThree nine to six to a anonymous from loving bill thank you anonymous and clams Jack of all\nOf a of of West ... loves the stakes listens everyday\nIs getting na a number one OK Kathleen of focus the New York keep the voice of reason getting number two I'm a\nTeller grow your hair down to two thousand eight hundred and twenty eight people will do it [noise]\nAnd I think we only got five minutes to do it in and if we blow it now it's on us you know my up by boy journalist who's to say to me it's on us and speaking of Jonas yeah\nWe're all the people who need going into winter need to have a uh how you say a crank radio a crank radio that everyone's got one now right they do not have to end their kids don't have a well and they can send them for Christmas gifts and let me tell you\nI Know people who save their lives like Joe he's writing one eight hundred you went to go one eight hundred and three two three nine to six two ladies and gentlemen five minutes come on everybody on a phone one eight hundred three two\nThree nine to six to Thomas crossing this is the roundtable every day getting much sugar and number two accounts and are anonymous from risky you know hoping to find the fund drive and sue so we can return to normal rogue revenue bed\nFor sure going to do for you and I was in I think it's amazing we're so lucky to have a\nSeizure treasure you listen to one eight hundred three two or three of the the arrow money on you know what we're wondering is there a modern\nLaundry OK Susan is getting a\nBoth\nI don't get a one answer all all Robert Nichols Middletown New York the pledge to further back in the further back in the father forward you are likely to see Winston Churchill Chris uh give give bit of a sort\nOf just four minutes Carol Davis in Woodstock New York or getting an umbrella\nA bit of a sort of like you're just four minutes Terrell Davis of Woodstock New York or getting an umbrella\nAnd giving the FDR library and has been very nice to it\nOr not and Karen from start to understand living with twenty five years every day you really rely on WAMC covering gloves station it's the best [noise]\nAh my from Troy thinking like those great one eight hundred three two three nine to six to\nThree minutes thirty six seconds ...\nTwenty three hundred and eighty four dollars when he says this is not going to be you know what did he not certain one eight hundred three two three nine to two twenty three people get on a phone maybe we'll get off the table right whenever you do three nine to six you Tom and Emily a six words\nOf a mistake union New York one eight hundred three two three nine to want to do when it under three ... three nine to six\nOne eight hundred three two three nine to ... the hope of del mar my old boyfriend used to say listen to the brain is like walking into welcoming arms I agree I agree ... Jones is genie of connecting\nPledging for granted ha for future thank you count and Judy remains of a new policy will come more loyal getting I'm getting a ... a number one I get\nA a amber how do you rent amber how do you know whether they're giving out more than a joining we have\nStickers migrants all I see okay records run out they're gone\nTeam in the hall or middle down your Colo I Love you and we love you\nAgree OK human thinking that he looks like Keenan to me even ... came and candid\nAnd honest and west shows can watch the program gets this morning okay Nancy in Saratoga telling on getting\nTPS seizing allowed slippery of the pages on\nNow it's your fault it is she's right stop it I Apologize [noise]\nPlenty under three did that was him not me cut it out you know what do you mean a nine\nTo ... okay one minute and fifty five seconds\nEverything will count two thousand bucks to go one eight hundred redo green I did one thousand nine hundred and sixty Nineteen people will do it we got one minute forty five seconds everybody on the phone now now now now di di di di di di one eight hundred three degree nine to\nSix to one of our great degree Ninety an hour from Albany thank you love Alan he cracks us up and gyms or rent a car the riots good Jim from this guy you know okay and and\nThe gear hard so dumb on York appreciates the states for a long time and garlic having a nice chat on the fact is Carla and Christopher Sullivan apply for keep up the great we're facing as important to me\nAnd thanks to Peter Evans of alpha month glad to support you in the uh and eh seeking cell of and keep up the great\nWorks of sanctions important to me from Vernon in Massachusetts\nAnd Jessica from ... from my son holding a one eight hundred three two three Ninety six to uh fifty seconds\nAmanda gold everything work out\nA Amanda gold locker from William Massachusetts just something that makes me feel pretty good what sounds a local hero now most drugs I Would miss blended up but this one like I I really feel good about that thank you\nAmanda or or take ... to one eight hundred three two three nine to six to one eight hundred three two three nine to six to Noelle thanks for all you do please because he really engaged and like us and please help get out the vote to get out the vote says no\nSix to Noelle thanks for all you do please could\nEngage in ... and please help get out the vote for the missing them\nGet out the vote says Noel Margaret panel Vermont a Margaret says Allen the shura too pleased and honor my grandmother may roll\nNathan wrapped in a sea WAMC rather would like to hear more scenes voices on the roundtable one eight hundred three ... three Nineteen sixties getting mature than him number two\nWhile they last that I think we're down to the ... now but not the one eight hundred redo three Nineteen sixty\nFlora tiger the Gilmore New York\nI mean ... ... you're not saying you shall we just have all your gage either as a Alan ... yang ... getting\nNumber one uh anonymous or from del mar end the dry ... for Massachusetts luxury station get out the vote yet calming Molly from out them out the mind keep up the great work getting the\n... the the the elements in the number one this anonymous and slipped in park a one eight hundred three hundred and sixty Stacey fiber of skyrocketing appreciate the factual news and\nIt's getting insulated tumble never got into that yeah humans to boil a gesture Massachusetts\nAllen anybody works is you do deserves our support thank you two\nAre anonymous from down or dumb on your\nDifferent but you also don't want to New York is getting a crank radio good for you yes\nAnd Elizabeth uh John us connecting New York is a wonderful station I listen all the time we need to hundred and twenty six dollars everything on the table counseling a shower and billions of them on your first time doing it I was an all time great I Love you for saying that sharing\nIs getting their mission and number two\nAnonymously middle both thank you anonymously little girls I Love the roundtable all diverse we're going to give me hope the reason I haven't moved\nTo Canada I met somebody yesterday where I really love you can listen to Canada yes you can go to antenna and not only that you can get Plattsburgh and most of kind of right and also you could also not most of Canada shoots but I Know everything up to you know like a like a like a ... right\nAnd caring chemical thank you very much in another plug W and she'd been working in a breakfast for Seventeen years away anonymous from building in center and confidence linger in New York come on folks you spend a lot more on a lottery ticket and you never when we'll put\nAnybody win last night a six hour rats or not they're going to need to know a cursory among driving\nGuaranteed winner let's go ah and ah and Dolly said when I got back from walking my days in Harvey and the ... morning they her\nTell her Murray and in fact I'll never hear the end of a sudden they shouldn't a number one love you guys getting an anonymous in Albany New York [noise] okay and are simply a guess of Schenectady New York\nAre getting the number maturity another one hundred and Seventy six dollars one eight hundred three hundred million dollar ring that a lot of calls workers or\nGreen I Do now [noise]\nOkay thank you do a ... vote of a central Briggs thanks for being the voice of reason this crazy world Melissa Hofmann ... brown to continue doing battle the for the two don't have to go to university to know exactly where you are third city\nAdrian ... how many drinks off then that this is the best we can go next to the one eight hundred\nMost of the [noise] know exactly when do all those city Huffman during often just softens is the best your nurse and the one eight hundred three\n... three nine and then at the New York [noise]\nUh how are we going to do the transition here America's favorite Joe Donahue was coming off\nUs he will come on we're going to do whether or we're going to do whether do whether they're\nYoung so I guess we can say that we have now made ... they this challenge\nNow [noise] like [noise]\nThanks to the wonderful carry Madigan who did what is so unusual in life she gave us a second chance and find plains New York where I once ran out of gas\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\n... to comics and southern Berkshires also the ... hills mostly cloudy and Wendy wood scattered showers today hides in the mid fifties Wendy with a few scattered showers tonight lows in the lower to mid thirties\nFor the greater capital district including Albany Schenectady in Troy also the Saratoga area east into southern Vermont and the Berkshires north divine Ninety mostly cloudy and windy with scattered showers today hides in the mid fifties around the middle of the day then temperatures will fall\nWendy wood scattered rain showers tonight lows in the lower thirty region wide for tomorrow sunny breezy quite cool lower to mid forties milder mostly sunny friday upper fifties mostly cloudy scattered showers up or fifty Saturday\nWindy and turning colder Sunday with a few rain and snow showers mid forties I mix of sending clouds mid forties Monday and a few showers on Tuesday with hides in the lower fifty four WAMC I'm news channel Thirteen meteorologist Paul ... support for WAMC\nComes from luminaries media local food service marketing agency in producers have chronic ram upstate house upstate or explore the Hudson Valley and more luminaries media dot com Albany met now even the mastery family children's emergency center a place for ill and injured children more information at AMC ...\nFerris coin and jewelry one Ninety nine will wrote Albany New York since Nineteen thirty feet during his state in vintage jewelry diamond engagement rings and wedding bands loose diamonds with certificates color gemstones fair is going to come\nBut dark brothers seminar brands and one books were county location for sixty years and counting net direct sales and service of new in pre on cars and trucks it's hard to beat the dark but darn brothers dot com\nBarred fishers center barred fishers entered presenting linked linked circus a one woman show by hackers Isabella Rossellini entered on pan remember Seventeen fishers centered on ... for tickets several helping people with disabilities achieve their dreams offices and amorous Greenfield in Springfield\n... for more information the Waldorf school looks springs giving children education and tools for the challenges of an ever changing world Waldorf Saratoga dot org odyssey bookshop self Hadley BA Shapiro's the collectors apprentice and unforgettable tale about the lengths to which people will go for their obsession\nOctober seventeenth that seven PM odyssey B. K. A. S. dot com the tank teaching museum of art gallery at Skidmore College exhibits public events and educational programs for audiences and capital district and beyond Skidmore ... tang\nThe tenth annual Woodstock invitation to lose the or showcase new this year learned to play guitar in a day at the ... gene Center for the arts Sunday October twenty eight\nWoodstock invitational dot com and wind horse natural path clinic run over over a month offering nectar path medicine oxidative medicine Colin hydro therapy in acupuncture specializing in Lyme disease now accepting new primary patients wind\nHorse natural path ... dot com good morning thanks for tuning into the voting drive we'll be back in a moment it's eight o'clock\nThis is Northeast Public radio WAMC FM Eighteen Nineteen twenty three Albany W. R. UNH the Ninety point three ramps and Utica WAMC ... point nine Kingston W O a storage de Ninety One seven Middletown W. U. C. L. A. G. Ninety One nine Plattsburgh WC a NHCD Ninety three three kinda G Harry W. A. N. C. H. D. one of the three ... WAMC wage the one\nOh five one grade Barrington W W E S H da da na ... Kisco W. A. N. D. H. D. and not even one Stanford W ANR\nEighty five Brewster WAMC um fourteen hundred Albany do um we are still working\nOn the air we are okay Joe\nBrewster WAMC um fourteen hundred Albany do um we are still working on the\nAir we are okay Joe up to you welcome everybody the angle of on dry\n[noise]\nNow I promise job before you got here I promise and we have heard from so many people who love the idea that we will have a handle this morning\nThat's easy to say we have one hour to go in till the panel begins the panel will begin when the fund drive is override\nThem yes okay now we're we're shocked to find some time once with yes [laughter] I look at it in the audience yeah that's right you guys I Hope you have a lot to say because come on in\nAny way anyway here's the deal so just so you'll know everybody [noise] one time I had I was eating a bagel on the air and a lady called up and said I Will never give any money to WAMC again because you're such a pain\nSo no and that's what you get so I realize that aside\nFrom chewing on my bagel among really don't want to do that but I'm going to go to Joe because Joe is going to ...\nAnd then I have my ... when you're done you're always going to set this up okay Hi I'm Alan I'm Joe you were the ...\nIt's the end of the fund drive [noise] not the end of this segment\nNot the end of the of the day\nAt the end of the fund drive but there's one thing in the way thirty three thousand dollars [noise] now we have to do that in an hour or\nLess an hour right ah well we would need a we would need exactly fifty so it would take fifty six minutes right\nNow which I Will note here and now now now listen to me everybody was looking at him and\nWe need thirty three thousand two hundred and eighty dollars and to to to end the fund\nThat's out of five hundred thousand listeners every month that is um three hundred and thirty two people courage give us\nA hundred dollars some people will do is more some people will get us less but the average will be a hundred dollars now here's what can I have a drum roll general against [noise]\nJust when you think just when you think that's the way they think you can do it something extraordinary happens and\nIt always does your WAMC who it was such a thing as a mature going to package number one number two we didn't we made it up as we would go and that's that's what so much funnier second iteration you hear them right\nNow I just want to make a point in that as I'm sure are going to package number two we're out of the mount gridlock socks so you're gonna get if you call after now you're going to get lower east sucks\nThat's what you gonna get so you will get\n'em you'll get the incredible how you say the Murray ones were there you go you know but you get the blanket yep I'm here but it's a habit so you you won't have frostbite on your ears this summer\nAs winter and then in or in the summer and then also are you going to get nuts is not the gridlock socks on the ... but the Murray socks\nNow you say but I ... I say I say to you okay you got anybody in your whole life who you love\nI Would anybody\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nOr or dark with these these were great maybe more so than the ... which are green and Pam these would go with anything I Know you're a slave to fashion you would worry about such that meal right yes but here's the deal yes\nWe all make mistakes in life and we all get tired\nI got caught as we came back with bagel in my mouth I told a story of the ladies that I'll never give any money to WAMC close you spoke with a bagel in about two and I'm like I say well no I remember the morning I Am that Kay but anyway yeah but anyway it doesn't much matter you know\nWhat happened then is I said I'll eat this bagel and then I'll feel better and then I won't have to worry anymore and I won't I won't insult anybody by eating more bagel so right in the middle this folks compulsive this of my talking about this I put another bunch of bagel in my mouth [noise]\nI don't know why I did that but I knew there was a very quick\nLadies and gentlemen here's the deal show how much do we need\nSo to go so if we count the challenger when they do know that I thought you said that you know they're okay okay okay go ahead no then you do your thing no no what they do know is how much do we have to go in the hope on thirty three thousand two hundred and eighty dollars that's the bad news knows everybody listen up yes Maryland\nEnds meet or even in New York said\nIf we can do this by nine o'clock this morning which is ... ... we're going to give you ten thousand dollars very [laughter]\nGood [noise]\nViolent and beat her we love you it's that simple we love you so that means is two hundred and thirty people give ... give a um or take up people um call right now\nRight now the fun rivalry over and Joe will do his magic on the on the panel this morning [noise]\n\nNow now with that in mind with that in mind to go in the entire WAMC fund drive would be us or if you take that ten thousand away Twenty one thousand five hundred and thirty dollars and Fifteen minutes and fifty six seconds\nPeople are beginning to mix and match here when they bring to three nine to do with the kids\nAnd and Jane and Snyder [noise] my favorite program and what you don't tell me it's so important to the last three day one eight hundred three degree nine to secure the are the kind that kind\nOf Woodstock New York I Love the roundtable every day I'm not I'm afraid of German banks are places that Chris or ... or happy birthday pat ... program at\nWAMC is getting the will start to winter hat and ended up blanket comics of burn\nThomas I burn a one eight hundred three nine to say to Francine how Cain yard and Lisa of risk I you know one eight hundred three two or three nine to ... anonymous from Washington village or like when I went for a nice thing the Sox the hat and a blanket\nOne eight hundred three to bring in Nineteen sixty kitty a ... it's a screen like but I'm sure it's going to bring a regulation and hopefully it will continue to move in Manhattan the blankets\nGo ahead Joe what do we got burnt Eighteen thousands and enter the age of Eighteen thousand five hundred and seven dollars\nThat's the good news and the bad news we only have thirty nine minutes to do it interact in order to get ten thousand dollars or Marilyn and the government at which point gets over one eight hundred resumes relying too six to one eight hundred three two three nine to six to okay thank you do kitty ...\nRegulations thank you can clean rooms dramatically glad to do when Dr coming to an end I loved that can always do and I'm like oh you're digging and thank you for that you know they can train wasn't he is and the kid in the secret\nGarden Rosen weren't with all the animals on the ice rink yeah grand yeah I might be wrong I don't know ... or the most\nLike thanks to the volunteers getting the upper when he don't degree for three and I do too okay that'll be somebody else's job to figure that out anonymous in Schenectady Robin different down around New York I like wait wait don't tell me in the Hudson river's job work\nWe have three of Albany New York remembering Jordan an anti ... to do that every year or\nI like wait wait don't tell me in the Hudson river's job or we held three of all day and you're remembering Jordan an anti failed to do that every year a year and I have to tell you I Love those people that are really great\nNaturally board Jordan came all the time what a great man he was\nAnd you know when people when some of the richest people in our friend their backs on her new AMC unveils getting veils for their thanks remind you got any water by an anonymous\nSometime early spring here six people helping people and we thank him to laugh the great when you hear in the hands of advice for love or money hand and experiencing free\nOwning a man and a man who can play the citizens like me I Want to say on during the winter you dance tunes data ... nice Adams thank you and and\nI honor a line\nIn honor of\n... day thing for her birthday young on in honor of mind beautiful state for her birthday I'm getting ready to dog stocks in a relatively few bags\nOr marry a Martian connected Marion Allen large we say the phone number for any one eight hundred races or a\nNine to ... to like that and Tom Woodside Hatfield, Massachusetts thanks for old\nYou are now remember [noise]\nYou gotta do this because they were going to have a roundtable panel will be on a recruiter out in the news one eight hundred three inches or a nine to stick to whatever\nIn Renton Seventeen thousand administrator in ministry of plenty hair of killings in Massachusetts\nThank you and make harvest in our own for I Would love to have radios deluxe year round go Red Sox Theresa booth drop out on the radio for a few red socks and underwear to Troy\nJennifer rent for the general fund drive today Joe and shot of ... got you covered relative trickle back in mind that dogs don't Friedman linebacker your gloves the station\nGail Trammell a voice voice will run the place I went and Joe you make my life normal Allen I Love love love you can start work for that\nOne eight hundred three to green nine to ... I got a couple of buildings that are right to one eight hundred three ... three nine\nFeet or a great fan of the entire spectrum and programs at this age of results that how to get some coffee at the ... farms in the morning Peter I do sometimes sometimes I make it at home one eight hundred three ... three ... to ... very early\nAnd mark and recently voice of a growing in fraud is getting minor drug shocks the chicken begun the umbrella\nOne eight hundred three two three nine to ... anonymous from Boston lake I listen to WIP\nTo and from work every day John and Tina this you know we volunteer\nAt the legal project got you know getting in the umbrella that she'd go bang and murder dog got\nJulius encourage Trudeau tells them you know bring it on hold\nAnd windy for New York one eight hundred three two three Ninety two six to ... and uh\nAnd Wendy from New York one eight hundred three two three Ninety two six two and a\nCarrying around one of them toward you and I really like hearing Alan ... like it is getting a W. A. M. C. Rudy and an island from Belcher down where everybody has a restaurant getting another one eight hundred three to six with\nPaul is fester a cult in own capital you know and I'm Sorry thanks it's great dry\nAnonymously highland New York I Love the states that I wouldn't want to live without it uh sharing a rental and then there's the New Yorker everybody walking in the woods nor facts more as a moral of the real news I Hope\nA guy do when you're getting a blanket ban when your hand and the wool socks\n[noise] a lot of anonymous from a skin next\nOkay and Richard who came out of a Boston spot like everything's safe ... hopefully ended soon speaking of which Jo how are we doing here\nSo you know one second we are in the sixteen thousand say sixteen thousand eight hundred and fifty seven dollars to go in the entire Koran\nAnd remember what happened to that or do\nI did I take that that were you did you put it in\n... because you were back out can you take it out and uh\nYeah I'm Sorry that was one of them or that took it okay a big thing in Maryland and Peter Doug Lemov has right opening a new one eight hundred three nights I see yeah I mean is it okay yeah I and that's where I\nGo in the entire ... not justice break\nBut the entire fund drive and to get the panel this morning such as it is one eight hundred three eight nine to six of one eight hundred three two three nine to stick to a one eight hundred reduced rent on marriage from the Hudson New York\nAnd just as many classes she did it over the interim Web and shower and walk to work for a white I'm Sorry I never see the other ...\nWinning or reduce the nine to ... I've been doing that the whole fund drive messing up people in a Nancy of Albany cranky silver Nancy one eight hundred three two three ladies and gentlemen a hundred and sixty seven people is when drivers over over now I Need your help we all need your help\nThat's how we made the safety and all of us together\nEllen Ellen called from pope hotel room Poughkeepsie thank you Ellen\nWanted her to redo three nine to six to one eight hundred three ... three nine six two okay we need a hundred and sixty seven or knew\nPlenty under the green nine to six to um Arthur long Lawrence, Massachusetts thanks you for answering the phone and one eight hundred three two three\nNine to six to a wonderful friend Hilary Russell Mark Sheffield, Massachusetts dedicated to the great Senator Russell is getting the package which is the relatives if you go back and murdered or\nA device on hate Jews of Albany ore thanks for all the work you do as volunteers and ... you can say that again\nOne eight hundred three two three nine to six give you a John Lennon granddaughter who's the kind of maverick future hammer delivered stars of the screen\nEight hundred three thirty one minutes to go if we can do this in thirty one minute you get a panel such as that is one eight hundred three two three nine to ... to\n... how about Charlie on the one eight hundred three two three nine to six to eight one eight hundred well Charlie's in charge of been given its place nice you know\nOne eight hundred and three two three nine to six to eight one eight hundred feet Charlie is in charge of been given its place nice you know one eight hundred three ... two six to one eight hundred three shows me what's wrong with nothing nothing is wrong with that I'm just making the Jackie Moran idea or\nDid did did Holly bring the dog today one eight hundred three two three nine he was a rough one eight hundred to three nine to fix to [noise] I Wish I had known because you know Murray can speak English you know I Know we could ... I didn't know him right and he can own\nNot this section of the fund\nDrive but the end it now you tell us your love the radio station and I know you mean I Do I Know that [noise]\nAnd I hope everybody's listening to that one eight hundred agreed to three nine to six years because in the end there will always be people who don't like public radio\nAnd who don't like us\nHey fair enough some of them don't like us because you know I just don't like it when it under three two three nine pets okay one eight hundred three ... three Ninety six to I'm not going to start that those words on race it don't say that OK Christine Brennan of coming in Massachusetts\nFor the rounds you for coming in with everyone one eight hundred three too\nYou said don't say that OK Christine Brennan upcoming in Massachusetts are hoping\nFor the rounds you for coming in with everyone one eight hundred three two three nine to six to one eight hundred degree ... ... New York loves around that will be lost without it\nMargery list okay getting a lecture and McDonald of Stillwater where everything runs deep loves the\nSnakes inspections around tables and Monique and walking Hanan meaning of Newport thank you can alter\nAnd Helen and Helen Helen was green or live on the run back and your your memory of my dear friend sealed Berlin a volunteer and from Memphis supporter of the radio station and thank you very nice of you\nAnd Kris Riley of your thoughts your loved the grapes and did an hour and ... and the roundtable anonymous from home in New York looking forward to the panel today\nWe've been hearing now is an error later when Internet freak perjuring nine to six there's got to plan\nOr whatever you do have a plan and I think we're ever going really wants to learn where do you mean it was going to be on it oh I wear it while we're still negotiating but I think we may we may have we may have passports really\nKnow why does that mean Jordan and marine or if you're going to be honest I don't\nKnow why is it that I feel compelled to pick on joined I don't know I don't pick on everybody else but he's sitting there and it just seems to me is the most unlikely guy you'd want to pay some teachers can hormones these themselves those troops over here to do three Nineteen sixty and he's great he's the best\nPerson we've ever had in ...\nOne eight hundred regions or a nine to [noise]\nHe doesn't take any government from anybody he's a strict disciplinarian one eight hundred three two three nine justices yeah fear he something anyway\nMal envied or God Bless the Albany or we'll get ten thousand dollars for the [noise]\nNow we're ending the fund right we need a hundred and twenty four people we only got Seventy Seventy Seventy eight minutes hey this this has got to be the end\nOne eight hundred three two three nine to two cars every second that we still now will come right out of the ... out of the roundtable you wanted to round table we're going to give it a few Hillary regular or rent for less than that now Hillary Clinton said it better is getting a um\nIs getting a machine a package number to\nWatching them of sugar in fact his number two well you've got the blanket ... you get you know how you gonna let you go in and say\nWhat do you want right you get your you get to warning against scrambled eggs or we take your one eight hundred three two three nine to six to one and only get used to getting scrambled eggs you're getting this will get you that one eight hundred three ... three nine to six or well you get in the sugar package them until you get a blanket\nWonderful blankets and rely on it in the winter in the summer at Tanglewood in the winter and it and it goes up and as a little do for them they get into a little package then you get this youthful act which is both in grave and I'm In bowling and um what else is\nIn grave or whatever um\nAnd bombed his lawyers are earlier yeah bomb bomb one eight hundred three hundred of them\nLet's give up began doing on from how'd you know [noise]\nThat was very nice that was very very nice now that catches in the game right you know\nWhat happened so this is just a bump up up up there you go okay now to go in the halls and drive\nNow that catches in the game right you know what happened so this is just a bump up up up there you go okay now to\nGo in the halls and Dr ladies and gentlemen ten thousand eight hundred and eighty dollars [noise]\nI mean a hundred and eight of you or\nMake that happen and the ... family of Troy New York getting the hat the blanket and dog socks\nYou don't get Marie nobody gets money no I'm Ryan and when\nWe got to remember when he got up there Joe and use that one we do in the like the first day I brought him here and he got up on the desk and gave you a big if it was we're we've been we've been tied ever since and we had a gay real speakers and um and I got to tell you\nSince that day um and we took a picture of them not to the official Laurie from that that gave you that big gets\nDan and Judy oh don't go to Alan congratulations on another successfully fun Robert Danin Judy congratulations to you for what you did and Sondra juvenile\nHumor in the back of a Jack of all of a of Mexico into the screaming would be lost without it Sondra we love you and thanks for doing that\nUm and that's great oh then it was great to America\nLadies and gentlemen the nine thousand of these nine thousand [noise]\nOne eight hundred three two three nine to six to Nancy Conan just Greenfield that are usually usually votes for free of pain and and car all new falls in honor of the news a St Louis Missouri yeah you'll remember her from\nShe was in the uh excuse me the Pete Seeger's song newspaper meant to say no that's right that's right Jodi of dumb on your take my money please ... green ... to ...\nAnd um you've seen me a scholarship in scope of a dumb on your thanks you've you've seen the embedded some nights of view and Diane from this film [noise] um [noise]\nUh okay uh loves everyone they're anonymous looking forward to the panel today said Mary from ... New York\nAnonymous Ernest unit on New York's\nOr that they used to be able to use this is the leader from South Hampton anonymous them go Harry thank you very much\nLadies and gentlemen he's the only now have fourteen minutes to do this and and now you're getting worried again one eight hundred three eight nine ...\nIf everybody wants to being on a kill list is at ... degree do agree nine to six to get it from South Hampton anonymous into Harry thank you\nVery and re never know Manchester federal listening for years and we should all his government because Richard breads have done more thanks for all the good work thank you Richard that's very nice of you and very general\nAre anonymous uh Emily from Plainfield enjoy all the program is getting an eating blackout buddy remember them one eight hundred three eight member blackout buddies oh that's a classic yeah you can put it in a wall and you just go from there\nOr Raymond ... of a hose is getting which are going to package number ... even gr via western New York is the first time ... that is wonderful and I love you for that is getting a WAMC mature going to package number one the shell of a a a\nYou know there is a hard hard to believe that she was incredibly hard to read [noise]\nThen or my ... okay ladies and gentlemen volunteers let's write a letter to watch our hand", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Albany", "day": "17"}