{"month": "10", "state": "NY", "station": "WAMC", "content": "You're listening to the b._b._c. World Service ten years after the financial crash\nIndians millions of people harder than they've ever done before for the sale for less pay fictional that\nPrevent a ... and you can think of the global financial crisis with limited room to increase revenues over the office of government was wrenching costume expenditures after the crash at the beach the worst habits don't come\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you an HD Ninety point three rounds in Utica W. A. M. cage de nine point nine Kingston W. O. S. R. H. D. Ninety One set in Middletown WC yell HD Ninety One nine Plattsburgh WC an HD Ninety three three kinda G Harry W. A. N. C. H. D. one oh three nights I kind of regret W. A. M. U. H. D. one oh\nFive one great Barrington W W E S H da da point nine now Kisco W. A. N. D. H. D. Ninety point one Stanford\nW a and R eighty eight five Brewster WAMC am fourteen hundred Albany\nWho\nKavanaugh says he joined the Supreme Court with no bitterness\nBut when President Trump took to the campaign trail he black a Democrat\nFor going after examining It's MORNING EDITION from NPR\nAlso reports of a major data breach Google why didn't the company's how users his privacy was at risk I'm Noel King\nAnd I'm David Greene will spend time in Europe is our looking at why China invested heavily in a port in Greece and whether workers there or being in\nJournalism becoming more dangerous than you are the latest death vulgarity in journalism found rape and murder also a child homelessness rises will meet an eighth grader in Idaho who live in reality It's Tuesday after overnight Britain's former prime minister\nDavid Cameron turn fifty three years old\n\nLive from NPR News in Washington I'm Dave ...\nFlorida's governor is calling hurricane Michael monstrous what forecasters warning it could become a major storm before making landfall along the Gulf Coast sometime tomorrow more than thirty Florida counties are under a state of emergency from Tampa Bay to the panhandle coastal evacuations are underway\nIn the Carolinas NPR's Tom Gjelten says residents are still working to recover from Hurricane Florence\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMuch or why the driver of a limousine in upstate New York failed to stop at a stop sign the stretch limo crashed into a parked SUV and just go Harry at a high rate of speed killing all Eighteen people in the vehicle and to pedestrians\nNew York's governor says the limo driver did not have the required commercial license and the vehicle had failed a recent inspection last night friends and family attended a vigil at a park in Amsterdam\nMy heart breaks and they think of all the lives that were never will be the same [noise]\nGives me hope to see is here with ... and so in a sense\nThat's local school superintendent Vicki Ramos one of the speakers at the vigil vice president Pence was in Texas yesterday campaigning for a couple of incumbent Republicans trying to keep their seats on Capitol Hill Stella Chavez with member station KNPR a reports from Dallas\nThe vice president's first stop what's for us representative Pete Sessions his facing a tough challenge from Democrat calling all red and civil rights attorney and former NFL linebacker\nTense praise sessions for his support of Trump Administration policy from Obamacare role backs to tax cuts the vice president also taught at the new trade agreement with Mexico and Canada and unemployment at a fifty are low\nAnd on Saturday weak and her [noise] justice Brett Kavanaugh [noise]\nAnd said re electing Pete Sessions and Senator Ted Cruz it's crucial to hanging onto a Republican majority in Congress for NPR News I'm Stella Chavez in Dallas\nThis is NPR News from Washington\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum that you're who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\nSupport for Stargate comes from western New England university Springfield, Massachusetts now accepting applications for its master of fine arts and creative writing winter residency information a W ... Fe\nAnd virtually the Asian enterprises offering charter flights for travelers customized wise to accommodate travel needs part of the books are timidity since Nineteen twenty information available at ... dot com [noise]\nGot a October night [noise]\nIts fame as a member of the voting hack Capricorn us is a bit tough to find it's the smallest member of the ...\nAnd one of the same test it forms a distinctive patterns though like the bottom of the candy bathing suit under a dark skies you can take it out the constellation represents a C a goat\nIn Greek mythology though it was associated with a God pan\nDuring a battle with the titans he had to jump into the Nile to escape when he did the bottom half of his body was transformed into a goat\nThe brightest star in Capricorn is is dead algae that tail of the vote it's a system of at least two stars and perhaps as many as for\nThe main star is about twice as big and heavy as the sun at about eight times brighter it's at the end of its normal lifetime so it's puffing up\nSome day it'll be much bigger and brighter than it is now the star has a close companion so close that that\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nInstruments to study it to more stars if you're close to this pair\nAll of the stars maybe bound to each other on the other hand the two outliers may simply line up in the same direction as Deb algae and art related to the seacoast most prominent star [noise]\nThis is a good time to look for a Capricorn us because there's no moon in the sky that bright orange planet Mars is passing through the consolation to there in the south at nightfall\nMore about Capricorn us tomorrow\nOur Web address it started out or work for the University of Texas at Austin McDonald Observatory\nSupport for starting to come from New York you'll museum McKenna Harry reasoning harvest feast October thirteenth to benefit the museum local beverages farm to table food prepared by ships consortium\nLoud music ticket information\nKlein hard ... Arts Center presenting to sharing springs poetry festival to operate in your twenties [noise]\nBetween Billy Collins Tracy key Smith and more [noise]\nDot org slash poetry and Jeff Miller contractors\nBolger was general contractor building in front of a hole in the brochures in southern Vermont\nTraditional craftsmanship and applaud building science more information uh jak Miller contractors\nIt's seven minutes pass fine [noise]\n\nThis is MORNING EDITION from NPR News I'm David Greene\nAnd I'm Noel King good morning at a ceremonial swearing in justice Brett Kavanaugh said that he will put the polarizing fight over his nomination behind him\nYou have a new justice was speaking publicly for the first time since the bruising nomination process and the Kavanaugh said she would not allow what took place to influence his decisions on the bench\nTo Senate confirmation process was contentious an emotional that processes over my focus now is to be the best justice I can be a take this office with gratitude no bitterness\nPresident Trump on the other hand took a somewhat different tone he slammed the Democrats for trying to destroy his nominee NPR's White House correspondent Tamara Keith is with us now the morning Tam good morning so what is Trump telling Republican voters\nHe is telling them that Democrats are the enemy ah and and that you know he is really playing up rather than celebrating the victory with the Kavanaugh nomination he's playing up the fight\nUh and and trying to continue to to joke that the anger that rose up I'm as a result of of how that process when\nWell we are one month out from the mid term elections as you well know are all about enthusiasm so what is the outlook for each party in the midterms now that the Kavanaugh fighting over\nSupport for WAMC comes from Albany ... presenting book lists featuring acronym baroque string ensemble and the boy corridors of the cathedral of all saints October twenty first with the choice savings bank musical Albany pro music could not org\nDr Lucy ... late from New York practicing a set of plastic surgery working to help people improve their appearance and well being offered cool sculpting treatment and more CAP ... plastic surgery dot com\nEmpire report a political news aggregation site providing coverage of politics media and culture throughout New York state and why empire report dot com\nAnd Bennington museum president crashed creativity the new deal and Vermont creating\nCreativity innovation artists writers and civil workers Nineteen thirty three to Nineteen forty three Bennington museum dot ORG [noise]\nMorning thanks for joining us for MORNING EDITION for this Tuesday to overnight I'm David Stevens [noise]\nFor engineer my phone [noise]\nOur producer is Elizabeth hill [noise]\nChecking some of the weather conditions around the region at this hour [noise]\nLamented Connecticut fault sixty one degrees in merit and clear sixty two [noise]\nAt last report mostly cloudy skies now fifty six at Newport, Vermont\nIn Mooresville clouds fifty four degrees [noise]\nSaudi now fifty eight in Montpelier [noise]\nWorcester, Massachusetts fog fifty seven this morning [noise]\nCloudy fifty eight Westfield\nSixty degrees [noise] sixty with falling out in Boston [noise]\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nFortune act like [noise] Monticello fog sixty Central Park in New York City clown sixty six degrees\nThan Albany partly cloudy sixty three\nYard comes from that station and from Heather started hey gun poll Ga Ga supporting African wildlife foundation working to ensure wildlife and wild lands thrive in modern Africa learn more at age W. F. dot org\nFrom the arc has foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about Arkansas and its partners at Aarhus foundation dot org [noise]\nFrom the John D and Catherine T MacArthur Foundation recognizing\nExceptionally creative individuals' this year's MacArthur fellows and more information or at max found dot org and from the Robert Wood Johnson Foundation at our W. J. F. dot org\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene China has poured billions into making basically a Silk Road of the sea running dozens of ports and container terminals around the world\nIt's a way to move Chinese exports to important markets including the European Union and in Europe it all began in the Greek port of Piraeus the Chinese shipping giant Cosco has spent millions transforming it into the fastest growing port\nIn the world but as Joanna Kakissis reports from previous this has come at a price [noise]\nIs as iconic struggling because of the crop up its were lawyers set out for each of the battle and more Hollywood dog for the Nineteen sixty film never on Sunday\nWas accurate\nSmelly no matter what he's saying that there is no port she loved as much as harass ... remind me that a little now may he a knee or so ugly\nRetired Steve adult and you're listening to the theater and his wife Maria the song by heart he worked at the port of praise for thirty five years\nWho were young if you are able to but that was going to be there with these visitors and icy but that is this is my father when I thought the reporter who didn't have many machine pillows cargo into the ship them we just didn't with our own hands or do we do to bags of groceries I have a good ... where all made in Greece old violence for North American straight\nHe says pray us took care of its stock workers he made good money and now has a good pension [noise] he flips a string of worry he says he reminisced says in his living room underwater color painting of a ship\n... human ah you have to ... many heroes using them I was looking out across from the Suzie get deep enough of big ships have everything to be successful\nBut for years when the Greek state owned the port bureaucratic red tape made it hard to attract investment then came the debt crisis which began in twenty pen ravaged the Greek economy the he pushed Greece to privatize support for a U.S only the Chinese showed serious interest [noise]\nChinese shipping giant Costco took over the four twenty sixteen it now owns them\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOr go terminals cruise ship peers and the largest passenger ferry Wharf in Europe and the Chinese are not stopping there\nWe want to expand the car terminals they want to expand or they want to create the logistics center they want to build a new ah cruise terminal\nCan be done by let us advisors to the Greek shipping ministry he's aware of the Chinese lease on the port will run out and about thirty five years\nIf at some point in the future they want to abandon it as we will have all these investments they will not take them with with them okay they will leave them here\nYou see it as entirely a win win win win those are the words of captain food Chung she'll costs goes CEO and parade as heard here in twenty Fifteen easily ...\nTo Greece and of course ... one of the port union leaders I ... as another interpretation\nWhen the Chinese said when when they they mean they win by she says the benefits mainly go\nTo China the founder if they if they're if they found them know how their way to\nOrganize and doing business they can't do the same in Europe\nYou can actually hear the Chinese expansion half the cargo terminal which are busy twenty four hours a day straddle carriers lived giant metal containers of goods onto shift workers in bright yellow safety vests everywhere these are coveted jobs in a country where the unemployment rate is twenty percent\nBut most of the Seventeen hundred workers at the port are temps without labor why [laughter]\n\n... years ago hundreds protested and federal police over hostile takeover and their working conditions\nThirty year old Steven ... recalled how he and his colleague work\nLong hours and unsafe condition for less\nPay for the government\nAnd other ... ...\nWorkers were too scared to speak on it and they kept their heads down working straight shifts with outbreaks even to go to the bathroom\nSome of my co workers had to relieve themselves in plastic bottles now he says at least they can take twenty minute break during chefs\nOnly about two hundred and fifty workers are in the Greek dock workers' union run by your was ...\nHe cannot stomach the new reality for most workers at the port and blames Costco\nThey won't silent obedient cheap workers with no unions and this means no right what's the future we didn't win the future\nWe should've taken from her father's bust who should have been ... to ... go to the future workers\nCosts goes pray a CEO food Chung chill and his deputy declined NPR's interview request a Costco spokes been set up an email that after quote along and productive negotiations a labor agreement was signed that benefits both sides\nThe European Union's been largely silent on the labor concerns but ... says secretary of ports\nSays he has heard from you officials were suddenly worried that China's running a European port decision\nMe do you ... you know\nAll aware that the Chinese state is behind a company like Costco you that push stuffed a seller\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu he says the e you underestimated China [noise]\n[noise]\nAnd now the Chinese flag is race for re it's too late for regret for NPR News I'm Joanna Kakissis in her way and we [noise]\n\nAs we said press was just the beginning China has snapped up about a tenth of Europe port capacity in just the last decade I'm going to hear about that later this week [noise]\n\n\nThis is NPR News\nSupport for WAMC comes from ... certified financial planner accredited investment fiduciary in the ... securities you commonwealth financial network member of ... ... financial dot com\nOf freshmen in my hair\nThen I hurry and rushed downstairs\nDreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nBrother and his grandma Pam can't travel she says they moved here after getting an eviction notice\nThe landlord decided to sell the property and we just could not\nFind a place that we could afford\nThe more depressed I got I just I didn't know what to do\n... small disability type and can the government but the nowhere near enough to cover rent and boy the controls grateful for the shell therapist says it's hard on her grandson\nMy youngest one have to be a little terror because he's upset but you know he gets angry men [noise]\nHe'll sit in a corner [noise]\nYou know to say I hate this place hate this place\nIs typical for caving to but you wouldn't know it\nCame as a social fourteen year old is a big smile one of his favorite things about school it's seeing his friend\nMy friend know about it and me being homeless and they don't teach me on it I'm trying to work hard and it's just an effort to try not to break down\nIt's harder for students who are anxious and worried to concentrate homeless kids tend to score and lower on standardized tests and have more graduation rate [noise]\nAnd sometimes king does break down with a friend [noise]\n[noise]\nAnd they find themselves cadence doing okay\nKid and carried to tray of food to a table with his friends\nHis dad is out of the picture of his mom had the drug problem before his grandma stepped in he had to help take care of his little brother\nHope ... ready for school [laughter] the one my watch so for days it was one time when we only had cereal for like two weeks\nHe has been trying to convince his grandmother that she should let them get a job so he can help with Brent\n... so I Want to do [noise] you know how well they can't travel won't have it you need to be a child as long as possible and you don't want to be in a big hurry to grow up honey\nA few weeks later there's good news and cadence world they got a house it's about seven hundred square feet that they share with a roommate for Kate and it's a huge improvement\nI feel much more comfortable and safe\nAnd probably most importantly he can say something he hasn't been able to for quite some time this is home for NPR News I'm Amanda ... teacher in Boise\nThat story came to us from the the mountain west news bureau and later today on all things considered in rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name\nThis is NPR News do miss the evening with singer songwriter ... Smith who onstage will combine readings and images from his newly released\nBook the habit of noticing with inspired songs from his Fifteen albums ranging from two thousand Seventeen everything back to native soil to first release in Nineteen eighty six that's ... Smith on Wednesday October attempts at eight PM capital into WAMC performing\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nSupport for WAMC confirm open door bookstores Schenectady New York William Kennedy with editors ... Rondo and Suzanne late signing bootlegger of the soul the literary legacy of William Kennedy October thirteenth one to two thirty PM open door gosh bookstore dot com\nPalo Alto service at the ... look at it by the end of the flying pig worker owned and operated service repairing foreign cars since Nineteen Seventy two Bella model Don ...\nCharm bio mass woods to warmth and homes and businesses throughout the northeast today's self stoking automatic would automated would he would boilers dot com Troy savings bank musical\nAnnouncing country singer caffeine material for forming classics such as Eighteen wheels and a dozen roses where have you been in more Thursday October Eighteenth at seven thirty PM Troy musical dot org\nThe chase and companies employee owned for providing engineering land surveying planning environmental health and safety and landscape architectural services for Seventy years\nJason companies dot com and the black sheep downtown Amherst New York style delicatessen European style butterscotch bakery catering cafe offering fair trade coffee\nBlack sheep deli dot com news channel Thirteen meteorologist Paul condos WAMC regional forecasts calling for cloudy skies to start with areas of fog and drizzle in the early morning hours today than\nTurning partly sunny warmer and more humid by this afternoon I should reach the upper seventies and you're eighty support comes from ... village and gentle temper on Thursday October eleventh friday night is showing Rhone Saturday was Jenna Nichols open Mike every Wednesday the agreement barn dot com\nAnd Hudson Valley bench fast food festival for progressive showcasing the plant based world vegan food compassionate cooking speakers demos clothing ethical eating more limber third and fourth ... H ve image fest dot org\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's working food health power jobs and resilience cities at rock sound dot org\nFrom the doors do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King\nThirty years ago researchers from the New England aquarium started studying North Atlantic right whales off the coast of eastern Maine large parts of the whale showed up like clockwork in late summer now those endangered whales come to that area only sporadically and more and more they're being seen far to the north\nMurray Carpenter went out on a research vessel to learn more\n[noise] it's just after dawn and Amy Goldman surveying the waters of the bay of Fundy just off of eastern most main\nShe's a scientist with the New England aquariums Anderson Cabot Center for ocean life he points out harbor porpoises chasing fish near the boat and then something much larger appears in the windswept water\nBehind us [noise] probably a ... in federal\nTurns out to be too hard facts one spouse near the vote [noise]\nIt's a cool citing and these are not the way she is after\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nColleagues have been studying here since Nineteen eighty they're largely lean whales with big heads and no dorsal fin researchers used to count as many as two hundred forging here in the summer but they became scares starting in two thousand ten and their range shifted\nDramatically many more of the whales are now is a marine hundreds of miles north in the Gulf of St Lawrence Mariano had bloom one of\n... research assistants survey that area in August and said it was nothing like the bay of Fundy\nHad days where we were being about individual working I'm ... [noise] right well popping out ... than rice\nWanting to see\nBut in total fewer than four hundred and fifty North Atlantic right wells remain and their numbers have been falling for a decade as more urban entangled and fishing gear or killed by ships reproduction is also declined researchers found no new\nCabs last winter with the population on edge scientists want to understand the reasons for the new migration pattern Nick record is with the big load laboratory for ocean sciences in east ... Maine\nMy hypothesis is that this change in the migration patterns of Wales is connected to their food resource mainly ... countless is like the battery of the Gulf of Maine\nColumnist is a type of fat rich plankton that's favored by many species record says a changing climate is not only rapidly warming the region's waters it's also shifting the currents that one swept this important plankton into the deep basins were right whales feed making it less available to them\nMore of a brown another scientist with the New England aquarium team so she actually find hope in the habitat shift all the way from the waters near Maine to the Gulf of St Lawrence\nIt's not like it's right next door will have to swim all the way around Nova Scotia so what a tremendous response you know this is a highly endangered whales there's not many of them left and yet they're demonstrating that they can respond to major changes in their habitat and that's actually quite encouraging\nBut she says it's definitely slim pickings in the waters near Maine\nIt's not that this area's abandoned the cheese are count for this year it's less than doesn't lands\nBack at the dock the crew in their thirty mile survey the last of the season with no right well sightings but any known says its worst sticking with the research\nWe're not a whole new era right now with climate change with habitat shifts it's important with us long term study to sort of maintain some of the basic efforts that we've had so that we can better understand what's happening for the well\nAn impact celebrating ten years of experimental mediate performing arts with an anniversary weekend October eleventh two Thirteen between performances by promotion quartet sang\nThe international contemporary on some\nStudied it six o'clock [noise]\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety points reruns in Utica W. M. K. HD nine point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown UCLA HD Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine hike on robots\nWAMC which do you want to five one great Barrington W W E S H deity point nine mount Kisco W ... point one Stanford WN are eighty eight point by Brewster WAMC am fourteen hundred Albany\nGood morning less than a month for the midterm elections Democrats and Republicans have at least one thing in common they want to get their voters energized and help to the polls in November\nComing up on MORNING EDITION from NPR News [noise]\nWhat a democratic strategist whether his party can gain it's enthusiasm advantage back after the appointment of justice Brett Kavanaugh of David\nGrann and I'm Noel King also this hour the curious case of my home away he was the president of Interpol the international law enforcement agency now he's the team in China and being investigated for a variety of crime and in Alaska ballot initiative that wants\nHits fishermen against the oil and mining into\nIt if they have to operate now\nFilmmaker Guillermo del Toro fifty for today and the news is next\nLine from NPR News in Washington I'm core of a Coleman the newest justice of the U.S Supreme Court will be on the bench this morning when the court hears oral arguments NPR's Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in for Brett Kavanaugh at the White House\n... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd he promised to serve in a non partisan fashion I was not appointed to serve one party or one interests\nBut to serve one nation while Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a campaign against Kavanaugh he called dishonest and deceptive the president thinks seat in the new justice will give a political booster Republicans in the mid term elections Scott Horsley NPR News Washington\nThe national Hurricane Center says that hurricane Michael is moving north in the Gulf of Mexico and aiming for the Florida coast forecaster John ... says Michael's top sustained winds are Ninety miles per hour\nIt's gonna be likely to make landfall in the Florida Panhandle of Florida Big Bend area during the day Wednesday that is our current thinking um and it's likely to make landfall as a major hurricane so that's category three or stronger or on the scale\nHurricane Michael is projected to them blown north across Florida and into Georgia and the Carolinas tropical storm watches are posted from the Florida Gulf Coast north to South Carolina\nThe international Monetary Fund is cutting its forecast for global growth NPR's John Snyder reports the IMF blames rising interest rates and trade tensions\nThe IMF has revised its forecasts from July when it said the global economy would grow three point nine percent this year it's now cut that down a couple of nachos downgrading expectations for this year and for twenty ninth team the IMF now says the global economy will grow at a three point seven percent clip\nThe IMF left us economic growth on change for the rest of this year but cut the U. S. is twenty Nineteen forecast a two and a half percent because of the trade tensions with China\nThe revisions to the global forecasts was issued on the resort island of Bali as annual meetings of the IMF and World Bank get underway this week\nTrial Snyder NPR News Washington\nThe south Korean government said North Korean leader Kim Jong un wants Pope Francis to visit North Korea\nAnd South Korean presidential office released a statement saying Kim told diplomats at the pope would be enthusiastically welcomed in North Korea the president of South Korea is expected to deliver that formal invitation to the contests during his scheduled visit in Rome next week\nNorth Korea strictly controls religious expression in that country Kim has seemed to welcome diplomatic engagement that we're meeting with South Korean officials and President Trump this is NPR\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts support\nNews comes from Landis arboretum hosting their annual Halloween how how senator Tobar twenty of more information on this other school Harry county events at upstate vacations dot com scary county\nI Love New York in ... Jim rule working to preserve and maintain the traditions of Italian cuisine and hospitality since Nineteen eighty two on ... street in Albany New York ... Riccio dot com\nMorning six so for this has WAMC regional News I'm David ... in the headlines\nAs the investigation continues into Saturday's deadly limousine crashes gr Harry county that killed twenty people governor Andrew Cuomo says they cease and desist order has been issued by the state to stop the limo company prestige from conducting business until the investigation completed being reporters in New York City yesterday the governor said the draw\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot EDU\nIn my opinion\nSo of all the way [noise]\nUh sometimes we have the last\nGovernor Andrew Cuomo meanwhile a city came together last night to grieve its own WAMC deep Lucas was in Amsterdam for a candlelight vigil a memorial service honoring the twenty who died in the sky Harry limousine crash\nMan has\nSeen\nA crowd filled the walkway of the mohawk valley gateway overlook bridge they heard words the scripture and remarks drew speakers like Amsterdam native Congressman Paul tonko\nFamily members [noise] know your loved ones\nI loved by their community we are crushed with you\nWe're crushed for you\nThere was prayer than a moment of silence with innumerable candles raised relatives of the dead shed tears family and friends lined up to sign in Amsterdam strong memorial banner in a city stunned by a senseless tragedy David Lucas WAMC news\nThere is a new pavilion to commemorate the lives of five from a teenager who killed in the wrong way crash on interstate eighty nine two years ago the Burlington free press reports that the billion and waits feel mad river park was dedicated\nLast week [noise]\nMassachusetts voters will get their first chance to size up Republican governor Charlie Baker and his Democratic challenger Jay Gonzales onstage together as a square off for their first debate before next month's election the one hour debate is good for\nEight pm tonight at the w._b. Z TV studios in Boston bigger is seeking his second for your term and begin hill\nIs channel Thirteen ... WAMC regional forecast cloudy areas of fog and drizzle\nAnd the early morning hours today but then partly sunny warmer and more humid\nBy this afternoon I should reach the upper seventies eighties [noise]\nSports news at six Ninety [noise]\n\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California Republican and democratic leaders have one thing in common right now both are hoping\nThat the bitter battle over Supreme Court justice Brett Kavanaugh will motivate the base and Dr voters to the polls for the midterm elections\nRepublican Senate majority leader Mitch McConnell described it as a quote shot of adrenalin that the geo Pete got from the confirmation battle is polls do show that the Republican Party is closing in on Democrats enthusiasm advantage this is McConnell over the weekend on CBS face the nation\nI Want to thank the other side for the tactics that have allowed us to got to energize and get involved I own a voters\nLet's talk about what the Democratic Party might be able to do to try and regain steam I'm joined by rubbing mock he was the campaign manager for Hillary Clinton's campaign in twenty sixteen welcome back to the\nProgram thanks so much so McConnell\nSeems appreciative for how Democrats handled the confirmation battle over over Cavanaugh I mean do you worry that the Democrats have given away the edge that they had heading into November\n[noise] I don't think that the edges been given away at all I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a bomb to try to close that gap\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOld that NPR showed that Republicans went a long way in closing that energy gap I mean it it it sounds like Democrats might have some work to do to to sort of wide and that gap again what what what is the plan\nSunday October twenty first at four Woodstock play house dot org and from Saratoga hospital and affiliates of Albany mad Saratoga hospital with more than twenty locations across the greater Saratoga region\nPeople you trust carry you deserve\nSaratoga hospital dot org it's six Nineteen this is a WAMC sports report on ...\nBrock Holt made major league playoff history well helping the Boston Red Sox blow out the Yankees to take it to one lead in the American league division series the red Sox infield there became the first player to hit for its cycle in a post season game\nGoing forward for sex with five R B eyes and three runs scored in a sixteen one thrashing in the Bronx\nThe red Sox will try to wrap up the series tonight at eight oh seven the Astros\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOver the last three innings and an eleven three victory in Cleveland\nHouston now awaits the winner of the red Sox Yankees series meanwhile Los Angeles has knocked out Atlanta in a four game National League division series as the Dodgers down to the Braves six to the Dodgers will take on the Braves in game one of the national league championship series friday\nAnd on the ice the sabers doubled up the Golden Knights for to the island or shut out San jose Ford zero and three players have been signed by the NBA for on on court shoving match during the Celtics preseason game against the Cavaliers on Saturday\nCeltics guard market smart was fined twenty five thousand dollars for escalating the altercation and cabs guard JR Smith Fifteen thousand for shutting Boston forward Aaron Bain's was assessed Fifteen thousand for initiating it for more sports scores and stories visit WAMC dot org\nSupport for NPR\nComes from the station and from Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more learn more and H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encouraged courage\nFrom Harvard Business school executive education for executives said any career stage to prepare for new challenges through one of its comprehensive leadership programs learned more at H. B. S. dot any flash executive\nAnd from at last seeing a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work\nBetter together more at at ... dot com\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King until recently the head of Interpol the international police organization based in France\nWas a man named among Hong way he's from China but in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol I talked to NPR's Shanghai correspondent Rob Schmitz and asked him what do we know about my whole ...\nSixty four years old he served as the vice minister of public security bureau which is China's national police ah in twenty sixteen he became the first Chinese head of Interpol and his lecture and was a big victory for China's government which under\nLeader Xi Jinping was eager to use Interpol to locate in extradite Chinese officials at it deemed corrupt to it at scape China\nBut as it turns out among himself is under investigation by Chinese authorities for corruption\nWhat exactly are they investigating him for\n[noise] which has government hasn't released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how his attention unfolded has come from his wife grace among on September twenty fifth\nThe day her husband arrive to China for a visit she allegedly received a text from him that said wait for my call which was followed by in a mood even knife suggesting that she was in danger\nA week later she reported missing to French police on Sunday she spoke to reporters and we own friends were in trouble is headquartered in here's what she said\nWe had to go in and you want to have the half of my time and when my children and all of these little my motherland all the wives\nAnd children husbands and fathers so they may no longer disappear\nAnd as you can hear in that tape now while she's crying during this part of the video with her back\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu well when she\nTalks there about the husbands and fathers who've disappeared in China what does she mean\nWell she's talking about the government anti corruption campaign was launched by Xi Jinping immediately after he took office in twenty Thirteen and snare hundreds of thousands of officials both on the local level as well as among the highest echelons of the party\nIn fact the man who appointed Malone way to vice minister of public security was Julia ... conga highest ranking Chinese official who was brought down by this campaign Joe was a former member of the pull up your standing committee the group of seven men who rules China he was China's security czar before he was sent to prison for life and twenty Fifteen\nRob by removing month from the presidency of Interpol China loses a lot of sway within that organization that much is clear what does this mean for Interpol\nWell even before this happened China's use of Interpol under amongst presidents he was starting to raise some red flags earlier this year China attempted to issue a red notice that it's an international alert for wanted person\nFor an exile weaker activists readers are mostly Muslim ethnic minority who live in northwestern China China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with among is a good example of how China as messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob banks do\n\nAcross the United states more criminal courts are turning to video proceedings says in an effort to save time and money that that happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology\nFrom Illinois newsroom in Urbana league games reports\nToday like most days thousands of defendants will show up in criminal court for their first appearance in front of a judge it's likely that more than half of those appearances will not be in a courtroom in person the defendant will instead to face a video camera from inside a jail\nSheriff Jeff standard likes that system he's in Lewis ten in rural west central Illinois he demonstrates what his deputies used to have to do\nThey would have shackles on so their stuff we're going to be half of war or taking and their belts are going to be chained together so you're walking on the line it's kinda like a three legged race\nStandard says the video system they now use freeze up more his officers for patrol and he argued that the convenience of the system is better for everyone\nNow we can take 'em right in the back and put 'em in from the video camera the judge has access to the video camera\nConversation just like we are now but it's just over a video screen\nBut Charles Davis and says it's just not the same David than in sixty eight years old and a recovering heroin user who was in and out of jails and prisons in Illinois for over two decades he finds that video process both off putting and demeaning\nWhen I first went to the video of course it just blew 'em up because of uh watching everybody get up and go in front of the screen and it's either yes or no or you know you couldn't say anything\nDavidson says when you're in the same room at the judge it's easier to have a conversation with them and he's noticed there's a greater chance to listen to what you have to say he says the first time he appeared in video court he didn't think he got it\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu and they told me to be quite\nSoon after Davidson was sentenced to Eighteen months in prison [noise]\nLayer Rosalie joy says she hearing stories like David send all the time she's with the national legal aid and defender association and says the increasing use of video court has some defense attorneys concerned that it alienates the acute from those deciding their fate\nEven before the proceedings began you already feel like you're treated as though you're guilty you are feeling a little bit from the process you are treated at\nThe least important part of the process because there is nothing that can replace human interaction and as a defense attorney I Am never going to be as effective in the courtroom from my client unless my client stand shoulder to shoulder to me\nWell there's little research on video court what's out there showed it may increase Dale amounts and in many cases makes private communication between attorneys and clients more public\nOn the prosecution side many defend video court for its cost saving and efficiency while acknowledging that some of those advocating for the accused say it's a trade off that's unfair to defendants\nFor NPR News I'm Lee gains in Urbana, Illinois [noise]\n\nThis is NPR News support comes from ferrets coin when Ninety nine will roads in Nineteen thirty in Albany New York a credit ... just buying and selling we're coin paper money tokens and precious metals estate invented jewelry now on display there was going dot com\nThere's some fish Silver's\nChallenges in there to\nWin a small scale commercials than and fishermen and the consummate Alaska today he's supporting a candle jacket and a gun on his back in case we run into a moose ... vote to have a look [noise]\nWas also helping leaves the stand for salmon campaign for a ballot measure aimed at protecting the state's most iconic fish walking along the creek with says he thinks it's a long overdue change\nFish scale is friendship too far in favor of of development and industry and and we're just trying to pull it back towards the center\nAlaska as some of the most valuable salmon fisheries left in the world but wouldn't other ballot supporters say the state's laws protecting salmon are weak putting them at risk especially with a number of large new mines in oil developments in the works\nIf it passes Alaska with an act a much tougher permitting process for big projects in salmon habitat among other things it was such strict standards for restoring salmon streams if they're disturbed\nAnd the companies don't follow the rules they could face criminal penalties would acknowledge is that in a state like Alaska it's a big ask\nWhen you start doing something like this\nIs really kind of\nSome in your nose at the big guys you know for decades Alaska's economy\nHas depended on industry dollars and oil and mining companies hate this initiative banded together under the name stand for Alaska they're backing a campaign to stop it running a blitz of that like this wire\nIt claimed to protect their habitat when it actually improved as burdensome new regulations that flu or stop Alaska project\nCompanies have poured millions into the campaign against the ballot measure with help from donors like BP and Exxon Mobil they've not raised more money than all free of Alaska's gubernatorial candidates combined\nTurned Matthias as with the council of Alaska producers the group that represents mining companies and she argues the state's salmon fisheries have so far co existed with minds that oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem just seems\nCrazy the funniest thing the initiative prioritizes standing at the expense of the state's biggest economic engines and taxpayers\nWe couldn't have the Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans similar more than just living or the occasional meal here they represent something deeper their vital food source and a traditional way of life in one of the last states were wild river's still team with them every summer\nSo when voters head to the polls this November there'll be weighing that against fears that I met her to protect him and could read all the states' economic foundation\nFor NPR News I'm Elizabeth ... in Anchorage [noise]\n\nThat report came to us from Alaska's energy desk it's a public media collaboration focused on energy\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nThis\nIs NPR News yelling WAMC postcards from the road to travel around the globe\nHow scary it is a guide to the well hidden one does\nMy treatment plan was to go to the Appalachian Trail trying to be investigated reporters and writing touchy item in late in countries where there are no longer in a way to get documents comment you write about the subject\nThey're looking for a ... or who is very artfully footing the bill to death every Tuesday at WAMC pod cast dot org\nSupport for WAMC comes from gateway he'll towns when for Chester Huntington middle field Montgomery and Russell six historic villages nestled in the foothills of the Berkshires hiking kayaking fishing and country living for more information gateway he'll towns NATO or\nGetting wealth management group Saratoga Springs New York and independent financial advisors services from offering portfolio wealth management institutional wealth management and financial planning king wealth management group dot com [noise]\nBeing communications helping clients manage public and reputational challenges for Thirty years corporate communications crisis communications in relations being communications dot com [noise]\nAnd back celebrating ten years of experimental media and performing arts within an inverse re weekend October eleventh through Thirteen between performance art performances by for most of the quartet loosening the international contemporary ensemble and more impact ... you\nKnow I'm cake Stockbridge, Massachusetts Saddam cake pumpkin trailer pumping please walk through the garden speech woodland creatures along the way Fridays and Saturdays through October Thirteen [noise]\nThe spot five on a weekly arts entertainment and cultural publication for the capital region online newsstand and Venus this month when a dot com [noise]\nThe ... Center for the capital region honoring algae be teach you community leaders of the twenty teens pride central gala friday October Nineteen to Albany capitals center capital broad center dot org [noise]\nNews channel Thirteen meteorologist volcanoes WAMC regional forecast holding for cloudy skies series of fog and drizzle this morning but then partly sunny warmer and more humid by the afternoon high should reach the upper seventies shouldn't you're eighty [noise]\nSupport comes from Sunni noodles and inclusive community they're prepared students to be global citizen study abroad programs in one hundred twenty countries hundreds of international students and faculty on campus Newport's dot edu slash\nStudied abroad [noise] Fifteen minutes before seven\nSupport for NPR comes from the states and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from PBS with the circus American Experience explores the rise and fall of the big top and its influence on entertainment and the U.S the circus that tonight event continue tonight at nine eastern on PBS\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene today we are closing the circle on the story of a loved Stradivarius\nBelong to the virtuoso violinist Roman Totenberg just a few years after Totenberg death at age one hundred\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu covered by the FBI\nTotenberg daughter Nina Totenberg broke that story and today she brings us what musicians call the coda the concluding part of the\nPiece as I recall three years ago my father played that violin to awaken the hard somebody [noise]\nMan\nAnd to dazzle [noise]\n\nAnd when the violin was recovered we three Totenberg sisters were intent on just one thing that the instrument now known as the Totenberg aimed strategy would be played in concert halls everywhere not closeted away and some collectors fault\nEnsuring that was not as easy as you might imagine the violin was an excellent shape but because it had not been professionally maintain for thirty five years it had to be restored a task performed over to painstaking years by craftsmen at rare violins of New York\nStill finding a buyer who met our specifications was not so simple we could sell it for ... years in Asia but likely never hear it again\nAnd then the co owners of rare violins ... and Bruno price were approached by an angel a person whose identity we still don't know and likely never will see even Bruno refer to him only at our friend he was willing to buy the violin but not for himself\nHe challenged us to help young musicians have access to great instruments the arise e Nicole ... gone up so high over the last Thirty years [noise] musicians have no longer\nHave the ability to access great insurance let alone all day\nAnd so it was even Bruno have found is something called rare violence in consortium away for a wealthy patrons of the yard to acquire string instruments and then lend them after promising young musicians for years at a time\nMy father's violin we'll go first to Eighteen year old Nathan melts or who already have enough of a career to pay the considerable insurance and maintenance costs\nMelts or a strapping six foot or who can manage this relatively large strategy has been practicing on the violin for about six weeks now\n\n\nI don't know how to explain how credits owns it has an amazing amount of power to it in all registers at the same time there's the sweetness and it never gets brittle and never gets shrill\nToday is the last day that the ... will be in any sense the property of the Totenberg family we hope we've been good custodians in my father's name and Antonio Stradivarius as well\nBut most of all custodians for audiences who will hear Nathan melts er and others make that violence sing long after we're gone my father I'm sure would want me to end today not with him playing but Nathan melted into practice studio at Juilliard\nFor the southern Catskills comics and southern Berkshires as well as for the ... field hills\nClouds giving way to partly sunny skies today with highs and the upper seventies partly cloudy tonight lows in the mid sixty ... for the greater capital district including Albany Schenectady and Troy as well as for the Saratoga area east into southern Vermont and the Berkshires north divine Ninety\nClouds giving way to partly sunny skies today breezy in the upper Seventy two around eighty partly cloudy tonight lows in the upper sixties\nRegion wide for tomorrow I mix of southern clouds warm and humid lower eighties rain on Thursday perhaps heavy at times with a thunderstorm lower seventies\nI mix of sun clouds breezy much cooler friday near sixty mostly sunny lower fifties on Saturday mostly cloudy with a chance of showers Sunday mid to upper fifties and the chance of showers back into the lower sixties Monday\nFor WAMC I'm news channel Thirteen meteorologist Paul ...\nSupport comes from ... or ... programs for girls would focus on leadership opportunities personalized learning Emma Willard dot org and not see go two thousand glimmer glass film days the member a through twelfth in Cooperstown curated slate of thirty one films the makers talks parties art in hikes [noise]\nLet me last film day's done or seven o'clock\nIs Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety three ramps and you could WHM cage the Ninety point nine Kingston W. O. R. H. D. Ninety One\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nNHCD Ninety three three Kennedy Harry W. A. N. C. H. D. one oh three nights hike on the road got W. am cue HD one o five one great Barrington W W E S H da da na ... go W. A. N. D. H. D. Ninety point one Stanford W a and R eighty five Brewster and WAMC am fourteen hundred Albany\nFrom NPR News in Washington encore of a cool when President Trump has apologized to the Supreme Court justice Brett Kavanaugh for the quote suffering he experienced during his confirmation process\nEmily Sullivan says the apology came at a swear rather ceremonial swearing in on Monday at the White House\nKavanaugh was confirmed by the Senate on Saturday receiving fifty votes after an emotional confirmation process centered on allegations of sexual assault he has denied all accusations President Trump started Monday ceremony with an apology\nOn behalf of our nation I Want to apologize to Brett and the entire family for the terrible pain and suffering you have been forced to endure\nBefore making his comments the president acknowledged they were out of the norm in his speech at the ceremony Kevin I said the confirmation process tested him but it did not change his approach to judging Emily Sullivan NPR News Washington\nThe national Hurricane Center says hurricane Michael is a little more than four hundred miles south of the Florida Panhandle\nTop sustained Windsor Ninety miles per hour but forecasters warned that storm will get much stronger before it crashes into the Gulf Coast Becca Amy manages the sense that I only got an RV club in Florida as Big Bend region\nIf she can go you probably should go and if you can't you just like the best preparations you can set for hunted down and hang in there knowing that that ah emergency management won't be able to help you at some point\nAlthough hurricane Michael will lose strength when it hits Florida it's predicted to barrel across Georgia the Carolinas as a tropical storm before crossing into the Atlantic ocean\nThe state of Delaware plan to take public comments this week on the Trump administration's replacement for the Obama era clean Power Plan NPR's Jeff Brady reports in Delaware officials are frustrated the EPA is not holding public hearings on the east coast\nThe clean Power Plan named to reduce carbon dioxide from power plants to address climate change it was a blow to the ailing coal industry President Trump CPA is replacing it with a new rule that give states more authority to regulate emissions\nThe EPA he'll just one public hearing earlier this month in Chicago Delaware natural resources and environmental control secretary Shaun ... says residents of his coastal state deserved to make their voices heard too\nWe are the ones that are feeling the impact now will continue to feel founded act in the future if we do not take steps to mitigate climate change\nDelaware plans to transcribe comments from its public beating and forward them to the EPA for the official record Jeff Brady NPR News\nThe online company Google is shutting down its social network for consumers Google Plus that comes after the company discovered a flaw that could have exposed some personal information of half a million people the wall Street Journal published a report that said Google discovered this law in March this is NPR\nSupport for NPR comes from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive at e verify dot Gov slash go and the ... foundation at ... dot org\nSupport for WAMC comes from Albany med now open the mastery family chilled\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC\nDot edu C. dot edu it's\nTuesday Morning with us Mike Spain associate editor of the times union Mike tragic case twenty people dead after a limousine crashed into Harry New York killing all Eighteen passengers limousine and two people in the parking lot across the street from the intersection where the accidents occurred you have an update this morning\nThe state police criminal investigation is separate from the pro by the national Transportation Safety board which was already under way into that terrible tragedy in school Harry over the weekend\nState police ah records and um and the times union has a review some of those records shows that the driver of the limo did not have the proper license to drive a specially modified two thousand one Ford Excursion\nWhich was a vehicle which had failed multiple safety inspections one of those inspections that was failed was as recently as last month state police major Robert pet note identified the probe\nInto the crash has a criminal investigation sources close to the case of the agencies major crimes unit is examining whether there was negligence involved in that crash and that could result in criminal charges\nAlso on Monday state police and investigator from the national Transportation Safety board were at the scene at the intersection of route thirty and thirty a in school Harry doing more\nExaminations and that NTSB pro is expected to take perhaps as long as the year or some have even taken up to two years so we won't know the results of that for a long time while the criminal investigation presses ahead governor\nAndrew Cuomo said the state is going to court to get a cease and desist order to keep the business that owned the limousine prestige limousines there in ... for that to their addresses just outside ... springs in Wilton\nThe state wants to stop them from operating other limos until at least the studies sarin\nTroopers have seized all three of the firm's remaining limousines the owner of the company shop had Hussein is a reportedly in Dubai we we tried to reach him and were unsuccessful\nOn Monday afternoon his son ... Hussein who is operated the company met with state police investigators and he had his attorney leak inland of Albany there they declined to comment but they're cooperating and answering questions and and they'll have more interviews with the state police\nMight mean associate editor of the Albany Times Union joining us for more at Times Union dot com and there's more of our conversation and there's more of our conversation on line at WAMC dot ORG\nSupport comes from ... to ... springs in New York Julian diamond buyer purchasing silver jewelry collections Asian antiques Bible an eight by eight seven eighty seven eighty so\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC good morning President Trump celebrated the newest Supreme Court justice last night with every sitting member of the Supreme Court President Trump presided over a swearing in ceremony for Brett Kavanaugh at the White House\nAfter a bitter and divisive nomination Kavanaugh promised that the process had tested but not changed him and that he would always conduct himself fairly from the bench\nTake this office with gratitude no bitterness every American can be assured that I'll be\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu well justice under law\nBut not every Republican is celebrating the appointment of justice cabin on in fact our next guest says he is leaving the G O P because of it Tom Nichols is a professor of national security at the U.S Naval War college and he wrote about his decision in the Atlantic thanks for joining us professor Nichols\nThanks for having me you have belonged to the Republican Party for most of your life why did this confirmation process prompt you to lease\nIt wasn't the confirmation process itself a at it that was more of the final straw uh this had been coming for a while I had felt strange from the party even after the twenty twelve elections I was hoping for recovery\nUh in the wake of what I think will eventually be the ... the implosion of the Trump Administration but\nAh with the Kavanaugh confirmation it just seemed to me that there was no moderate center left at the Republican Party that\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nCapital region for over fifty years U H y dash US DOT com it's seven Nineteen this was a WAMC sports report on the lives about ...\nBrock ... made major league playoff history well helping the Boston Red Sox blow out the Yankees to take it to one lead in the American league division series the red Sox infielder became the first player to hit for a cycle in a post season game\nGoing for for sex with five R B eyes and three runs scored in a sixteen one thrashing in the Bronx the red Sox will try to wrap up the series tonight at eight oh seven\nThe Astros completed a three games sweep of the division series by scoring ten times over the last three innings and an eleven three victory in Cleveland\nHouston now awaits the winner of the red Sox Yankees series meanwhile Los Angeles has knocked out Atlanta in a four game national\nLeague division series as the Dodgers down to the Braves six to the Dodgers will take on the Braves in game one of the national league championship series friday\nAnd on the ice the sabers doubled up the Golden Knights for to the islanders shutout San jose for zero the Bruins defeated I was six three and the ducks edge the red wings three two\nAnd three players have been fined by the NBA for a non court shoving match during the Celtics preseason game against the Cavaliers last Saturday Celtics guard market smart was fined twenty five thousand dollars for escalating the altercation\nAnd cabs guard JR Smith Fifteen thousand dollars for shoving Boston forward air base with assessed Fifteen thousand for initiating the fight for more sports scores and stories visit WAMC dot org\nSupport for NPR comes from the station\nAnd from Bible a language apps that teaches real life conversations in a new language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at that'll be a B. B. E. L. dot com\nFrom Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information it builds on dot a W s\nAnd from universal pictures presenting the new film first men from Damien ... director of la la land on whiplash and starring Ryan Gosling and Claire fully in theaters and IMAX friday\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene China has poured billions into making basically of Silk Road of running dozens of ports of container terminals around the world\nIt's a way to move Chinese exports to important markets including the European Union into Europe it all began in the Greek port of Piraeus the Chinese shipping giant Costco has spent millions transforming into the fastest growing port\nIn the world but as Joanna Kakissis reports from previous this has come at a price [noise]\nIs as iconic struggling with the proper way it's were lawyers set out for each of the battle and more Hollywood ... sixty film never on\n\nAverage\nSmelling I met with saying that there's no port she loved as much as ... ... on the mind me today\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu ...\nRetired ... your ... and his wife Maria the song by heart he worked at the port of Piraeus for thirty five years\nTo put those in the bureau dish visitors reminds me of this is my father when I got the reporter who didn't have many machines and all the cargo into the shouldn't we just did with\nOur own hands or do we do the bags of groceries I have a good ... where all men in Greece old bound for North American astray\nHe says parade his took care of its dock workers he made good money and now has a\nGood pension [noise] he flips a string of worry pizzas he reminisced says in his living room underwater color painting of a ship\nGroup of ... and then you have to ... million euros using them when I was looking out across from the sewage if you want to get some deep enough of big ships it's got everything\nTo be successful but for years when the Greek state owned the port bureaucratic red tape made it hard to attract investment\nThen came the debt crisis which began in twenty ten ravaged the Greek economy the he pushed Greece to privatize support for a U.S only the Chinese showed serious interest [noise]\nThe Chinese shipping giant Costco took over the port in twenty sixteen it now owns\nA majority stake and the Port Authority Cosco runs cargo terminals cruise ship peers and the largest passenger ferry Wharf in Europe and the Chinese are not stopping there\nWe want to expand the car terminals they want to expand or they want to create the logistics center they want to build a new ah cruise terminal\nCan be done by let us advice as to the Greek shipping ministry he's aware that Chinese lease on the port will run out and about thirty five years\nIf at some point in the future they want to abandon paid as we will have all these investments they will not take them with with them okay and they will leave him here\nShe is entirely a win win win win those are the words of captain food Chung she'll costs goes CEO and parades heard here in twenty Fifteen Years away and waiting\nTo Greece\nAn ... one of the port union leaders and that's the CFPB under Scotty as another interpretation\nWhen the time he said when ... they they mean vaguely life she says the benefits mainly go\nTo China the founder if they if they're not as if they found them know how their way to\nOrganize and doing business they found all these things in Europe\nYou can actually hear the Chinese expansion half the cargo terminal which are busy twenty four hours a day straddle carriers with giant metal containers of goods onto shift workers in bright yellow safety vest are everywhere these are coveted jobs in a country where the unemployment rate is twenty percent\nBut most of the Seventeen hundred workers at the port are temps without labor why [laughter]\n\nShe'll years ago hundred protesters and police for work hostile takeover and their working conditions\nThirty year old Steven ... recalled how he and his colleague work long hours and\nCondition for less pay to go\nAnother ... ... workers\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nGifts with outbreaks even to go to the bathroom\nSome of my co workers had to relieve themselves in plastic bottles now he says at least they can take twenty minute break during chefs\nOnly about two hundred and fifty workers are in the Greek dock workers' union run by your was ...\nHe cannot stomach the new reality for most workers at the port and blames Costco\nThey won't silence obedient to workers with no unions in this means no right what's the future we didn't win the future\nWe feel they can from her father's bust with Susan Rice said don't go ... go to that in the future look workers\nCosts because pray a CEO food chunk chill and his deputy declined NPR's interview request a Costco spokes than sending an email that after quote along and productive negotiations a labor agreement was signed that benefits both sides\nThe European Union's been largely silent on the labor concerns but ... says secretary of sports says he has heard from you if ... were suddenly worried that China's running a European port\nDecision me to be able to buy ... when you get the you know\nWe're all aware that the Chinese state is behind a company like Costco you that pushed us to sell our ports Costco and the first place we were in debt we had little bargaining power he says the e you underestimated China [noise]\n\nAnd now that the Chinese flag is race for re it's too late for regrets for NPR News I'm Joanna Kakissis in ... [noise]\n\nAs we said press was just the beginning China has snapped up about a tenth of Europe ... capacity in just the last decade I'm going to hear about that later this week\n[noise]\n\n\nThis is NPR News\nWake up five forty five brushing my teeth do my hair\nThen I hurry and rushed downstairs to get out and catch my bus on time\nCame to staying at the shelter with his eleven year old brother and his grandma Pam can't travel she says they moved here after getting an eviction notice\nThe landlord decided to sell the property and we just could not\nFind a place that we can afford\nMore depressed I God I just I didn't know what to do\nDrug it's a small disability type and can the government but the nowhere near enough to cover rent and boy the controls grateful for the shelter but says it's hard on her grandson\nMy youngest one he can be a little terror because he's upset but you know he gets angry and then\nHe'll sit in the corner [noise]\nHe'll just say I hate this place hate this place\nIs typical for came to but you wouldn't know it\nCame as a social fourteen year old is a big smile one of his favorite things about school is seeing his friends\nMy friends know about it and me being homeless and and they don't teach me on it I'm trying to work hard and it's just an effort to try not to break down\nIt's harder for students who are anxious and worried to concentrate homeless kids tend to score lower on standardized tests and have more graduation rate\nAnd sometimes king does break down with his friends [noise]\nAgree\nThat\nIn this case is doing okay\nKitten carried to tray of food to a table with his family\nOf the picture of his mom has a drug problem before his grandma stepped in he had to help take care of his little brother\nSo ready for school the tension on my watch so certain days one time when we only had cereal for like two weeks\nHe has been trying to convince his grandmother that she should let them get a job so he can help sprint like\nI Want to do [noise] you know how well they can't travel won't have it you need to be a child\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nLater there's good news and cadence world they got a house it's about seven hundred square feet that they share with a roommate for Kate and it's a huge improvement\nI feel much more comfortable and safe\nAnd probably most importantly he can say something he hasn't been able to for quite some time this is all very NPR News I'm Amanda Peter in Boise\nThat story came to us from the mountain west news bureau and later today on all things considered in rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen my asking your smart speaker to play NPR or your local member station by name\nThis is NPR News support for NPR comes from the states and and from logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more go to meeting dot com\nFrom Charles Schwab when it comes to wealth management Schwab believes in asking questions and being engaged so investors can better on their tomorrow learn more Schwab dot com\nAnd from the William T grad foundation at WTC grant foundation dot org\nSupport for WAMC comes from Amtrak fall foliage trips to board the Adirondacks great domed car with windows on all sides and overhead Albany to Montreal would stop throughout the north country Amtrak dot com\nTroy savings bank musical announcing country singer caffeine ... performing classics such as Eighteen wheels and a dozen roses where you've been more Thursday October Eighteenth at seven thirty PM drug user called out or Vermont coffee company organic coffee in the brown paper bag roasted with renewable energy rub on coffee company coffee roasted for friends\nInheritance lumber mill work building supplies offering integrity would all traits windows and doors reaching\nBalance designed real would interiors and low maintenance fiberglass exterior we share your passion\nArrington dot com good morning it as a Tuesday Morning we're with our own sharp ... you were talking yesterday about the staff and how long many of us have been at the radio station it made me think about her\nVolunteers you know talk about the heart and soul of WAMC those folks who joined us each fund drive they are our family and they show the best side of what we do they love the station\nHey David you couldn't say that I have to say that I cheer up coming to that room the first day of the fun to drive and I see these people who've been sitting there since I was in Nineteen Seventy nine I got there they've been there every time\nI Know their name study and Susan nurse slip honey they've\nCome and didn't they're sitting there and it gives you such a sense of belonging that we're all in this together they actually get there early in the morning stay there sometimes the whole day long sometimes not but whatever they can do they do and it proves how\nWe are all in this together they see every single way in which the sausages made and and they are there for us and they were just so great\nTo bring that up and wonderful people wrote it we could name names all day long we can we do we believe people out but in fact is wrong or made a name any of them because I I don't want to leave anybody up\nThree hundred Ninety nine thousand seven hundred and fifty one dollars now in the lock box really climbing up that hill that's the ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThe thousand dollar mark we're going to have to do an awful lot in the next four days we always know Columbus Day is tough always has been it was good yesterday actually much better than I thought but now we have four days\nWe see the spectacle of the presidents of the United states getting up before the nation swearing and Kavanaugh and saying it was all a hoax and the hoax was this prove\nThat's ally an out right or by CNN called it alive I call it a lie it is the kind of thing that he does he's now trying to turn it around so he says\nThis is the reason that the Republicans will win the congressional elections she's going to try to use it ... like to bring down the others and the fact that a president to the United states can get up and just all ... states Israel that\nNow the next question comes up for many people that are getting a lot of mail on the statement is where the Democrats David when he gets up and gives a terrible\nTerrible live like that where the Democrats wished Chuck Schumer where are the voices that scream out in protest stop lying you're lying is just terrible they don't do it and that the earth of leadership is really something that is amazing an awful lot of people\nI think one of the things that really is important is that those people who are opposed to the Trump presidency and to the kinds of things that has been doing\nDon't add up your frustration turn on each other no you got to keep your eye on the ball and you gotta know where to go and it means that if you have to\nVolunteer in electric if you have to get over the line if you have to do any of that stuff you do it it's so important and that goes Republicans do if you believe in your candidate and you do it you have to do\nBut if you sit on the sidelines the other guys when it's that simple\nSpeaking up and CNN this morning women are angry at Trump and his party and it's not just about capping off\nYou know we know that the Supreme Court to the United states with ... decided conservative tilt no matter what Susan Collins says she was told by Brett Kavanaugh are going to start sniffing away at roe versus Wade\nThat's why it's so important in various states if you believe in a woman's right of self determination that state legislatures will do what they have to do to protect us women are furious in this country we see it in the polling and aid is represented by what happened in the cabinet case women believe\nThat this woman was attacked\nDr Ford was attacked by Kevin ... not only that and you are right gave it it doesn't stop with this one Supreme Court decision it is a national movement that needs to be a respect\nLegal experts Allen are saying that the president's lawyers may be pushing ethical boundaries by communicating with people involved in the ... New York times meanwhile the president's lawyer Rudy Giuliani says defense lawyers talk to each other all the time quote where as long as our clients authorized that you have a better idea of what's going on well\nOf course they're going to say that Rudy Giuliani is now proven to be anything but America's mayor is a brain representative of the president of the United states I think he's widely perceived of is although it's hard to even say this as a joke\nGiuliani does what he needs to do in order to protect that President or what he thinks he needs to do I don't think he's helping the president one bit nevertheless you know the idea that\nThey have Rosenstein the deputy attorney general who is overseeing the Mueller investigation visiting in the White House and then almost inexplicably the president in the United states coming out and saying that Rosenstein will not be fired he's there in ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOr but it also may just simply be that there were some conversations the kinds of conversations you're mentioning that gave Trump some sense of he's All right and that what's happening in the Mueller investigation I Hope that isn't the case\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThen they could Vermont New Jersey and Pennsylvania [noise]\nBrooks your bank life is exciting let us help Burbank dot com [noise]\nGood morning it's eight o'clock [noise]\n\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany who you are you an HD Ninety point three runs in Utica\nWAMC cage de Ninety point nine Kingston W O s storage de Ninety One point seven Middletown WC EL HD Ninety One point nine Plattsburgh WC A. N. E. T. Ninety three point three Kennedy Harry WAMC age do you want a three point nine ... WAMC which do you want a five point one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety\nPoint one Stanford W ANR eighty eight point by Brewster\nAnd WAMC am fourteen hundred Albany ...\nGood morning less than a month for the midterm elections Democrats and Republicans have at least one thing in common they want to get their voters energizing out of the poll member\nComing up on MORNING EDITION from NPR News [noise]\nWhat a democratic strategist whether his party can gain it's enthusiasm advantage back after the appointment of justice Brett Kavanaugh of David\nGrann and I'm Noel King also this hour the curious case of among among the way he was the president of Interpol the international law enforcement agency now he detained in China and being investigated for a variety of crime and in Alaska ballot initiative that\nIts fishermen against the oil and mining industry\nThat overnight filmmaker Guillermo del Toro fifty for today and the news is next\nLine from NPR News in Washington ... Coleman the national Hurricane Center says hurricane Michael is less than four hundred miles south of the Florida Panhandle in the Gulf\nTop the stain winds are one hundred miles per hour and forecasts to become much stronger shelters are beginning to open up today from member station WFSU Ryan daily reports Tallahassee is mayor is urging residents to take precautions\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including Irma in two thousand Seventeen but he says the state's panhandle region should brace itself or an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages\nFor those who again rely on our electric utility system for their livelihood\nOr we would recommend that day or\nFind a a safer place to ride out the\nMandatory evacuations have been called in some coastal counties Michael is expected to make landfall Wednesday for NPR News I'm Ryan daily in Tallahassee\nOnline site Google says it will shut down its Google Plus side after saying it found a flaw that could have exposed personal information of half a million users\nGoogle says it has no information the personal data was misused but it's only disclosing the vulnerability now Wall Street journal reporter Douglas McMillan wrote about the breach he told NPR's MORNING EDITION there's no clear law that Google broke by withholding the news\nThere is a a patchwork of laws there's there Patrick with state laws and there's a there's a new European\nLaw that address is is the problem is these laws hinge on whether or not the company knew that data was improperly access in this case Google was pleading ignorance they're saying we don't know we have no evidence the data was access so we therefore have no obligation\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd about government scrutiny Brett Kavanaugh takes the bench today for his first argument since the Senate voted narrowly to confirm him to the Supreme Court Saturday NPR's Carrie Johnson reports the new justice spent the weekend working\nBrett Kavanaugh and his family appeared at the White House Monday evening forest ceremonial swearing in ceremony but he's not been studying up for his new job Kevin hired for women clerks a first for the Supreme Court\nAnd a source close to the justice that he's been reading brief to get ready for oral arguments\nHis first cases involve what kinds of crimes are mandatory prison sentences I got an arm career criminal act Kavanaugh's confirmation open up another seat for the White House to fail on the stage it's federal appeals court in Washington Carrie Johnson NPR News Washington\nMourners held a candlelight vigil in Amsterdam New York last night for the twenty people killed in the limousine crash on Saturday the vehicle ran a stop sign to pedestrians are among the dead you're listening to NPR\nSupport for NPR comes from NPR stations other contributors include the University of Florida we're solving for next is powered by its land grants heritage from renewable energy to global health you have students and researchers are working to solve challenges at next dot U. F. L. dot edu\nSupport for regional new cars with our brothers seven on the brands one burger county location for sixty years and counting net direct sales and service of new and ... cars trucks it's hard to beat the dog but our brothers dot com\nAnd if the car seat south Deerfield, Massachusetts family owned since Nineteen forty eight sausages from ... to ... worse than smoked meat home in New England for a mate sausage open seven days for ... dot com\nGood morning NATO for this was WAMC regional news and I'm David ... in the headlines\nYork state police are opening a criminal investigation following the limousine crashes Gary York that killed ... people that we knew him she's look as will the reports limousine company in question is cooperating with the national Transportation Safety board\nThat New York state police troop gee headquarters and Lisa Monday afternoon major Robert pet not said investigators will determine if there's any criminal culpability for the limousines owner\nShowerhead Hussein if there is well hold him accountable for say an owner of prestige limousine in nearby Saratoga county is out of the country in Pakistan\nThe two thousand one Ford Excursion stretch limousine carrying Eighteen people all of whom died in the crash is being evaluated by the national Transportation Safety board to pedestrians were also killed\nNTSB chairman Robert Sumwalt said procedure is cooperating with the NTSB as investigators seek more information in Albany I'm Lucas Willard\nMeanwhile Congress and Paul Tonko whose district includes empty damn city that had a large number of the victims as residents was asked if the federal laws need to be changed on limousine safety\nI Want to say but if ... fourth but obviously there's a whole lot of unanswered questions as a family to serve this sort of a respect\nWhether they sort of that everything has to get that information gathered at a very self\nCongressman tonko a utility company shut off gas to about three hundred customers in Massachusetts after work or doing routine maintenance inadvertently over pressure on the system national grid said the situation Monday and will burn was quickly corrected and knowing back your wages were ordered and there were no reports of injuries over pressurized\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nExplosions and the ... valley of the state last month that area's service by different utility\nIn other news this morning Vermont Senator Bernie Sanders has embarking on a nine state tour on behalf of the Democratic candidates competing in the November election returning to the campaign trail the head of a decision on another White House bid the pact October schedule will be the Vermont independence most extensive stretch of campaigning\nSays the twenty sixteen presidential race\nPolice in Connecticut say a toddler has died after being pulled from a swimming pool offers responding to a nine one one call regarding unresponsive two year old boy from the child at home and shelter and\nAn eleven AM on Monday the death remains under investigation cloudy with fog and does all this morning partly sunny warmer this afternoon highs new you're eighty\nToday It's MORNING EDITION from NPR News I'm new king in Washington DC\nAnd I'm David Greene in Culver City California Republican and democratic leaders have one thing in common right now both are hoping that the bitter battle over Supreme Court justice Brett Kavanaugh will motivate their base and Dr voters to the polls for the midterm elections\nRepublican Senate majority leader Mitch McConnell described it as a quote shot of adrenalin that the geo Pete got from the confirmation battle is polls do show that the Republican Party is closing in on Democrats enthusiasm advantage this is McConnell over the weekend on CBS face the nation\nI Want to thank the other side for the tactics that have allowed us to kind of energize and get involved I own a voters\nLet's talk about what the Democratic Party might be able to do to try and regain steam I'm joined by rubbing mock he was the campaign manager for Hillary Clinton's campaign in twenty sixteen welcome back to the program\nThanks so much\nSo McConnell seems appreciative for how Democrats handled the confirmation battle over over Kevin ... I mean do you worry that the Democrats have given away the edge that they had heading into November\n[noise] I don't think that the edges been given away at all I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a bomb to try to close that gap but there's still a significant advantage for Democrats\nAlthough one of our our poll that NPR show the Republicans went a long way in closing that energy gap I mean it it it sounds like Democrats might have some work to do to to sort of wide and that gap again what what what is the plan\nSupport for WAMC comes from lakes along the passage cheating by way supporting the north country underground railroad historical associations mini bus tour in October twenty of the north star underground railroad museum passage board dot org I Love New York\n... Allen committed to combining legal strategy with the fish and sea to address client legal needs offices in Albany and throughout the northeast online at ... dot com\nThe graduate school it's ... it's working with engineers and individualized programs in micro electronic systems energy or computer engineering ... graduate\nAnd that are on deck aquatic center multi or good planned aquatic facility with children and adults with varying abilities in the region can learn he'll play exercise train and compete\nAren't aquatic center the auto aren't gee [noise]\nNews channel Thirteen ... WAMC regional forecasts going for clouds areas of fog and drizzle this morning\nBut then turning partly sunny warmer and more humid by this afternoon hides in the upper seventies to your eighty partly cloudy tonight lows in the mid to upper sixties partly sunny warm again tomorrow ... eighty chance of showers Wednesday night mainly overnight mostly cloudy lows in the mid to upper sixties\nFor Thursday showers and thunderstorms possible some could produce heavy rain highs and the upper sixties to lower seventies chance of showers and storms into Thursday night\nLows in the lower fifties friday partly sunny highs near sixty Saturday at least when these guys highs and the lower fifties Sunday mostly sunny\nEyes and the lower to mid fifties [noise] at last report\nMerit in Connecticut clear sixty two degrees cloudy fifty aided Montpelier, Vermont [noise] north Adams mass reporting mostly cloudy skies sixty degrees at Newberg mostly cloudy sixty three this morning clouds sixty three in Albany\n\nSupport for NPR comes from the station and from capital one offering a variety of credit card options with features for a range of customers from cities to travelers capital one what's in your wallet credit approval required capital one bank usa NA\nFrom Amazon Prime video presenting the return of the man in the high hassle\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOr they want the new season is now streaming on prime video\nAnd from Harvard Business school executive education for executive that any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot any flash executive\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King until recently the head of Interpol the international police organization based in\nFrance with a man named among Hong way he's from China but in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol I talk to NPR's Shanghai correspondent Rob Schmitz and asked him what do we know about ... or ...\nIf you see four years old he served as the vice minister of public security bureau which is China's national police are in twenty sixteen he\nBecame the first Chinese head of Interpol and there's an election was a big victory for China's government which under leader Xi Jinping was eager to use Interpol to locate an extra day Chinese officials at it deemed corrupt would a scape China\nBut as it turns out among himself is now under investigation by Chinese authorities for corruption\nWhat exactly are they investigating him for\n[noise] which I think government hasn't released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how is the tension unfolded\nHas come from his wife grace among on September twenty fifth the day her husband arrive to China for a visit she allegedly received a text from him that said wait for my call which was followed by an ... of a knife to Justin that she was in danger\nA week later she reported him missing the French police on Sunday she spoke to reporters and we own friends wearing trouble is headquartered in here's what she said\nWell you know I had to go to the half of my other than my children and all the people in my life and all the wives\nAnd children and husband and father and so that they may no longer disappear\nAnd as you can hear in that tape now while she's crying during this part of the video with their back turned to the camera because she's received threats and is under protection by French police well\nWhen she talks about the husbands and fathers who disappeared in China what does she mean\nWell she's talking about the government anti corruption campaign was launched by she can paying immediately after he took office in twenty Thirteen and snare hundreds of thousands of officials both on the local level as well as among the highest echelons of the party\nIn fact the man who appointed Malone way to vice minister of public security was Julia ... conga highest ranking Chinese official who was brought down by this campaign Joe was a former member of the pull up your standing committee the group of seven men who rule China he was trying to security czar before he was sent to prison for life and twenty Fifteen\nRob by removing month from the presidency of Interpol loses a lot of sway within that organization that much is clear why does this mean for Interpol\nWell even before this happened China's use of Interpol and amongst presidents he was starting to raise some red flags earlier this year China attempted issue in red notice that it's an international alert for wanted person\nFor an exile weaker activists were years are mostly Muslim ethnic minority who live in northwestern China China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nGoing over into international organizations really interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob banks do\n\nAcross the United states more criminal courts are turning to video proceedings says in an effort to save time and money but that happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology\nFrom Illinois newsroom in Urbana league games reports\nToday like most days thousands of defendants will show up in criminal court for their first appearance in front of a judge it's likely that more than half of those appearances will not be in a courtroom in person the defendant will instead to face a video camera from inside a jail\nSheriff just standard likes that system he's in Lewis ten in rural west central Illinois he demonstrates what his deputies used to have to do\nThey would have shackles on sort of stuff we're going to be half of war or taking care of their belts were going to be trained together so you're walking on the line it's kind of like a three legged race\nStandard says the video system they now you freeze up more of his officers for patrol and he argues that the convenience of the system is better for everyone\nSo we can become roundabout put them in front of a video camera the judge has access to the video camera\nOur conversation just like we are now but it's just over a video screen\nBut Charles Davis and says it's just not the same Davidson is sixty eight years old and a recovering heroin user who was in and out of jails and prisons in Illinois for over two decades he finds the video process both off putting and demeaning\nWhen I first went to the radio of course it just blew 'em up because of watching everybody get up and go in front of the screen is either yes or no or you know you couldn't Sunni to\nDavidson says when you're in the same room as the judge it's easier to have a conversation with them and he's noticed there's a greater chance to listen to what you have to say he says the first time he appeared in video court he didn't think he got a fair shake\nOh shut explained to the judge what happened and they told me to record\nSoon after Davidson was sentenced to Eighteen months in prison [noise]\nLawyer Rosalie joy says she hears stories like David since all the time she's with the national legal aid and defender association and says the increasing use of video court had some defense attorneys concerned that it alienates the acute from those deciding their fate\nEven before the proceedings began you already feel like you're treated as though you're guilty you are feeling excluded from the process you are treated as\nThe least important part of the process because there is nothing that can replace human interaction and as a defense attorney I Am never going to be as effective in the courtroom for my client\nUnless my client stand shoulder to shoulder to me\nWhile there's little research on video court what's out there shows it may increase bail amounts and in many cases makes private communication between attorneys and clients more public\nOn the prosecution side many defend video court for its cost savings and efficiency while acknowledging that some of those advocating for the accused say it's a trade off that's unfair to defendants\nFor NPR News I'm Lee gains in Urbana, Illinois [noise]\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n[noise]\nThis is NPR News support for WAMC comes from lake the locks passion scenic highway supporting the north country underground railroad historical associations mini bus tour in October twenty if at the door start underground railroad museum passage poor dot org I Love New York\nLuis Silver's\nSome challenges in there to\nWin a small scale commercial fishermen and the consummate Alaska today he sporting a candle jacket and a gun on his back in case we run into a moose ... vote to have a look [noise]\nWould also helping leaves to stand for salmon campaign for a ballot measure aimed at protecting the state's most iconic fish walking along the creek would says he thinks it's a long overdue change\nFish scale is fan tipped too far in favor of of development and industry and and we're just trying to pull it back towards the center\nAlaska as some of the most valuable salmon fisheries left in the world but wouldn't other ballot supporters say the state's laws protecting salmon are weak putting them at risk especially with a number of large mean minds and oil developments in the world\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nBig projects in salmon habitat among other things it was set strict standards for restoring salmon streams that they're disturbed and the companies don't follow the rules they could face criminal penalties would acknowledge is that in a state like Alaska it's a big ask\nWhen you start doing something like this it's really kind of\nSome in your nose at the big guys you know\nFor decades Alaska's economy had depended on industry dollars and oil and mining companies hate this initiative banded together under the name stand for Alaska they're backing a campaign to stop it running a blitz of ads like this wire\nIt claimed to protect their habitat when it actually improved is burned to new regulations that flu or stop Alaska projects\nCompanies have poured millions into the campaign against the ballot measure with help from donors like BP and Exxon Mobil they've not raised more money than all free of Alaska's gubernatorial candidates combined\nTurned Matthias is with the council of Alaska producers the group that represents mining companies and she argues the state's salmon fisheries have so far coat existed with minds that oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem just seems crazy\nMatthias thinks the initiative prioritizes standing at the expense of the state's biggest economic engine and taxpayers\nWe couldn't have stay Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans senator more than just living or the occasional meal here they represent something deeper their vital food source in a traditional way of life in one of the last states were wild river's still teen with them every summer\nSo when voters head to the polls this November there'll be weighing that against fears that have met her to protect him and could read all the state's economics foundation\nFor NPR News I'm Elizabeth horrible in Anchorage [noise]\nThat report came to us from Alaska's energy desk it's a public media collaboration focused on energy and the environment\n\nThis is NPR News you know all those wonderful people listen to on the radio\nAll the great people on our staffers and our news bureaus you made them what they are today yes you did you made them what they are because\nWithout you and your support we couldn't do it so I ask each person to think about what's important to them in life what radio station you listen to I can I Do something anything just put something into the lock box at WAMC\nDot org ...\nSupport for WAMC ... village with Kobe New York\nAt adults with developmental disabilities live and work together as farmers gardeners and in ... crashed studios minutes regret buried ... village dot org [noise] am a will there's twenty or hovering high school board to get people to focus on leadership opportunities of personalized learning about ... dot org\n... country singer caffeine\nPerforming classics such as the wheels and a dozen roses where you've been in more Thursday after over Eighteen to seven thirty PM drug user dot org [noise]\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nA Bernstein for you than farewell concert conducted by much patrol Snyder [noise] gonna be simply not only for information Curtis lumber between kitchen about showrooms with national designers more or less cabinets camp reports countertops consultations available put his lumber dot com [noise]\nWhich you know Woodstock in markets rerun back to Hudson Valley restaurant specializing in contemporary Italian from\nFarm to table ingredients diesel drinks and winds elections on Instagram at\nWoodstock and market street ride back [noise] match smoker with Adams, Massachusetts breathing folk rocker ... billion contract Dilbert thirteenth and tune yards Tobar thirtieth mass mogul Donald\nTrump junior at all Times Union subscribers now have access to membership levels would include digital cookbooks crossword puzzles online access and much more convenient dot com slash membership [noise]\n... WAMC regional forecasts going for clouds areas of blogging result in the early morning hours attorney partly sunny warmer in human eyes in the upper seventies near eighty [noise]\nWhile listening to MORNING EDITION on WAMC good morning [noise]\nFifteen minutes now we're not [noise]\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work in food health powered jobs and resilient cities at rock found dot org\nFrom the doors do charitable foundation whos clinical scientists development awards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to the NPR station\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene today we're closing the circle on the story of a bull loved Stradivarius\nBelong to the virtuoso violinist Roman Totenberg just a few years after ... death at age one hundred one and thirty five years after it was stolen violin was covered by the FBI Totenberg daughter Nina Totenberg broke that story and today\nShe brings us what musicians call the coda the concluding part of the piece\nAs I recall three years ago my father played that violin to awaken the hearts somebody [noise]\nMan [noise]\nAnd to dazzle [noise]\nWhen the violin was recovered we three Totenberg sisters were intent on just one thing that the instrument now known as the Totenberg aimed strategy would be played in concert halls everywhere not closeted away in some collectors fault\nEnsuring that was not as easy as you might imagine the violin was an excellent shape but because it had not been professionally maintain for thirty five years it had to be restored a task performed over to painstaking years by craftsmen at rare violent of New York\nStill finding a buyer who met our specifications with not so simple we could sell it for ... in Asia but likely never hear it again\nAnd then the co owners of rare violins these ... and Bruno price were approached by an angel a person who's a dentist eat we still don't know and like\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOur friend he was willing to buy the violin but not for himself\nHe challenged us to help young musicians have access to great instruments the arise de ... gone\nUp so high over the last Thirty years musicians have no longer have the ability to access great instruments let alone all day\nAnd so it was even Bruno have found is something called rare violence in consortium away for a wealthy patrons of the arts to acquire string instruments and then lend them after promising young musicians for years at a time\nMy father's violin we'll go first to Eighteen year old Nathan melts or who already have enough of a career to pay that considerable insurance and maintenance costs\nMeltwater strapping six foot or who can manage this relatively large strategy has been practicing on the violin for about six weeks now\n\n\nI don't know how to explain how great it sounds it has an amazing amount of power to it in all registers at the same time this the sweetness and it never gets brittle never gets shrill\nToday is the last day that the ... will be in any sense the property of the Totenberg family we hope we've been good custodians in my father's name and Antonio Stradivarius as well\nBut most of all custodians for audiences who will hear Nathan melts er and others make that violence in long after we're gone", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Albany", "day": "09"}