{"month": "10", "state": "GA", "station": "WUWG", "content": "Learn more at H. B. S. dot any flash executive\nFrom the University of west Georgia is Ninety point seven FM Wu WG and W. W.\nFrom\nThe University of west Georgia Ninety point seven FM W. W. W. W.\nA. G. H. G. Carroll of the Georgia Public broadcasting radio network\n\nSupport for G. P. B. comes from our monthly sustain hers\nAnd Atlanta symphony orchestra music director Robert span of welcomes pianist Louis ... piano concerto number one November\nFifteenth and seventeenth details that a a soda or G. classical series presented by Delta Airlines ... museum of art first friday is back on November second from six to nine PM guess will enjoy live music dad's garage performances\nAnd art making with color H. T. L.\nTickets are available at high dot org and we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home well star dot org slash male well star and Mayo Clinic working together working for you\n[noise]\nSupported by bill dot com simplifying digital business payments on streamlining the wait three million users pay and get paid and learn more and build dot com\nBillion dollars\nFrom American Public Media's\nMarketplace that's supported by Amazon Web services over a million customers use ... W s as cloud to functionality and experience to dream big and build faster\nAnd learn more had have ws his how dot com you can buy Fidel it investments taking a personalized approach to helping clients grow preserve and manage their wells learn more infidelity dot com slash ... but ... brokerage services L L C\n... online test prep for the ACT SAT G. R. E. N. G. math that's designed to improve scores students can get video lessons practiced questions and experts support online at ... dot com [noise]\nIn Los Angeles I'm John Rizzo Monday to do the twenty ninth of October is always a real long everybody we will do it to the purple and gold\nQuestion of the day in a little bit but we're going to take a couple of the dominance themes of the day to day as we get going that would be Wall Street consumer spending ... also the ever important idea of economic growth and roll them into our lead story right here\nAnd that would be Wall Street consumer spending terrorists also the ever important idea of economic growth\nAnd roll them into our lead story ready here goes Wall Street was lousy today in part because of a report that the Trump Administration is getting ready to impose taxes on the other half of everything the United states imports from China that we don't already have tariffs on ...\nAnd we've got new figures on consumer spending this morning we consumers that is spent more for the seventh straight month last month\nAnd that's indirectly I'll admit gets the marketplaces ... shore and wire one imagines things go from here\nWith consumer spending more and more and more for the past seven months without wages ramping up you might wonder whether some kind of issue is going to drop\nThere's no reason to believe that it could we're spending is poised for material to slow down\nJames Bond agrees with economic forecasting firm I chest market GDP Growth was three point five percent in the third quarter faster than economists were expecting\nThe state of the consumer is pretty much the best it's been in decades and you know that's characterized by low unemployment rising income um and then the tax cuts of course\nThis is despite slow wage growth Alan ... is an economist at UPS\nWith all these then overall income growth just because people have been putting in more hours we've been having more people being hired even though the wages for individuals have been going up rather modestly they're starting to pick up for now\nAs long as jobs keep getting created consumer spending should be strong so what might threaten jobs well tariffs for one\nOver the next six months or so it's likely that we'll we'll see some flowing in an employment and income as burns take a wait and see attitude on the terrorists and the terrorists slowly by and on the economy start raising prices\nStill ... expects that to be temporary some firms will suffer some will fail others will adapt Richard ... is an economist with Wells Fargo and company he says there's a threat to employment and spending closer to home\nWe've got growing headwinds in the form of higher interest rates are reserved has raised with great several times over the past years\nAnd if those rates continue to go up that could be a drag on home sales in auto loans next year in New York Times to prevent a short for marketplace\nOnce upon a time IBM stood for international business machines but somebody hasn't made any actual machines in years since I got rid of its hardware divisions it's been selling to things to business customers software and services and today the company took another ...\nBut he hasn't made any actual machines in years since he got rid of its hardware divisions it's been selling to things to business customers software and services and today the company took another big step in that direction big blue is spending thirty four billion dollars\nTo acquire the open source software and cloud computing from red hat it is the biggest acquisition IBM's ever made a bet on the big market for cloud computing marketplaces ... has that one\nWell know there are different types of clouds in the sky right strategy clouds are closer to the ground in serious clouds are way up there all God's for data work the same way companies put some info and servers far away but not all of it came forest at Fort ... capital says sometimes you need the info lightning quick\nOver in China over in Europe where the cloud really is all for it takes too long so you have to have stuff close to you like the business\nAdding some clouds close and some far is called hybrid cloud that requires a different class to talk to one another and red hat make software to do that it's a big reason IBM bought the company together redhead and IBM hope to take on the big big boys and cloud computing Amazon and Microsoft says Chris Gardner at Forrester Research\nThis is active approach to say look we don't want to be their shadow when it comes to what we want to be first\nIBM hasn't been first that much lately Michael ... and what the Sloan School of management at MIT says big blue came late to mobile computing and then the cloud now it's trying to catch up\nTo an important company but it's not a growth company anymore it's a shrinking company the challenge for the C. E. O. J. D. rom it is to figure out how to grow again\nThis is a pricey batch thirty four billion dollars for red hat is sixty three percent more than what the market the company was worth on friday I'm Scott Tong for marketplace\nAs I said speaking of markets Wall Street was lousy today not as lousy as it could have been no we'll have the details when we do the numbers\nA story about getting what you pay for four more accurately getting what you don't pay for you don't have to spend a lot of time driving around almost anywhere in this country to know that our infrastructure our road specifically are in bad shape typically the money to maintain and sometimes even\nA lot of time driving around almost anywhere in this country to know that our infrastructure our road specifically are in bad shape typically the money to maintain and sometimes even improve those roads comes from gas taxes California is one of several states that increased it gas tax not too long ago to get more money\nTo make more repairs but as often happens with new taxes not everybody is happy about 'em and they have taken to the ballot with the anti tax proposition six coming to California voters a week from tomorrow but as much Jed Kim reports from the streets of LA changes in what kinds of cars are on the road might make a real gas tax difference\nHe lied Lippmann has brought me to the corner of Venice in Figaro in downtown LA\nIt's next to the convention center staple center and\nOur highway highway yeah the one hand freeway right here near the noises coming through um [noise] let\nMe is with the transportation organization called LA\nAgainst proposition six because he says the gas tax is necessary\nPoints out the ... in\nLipman says the state has a backlog of a hundred and thirty\nDollars in infrastructure investment roads and bridges [noise]\nBridges that are less safe\nAnd we are part investing in the states and the\nLast year California legislators decided to patch that hundred thirty billion dollar hole\nBy raising the state's tax on gasoline from Eighteen cents a gallon to thirty cents almost immediately a group formed to put forward proposition six to overturn the increase and require all future hikes to be approved by voters rather than legislators\nCalled the ... is chairman of the yes on prop six campaign he blames the poor infrastructure situation on mismanagement\nThe politicians have more than enough money to fix the roads they just keep diverting the money so we don't need to add the cost of living burdens to working families to fix roads they should be putting the existing gas tax into roads rather than increasing it\nBut even if the gas tax word stay the same it wouldn't be able to keep up with the demands for one thing these types of having been indexed to inflation\nAnother reason to be seen directly across that street\nIn downtown LA at a Honda dealership\nIts windows advertise hybrid another fuel efficient cars\nGhouta is out on the law joking with other salesman\nI ask him how many people come in looking for a good mileage\nMost of it that\nSmith nine cuts coming for the first day looking at ah\nLooking for good mileage most of it that\nSmith nine cuts coming for the first day looking voting\nAnd they're finding it some vehicles top out at over fifty miles to the gallon for people maybe\nOur draft picks you bring in free agents that weren't drafted I'll take you in here to the war where ... is is like where the draft is how\nYou know ... or one two three four or at least four or five like minded shoulders and screen which ... of course I'm going to get her the best guess drugs would you regret\nThe way that the the building is designed is the the the basketball courts are at the center of the building and you know when you hear the basketball that kind of like the heartbeat of the building and um so now we're walking as if you go you know we are one of the player\nSo we'd rooms trading rooms right that courtroom over there the beautiful weight room jokes so this is a big boom you're supposed to start asking questions but I'm going to cause it's like this is the heart of the place where the rubber meets the road um [noise] so what keeps you up at night but once you're worse\nBut my ... my the thing that keeps me up right now is that the the greatest player in the NBA LeBron James decided to come join us and and be part of what we're building and we've missed the playoffs every year for five years\nSo this is not what the brand was meant to be and that's what what\nAre fans deserve to be back to what they're used to it in terms of Lakers basketball has been the best player has\nAnd that's what what\nAre fans deserve to be back to what they're used to it in terms of Lakers basketball have been the best player has brought us back it's it's it's elevated the brand now we just need to do that\nFor ... I don't necessarily expect you to answer this question but it kind of have to ask her view a little brown and ... and Magic Johnson strokes were best reporter and you know ... and the other best portraits of you guys have the conversation on yourself about work\nAs soon we're going to be rebuilding [noise]\nUm yeah you you know yes I mean magic has definitely has a plan as to what we're doing you know when when magic came in and took over basketball operations\nWhat I felt was and why I had to make the change from our existing general manager and my brother Jim who oversaw basketball was that there was no identity of Laker basketball they're\nReally interesting because liquor both couples like a brand name\nExactly and and you can't establish anything when you're changing coaches every eight months so we've had three coaches and three years you know and each one a great coach in themselves but you can't change your roster overnight and so everything was\nNot matched up right and we were struggling with no identity\nSo this goes to something which are more push all the time you were in uncertainty and and not only does regular business they don't do so to reduce the sports business in sports teams and the woman running loose forced to read an surgery was going\nWas killing the brand and it was you know when my father passed away\nThan commissioner David Stern called me and he said Jeannie don't let the team fail like don't let go do run into the ground who say oh yeah when we looked like\nIt it would you break your dad's heart and so you know and it was difficult because I wasn't in charge of basketball my brother was and I asked him how long is it going to take you to get the team on track and he gave himself a timeline which [laughter]\nAs as time went on I realized that wasn't going to happen and that's why I had to make the change that I did but I you know I took that to heart and I wouldn't I wouldn't let this you know my dad had six kids there I think the Lakers were his favorite care [laughter]\nIt let this [noise] you know my dad had six kids and I think the Lakers were his favorite care if they\nWant to hear about your family right I mean Dr both her dad during your brother who work with and then and then had to replace\nYou talk a lot you talked about it in your book you've talked about it in interviews about how this is a family business show those first couple of years when the commercial lead culture and says don't blow it with the family business and then you have to file your brother what's that was it was\nVery very difficult um [noise] you know my dad kinda set it up for us but ultimately he gave me the authority and the power\nTo make any changes that I saw a necessary one of the key components of that decision making process was a conversation I had with Kobe Bryant he said what a player\nAn all star player who's you know a free agent is going to look at an organization and how it operates and making sure that there's somebody in charge who has authority to accomplish what the goals are\nMeaning you've got you've got to get the organization in the right position before anybody will consider\nInvesting his career in what you're doing right now nobody knows what you guys stand for\nSort of becomes a poke them your question about head out and making the change from prior management and your brother you started to where the number of years were too long\nThat was the my first comment publicly was I Apologize to Laker fans because\nI did wait too long um as you can hear the music that are only ... it's it's funny because we actually have a DJ now on staff I Know because yeah it's like these young players they they're multitasking there used to having music while they're doing whatever let me show\nYou don't get out of your own your own\n... mile and a\nWife and I mean actually this is the trophy room I just happened to my desk in here and\nSo we're going to do this person under the terms you that's cool so that\nThe reason you know it it was important the trophies were displayed so that the players ... this is the inspiration\nAnd we overlook recording if they look or they will students trophies around\nNow here's a great feature\nSo that the players could program this is the inspiration\nAnd we overlook recording if they look or they will see these trophies hanging around\nNow here's a great feature wow for me\nIs that ... that balcony why'd\nYou nice Roy ... daughters are going to watch the paperwork that the war room told our that we were the ... right we're right okay now I had no way no\nWay to get it until ... operate or this is a really good snapshot of you being able to run the empire right from Europe to the court right\nYou know again going back to the other players wanting to know me standing with them behind ... you know so it is we're all together and\nAwesome registering with that I Want to get out of your show much a ...\n\nThe grand tour from a woman in charge of the Lakers we saw Jerry Buss was collection of championship brings which is kind of interesting also former liquors coach Phil Jackson vision up seven years where there's a video marketplace subtle\nThan on the\nBottle\nLoad all the way out today perhaps handy market gloves were given the way Wall Street's been going of late you'll hear the word\nCorrection get thrown around a lot\nThat the decline of an individual stock but more often an index like say the S P a decline of ten percent from its reason I and in fact he has to be closed in correction territory today as did the ... the Dow was there for a while but here's the really important part because I feel like I Can't say there's often enough\nThis is normal\n\nMarketplace that supported by progressive insurance offering a Tom ... floors to shoppers can evaluate options in one place when buying health insurance cut them close and rights are available online learned more progressive dot com\nAnd I see three addressing the world's most challenging problem that the convergence of artificial intelligence coyotes and elastic cloud computing learn more at the three Don AI\nThan by exact science is offering ... ...\nIntelligence coyotes and on lasted cloud computing learn more you see three dot AI anti exact science is offering color guard for average risk adults over fifty color guard as a non invasive colon cancer screening tests that can be used at home although my prescription only information at color guard task dot com\nAre already are down ... off to forty five today just under one percent about half the total loss of actually dropped out and sixteen points one point six percent five hundred down Seventeen six tenths of one percent\nOr daily production team includes Brigitte ... special projects dead ... English is the producer on our wealth and poverty desk I'm John Rizzo and we will sue tomorrow [noise]\nThis is a pie in\nLife and the G. P. B. newsroom I ... in traditionally Republican areas of Georgia Democrats may feel like they have a few and far they are rather few and far between TBB Steven Fowler reports on Democrats largest ever campaign to turn Georgia blue\nI don't think that we know enough yet to see that I think is one of the things that he's going to come out over the next couple of weeks of the next couple of months as investigators going into his past\nWhat else are you still hoping to learn about him and his motives\nI mean we would certainly like to know more about how did he become as hateful as he did and how long has that been going on and what role the Internet playing\nDid the current sort of political anger and conflict playing uh so I Know that investigators are going to be going through his computer files are going to be going through his home they're going to be talking to folks who know him who might have worked with in family members friends\nThat kind of thing that really took away to the New York times who's been reporting on the background of Robert Bauer of the accused synagogue shooter thank you very much\nThank you President Trump will travel to Pittsburgh tomorrow at today's White House briefing press secretary Sarah Sanders condemned anti Semitism and said hey\nPresident Trump will travel to Pittsburgh tomorrow at today's White House briefing press secretary Sarah Sanders condemned anti Semitism and said the hatred stop\nCritics of the president said his campaign rhetoric is raising tensions and widening divisions even as the country is still reeling from the Pittsburgh attack and from the arrest of a Trump supporter believed to have sent pipe bombs to Democrats and critics of the president\nAnd here's our usual Roscoe is at the White House and she joins us now to talk through all those hey there hello so the White House is of course aware of criticism of the president's words how are they responding\nNot surprisingly White House press secretary Sarah Sanders is defending the president she says he is working to unite the country and that he is showing leadership here's some more of what she had to say at the briefing today\nI think the president has a had a number of moments of bringing the country together once again I'll remind you that the very first thing the president did was condemned the attack on the very first thing the media did was blame the president\nAnd she's really going on the offensive here she's saying that Ninety percent of the news coverage of the president is negative or even though the country's doing well and that the media bears responsibility for the divisions in the country\nAnd she's she's basically arguing that the president is going to defend himself he's going to highlight these differences between him and his opponents\nUh and and against the media uh and she's a doubling the White House really doubling down on his rhetoric even after a these improvised explosives were sent to CNN last week oh what a Sanders is saying is that the president can't be held responsible for the actions of another person who doesn't know personally\nI the thing is are you sure whether you like the president's language or whether you have the president's language he has been consistent this is who he is so is there something different about the way it's resonating this time\nIt really seems to be about the timing you you have these kind of back to back\nEvents happening right before a critical election Trump is not known for being able to play this role of the console or in chief or certainly not the night or in chief uh that's not a natural fit for him I'm and basically what he has done is when something's happened he says something directly after the ... the tragedy\nThat is expected um but after his call for unity on Saturday after the synagogue shooting he held a campaign\nEvent where he went back to making personal attacks he called out Elizabeth Warren using this belittling nickname for her\nSaturday after the synagogue shooting he held a campaign event where he went back to making personal attacks he called out Elizabeth Warren using just belittling nickname for her\nJob [noise] I guess she doesn't have any ideas what she does that I have no\nAnswers that rally on Twitter he's once again denouncing the price of the enemy of the people and calling out the Democrat running for governor in Florida Andrew Gillum calling him with these without evidence\nIn many ways like you said this is what his support is likely expect from him but what his critics will argue is that going out to people so personally and and not just saying they're bad on taxes or something like that\nIs that it's inflammatory and that there are consequences to\nThat well you mentioned the mid term what might the consequences beyond the metro what difference might the president's rhetoric Mac\nIt's very hard to tell A People's views the Trump are as seem to be pretty hard and at this point so\nIt will you really don't know whether this is going to change any votes or the risk of course is that maybe some lukewarm ... supporters of Trump could be turned off by the negativity or that his opponents could get really fired up but we'll just have to see what happens next week\nAs NPR White house reporter Ayesha Rascoe reporting from the White House thanks Asia thank you\n[noise] ...\nThank you for tuning into eighty eight point five CPB Atlanta a good Monday I Ricky ... and Democrats Stacey Abrams is vying to become the country's first black female governor that's if she can defeat Republican secretary of state Brian Kemp for both parties the governor's race is only a small part of a larger strategy\nGeorgia Democrats say they've put together their largest ever effort to turn Georgia into a blue state TV's Stephen Fowler reports\n... an hour is on doing our eye on money sunny Saturday in about a dozen people are huddled in Amanda ... living room about an hour northwest of Atlanta or take chairs the Gordon county Democratic Party and she's helping the state party expand its reach ahead of the midterms\nMy house is the headquarters typically and I get down here to come here we train them on some banking and canvassing and then we all go out and do what we're supposed to do\nThe campaign prints flyers touting the Democrats' policies it's come up with a unified message to highlight down ballot races and built a voter outreach infrastructure to help Tate and her volunteers over\nAnd and built a voter outreach infrastructure to help Tate and her volunteers know who to target\n\n\nAnd county isn't a democratic stronghold eighty percent of its voters picked President Trump and the twenty sixteen election and Republican turnout was strong in this may primary but Amanda Tate says she's met plenty of closet Democrats who think they are the only ones around\nI get cake Taliban now you're not having more on the street or ... you should come to our meetings you know we need more people like you who are supported us as candidates\nThose closet Democrats as well as citizens who don't normally vote or the people this campaign is hoping can move Georgia to democratic control\n[noise] at this year's said forty\nLittle bit and support the party's other nominees for office state Democratic Party executive director Rebecca diehard said the strategy is to target traditionally democratic areas like metro Atlanta and also dig into Republican strongholds like Gordon county\nWe are organizing in areas that we've never been weird dabbling down in areas where we know there are more about\nKnocking on doors we're making more calls we're sending more tax Georgia\nDemocrats say they have Seventeen offices one hundred and fifty staff members and thousands of volunteers across the state and their efforts are getting national support\nDuring the last fundraising cycle the state party raked in nearly six million dollars from individuals impacts across the country\nAnd Democrats with eyes on the White House and twenty twenty of may campaign stops here Colorado Governor John Hickenlooper knocked on doors east of Atlanta Massachusetts Senator Elizabeth Warren spoke at a packed strip mall in New York senator cure ... worked a phone bank in a bakery\nMining ran for governor its hair on a one sided effort and said\nRepublican Party's campaign has seen visits from vice president Mike Pence and Donald Trump junior and statewide candidate gubernatorial nominee Brian Kemp are using Republicans incumbency to strengthen their get out the vote effort\nIn the in the primary and then the run all in all parts\nThe same thing in the general there is where we won't go\nInto a winning coalition\nAudrey canes runs the applied politics program at the University of Georgia\nSays the amount of coordination between both state parties and their ...\nAudrey canes runs the applied politics program at the University of Georgia she says the amount of coordination between both state parties and their candidates is the highest it's ever been and will probably continue past the twenty teen midterms\nThe circumstances around the election coupled with polarization coupled with nationalization of the campaign has increased the need for perhaps the party to be involved\nPolls show Abrams in a tight race with camp in addition to the governor's mansion Republicans control both chambers of the Georgia legislature and all twelve state wide elected offices but for democratic ... success won't be decided by election results alone\nI Want to see a great turnout honestly people voting who hadn't edited before like young people are people who just weren't registered to vote for whatever reason I Want to see every Democrat and going county getting out\nEarly voting numbers are encouraging in person and absentee male and data show many more Georgians are casting their ballots than the previous terms and twenty fourteen for G. P. B. News I'm Stephen Fowler at Atlanta\nSupport for G. P. B. programs comes from our listeners\nAnd Ogle Thorpe University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available at ... dot edu\nAnd Hartsfield Jackson airport offering a new ATM rewards program participants can earn points for parking dining and shopping and redeem them for miles hotel stays in more complete information at ... dot com slash warts\nAnd Callaway resort and gardens Georgia's authentic outdoor escape\nCallaway offers twenty five hundred acres of hiking and bike trails lake fishing PGA level golf and more more information in Callaway Gardens dot com", "show_name": "Marketplace", "year": "2018", "city": "Carrollton", "day": "29"}