{"month": "10", "state": "NY", "station": "WAMC", "content": "Jim Brits financial dot com travels with Sarah organizing private African safari with authentic tempted camps and lodges accompanied by Africa specialist Sarah Kearns Sayre signature safari dot com\nAnd from empire report a political news aggregation site providing coverage of politics media and the culture throughout New York state and why empire report dot com\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W are you an HD Ninety points reruns and Utica W am cage de nine point nine Kingston W. O. S. R. H. D. Ninety One seven Middletown double UCLA HD Ninety One nine Plattsburgh WC an HD Ninety three three ... W. A. N. C. H. D. one oh three night talk on the road got W. A. M. U. H. D. one in five\nOne great Barrington W W E S H da da point nine now ... W. A. N. D. H. D. Ninety point one Stanford W ANR eighty eight five Brewster WAMC am fourteen hundred Albany on this episode a studio three sixty\nToday I punch a baby boomer in the face\nA new dark satirical novel called boomer one amps up generational pension today he punched back\nTomorrow he won't millennials versus the baby boomers why can't we all just get along [noise] plus [noise]\nFrom Argentina the cutting edge singer songwriter Juana Molina performed live right here in our studio um\n[noise]\nThat and more today on studio three sixty\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\nLive from NPR News in Washington I'm Barbara climb secretary of state Mike Pompeo has met with North Korean leader Kim Jong un and young young NPR's Anthony Kuhn reports this pump pale makes his way home he's stopping in Seoul in Beijing to brief official\n... and a half hours of talks with Kim Jong un Kim that hosted palm pale for Ninety minute lunch at a state guest house on arrival in Seoul Pompeo told president Moon Jae in that his talks with Kevin been productive and that he had made progress\nBut he offered no further details as to whether he nailed down a time and place for a second summit between him and President Trump or about either side's demands the U.S wants North Korea to hand over an inventory of its nuclear weapons programs North Korea wants sanctions on it lifted\nAnd a peace treaty formally ending the Korean War Anthony Kuhn NPR News Beijing\nPresident Trump is holding several campaign rallies this week as he fights for Republicans to maintain control of Congress as NPR's Tamara Keith reports the president's started last night in Kansas by touting the confirmation of Supreme Court justice Brett Kavanaugh\nPresident Trump says the one we delay in the confirmation vote for Kavanaugh turned out to be a great thing he told cheering supporters at a rally in Kansas that Republicans have been energized by the fight something that is reflected in recent polls\nTrump said his backers could show how they feel about it by voting in the midterms is November if\nThe wrong people get into office things could change\nHistorically the president's party take the drubbing and the first congressional elections after he takes office one question is whether the GOP enthusiasm in recent days will last democratic enthusiasm has been elevated ever since Trump's election camera Keith NPR News\nIn northern Haiti eleven people are dead after a five point nine earthquake struck last evening NPR's Carrie Kahn reports\nThe ten most struck early evening Saturday in the northern most province of Haiti toppling at church and homes in several cities as well as damaging an auditorium and the police station and the town of Puerto pay the quake was felt more than a hundred miles away in the capital Port au prince where no major damage has been reported\nIt was also felt the neighboring Dominican Republic and in eastern Cuba\nHaiti is vulnerable to strong quakes and given the poverty in the country most living tenuous structured that lead to higher casualties\nIn two thousand and ten a seven point one quake struck near the country's capital killing more than two hundred thousand people and causing billions of dollars in damages and housing and other infrastructure nearly a decade later much of the capital has still not fully recovered Carrie Kahn NPR News\nThis is NPR\nSupport for NPR comes from NPR stations other contributors include Baird providing global financial resources and market expertise to clients the world over our W bears dot com has more information\nAnd the Robert Wood Johnson Foundation at our W. J. A. R. dot org this was a WAMC news up there aren't blogging shields at this hour running works the police are members\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nTwenty people a limousine with Eighteen members of a wedding party collided with another vehicle at the intersection of route thirty and thirty a near the apple barrel country store go here we town supervisor Alan ... says it has been a dangerous intersection for years in fact tractor trailers were banned by the state's several years ago\nThat seems out there's only one or two go down there they are able to live on that on that section of road so that's that help but I'm Still a dangerous intersection I'm sure that was Dr rare involved to it's hard to tell the loss is\nLost his breaks or if he just didn't realize you know the road and then realized that was at the intersection there that he was coming up as there is no skid marks coming into that intersection\nPolice have not released the identities of those who were killed pending notification relatives again twenty people were killed when a limousine with Eighteen members of a wedding party collided with another vehicle that was yesterday afternoon in the ... go Harry counting in upstate New York\nIt occurred route thirty and thirty a newer popular tourist location the apple Barrow country store Governor Cuomo issued a statement this afternoon pledging all help from state agencies as\nPart of the investigation and he praised the emergency responders who were on the scene yesterday are Lucas Willard is out the briefing up this hour a troop drink headquarters in them and we'll have updates throughout the afternoon this has been at WAMC news updates\nGoing to be able to sixty and I'm sitting on the steps of believed him or his level of ours is ... vegetables I like to have the roasted chicken baseball game will do\nAnything is all about timing I tried to get a little bit away from the actual subject was insecure place [noise] duty as raising his coach Anderson\n\n[noise] if you were in your teens or early twenties in the late Nineteen sixties and seventies [noise] a lot of your motivation to grow your hair longer drop acid or whatever was about rejecting the lifestyle choices are values of your greatest generation parents [noise]\nSo I guess it's karma that today as those baby boomers children are in their twenties and thirties there is a new generation gap\nMembers of both generations feeling some mutual resentment and disapproval here are some actual recent ... made the news headlines [noise]\n\nBaby boomers are the worst generation millennials demeaning me generation the baby boomers are what's wrong with America's economy how millennials are ruining\nThe workforce are baby boomers each generation of sensitive millennials are entitled ... blaming don't blame the boomers how baby boomers destroyed everything [noise]\nIt's that rift that's at the center of a new novel by Daniel Tour de called boomer one [noise]\nToday I punch a baby boomer in the face that's one of the novels main characters mark Brumfiel the thirty year old who loses his Manhattan magazine job moves back into his parents' basement in Baltimore and takes to YouTube to rant about it all in this his first video manifesto\nI punched a baby boomer in the face today he punched back\nTomorrow he walked\nThis is the first boom or ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot EDU\nHas boomer boomers in the years ahead\nThere will be much more to say in the days ahead but today I Want to do two things\nHaving already punched a baby boomer\nI Want to tell you a story and I want you to think about just where you sit and enjoy yourself\nIs video goes viral you make more of them and inspires copycat video then eventually insights a whole movement of millennials who attack boomers and boomer icon\nJim Morrison headstone is smash the sludge Davidson Darryl welcome back to fresh air I'm so excited to be able to talk with you again or reverse the studios vandalize gentleman\nCarrying\nStephen king's house in Maine is down in ... [noise]\nNow to take us out of the things the rock from the finger legs\nSketches feature to a group of bore singing sisters one of them\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd rigorously tiny hands and perpetually going way off script [noise]\n\nThing\nFor those of us old enough to remember the real war as well he was this accordion playing bandleader who had a variety show on TV from the early fifties to the early eighties\nAnd he had this curious Eastern European accent he'd been born and raised in rural North Dakota but in this German speaking community as a child in the Nineteen sixties I remember both sets of mine to brass good grandparents were watching the show on Saturday Night prime time ABC\nAnd talk about generation gaps to me at the time ... was the epitome of cheesy and David and square which is exactly how Paul folks dealt about the show is ...\n... now teaches media and communication at New York university and the colleges Staten Island and for our future called guilty pleasures he talks about how his opinion shifted a hundred and eighty degrees [noise]\nAs a kid I remember my grandfather a cattle farmer in South eastern Iowa he was a very quiet man has to turn would be that\nWould be the best word\nProbably Saturday evening is when\nHe watch T. V. when Laurence welk came on\nWe're happy you could join us that we have a full menu of champagne music gentleman went to\nThe first thing of course is the hair the over the top\nHair styles that sets were just so you know so colorful and the costumes of course are full color\nAnd then the singing they're just so sincere and of course today sincerity is not hip not [noise]\nMoran spoke his corny and cheesy but that's part of what what's great\nI call it my guilty pleasure\nBut I don't feel about it actually I think it's cool the whole idea of camp\nIs your perspective more than the actual content so you can watch it as camp you can watch it in in this ironic fashion that's something that I still enjoy it in this ironic fashion I find it hilarious still but I came to love it is more than something to laugh at\nAll a very fine of Cardenas my on the floor and all of the champagne music makers jamming with at all time favorite stumbling fun [noise]\nFirst thing you notice about Lawrence Welk is just really strange\nEnglish wasn't his first language\nIn Sherman was his first language and that's why he has this weird accent\nI felt a little bit kind of water on the show\nHe carried a ton and he played the accordion\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nThis is what's so great about the show is there's this connection to people's immigrant\nDiversion America happened famously many fields government education entertainment and here's one Irish men who is pretty well known for his grade attend our boys of course I'm speaking of our own Joe feeding of course I\nPlay into whatever their immigrant past cliche so he's wearing a green suit and he's singing my Irish rose\n\n\nThere's this point where he holds the microphone for him to kind of\nGet him to raise his voice [noise] to a higher note\n\nSo there's this great rapport between them [noise]\n\nAnd then at the end he says [noise] listen to this\nWasn't that night said he would let a German player for an Irishman\nHere [noise] referring to himself as a\nGerman but of course is a German American there's a recognition that America of course is the land of of immigrants\nThis is something that has been often lost in our contemporary rural America I think\nThe gentleman I'm wearing the official of the future farmers of America\nThis is a modern foreign and he's the Norwegian when Laurence welk refers to him\nThis is a national organization of some four hundred thousand high school boys on the farming areas of America\nAnd this was a group that every kid they grew up in a small town like my father my father was a member would belong to the expectation of course was that that you would become a farmer eventually\nAs well [noise] you know since the Nineteen sixties Nineteen seventies rural America has emptied out\nThe town that my father grew up in er my grandfather farmed it's a ghost town that's why there's a certain melancholy to this show and to the program [noise]\n\nOr one of the act I remember on the Lawrence Welk show is the tap dancer Arthur Duncan was one of the first African Americans on broadcast\nTV [noise] [noise]\nSo here Arthur Duncan is tap dancing [noise]\nThe women are singing and looking on his tap dancers [noise]\nArthur Duncan was key to kind of preserving that very much African American cultural tradition Laurence welk considered him part of the family\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nDanced with white women [noise]\nIt was seen as completely normal this is back in the sixties and seventies when\nThere's still a lot of discomfort with racial integration this was a time when I was going to school and there was a lot of protests about integrating the schools so in in a subtle way he's challenging this [noise]\nBottom rung [noise] thought to be\nIn this scene is basically a Thanksgiving dinner table\nWhere they're all sitting around and they started singing this beautiful song be thankful [noise]\n\nAny [noise]\nThey're sitting at this table there's Arthur Duncan the you know all the food is there [noise]\nYou have to [noise] spotlight coming down as if from heaven\nOn the front of the table where we're Jimmy Roberts is singing\n\nThe song be thankful was written by ... Taylor who was a Jewish New York\nThis song is a recognition that everything you have if you are a believer comes from God so you should be thankful that you are so blessed to have what you have\nOf course the implications for me are that you should reach out to help others\nOr\nThis particular scene I think it's just so powerful because it it has this kind of utopian vision of family that\n\n\nThat is one of them are performing could still go it's from your new album halo a widow the insurance on guitar keyboard and they're all goes in public on ... on ... yes [noise]\nUm it's kind of a family business your father or maybe rest in peace he recently died yes ... a with a very well known a tanker musician yeah in the country of ... what did he make of your music\nAt the beginning he he always thought\nIt was a genius how genius you are I may be so a self conscious about being a genius without any skills so and\nShe may be too self conscious about what we did what we did and so we couldn't just start with a very bad bound and play anywhere because that was really bad we need to start an ... an\nIrate failure rate's actually\nExactly so I I feel that I didn't have the time to learn from\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nA comedian I Know just to make money to to be able to pay my rent and on and pay my guitar less really ... and that was\nThat's what I read that and and and what are the videos of you being this big comedy star with your own show at age thirty one\nUm in fact we have a clip of you from your big show or in the early nineties um wanna set of mind and in this episode you you're playing a panelist on a TV talk show who talks on and on without ever getting to a point\nAnd they know and [laughter] [noise] but other than that ... ... yeah gone finances they say [laughter]\nWhen I said\nSo acting and and comedy that that that began just as a day job to try to\nI guess I I said okay I can do this I Know I have this character that I can impersonate 'cause I thought I knew I really want to make music but how can they afford to play music all day long without having to work all day long how can I Do that and ...\nThat that has to pay but then I go\nI said well you're a star and that was when everything was kind of forgotten and meaning that I was caught in my own truck because I had found the solution to be able to have money to play music and then the solution became the main thing\nAnd and then when they realized that what's happening I stopped everything we were in yes had already passed but it's\nSuch a admirable a presence of mind and fortitude to say no I'm giving that I'm giving that start 'em up to go back to what I Want to do that that's kind of extraordinary\nBut I just asked him I had been wanting to do this\nSince I was really little girl right on I thought I pictured myself in the future laying in bed\nBeing really old watching videos on MTV and being really angry I could I could do that I could have been I could I Would have done it better that sucks oh I hate them off or something like that\nSo your first time comes that you're you're not kidding you're you're thirty something um did you feel as though\nOK I'm Glad I'm doing music at this age rather than young because I Do experience that are known to be hot now [laughter] no no no I'm always\nRegretting not having hot that both to do it really yeah even though the regular balls to quit the TV yeah All right um yeah actually that started when I was when I wanted to do that\nTwelve huh [noise] we have another clip of you are in and this is your life what I'm only a from a Nineteen sixty seven or single or co written with your father this is one of Molina at age ...\nJust saying I Am ...\nAnd ... you\nKnow again the ...\nSuper cute thank you [laughter] and and it was kind of a hit right it was it was for the mother said uh-huh on my dad and never\nTold me there were people at the studios so everybody was hidden in the dark sneaky I nearly staged father I just couldn't open my mouth infant to anybody else on my sis tie that and that was it\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu young\nRCA Judea to be in we're not that old ... total darkness and the technicians working with little lamb I don't know how they did but I thought we were alone and that's how I could do wow yeah you're playing in the United states\nThis fall on this tour where else are your friends are they everywhere or do you are just argue huge in Luxembourg or how where where's your fan base\nI Know I\nMy biggest fan bases in Argentina uh-huh\nAfter all these yes 'cause we didn't love you for a while now because they didn't even listen to me because I wasn't actually you are an actor oh I bet you can't change like ... that was the main thing\nNow there's a generation that didn't never saw exactly Ira yes now I have a very young new generation going to the show and I am so thankful that gets us the best audience you can have a good um can you and the band play another song\nOh we can if you want to go and what will it be as\nWe could play that other things which means never say right [noise] [noise] [noise]\n[noise] [noise]\nDino na\nNa na na na na na na na\nNa\nThey're they're they're they're they're they're they're they're they're they're a\nMy think\nThings were not\n\n\n\nThey will\nDon't\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]", "show_name": "Studio 360", "year": "2018", "city": "Albany", "day": "07"}