[{"month": "10", "state": "NY", "station": "WAMC", "content": "Banks to Bryan strap and then John Callahan of the New York state canal corporation [noise] read author of the New York state museum\nJim handler Rensselaer Polytechnic Institute\nAnd author Carol sheriff inject Kelly for all or how\nUntil next time [noise] ... [noise]\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany\nW arguing HD Ninety point three rooms and Utica W. A. K. HD Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. A. N. C. H. D. one oh three point nine tie kind of rogue WM cue HD one by one great aren't in\nW. W. E. S. H. D. idiot point I just go W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight point by Brewster and WAMC am fourteen hundred Albany\nSupport for WAMC come some clear yoga right back working to help develop strengths stamina flexibility and peace of mind through the practice of a young girl yoga classes for all abilities seven days a week clear yoga right back dot com\nThe blue marble a world of gifts on north part of the street and cameras to endorse marketplace Northampton offering a hand selected collection of jewelry scarves pottery law art and gifts the blue marble doctors in Albany pro musical presenting box bliss featuring acronym baroque string ensemble and the boy courts\nHis aunt Albany ... music uh presenting box bliss featuring acronym baroque string ensemble and the boy course stirs of the cathedral of all saints this Sunday three PM at Troy savings bank musical Albany ... dot org\nThis is WAMC News I'm Jim ...\nThe mega millions jackpot is now up to nine hundred million dollars lottery officials raised the estimated prize today less than a day after another drawing ... without a winner\nIncreasing the prize to eight hundred sixty eight million dollars the next drawing is set for friday the estimated jackpot for that drawing would be the second largest lottery prize in us history\nLeaders from the European Union in Britain shrugged off a weekend negotiating debacle in previous deadlines today giving themselves several more weeks to clinch a friendly deal ahead of their separation\nAfter the you insisted for months that today's some it was a key meeting to get a deal it's breaks it negotiator said he needs much more time to work with is British counterpart\nToday is the last day to register to vote in Massachusetts to participate in the November ... election WAMC ... reports\nThe election officers in the city and town halls across the state will stay open until eight PM Springfield election commissioner glass or you'll Lopez said voter registration can also be done by mail if post Marc today and online at the Massachusetts secretary of state's website until eleven fifty nine pm\nThat seems to be the easiest way and you can join via smartphone or a computer so if you don't have a computer don't have access to a computer you can start filing for many people have\nMassachusetts has a new automatic voter registration law but the system won't be implemented until two thousand twenty Paul taught he'll WAMC news\nOn Wall street a short time ago the Dow is down twenty three to twenty five thousand seven hundred Seventy for\nThe ... up five to seven thousand six hundred fifty one and the U.S and the five hundred is up for points to two thousand eight hundred fourteen in the forecast mostly cloudy and windy with scattered showers today temperatures falling from the fifties to the forties\nMostly cloudy and windy with scattered rain showers and some snow showers in the mountains tonight lows in the upper twenties and thirties\nA freeze warning in effect from midnight tonight to nine AM Thursday\nFor the Hudson River valley from the ... area up through the capital district including the Saratoga and Glenn falls areas and for a Washington and southern which field counties\nMostly sunny and breezy tomorrow ties in the mid forties\nAt last report mostly cloudy and forty seven in lake George New York light rain and forty eight in Bennington, Vermont cloudy and fifty in Pittsfield, Massachusetts and it's cloudy and forty nine in Albany support comes from Hadley garden center Hadley, Massachusetts locally owned and operated\nFor over fifty years with indoor and outdoor plans of gardening supplies bird feeders and seeds organic fertilizer ended voice Hadley garden center dot com more WAMC news coming up at three thirty uh northeast report\nSupport for WAMC come some spirit house Amherst, Massachusetts a family owned wind and spirits retailer for over forty years providing products from classic new labels spirit H. A. U. S. dot com\nAnd cold and it Hartman architects servant clients throughout New England and New York was architecture designed for resilience and renew ability designed for the next hundred years C and D H architects dot com [noise]\nOf the woman behind how her the vote\nOut now\nStreaming support for WAMC come from ... bio mass woods to warmth homes and businesses wrote the northeast today's soap stoking automated would heat would boilers dot com\nIt's much harder to create that changed\nMe one woman who was placed in an internment camp during World War two and here from another who use for notes to find her plates in this world I'm Alison down and this is fifty one percent [laughter]\n\n\n\n\nHow her New York state wide network of more than one hundred organizations have banded together to ensure that women's voices are magnified and the women vote in the November elections the nonpartisan initiative power the vote aimed to protect and expand women's right to New York\nGalvanized by the women's marches me too movement and federal assaults on progressive policies that social media campaign hopes to inject key issues into the public debate ensure that candidates address issues of important to women and Dr voters to the polls on election day in November\nHow her the vote launched on primary day which was September thirteenth and the initiative spotlights various issues each week leading up to the general election in November sex with expert blog social media region online forums focused around power her New York's ten questions to ask candidates\nTopics include childcare better jobs in equal pay reproductive rights violence against women criminal justice leadership and diversity\nI spoke with the president empower the vote never really knew felt\nOur really grew out of equal pay campaign that the advocates started at eleven years ago in New York and we were working to raise awareness and to push change it to close the wage gap which I think it was not a topic a lot of people were talking about\nThen and um we've really have done that and made some improvements but what happened along the way is that we realized attaining co pay is actually quite complex\nUm you know for women to thrive they really need like supportive so workplaces they need to be safe at home in the workplace and on the streets they need to be able to determine when and if they have families so\nThe idea of equal pay campaign transformed into a much bigger idea which I'm turned into power in New York I'm wearing a diverse intersection network of\nOrganizations across the state and individuals and a lot of us are working on different issues but we're collaborating because we see a commonality and we had a shared agenda in a shared goal and that's women's economic quality in New York\nSo with that as a platform how did you arrive out working toward the November election empowering the vote\nSo um you know panel her works to educate engaging and we advocate so\nWe've done that successfully and we've been pushing a progressive limits agenda\nAnd you know we've passed good laws we've changed um harassment policies and New York city and around the state but it has not been easy and we know that like leadership really matters\nSo looking at the election we saw that as an opportunity to talk about our issues to spotlight what matters to women we're strictly nonpartisan um but we found a way that we could talk about our issues or join the election season and we call it tell her the vote because we want\nUm but we found a way that we could talk about our issues during the election season and we call it how her the vote because we want people to think about women's issues um when they go to the voting booth and we want to encourage them to go to the voting booth I don't know if people are aware but\nLike only thirty four percent of voters actually cast their ballot in the last off year election in New York I'm In New York is like I think on the bottom of of the states in terms of voter participation so\nWe see see this is a real opportunity to to build on the energy that there is out there right now on to get people I'm aware talking and get candidates and future elected officials listening\nYou're not endorsing candidate we don't endorse anybody but we'll talk to everybody about\nUm you know things like better jobs and fair pay or violence against women childcare sexual harassment equal pay\nYou know the really the plight of immigrant women in our communities um criminal justice and\nSome of the people that I think are very interested in right now is around women's leadership because so many women are taking up um the gauntlet and they're running for office which is a sort of an ultimate of of leadership in our country so um that's how we're approaching this\nThis US government news real shows weld interests children happily drinking milk inside a World War two internment camp [noise]\nEmphasis was put on the health\nCare of these American children of Japanese descent\nSally pseudo was there she recalls a different reality\nThe buildings were so terribly built that the sand would actually come through you know the tar paper and settle all over\nOn your food and everything and that was your food to eat so you did the best you couldn't if what you could and then you'd go back to your room and everything would be covered with that very fine sand\nPseudo who now lives in Minnesota was six years old when the government pride or family from their Seattle a home\nWell all I remember is there was a lot of confusion and I could see the stress on my parents' part\nIt was spring Nineteen forty two just months earlier Japan a bomb Pearl Harbor prompting us to enter World War two anti Japanese sentiment surged so president Franklin Roosevelt signed executive order Ninety sixty six\nMilitary authorities therefore determined that all of them citizens and aliens alike would have\nThe order for us to a hundred and twenty thousand Japanese Americans into internment camps including pseudo family\nFirst attention was given to the problems of sabotage and hasn't been off no\nSan Francisco for example\nThey were afraid of acts of espionage sabotage of which none was ever committed by any person of Japanese ancestry in the United states\nWhen the government center family away they wrote on a train with armed guards to desolate area in southern Idaho\nWhen we get out we see nothing but sand and sagebrush in Greece would I mean we're obviously in a very desert like area\nHer home in the camp blacked running water electricity consisted of single light bulb hanging from the rafters pseudo spent three years that the internment camp\nWe always open every school day by saying the pledge allegiance to the flag and you know it's kind of ironic that we would say and liberty and justice for all and here we are in these prison camps\nOne of her older brothers enlisted in the army in Nineteen forty for his knowledge of the Japanese language placed him in the military intelligence service language school which was located at Fort smelling in Minnesota\nPeople like my older siblings they went to a Japanese school after regular school it's just like I'm Jewish kids go to Hebrew school that kind of thing\nAt the time fewer than a hundred Japanese Americans lived in the state gimme to knock a is a historic interpreter with the Minnesota Historical Society\nIt's likely that Minnesotan had never really even interacted with anybody who would have Japanese that sent\nThe military language schools changed that they brought more than six thousand soldiers to the state after the war language school veterans helped grow Minnesota's Japanese American population to more than a thousand pseudo his brother was among them he bought a house for the family in Minneapolis near many uh falls\nWe were the first Japanese to ever move into that neighborhood uh we got hate mail to begin with we don't want any gaps in the neighborhood you know get out or else\nHowever the Lutheran Church\nMove into that neighborhood uh we got hate mail to begin with we don't want any gaps in the neighborhood you know get out or else\nHowever the Lutheran Church across the street welcome them\nI think it was through them that we were able to adjust as well as we did\nBut first pseudo who's now ... to ... and lives in a diner the psychological effects of the internment camp stayed with her for decades\nI grew up with that feeling that there's something wrong with being Japanese I kind of look down on it\nPseudo didn't embrace trip in a city until years later\nI think people today they need to know how easily or something like this could happen again because the next time it could be\nFurtive I'm Joey Peters\nThe mayor of a socket Japan says he's ending at six decades sister city relationship with San Francisco to protest that statue honoring women forced to have sex with Japanese soldiers during World War two\nTo San Francisco examiner reports that Osaka mayor here ... sent a letter in early October to San Francisco announcing he's withdrawing from a largely ceremonial relationship\nThat statue was erected on city property last year by California's Korean Chinese and Filipino communities\nA spokesman for San Francisco mayor London Breed called you'll see more its decision unfortunate and says the city's will remain connected through people to people tied historian say tens of thousands of so called comfort women around Asia were forced to work and brothels for Japanese troops it remains an open rift between Japan and other Asian nations\nCalifornia has become the first state to require publicly traded companies to include women on their boards of directors governor Jerry Brown approved the legislation September thirtieth that forces changes a California based corporations by twenty twenty some European countries including France and Norway already require corporate boards to include women\nAre forced to publicly held corporations with headquarters in California do not have any women on their boards of directors state senator ... Jackson says having more women on board will make companies more successful that Santa Barbara Democrat author the measure\nThe California chamber of commerce has argued that the composition of corporate boards she'll be determined internally not mandated by government\nThat chamber says the new law prioritized gender over other aspects of diversity [noise]\nAs a woman in her twenties mandate golf brings up a piece called musical contemplation she uses her experience with music as a metaphor for trying to find her plates in the world Trade Center judges music and words as part of her journey\nMost teams have time to get up and without any training at nine and hugged around\n[noise] God and he changed ... trying to I'm waiting [noise] somebody's after ten minutes and put it down and continue making completely ineffective most companies [noise] unexpectedly align appears headed then can ...\nI'm trying to learn [noise]\nPlay very well known for an hour because [noise] had totally easy ... comes to me and him were waiting like an internal principle [noise] Beatty I didn't learn that somehow accidentally coming into the [noise]\n\nA discussion my boyfriend\nAnd coming into the world\nHad a discussion my boyfriend about what questions should be our overarching question though which would mean decision his question was how can it be the happiest ... his decisions essentially slow\nDown and the answer to that question you know I found myself disagreeing with you and then you\nKnow\nThe deepest guiding question for me and how can I get back to life than you did to me and my son I live\nRight on duty in or out of the chaos waiting and and now they [noise] I put grounded mediocrity [noise] train me to the shunning shifting\nLooking to one day maybe sixty days I'm standing in search of unexpected really meaning and purpose\nOf the question becomes how do I gain makes it hard to know every day and then just think that the purpose intentionally\n... how do I find my card to play him how can it become completely [noise]\n[noise]\nThat was Mandy golf with her musical contemplation\nAnd that's our chauffeur this week thanks to Patrick Garrett for production assistant our executive producer is Dr Allen chard talk are the music it's gone when the dark by Kevin Bartlett that show is a national production of Northeast Public radio if you'd like to hear that show\nAgain sign up for a ... that the fifty one percent archived on our website I tell you AMC dot org and follow us on Twitter I fifty one percent radio\nThis week's show it's number Fifteen twenty five [noise]", "show_name": "51%", "year": "2018", "city": "Albany", "day": "17", "locations": [["New York New York", 40.71427, -74.00597], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Northampton", 40.62593, -75.37046], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Troy", 18.24924, -77.60978], ["Albany", 42.65258, -73.75623], ["us", 45.99696, -118.49854], ["Britain", 41.66121, -72.77954], ["Massachusetts", 42.36565, -71.10832], ["Springfield", 39.80172, -89.64371], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["New York", 40.71427, -74.00597], ["Bennington Vermont", 42.87813, -73.19677], ["Pittsfield Massachusetts", 42.45008, -73.24538], ["Albany", 42.65258, -73.75623], ["Hadley", -68.49017, -66.50523], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["New York New York New York", 40.71427, -74.00597], ["New York's New York New York New York New York New York New York", 40.77205, -73.93014], ["US", 45.99696, -118.49854], ["Minnesota", 46.25024, -94.25055], ["Seattle", 47.60621, -122.33207], ["Japan", 35.68536, 139.75309], ["San Francisco", 37.77493, -122.41942], ["the United states", 39.828306, -98.5795], ["Idaho", 44.5002, -114.25118], ["Greece", 39.0, 22.0], ["Fort", 14.60365, -61.07418], ["Minnesota", 46.25024, -94.25055], ["Minnesotan Minnesota", 44.97593, -93.23475], ["Minneapolis", 44.97997, -93.26384], ["Japan", 35.68536, 139.75309], ["San Francisco", 37.77493, -122.41942], ["San Francisco", 37.77493, -122.41942], ["Osaka", 34.69374, 135.50218], ["San Francisco California", 37.77493, -122.41942], ["San Francisco", 37.77493, -122.41942], ["Japan", 35.68536, 139.75309], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["France", 46.0, 2.0], ["Norway", 62.0, 10.0], ["California", 34.68743, -116.78467], ["Santa Barbara California", 34.42083, -119.69819]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["New York New York", "Albany", "Albany", "Northampton", "Albany", "Albany", "Albany", "us", "Britain", "Massachusetts", "Springfield", "Massachusetts", "Massachusetts", "U.S", "Washington", "New York", "Bennington Vermont", "Pittsfield Massachusetts", "Albany", "Massachusetts", "Massachusetts", "New York New York New York", "New York's New York New York New York New York New York New York", "US", "Minnesota", "Seattle", "San Francisco", "the United states", "Idaho", "Minnesota", "Minnesotan Minnesota", "Minneapolis", "San Francisco", "San Francisco", "San Francisco California", "San Francisco", "California", "California", "California", "Santa Barbara California"], "out_country": ["Troy", "Hadley", "Japan", "Greece", "Fort", "Japan", "Osaka", "Japan", "France", "Norway"], "in_state": ["New York New York", "Albany", "Albany", "Albany", "Albany", "Albany", "New York", "Albany", "New York New York New York", "New York's New York New York New York New York New York New York"], "out_state": ["Northampton", "Troy", "us", "Britain", "Massachusetts", "Springfield", "Massachusetts", "Massachusetts", "U.S", "Washington", "Bennington Vermont", "Pittsfield Massachusetts", "Hadley", "Massachusetts", "Massachusetts", "US", "Minnesota", "Seattle", "Japan", "San Francisco", "the United states", "Idaho", "Greece", "Fort", "Minnesota", "Minnesotan Minnesota", "Minneapolis", "Japan", "San Francisco", "San Francisco", "Osaka", "San Francisco California", "San Francisco", "Japan", "California", "California", "France", "Norway", "California", "Santa Barbara California"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com [noise]\nThis is Northeast Public radio WAMC F. M.\nH. D. Ninety point three Albany W. R. U. N. H. D. Ninety point three rooms and Utica WAMC ... Ninety point nine Kingston WLS our age the Ninety One seven Middletown double UCLA HD Ninety One Ninety ... Ninety three three Kennedy\nHarry WAMC age do you want to pre nine taekwondo rogue of WAMC wage do you want to five one great Barrington W W E S H da da na na na Kisco W. A. N. D. H. D. Ninety point one Stanford W a and R eighty five Brewster and WAMC am fourteen hundred Albany\nSupport comes from daughters of Sarah Albany New York providing assisted living transitional care rehabilitation therapy and respite long tournament palliative care for seniors daughters and Sarah dot org\nWoodstock School of art weekly classes at workshops and drawing painting print making and sculptures in climate controlled north light studios led by professional artists would stop school of art dot com for registration\nFrom twenty railroad public has great Barrington Massachusetts seasonally inspired ... now offering traditional woods fired and the pilots and pizza\nCatering menu and ours twenty railroad dot com and from that smoke and north Adams, Massachusetts presenting indie pop powerhouse tune yards with us girls in concert on October thirtieth\nAnd the Jenny holes there and salad in the galleries nonsmoker dinosaurs [noise]\nLive from NPR News in Washington I'm ... we're investigators continue to search for those responsible for sending explosive devices to critics of President Trump\nBelieves in New York City say the white powder inside a suspicious package delivered to CNN is not a biological weapon yours Quil Lawrence reports authorities are still analyzing a total of ten packages\nAuthorities in New York said the packages have been sent to the FBI lab in Quantico, Virginia the head of New York city is FBI office William Sweeney set authorities are treating these packages as potentially live explosive devices but he declined to give new details\nIt is vitally important that we do not inadvertently disclose information that could adverse impact or investigation worry future prosecution\nAll the intended target so far have been vocal critics of President Trump the president has called for unity and an end to personal attacks in public speech those such attacks have been a regular feature of his political rallies Quil Lawrence NPR News New York\nThousands of Central American migrants are continuing their track through southern Mexico towards the U.S border jumpers Carrie Kahn reports while the caravan still numbers in the thousands that size does appear to be decreasing\nThe line of migrants stretched more than a mile on the highway north out of the town of methods to ... thousand spent the night and the town's main plaza\nThe group was headed to the next town some twenty five miles away earlier in the week the United nations estimated the group at about seven thousand people in the Mexican government has had the numbers are significantly smaller\nAccording to Mexico's interior on Foreign Relations department more than Seventeen hundred people have left the caravan and applied for asylum in Mexico with nearly two hundred more returning voluntarily back to their home countries President Trump who has claimed without evidence that the caravan is riddled with criminals\nHead of the U.S midterm elections is planning to send\nStreaming support for WAMC comes from my dog harness dot com and no ... no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nWas notably absent from the show bearing her name today network is there and repeat sober show Megan Kelly today and NPR's confirmed she will no longer be part of the show hosts created controversy after she started dressing in blackface was acceptable who was part of a kid portraying a character during Halloween\nOn Wall street stocks sword after plunging even more of the day before some strong earnings reports bullied investors and to the American raid chief market strategist J. J. Kenny hand says it's\nAlso not entirely a bad thing that we've had such market volatility\nThere was a while there were felt like the or just buying because they just kept going up now I think it makes people will be a bit more selective in their investments\nAll three of the major U.S stock market indices turned around today gaining one and a half percent or more the Dow was up four hundred and one points to twenty four thousand Ninety four the NASDAQ rose two hundred and nine points the standard and Poor's five hundred closed up forty nine points this is NPR\n\nRussian Soyuz rocket has boosted a satellite into orbit it's the first launch since a similar rocket failed to deliver a crew to the international space station earlier this month\nOn to the Russian military the Soyuz to booster rocket lifted off from a launch facility in northern Russia earlier this month the rocket carrying a Russian cosmonauts and us astronaut bill two minutes into launched sending their emergency capsule back to earth the crew landed safely\nThe number of algae B. T. Q. characters on television is up significantly that's according to the media advocacy group glad NPR's Mandalit del Barco reports\nThe new super girl show introduced the first transgender superhero on TV me and now I have a dream or\nGet better I had to back\nOff a new report from glad celebrates the CW network new character as well as the show posts on FX according to their numbers that show has the most transgender series regulars ever\nA number of lesbian gay bisexual and queer characters on broadcast TV it's also the highest the group has recorded but glad is asking the TV industry to ensure that within the next two years ten percent of the theories regulars represent the algae B. T. Q. community Monday and radical NPR News\nEven as retailers Sears is filed for federal bankruptcy protection the company's requesting its suppliers continue to ship it merchandise Sears pointing to the upwards of three hundred million and financing it secured under a tree organization so it can continue to operate through the holidays growing number of manufacturers of a previous issues with\nOther companies like toys are us remain somewhat nervous However I'm jak sphere NPR News in Washington\nSupport for NPR comes from the NPR stations other contributors include the three I O T providing a software platform that enables organizations to deploy artificial intelligence predicted analytics and I teach solutions and industrial scale learn more at the three I O T dot AI\nSupport comes from the ... their mentality providing government to logic and medically focused skin care to the capital region Hudson Valley and surrounding areas since Nineteen Ninety five when it comes to skin this practice is in the age ETA Pattison dot com\nAnd from the Columbia paper providing local news and information for Columbia county in print and online Columbia paper dot com\nWith election day around the corner\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nAbout sexuality disability and more I'm Alex in down in this it's fifty one percent\n[noise]\n\n\n\n\nThis election cycle is being billed as another year of the woman with a record number of female candidates running for office despite increasing representation in Congress however some research suggests women have less political clout now than in the Nineteen fifties from the ways and means Todd kept here's Carol Jackson\nIn Nineteen Seventy two when she was thirty one patch wrote her husband convinced her to run for a house seat in Colorado at the time women made up less than three percent of Congress there wasn't even a woman on Schroeder local school board\nEvery media person would say to me how could you be congresswoman and a mother and I got through about forty of those questions and on the forty first I think I said I have a brain and I have a uterus and they both work\nSchroeder ran on anti Vietnam War platform and she won she spent the next quarter century and Congress women now make up twenty percent of Congress and there are hundreds of female elected officials serving in political office across the country\nBut Duke University researcher Christian gosh said even with this increased representation women as a political group or less powerful now than they were in the Nineteen fifties\nThey had a lot of political clout women voted and they were organized in in in every congressional district so members of Congress are actually listening to what these women's groups were doing\nCautious research shows contrary to popular belief women in the Nineteen fifties were not tied by their apron strings to their jokes during World War too many of them did go to work think Rosie the riveter after the war many women in America joined local and national groups and we're actively supporting causes they cared about\nNone of those sports existed in the Olympics when I went to my first two basketball was an added to Nineteen Seventy six and that was a struggle if you think about it women's marathon was an addict to lady for if you think about women's soccer\nFootball as we know internationally was an added until the Atlantic games women's ice hockey didn't happen until ...\nSo and that took that didn't just happened by accident that happened because women had a United Voice and we went to Washington and we lobbied our congressmen and senators we formed organizations like the Women's Sports foundation and we met people face to face\nBut again that's not the only reason why it and so passionate about sports\n... research shows that women that play sports are less likely to be an abusive relationships more likely to reach for higher education more likely in the job market to reach higher echelons\nAnd just the last two years I've worked on a program to help women transition from elite sport into business\nDown a day of her own also is Aurora games advisory board member\nWe now welcome back to the show Dr Schauer enough bird with her fifty one percent segment force of nature she interviewed Susan Flora who has a history and international educational publishing\nFlora started her own company ten years ago\nWere ... and the idea began with floors need to help her than sixteen year old son improve its vocabulary and performance on the SATs the result was SAT vocabulary the first in a series of interactive card game that challenge players with questions to get everyone talking laughing and learning\nI forgot Flora why she decided to create word to users\nWell you know they say that that invention is a necessity is the ... the reason for everything and in this case it was a\nReason why I created the company my son was studying for SAT's but he was dyslexic and had a lot of trouble he can remember I can see that a lot of trouble understanding that word it in context so I figured there has to be a fun way to help them when they were\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nDinner table and we'd ask each other questions and his dad would ask questions and his brother would ask questions that we credit laughing and talking as along the way we discovered that he actually learned the words and their their meaning so that was how the company was born\nSo you know as a fifty year old woman you know why was starting a business like this particularly meaningful for you you had a long career in corporate you know educational publishing Wyatt fifty one did you decide to adjust at all and and start something entrepreneurial a new\n[laughter] that's a great question actually when I was thirty nine years old I was diagnosed with breast cancer and as you can imagine that kind of rocked my world as well as my family's rolled I um fortunately it was I Am a survivor and survive\nA pretty grueling episode with that but I came to understand that there was a lot lot more in life that I wanted to do\nBeyond just working for a company and they really dreamed of having something that I could do be my own boss come up with all my own creative ideas and\nPursue it the way I wanted to pursue it but still have time to spend with my family so when I\nCame up with this idea for my son [noise] people would come over to our house and say wow what a great idea you really should publish that you should do something with it and also in the light bulb went on and touch [laughter] this is it and that's how that's what prompted me to do it\nIt also was a time in my life where my kids are growing up like was way off to college the ones so he crispy cheesy other ones filing rent hunted so I often think of this is the new baby in the house [laughter] kept me motivated to interested in just I'm engaged with the world\nYes that you found his way of giving back you know two and helping others who are well sure when your same situation you know now that the companies about ten years old I Know you have Fifteen different games now to band as well beyond\nThe SAT vocabulary game what's on the horizon for warranty there's and you know how people using the games that you're making\nWell on the horizon are always new games I'm fascinated by\nSort of quirky information so I'm always looking for something new that I Want to explore personally I think if you like what you're\nYou're writing about her having a writer's right about that it's you're going to embrace it it's going to be easier to sell and I think that people like these little bites negative information so you never know what's going to turn up next to Mike I'm another edition of American trivia or cruel and fascinating facts\nI think what really inspires me the most is the way my customers are the people that bought the games come back to the and tell me how much they like\nPlaying with it I got a letter from someone the other day um it took to it just amazes me took the time to write to me to tell me how she uses the game and\nApparently what she ... she's bought several of them and she ah has\nStarted doing things with her granddaughters to get them to understand how important is to volunteer and they live in upstate Vermont somewhere I don't know exactly where\nThey take a couple of my trivia games and visiting nursing home and I don't sit and talk to a lot of the recipes that may not have people coming to visit them and they she said what's so fun is that it gets\nThe residents who may not be too communicative to start talking and reminiscing and laughing and she said it's taught her ... her grandchildren not just a whole new um appreciation\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nTo me and said that she uses believe it or not the SAT edition with her kindergarten kids and she said you know kids can learn big words we just don't teach them so she has a big word of the week and works all week on one were from the addition to get the kids to use it to understand it to be able to spell it\nAnd then they come home and the press your parents which I find that you're so creative and funded wish that wasn't my kids are good in the class like that so I Do I Need to me and I feel like\nYou know there's one of these the thing is it's so fantastic is that it's you know it's not\nAn app it's not on their phones that they actually talked to one another that they have it you know that they have a car that they actually are sitting at the dinner table or you know I think we're all looking for ways where we can interact with our families face to face again and I just think you know were teachers\nI really was that I well I agree and I think that the the art of conversation is something that we're losing and I think that we're all understanding that we're losing it and we have to figure out a way to bring that back to a different dinner table and put our phones down I've actually even had a couple a retailer suggest that I\nTreat sub science it's this is this is again the phone so I mean and I think that's really important that we no matter what each yard that we can only get you to talk to each other and have flooded the process and we lose something to\nExactly well Susan thanks so much for taking the time to come and speak with us today if you want to know more about where teachers you can go on to their website ... dot com is that correct\nThat's correct that's the right one and Susan for thank you so much for being with me uh this is Dr Sharon ... on force of nature for fifty one percent\nDr Sharon ... cofounder of the personal development wellness company borrowed wisdom in California it Dina Bert ignores the haters who tell her what to do the art and start your own thing spoken word along with essays in pounds on disability I'm sexuality cafe odds Dixie tribal reports\n[noise]\nI'm disabled square and Jewish and so that all intertwined with the work that I Do I\nWas in a basement punk band then I quickly got back into poetry and my first poetry books to three and a half years to write it's called a bird's eye I kind of wanted to have people listen\nTo spoken word a little bit more and if you listen closely enough poetry is music and music is poetry and so I considered myself and I'm using this as a requirement tore word of crippled punk rock poetry because that's the mesh of all of my identities\nYou say I shouldn't be angry way it's got to learn how to manage that we can have\nYour mother having breathing the same way that the winding with dealing with handling here and do their silence live here and I shoot Wayne\nRecently did a book on disability and sexuality it's called wheelchairs what's in bondage tape and it's starting a life\nStreaming support for WAMC comes from my dog ... dot com a no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com", "show_name": "51%", "year": "2018", "city": "Albany", "day": "26", "locations": [["Albany", 42.65258, -73.75623], ["taekwondo", 51.04623, 6.99337], ["Albany", 42.65258, -73.75623], ["north Adams", 39.83665, -105.0372], ["Massachusetts", 42.36565, -71.10832], ["Washington", 38.89511, -77.03637], ["New York City New York", 40.71427, -74.00597], ["Quantico Virginia", 38.52234, -77.29359], ["New York New York", 40.71427, -74.00597], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Russia", 60.0, 100.0], ["Washington", 38.89511, -77.03637], ["Columbia county", 34.00071, -81.03481], ["Colorado", 38.83388, -104.82136], ["America", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["Vermont", 44.00034, -72.74983], ["California", 34.68743, -116.78467]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "north Adams", "Massachusetts", "Washington", "New York City New York", "Quantico Virginia", "New York New York", "U.S", "U.S", "U.S", "Washington", "Columbia county", "Colorado", "America", "Washington", "Vermont", "California"], "out_country": ["taekwondo", "Mexico", "Mexico", "Mexico", "Russia"], "in_state": ["Albany", "Albany", "New York City New York", "New York New York"], "out_state": ["taekwondo", "north Adams", "Massachusetts", "Washington", "Quantico Virginia", "Mexico", "U.S", "Mexico", "Mexico", "U.S", "U.S", "Russia", "Washington", "Columbia county", "Colorado", "America", "Washington", "Vermont", "California"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "\n\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany when you are you an HD Ninety point three runs in Utica W am cage de Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown WGLA HD Ninety One point nine Plattsburgh WC a an HD Ninety three point three Kennedy Harry WAMC age do you want a three point nine to ... WAMC ... five\nPoint one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC age the Ninety point when Stanford W ANR eighty eight point by Brewster\nAnd WAMC am fourteen hundred Albany\nFor WAMC some some of the open door bookstore Schenectady in New York presenting David Patricia signing T ours last war October twenty seventh one to two thirty PM open door dash bookstore dot com five one eight three four six to seven one night\nAbdullah an independent retirement community Albany New York offering one and two bedroom residences of maintenance free lifestyle and more in private and secure kept the setting\nOf a retirement community dot com and the spot five one eight or weekly arts entertainment and cultural publication for the capital region available online in the stands and Venus the spot five ... dot com\nStreaming support for WAMC comes from my dog harness dot com and no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nIs due to flooding fears even as it dissipates over northern Mexico there were no immediate reports of deaths or missing people both the storms one hundred twenty miles per hour winds damage day hospital knocked out power and toppled homes\nGovernor Andrew Cuomo said they suspicious device was mailed to his office in New York City one of several bombs or bomb like devices delivered to the homes of former Presidents Clinton and Obama and CNN capital correspondent Karen ... reports\nConfirmed at a press conference on the parent pipe bomb sent to CNN that his office had also been targeted\nDevice to my office [noise]\nWe were on the rise is also\nBeing in the ... along with New York city Mayor Bill de Blasio urged New Yorkers to go about their business and not to give in to fear it's created by what he called Terence thug\nWay you do for a daily life\nCuomo and mayor de Blasio did not mention President Trump by name or Trump's recent rhetoric at political rallies that they had all politicians need to refrain from language that insight silence and that needs to start at the top in Albany I'm Karen too wet\nOr Cuomo's spokesperson said later this afternoon at the package delivered to the governor's office contain computer files on the hate group Proud Boys which recently got into a high profile skirmish in New York\nOn Wall street a short time ago the Dow is down two hundred forty nine to twenty four thousand nine hundred forty one the NASDAQ is down two hundred to two seven thousand two hundred thirty five ... five hundred is down forty five to two thousand six hundred Ninety five\nIn the forecast mostly cloudy and breezy with scattered showers today hides in the upper forties partly cloudy tonight lose in the thirties partly sunny and breezy tomorrow highs in the mid forties at last report mostly cloudy across the region forty three and a lake George New York forty one and Bennington, Vermont\nForty two in Pittsfield, Massachusetts fifty in Windsor locks Connecticut and it's forty seven degrees in Albany\nSupport comes from the blue marble a world of gifts on north pleasant street in Amherst and thorns marketplace in North Hampton offering a hand selected collection of juries scarves pottery wall art and gifts the blue marble dot is more WAMC news coming up at three thirty uh northeast\nReport support for WAMC comes some highly guarded center had leave Massachusetts locally owned and operated for over fifty years with indoor and outdoor plants gardening supplies bird feeders and seeds organic fertilizer and advice heavily guarded center dot com\nCalled have been Hartman architects survey clients throughout New England and New York was architecture designed for ... billion to enter into ability designed for the next hundred years she and H architects dot coms\nVilla ... New York helping\nFight the epidemic opiate crisis both locally and throughout the country with specialized programs education and support for men women and families villa very hostile or for inquiries\nAnd spirit house Amherst, Massachusetts a family owned wind and spirits retailer for over forty years provided products from classics to do labels spirit H\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nFilmmaker who delves into the world of same sex ballroom dancing\nThis is about diversity and inclusiveness of of many kinds\nAnd writer Dr Jerry Burns returns with a Halloween story she find rather grim I'm Allison down and then it's fifty one percent\nNever know how much I Love [noise] now I Know when your your mom around me I get to be so hard to say you can\nEnter documentary film hot rock Hudson valley New York based filmmaker gal Friedman brings her audience into the world of same sex ballroom dancing and into the lives of several dancers in more than Twenty years I wasn't award winning filmmaker Friedman has produced directed unwritten dozens of documentaries on a wide range of subjects\nThrough her company pirate productions she has also taught at the Columbia University graduate school of journalism\nAmong her found is making the nine eleven memorial a prime time special for the History Channel which aired on the tenth anniversary of September eleventh when the memorial opened her creative output encompasses independent projects as well as extensive work for a PBS network television cable syndication and the Internet\nAlong with educational and nonprofit films\nFifty one percent ... spoke with Friedman about her new film how she discovered the world and same sex ballroom dancing and asked her to describe the scene\nThe scene is it kind of I'm a little known corner of the ... world even among many members the gay community\nI discovered it quite by happenstance I was I had just finished a remarkably different documentary about the making of the nine eleven memorial in New York City [noise] ah and had spent almost two years working on that and\nMy lead camera man who's another Hudson Valley resident Joe Shapiro Joel and I were casting about for another project and\nNot really coming up with anything and he happened to mention that he grew up in Philadelphia with a girl literally he had seen her since\nThey were a girl and boy\nBut that his cousin told him that she ran some kind of same sex stench group on the west coast um he didn't even know why he mentioned it I\nCan't even tell you why I responded as instantaneously as I did but something in me just had that great big click and I said that sounds really fascinating what more can you tell me and he said that's it that's what I Know and I said well can you find out more and he said no that's what you do\n[laughter] and indeed it is [laughter]\nUm and so I said well tell Barbara or that I'm going to call her\nAnd and so it began and I think initially it was really\nThe joy and the beauty and the fact that it um you know I'd come off of this project that was rooted in an unbelievable tragedy\nAnd so I was looking for something that was more celebratory and so all of that initially it was what attracted me the novelty the beauty the joy the empowerment but the deeper I got into it the more I began to see\nThat there was a lot of nuance than there was a lot of texture and there were a lot of layers and that what these dancers were involved in this whole same sex competitive dance world was small P political as much as it was a ours and sport\nAnd that and I got that from them it wasn't like I impose that on the narrative\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nAnd in this country Europe is getting more advanced than the United states is on this but the main um\nDance organization in America explicitly defined as a couple as a man and a woman and a man leads and a woman follows and that's the rule and they went out of their way to reiterate that rule not long ago and popular shows like dancing with the stars\nAlso do not allow same sex couples to compete they obviously have had a number of el G. P. T. Q. um contestants but\nAlways dancing with opposite gender again I find that kind of amazing and we hope maybe that this film will shake that up a bit so that it was this kind of um\nA free and open life he had to come to the United states and an opportunity presented itself yes\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nThe Nineteen year old um and he'd only ever danced with women he had had a whole career dancing with women and in fact he married his first dance partner and he and she came to United States as young people um\nAnd I think actually I live I don't think they were Nineteen I think they were twenty two because he was out of college but they came here because another Russian had opened a dance studio here and they had the opportunity to teach and to compete\nAnd to live much for your life now Nicaragua's closeted at that point he knew he was gay but he was trying to live in the street world\nUm and that persisted for for quite a long time and even after he\nOstensibly had come out here when we first meet him at the beginning of the film he's still not comfortable in his own skin even though he's in America and he's successful\nAnd he's got a good life but he still is struggling with his identity and with the fact that his family I'm back in Russia has a hard time with this and he can he can sort of barely bring himself to save the word\nGay and I think over the course of the film\nHis arc I mean they all have things that happened in their lives and we went along with that not knowing where would it would lead us but I I think perhaps Nikolai has the most um dramatic personal arc in terms of how he is also the course of the film\nHe ends up someplace have very different than where we first found him but I think for all of them coming to America was as it has been for you know how many hundreds of years an effort to have a better kind of life and you know when I started this film which was in the pre Trump era\nI thought that it would be relevant and resident but [laughter] it turns out to be in ways that I couldn't possibly have envisioned in would prefer not to live in vision [noise] um but it's um [noise] there is I\nMean not only I think our algae T. Q. rights and other civil rights threatened again and our time but there's such a up polarity and to a lack of unity right now and uh and they were at a time of such anger or on all sides that [noise] I think the the film\nSeems to be striking a court or even more than I could have imagined when I began\nThat was filmmaker gal Friedman speaking about her documentary film hot to try she was speaking with fifty one percent Sarah legit and now writer Dr Jerry burn shares her point of view on a potential her\nI heard about something amazing cutting edge and a bit terrifying\nI Can't decide if it's a cool technological advancement or a digital Frankenstein monster so you be the judge you're probably familiar with the names Jacob and we'll him grim day or the famous German brothers who published over two hundred stories in Germany and the nineteenth century\nNow even if you don't know their names or their book you probably know some of their stories many of which are versions of now world famous tell\nStories like rumbled still skiing the frog print Cinderella little red riding hood who the grooms brothers called little red tap and so on\nWell the brothers grin have just published a news story now I don't mean that a lot\nStreaming support for WAMC comes from my dog ... dot com no joke no poll Doug hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog ... dot com\nAnd repulsive me a human being who like the brothers Graham is very much alive\nHere's the intriguing part the story was composed by artificial intelligence billed as the first bedtime story ever composed by a by an organization called button that developed an algorithm like the ones used in phones to compose predictive text\nThe entire body of grim stories would scan for ... phrases style sequences and words human riders and took that information and sculpted it into a rough story which they fed back into the computer program to test for ... absolutely intended\nGrim nests the process went back and forth until eventually story was written\nThis tell the princess and the Fox is the first bedtime story collectively composed by machine and humans it's supposed to be a calming tail but the composition of processed makes it a little too unsettling for my bedtime\nIt's not the collective story composition is an unprecedented thing in fact that's how the oral tradition works stories are reshaped by each tell her some words turns of phrase in storage sequences are recycled one after another to retail existing stories or craft new ones\nThere are building blocks that remain the same from one version to another but the interpretation is unique to each Taylor\nDeveloping good narrative is a process whether done through the oral tradition or at the keyboard by a solitary writer it isn't easy for humans to do that well\nI mean there are many components in the story well computers can predict words and phrases can their algorithms grasp the emotion the courses through a well taught story an aircraft narrative with meaning that audiences can understand what about writing original stories\nNeil Patel over at slate reports that a I can create original horror stories well they're sort of original prompts from humans are needed to help stories began and then the program takes it from there\nBut because the story types don't need to flesh out characters go on literary tangents or delve too deeply into any back story there not too challenging for a I to execute\nThe okay their stories\nBut are they good and compelling the ... of them well felt thin and balled and dare I say it the language sounded predictable but with one considers the stories to be good bad or\nMet the upshot is that a lot can write horror stories which is if you asked me a horror story itself\nBut as for other kinds of stories authored by algorithm were not there yet\nThat's because the technology is still built on language based prediction knocked\nMeaning in one trial and I was fed a bunch of science fiction screenplay from there on the air I concocted its own short screenplay that filmmakers turned into a video it's a short movie called son spring by the production company and cue\nThe human influence as clear in the artful videographer the every character had lines to be actors costumes and camera shots did their best with the material but\nThey were challenged mightily because the story\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nKing or the engine of stories because they are the engine of humanity I fought neck with a newly produced conception the Fox was created there are real human writers who took part in the process to help the new grants bedtime fairy tale makes sense\nBut it's a day should come when it's possible for artificial intelligence to make sense on his own doesn't make sense for us to want that\nTo my two cents don't get me wrong I'm no luddite\nI embrace change and innovation like everyone else with the smartphone for an appendage but in the servants of transparency I should also tell you that I'm a professional storyteller words and narrative are my life\nSo in that in mind I like artificial intelligence have predicted abilities and those combined with my understanding of meaning and symbols inspires some this toll being concerned about this idea\nCould a I recreate narratives from history just like the new grants tell to be presented as fact and used to rewrite the past could a storyteller substitute for an ultimately silence the power of human creativity\nSince stories on their meaning grow our hearts brains and values could a I driven narrative inadvertently were purposely recon figure human culture\nAs you can see ... art scares me kind of like living in a horror story happy Halloween\nDr Jerry burned and that story teller writer and educator living in New York's Hudson Valley you can find her story ... dot com she is co author of the recently published book story twisting a guide to re mixing and reinventing stories\nBurned also as an adjunct professor in the department of communication at the state University of New York at new Paul's\nAnd that's our chauffeur this week thanks to Patrick Garrett for production assistants our executive producer is\nDr Alan ... are the music is low in the dark by Kevin ... the show is a national production of Northeast Public radio if you'd like to hear that show again sign up for a ... or visit the fifty one percent archived on our website", "show_name": "51%", "year": "2018", "city": "Albany", "day": "24", "locations": [["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany New York", 42.65258, -73.75623], ["Albany New York", 42.65258, -73.75623], ["Mexico", 23.0, -102.0], ["New York City New York", 40.71427, -74.00597], ["Albany New York", 42.65258, -73.75623], ["Bennington Vermont", 42.87813, -73.19677], ["Pittsfield Massachusetts", 42.45008, -73.24538], ["Windsor", 42.30008, -83.01654], ["Connecticut", 41.66704, -72.66648], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["New York", 40.71427, -74.00597], ["Villa", 14.48285, -90.53425], ["New York", 40.71427, -74.00597], ["Massachusetts", 42.36565, -71.10832], ["New York", 40.71427, -74.00597], ["New York City", 40.71427, -74.00597], ["Philadelphia", 39.95233, -75.16379], ["the United states", 39.828306, -98.5795], ["America", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["United States", -14.60485, -57.65625], ["Nicaragua", 13.0, -85.0], ["America", 39.828306, -98.5795], ["Russia", 60.0, 100.0], ["America", 39.828306, -98.5795], ["Germany", 51.5, 10.5], ["New York's", 40.77205, -73.93014]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany New York", "Albany New York", "New York City New York", "Albany New York", "Bennington Vermont", "Pittsfield Massachusetts", "Connecticut", "Albany", "Massachusetts", "New York", "New York", "Massachusetts", "New York", "New York City", "Philadelphia", "the United states", "America", "the United states", "America", "America", "New York's"], "out_country": ["Utica", "Mexico", "Windsor", "Villa", "United States", "Nicaragua", "Russia", "Germany"], "in_state": ["Albany", "Albany New York", "Albany New York", "New York City New York", "Albany New York", "Albany", "New York", "New York", "New York", "New York City", "New York's"], "out_state": ["Utica", "Mexico", "Bennington Vermont", "Pittsfield Massachusetts", "Windsor", "Connecticut", "Massachusetts", "Villa", "Massachusetts", "Philadelphia", "the United states", "America", "the United states", "United States", "Nicaragua", "America", "Russia", "America", "Germany"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nSupport comes from the John ... music group with shops in Albany Clifton Park harmonies in Schenectady and did that music unpleasant valley locally owned and operated since Nineteen thirty John Keel music dot com\nAnd from the downtown Troy dead announcing the twelfth annual chowder fast this Sunday twelve to for monument square and downtown Troy over twenty sample chapters music DJ children's entertainment and more downtown Detroit dot org [noise]\n\nThis is Northeast Public radio WAMC up and made the Ninety point three Albany doubled you are you in ... and Utica WAMC ... point nine Kingston W O s are edgy Ninety One seven Middletown\nW. U. C. L. A. G. Ninety One Ninety ... Ninety three three kinda G Harry W. A. N. C. H. D. one oh three nine tie counter real good WAMC which the one oh five one great Barrington\nW W E S H da da na ... Kisco WINZ Eighteen Ninety point one Stamford W ANR eighty eight five Brewster and WAMC am fourteen hundred Albany\nSupport comes from assisted living at the mastery residents that daughters of Sarah Albany New York providing seniors help with activities of daily living friends family community five one eight six eight nine zero four five three nonsmoking north Adams, Massachusetts presenting the December it in concert tonight\nAnd the bunny prints Billy October thirteenth\nNonsmoker data work twenty railroad public house gray Barrington Massachusetts seasonally inspired ... fair now offering traditional wood fired and the pilots and pizza\nCatering menu and ours twenty railroad dot com Woodstock School of art presenting founders Nineteen sixty eight an exhibition with the historic society of Woodstock works by the school's founders plus our colony memorabilia October thirteenth through December fifteenth\nWoodstock School the bark dot org\nAnd from Hadley garden center Hadley, Massachusetts locally owned and operated for over fifty years with indoor and outdoor ... gardening supplies bird feeders and advice Hadley gardening center dot com\n\nLive from NPR News in Washington I'm jak spear\nThree key Republican senators still have not announced whether or not they will support Supreme Court nominee Brett Kavanaugh\nBut as NPR's Scott Detrow explains one of the few remaining undecided Democrats said she will vote no North Dakota Democrat Heidi Heitkamp is in a tight race for reelection and it's one of the incumbent senators most in danger of losing a seat\nBecause he represents such a conservative state high camp was seen as a possible yes on Kavanaugh I Can't voted for justice Neil Gorsuch told North Dakota TV station WD a wide that she's not supporting this Trump nominee\nThe process has been bad um\nBut at the end of the day you have to make a decision and I've made that decision\nAnd that decision will be what senator I Will be voting no on judge Kavanaugh that leaves West Virginia Senator Joe mansion as the lone undecided Democrat with everyone else in the party voting no\nScott Detrow NPR News Washington a group of Republican lawmakers including South Carolina Republican Lindsey Graham are saying enough is enough Graham joining others and criticizing the process and singing FBI background reports on to the Senate does not support allegations made against capping off by women who've claimed be sexually assaulted them decades ago\nSenators who requested the\nCapitol police arrested about three ...\nStreaming support for W. AMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information ... AMC dot EDU\nCriticizing the process and singing FBI background reports ... the Senate does not support allegations made against ... by\nWomen who've claimed sexually assaulted them decades ago\nSenators who requested supplemental\nCapitol police arrested about three hundred protestors today who staged just sitting on the floor the Senate office buildings atrium demonstrators ... unfurling banners reading Christine Ford Ford one of the women who accused ... end appeared last week before the Senate Judiciary committee\nThe fate of a white Chicago police officers charged with murder and the shooting death ... black teen is now in the hands of a jury and ... show quarterly reports that the case that focused attention please use of force and race relations\nThe video of the twenty four teen incidents shows police officer Jason Van Dyke shooting Seventeen year old ... McDonald's sixteen times McDonald was holding a knife at the time during closing arguments defense attorney ... Herbert till the jury to look at the case from the perspective of an officer who feared for his life\nProbably built is not an [noise] video [noise] is not the prosecutor\nJudy Gleason says the shooting was not justified\n... how ... they had ... father ... firing fat\n... said they've already plans in anticipation of the jury verdict Cheryl Corley NPR News Chicago\nThe death toll from an earthquake and tsunami that struck a central I'm going to Indonesia has not risen to at least Fifteen hundred Indonesia's disaster agency for they're boosting the death toll there today the magnitude seven point five earthquake causes massive devastation after hitting last friday\n... stock market ... today the Dow Jones industrial average felt two hundred\nPoints to twenty six thousand six twenty seven the NASDAQ without a hundred and forty five this has NPR\nNational Highway Traffic Safety Administration says it is moving forward with new plans ... provide safety rules barring fully autonomous vehicles from roadways unless they are equipped with features like steering wheels pedals and mirrors\nThat's according to report released today is part of an ongoing public comment period proposed changes the vehicles standards us transportation secretary Elaine Chao says and the report that ... self driving vehicles have the potential dramatically reduce traffic crashes and road deaths the public also as legitimate concerns you about the safety of such vehicles\nNewspaper company trunk shutting its futuristic name was NPR's David Folkenflik report starting next week ... return the named Tribune Publishing over it's two years as trunk that company faced a series of crises\nThat the Los Angeles times the editor ... chief departed after news ... direction the papers publisher was shifted to a corporate job after NPR reported paid settlements of to pass sexual harassment lawsuits against him and they used ... overwhelmingly voted to unionize\nTrunk sold the LA Times and response newsrooms that the Chicago Tribune into Virginia papers also joined unions ... NPR's reporting lead to the ... the top news executive of the New York daily news for sexual harassment too and the company laid off half of that tabloids newsroom\nIn addition trunks controlling owner Michael Cera was also accused of sexual harassment executives did not say what led ... rebranding reports suggest possible buyers are circling David Folkenflik NPR News ... features process took their biggest pungent about seven weeks oil down to point seven percent that close at Seventy four thirty three a barrel\nIn New York I'm ... NPR News ... Washington\nFor NPR comes from NPR stations other contributor\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nCircling David Folkenflik NPR News cruel futures prices took their biggest plunge in about seven weeks oiled down to point seven percent to close its Seventy four thirty three a barrel in New York I'm ... beer NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include ... foods offering color guard for average risk adults over fifty nine invasive colon cancer screening tests that can be used at home by prescription normally information at ... dot com\nSupport comes from first light providing high speed data Internet ... location and voice services to businesses over its own fiber optic network and supported by locally based personnel first light got debt\nAnd from the the dermatology a medical practice specializing in dermatology and determined to logic surgery serving the capital region and surrounding areas since Nineteen Ninety five when it comes to skin this practice has in T H ETA Pattison dot com\n[noise] [noise] [noise] [noise] [noise] [noise]\nWell this week fifty one percent\nWe'll speak with a political scientist she worked to get more women in the field or boy\nWe've been having a lot of women come up to us and say you know I I never said yes to media before but you guys have empowered me to say yes and so now I'm saying yes when journalist one interview me\nAnd we hear about support an advocacy for domestic workers and to access I'm Alex him down and this is fifty one percent\nWhen we're talking about women in science we're talking about physics molecular biology or chemistry those kinds of Sciences but\nWhat about political science where are the female political scientists when it comes to media or academia\nKathleen Charles and fellow female political scientists got tired of wondering and took action ceryl sits on the editorial board of women also note stuff initiative to promote him publicize the work and expertise of scholars and political science who identify as women\nThere is a searchable database to help academics and journalists identify and connect with women academics conducting research on a multitude of issues related to the study of politics\n... and assistant professor of political communication with a joint appointment in the political science department in ... school of mass communication at Louisiana State university\nHer research examines the content of part of the news poll coverage and the influence of emotional appeal in campaign ads\nThe A R I merely made up of of men I'm particularly in the academic side so in faculty positions are still primarily men and political science\nStreaming support for WAMC comes from Albany mid no open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nUm and that struck me as very interesting because traditionally what we we see is that women downplay their feminine attributes because they've been told that those are not part of the political domain and that those are not strategic those won't help them I'm so often women\n[noise] um and that struck me as very interesting because traditionally what we\nWe see is that women downplay their feminine attributes because they've been told that those are not part of the political domain and that those are not strategic those won't help them\nI'm so often women are told that they should up play their stereotypically masculine attributes that they should act more like men do um and then that's how they're successful but I think because of the me too movement because of the the surgeon women running\nUm that there is more comfort around this idea that women can run as themselves a that they can acknowledge that they have both stereotypically masculine an stereotypically feminine trait\nThat all of those are important in politics um and then they can hopefully be sort of rewriting of this narrative that women should run as men that men can run however they want\nThere's a lot to be seen because\nI'm the data we have on this the research we have on this\nIs from previous years where there's not as many women candidates and and traditionally women have not always um\nHow much success depending on the kind of level of their race of course but there is a sort of cultural moment happening at the same time that seems to be empowering women candidates to embrace the fact that there are a woman\nOr that they may or may not be a mom that they may or may not be a have different sexual orientation\nI'm In and talk about that as being part of what makes them a viable for this position part of what makes them uniquely qualified to be in the political demand rather than downplaying that an acting more like a male candidate might and we're seeing a lot of ads that are kind of um\nYou know echoing the same themes that I'm a woman\nI'm complicated I'm not necessarily all the stereotypical than than in trades nor am I going to pretend like I'm the stairs which vote typical a male candidate I I Am in person\nHear all the things about me that make me qualified to run um I I'm just like your you know your neighbor and and I care about this community right um and so that's very different from where\nMaybe we've seen before either women go all the way towards where I'm a mom and I'm I'm you know there's a sort of Patty Murray I'm a mom in tennis shoes image or our candidates kind of shirk all the feminine qualities entirely an ass\nAct more like male candidates I think we're seeing more of a complicated image a emerge from from this moment and it's really interesting to watch but we don't know whether or not that will be successful yet uh I think it may\nKitty what about attack ads are we going to see a change in in those as well in terms of who's putting them out I mean it seems that maybe men have more of the attack ads than women women focus more on their accomplishments or what they'd like to accomplish I don't know that could be completely untrue I'm just asking you what the trends are or maybe\nTraditionally women have been more reticent to go negative because of this sort of fear that that will look I'm not feminine that that will not a comport with how voters like to see women candidates [noise]\nUm but given that we're sort of seeing a all of the sort of traditional those numbers about how women should run being challenged at this moment there is a I I Would say very real chance that we'll see more women go on the negative go on the attack\nAnd and and that's not a bad thing right I think as voters a hero candidates go on the attack as as being an overall a negative thing for us but what we know from the research is that negative ads actually help people learn better than positive ads and that negative ads\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThat we'll see more women go on the negative go on the attack\nAnd and and that's not a bad thing I think as voters a hero candidates go on the attack as as being an overall a negative thing for us but what we know from the research is that negative ads actually help people learn better than positive ads and that negative ads are more memorable\nSo certainly for a candidate a it it's better to have all of those sort of adds an all of those start strategies and your tool box and if you're a woman uh of course you should be able to use both negative and positive ads whatever will help your your base\nMore than most about you and in some cases that might be negative uh in particular if the other candidate is already going negative against you that needs to be in a way that you should feel comfortable responding I'm One of the things we still kind of slipped on its hadn't put he's sixteen is oftentimes\nAh that the kind of ... was that women avoid emotional ads because they don't want to see sort of playing to someone in traits but we actually saw Hillary have primarily emotional ads and twenty sixteen whereas\nA Trump did not have a as emotional adds even though we may think because we think of him as being sort of over the top and and be larger than life\nA surprisingly his ads were primarily policy are much more so policy based than hers um so we might see that in twenty Eighteen as well that a female candidate sort of embrace\nThe strategy of the emotional appeal whether it's a more positive emotions like enthusiasm hope or more negative emotions like anger if you're which also can be very effective\nThat with Kathleen ... assistant professor of political communication with a joint appointment in the political science department and man ship school of mass communication at Louisiana State university\nShe's on the editorial board of women also know staff and initiative to promote on publicize the work and expertise of scholars and political science who identify as women the site also provides a list of websites representing women and other fields and professions\nAnd analysis by the Associated Press finds that many state lawmakers accused of sexual misconduct in the me too era or having success running for reelection or new legislative seats\nRoughly two dozen of the seventies state lawmakers who have been publicly accused of sexual misconduct are running for reelection or another office this year of those Fifteen have already advance to the November ... general election\nKelly did more an assistant professor of political science at Rutgers University says the relative political successive accused state lawmakers suggest that voters are I'm sure how to respond that is true even in states where voters have a history of supporting female politicians and traditionally liberal issues\nNext we'll hear if Pete's from stories from deep in the heart a project of Texans folk life it's about immigration on labor this time domestic labor and a group in San Antonio that supports an advocate for women and that's work\n\n\n[laughter]\nWell I wouldn't like to remember this and so and then ... a group of people around me and promised to pay me a salary and they did not needed their promise [noise]\nNothing you can you can do with the woman told me I Would have everything which should not have to have ideally than enough I mean I did not leave Sundays and doing this I I Would work for Monday to Monday and they'll send you your phone so I didn't have\nStreaming support for WAMC comes from Albany med now open the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd promised to pay me a salary and they did not need their promise\nNothing you know what I'm Talking about that and it don't get woman told me I Would have every ... which did not have to have ideally than enough that he had a ... I did not lead us on days\nWhen it is I don't I Would work for Monday to Monday not than you are you this done so I didn't have brakes know me having that when you eat well either I was very skinny they see a game but your commuter window I felt like she would say that I should eat when her family and has been pressing but when they would leave she checked my dad\nIn France So much a kind of makes you a check everything he and ... and like I Am one called the police come up on the other ... other girls it also works like in the ... and all that stuff\nYou wouldn't have been called the police lemons yes\nWhen I'm forty eight picked me out of ... than me that they rescued me you'd have said without a Sally and I said my mother got that they recognize me and I guess I yeah I guess things to them line here with them back you're going to take as they have the ... very much\nYou just heard the voice of Korea like so many domestic workers she felt isolated and powerless Korea was promised reasonable wages as a made for our family and instead what she did and demoralized\nKorea was freed with the help of domestic asked you need us we sat down with and I say my ... who was an activist for domestic us any of that [noise]\nParis NFL talking about the work they do [noise]\n'cause they're left at work [noise] um\nIs always considered women's work and therefore\nIt undervalued and are not respected and women are not given the dignity [noise] um so that's who we organize a women who clean houses\nIndependently um who take care of the children and people's phones work as many uh those ladies who take care of the elderly and disabled in private homes\nI'm ray are predominantly immigrant women and women of color\nDomestic asking me that offers training for members to improve their work that's also empower the community of domestic workers\nSo we want to give them the tools that will empower them and part of that is communication so we have conversational English classes [noise] uh we have um a\nLawyer writes classes are and then classes to deal with their emotional trauma\nAnd or [noise]\nOr how to do their job that they're doing how the clean for instance using non toxic products to protect their health\nAnd then on children we have a clock coming up uh on how to do childcare the psychological and it's it's very interesting how to de our our immigrant children are being traumatized and how\nWe're going to have classes to help these women who workers nannies respect their child and now the psychological a growth that are kind of goes through and how to treat them\nWhile they do serious advocacy work the meetings are also a time to celebrate\nI remember when there's a woman from Columbia one of our members\n\n\n", "show_name": "51%", "year": "2018", "city": "Albany", "day": "05", "locations": [["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Schenectady", 42.81424, -73.93957], ["Troy", 18.24924, -77.60978], ["Detroit", 42.33143, -83.04575], ["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Middletown", 39.51506, -84.39828], ["Albany", 42.65258, -73.75623], ["north Adams", 39.83665, -105.0372], ["Massachusetts", 42.36565, -71.10832], ["Hadley", -68.49017, -66.50523], ["Massachusetts", 42.36565, -71.10832], ["Washington", 38.89511, -77.03637], ["North Dakota", 46.80833, -100.78374], ["West Virginia", 38.34982, -81.63262], ["Washington", 38.89511, -77.03637], ["South Carolina", 34.00071, -81.03481], ["Albany", 42.65258, -73.75623], ["Chicago", 41.85003, -87.65005], ["Chicago", 41.85003, -87.65005], ["Indonesia", -5.0, 120.0], ["Indonesia", -5.0, 120.0], ["us", 45.99696, -118.49854], ["Los Angeles", 34.05223, -118.24368], ["Virginia", 38.34982, -81.63262], ["New York New York", 40.71427, -74.00597], ["Washington", 38.89511, -77.03637], ["Albany New York", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["San Antonio", 29.42412, -98.49363], ["Albany", 42.65258, -73.75623], ["France", 46.0, 2.0], ["Korea", 36.5, 127.75], ["Korea", 36.5, 127.75], ["Korea", 36.5, 127.75]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Schenectady", "Detroit", "Albany", "Middletown", "Albany", "north Adams", "Massachusetts", "Massachusetts", "Washington", "North Dakota", "West Virginia", "Washington", "South Carolina", "Albany", "Chicago", "Chicago", "us", "Los Angeles", "Virginia", "New York New York", "Washington", "Albany New York", "Washington", "Albany", "Albany", "San Antonio", "Albany"], "out_country": ["Troy", "Utica", "Hadley", "Indonesia", "Indonesia", "France", "Korea", "Korea", "Korea"], "in_state": ["Albany", "Albany", "Schenectady", "Albany", "Albany", "Albany", "New York New York", "Albany New York", "Albany", "Albany", "Albany"], "out_state": ["Troy", "Detroit", "Utica", "Middletown", "north Adams", "Massachusetts", "Hadley", "Massachusetts", "Washington", "North Dakota", "West Virginia", "Washington", "South Carolina", "Chicago", "Chicago", "Indonesia", "Indonesia", "us", "Los Angeles", "Virginia", "Washington", "Washington", "San Antonio", "France", "Korea", "Korea", "Korea"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n[noise]\n\nThis is Northeast Public radio WAMC FM\nEighteen Ninety point three Albany doubled you are you in ... and Utica WAMC ... Ninety point nine Kingston W O s are edgy Ninety One seven Middletown double UCLA the Ninety One nine Plattsburgh WC A. N. H. D. Ninety three three kinda G Harry W. A. N. C. H. D. one oh three nine tie counter rogue WAMC ... the one oh five one great Barrington\nW W E S H da da na ... Kisco WINZ Eighteen Ninety\nPoint one Stanford W and our eighty eight by Brewster WAMC am fourteen hundred Albany\nSupport for WAMC comes from Woodstock School of art presenting founder Nineteen sixty eight an exhibition with the historic society of Woodstock works by the school's founders plus our county memorabilia October thirteenth through December fifteenth Woodstock School of art data work\nData dermatology providing ... chicken medically focused skin care to the capital region Hudson Valley and surrounding areas since Nineteen Ninety five when it comes to skin this practice is in th ETA Pattison dot com\nFrom that match for over sixteen years a locally owned a dating and matchmaking service connecting singles through private matchmaking in western Massachusetts and beyond\nNot match dot com and from blue mountain bistro to go route twenty eight Kingston cafe catering and take out food by chef and author Richard Eric sent home of the new cookbook feel good food open daily blue mountain ... dot com\nLive from NPR News in Washington I'm jak sphere the small Gulf Coast community of Mexico beach may have taken the hardest hit from hurricane Michael even as rescue crews continue to search for survivors and others worked or store power there NPR's Greg Allen says the damages sobering\nMichael was the largest hurricane evident hit this part of Florida the panhandle with a hundred and fifty five mile per hour winds and you can see the evidence everywhere here uh houses that were in under construction are now just sticks\nMany homes are missing their roofs summer missing or siding and their sides fences down most surprising things the trees trees are done everywhere crushing houses\nWhole forest over like matchsticks and also there on the roads making it very difficult to get in and out of Mexico beach and all these other communities down here on the Florida Panhandle\nMichael is now blamed for at least half a dozen deaths across Florida Georgia and North Carolina currently a tropical storm Michael continues to roll across North Carolina and Virginia dumping heavy rain as it heads towards the ocean\nPresident Trump welcome an all star lineup of musicians to the White House today everyone from kid rock to my love of the beach boys to Sam more from the group salmon Dave gathering came as Trump signed legislation overhauling the way music as licensed and songwriters are compensated Sam more so there's been a long time coming for musicians and artists\nThis was a historic moment I'm so proud when Mr Bush was when we shouldn't get it done when we had moved to Obama and we couldn't get it done but we've got to do with this man [noise]\nOf the ... hatch music modernization act to measure creates a new independent entity they will license songs to companies that play music on line the nonprofit collectible than pay songwriters its name for the return Utah Senator who was also a musician [noise]\nAnother wild day on Wall street with the Dow Jones industrial average falling more than five hundred points are\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nInterest rate hikes by the Federal Reserve\nAs stocks yo yo throughout the day White House economic adviser Larry Kudlow tried to sound reassuring he stressed the U.S economy is still in good shape\nBut President Trump complains the Federal Reserve is quote out of control despite the feds ample warnings Trump says he's been caught off guard by the pace of interest rate hikes\nI think the fed is far too stringent and they're making a mistake and is that right [noise] and it's a despite that we're doing very well but it's not necessary in my opinion and I think I Know about it better than they do\nStill Trump says he has no plans to fire fed chairman Jerome Powell Scott Horsley NPR News Washington\nTaking a look at those numbers on Wall street Saddam was down five hundred and forty five points to close at twenty five thousand fifty to the NASDAQ closed down Ninety two points to Seventy three twenty nine the U.S and the five hundred fifty seven points today\nThis is NPR Washington state Supreme Court has unanimously struck down that state's death penalty today ruined it's been used in an arbitrary and racially discriminatory manner\nWashington they just had a moratorium on execution since two thousand fourteen but today's ruling officially makes it the twentieth state to do away with capital punishment by legislative record decree as a result the senses of eight people on death row or converted to life in prison [noise]\nNew York court is going to drop part of the criminal sexual assault case against former movie producer Harvey Weinstein embarrassed rose Friedman reports the drop charge them from actors Lucia Evans one of three accusers in that case\nAccording to a letter from the Manhattan District attorney's office a detective took a statement from a witness indicate that failed to elect de da de meant contradicts the account Lucia Evans had given her alleged assault by Harvey Weinstein speaking to reporters Lincoln's attorney Benjamin Brafman said it really for his client the\nMain witness in the Denver attorney office lied and detective who led the investigation submitted what he believed to be serious criminal conduct\nIt just got back to the prosecution but in a statement the da da da ... had their remaining charges against Harvey when in include predatory sexual assault him next court appearance scheduled for temper rich Friedman NPR News New York\nTens of millions of Social Security recipients will get a boost in their benefits next year following the stretch of low inflation the government reports the annual cost of living adjustment or the cold all go up by two point eight percent next year the biggest gain and seven years that will come out to about an extra thirty nine dollars a month I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nSupport comes from assisted living at the mastery resident that daughters of Sarah Albany New York providing seniors help with activities of daily living friends family community five one eight six eight nine you know four five three for information and tours\nAnd from twenty railroad public has great Barrington Massachusetts seasonally inspired ... now offering traditional would fire near Palestine pizza\nCatering menu and that weighs twenty railroad dot com\nDreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu oh\nBut if they don't speak out now\nCreate an expectation of action and change you know then it's much harder to create that changed\nMe one woman who was placed in an internment camp during World War two and here from another who use for notes to find her plates in this world I'm Alison down and this is fifty one percent [laughter]\n\n\n\n\nHow her New York state wide network of more than one hundred organizations have banded together to ensure that women's voices are magnified and the women vote in the November elections the nonpartisan initiative power the vote\nAims to protect and expand women's rights in New York galvanized by the women's march and me too movement and federal assaults on progressive policies that social media campaign hopes to inject key issues into the public debate ensure that candidates address issues of importance to women and Dr voters to the polls on election day in November\nPower the boat launched on primary day which was September thirteenth and the initiative spotlights various issues each week leading up to the general election in November sex with expert blog social media region online forum focused around power her New York's ten questions to ask candidates\nTopics include childcare better job than equal pay reproductive rights violence against women criminal jumpsuits leadership and diversity\nI spoke with the president empower the boat never really knew felt\nOur really grew out of equal pay campaign that the advocates started about eleven years ago in New York and we were working to raise awareness and to push change it to close the wage gap which I think it was not a topic a lot of people were talking about then and um\nWe've really have done that and made some improvements but\nWhat happened along the way is that we realized attaining equal pay is actually quite complex\nUm you know for women to thrive they really need like supportive so workplaces they need to be safe at home in the workplace and on the streets they need to be able to determine when and if they have families so\nThrough in your community you know working on some of these very difficult issues that we have um you know ahead of us we have to solve childcare it's it's such a such an important issue for women but if we don't speak out now\nUm and ah and make a create an expectation of action and change you know then um it's much harder to integrate that change so it's an exciting time for women I think citing time for New York and um\nWe will um you know a look forward to uh some some we hope some real progress um on these issues in the future now women are really collaborative 'em by nature\nAre in politics is research around this\nI'm so a disk and also um this new wave of women that make him come into office it's not so easy you know to\nTo run against incumbents but there are quite a number of open seats which makes it more likely um for for ... someone outta when I'm but a more collaborative I'm a environment will do well for for all of us\nUm and these are problems that you know people need solutions to 'em so uh we do we need representatives who really understand the problems\nThat folks are having making ends meet the increase in poverty you know uh and are these are these are important times so I encourage everyone to get out there and vote and then to keep up um you know pushing our\nOur representatives to um to take thoughtful deep action um you know to to address the issues that you are having um the problems that you face whether you're in rural New York\nOr and and you know in the middle of the city New York city you know we're we're all we're all facing very similar problems I think\nThat was Beverly newfound president empower the boat which spotlights various issues each week leading up to the general election in November sick with expert blog social media are reaching online forum beach Thursday Afternoon focused around power New York's ten questions through OCS Canada\nLike many Japanese Americans of her generation Sally to do was forced to live in an intern\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu which school at Fort smelling her family moved to Minnesota cafe eyes Joey Peters reports [noise]\nThis US government news real shows welding or as children happily drinking milk inside of World War two internment camp [noise]\nWas put on the health\nCare of these American children of Japanese descent [noise]\nSally pseudo was there she recalls a different reality\nThe buildings were so terribly do that the sand would actually come through you know the tar paper and settle all over on your food and everything\nAnd that was your food to eat so you did the best you couldn't it what you could and then you'd go back to your room and everything would be covered but that very fine sand\nPseudo who now lives in Minnesota was just six years old when the government pride or family from their Seattle a home\nWell all I remember there was a lot of confusion and I could see the stress on my parents' part\nIt was spring Nineteen forty two just months earlier Japan a bomb Pearl Harbor property in the U.S to edge or World War two anti Japanese sentiment surged so president Franklin Roosevelt signed executive order Ninety sixty six\nMilitary authorities therefore determined that all of them citizens and aliens alike would have\nThe order for us to a hundred and twenty thousand Japanese Americans into internment camps included into those family\nFirst attention was given to the problems of sabotage and a spin off now\nSan Francisco for example\nThey were afraid of acts of espionage sabotage of which none was ever committed by any person of Japanese ancestry in the United states\nWhen the government center family away they rode on a train with armed guards to desolate area in southern Idaho\nWhen we get out we see nothing but sand and sagebrush in Greece would I mean we're obviously in a very desert like area\nHer home in the camp blacks running water electricity consisted of a single light bulb hanging from the rafters pseudo spent three years that the internment camp\nWe always open every school day by saying the pledge allegiance to the flag and you know it's kind of ironic that we would say and liberty and justice for all and here we are in these prison camps\nOne of her older brothers enlisted in the army in Nineteen forty for his knowledge of the Japanese language placed him in the military intelligence service language school which was located at Fort smelling and Minnesota\nPeople like my older siblings they went to Japanese school after regular school it just like I'm Jewish kids go to Hebrew school and that kind of thing\nAt the time fewer than a hundred Japanese Americans lived in the state commute to knock a is a historic interpreter with the Minnesota Historical Society\nIt's likely that Minnesotan had never really even interacted with anybody who would have Japanese that sent\nThe military language schools changed that they brought more than six thousand soldiers to the state after the war language school veterans helps grow Minnesota's Japanese American population to more than a thousand pseudo his brother was among them he bought a house for the family in Minneapolis near many uh falls\nWe were the first Japanese to ever move into that neighborhood uh we got hit\nStreaming support for WAMC comes from Albany med that will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nHopes however the Lutheran Church across the street welcome them\nI think it was through them that we were able to adjust as well as we did\nBut first pseudo who's now we do too and lives in a diner the psychological effects of the internment camp stayed with her for decades\nI grew up with that feeling that there's something wrong with being Japanese I kind of look down on it\nSuited and British trip in the city until years later\nI think people today they need to know how easily or something like this could happen again because the next time it could be\n... I'm Joey Peters\nThe mayor of a socket Japan says he's ending at six decades sister city relationship with San Francisco to protest that statue honoring women forced to have sex with Japanese soldiers during World War two\nTo San Francisco examiner reports that Osaka mayor here ... sent a letter in early October to San Francisco announcing he's withdrawing from the largely ceremonial relationship\nThat statue was erected on city property last year by California's Korean Chinese and Filipino communities\nThat folks men for San Francisco mayor London Breed called you'll see more its decision unfortunate and says the city's will remain connected through people to people tides historians say tens of thousands of so called comfort women around Asia were forced to work and brothels for Japanese troops it remains an open rift between Japan and other Asian nations\nCalifornia has become the first state to require publicly traded companies to include women on their boards of directors governor Jerry Brown approved the legislation September thirtieth that forces changes a California based corporations by twenty twenty some European countries including France and Norway already require corporate boards to include women\nAre forced to publicly held corporations with headquarters in California do not have any women on their boards of directors state senator ... Jackson says having more women on board will make companies more successful than Santa Barbara Democrat author the measure\nThe California chamber of commerce has argued that the composition of corporate board should be determined internally not mandated by government\nThat chamber says the new law prioritized gender over other aspects of diversity [noise]\nAs a woman in her twenties mandate golf brings up a piece called musical contemplation she uses her experience with music as a metaphor for trying to find her plates in the world Trade Center judges music and words as part of her journey\nMost he had he can turn to get up and\nWithout any training at nine and hung around [noise] just a huge range tuning\nIn China [noise] waiting [noise] somebody's after ten minutes and put it down and continue to maintain completely ineffective money\n[noise] unexpectedly align appears heavier than can\n... [noise] ... [noise]\nPlay very well known for an hour because [noise] ... totally easy comes to me in any one waiting\nLike an internal printed [noise] Beatty I didn't learn that somehow accidentally coming into the [noise]\nStreaming support for WAMC comes from Albany bed now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWhat questions should be our overarching question though which would mean decision this question was how can you be the happiest ... his decision essentially slow down and the answer to that question I found myself disagreeing with him that night", "show_name": "51%", "year": "2018", "city": "Albany", "day": "12", "locations": [["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["Kingston", 17.99702, -76.79358], ["Washington", 38.89511, -77.03637], ["Mexico", 23.0, -102.0], ["Florida", 28.75054, -82.5001], ["Mexico beach", 18.00202, -87.91274], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Georgia", 41.99998, 43.4999], ["North Carolina", 18.38078, -65.95739], ["North Carolina", 18.38078, -65.95739], ["Virginia", 38.34982, -81.63262], ["Obama", 17.04483, -61.86117], ["Utah", 40.23384, -111.65853], ["Albany", 42.65258, -73.75623], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["New York", 40.71427, -74.00597], ["Manhattan", 40.78343, -73.96625], ["Denver", 39.73915, -104.9847], ["New York", 40.71427, -74.00597], ["Washington", 38.89511, -77.03637], ["Palestine", 31.92157, 35.20329], ["Albany New York New York", 42.65258, -73.75623], ["New York's New York New York New York New York", 40.77205, -73.93014], ["Beverly", 34.07362, -118.40036], ["New York's", 40.77205, -73.93014], ["Albany", 42.65258, -73.75623], ["Fort", 14.60365, -61.07418], ["Minnesota", 46.25024, -94.25055], ["US", 45.99696, -118.49854], ["Minnesota", 46.25024, -94.25055], ["Seattle", 47.60621, -122.33207], ["Japan", 35.68536, 139.75309], ["U.S", 39.828306, -98.5795], ["San Francisco", 37.77493, -122.41942], ["the United states", 39.828306, -98.5795], ["Idaho", 44.5002, -114.25118], ["Greece", 39.0, 22.0], ["Minnesota", 46.25024, -94.25055], ["Minnesotan Minnesota", 44.97593, -93.23475], ["Minneapolis", 44.97997, -93.26384], ["Albany", 42.65258, -73.75623], ["Japan", 35.68536, 139.75309], ["San Francisco", 37.77493, -122.41942], ["San Francisco", 37.77493, -122.41942], ["Osaka", 34.69374, 135.50218], ["San Francisco California", 37.77493, -122.41942], ["San Francisco", 37.77493, -122.41942], ["Japan", 35.68536, 139.75309], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["France", 46.0, 2.0], ["Norway", 62.0, 10.0], ["California", 34.68743, -116.78467], ["Santa Barbara California", 34.42083, -119.69819], ["China", 35.0, 105.0], ["Albany", 42.65258, -73.75623]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Albany", "Massachusetts", "Washington", "Florida", "Florida", "Florida", "Virginia", "Utah", "Albany", "U.S", "Washington", "U.S", "Washington", "New York", "Manhattan", "Denver", "New York", "Washington", "Albany New York New York", "New York's New York New York New York New York", "Beverly", "New York's", "Albany", "Minnesota", "US", "Minnesota", "Seattle", "U.S", "San Francisco", "the United states", "Idaho", "Minnesota", "Minnesotan Minnesota", "Minneapolis", "Albany", "San Francisco", "San Francisco", "San Francisco California", "San Francisco", "California", "California", "California", "Santa Barbara California", "Albany"], "out_country": ["Utica", "Kingston", "Mexico", "Mexico beach", "Georgia", "North Carolina", "North Carolina", "Obama", "Palestine", "Fort", "Japan", "Greece", "Japan", "Osaka", "Japan", "France", "Norway", "China"], "in_state": ["Albany", "Albany", "Albany", "Albany", "New York", "Manhattan", "New York", "Albany New York New York", "New York's New York New York New York New York", "New York's", "Albany", "Albany", "Albany"], "out_state": ["Utica", "Massachusetts", "Kingston", "Washington", "Mexico", "Florida", "Mexico beach", "Florida", "Florida", "Georgia", "North Carolina", "North Carolina", "Virginia", "Obama", "Utah", "U.S", "Washington", "U.S", "Washington", "Denver", "Washington", "Palestine", "Beverly", "Fort", "Minnesota", "US", "Minnesota", "Seattle", "Japan", "U.S", "San Francisco", "the United states", "Idaho", "Greece", "Minnesota", "Minnesotan Minnesota", "Minneapolis", "Japan", "San Francisco", "San Francisco", "Osaka", "San Francisco California", "San Francisco", "Japan", "California", "California", "France", "Norway", "California", "Santa Barbara California", "China"]}]