{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio is funded by you and killing rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nSo you felt that this form did you ever than sit down with are having a phone interview with with an FBI agent following up on it\nUh last I did not I was never called back I waited by my phone by my computer ah hoping to get an email that nothing happened\nTo be clear your your statement boils down to that you saw him drunk back in college which of course does not prove or disprove allegations of sexual assault which is the central question that the FBI was was looking into why is your account relevant to the FBI why do they need to question yeah\nWell I think it's relevant because first of all I don't think once you live in front of the Senate Judiciary committee or when it's taken an oath and one is also trying out in this case a it's a job interview to become a Supreme Court justice\nAnd when you're saying you thought he lied and testimony this was in regard to the extent of his drinking\nYes it is the basic law was that he said he knew unequivocally that there was absolutely no way he ever drink to the point of being unaware of the phrases black now I think ... may confuse that was passing out but the blackmailed phrase means doing things that you don't know you have done\nAnd what I'm saying is there is no way that he given the state of who's intoxication on a frequent basis can say that he knows for certain that he never got to the condition how can one new\nLet me let me ask you this a central question today in Washington now that the FBI hasn't delivered this additional supplemental report is does that represent a complete thorough investigation\nClassical and jazz and we'll music programs all made possible through the contributions of you our listeners\nGo to an E. P. R. dot net I'll call one eight hundred six three nine eight eight five zero be part of the most dependable and greatest source of funding\nTo New England public radio that is you our listeners one eight hundred six three nine eight eight five zero or an E. P. R. dot net\nHelp us finished this fund drive thirty thousand two hundred dollars to go and you might have\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at a vet spaces from boardroom to ballroom with a the equipment and and house catering hotel north Hampton dot com should the full\nFund drive we're stopping tomorrow it ten am asking you to help us reach this school right now by doing your part you're helping provide news and information not only for yourself but for the entire community please give now eight hundred six three nine eighty five zero or go to any NPR dot net thank you\nAll things considered on any PR is funded by you and current and Keegan financial Northampton based independent financial services firm guiding clients through personally tailored investing and financial planning gr and Kagan dot com buy T eggnog construction incorporated general contractors employing energy efficient building approaches\nOn projects of all sizes\nThe egg no construction dot com and by e M A dental providing personalized family cosmetic and specialty care for over thirty five years generations of healthy smiles and nice long metal in Northampton EM aid that the dot com [noise]\nThis is Michael in public radio WFCR in Amherst W. N. N. Z. Westfield W. N. N. Z. FM Deerfield W and then I Adams W and then you great Barrington W. A. I. C. Springfield\nAnd W. A. M. H. Amherst in partnership with the UMass Amherst and that any P. R. dot net it's five o'clock\n\nLive for NPR News in Washington I'm jak sphere\nSenators have big gun they review of the FBI's report into sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh Republican Senator Bob Corker says he's satisfied with the results of the probing confident cabinet will be confirmed\nSenator Corker also said he's not upset by the fact that another judge Kavanaugh or doctor lazy forward were questioning the latest investigation\nI think that we're flying I have no issue with that I Know the other side of the house trying to make that an issue I think the American people feel like they were\nPretty well interview one Democrat who had been undecided North Dakota Heidi Heitkamp now say she will vote no on the cabinet nominations [noise] meanwhile demonstrations for and against\nStreaming of New England public radio is funded by you and killed riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nRas NPR's Windsor Johnston reports the protests comes to the Senate prepares to vote on Kavanaugh's nomination which has been marred by allegations of sexual misconduct [noise]\nProtester lately shows on says ending calving off to the Supreme Court sent the wrong message especially the young women\nAdvocated for one second\n\nAt a nearby counter demonstration Francis Rogers says Kavanaugh was treated unfairly and deserves to sit on the court\nBy takes us as he suggests Kevin very similar to how it was a hit piece against some of the same thought at\nFirst each year olds out on Kavanaugh's nomination is scheduled for friday when Johnson NPR News Washington\nThe Trump Administration is accusing China of meddling in America's political process NPR's Scott Horsley reports vice president Pence delivered a ... word indictment of China's activities today\nVice president Mike Pence do beds and Institute China wants to undermine President Trump has accused the Chinese government of using covert actors and propaganda to sway us public opinion before the November midterm elections as well as the presidential contest two years from now\nIs a senior career member of our intelligence community told me just this week what the Russians are doing pales in comparison to what China is doing across this country\nFences charge of election interference was part of a broader critique of Beijing's growing power and assertiveness fences even a strange and has responded with terrorists investment limits and the build up of the U.S military Scott Horsley NPR News the White House\nMember of people finally weekly claims for unemployment benefits at a nearly forty nine year low last week when what has been a relatively strong jobs market Labor Department says initial claims for state jobless benefits fell by eight thousand to a seasonally adjusted two hundred and seven thousand the week ending September twenty ninth\nA major sell off on Wall street today the Dow dropped two hundred points the NASDAQ was down a hundred and forty five points today you're listening to NPR\nAnd this is New England public radio News I'm out in front of your good afternoon Connecticut US Senator Richard Blumenthal pants FBI reports on judicial nominee as a sham\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nOr doesn't include interviews with numerous potential witnesses or follow ups on key leads he says it smacks of a cover up in his words\nThe status chipping in two point five million dollars to renovate the paramount theatre in ... building in Springfield a forty one million dollar plan would restore the Eighteen hundreds seat theater\nAnd develop an eighty five room hotel Herbie Flora's is CEO of the New England farmworkers council a nonprofit that owns the largely vacant property\nSome people say this is a dream and whether people say these nightmare so depending on which side you why but I Believe that this is going for\nThe federal government has pledged a nearly four million dollar loan guarantee for the project governor Charlie Baker announced state funding yesterday\nWe are really looking forward to seeing this project below uh to see it'd be a success and to see if become um yet one more great example of what the city of Springfield looking forward is all about\nThe project has had several starts in stops since the farm workers council bought the property in twenty eleven a casino proposal fell short in several redevelopment plans have been delayed authorities say at least Fifteen buildings in communities north of Boston number damaged and gas explosions last month our uninhabitable\nThe eagle Tribune reports the Massachusetts emergency management agency says Nineteen other buildings in Lawrence Andover in North Andover or a suitable for restricted use which means they need repairs according to the agency an additional wanted her to building sustained minor damage an agency spokesman says\nMany of the damaged buildings are multi unit structures used by more than one family\nMostly cloudy with chance of showers lows forty five to fifty sunny for friday with ties sixty two sixty five you're listening to the Winkle in public radio it's six minutes past five\nSupport for NPR comes from NPR stations or their contributors include exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription normally information at color guard tested dot com\nHometown to Capitol Hill budgets are part of our everyday lives [noise] I Know the chain captain Harris trained\nStreaming of New England public radio is funded by you add bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nAny member you help and covered the economic and political means that will affect you years down around here that his support than ... you'll need tomorrow today [noise]\nCall one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net\nAnd this is all things considered on New England public radio and ... with Martin Maryland is more news coming up news that you trust to bringing the total picture and you know that we apologize by you our listeners Ninety percent of the funding for the programs you listen to\nComes from you our community of support lower asking you to vote for the news that you depend on by supporting it financially right now and go to an E. P. R. dot net I'll call one eight hundred\nSix three nine eight eight five zero contribute to be part of this public radio station and keep all things considered on the air for yet another year and Martin about thirty seven thousand two hundred dollars remains to be contributed we're asking you to give them now and help and the fund drive right now is often during all things considered\nWell things are going well and I think you're being inspired by Melissa Damon Delmar Wilcox of Springfield who wants to finish this fund drive on track\nAnd get you to support all things considered on any PR they're contributing dollar for dollar for everything that you contribute please give now at any PR dot net or call us at eight hundred six three nine eight eight five zero with your contribution of\nTen dollars or seven dollars or thirty dollars a month it's critical that we remain standing so we can continue to deliver this reporting that you hear to you your financial support right now will ensure the continuation of this source of responsible journalism and analysis for our community\nRight now we need to hear from you because you've not major contribution yet to New England public radio to keep it alive and thriving to get to that goal of thirty seven thousand two hundred dollars\nAgain ten dollars twenty dollars forty dollars a month at any P. R. dot net or eight hundred six three nine eight eight five zero dollar for dollar match one\nAlways I heard you're innocent until proven guilty I've heard this for so long and it's such a beautiful phrase\nIn this case you're guilty until proven innocent\nI think that is a very very dangerous standard for our country\nBut she hasn't always defended due process take for example the case of the Central Park five\nIn Nineteen eighty nine five black and Latino teenagers were arrested for the brutal rape of a woman jogging in Central Park Trump took out full page ad calling for the reinstatement of the death penalty long before the five were convicted of the crime\nThey were exonerated years later and we said multi million dollar settlement with New York truck caught the settlement a disgrace one of the Central Park five use of salaam toll MSNBC and twenty six team that Trump should apologize for his actions\nNorth we will ever get it I think of our our my bra and we'd have to give us an apology I Would probably pass in turmoil in the face\nJonathan Turley law professor at George Washington university says however inappropriate it was one thing for Trump to issue these sorts of judgments as a private citizen but now he's president\nWhen he speaks that way as president he is the one person who heads the executive branch vastly different situation from Central Park for\nCharlie says it's troubling that President Trump has continued to assign guilt to people who have not been tried for a crime [laughter]\n\n\nAlone over but Trump presides over rowdy rallies where crowds copper Hillary Clinton\nTo be jail and Clinton isn't the only one tribe has also accused former FBI Director James Comey and other current and former officials of committing crimes related to the Russia investigation and the president still seems to view himself as an outsider Turley says\nDoesn't view himself as an active player in the investigation so I think the way that he justifies this in his mind is there\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com like anyone else\nWhen it comes to due process from seeing sympathetic to his supporters but harder on those he views as opponents ... Neely our criminal justice expert with the ... Institute says the president should defend the law no matter what\nAnd he's failed to do that he's consistently fail to do that unless it's in the service of people or objectives that he personally you know a cares about as far as\nI at the White House if Trump only supports due process for certain people White House press secretary Sarah Sanders rejected that idea he is\nSimply stating the fact that we are a country of law and order we are a country that still believes that you're innocent until proven guilty and we want to see that process I go through in its entirety\nUltimately whether Kavanaugh is on the Supreme Court is a political question not a legal one so the road due process plays will be up to the senator's Ayesha Rascoe NPR News\nA little over fifty years ago Senator Robert F Kennedy gave a victory speech in the ballroom of the Ambassador Hotel in Los Angeles he had just won the state's democratic presidential primary as Kennedy left the hotel through its kitchen shots rang out [laughter]\n\nThere's a hunting black and white photo from that night it's of the mortally wounded Robert Kennedy lying on the floor squatting next to him as a Seventeen year old busboy cradling the fall and senators had that bus boy was one Romero he died this week at the age of sixty eight\nRomero had met Kennedy the night before he delivered room service to the senator Romero talked about that meeting with StoryCorps earlier this year\nYou could do when you're looking at you that he's not looking through his kicking you into account and I remember walking out of there like I was ... feet tall\nAnd the next night Romero was there as Kennedy walk through the kitchen\nOr remember standing in my hand as far as I could and then I remember him chicken my hand and uh she let go somebody's shirt and\n[noise] I kneeled on to him and put my hand between a coke hungry and you should use to make them comfortable ... shall I put my year next year is live and I hear him say it should everybody okay\nStreaming of New England public radio is funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nMy fingers I had a real tree in my ... I took it out thinking that he needed a lot more than me I wrapped around his right hand and then they wheeled him away\nFor decades he lived with the guilt that he didn't do enough to save Senator Kennedy\nIt's been a long for a few years and I still get their emotional or tears come out\n[noise] but er which visit his grave and to doesn't on\nOur shoulders right near two are gonna have to forgive me for not being able to stop was with us from harming your\nNFL like you know it would be a sign of respect to buy a suit I never on us using my life and so what are warned the suit\nAnd I stood in front of his grave\nFelt a little bit like the first day that I that I met him feel important\n... he died earlier this week from a heart attack in ... California\n[noise]\nYou're listening to New England public radio good afternoon I'm ... I'm joined by mark Miller and there's more of all things considered just ahead here on New England public radio news that is that both the joy will as well as sad and rather interesting to\nUh to hear the passing of this one will matter who was a witness to one of the more\nHorrific scenes and on of American history will history I remember perhaps you remember what you might have been when you heard that a Robert Kennedy was shot\nAnd you saw that picture that I conduct picture of ... a cradling a Robert Kennedy's head so sad to hear his posse\nOf this all made possible through the contributions is kind of reporting and missed the story core I interviewed that that that was said just featured all made possible on public radio made possible by you are contributing listeners\nWe've thanking you for making sure that your public radio station can bring you this\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nFinancial contribution for honest reporting thoughtful and uh and considered reporting more news again just ahead here on New England public radio right now we're asking you to go to the phone\nAnd call one eight hundred six three nine eight eight five zero or contribute online at N. E. P. R. dot net to to raise the final thirty six thousand six hundred dollars so that we can end the fund drive right now\nEight hundred six three nine eighty five zero or online at any P. R. dot net to have your sustaining membership contribution match dollar for dollar whether it's ten dollars a month\nThirty dollars fifty dollars a month you decide and then quality radio can keep coming your way we do these fund drives to find those if you have yet to make your contribution of support\nAnd you know ... listen to that story just reminds me that you really don't hear or see interviews like that in most other places you hear a lot of yelling and blather on cable news what they call cable news\nUm you know but you you wouldn't really hear anything like this and this is what you're helping to pay for and I'm asking you to do it right now we're just thirty six thousand four hundred dollars to go\nEight hundred six three nine eight eight five zero or any PR dot net\nBy on Cairo's though the hose the marketplace here with a multiple choice quizzes\nThe best way to show your local public radio station that you value the programming they provide is to have become a standing member and you've set amount monthly me become a standing memory and encourage friends and family can do the same seed become a sustained member today be all of the above your chose the right\nHere's somebody to tell you more in fact [noise] call\nEight hundred six three nine eight eight five zero contribute online at N. E. pi on dot net mocked and just a thirty six thousand four hundred dollars remaining to be contributed we can do that this afternoon and everybody of course that goes to the phone goes on line will be entered to win a pair of tickets to see\nThe great Bob Dylan in concept next month in Springfield one eight hundred six three nine eight eight five zero you also get a night of the tower square hotel after the concept [noise]\nGo to an E. P. R. dot net right now but to do it soon doing right now actually\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nIs funded so that we can continue bringing you the kind of a reporting that you count on him on an ... a\nBob Dylan probably the only Nobel laureate who wears Iraq harmonica\nYou could see him perhaps it's a symphony hall in Springfield but only when you go to any P. R. dot net or call us at eight hundred six three nine eight eight five zero as Mary target from Wilmington Connecticut did\nThere are also problems in terms of whether or not judge Kavanaugh would have to recuse himself from a myriad number of cases that have a partisan nature to them\nHer courses cases involving congressional redistricting campaign finance and others Brakkton Booker NPR News Washington\nSarah Stewart likes to think about what happens when planets collide she uses to actual\nCannons to simulate those massive impact here's one firing in her lab at UC Davis\nHer work earned her a spot in this year's class of MacArthur fellows many of us call it the genius grant for years experts of thought the earth's moon formed after large collision knocked off a bunch of rock Stewart told me her research suggests a different story\nDuring planet formation when two bodies collide there's so much energy released that most of these bodies are vaporized\nThat means that a rocky planet earth is mostly rock vapor what his rocket vapor and and what does that have to do with our moon rock paper is taking the rocks that we stand on end heating it up to the point where it becomes a gas\nAnd when that occurs the earth becomes much larger because vapor is much less dense ... and it extends out into this enormous object hundreds of times larger than the earth today and we proposed that are men grows within the rock paper of the earth after it\nThere is a loan in\nWin tickets to see Bob Dylan's in Springfield inter right no it ... or ... or eight hundred six three nine zero [noise]\nWithin the rock paper of the earth and that gives the moon the same chemistry as the earth\nHow much of a revelation was that I mean how different was that from what scientists used to think about where the moon came from\nIt was hard to imagine that things could be so different and it was a mental roadblock to realize that\nGiant impacts transformed a planet into an entirely new type of object and that could explain one of the biggest mysteries in the solar system\nDid you have to overcome some mental road blocks of your own given what you would have been taught coming through academia\nAbsolutely and this is when we had a bona fide eureka moment to my graduate student and I are sitting in front of a computer looking at the calculations that we had done and realizing that owns the assumptions are actually violated by what we were looking at I think\nIn any field there's a degree to which people have to be taught to trust themselves and maybe women even more than men are taught not to trust themselves was it difficult for you to have confidence that yeah well I've demonstrated here actually is real\nScientists are terrified of being wrong [laughter] so of course I didn't want to put something out there that was really a crazy idea and so we did have to convince ourselves first\nHow long did that take you to convince yourself\nWell [laughter] from the eureka moment to the publisher paper with for years so I think we had a lot of internal debates are amongst the co authors and a lot of debates at conferences on the origin of the moon\nSo do you expect if ten years from now I pick up a high school textbook it's going to have the results of your research there in the chapter on our moon was formed\n[noise] I certainly hope so I Am very excited about this idea and I hope that it leads to test where we can prove whether or not the moon actually formed in the earth vapor\nWhy are these kinds of questions relevant to ordinary people who are not scientists why does it matter where the moon came from for example\nThe creation of the man was the last major event and the creation of the earth and it was such a violent act it left the earth and the state very different from today understanding how earth became in the habitable planet\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events bases from board room to ballroom with Avi equipment and and house catering hotel north Hampton dot com\nFinal event and its creation\nOr something it's part of our story absolutely how did you get interested in planetary collisions\nI wanted to study planet formation\nIn the process I learned that collisions were the major physical process to grow planets and I had the opportunity to study them in the lab and I've been doing it ever since\nWe've kind of kid who was always in the backyard staring at the stars [noise]\nI had my nose in books imagining space travel I very much enjoyed science fiction\nFor you is studying planets a fallback to actually traveling through space to laugh at it\nI might be too terrified to actually go up in space [laughter] exploration and our imagination and through the laws of physics has been exciting enough for me [noise]\nSarah Stewart is a planetary scientist at the University of California Davis and to day she was named to the new class of MacArthur fellows congratulations and thanks for talking with us thank you\n\nMy name's Douglas ... originally from ... in Scotland but being in these long metal for Twenty one years not so bad of an oasis when I arrived here at first I was used to the BBC I. T. and lots of\nGood independent news stations so having a news station where I can hear literally ... top of the world's agenda any PR as a community and we're ... we're here but what's happening locally\nAs well as internationally and is that good mix giving you the broad range that's important when a contributor to any PR it's important for me listen to it all the time and get great value for the contribution I make\nAnd we do appreciate each and every contribution that ah that you make including thanks to lead Douglas of for the ...\nOf course the the mix of news and information and music that you get on you England Public radio all made possible by contributions from day ... Douglas and others who have called one eight hundred six three nine eight eight five zero all who've contributed on line at N. E. P. R. dot net\nGood afternoon I'm ... Jerry I'm joined by mark Miller and there's more of all things considered just ahead all made possible by you are contributing listeners night\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping households live carbon free and the four one three valleys solar dot solar\nComes from community support whether it's NPR or the BBC it's all made possible three you're generous contributions or asking you if you haven't yet made a contribution to New England public radio this fall fund drive\nMake sure the compensation can continue by taking action right now to keep all things considered on the air call one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net\nAnd right now we're in the final forty five minutes of all things considered the last time during the ... will be here during all things considered\nAnd we're asking you to help raise twenty five hundred dollars before the end of all things considered because we can match that dollar for dollar thanks too generous friends of the station from Amherst in east long metal don't miss this opportunity to have your contribution doubles\nWith your a sustaining contribution of twenty dollars a month or ten dollars a month or seven dollars a month whenever you can do to become a sustaining partner\nThat figure will be matched dollar for dollar and the news and music that you want on the air to listen to will continue to be here it's very easy and very important as we wind down on this fund drive\nShow your support for New England public radio at any P. R. dot net or call us at eight hundred six three nine eight eight five zero [noise]\nAny or has one more grief give away to finish off for a full ... interested when tickets to see a villain Springfield she could win ... seats for the whole house was in November he'll also get a combinations of tower square hotel after the ...\nWhen a man and\nAbove them shows on the way to suddenly also interracial no on ... or a hundred and six three million the sub zero [noise]\nUntil he was Twenty one he was known as Robert Zimmerman but uh I guess Bob Dylan is more sellable as\nAn artist but anyway a Bob Dylan that pair of tickets could be yours\nIf you go to and if you are done nets are close at eight hundred six three nine eight eight five zero you'll be entered and at the same time get in on this dollar for dollar match the final like three quarters of an hour before we end all things considered and that matched\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nDemocracy is all about choosing each vote him except pay his or her mind and costs about it well when you listen to New England public radio we helping you make an informed choice we covered the issues the ... the events the speeches and the debates\nYou choose to listen to New England public radio join this campaign season in right now we're asking you to choose to support it with a contribution it doesn't matter whether it's seven dollars a month or a hundred dollars a month to New England public radio\nYou decide what fits your budget and then call one eight hundred six three nine eight eight five zero ... and eat pee on dot net with more on the latest to update from Capitol Hill as well as a preview of the upcoming\nUp American League division series between the red socks on Yankees Adam ... has a has an interview with a one of the writers\nWho is covering the series coming up and just a moment one eight hundred six three nine eight eight five zero or an E. P. R. dot net\nFor New England public radio News I'm out in front of your the red Sox open the playoffs tomorrow night at Fenway Park against the New York Yankees and the best the five game American League division series this year Boston so the franchise record for wins in the season with one hundred eight\nYour gift diffused the award winning what that shines a bright light on both Congress the courts\nAnd of course the president as they make what can be life changing decisions public radio brings you great journalism each in every day and public radio is paid for by those who gave what they can if you can get ten dollars a month or a hundred dollars a month\nWe all will appreciate it because you are donated to something that we all take apart and that is listening to you England Public radio call one eight hundred six three nine eight eight five zero to support the news call go to any P. R. dot net to help support the music you hear on you ain't going to public radio\nWe started all things considered a couple of hours ago we had forty thousand eight hundred dollars to go\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nYour contributions and having the match dollar for dollar at any P. R. dot net or by calling us at eight hundred six three nine eight eight five zero and don't forget you'll be entered into a contest you might be going to see Bob Dylan in Springfield\nPlease call now and thank you for your support\nAll things considered on any PR is funded by un pivot media film print an artwork scanning photo restoration and fine art printing celebrating Twenty years with an open house on October nineteenth\nDetails at pivot media dot com by Springfield College hosting an evening on challenging the stigma of mental illness with Jesse close sister of Glenn Close on Thursday October eleventh and seven thirty\nSpringfield dot edu and bike hands I wear a locally owned and operated full service optical company in Springfield Northampton was steal the nice long metal for over thirty five years\n... dot com this is doing on public radio WFCR in Amherst W and then the Westfield WINZ FM Deerfield W. N. N. I. Adams W and then you great Barrington\nW. A. C. Springfield and W. am age\nImmersed in partnership with the UMass Amherst and that any P. R. dot net it's six oh one\nLive from NPR News in Washington I'm jak sphere\nThat top broad public and on the Senate Judiciary committee says the FBI has turned up nothing to cooperate allegations that Supreme Court nominee Brett Kavanaugh committed sexual assaults decades ago NPR's Brian Naylor says the FBI report is being held behind closed doors and being viewed individually by senators\nRepublican Senator Chuck Grassley says in his words there is nothing in it that we didn't already know and that neither the Judiciary Committee nor the FBI could locate any third parties who can attest to any of the allegations\nCabinet has been accused of sexual misconduct by several women including Christine Blasey Ford testify under oath last week that Kavanaugh assaulted her well those were in high school the FBI was ordered to investigate that accusation and others\nThe bureau interviewed nine individuals are White House source tells NPR the Senate could begin voting on the Kavanaugh nomination as soon as friday Brian Naylor NPR News\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nCrack Cory Booker a member of the Senate Judiciary committee says contrary to the tournaments assessment he thinks the FBI's report is plenty of gaps\nVery frustrating thorough\nInvestigation will be more relevant in your interview all the cooperating witnesses I'm I'm actually shot\nAnd even as the FBI wrapped up its background check much of what it did remain shrouded in mystery including decisions about who was interviewed among those apparently not interviewed in the latest probe judge Kavanaugh Christine bossy fourth woman who accused the nominee of sexually assaulting her while the two were in high school\nThe Trump administrator today on build a new strategic plan for combating terrorism NPR's Scott Horsley reports is the first major rewrite of the planet seven years\nThe plan calls for beefed up border security a culture of preparedness and international cooperation to fight with the White House says is an increasingly complex and diffused terrorist threat\nNational security adviser John Bolton who oversaw the planning process says one big change from the previous blueprint as the focus on what he calls a radical Islam is ideology\nGets a long banned the president's view that without recognizing that we're in an ideological struggle that\nWe can't properly addressed the terrorist threat\nSupplant also addresses homegrown terrorism and the process by which people already living in the U.S can become dangerously radicalized Scott Horsley NPR News the White House\nIn a survey of teens and young adults finds many believe cyber bullying to be a major problem do most also don't think they will be the ones targeted for digital abuse\nThe Associated Press ... Center for public affairs researching MTV survey also finds around half of all young people and their parents use social media is having a mostly negative effect on the younger generation\nOn Wall street the Dow is down two hundred points the NASDAQ fell a hundred and forty five points today you're listening to NPR\nThis is New England public radio News I'm out in front of your good evening\nA decision from a federal judge in California could affect an estimated twelve thousand immigrants\nLiving in New England with a temporary immigration status the judge issued a preliminary injunction blocking the Trump Administration from ending temporary protected status for immigrants from El Salvador Haiti Nicaragua and Sudan W. B. U. ours Shannon dueling has more\nStreaming of New England public radio is funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nFor countries I mean these immigrants are safe from deportation while the case played out in court to lawyers committee for civil rights and economic justice of the similar ... in Boston federal court on behalf of TPS recipients from El Salvador Haiti and Honduras ... heads up the lawyers can\nWe will proceed to ensure that immigrants from an ... type of protection federal court in San Francisco as Greg other countries\nAnd department of justice spokesman Devin manly sat in a statement the administration will continue to fight for the integrity of our immigration laws and our national security for the New England news collaborative I'm Shannon dealing in Boston\nThe national weather service says to tornados touched down in Connecticut earlier this week as a series of severe thunderstorms made their way across the state and the F. one tornado with maximum wind speeds of a hundred miles an hour touched down in New Canaan at about five thirty Tuesday and lasted about twelve minutes cutting a nearly four mile path to Norwalk\nIt was about a hundred yards wide than in enough zero tornado touchdown shortly thereafter in Mansfield maximum winds of about Seventy miles an hour or with the thirty yards and the path\nLengths of just under a half mile\nAnd political action committees are focusing their efforts on Vermont house and Senate races ahead of the November election Vermont Public radio reports ten packs of donated Seventy eight thousand dollars to local candidates in the past month pack organizers say the legislature presents opportunities to mold policy\nPartly cloudy tonight with a chance of showers lows forty five fifty sunny for friday with ties sixty two sixty five this is New England public radio at six o sex support\nFor NPR comes from NPR stations other contributors include the artists foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at artists foundation dot org and the corporation for public broadcasting\nOne thing we know about people who listen to NPR is they're more likely to do things like vote and called the representative I'm David Folkenflik being informed is essential to our democracy to support the news that keeps you in the no [noise]\n\nOne eight hundred six three nine eight eight five zero\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nInsisted on you in public radio more which is just ahead here on an e P uh we're working to bring you the facts each and every day and those facts come to you with listener contributions Ninety percent of the expenses of the programs you listen to a paid for by the local community of listeners\nNow is the time to make sure this type of a responsible reporting can't continue\nNew England public radio is gathering the funds needed to sustain the station so stay informed sustained the service that keeps you in the no call one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net I'm joined by mark Miller good evening\nGood evening Kyrie and getting to thank you for listening and thank you for contributing right now this is the final after noon to support all things considered during our full fund drive\nDon't miss your chance to get your dollars doubles or we can match another fourteen hundred dollars but we only have\nWell the twenty three minutes left in this program to do that and we want to hear from you because we know you love all things considered and you want to be one of those people who make sure that we reached the gold\nAnd support the programming for you and your community going into the future so make a big difference right now with your sustaining gift of just ten dollars a month or thirty dollars or twenty dollars a month at any P. R. dot net or by calling us it eight hundred six three nine eight eight five zero\nComing up on New England public radio and all things considered we'll have the latest\nOn the FBI report to the supplemental report on the justice nominee Brett Kavanaugh that as the senators review that report that's coming up in just a little while also a report on a microchip that that could be perhaps in one of our smartphones\nPilot ... let me and then they put out just on that in the moments we have left because\nTerm election oh I think there's a lot of truth to that we've said number one we would do it in a normal ordered a we were up to I Believe in Ninety One days now and the average is about sixty were about three weeks past the normal for the last five United States Supreme Court justices\nSenator rounds thanks so much you met Mike Rounds of South Dakota and we'll be speaking with a democratic senator elsewhere in the program\n[noise]\nBloomberg has a big story out today about eight tiny microchip not much bigger than a grain of rice\nThat ship has been found in the type of computer servers used by at least thirty major American companies including apple and major banks also servers used by the Pentagon and the CIA Bloomberg describes this chip as quote\nA stealth doorway into any network that included the altered machines and historically Bloomberg reports was built in China\nMichael Riley is one of the reporters who broke this story today Welcome thank you very much tell me a little bit more about this microchip and what kind of damage\nPotentially it's capable of doing\nSo it's basically a chip that was built in to a mother board out it's made by a U.S company called super micro super micro even though most people have never heard of that of the company is incredibly important in the business of making servers\nAnd surveys on the neurons of the cloud of the basically the Internet these big dissenters with tens of thousands of surfers on them and these particular service were being assembled in China the actual mother boards would be built in China\nChina basically makes the vast majority of all technology in the world today it's all been off shored and most of it has gone to China\nAnd governments have long pointed out that this is a risk because if the country allows its spies to mess with that process it's a major threat but companies have always assumed that that's too valuable to China to mess with\nThe what the story tells us is in fact at least when the targets are valuable enough for specific enough they're going to be willing to do that to the critical question of who did this you quotes\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nThat they have done this that if anything to do with it how confident are you based on your reporting that this was trying to\n[noise] well that's certainly what the US government has assessed it to be and they assessed that U.S intelligence U.S intelligence what's right and they started with very high confidence\nAnd it's interesting when we asked China's foreign ministry for ... a lot of times they'll say things like you're crazy me nothing nothing about this their response was a little more nuanced and protect swollen environment we're in now basically said\nWe are a victim of these kinds of attacks to and you know they're right with the U.S government it's very very good at these kinds of hardware attacks and on a subtle way that a message that there was deliberating was\nDon't pick on just on us if you guys want to talk about very sophisticated hardware tax you have to talk about what you do as well you're citing sources and U.S intelligence\nAnd I want to push you on that because some of the company's caught up in your reporting a ... which included Amazon which include apple which include super microbes they dispute summaries of your reporting you've got their full statements on your Web site that's right\nThey say they don't respond they basically said nothing like this ever happened when you give me a sense of how many officials you talked to who are in forming your reporting\nI'll give you some sense of the cluster of a sources 'cause that's really important so we had\nSeveral sources inside the U.S intelligence community we had several sources inside law enforcement we've had sources inside the the other parts of the U.S government but we also more importantly had sources inside the companies who where these chips were found the interesting thing about apple and Amazon is they\nAre two very big very valuable companies but they also have pretty good security the fact that they found these chips was amazing in itself now companies wouldn't be responsible for what they what they want to say but based on our shores scene\nAnd the way it was layered from so many different places including inside of the companies were really confident that we had a story down so what are the implications of this\nWell they're more they're they're they're really large economic and national security that's right in part because the global economy is built on sort of global outsourcing trade model\nAnd again especially when it comes to technology China is a huge player and not\nAnd the implications of this are companies now have to think well do I have to worry about what's being put in the technology that's being manufactured how do I try and counter that is it should I go someplace else and make things I mean it's a it's a really big hard issue to solve a for a\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy\nDot edu many of those ... products are made in China they have to rethink the entire model you get a sort of a tidal wave of decisions that could impact the the global economy [noise]\nYour reporting continues it on like that is Bloomberg reporter Michael Riley who along with his colleague Jordan Robertson wrote the big hack how China used tiny chip to infiltrate us company smuggled Riley thank you fix [noise]\n\nYou're listening to New England public radio I'm ... and I'm joined by march in ... and\nWe hope that you've enjoyed this edition of all things considered we're looking to raise the money needed to continue bringing all things considered each and every day here on an e P uh with just a few minutes left before six thirty when we go to market place for the news of the business world\nAs well as fresh air and jazz ... later this evening all made possible through your contributions we're asking you to to help fund the service that brings you all things considered each and every day as well as the new other news and information services from NPR and\nAnd the R. I. as well as the music that you hear on New England public radio one eight hundred six three nine eight eight five zero you can also contribute on line at N. E. P. R. dot net Martin how you doing\nI'm doing okay I made the ... at the end I was at a ball game last night in New York\nOr so but here's the important thing that you need to know right now we only have about twelve hundred dollars that can be matched with your contribution dollar for dollar this is the final\nOpportunity during all things considered dome is your chance to get your dollars doubled um we're not going to be here tomorrow during all things considered our fall fund drives going to come to close tomorrow morning\nSo for the election coverage the music and cultural the things that car I just mentioned you tune here to any PR now I'm asking you to join your fellow listeners and paying for what you want on the radio give ten dollars a month Fifteen dollars a month twenty dollars a month and you'll be an important part of what makes the station work\nAn important part of reaching our goal\nThirty three thousand three hundred dollars left to raise and we are asking you\nStreaming of New England public radio is funded by you add bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nLots of Springfield and friends from Amherst in east long meadow any P. R. dot net or call us at eight hundred six three nine eight eight five zero\nSeries\nAny viewer has one more great give away to finish off for a full fund drive to win tickets to see Bob Dylan in Springfield you could win ... seats for the whole free has concert in November he'll also get a combinations of the towers were hotel after the concert\nThe Bob Dylan shows on the way to selling out so into right now it ... or ...\nOr eight hundred six three nine zero [noise]\nAnd when you call one eight hundred six three nine eight eight five zero\nYou not only be doing yourself and your family a service but your friends and neighbors throughout western New England that is supporting New England public radio that brings you news and information that ah\nThat gives you the answer whether it's blowing in the window or not one eight hundred six three nine eight eight five zero you count Johnny hearing\nThe news and information to keep you informed well we count on you to help pay for this coverage supported at N. E. T. R. dot net I'll call one eight hundred six three nine eight eight five zero where the contribution of ten Fifteen or twenty or a hundred dollars a month it's never been more important\nThan than right now to support New England public radio\nTwo minutes left in our challenge before we go to the marketplace thank you to Caleb Spiegel from Conway a Caleb you're in the contest of for the Bob Dylan tickets in overnight say a tower square hotel\nAnd you can be in that contest too and your caller said eight hundred six three nine eighty five zero go on line to NPR dot net\nAnd while you're there make your contribution of support because every contribution until we go to the marketplace is going to be doubled dollar for dollar of this is the final opportunity don't miss your chance to get your dollars doubled a victorious late from Grande we thank you\nAnd in advance I Want to thank you for making your contribution right now any P. R. dot net or eight hundred six three nine eight eight five zero\nYou know where your money is being spent when you contribute to New England public radio every time you turn on your radio but you know there's all the other things that include that\nStreaming of New England public radio is funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nCost us more than fourteen thousand dollars we spend over half a million dollars to NPR this year to pay for the news ... programs that they produce and that you rely on one eight hundred six three nine eight eight five zero your contribution makes it all possible for us", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Amherst", "day": "04"}