{"month": "10", "state": "MA", "station": "WFCR", "content": "Interviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nAnswer now in any P. R. dot net\nHundred six three nine eight eight five zero or any P. R. dot net\nThank you very much Walter for all the lovely music you shared with us this afternoon to you know that it costs five hundred and ten dollars an hour to provide you\nNews and music right here at New England public radio so pay for what you listen to become the newest member of the any PR family one eight hundred six three nine eight five zero or N. E. T. R. dot net\nThis is New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst and online that an E. P. R. dot net\nAll things considered is next Hampshire county production comes from the five colleges studios at the University of Massachusetts Amherst\nAll things considered on the England Public radio is funded by you and by D. M. G. Don Miller gallery in North Hampton celebrating forty years of distinctive find jewelry custom designs handcrafted glass and gifts D. M. G. know whoa dot com\nBy ATC environmental and hazardous materials consulting and testing with an e PA and state certified training center in West Springfield since Nineteen eighty three A. T. C. G. S. dot com\nBust Springfield College hosting an evening on challenging the stigma of mental illness with Jesse close sister or Glenn Close on Thursday October eleventh at seven seven thirty Springfield dot edu\nAnd of course a great thank you to all the listeners who have made contributions so far during our fault fund drive you can be one of them you can\nMake your contribution easily and securely had any P. R. dot net or you can call eight hundred six three nine eight eight five zero and thank you\nLive from NPR News in Washington I'm Windsor Johnston\nPresident Trump's divisive remarks about the woman who accuses Supreme Court nominee Brett Kavanaugh of sexual assault risk alienating key Republican senators Trump mock Christine Blasey Ford at a campaign rally last night NPR's Tim Mak reports Kavanaugh's confirmation almost certainly hinges on\n[noise] interviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\nAnd Jeff Flake Trump\nMocked Ford's Senate testimony at a political rally in Mississippi\nHis attack on capitals accuser was greeted with cheers but where is the place I don't remember how many years I don't know [noise] not so much on Capitol Hill Republicans have a slim majority in the Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nEye and taking everything into account and I think that the president's comments yesterday\n... Dr Ford were totally inappropriate and in my view unacceptable\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nA un tribunal has ordered the U.S to ensure that sanctions against Iran do not impact humanitarian aid or aviation safety as NPR's Michele Kelemen reports Iran is welcoming the decision while secretary of state Mike Pompeo is blasting Iran for abusing the court\nSecretary Pompeo says Iran brought what he calls a merit list case at the international court of justice based on a treaty that he says Iran has been ignoring\nHim announcing that the United states terminating the Nineteen fifty four archery everybody with a wrong this is a decision frankly there's thirty nine years\nOverdue ... says while the U.S is re imposing sanctions on Iran having pulled out of the Iran nuclear deal the Treasury Department is making sure that humanitarian transactions can continue\nBut the secretary ads Iran could be helping its own people rather than arming proxy militias in Iraq Syria and Lebanon Michele ... NPR News Washington\nAt journalists group and turkey is calling on the government to look into the apparent disappearance of a prominent Saudi journalist and critic of Saudi policies NPR's Peter Kenyon says journalist ... reportedly entered the Saudi consulate in Istanbul on Tuesday and did not come out\nTurkish Arab journalist association edits voice to those if the show these Turkish fiance and a friend who said they waited in vain for him to come out of the Saudi consulate the association said in a statement it fears for her she'll be security he left Saudi Arabia last year during retribution for\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nFor planes the NASDAQ up twenty find the S. and P. kill this is NPR\nAnd this is New England public radio News Good afternoon I'm ... hotel workers at seven Marriott Hotels in Boston walked off the job today\nThe night here labor union says more than Fifteen hundred unionized housekeepers coax bartenders bell hops dishwashers and other workers officially went on strike for better pay at five o'clock this morning after months of failed contract negotiations\nThe union says the walk out is the first hotels striking Boston's history and Mary up to the city's biggest hotel employer the union says simulate strikes at Marriott on hotels are being considered in San Francisco Oakland Detroit Seattle San jose in San Diego in Honolulu\nThe Maryland based company did not immediately comment\nAn independent state health care watchdog agency says a ballot question to require nursed a patient ratios would increase health costs and Massachusetts by up to nine hundred and fifty million dollars a year\nThe health policy commission says it proposed staffing levels would force hospitals to boost hiring in wages down sense he is where the coalition to protect patient safety which opposes the ballot question he says it would lead to hospitals cutbacks and closures\nWhere they have to have hospitals make huge difficult decisions each and every day realistic decisions about how they're going to run their hospitals\nAnd nurses' union backing the ballot question says it would increase patients' safety and says the health policy commission is over estimating the effect on costs\nA retired judge has been chosen to lead an investigation of sexual abuse of children by priests Cindy Bridgeport, Connecticut Roman Catholic diocese\nThe dice announced today that Robert hosts burglar lead its investigation which will begin immediately and is expected to be finished next spring\nBishop prank or John announced the pro last month amid continuing sex abuse scandals in the church worldwide the Bridgeport dicey says twenty nine of its priests over the decades had been credibly accused of sexual abuse and the diocese has settled at least three dozen abuse lawsuits over the years\nMostly cloudy tonight with ... after midnight to lower fifty partly sunny tomorrow with a slight chance of afternoon showers high as any upper seventies your list\nStreaming of New England public radio was funded by Ewan Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall juicy V. S. dot org\nNPR stations other contributors include exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription normally information at color guard tested dot com\nNonprofit journalism is critical to our democracy I'm Audie Cornish NPR News knowing that we have donors like use supporting art work not only gives us financial stability but the encourage meant we need to stay in the game reporting for you\nIt's time to join your fellow New England public radio listeners and paying for what you want on the radio sign up to give ten twenty or thirty dollars a month right now at any PR dot net\nYou can also call one eight hundred six three nine eight eight five zero to make a contribution\nGood afternoon this is all things considered from New England Public radio I'm Sam what's a cure with Katie rights were taken a few moments away from a program that you love the cherish that's a really important part of your life\nTo ask you to pay for it you get lots of subscriptions maybe it's Netflix or your daily newspaper and they send you a bell and you've got to pay it or they stopped giving you the service that's not how we operate with public radio we leave it up to you it's the honor system and now is the time for you to do your part\nWe've provided you the service and I got to pay for one eight hundred six three nine eight eight five zero or go to any P. R. dot net Katie we're trying to raise ten thousand dollars during all things considered and we've got an incentive for folks\nJust a little bit yeah I Know that you would give regardless because you love all things considered and you trust the news from NPR in New England Public radio but when you help us meet that goal and make it to six thirty fully funding this great program and then I get to pick the winner of two tickets to see Hamilton at the Boston opera how\nThat's happening today we've been talking about that if you have a leak and that's happened in today exactly so there's no more waiting\nExactly this is this your final chance to get into our Hamilton drawing will even throwing dinner at eastern standard afterwards the biggest Broadway show ever it's a fantastic musical and you could be their\nEnter right now to win at any P. R. dot net or eight hundred six three nine eight eight five zero but when I say we're at right now I mean you know right now I don't want you to miss out get your chance to win now New England\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a ... you\n... that's one thousand four hundred and eighty eight dollars for every day for the NPR programs here on the station all things considered MORNING EDITION fresh air wait wait don't tell me\nA survey out today from NPR PBS NewsHour Marist College shows that Republican voters are right now as energized as democratic voters it's a major change from last month when enthusiasm among Republican voters was lagging behind Democrats\nNPR's lead political editor Domenico Montanaro is here with results of the poll had a medical hey there Ari how big is this surge of interest among Republican well\nThe percentage of Republicans saying that the election is quote very important has shot up from the summer when we pulled in July it went from sixty eight percent then to now eighty percent which is almost the same level as Democrats and that is really striking\nAnd should be a huge warning sign to the Democratic party because all year we've been talking about how democratic enthusiasm has been outstripping Republicans and how that could lead to this eventual blue wave\nYou know everything Republicans are have tried to increase this doozy as him so far had fallen flat whether it was tax cuts are talking up the broader economy even the threat of impeachment to the president\nNothing really fired up the Republican base until now is it clear that this was all about calving off well look I asked that question of our pollster Lee marrying off of a marriage and his response was this quote\nThe result of hearing at least in the short run is the Republican base has awakened so it does appear yes it has been the camera hearing 'cause we pulled a week earlier and we've seen this change he also stressed that there's um a month from the election\nAny number of things can and have happened in that amount of time and whether Kavanaugh eventually gets through or is eventually sunk\nWill really have some influence on how fired up Republican voters are anything can happen in those thirty four days\nWe've heard from Kevin ... and from his accuser Christine Blasey Ford what is the whole show about who people say they believe\nIs really important and more are saying they believe Christine Blasey Ford them\nStreaming of New England public radio is funded by you and they passed the university graduate schools MS and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nIt only has grown afterward about half of people say they believe Ford while only about a third say they believe Kavanaugh uh and that's been an increased margin from last weekend at first blush as Danielle mentioned earlier men and women are starkly divided\nAnd it but it's really a partisan divide and the and actually it was really interesting here is that the largest group of people that say that they believe Ford in the poll that she's telling the truth democratic men [noise]\nYou've talked about enthusiasts on when you look ahead to the election thirty four days from now or what do the numbers show about who the public would prefer to control Congress Democrats or Republicans right all year it's been through that Democrats have lead on this question\nTo continue to lead on this question but only by six points now that's been cut in half\nIn the past month and guess what all of that movement in in the past week has been among men just in the past week those men have gone from being evenly split on whether they'd vote for a Republican or Democrat in their district and now saying they prefer Republicans by ten points\nWomen on the other hand give Democrats at twenty points advantage that's something that they've been saying all along so you can see really who vis a vis Kavanaugh hearing really affected and had the most impact on is the takeaway\nHere that the quote unquote blue wave seems less likely today than it did a month ago\nI think absolutely that's one take away and I think that there there have been warning signs for Democrats that that the blue wave wasn't going to be as big as it could be because Republican enthusiasm even at its lower level was still higher than out parties in past wave years\nIt's NPR's to medical mountain are with results of this new poll thanks to America You're welcome\n[noise] [noise]\nSaudi Arabia and internationally known Saudi commentator has gone missing ... reportedly disappeared after entering the Saudi conflict in Istanbul on Tuesday and there's growing concern the columnist who's a vocal critic of Saudi Arabia is government\nMay have been detained by Saudi officials the state department says it's following the situation closely NPR's Jackie Northam reports for the past year ... has been a columnist with the Washington Post\nThe newspaper says early Tuesday Afternoon he entered the ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a ... you\nSay waited outside for him until early evening because she'll be never emerged\nTurkey's presidential spokesman even a him color and set on Wednesday ... remains in the conflict and that the Turkish government raised the issue with the Saudis\nBut an official with the Saudi embassy in Washington DC was adamant because she'll gate was neither in the consulate nor in custody [noise]\nThe incident is raising concern that ... may have been caught up in Saudi Arabia is recent crackdown on free speech\nHe had spent decades covering the twists and turns of Saudi Arabia's royal family often supporting the government's actions that is until he apparently fell out of favor with Saudi Arabia's new crown prince Mohammed bin Salman mind\nDuring an interview with NPR in may ... said life in Saudi Arabia had become repressive the government began rounding up activists and businessmen\nHundreds of sororities maneuver the ... when there is no rule for freedom of expression no tolerance for independent opinions\n... became an outspoken critic of the crown prince after some of his colleagues were arrested because she'll get left Saudi Arabia and moved to Washington where he continued to write tough commentaries about the government because she'll be said the choice for self exile was hard but ultimately the right decision\nOf sixty years old I don't feel like going to spend the rest of my life in jazz it's subsidized choice and says goodness that I made that decision to leave\nEven though he was in Washington because she'll be felt the long arm of the Saudi Government\nEven when I speak to you if you're somebody over my shoulder and have fun with the book as well get either I have friends on the government is having a heavy hand\nAnd it just may have followed ... is temple Jackie Northam NPR News [noise]\n\nIs all things considered from New England Public radio thank you for joining us this afternoon you count on New England public radio and NPR to bring you stories like that from Jackie Northam and before that from Dominican narrow you count on New England public radio and NPR to keep you informed so you know what's going on in the ...\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nAnswer now in any P. R. dot net\nGiven all the news that's flying that shit today\nNew England public radio in the folks everyone who works here is really proud of the work that we're able to do and we're really grateful for the support of contributing listeners just like yourself if you haven't given yet\nNow's the time one eight hundred six three nine eight eight five zero make a contribution to support that journalism make a contribution to pay for what you listen to that any P. R. dot net\nAnd that's how we are going to keep bringing all things considered too you\nSam ... is our regional news director here at New England public radio I'm Katie right I'm from the development department which means\nI get to raise money to support New England public radio I'm asking you to help me right now joined the any PR family at N. A. P. R. dot net or call eight hundred six three nine eight eight five zero but don't wait don't put it off one more day because right now is your chance your final chance to get into our\nHamilton contest to see the biggest musicals ever\nIt's on the road finally coming to Boston and you could be there so it's like six thirty one this afternoon that's when you're going to pull in actually six exactly it's coming up are you in the contest yet time to get in at any P. R. dot net or one eight hundred six three nine eight eight five zero standard you ever see Hamilton\nI have I saw it in Chicago it was really good really it was really good\nSir rub it in let's go to Boston entered a wind right now any P. R. dot net or eight hundred six three nine eight eight five zero\nWhen you become a sustaining member your pain for the news you trust and you're supporting a community resource I'm Audie Cornish and giving every month is an easy way to make public radio available for everyone so do some good here's how [noise]\nCall one eight hundred six three nine eight eight five zero or go to any P. R. dot net to make your contribution now you get to pick the level seven dollars a month Fifteen dollars a month fifty dollars a month\nThink about how much you can afford it how important New England public radio is to you we're going to take your money and we're going to put it directly into the programming that you count on so we can keep bringing his shows like all things considered and so we can do even more regional and local news\nOne eight hundred six thirty nine eight eight five zero or go to any P. R. dot net and Katie we are looking now we've had some great response already during all I've considered we're looking for eighty three hundred more dire\nStreaming of New England public radio is funded by un path university graduate schools MS and applied data science enrolling for October twenty second applications at ... dot edu\nLie on all things considered it is a pretty reliable show but only because listeners choose to fund it so go ahead and fund the future of all things considered with your gift right now at any P. R. dot net or eight hundred six thirty nine eight eight five zero I Know this can be a busy time of day you might have put it off because all I don't have time I don't have time\nYou know we never have time never have enough time but I'm going to tell you right now that it's first of all it's only going to take you two minutes to make a contribution whether you do it on the phone or on line because we don't have a lot of questions for you it's very simple format and eat P. R. dot net\nAnd the person on the other end of the phone will just write down that information and get it over with so called eight hundred six three nine eight eight five zero fuel and help us meet this goal and pay for all things considered\nAnd it's going to feel so good eight hundred six thirty nine eight eight five zero and of course that means you're in our Hamilton contest which closes soon so enter now\nCitizens that are um that's my sister and she has just given\n'cause I'm asking she does listen but I Know I'm at holidays somebody will start you know asking me about public radio funding and Sally oh don't don't\nGet her started doing like a fun drive after maybe not unlike you know you have to give to your public radio station for the next court I'm going to do if you're not getting any out very hunter any\nP. R. dot net enjoyed Sally David everyone else or go to eight hundred six thirty nine eight eight five zero\nYou know among the stories that we've got coming up for you from all things considered as a story out of the New England news collaborative that's a group of eight public radio stations were telling the story of New England and we are grateful to be one of those stations and Annie Ropeik one of those reporters\nHas the story coming up about ... this is a chemical that that infiltrated the water supply and a lot of places around New England including right here in in Westfield so she's got a story that's based in New Hampshire\nComing up in a few moments to really break down that issue\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nOne eight hundred six three nine eight five zero or go to an E. P. R. dot\nNet and things\nAll things considered on New England public radio is funded by U. N. W. F. C. honest partners\nAnd most have shown Mount Holyoke in Smith colleges and the University of Massachusetts Amherst by Thompson financial management offering independent fee based investment management and financial planning in North Hampton taking care of tomorrow Thompson financial MGD dot com\nAnd by ... what the ... associates an affiliate of books a health systems provided may go robotic surgery procedures at full won three for nine nine sixty six hundred\nSupport for NPR comes from this station and from Amazon Prime video presenting the return of the man in the high castle were America's history is under siege but the resistance rises to fight for the world today was the new season premieres this October on prime video\nAnd from capital one offering a variety of credit card options with features for a range of customers from food Easter travelers capital one what's in your wallet credit approval required capital one bank usa NA\nFrom NPR News this is all things considered ... Chang\nAnd I'm Ari Shapiro many people in the U.S auto industry are breathing a sigh of relief this week the new trade deal between the U.S Mexico and Canada and months of uncertainty if it's approved by Congress it will spare carmakers from some of the terrorists that they had feared\nAnd we'll send a senior vice president of the motor and equipment Manufacturers Association which represents more than a thousand companies that make auto parts you're in the U. S. thanks for joining us here on all things considered thank you very glad to be with you to begin with what you just described for listeners what you remember companies making and where you are in the auto making supply chain\nSo our members make the vast majority of the content for new vehicles and we also manufacture parts and components for maintenance and repair\nAnd how much was on the line for you in this trade agreement ... holding your breath to see what the details would be\nWell our industry has actually done quite well injured after we've actually been able to grow\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences and psychology a ... D you\nAids but it counts and all three countries being part of the agreement so we are very pleased relieved that all three parties were able to come to an agreement this weekend we're cautiously optimistic that the terms of the agreement will work for the industry and for the American public\nWhen you look at the details of the agreement can you tell how it compares to NAFTA for you\nWell there's going to be an increase in the amount of North American content that will be required\nFor parts to travel through the three countries can have to call it the U.S Mexico Canada agreement but traveled through North America without having to pay tariffs there's going to be a requirement for more North American steel and aluminum\nA so all of that will impact our members and in addition there's going to be some new administrative costs that are going to be required\nOne of the concerns we have though are there some new tariffs out there right now on steel and aluminum and we'd like to see Canada and the United states address that before the finalized disagreement in the end of November\nSo on the one hand there won't be terrorists for material crossing Canada U.S Mexico border is on the other hand the steel and aluminum tariffs that were of concern to your industry have not gone away\nNo they have and I think one of the things we have to keep in mind as they have been a particular burden to smaller manufacturers many of these smaller manufacturers are only in the U.S\nAnd some of our members just seen the cost of their steel purchases rise almost fifty percent so this is a significant increase it's typically of concern between Canada and the United states we'd like to see those two countries roll up their sleeves uses same energy they used to conclude this this new NAFTA\nAnd be able to come to some kind of agreement on steel and aluminum tariffs\nI Know that there's a lot of relief from the auto industry now the uncertainty is gone but how does this compare to the old rules under NAFTA isn't an improvement does is it worse well\nI think for the United states perspective one of the things in the United states said little pool through was an increase in the U.S content and for some of our suppliers and some component manufacturers this is going to be a challenge there is no doubt about that I Do think that we're going to see more steal more aluminum\nStreaming of New England public radio is funded by you and cute little architect or forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\nParties can minimize those costs because consumers are going to get any value out of it and that's going to be our next a real challenge for as we move forward that Greenland\nAnd Wilson is senior vice president of the motor and equipment Manufacturers Association thanks for speaking with us today thank you it's a pleasure\n[noise]\nCommunities across the country are grappling with a new kind of chemical pollution in drinking water it's called pee fast\nA group of thousands of chemicals used for decades and products like ... pants the science and regulation around this still aren't settled leaving some people in limbo New Hampshire Public Radio's Annie Ropeik has the story [noise]\nJillian lanes family built a house in a tree lined cul de sac in the New Hampshire town of ... on a recent morning as she wrangled her three young daughters door she pointed out a picture window for the woods in the back yard\nSo I like\nIt is a federal Superfund site called Coakley landfill lane didn't even know it was there until two years ago when she heard of an nightmarish discovery nearby a cancer cluster of young kids all with the same rare deadly diagnoses lane was desperate to know for girls were risk so she started reading\nUnderneath one of the articles was just a comment from a Public Citizen that said Coakley question mark and I was like totally attack it was ... so I started Googling it\nShe found a former town dump turned toxic waste cleanup area just through the woods and ... [noise]\nBob Sullivan city attorneys nearby port Smith he says the landfill now a huge grassy hill used to be an empty Corey\nAnd that was actually kind of stayed back in the Nineteen seventies when people looking to get rid of municipal waste trash they would find a hauling out somewhere and fill it up for having seemed like a good idea\nHeavy metals and manmade toxins were seeping from a landfill into neighbors' water wells Coakley shut down and became a Superfund site in the mid eighties it was covered with a kept keep brain from washing out more toxins for years this put the public fears to rest\nStreaming of New England public radio is funded by Ewan bay path university graduate schools MSA in creative non fiction writing enrolling no for August twenty seventh applications at bay pest dot edu\nDiscovery high levels of pee fast chemicals and surface waters around the landfill since then traces of these industrial toxins have also turned up in nearby wells\nOfficials are still working to pinpoint where the chemicals come from and they may never be sure what caused the cancer cluster but pee fast chemicals have been linked to a wide range of health effects including cancer so neighbors like Jillian lane are still terrified\nRight and so were drinking the water and were bathing and we're brushing our teeth in it and we have no idea that we're living with this potential problem\nLanes family spent thousands of dollars on high tech water filters and she devoted countless hours to public meetings and petitions for more clean up an aid\nThe environmental protection agency says the ... and nearby wells is not a threat based on state and federal standards but that doesn't quite line up with a June report from the Centers for Disease Control it says ... may threatened human health at levels ten times lower than what the EPA in states like New Hampshire advise\nAt a recent federal meeting on the fast and New Hampshire atop CDC officials bill ... tried to clarify\nThis is not a larger exposures estimated minimal risks associated\nHe says the CDC focuses on public health not regulations though it's research could play into new state and federal standards and the future And Julian lanes well the ... level is lower even than what the CDC says may be risky but she's still feels the government is failing her community\n... thank you clear a very much and thank you to everyone who is donated to New England public radio we really appreciate your support you can answer now if you call now one eight hundred six three nine eighty five zero or go to any PR detonate you're going to get\nEntered into a very special day in Boston from New England Public radio we have two great seats at the Boston opera house when Hamilton comes to town plus a free dinner getting that drawing because we're going to pull the name at the end of all things considered at six thirty one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net\nIs running out on that Hamilton contest we love having you know these special contest and thank you\nStreaming of New England public radio was funded by Ewan Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall juicy V. S. dot org\nIs the quality of news reporting that you get from NPR News New England public radio doesn't sound cheap and it's not but with your financial help right now we're going to reach our goal of Seventy five hundred dollars left to be raised inside all things considered and we're going to support independent journalism\nTen twenty thirty dollars a month please do your part right now at any P. R. dot net or eight hundred six thirty nine eight eight five zero thanks\nAll things considered on New England public radio is funded by you and calling me care at home helping seniors in western Massachusetts and Connecticut stay in their homes with Colum McCann companions colony care at home dot com\nBy Robbins and Donovan a full service law firm sipping individuals and businesses throughout western Massachusetts and New England since Eighteen sixty six Robinson Donovan dot com\nAnd by Wildwood barbecue and neighborhoods smoke house serving a southern brunch buffet every Saturday and Sunday on routes nine in Hadley Wildwood cute dot com [noise]\nThis is New England public radio WFCR in Amherst W. N. N. C. Westfield W. N. N. Z. FM Deerfield W ... Adams W and then you great parenting double A. I. C. Springfield and W. A. M. H. damaged\nAnd bottom to ship with UMass Amherst added N. E. P. R. dot net\nLive from NPR News in Washington I'm ... we're the White House is defending President Trump's comments about Christine Blasey Ford who's accused Supreme Court nominee Brett Kavanaugh sexual misconduct ... scores more\nWhite House press secretary Sarah Sanders says Trump was not making fun of for during his remark that Mississippi campaign rally during the event the audience laughed in a plot as Trump question for the count of the alleged sexual assault\nIt seemed to me that he was stating facts that Dr for herself a laid out in her testimony once again a every single word that judge Kavanaugh has said has been looked at examined picked apart by most of you in this room\nCabinet have categorically denied all allegations of sexual misconduct some Republican senators have complained that Trump's remarks were inappropriate\nStreaming of doing when public radio is funded by you and killed riddle architects of forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nAnd Van Dyke will soon be in the hands of a jury as Patrick Smith from member station WBUR be easy reports fan dykes attorneys wrapped up their defense today\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut dash cam video showing Van Dyke shooting Seventeen year old the climate Donald sixteen times\nThat video at the centerpiece of the prosecution's case and shows McDonald walking away from police and Van Dyke keep shooting until his gun is empty even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday then I took a stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot closing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nSecretary of state Mike Pompeo says he is cancelling a treaty with Iran that dates back all the way they're Nineteen fifty five stumbling economic relations and consular writes between the two nations\nMove comes on the heels of a ruling by the United nation's highest court ordered us to lift sanctions against Iran effect imports of humanitarian goods store does not enforceable bomb pale telling reporters day the ruling is disappointing but also a loss for Ron this is a decision frankly that his thirty nine years overdue\nAround alleges sanctions imposed by the Trump Administration after the U.S withdrawal from the twenty fifth the nuclear deal violate the Nineteen fifty five treaty\nPrivate sector jobs report out ahead of friday's broader base government data on hiring show solid gains last month payroll processing from a deep pie says private sector companies out of two hundred and thirty thousand jobs in September the most in seven months that we are games and construction professional in business services and education\nOn Wall street today stocks close broadly hired the Dow Jones industrial average up fifty four points to twenty six thousand eight twenty eight that is a record high as that goes up twenty five points the U.S and the five hundred closed up two points today you're listening to NPR\nThis is New England public radio News Good afternoon I'm ... uh Massachusetts ... says union is questioning the analysis of an independent state agency that found proposed the staffing levels would increase healthcare costs by up to nine hundred and fifty million dollars a year the health policy coming\nStreaming of New England public radio is funded by you and they passed the university graduate schools MS and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nI Would have to add more nurses and increase wages Julie paying him ... executive director of the Massachusetts Mrs association says the commission it's over estimating the effect\nTo death of tense they say a four to six percent wage increase to every nurse and the state of Massachusetts as a result of implementing safe limits I think it is lovely dream world but not reality\nSupporters of the ballot question to require no staffing levels say it will improve patient safety opponents say it's too costly and removes any flexibility for health providers\nSouth wins that Connecticut's YMCA has backed out of an agreement to use space at a synagogue for a town child care program after learning the synagogues president is on the state's sex offender registry meanwhile some residents are asking town councilman Jeffrey equipment was also the rabbi at temple ... hello to step down for not informing the public\n... defended Jason Wasserman president of the temples board of trustees saying he's not considered a danger to children watch them and was sentenced to probation and twenty ten for attempting to meet a police officer he thought was a Thirteen year old girl he met online\nWash them into the general inquiry he quote successfully completed probation and twenty Fifteen and has no restrictions\nThe child care program will be moved to a different site\nA dead adult Mickey whale has washed ashore in Marshfield, Massachusetts adding to a year of high mortality for the giant animals along the New England coast officials with the New England aquarium say be twenty six foot whale washed up on Tuesday it's the second Mickey to come ashore in the same neighborhood in the last two months\nThe aquarium says Mickey whales are in the midst of an exceptional die off for New England at least twenty two of the animals have died in the region this year including nine in Massachusetts\nA weather tonight to mostly cloudy with them ... after midnight to low around fifty partly sunny tomorrow a slight chance of afternoon showers has in the upper seventies this is New England public radio at six minutes past five\nSupport for NPR comes from and be used by over three million businesses for hiring or employers can post jobs and used greener questions to build their short list or preferred candidates learn more and indeed dot com slash higher and the corporation for it\nDreaming of New England public radio is made possible by you among the cues garage in Williamsburg offering foreign and domestic ... a U.S these are defined technicians Massachusetts state inspections CQ garage dot com\nOf staying informed will help you keep on top of the news and understand what it means so once you've got listener pride I Hope you'll donate and have for dinner fried too [noise]\nAnd you can get that supported pride by going to any PR done that and making a contribution or call one eight hundred\nSix three nine eighty five zero good afternoon I'm Sam ... with Katie right you can and Ari Shapiro you count on everyone from NPR as well as car injury here in New England Public radio to bring you the news and the context and analysis behind that news during all things considered\nAnd we kind of need to pay the bills so we can keep bringing me all things considered one eight hundred six three nine eight eight five zero or go to any PR\nDot net we've got much more all things considered coming up for you I'm semi secure with Katie right he better K. to have\nSome good to be here with you and great to hear from so many people who want to protect independent journalism who understand that this is public radio listener funded oh listener right I listen\nOkay all funding the time to take that step and become an NPR sustain or it's easy to do it N. E. P. R. dot net or give us a quick call one eight hundred six three nine eight eight five zero\nGive ten Fifteen or twenty dollars a month or whatever you can now is the time because this journalism needs your protection it needs you\nAs a part of the foundation that it is built on any P. R. dot net or eight hundred six three nine eight eight five zero don't wait because we are picking the winner of our Hamilton drawing soon so I Want to make sure you get a chance to be in that drawing you're interested in free tickets to this great musical\nAt the Boston opera house enter now at any P. R. dot net or eight hundred six three nine eight eight five zero and\nWe've had a great response from listeners already during all things considered today thank you so much to everyone who stepped up and contributed we're still looking for Seventy four hundred more dollars before six thirty that's when all things considered and that's when Katie is going to pull that name out of a hat\nMale it's okay to be against white guys you're out your door and that's all I didn't get paid for them in and said\nThis Rush Limbaugh has been railing against so called ... for decades to much commercial success\nWere so out of balance here women activist seminar the women can demand all kinds of investigations into men men cannot require or demand investigations into women you imagine if somebody tried that\nThat was from his show today\nMen are under investigation of his country be through cabinet or through Trump or whoever\nThe idea being that men are under siege as women have taken more prominent roles in the workplace says demographic and cultural shift have changed the rules Whit Ayres is a Republican pollster who was argued unsuccessfully in the age of Trump that his party needs to adapt to those changes\nThan areas of the countries that are struggling economically especially small towns in rural areas those changes are really disquieting and now the culture that's been so comforting and comfortable is changing as well so it's no surprise a lot of white men are upset and fearful\nIt's something President Trump tapped into as a candidate with his talk of forgotten men and political correctness run amok says Frank Luntz and other Republican pollster\nThe idea that you can't say things that you believed to be true that you can't think the way you once thought ten or Twenty years ago because there's something wrong with it\nAnd now it's Trump tweeted today there is an anger among some at how Kavanaugh has been treated ... notes that partisan seek to gain an advantage from the open wound that was the Kavanaugh hearing\nIt has been used by some to try to energize the white conservative male to say hey look now you're a victim you're the one who's being punished\nThe day after the hearing conservative host Laura Ingraham offered this analysis on Fox News\nI don't think the whole year the woman thing [noise] I Wonder if they haven't been off more than they can chew on that because I think it could easily as well turn out to me the era of the man who feel like the target is on their back all the time and it's not fair\nAnd NPR PBS NewsHour Marist Poll out today found a big swing in public opinion among men following the hearing with at ten point increase\nStreaming of New England public radio is funded by you and the path university graduate schools MS and applied laboratories ... operations on rolling over August twenty seventh applications at ... dot edu\nSince ... NPR News and now to Chicago\nWhere a police officer Jason Van Dyke defense team rested its case today\nVan Dyke is charged with murder for the on duty shooting of a black teenager ... McDonald is the first time in decades that Chicago police officer has been charged with murder\nFor an on duty shooting at McDonald's case caused major political upheaval in Chicago and sparked reforms to with police department from member station WBEZ easy Shannon Heffernan reports\nWhen Jason Van Dyke shot the comic Donald in October twenty fourteen police first reported that he was lunging at them with a knife\nBut after political pressure and a lawsuit the city was forced to release a dashcam video of the incident that video is a fundamental piece of evidence in this trial in at McDonalds cures to be walking away from officers it shows been shooting him sixteen times including after the teenager was lying on the ground\nAfter its release activist took to the streets chanting sixteen shots and a cover up\nThree officers at the scene were charged with conspiracy Van Dyke was charged with murder yesterday he took the stand and gave triple testimony\nFrom more rights are awkward crosses far worse my shoulder [noise]\n[noise] for sure [noise]\nGiving cross examination prosecutors asked Van Dyke to point out where and that infamous dash cam video McDonalds can be seen raising the night's\nVigil [noise]\nDoesn't show ... percent\nProsecution then asked him about an animation\nCreated by his own defense team with the goal showing the index perspective again they asked him to point out where the video shows McDonald music the knife\nIt's not showing what our saw showing ... book\nThen dykes defense team called a psychologist at the stand to testify about how being a life threatening situation can more memory and perception other defense witnesses including people who ... McDonald while he was in juvenile detention they recalled incidents where McDonald's shut it threats and resistant staph\nSean Mitchell is a form a defense attorney he suspects index lawyers are trying to distract jurors from what the video shows\nYou decide to ... really ... to ...\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a ... D you\nMore the distance can draw you to a quarrel McDonnell is the least amount of time you're thinking about what Jason Van Dyke do\nDefense also brought witnesses to testify about the effects PCP which McDonald had an assistant prosecutors made the point that liquid McDonald is not on trial and throughout this trap\nAnd again and again showed George the video the defense team rested its case today and each side is expected to make closing arguments tomorrow before the case goes to the jury room hear News I'm Shannon Heffernan Heffernan worked with a team at W. be easy to produce a pod\nCast on this trial called sixteen shots [noise]\nThis is all things considered from New England Public radio thanks for joining us that pod cast mentioned there reminds me a lot a lot of people these days say you know I'm not listening to the radio I'm getting my news from pod cast and say oh at our cats are you're listening to oh you know\nFresh air and wait wait don't tell me and like those are public radio podcast so they are paid for by public radio members\nSo just because you get your news from pod cast doesn't mean you shouldn't support public radio because if you don't without all those contributing listeners out there spread out across the country there wouldn't be any of those public radio broadcast because there wouldn't be enough money trust me those\nPillow and mattress ads don't pay for the whole package for us just get that after one eight hundred six thirty nine eight eight five zero or go to an E. P. R. dot net to pay your share now I'm sitting here with kitty right\nGood to be here Sam want to remind you also that when you go to any P. R. dot net or eight hundred six three nine eight eight five zero you make a gift to help us make our goal and pay for all things considered and yes you are also supporting\nNew England Public Radio's pod cast news now and B can heal and five and also a jazz beat and presto if you're interested in music information and stories\nIt's a great organization we've got going and we need you to be a part of it time to take that step and become an any PR sustain are right now at N. E. P. R. dot net or called eight hundred six three nine eight eight five zero help us raise the sixty five hundred dollars left in our goal for all things considered today\nKeeping on track with that number helps us and the fun drive a quicker so and do give today actually in the next hour because we're going to pull the winter for us\nStreaming of New England public radio is fun to go you know the hotel Northampton offering ... versus from board room to ballroom with the equipment that house catering hotel north helping dot com him to\nNew England public radio has two great seats to see the smash Broadway hit Hamilton and often want to go entered at Wendy's tickets to Hamilton and dinner afterwards\nEastern standard and Ken more swear we're giving away these tickets to Hamilton at the end of all things considered enter now while you're supporting NPR how one eight hundred six three nine eight five zero for enter online at any PR die [laughter] [noise]\nTime is running out on that contest enter now at N. A. P. R. dot net or call eight hundred\nSix three nine eight eight five zero the matinee at the Boston opera house on October thirteenth you could be there they're great seats and then we have a great dinner at eastern standard income more square afterwards if you want to win this great package to see Hamilton the musical\nCall now eight hundred six three nine eight eight five zero or go to an A. P. R. dot net\nYou know we started all things considered eighty seven minutes ago with a goal of ten thousand dollars and we have seen a great response thinking everyone who's contributed we're looking now for just a sixty four hundred more dollars before the end of this show I think we can do it Katie\nThat's our goal sixty four hundred dollars to go you don't have to pay for all of that just to your small share right now seven dollars a month twenty dollars a month maybe you can afford fifty dollars a month donate now by calling one eight hundred six three nine eight eight five zero or go to any P. R. dot net\nIt is so important to have you as part of the any PR family we need you to help\nProtect independent journalism because it's important to you because you want to learn to understand to get news and analysis\nI Know that you're going to go to the phone right now in call eight hundred six three nine eight eight five zero or give on line at any P. R. dot net Stacey went to our website from East Hampton nice to hear from you Stacey got a a a\nGiver in Amherst to set any PR is the nutrition that lifelong learners need what a lovely lovely thought although we're not that yummy honestly but for the IRS anyway gene page and Bernard stunts that are like fresh air and wait wait and on and on I learned so much so she is supporting\nThe source of lifelong learning please join her now at any P. R. dot net or a hundred six three nine eight eight five zero\nStreaming of New England public radio is funded by you and they passed university graduate schools MSA in creative non fiction writing enrolling now for August twenty seventh applications at bay pest dot edu\nOn and also the regional and local news you count on one of the big stories that we've been following along with our partner station WB you are in Boston is the recreational marijuana market in Massachusetts which is\nA slated to get going any day now and we're gonna have some updates on that from ... in the next newscast New England public radio is your source for regional and local and international and national news\nFor Trump give gifts to all of his children but Donald you write more than any of the others you describe him bailing out Donald Trump time after time there's an instance where he bought three and a half million dollars in poker chips to rescue in Atlantic City casino\nBut there was one time the father pushed back against his son Donald as Fred Trump was beginning to suffer from dementia Donald Trump tried to change his father's well what happened\nThat was right in Nineteen Ninety at Donald Trump's darkest financial moment he was facing being forced into bankruptcy by his creditors and he had some lawyers right up a caught us all a change to his father's will that would give him much more control over all those assets\nHe didn't tell his father or his siblings who is doing this he just had the lawyers show up at his father's house I believe it was and put the piece of paper in front of him\nHis father or somebody in the room realized right away this is not where we want to go with this and he pushed back and ultimately called\nDonald Trump's sister who was then a federal judge in a lawyer obviously and ask her to intervene and to make sure that Donald's creditors couldn't come in and pillage Fred Trump's empire and\nDonald we wouldn't have any more control or influence over the state than any of those other siblings would\nThe White House has responded to your reporting by attacking the New York times and saying that the IRS looked at these arrangements as they were happening and found nothing improper how do you respond to that well\nWe think that's not true um we know there are cases where there was no audit done like all county building that we spoke about another train\nStreaming of New England public radio is funded by you and killing riddle architect of forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nTrump's didn't give the IRS all the pertinent information about those buildings and that the appraiser grossly undervalued some of the properties Russ ... is an investigative reporter for the New York times thanks for joining us\nToday Thanks for having me or the New York times story you just heard him out says the trumps were able to get away with tax dodging for decades and there's no evidence that state or federal officials ever did much about it\nAs NPR's Jim Zarroli reports regulators were either unwilling to take the trumps on or is simply lacked the resources to do so\nReal estate companies such as the Trump families are famous for finding ways to pare down their tax bills and some of them skirt the law they can understate the value of a property they've acquired for instance\nBut NYU law school professor Daniel Shapiro says the sheer scope of the Trump family's tax avoidance puts it in a whole other realm\nI don't think this is just like oh this is tax funding as usual is one thing to have kind of self serving valuations that are in the ... side this seems to go beyond it\nYet much of what the Trump did apparently went under the radar for years\nThat doesn't surprise pace law school professor Bridget Crawford she says the Internal Revenue service for decades as simply lack the resources to police tax fraud effectively and years of political attacks may have made it reluctant to take on hard cases\nWhere there's a will there's a way and there has been now with\nOnly one in a hundred tax returns has now audited and Crawford says it's especially easy to do what Fred Trump is alleged to have done pass on assets to your children without them paying much in taxes\nThe fact is that gift tax doesn't raise a lot of revenue also to the extent the IRS has resources they are not going to be allocating at tort gift tax enforcement\nThe same is true at the state and local level although New York state officials are now investigating the Trump families taxes Crawford says it's taken them far too long to do so\nThat cares to me that the state department of finance has been utterly asleep at the wheel for decades when it comes to a transaction some on the Trump family\nCrawford notes that questions have been raised about the Trump families taxes for years ProPublica has reported that President Trump sold to Manhattan condos\nStreaming of New England public radio is funded by you and cute little architect or forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\nBust because Trump hasn't released his tax returns it's impossible to say whether Eric Trump paid federal gift taxes as he was required to do but the extent of the activity alleged in yesterday's times story is harder to ignore the question is what regulators can do about it\nAnd why use Dan Shapiro says if fraud was committed it's probably too late for the government to pursue a criminal case because of the statute of limitations\nBut severe assess the IRS can always decided to take another look at the Trump returns\nOn her return means that it's never too late to revisit it\nIf the IRS finds evidence of wrongdoing severe as it can retroactively force Fred Trump's heirs to pay back taxes and they may have to pay civil fines as well Jim Zarroli NPR News New York this is all things\nConsidered from New England Public radio thoughtful in depth analysis reporting like you just heard there from Jim Zarroli that's why\nYou listen to New England public radio we want to keep providing that kind of news coverage for you so please support it now please pay for what you listened to by calling one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net you're going to pay for the stories that you're hearing right now and you're going to help us fund this public radio station into the future\nI'm Sam ... here with Katie right hey there Katie\nGood to be here with the salmon good to be here with everybody who knows it's important to protect independent journalism and this public radio station it's time to join the any PR family at any P. R. dot net or eight hundred six three nine eight eight five zero\nAnd when I say now I mean now because we are picking the winner to our Hamilton contests soon I Want you to be in that if you're interested in winning two tickets to the hottest show ever on Broadway it's actually coming to the Boston opera house they finally put it on the road\nHamilton is coming to Boston on October thirteenth you could be at the matinee and you'll even when dinner\nAt the eastern standard afterwards is going to be a great night but you only got forty five minutes to get in the contest make sure you are in it too when it any P. R. dot net or eight hundred six thirty nine eight eight five zero I'm Amanda Herman from Florence Hi Amanda she says keep up the good work and she's in that drawing\nFor a two tickets to Hamilton Daniel is in ...\nStreaming of New England public radio was funded by you and cute little architect or forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\nHoarding New England public radio and he's in that drawing twin two tickets to the Hamilton in Boston enter now I'm Maxine oh land I live in Amherst, Massachusetts and I'm here today with my son Noah who's fourteen I'm no of MC I listen\nTo lots of prayer credit NPR shows with her click on podcasts up or something I like wait wait don't tell me a little bit of fresh air imbedded I've been a huge fan of this American Life are very very long\nTime I find it helpful to just be informed because lots of issues could talk about at school\nWe are very happy and proud that nose into public radio we are big fans so I have been giving to any PR and National Public radio for many years because it's a really big important part of our family I think it's the example I Want to set for my kids\nThank you so much Maxine and know are we really appreciate your support we appreciate you listening and we appreciate you're paying for it I think it was really interesting and they're no it talked about how he gets a lot of his public radio through pod cast and podcasts are paid for also with listener contributions so when you pay\nSeven dollars a month or Fifteen dollars a month or twenty dollars a month to New England public radio that's going to help us get the radio to you all of the programs you get there but also everything that you get digitally as well through the public radio system\nOne eight hundred six three nine eight eight five zero to make your contribution right now we're in Ninety percent community supported so right now pay for the programs you listen to help us keep this radio stations strong good at any PR\nDot net or one eight hundred six three nine eight eight five zero now we're our goal is down to fifty five hundred dollars five thousand five hundred dollars I only ten thousand I Know why or cruise in it so great to hear so many people stepping up to support New England public radio\nI'm asking you to help us get that down to zero help us make that goal and know that all things considered is on track to be supported for another year do your part whether it's can or\nThirty or fifty dollars a month or some other amount now is the time any P. R. dot net or eight hundred six three nine eight eight five zero don't wait because as I say yes I Am picking the winner for these Hamilton tickets at six thirty and we need to have you in that drawing if you want to when they go\nGot much more all things considered just had and at the top of the ...\nDreaming of New England public radio is made possible by you among the cues garage in Williamsburg offering foreign and domestic ... a U.S each certifying technicians and Massachusetts state inspections CQ garage dot com\nHearing about from people that everyone seems really interested in or a little confused about has to do with some of these ballot questions that are going to be on the ballot in Massachusetts in particular this nurses valid question question one is confusing a lot of folks cars going to have a quick report on that up in the newscast and then we're going to keep following that story before the election we're going to have a debate\nOr that we're going to they were going to bring you a New England public radio about that ballot questions you can be an informed voter can help it and use that to help make your decision one eight hundred six three nine eight eight five zero help us pay for that by going to any P. R. dot net it's\nSo important that we have this impartial news reporting that they do get people in from both sides and also really dig for the facts this news reporting is expensive it sounds expensive and it is joined the any PR family to help pay for the quality that you want I Know you want all things considered to continue\nWell hello my name is Lynn but if you're dyslexic called me ... my ... going to kill us all I suggest you write to ... to me I Am the ... coolest kept the rate\nAt fresh air we try to bring our listeners interviews with the most important cultural figures of our time people like than men well but we can't do it without listeners support so please be there for us thank you [noise]\nGo to any P. R. dot net or call eight hundred six three nine eight eight five zero to do your part but don't wait because we are drawing the winner for those two tickets to the Hamilton by the great linen men will Miranda\nAt the Boston opera house on October thirteenth you could win them if you're in now any P. R. dot net or eight hundred six three nine eight eight five zero we've\nHad such a great response from listeners today contributing listeners who've stepped up to pay for the public radio station that they count on and we count on you were looking for forty seven hundred more dollars in the next half hour please pay your share right now maybe it's seven dollars\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events bases from board room to ballroom with Avi equipment an inhouse catering hotel north Hampton dot com\nZero is the number to call or go to any P. R. dot net it's really\nFast and thanks all things considered on New England public radio is funded by U. N. D. S. B. shows in association with any PR presenting madly in Beirut at the Academy of music theater in North Hampton on Tuesday October ninth tickets at the S P shows dot com\n[noise] by the law officers obsessing tumble Ryan and who's providing legal representation in family law and criminal matters in downtown north Hampton S. T. R. H. log dot com\nAnd buy a new catering celebrating sixteen years seven the ... valley and beyond through catering cooking lessons and unique food experiences PY catering dot com [noise]\nThis is New England public radio WFCR in Amherst W. N. N. Z. Westfield doubled you and end the FM Deerfield W and and then I Adams doubled you and then you wait Barrington\nDoubled UAIC Springfield and W. A. M. H. damaged in partnership with ... N. E. P. R. dot net live\nFrom NPR News in Washington I'm ... beer\nPresident Trump's derisive remarks about the woman who accused a Supreme Court nominee Brett Kavanaugh of sexual assault risk alienating some key Republican senators drop box Christine Blasey Ford at a campaign rally last night\nAnd be arched him back reports Kavanaugh's confirmation almost certainly hinges on boats from Senator Susan Collins Lisa Murkowski and Jeff Flake\nTrump mocked Ford's Senate testimony at a political rally in Mississippi\nHis attack on capitals accuser was greeted with cheers but where is the place I don't remember how many years ago was that I don't [noise] not so much on Capitol Hill Republicans have a slim majority in Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nEye and taking everything into account and I think if the president won yesterday\n... Dr Ford were totally inappropriate and in my view on\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nStreaming of New England public radio is funded by you and they passed the university graduate schools MS and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\n... states affected by Hurricane Florence and other recent disasters and NPR's David Schaper reports the money is including the bill reauthorized from the Federal Aviation administration and funding Federal Aviation programs the\nBill tackles a wide range of controversial air travel issues it requires the FAA to establish a minimum size for airplanes seats to stop the shrinking of leg room and it prohibits airlines from removing passengers from overbooked planes\nIt also attempts to shorten airport security lines by boosting the number of bomb sniffing dogs at airports and by funding new passenger\nScreening technologies it signed into law the bill would at ease cigarettes to the on board smoking ban it would prohibit talking on cell phones during flights and it would set new rules for transporting animals but an effort to limit the fees that airlines charge for checking baggage and changing reservations failed David Schaper NPR News\nSenators heard today from the leaders of national governing bodies for individual Olympic sports about how to protect athletes from abuse hearing follows a number of sexual harassment and abuse scandals across multiple sports usa bobsled in scouting CEO Darren steals says every organization as a responsibility to protect athletes\nCollectively we all represents Olympic sport I wouldn't want to order the one organization fails to protect athletes [noise] we all have failed that athlete\nOver the past five months the U.S Olympic Committee board of directors has expanded a fund for survivors of abuse the largest retail trade group is forecasting an upbeat holiday shopping season the national Retail Federation says it expects sales in November and December rise by between four point three and four point eight percent\nOn Wall street stocks gained ground that that was a fifty four points today you're listening to NPR\nAnd this is New England public radio News Good evening I'm ... an independent state healthcare watchdog agency says about this question to recline nests to patient ratios would increase health costs in Massachusetts by up to nine hundred and fifty million dollars a year\nThe health policy commission says the proposed staffing levels would force hospitals to boost hiring and wages\nThan sense he is with the coalition to protect patient safety which opposes the ballot question he says it would lead to hospitals cutbacks enclosures\nWhere they have to have hospitals make huge difficult decisions each and every day realistic decisions\nStreaming of New England public radio is funded by you and killing riddle architects of forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nIncrease a patient safety and says the health policy can mission is over estimating the effect on costs\nA Massachusetts man to use the hammer to attack and severely injured two neighbors has been sentenced to up to twelve years in prison Adrian Heinz who was convicted last month was also a sentence today to five years of probation for the attack in March twenty sixteen at a Westfield apartment complex\nThe victim said the attack was unprovoked and they still suffer from psychological aftereffects Hines says he acted in self defense\nConnecticut governor Dannel Malloy has accepted a teaching position at the Boston College law school\nThe school says I'm a lawyer who will leave the governor's office in January after two terms will teach in the spring as its Rapaport distinguished visiting professor at school says mulloy will offer a seminar and participate in lectures and Powell discussions throughout the semester and issues dealing with policymaking\nLloyd received both his bachelor's and law degrees from B. C.\nAnd the national weather service has come for being an E. F. one tornado in New Canaan, Connecticut Tuesday when severe thunderstorms rather move through the region NBC Connecticut says it's a seven to tornadoes in the state this year making it one of the most active tornadoes in tornado years on record\nAnd the national hockey league regular season begins tonight with the Bruins in Washington to play defending Stanley Cup champions capitals and the American and baseball's American League wildcard game pits the Oakland A's and the New York Yankees tonight in the Bronx the winner advances to a division series against the red Sox starting friday\nMostly cloudy tonight with patchy fog after midnight low around fifty partly sunny tomorrow slight chance of afternoon showers highs and the seventies it six minutes past six\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build them more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station\nI'm Scott Simon being public means more than just everyone can hear you what it means being free of commercial influence it means reporting to help you be more informed decision maker and citizen because you support any PR we can be mission driven rather than profit driven\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nInterviews that give you insight in context your support enables us to do this you're financial contribution helps ensure that you get comprehensive intelligent news coverage you can trust every day\nAs any PR remind you to make a donation we're reminded to say thank you for making this important public service possible\nThe phone number is one eight hundred six three nine eighty five zero or you can go to our secure pledge page it and eat PR dot net while you're there you can take a look at some of our thank you gifts that we've got for you but really when you donate to New England public radio you're doing it because you recognize that this is a valuable service that you're using it's also a valuable service\nFor your community and you want to do your part to make sure it stays healthy and thrives in remains right there on the radio for you\nOne eight hundred six three nine eight eight five zero I'm Sam ... here with Katie right Katie we're chipping away at\nThis call we are we're trying to wrap up our fall fund drives successfully for today's all things considered we have a goal of\nFour thousand three hundred dollars and I'm asking you to do your part of that to give right now whether it's ten dollars a month fifty dollars a month a hundred dollars a month or anything else gives now at N. E. P. R. dot net or ... eight hundred six three nine eight eight five zero take that step becoming any PR sustain or\nA if you've never done it before it just takes two minutes is very easy and it could bring you to see Hamilton on October Thirteen were pulling the winter for this Hamilton contest at six thirty so entering now any P. R. dot net or eight hundred six thirty nine eight eight five zero someone's gotta win might be\nAnd should be a huge warning sign to the Democratic party because all year we've been talking about how democratic enthusiasm has been outstripping Republicans and how that could lead to this event\nStreaming of New England public radio is funded by you ... Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall genes CVS dot org\nThem so far ahead falling flat whether it was tax cuts are talking up the broader economy even the threat of impeachment to the president\nNothing really fired up the Republican base until now is it clear that this is all about cap it off\nWell look I asked that question of our pollster Lee marrying off of a marriage and his response was this quote the result of hearings at least in the short run is the Republican base has awakened so it does appear yes it has been\nThe camera hearing 'cause we pulled a week earlier and we've seen this change he also stressed that there's um a month from the election\nAny number of things can and have happened in that amount of time and whether Kavanaugh eventually gets through or is eventually sunk\nWill really have some influence on how fire to Republican voters are anything can happen in those thirty four days\nWe've heard from Kevin ... and from his accuser Christine Blasey Ford what is the whole show about who people say they believe\nFound this really important and more are saying they believe Christine Blasey Ford than Brett Kavanaugh that was true narrowly when we pulled a couple of days before the hearing\nAnd it only has grown afterward about half of people say they believe Ford while only about a third say they believe Kavanaugh uh and that's been an increased margin from last weekend at first blush as Danielle mentioned earlier men and women are starkly divided\nA and it but it's really a partisan divide and the and actually it was really interesting here is that the largest group of people that say that they believe Ford in the poll that she's telling the truth democratic men [noise]\nYou've talked about enthusiasm when you look ahead to the election thirty four days from now or what do the numbers show about who the public would prefer to control Congress Democrats or Republicans right\nYear it's been through that Democrats has lead on this question to continue to lead on this question but only by six points now that's been cut in half\nIn the past month and guess what all of that movement in in the past week has been among men just in the past week those men have gone from being evenly split on whether they'd vote for a Republican or Democrat in their district to now saying they prefer Republicans by ten points\nWomen on the other hand give Democrats at twenty points advantage that's something that they've been saying all along so you can see really who vis a vis Kavanaugh hearing really affected and had the most\nStreaming of New England public radio was funded by Ewan Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\n[noise] I think absolutely that's one take away and I think that there there have been warning signs for Democrats\nThat that the blue wave wasn't going to be as big as it could be because Republican enthusiasm even at a lower level was still higher than out parties in past wave years it's NPR's medical mountain are with results of this new ... You're welcome\n[noise]\nIn Saudi Arabia and internationally known Saudi commentator has gone missing ... reportedly disappeared after entering the Saudi conflict in Istanbul on Tuesday and there's growing concern the columnist who's a vocal critic of Saudi Arabia is government\nMay have been detained by Saudi officials the state department says it is following the situation closely NPR's Jackie Northam reports for the past year ... has been a columnist with the Washington Post\nThe newspaper says early Tuesday Afternoon he entered the Saudi consulate in this temple to file some papers necessary to get married his fiance waited outside for him until early evening because she'll be never emerged\nTurkey's presidential spokesman even a him color and sit on Wednesday ... remains in the consulate and that the Turkish government raised the issue with the Saudis\nBut an official with the Saudi embassy in Washington DC was adamant 'cause she'll gate was neither ... nor in custody [noise]\nThe incident is raising concern that ... may have been caught up in Saudi Arabia is recent crackdown on free speech he had spent decades covering the twists and turns of Saudi Arabia's royal family often supporting the government's actions\nThat is until he apparently fell out of favor with Saudi Arabia's new crown prince Mohammed bin ... mind\nDuring an interview with NPR in may ... said life in Saudi Arabia had become repressive the government began rounding up activists and businessmen\nHundreds of sort of loose maneuver the ... when there is no rule for free the expulsion no tolerance for independent opinions\n... became an outspoken critic of the crown prince after some of his colleagues were arrested because she'll be left Saudi Arabia and moved to Washington where he continued to write a tough call\nStreaming of New England public radio was funded by you and cute little architect or forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com it's hard but\nUltimately the right decision\nOf sixty years old I don't feel like going to spend the rest of my life changes it's subsidized choice of ... I made that decision to leave\nEven though he was in Washington ... felt the long arm of the Saudi Government\nEven when I speak to you if you're somebody over my shoulder I have five hundred bucks and so I have friends on the government is having a hand on us\nAnd it just may have followed ... is temple Jackie Northam NPR News [noise]\n\nYou've been listening to all things considered from New England Public radio thank you so much for joining us today thank you so much for always being a listener to New England public radio now we're asking you to be a contributing listener to help sustain the program all things considered maybe MORNING EDITION wait wait don't tell me\nThat you count on that's an important part of your life that's an important part of your community pay for it now by calling one eight hundred six three nine eight eight five zero help us make sure that this is a program we can continue to bring you\nA New England public radio make your contribution not any P. R. dot net I'm\nSam public here with Katie right and Katie you've got an update on this\nThis goal it's true it's exciting to see so many people step up to become a part of the any PR family and please join them right now at any P. R. dot net or eight hundred six three nine eight eight five zero\nThree thousand dollars left are raised by six thirty were going to go to market place in less than five minutes I'm asking you to help us meet that goal and make sure all things considered as well as marketplace in fresh air are paid for can you be one of those can help us hit that goal any P. R. dot net or eight hundred six three nine eight eight five zero and oh yeah\nYou might win two tickets to see how she got you gotta you gotta do it in like five minutes exactly now is the time go to an E. P. R. dot net or call eight hundred six three nine eight eight five zero the contest is closing soon\n[noise]\nAnd win tickets to see handled in from any PR the hottest show ever on Broadway is hitting the road you could be in these great seats at the Boston offer house on October Thirteen and then you'll be treated to oh wonderful\nStreaming of New England public radio was funded by you and cute little architect or forty year legacy of commitment to community a design celebrating the next generation of leadership a cute little dot com called\nOne eight hundred sixty nine eighty five zero for online at N. E. T. R. dot net [noise]\n\nWe'd love to have you on that contest you could win but you've got to go now to N. E. P. R. dot net or call eight hundred six thirty nine eight eight five year this is your final chance to enter to win two tickets to the Hamilton\nAt the Boston opera house Daniel ... from Greenfield is in the contest he called to say I think public radio has civilized enforced on humanity\nFrom your lips to their ears honey any P. R. dot net to join Daniel or call eight hundred six three nine eight eight five zero now three thousand one hundred dollars left to be raised in just a few minutes there we go I think\nWe can do it please make your contributions now by calling one eight hundred six three nine eight eight five zero or go to any PR dot net just three minutes left to get your contribution in so that you can be included in that drawing for those Hamilton tickets\nYou're gonna feel good about yourself you're going to be paying for a service for a journalistic service that you count on and that you believe in\nWhen we believe in you do your part now one eight hundred six three nine eight eight five zero or go to any PR dot net\nI'm going to get you some palm palms area just share it out any hard dot net or eight hundred six thirty nine eight eight five zero take a step to protect independent journalism and make sure all things considered\nCan stay as part of your afternoon N. E. P. R. dot net or eight hundred six three nine eight eight five zero it's affordable because you get to set the amount if it's\nSeven dollars a month or Fifteen dollars a month or a hundred dollars a month it all goes to pay for your public radio station any PR dot net to join mark castle from Amherst he says I'm paying for on point and Terry Gross especially\nThank you so much mark good luck in the Hamilton contest it's closing in just a few minutes we'll get in now\nMaybe you're saying there's off all contribute next time next time you're not going to get entered into a drawing for those Hamilton tickets in right now do it one eight hundred\nSix three nine eight eight five zero or go to an E. P. R. dot net seven dollars a month gets you a great mug ten dollars a month gets you a different grade my twenty dollars a month gets you a great baseball shirt maybe on a hoodie that's thirty dollars a month but ultimately you are contributing because you believe in New England Public radio in the service at ...\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a ... you", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Amherst", "day": "03"}