{"month": "10", "state": "AZ", "station": "KJZK", "content": "If you're listening to the Arizona community radio network an eighty nine point five K. J. ca Drake Prescott belly Ninety plus one K. J. C. P. Prescott Chino valley Ninety point seven K Jaycee came came in Boulder City Nevada and a translator cake to one seven ... park in Ninety One point three death and\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in ... Arizona thirty miles east of ... historic roof sixty six to ... rescued exotic animals lions tigers cougars dancers leopards monkeys are more open every day no divide except you Dick historic route sixty six\nSupport for the Arizona community radio network is provided by Grand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feed them right out of your hand the hundreds of animals up close elk buffalo boroughs camels Kuwaiti Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\nFM J. J. D. V. Prescott Ninety point seven FM kj decay Kingman Ninety One point three of them in Flagstaff up\nYour weather forecast for Kingman this Sunday Morning sunny skies expected today was high switching to eighty three some columns southeast wins partly cloudy in the evening with the Loeb around fifty eight and ... mostly sunny highs reaching up to Seventy five\nPartly cloudy in the evening Loeb around forty eight in Flagstaff plenty has reached get through sixty nine to ... southwest breeze partly cloudy and the evening with all up around forty and you mostly sunny today has reached Ninety five partly cutting in the evening a low around sixty eight\n\nIt's ... like I said I'm here with you will have some great music coming up and just a moment we'll hear from Peter ... and John Clara no by punch brothers John Lee hooker junior let's start out with something familiar hears Coldplay [noise]\nYours\nYours will\n\n\n\n\n\n\nNah\n\n\n\n\nAnd I and I\n\n\nThere are\nThem\nAnd they're not\nI mean you\n\n[noise]\n[noise]\nThat\nAnd I don't know [noise] and I are much [noise] I Know I\n[laughter]\n\n\nThey don't then in\n...\n... yeah I Am in a pretty you\nYou be me why\nI don't mind yeah\nKnow\nKnow when a ...\nNot have paid the dream\nYou see them when\nMind yeah don't\nUm I don't mind yeah ah no\nA mine yeah adult not an\n\nA worst shovel the rope and you're listening on the current\nWhere they were then you're going to be a\n... dollar guy\nBy the burden\nManning in mind but as you are\nMay never been a ... they're going to win win but through the history behind it never\nThen you need them but you are in in ...\nOut there and not very\nGo about our law\nI'm Down in there where the guy in that area to area\nAnd I made a married man but I may never Dan Rather stay in\nGod I mean ... ... ... no one\nWay or\nNa na na na na na\nNa\nNa na\nNa na na na\nNa na\nNa na na na\nNa na na\nNa na\nNa na na na na\nNa\nNa na na\n\nMm my non\nDo ... ...\nNot\nNo we all\nAnd then dream can\nProduce um line and\n... ... ... ... ... ... ... ... ... ...\nA long\nWay\nI'll\n\n\n... ... ... ... ... per se\n\n\n\n\n\n... ...\n... ...\n... you\nMe is the longest season is Jeanette\n... ... ...\nAs fast as I didn't\nThe freedom we struck me you know ...\n... the loser the what's the reason we\nWith this new huge ...\n\nYou always well ...\n\nGet angry\nThe guy who\nHave you ever see them go\nFrom there is wide and they've got in ... there will be says the man do you\nIssue and he knew\nWhat they get ...\nGet in there and read\n\nThat can be you have a warm boy that's Marty Stuart ... with old Mexico they left slack and Abigail Washburn gave us what you're going to do\nAnd it went punch brothers with the jumbo with clarity nope I at the top of that sat and electric it's an ... I'm ... if you're just joining us welcome huge John Lee hooker jeering here\n\n\n\nI see a lot of the world but I have done that in most states are grown and I'm a\nMom\nNow has\n\n\n\nNew droid already I\nAlways wanted to be just like Bonnie and Clyde mom over to our country\nTo thrive on line to be crazy to me how you see I\nDon't\nKnow\nI\nYes I Am\n\n\n\n\n\n\nI Will go dark out or darker\nTrump bank not about to\nSay you do not care about my bread on you know\n\nNow\n\nEverything\nI got it from buffalo\nNew York\nWent on the phone for you but I never learned today and I don't doubt", "year": "2018", "show_name": "Documentary Specials", "city": "Kingman", "day": "28"}