{"month": "10", "state": "AL", "station": "WAPR", "content": "Skies mostly to partly cloudy highest today will be in the mid to upper eighties and we have about us thirty percent chance of rain you're listening to a PR\nMrs Alabama public radio service of the University of Alabama W. H. P. R. sounds cute the I like those shows\nW. H. I. L. movie W A L F in Tuscaloosa\nDevil you teach history be the Tuscaloosa\nEvery case though we are we are we are we we are Alabama public radio [noise]\n[noise] kind of get healthy [noise]\n\nThere are lots of ways to get to Carnegie Hall the subway a taxi walked down fifty seventh street you've just found another way to get to America's most famous home for classical music this is Carnegie Hall live the broadcast series that gives you a front row seat for concerts by some of the greatest artist and the world\nYou hear the performances exactly as they happen and you are part of the audience sharing the experience of music making at Carnegie Hall\nIn just a few minutes one of the most exciting young pianists of our era\nWill take the stage of Carnegie Hall and dig into a formidable program that includes one of the most famously challenging works in the whole repertoire that pianist is huge along she'll play to blood spy Brahms ... eight parts sweet called Chrysler ie honor\nAnd then the second half of the recital she'll toss off a little ditty by Beethoven his mighty\nHammer clear so NATO\nI'm John Schaffer and joining me for this Carnegie Hall live broadcast there's another young and highly accomplished musician is the principal clarinet ... of the New York philharmonic\nAnd that is of the New York philharmonic Anthony McHale Anthony welcome to Carnegie Hall line it was John So working with the New York philharmonic would have probably given you at least one or two opportunities to work with huge long she seems to have a certain charisma on stage set up backstage thing as well\nOh yes yes such personalities like bursting with it and then you hear a play and it's like wow yeah\nWe'll hear more from Anthony but we also want to hear from you and we'd love it if you joined the Carnegie Hall live Twitter conversation\nUse the hash tag C. H. live and let us know where you're listening from the piano future wrong turn twenty nine earlier this year she's become famous Anthony for her powerful technique and for her rhythmic precision\nShe eats technically difficult pieces for breakfast she's also praised for her musical sensitivity and her good taste her reputation rests on gnarly flashy rich pieces by ... modern off and that's why this specific program is so interesting\nYeah it's it's the first time that she's going into this deep serious and German romantic repertoire and she took some time to speak with our colleague Jeff surgeon to talk about how she knew if and when this was the right time to play drums and ... and Beethoven and public\nNot sure if it's still the right time but I got to learn them sooner or later I have to\nFace the masters and you know the more you play them and there's just so much possibility in every contact completely be a new he's just depends on a simple thing like\n... that's an interesting\nIs that because some people would say that you need to grow up not you but anybody needs to grow up before they place I always tell myself you know I Need to grow up in life when in fact he\nBut he doesn't have a like\nA piano future lungs speaking with our own Jeff surgeon and talking about this very grownup recital program which is about to play here at Carnegie Hall that begins\nWith two ... by bronze Anthony are you familiar with the old Scottish ballad known as\nEdward knew or not it's a murder ballad in which a mother continually quizzes her son as to why he is dripping with blood and coming up with one strange ... answer after another until finally the truth emerges that he's covered in blood because he's just murdered his father\nSounds like an opera yeah good good in a family affair right\nBut this is the story the Brahms had in mind when he wrote\nHe wrote the first of the to the lives\nThe second ... does not have a specific story behind it nobody gets hurt in the right [laughter] we hope not [laughter] it's opening note sound a little bit like that famous Brahms Lullaby but Brahms didn't write the lullaby into fourteen years later\nThe tube allies aren't related keys the first open to number one is in the minor the second focused ten number two is in the major and that helps tide them together\nAnd speaking of time things together there's been a direct connection between ... and ... who is Chrysler ... we'll hear huge along performing after these Brahms the lodge a shoe on called his piece Chrysler ... a fantasy for the piano which is a really wonderful way to describe an eight movement piece that goes\nBack and forth between two different moods and two contrasting keys\nBut first we have the matter of the Brahms belonged to a to hear the opus ten numbers one and two with the pianist huge along about to make her entrance on the stage here in this country has\n... from the hope is ten ...\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nLonger in in in my life has\nI\nIn the ...\n\n\n\n\n\n\n\n\nAs she mentioned you know when you have the fingers flying it's very easy to kind of lose track of the fact that there's so much depth there you know an artist like huge will take you a lot deeper than just the flying a finger so it's something\nWe all struggle with how do we find that place how do we go there you know huge along about to walk bias onto the stage of Carnegie Hall\nAn equally warm equally el against the different [noise]\nYes first session of Congress\nSpeak open some years\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\nBig audience here\nFor ... years ago when now\nReally sunny me things\nSort of a surprise on some voices listeners saying things like the new research here with the Russian repertoire evening German romantic\nBack out on stage for another ... years Carnegie Hall\nAnd after that her really perform swine [noise]\n\n[noise]\n\n\n[noise]\n\n... ...\nEmail us ...\nMe in trouble\n\n\n[noise] [noise]\nWhich is in the\nYou're not really\n\n\n[noise]\nYeah\nSpin Rhonda my son cheaper\n\n\n\n\n[noise]\n\nThe true but I don't think you are calling version thank you for listening I'm drawn\nTo Carnegie Hall [noise]\nSupport for Alabama public radio comes from our listeners and in part from the sponsors\nFriends to Birmingham botanical garden welcoming pacemakers dealers in speakers do antiques that the gardens October for through seven more information at BB gardens dot org slash antiques\nRoosters Latin American food and historic downtown mobile offering fresh authentic style tacos burritos margarita and deer served in a casual fun environment fresh air outdoor dining available more at roosters downtown dot com\nChildren's of Alabama the state's only freestanding pediatric hospital serving ill and injured children from all across Alabama and the southeastern us since Nineteen eleven information at children's A. L. dot org\nUnited cerebral palsy of West Alabama serving people with disabilities and helping them to live life without limits more information at UC pie W. S. dot org or to zero five three four five three zero three one\nShoulder shift in innovative effort to attract nurture and promote the creative in tech economy of the shoulder region by redirecting the future through collaborative event and mentor ships supporting sustainable growth more ... shift dot com and on Facebook\nThis is Alabama public radio service of the University of Alabama W. H. P. R. film WPRI Michael shows\nW. H. I. L. movie Wu A L F ...\nW two to three ... Tuscaloosa\n... and they felt we are we are we are we are we are Alabama public radio [noise]\nAnyway [noise]\nNew York city there are a lot of ways to get the Carnegie Hall the subway and taxi walk down the fifty seventh street you've found another way to get to America's most famous home for classical music welcome to Carnegie Hall live\nThis broadcast series brings you Carnegie Hall concerts by some of the world's most celebrated artist and you hear the performances exactly as they happen you are part of the audience sharing the experience of music making\nAt Carnegie Hall and the program features just one piece but it is an ethic a symphony by goose stuff Mahler his third played by the Israel philharmonic and their music director the original jet setting maestro ...\nI'm ... with me here tonight is a Texan treasure she is America's favorite metro soprano when the only one of us who performed Mahler\nOn this very stage Susan Graham good to have you with us from Carnegie Hall live thank you John it's a pleasure to be here as always so why did he chews Mahler symphony number three for this tour well we spoke to him after rehearsal this morning and he gave us a few reasons\nTo say is probably my favorite model if\nHe loses hide out openly before you\nHas no inhibitions\nSuch an imagination\nHe's indicates each movement to another part of nature\nThe guards had been holding his kingdom the first movement down to the feds move in a post men play on his first torn because views of Trump is and then last movement of course he's going to see\nMy colleagues here they pleased with such devotion indication\nThe Simpsons if you'd like to stop conducting just listen to them\nWell let's hope that doesn't actually happen Susan beaches [laughter] that would be a major train wreck there's a lot of people out on yeah there's lots and lots of moving parts choruses an orchestra members and so is of course Israel philharmonic ah the master voices their artistic director is Ted Sperling\nThe Manhattan girls chorus their artistic director is Michelle are still early and the metro soprano tonight out on stage is Bianco foods you Maura now I'm Susan\nThe score calls for an Alto\nYou know we use those terms rather loosely sometimes\nTerms rather loosely sometimes stray [laughter] okay I'm In the range is actually\nVery middle it's not doesn't go very low at all and it does go a little bit higher than some control those might be comfortable singing which is why you know and that's those are pronounced it's typically a little bit higher than I've been trying to do is usually pretty comfortable singing that\nWell Susan Graham you've been a familiar presence here in New York two hundred performance is at the Metropolitan Opera almost two dozen concerts here at Carnegie Hall do you remember the first one [noise]\nSomething from\nYour encore was music by in fact ... mall or one of his record leader leaps to ensure height if you love for beauty here's Susan Graham recorded live with Malcolm march into a company can hurt the piano\n\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\nShe was in grammar recorded live here at Carnegie Hall that was her official debut with Malcolm mark you know at the piano and one of ... ... leader leaps do I'm sure in height if you love for beauty\n[noise]\nWe will hear the form of ... any number three with the master voices the Manhattan\nThan the Israel\nIs conducted\nBy Susan made from Carnegie Hall why\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "Classical Music", "city": "Selma", "day": "01"}