{"month": "10", "state": "AL", "station": "WAPR", "content": "On the average day we service um anywhere from three hundred four hundred orders in Los Angeles right now and the number is growing every day\nI'm ... you know that industry need by the white disruption that's what it needs tech companies and we'd like salmon marketplace\nThe next time for marketplace is six o'clock today coming up later here on a PR\nJoined the friends of W A L and helped put the ... back in public radio joined afternoon of good food beer trivia and music with proceeds benefiting the radio station you\nYou've been takes place Saturday October twenty seven from two to five PM which city Brewing Company in Tuscaloosa bothers include words got architecture the Tuscaloosa news in Buffalo rock\n... on line and if you have\nMore information go to a PR dot org slash de Tom public [noise]\nThey didn't tell them I'm not really rainy out there because of the University of Alabama WNPR Selma noble you keep your Muscle Shoals town about the\nW. A. L. S. than technically\nW two to three ... Tuscaloosa W to six for me I mean\nWe aren't Alabama public radio [noise]\nAnd we're a little chilly across the state of Alabama this morning thirty eight degrees in North Alabama right now it's fifty four along the Gulf Coast\nSkies are a sunny to mostly sunny across the wasting area very minimal chance of rain sixty nine the high in North Alabama about Seventy six the high today along the Gulf Coast\nI'm David Greene good morning it's just about a minute after nine o'clock and we'll get things underway musically with some selections by handle these arrests three pieces from the royal fireworks music arranged for brass\nOh\n\n\n\n\n\nAll\n... and na\nNa\n\nNa\n\nNa\nNa na\nNa na\nNa\nNa na\n\n\n\n\n\n\n\n[laughter]\nWell look what look what look like whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa\n\n\n\nThe U.S army band branch Clinton was removed from the royal fireworks music by George Frederick handle\nI'm David ... nine awake good morning you're tuned in for classical music here on NPR beautiful they cross the street to a bit cool we'll have a high today in the sixties to maybe mid seventies along the Gulf Coast guys will remain mostly sunny and it'll be cool for the next day or two\nAlways in the air and so I guess we might as well get used to it at any rate to support for programming is\nComing in part today from dolphin island sea land presenting shouldn't corks culinary arts gala coming up friday October twenty six from six to nine PM between teams from eight ... county high school\n... yards gala coming up friday October twenty six from six to nine PM featuring teams from eight mobiles county high schools music food marine science at the ... more at D. I. S. L. dot O. R. G.\n... teeny was Newtonian baroque composer and violinist intended by his parents to become a Franciscan fryer\nHe's studied music while I'm learning to learning of the ways of the church but eventually went to the University of Ottawa where he became known as a storage man he was very skilled at sensing\n\n[noise] [noise]\n\nMhm\n[noise]\n\n[noise]\n\nSon auto by Antonio ... has performed by an early music ensemble known as quick silver\nAnd it's nine twenty six my name is David ... your host for classical music here on a PR Alabama public radio good morning and welcome\nThanks for being here at our programming today is supported in part by the Alabama Senate for childhood cancer and blood disorders located at children's of Alabama more online at children's A. L. dot org slash committed to if you were\nAlso the color house College of business announcing its new masters in business analytics degree program now accepting applications for fall two thousand Nineteen more at Culver house dot U. A. dot\nEdu\nOr next election is from a brand new this kid features organist Stephen J cat her now is Steven began playing the piano at the age of four\nPicked up the Oregon several years later and the rest is history the disc is called this time it's personal personal favorites of cat and areas for farming a corral prelude by Jay Spock\n[noise]\n\n\nUm\n[noise] where\nYou're\n\n\n\n\n\n\n\n...\n\n[noise]\n\n\nMore Muscle Shoals sound studio dot org\nAmong the offerings coming up next our we'll be hearing one of the later symphonies by heightened also a brand new recording of a sonata for violin and\nKeyboard to buy a Beethoven that and more coming up next our here on NPR probably will be ... this hour as a piece for violating the guitar by Margaret Giuliani his variations if you want specifics is open twenty four David Starbucks on guitar him all your hall on violin\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\nDa da\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nThe symphony number eighty by heightened has performed by the Australian Gary in heightened ... they were conducted by Adam Fisher\nI'm David ... ten Twenty one and you're listening to Alabama Public Radio's classical music\nSupport for our music comes in part today from mid center urgent care and family medicine\nOffering their primary care center Wednesday through friday nine AM to six PM inside the mid center north location in Tuscaloosa more information at two o five three three three nine for six seven or ... urgent care dot com\nEdward el ... probably the preeminent British composer in the late night teens and early twentieth century want to be best known pieces is a set of things called the enigma variations [noise]\nOne of the more beautiful selections from that one of the variations is called numerous anti reduced transcribed for brass performance by the black dyke band they're conducted by Nicholas John\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nEric ball made that transcription of name rod from the enigma variations by Eldar the black died band led by Nicholas child\nI'm David duff and this is Alabama Public Radio's classical music ten twenty six is the time\nAnd support for our programming comes in part from the Tuscaloosa symphony orchestra presenting malice and majesty side by side with a hug suffered symphony tonight in moody music concert hall at seven PM tickets and more information AT T eh so online dot O. R. G.\nAlso dancing things in iron Dale serving Alabama since Nineteen Seventy nine was complete selections a dance where in point choose including professional feeding walk in and dance out\nOr next pieces from a brand new recording ... teaches features to Montreal based musicians Andrew one violinist to see a concert master of the Montreal symphony orchestra and award winning Montreal based pianist Charlotte we showered handling\nYour they are with the new recording of the violence an odd number eight by Beethoven\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\nKnow that's kind of a bad\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n\nMhm [laughter]\nI don't know if we\n\n\nSo now there are number rate for violin and piano by ... brand of recording by violinist Andrew one and piano sharp retard and I'm David dumps about ten ...\nPiano by Beethoven and a brand new recording by violinist Andrew one and piano Charlotte ... Emily\nI'm Dave adopted about ten forty seven this is classical music on a PR\nComing up among the offerings in the next hour some American music from a couple of different composers won a whipping composer Carl named Charles gentler\nWe'll be hearing is wild Mustang sweet also after that Appalachians spring by Aaron Copeland that and more in our next hour here on NPR\nFinal piece this hours an overture by jak amount Meyer bare your church who was offered the star of the north the New Zealand symphony conducted by Darryl ...\n\n\n\n\n\n\n\n\n\n\n\nSees\n\n\n\n\nI'm I'm I'm [noise] I'm\n[noise]\n\nMm\n[noise]\nUh\n\n\n\nMm\n[noise]\n\n\n... [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n...\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\nI'm David ... eleven thirty nine or a music supported in part by the Huntsville symphony orchestra and they're sixty fourth season\nFeaturing the music of Harry Potter in Star Wars Tchaikovsky five the best of the eagles and Mozart's Jupiter more information about the upcoming season or the current season and ages so dot org\nAnd support also comes in part from gears in beers a cycle you get up with a ride for every ability in Mobile Alabama featuring the Alabama back roads century series by you one hundred stretching from downtown through back roads to by using beaches\nRegistration information at gears in beers ride mobile dot com\nComing up of course next hour read something old something new man that will be followed by performance today at one o'clock will finish out this hour with a piece for harp in fleets the so now the country's time dean e flat by Louis store Robert eight k'naan flus and Erica Goodman on heart\n\nThey cannot stay in their ... Goodman on\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]", "year": "2018", "show_name": "Classical Music", "city": "Selma", "day": "22"}