{"month": "10", "state": "AL", "station": "WAPR", "content": "Something a little something new from noon to one\nAnd performance today for one to three first hour a ... a heightened\nAnd the loyalty coming up on classical music\n\nThis is Alabama public radio a service at the University of Alabama [noise] W. H. P. R. Selma them you can't pay our muscles shells that your age I Am\nNow the W A L F them ... ... the Tuscaloosa there'll be fixed\nFor eight I made the we are Alabama public radio [noise]\nIt is nine o'clock and let's begin the program we call classical music I'm here today for David ...\nFirst off we're going to listen to the piece from Antoni of all the like to remind you that support for our programming is provided in part by the Kennedy Kennedy Douglas trust let's try that again\nSupport for classical music has provided in part by the Kennedy Douglas crust the Florence, Alabama in support of classical music\nThis is from a CD from the virgin a beret toss label Fabio be are beyond the end you'll robot ... a a performs a several pieces of pro forma pardon me several pieces from Antonio Vivaldi\nThis first one ah features beyond the leading the euro ... also a as lead violinist Isabella long ago um is also a violinist mode ... is the cellist\nThis is the concerto number eleven for to violence cello and screams from Antoni of all the as we begin today's edition of classical music\nMan I don't\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\nLots more great classical music supports provider department Tuscaloosa symphony orchestras new season ballot majesty featuring ... such as this didn't show up to ... which tickets available to us a long line of war jeep\nAnd United cerebral palsy up west Alabama surfing people with disabilities helping them to live life with uh\nLife without limits more information at UC pie W. A. dot O. R. G. or to zero five three four or five three zero three one\nFall weather fall like weather and I finally fall is indeed officially here and I'm here we are on the twelfth day of October and some um lovely whether or not complaining a bit on the chilly side and it is a bit brisk and\nJust as I say a fall like in a people rejoicing a all over the place because uh we are experiencing some\nCool weather for a little while right now in the shoals and throughout the Tennessee Valley a high today Seventy one degrees overnight low fifty two fifty two right now in that area [noise]\nPartly sunny sky should prevail throughout the or a PR listening area today Tuscaloosa and Birmingham right now sixty Seventy seven should be higher this afternoon overnight low fifty five and\nCentral part of our state Selma Montgomery partly sunny skies a fifty eight degrees\nRight now Seventy six should be the high fifty four overnight low a bit warmer along the coast uh partly clout I beg your pardon a mostly sunny throughout the throughout the day and we'll be Pensacola Baldwin county\nEighty four degrees should be the high today with a an overnight low of about sixty sixty right now in a in the coastal region of are listening area\nI'm ... and I'm here today for David duff and we\nMove from heightened to a ... to ... this is the bend a violin concerto ... bend a who\nLived throughout a great deal the Eighteenth century born in Seventeen own nine lived until Seventeen eighty six this is\nYvonne is a lot on violin accompanied by the Prague they'll harmonious brothers like Ben does violin concerto in sci major [noise]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\nEarly nineteenth century that is free Greeks ... good first step but are you ... eat last matrix\nGerman radio Phil harmonious conducted by Frank bourbon you're listening to listener supported Alabama public radio I'm Bob woodland I'm here today for David dust on this Friday it's twenty eight minutes after ten o'clock and you are in the midst of some great classical music hope you have noticed\nA classical music built three this afternoon 'til noon on this program we call classical music then we um right after NPR News at noon it's something a little something new for an hour and then performance today a from one to three\nSupport for classical music has provided in part by focus women's conference featuring more than twenty five speakers workshops and panel discussions to encourage educate and empower women October nineteenth\nThat the um coming up in a few days Mobile Alabama scheduling to get set a focus women's conference dot com might theater Tuscaloosa west Alabama's community theater\nProviding quality entertainment and educational outreach for more than four decades information about auditions workshops and performances in theater ... dot com or to zero five three nine one to two seven seven and by the Alabama Center for childhood cancer blood disorders located children's of Alabama\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise] [laughter] [laughter]\nAll that\n[noise]\n\n[noise]\n\n\nSo I'm On the [noise]\nThe on the on the on the line to walk down\n\nIt is Eighteen minutes till eleven o'clock I'm Bob ... you're listening to Alabama public radio service at the University of Alabama\nThis is classical music we just heard a free ... brothers a woman a composition of fantasy all the Scottish here we're not by the uh Leno ensemble\nAs we continue with the great classical music up next why keen to Dina\nSupports provided in parts of the eastern shore art center at four O. one looks region fair hope exhibits open ... with the public reception the first friday in the months ... hours ... art classes and outreach programs it yes our chatter dot O. R. G.\n\nAnd by the va health part of the you will be health system offering viva Medicare education event and various locations across the state detail\nThe state details such as dates ... can be found that eight hundred six three three you won five for two or one ... one one for T T Y users\n[noise]\nJust a garden in the Czech Republic that is home to some of the most important green peas in history that's where Gregor Mendel\nLaid the foundations of genetic science in the mid Eighteen hundred [noise] there's a connection between those peas and classical music more on the next performance today from ape yeah [noise]\nYeah we were before much today at one this afternoon on listener supported Alabama public radio and right now we just got lots of great classical music coming up what can you tell Reno of Spanish ... you were born in ... or should deal if you prefer\nA he wrote this well known piece the a ... and now we're going to listen to a couple of moved much from the dawn says fun ... ecstasy and a daydream from\nSpanish composure Joaquin ... Lopez ... the ducks the Cincinnati Symphony orchestra\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\nDid by ... Lopez ... with the ... ... ... ... ... that close is our number two\nOf today's edition of classical music lots more to come\n\nVisit Alabama public radio service of the University of Alabama W. H. P. R. sell more than ... our muscle shell that your age I Am\nNot beyond W A L F him just a little ... the Tuscaloosa there'll be six\nFor eight I made the we are Alabama public radio [noise]\nIt's eleven o'clock and we begin the third our today's edition of classical music I'm Bob woodland I'm here today for David ducked support to provided in part by Alibaba coasting marketing event management in digital solutions and publisher of the new discovered coastal Alabama magazine\nAnd the Alabama State partner for the world food championships more information at Alabama coasting dot com first up Eduardo\nLow we don't know a lot about ... ah he lived in a group through a great deal of the nineteenth century lived until Eighteen Ninety two but\nHonestly of his uh fifty or more works very few are are known despite all the admiration from is a contemporary such as ... Claude\nClaude WC we're going to listen to one of those pieces though today as a ... at the ... the uh the the cellist keys but kills conducts the Malaysian philharmonic orchestra\nIn the Edward Lolo concerto in the minor for cello an orchestra from Eighteen Seventy six\n[noise]\n\nMm\nMm\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nMm\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nEduardo ... ...\nSo do you begin the third our of today's edition of classical music that's the killer concerto\nIn D minor from low\nLow ah ... in the mid part of the nineteenth century ... five feet and it was the dumbest the Malaysian philharmonic orchestra was conducted by keys but kills I'm Bob ... up next\n... on a classical music supports provided in part by men are grocery in Delhi Tuscaloosa is locally owned and natural food store\nOffering organic groceries and nutritional supplements since Nineteen eighty open Monday through Saturday nine AM to seven PM serving lunch for the love of the two thirty daily menu at ... grocery dot com\nAnd my friends of Birmingham botanical gardens allowing opportunities to explore Alabama's rich bio diversity through a certificate in native plant studies program\nClass registration and more information at BB gardens dot O. R. G. slash see\nIn P. S.\nEleven twenty eight cool weather in our ape you are listening area this afternoon mostly sunny skies\nThe rule out from North the south and we turn now to the planet ... a ... it's a\nWell known piece featuring the seven planets uh people used to say well Pluto's not included well Pluto is no longer included either so we have bars Venus\nMercury Jupiter Saturn Uranus\nAnd Neptune and of course earth would be the eight one this is the holds Mara this is a Mars and Venus for all the planets the conductor is Peter ... engine the Toronto symphony orchestra performs\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nMars and Venus from my ... the planet the Peter ... conducting the Toronto symphony orchestra\nIt is eleven forty six you're listening to Alabama public radio and this is classical music support to provide a new part by yoga Jim delivering yoga lessons the students regardless of experience or body type\nLevel classes encourage beginners challenging cultivate the practice of more seasoned yoga practitioners more yoga Jim L. O. C.\nDot com and like ... funeral home in criminal tore a full service funeral home serving Baldwin ... counties burial available in all cemeteries including the new veteran's cemetery in Spanish fork information the two five one six two one five eight nine she wrote or he was F H. dot com\nWe closed today is an issue of classical music with is from ... a sense all the um ... is a ... a good often the b._b._c. Scottish symphony orchestras conducted by Martin Robin ... this is the essential violin concerto number one\nIn a major [noise]\n\n\n[noise]\n[noise] [noise]\n", "show_name": "Classical Music", "year": "2018", "city": "Selma", "day": "12"}