{"month": "10", "state": "AL", "station": "WAPR", "content": "Ohio I'm kind of resolve why this time around both parties the the young vote that next time on marketplace [noise]\nAnd the next time for marketplaces six o'clock today right here on NPR\nSupport for Alabama public radio comes from our listeners and in part from the sponsors Dauphin Island and the village of ... county where venture comes naturally more information addict film or dot com\nThis is Alabama public radio service of the University of Alabama [noise] W. H. P. R.\nT. V. shows W. H. I. L.\nMovie W A L F in Tuscaloosa\nDefinitely teach history the the Phillies\nNow we are we are we are Alabama public radio [noise]\nAnd as you know a tropical storm warning in effect for the Alabama Gulf Coast stand a hurricane warning in effect for the Florida Gulf Coast to wind up to about forty miles an hour along the Alabama Gulf Coast that'll be much much higher along the Florida coast where a hurricane Michael\nIs striking it's a category for hurricane winds up to a hundred forty five miles an hour\nAnd might even increase dangerous hurricane\nUm hopefully if you're in the sound of our\nOur voice or listening area you've evacuated from the areas where that's been been recommended but\nTo be safe than stay tuned to Alabama public radio and we'll keep an eye on things and let you know\nWell right now some music by Bach has arranged by rock modern off\n\nThis is a sweets taken from apart cheetah for unaccompanied by only and again the music by boxing arrangement by right come on and off and the performance by old occur\n\n[noise]\n\n[noise] [noise]\n\n[laughter] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n[noise]\n[laughter]\n\n\n\n\n[noise]\n\n\n[laughter]\n\n\n\n\n[noise]\n[laughter]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] [laughter] [noise]\n[laughter]\n\n[noise]\n[noise] [noise] [laughter]\n[noise]\n[laughter]\n[noise]\n\n[noise] [noise]\n\nMm [noise] Mm [noise]\n[noise]\n[noise] [laughter]\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n[laughter]\nMm\n\n[noise]\n\n\n[laughter]\n\n\n\n[noise]\n\n\n\n[noise] [noise]\nThree movement's taken from a parts heaters for unaccompanied violin by Bach again transcribe by ... modern off all the current at the piano from it is good variations in transcription that discuss on harmonious Monday like\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nAndrew Mann Z so living on violin along with the English concert he was also conducting the group in back insured when see by the faulty\nYou're listening to Alabama public radio good morning it's nine twenty seven my name is David ... from your host or classical music\nAnd by the way our music today is supported in part by the eastern shore Arts Center at Fort Irwin oak street in fair hope exhibits open with the public reception the first friday of the month information on ours exhibits art classes and outreach programs at ES art center dot org\nAnd also a man of grocery in Delhi Tuscaloosa as local yo natural food store offering organic grocery saying nutritional supplements since Nineteen eighty open Monday through Saturday nine AM to seven PM serving lunch from a\nLiving just two thirty daily menu at manner grocery dot com\nTell them on a prolific composer published of course orchestral music vocal music and a good bit of chamber music as well\nThese were about to hear 'em is from a collection called musical exercises it was a collection that to tell them I published while he was at the peak of his career it consists of twelve each in alternating sequence solos in ... for flu shots recorder\nOzone and via when all of them with a base continuum of course this one is called is so low in B flat it is for ... in continual ... Goodwin sewing on open\n[noise]\n[noise]\n\nSolo in ... and continue oh from a collection of musical exercises by tell 'em on Paul good when this all most of what was then that recording\nEnd at nine forty one I'm David ... you're listening to our classical music here on a PR\nOr music this hour supported in part by the exchange offering co working space in the heart of downtown mobile including private offices team offices conference rooms are full kitchen and cafe into balconies overlooking downtown membership option said exchange too old to dot com\nAnd also the Alabama standard for childhood cancer in blood disorders located at children's of Alabama more on line that children's AOL dot org slash committed to what your\nWell there's no doubt that one of the bigger hits ...\nThe bigger hits by handle is this idea that we're about to hear it's what the bright Sarah Pham from his oratory Sampson the air and course performed by soprano windows the sixteen trumpeter crispy and steel ... and the Academy of St Martin it must be\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\nAh [noise]\n\n\n[noise]\n[noise]\n\n\n\nOh that was [noise] [noise]\n\n\n\n\n[noise] [noise]\n\n\n\n\nNah\n\nWith a bright Sarah I'm from Sam sin by handle Lynn Dawson on a limb Dawson the soprano crispy ... son trumpet the sixteen was the chorus Sandy Academy of St Martin in the field the orchestra\nI David ... nine forty nine and a well go ahead and continue the shoppers music with a violin concerto by drone are the Andrea kept away the violin and the European Community chamber orchestra\n\n[noise]\n\n\n\nA violin concerto by patron ardine and a performance by Andrea ... and the European Community chamber orchestra\nTo search for hurricane Michael is come ashore especially around the Appalachian coal and the surge around four feet now expected to be possibly up to fourteen feet before um hurricane Michael has moved through\nThe entire Gulf Coast too so under watches and warnings hurricane warning for Florida tropical storm warning for the Gulf Coast of Alabama especially if you're out and about the well hopefully you aren't out and about in the Florida area but if you're along the Gulf Coast\nAnd are still there to be careful and we'll keep an eye on things bring you whatever whether information comes to us but again the hurricane Michael the storm surge is moving into the Florida Panhandle area\nAnd again we'll we'll keep you advised as information comes to a seven minutes after ten o'clock and you're listening to NPR\nThis is Alabama public radio service of the University of Alabama W. H. P. R. U. P. R. my shell W. H. I. L.\nW. A. L. S. in Tuscaloosa\nW T two three beat the Tuscaloosa\nElie Wiesel I have found we are we are we are we we are Alabama public radio [noise]\nThe chrysanthemums by Scott ...\nThe chrysanthemum by Scott Joplin arranged for brand and performed by the royal guard brand some some\nNumber\n\n[noise]\n\n\n\nNo\nNo no no\n\n\nNo\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nMm\n[noise]\n\n\n\n\n\n\n\n\nString quintet number three by notes are says performed by the talk of the court to act and they were joined by be elected\nWe're joined by violist Dennis currency\nI'm David ... seven hurricane Michael a category for with wins about two hundred fifty miles an hour as it approaches the Florida coast\nTropical storm warning and flooded vice re still in effect for the Alabama Gulf Coast the tropical storm Warren again until six Fifteen and the coastal flood advisory until seven\nO'clock Steve do do a PR will bring you information as it comes to us this is where you turn for NPR News classical music whether information as well you were listening to a PR\nPublic radio at the University of Alabama W. W. H. I. L.\nMovie do you you A. L. S. Tuscaloosa\nThat keeps you busy\nWe are we are we are Alabama public radio [noise]\nThis sweet by Tchaikovsky used kind of loosely based on groups dance for arms or broke stance sweet it begins with an introduction\nIn few followed by a diverted 'em in in in ... so a miniature march as scared so and the good the or Castro sweet number one by Tchaikovsky the Detroit symphony conducted by maybe year\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[laughter]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nMm\nMm\nMm Mm Mm\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nThe orchestral sweet number one by Tchaikovsky the Detroit symphony is conducted by maybe army\nI'm David dumped about eleven forty for ... hours programming is supported in part by shoals shift and innovative effort to attract nurturing promote the creative in tech economy of the shows region\nBy redirecting the futures through collaborative advancing mentor ships supporting sustainable growth moderate shoals shift dot com and on Facebook\nAlso the forty seven ... festival of the arts coming up on October twenty isn't twenty first from nine AM defy being featuring visual artists from across the U.S live artists demonstrations music and spoken word performances\nFood trucks and children's activities as well more at ... dot org [noise]\nBut these pieces from a new disc featuring an ensemble called the lumina duo merited Titus is on ... Jenny Parsons on piano performing an arrangement or a piece that rebel composed for solo piano his son of teen\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]", "year": "2018", "show_name": "Classical Music", "city": "Selma", "day": "10"}