{"month": "10", "state": "AL", "station": "WAPR", "content": "The house I'm Todd ... dollars more than just the rent being do not know the next time on marketplace [noise]\nAnd that's coming up at six o'clock this evening here on a PR\n\nThis is Alabama public radio service of the University of Alabama W. H. P. R. Selma gotta get get the our muscles challenge at your age you\nKnow the W A L F down to the devil you teach history be the Tuscaloosa there'll be sick for\nA I mean the we are Alabama public radio [noise]\nNo I'm not\nIn today's story core interview Aaron talks with his daughter Jennifer about is experiencing going to prison and how it affected Jennifer's lifestyle although he plays some struggles following his release Aaron didn't allow those struggles to stop him from becoming an author and motivational speaker\nWere able to adjust well I think when I lost my wealth you didn't have it and\nToday I think you've had a very successful career because of your work ethic and what happened to my money well sadly I participated in corporate fraud actually the term is cooked the books at our company\nAnd went to prison for a little while and had to pay restitution and walls especially with my my well today I drive a kind of over ... years ago I drove Mercedes BMW is so different lifestyle\nToday I'll do public speaking universities associations about corporate fraud and ethics\nEthics and I've been doing that for almost seven years now and I sort of reinvented myself I don't make a lot of money doing that but I'm making a living in I'm interested in asking uh Jennifer tell me a little bit about how you think\nWhat happened to me me going to prison losing the lifestyle that we had at one time how is that impacted you\nI don't know any different and and I think at this point in my life I'm at so appreciative and everything we had even though we lost that I'm just I'm happy I got to do all that when we had it you know when he was an idea of the way everything went down to I Can't imagine never having as experiences\nThat's interesting you say oh man I I often think about and tell people and laugh about it there's a lot of things you miss because ... I guess we did make life real easy for you you know there are some parents say early you know I'm not going to help my child and all they got to get on their feet and\nMake a living themselves I was very proud that I could\nSend you to like for example to England one year to study in London and I think you appreciate that and you think about that in the fact that you were able to do things that a lot of people were never able to do I'm proud of that\nThey're going to prison I I don't want to say it was fun but it's been a lightning in life changing because you think a lot about what you did and\nNearly in there and your bed at night thinking\nHow can a screw my life up so badly that I Am now incarcerated\nTell me this story that when you got out and he tried to find a job and he looked at some time in prison is still there is on\nThe job market for felons is not real good I could not get a job and I finally got an interview at a big box store it went pretty well until he asked me if I ever had a conflict with her previous balls and\nAt the heart of how I got in trouble was a conflict with the previous malls and\nI totally that I'd gone to prison and all I didn't get the job for three years I mow lawns to make ends meet\nAfter doing that for three years I started my career of giving speeches about ethics and what happened to me not written two books I've been able to make a living as an Arthur and speaker let's share mess\nWhat's your message to what you want students to come away with when you say to them about what happened to you and and ethics in general will be take away message when I speak to students is that they need to realize that ethics\nAt the ... you have to work very hard trying to be honest and live by the golden rule I met in court to must be George Will lick which I think is really powerful\nBased society with um\nIs not a society\nIt's a group of people that are afraid of each other when you don't behave ethically you lose trust things break down very bad for\nThese interviews were recorded that story core story corps the national initiative to record and collect stories of every day people excerpts were selected and produced by Alabama public radio inter sponsored by the porch band of creek Indians\nAnd I'm David dust you are listening to Alabama public radio just about nine o five Eduardo Fernandez on guitar and the English chamber orchestra begin today with this concerto by the faulty\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\nEllen Vogel sewing on oboe in that trio sonata by tell them I knew he was joined by Nancy certain on harms the cord march ... field on viola da gumbo\nAnd I'm David docile and Alabama public radio glad your joining me today and our\nProgramming is supported in part today by the Kennedy Douglas trust of Florence, Alabama in support of classical music also State Farm agent Ellison Horner immobile offering a full range of financial services in addition to auto homeowners health in life insurance on line and Alison Horner\nDot com well\nIt was in late Seventeen Seventy four early Seventeen Seventy five the Mozart composed a group of six so not is that he\nCalled the difficult ones\nHere's one of the six or seven out of ... it's performed by Luis again but it's but Ken\n\n\n\nDo\n\nThey\n\n\nThey\nThey they\n[laughter]\n\n\n[noise] [noise]\n\n[noise] do\n\nYou do\n[laughter]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nNo\n\nThey they\nThey think that [noise] um\n[noise]\n[noise]\nFor NPR News in classical music this is a PR\n\nAlabama public radio service at the University of Alabama\nW. H. P. R. Selma you keep the our muscle shells that your age I Am now the W A L F yeah just a little W\nW T two three beat the Tuscaloosa W to six\nOr eight I may be we are Alabama public radio [noise]\nNext time with the Chicago Symphony orchestra conductor divine nature of second Stephanie chills touched my charming and inventive scored the fourth and try to number three and\nMost ... and they have much time Chicago Symphony orchestra ... [noise]\nHad the next time for the Chicago Symphony is coming up at eight o'clock tonight right here on NPR and right now a heightened symphony is symphony numbers thirty four ... by I'd I'm pretty sure\n\n[noise]\n\n\nMm\nMm\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nMm\n\n\n\n\n\n[noise]\n[noise] [noise]\nMm\nMm\nMm\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nMm\n\n\n[noise]\n\nMm\n\nMm [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n... your host for classical music thanks for being with me right now it's fifty six degrees with rain moving into the Florence area eighty degrees in mobile below along the Gulf Coast\nAnd the temperatures will continue to vary widely across Alabama they rained moving across the north end mix of clouds and son in the south\nThis is where you turn for NPR News and classical music you're tuned in to a PR\n\nService at the University of Alabama W. H. P. ours\nHere in the I like those shows W. H. I. L.\nMovie W A L F in Tuscaloosa\nDefinitely keep three easy test to Lisa\nThough we are we are we are we we are Alabama public radio [noise]\nWhen pianist Charlie Albright was a kid his jazz piano teacher who thought he could benefit from seeing a classical teacher\nThe idea was going to an idea of classical music and they go back to when I called the fun stuff\nCharlotte Albright plays some of the fun stuff on the next performance today from eight PM [noise]\n\nAnd the next performance today is coming up at one o'clock here on a PR\nI'm Dave adopt it's eleven o'clock and Frederick Chopin his music never goes out of style Chopin died young at the age of thirty nine of tuberculosis and yet he left behind quite a legacy in terms of music he was a pianist in almost everything you can post was for that instrument\nGave his pieces generic names like Missouri's not turn send the like and then there were the four bulletin boards for solo piano kind of a musical equivalent of the heroic ballot and poetry\nThe third of the ... right now is performance by Jerome Rose the blood numbers three by Chopin\n\n\n...\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n... number three for solo piano by Chopin as performance by Jerome\nI'm David duff your host for classical music ... P. R. and R. music today is provided in part by dance and things and I heard Dale serving Alabama since Nineteen Seventy nine with complete selections a dance wearing point choose including professional ... walking and dance\nAlso sheltered state providing transfer credited career training options as Tuscaloosa community college ... two oh five three nine one to two what what or Shelton state dot edu\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]", "show_name": "Classical Music", "year": "2018", "city": "Selma", "day": "16"}