{"month": "10", "state": "AL", "station": "WAPR", "content": "W T two three beat the Tuscaloosa\nEvery case still I mean if we are we are we are we I we are Alabama public radio [noise]\nThinking about saving for retirement is nobody's idea of a good John So why not think about it a little bit differently [noise] it's like going into the supermarket and they have chicken on sale\nAnd they're selling it as much lower price in their cause I'm time result investment companies dropping the price of your retirement that his next on the market and\nThat'll be coming up at six o'clock today right here on a PR Alabama public radio\nGood morning I'm David a fee it's nine o'clock and fifty nine degrees right now in Florence and cloudy skies they're Seventy one along the Gulf Coast it sunny will have a high today ranging from around the Seventy one or so in North Alabama to the mid eighties along the Gulf Coast\nAll the rain is gone no chance of rain and the forecast today\nWell I David dumping will get things underway musical you with a suite of tunes bike Henry personal arranged torn performance by the Canadian bras\n[noise]\n\n\n\n\n\nNo no no\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nUh lowest Heinz ... gr Andy Academy of St Martin in the fields performing and noble concerto in C minor by tell them I\nI'm David ... nine twenty this is Alabama Public Radio's classical music good morning it's great to have you along and hope you're well hope you didn't suffer any ill consequences from hurricane Michael going through and lots of great music on the way we hope you enjoy\nStephen hand cough was an artistic ambassador for the United states of America for about Fifteen Years toured the world saw about fifty countries in that role he use I'm a jazz guitarist as well as a classical artist and\nTook some time to transcribe this six cello sweets the sweets run a company jello by Bach for solo guitar\nThey're all recorded on at three CDs set called from treasury the either transcendence the six weeks for cello solo for acoustic guitar curious performed on his own transcription of the sweet number one Steven hand cough a guitar on the guitar\n...\n\n[noise]\nMm\n\nThe first cello sweet by box transcribed for solo guitar by Steven Henn coughing performed by him from the ah six cello sweet salt transcribed for the guitar three CD set called from tragedy to transcend and\nI'm David deaf at about nine forty three support for a programming comes in part from the Alabama Shakespeare festival in Montgomery announcing their new festivals season under the artistic leadership but Rick bill died Todd Schmidt and Greta Lambert subscription information available at A. S. S. dot net\nComing up next our among the offerings will be hearing some movie music music from the adventures of Robin Hood that'll be coming up later in the next hour also ... Mozart\nIt's all just ahead on a PR right now with the concerto for but soon and orchestrate the concerto in sea by ... Albrecht Holder on ... and the new Brandenburg philharmonic\n[noise]\n\nWe're\n\n\n\nWell then what\n\n\n\n\n\n\n\n\n\n\nOne of those little things\nLike that but\nUm you\nThe number\n\n\n\nOh break told her I assume the new Brandenburg philharmonic where the ... sea by friends done see\nI'm David ... say it's just about ten o'clock at a PR is sixty three degrees in North Alabama Seventy four along the Gulf Coast will have a high today ranging from the low seventies north to the mid eighties\nTo the mid eighties along the Gulf Coast and for NPR News in classical music this is a PR\n\nAlabama public radio at the University of Alabama W. H. T. R. someone that you can't pay our muscles challenge get you\nKnow the W A L K can't treat the task Alisa ...\nI mean we are Alabama public radio [noise]\nWell I don't know about you but if I were going to play for royalty you certainly want to be prepared not so much the case with Mozart's on April twenty ninth of sanity in eighty four he was playing for him for Joe says the second and knew the city is composed without rehearsal\nAnd the violinist sight reading her part and Mozart basically improvising the piano part as he went\nHe rode out the full score for it later in the uh Brazil's it's this speaks the sonata in B flat cake for fifty four for violin and piano biggest sucker my the violinist mark Mike or the piano\n\n\nUm\n\n\n\n\n[noise]\n[noise]\n\n\n\n[laughter]\nChange [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [laughter] [noise]\n\n[laughter]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nAnd violins sonata by Mozart does performed by ... by a landmark Niagara gun piano\nAnd I'm David a fun Alabama public radio it's ten twenty four\nAre programming this hour is supported in part by dance and things in iron Dale serving Alabama since Nineteen Seventy nine with complete selections of dance wearing point choose including professional fading walk in and dance out\nAlso immobile botanical gardens discovered thousands of plants from the Gulf Coast guard including the wide selection of community is at ... gardens small plant sale\nOctober nineteenth through twenty first more information up mobile botanical gardens dot org [noise] well\nIt's the story goes James Galway was asked wants to be preferred to be called it flew to store if loudest Andy\nIt's the same please call me let me just I don't care if the case here's James ... we see is reforming along with you so we used to be there to either conducted by the late Claudio should get this ... ... by American\n\n\n\n[noise]\n\n\n\n\nMm\n\n\n\nConductor Claudio Simone recently passed away but she recorded this year's ago conducting is on some Elise Elise divinity and flew to St James go away and that's ... ...\nE by America Dante\nTen forty seven I David dumb fun Alabama public radio and if you enjoy the Oregon musical tonight will be a great night for you\nBecause at seven o'clock tonight organist Christopher henley will be performing at seven o'clock in the alumni auditorium on the judge in college campus in Mary in Alabama on the program a box cutter also works by a couple of leaving composers damn luck aware and Pamela decker\nThree him tunes by Owens and more it's all on tonight's program seven o'clock\nIt's Christopher handily organist perform again Mary in Alabama on the judge said college campus seven o'clock the public is invited and if you want more information on the event you can check out our Web site go to a PR dot org a PR dot O. R. G. could kind of antsy and you'll find all the information you need\nRight there [noise]\nThirty eight years at ... corn gold composed the score to the film the adventures of Robin Hood it was a score that one of the Kennedy Award and here's some selections from the score the fanfare love scene battle victory an epilogue music by corn gold for the adventures of Robin Hood the ...\nThe Hollywood Bowl or just wrote led by John material\n\nSelections from the score to the Nineteen thirty eight film the adventures of Robin Hood the music by Erich Wolfgang current golden that performance by the Hollywood Bowl orchestra\nIt's just about eleven o'clock and they see is a PR Alabama public radio station you depend on for NPR News man classical music\n\nIs in Alabama public radio service of the University of Alabama W. H. P. R. Selma them you can't pay our muscle shells at your age I Am\nNot the W A L F down to below ... the Tuscaloosa there'll be kids six\nOr eight I made the we are Alabama public radio [noise]\nThe story of the ... is that of a pirate chief of that name who tries to force the beautiful Camille to marry him she manages to sleep the engagement ring onto the finger up a marble statue which comes to life comes to claims up at his wedding feast and drowned see him in the sea\n... is an opera by for down to roll here's the overture the b._b._c. philharmonic is led by young ... toward gay\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\nThe overture to ... buy for nine to roll the b._b._c. philharmonic conducted by young ... towards Kobe\nI'm David up at about nine after Lebanon support for this hour has programming comes in part from the Huntsville symphony orchestras sixty fourth season featuring the music of Harry Potter in Star Wars Tchaikovsky symphony number five the best in the eagles and Mozart's Jupiter\nMore information about the season it a jet so dot O. R. G.\nAnd also gold scenes diamond jewelry since Eighteen Seventy nine in mobile featuring hearts on fire jewelry located on Hillcrest road and it goes themes jewelry\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nThe piano concerto in a minor by advised Greek I'm only ... at the piano the Danish national radio symphony conducted by Michael ... and\nI'm David deaf at eleven forty you're listening to Alabama Public Radio's classical music\nOr music too they supported in part by several floors to go surfing but we'll in Baldwin county for forty years separate floors to go offers residential and commercial flooring titled showers and back splashes blinds and shutters more at ... dot floors to go dot com and on Facebook and\nAlso the ... festival of the arts coming up on October twenty isn't twenty first from nine to five pm\nTo ... festival feature visual artists from across the U.S live artists demonstrations music and spoken word performances food trucks and children's activities more at ... dot org\nWhen the classic period the terms no turn oh serenade diverge demand do we're all essentially interchangeable there wasn't a lot of distinction between any of the three\nThan a turnover tended to be a little more oriented toward wind instruments and all of them were meant for use in the outdoors performance in the open air\nWell here is one of to turn those by for ... his no turnover number one for flu shots to clarinet sarin and to be sued in a performance by the Schweitzer wind ensemble\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\nMm Mm Mm [noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] you\nKnow by the national\nNumber [noise]\n[noise]\n[noise]\n\n\nMm [noise]\n[noise]\n[noise]\n[noise]\nUm no no\n\nNo\nNo no no no that's just [noise] some [noise]\nSome some people\nStill young enough to [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]", "year": "2018", "show_name": "Classical Music", "city": "Selma", "day": "11"}