{"month": "10", "state": "AL", "station": "WAPR", "content": "At least for some people I'm trying to resolve the economy who was working for and who is not next diamond marketplaces [noise]\nThe next time for marketplaces six o'clock today right here on a PR Alabama public radio where you turn for NPR News in classical music [noise]\nThis is Alabama public radio in the service of the University of Alabama\nThere'll be a PR Selma WPRI Muscle Shoals at the whole town about the\nW. A. L. S. men tend to ...\nDo you two to three ... Tuscaloosa there'll be two six for me I\nMean we aren't Alabama\nAm FM Tuscaloosa W\nTwo to three busy Tuscaloosa W to six more the uh Maine's real\nWe aren't Alabama public radio [noise]\nAnd right now is guys are mostly Saudi across our listening area fifty one and the north sixty seven in the south than the will have a high today ranging from the upper seventies north to the upper eighties along the coast we do we have about us thirty percent chance of a shower\nAnd I'm David duff good morning it's nine o'clock your tuned in of course for classical music here on NPR and we'll get things are underway with Giuliano Carmen ... when the ban is baroque orchestra led by Andrea ... in this country heard oh by the faulty\n[noise]\n\n\n\n\n\n\nYeah\n\n\n[noise]\n\n[noise] [noise]\n\nMm\n\n[noise] well\n\n\n[noise]\n\n\nMm [noise]\nI'm\nWriting a graph on our on flus performing along with the philharmonic duo with Berlin in late for me despite yeah variations on ... by French composer ... Marie\nI'm David ... nine twenty eight support for our programming comes in part today from the University of montebello giving students they chance to explore where they belong inside and outside the classroom online that you belong in montebello dot com\nAnd also don't forget mobile op representing the barber of Seville tonight and Sunday that will be in the temple down in downtown mobile 'em and tickets are available for the barber of Seville mobile opera presenting that ticket ... mobile opera dot Oregon mobile opera dot O. R. G.\nAs sweet by a another French composer reasoning Francois to folk considered by many to be the premier ... his day here's this sweet for his instruments in a minor sweetest performed by ...\nGet sued or by many to be a Premier League Debbie stay here's a sweep stories instrument Jane a minor sweetest performed by the church\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[laughter]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\nToday probably more likely that the further south you go in Alabama for NPR News and classical music this is a PR\n\nThis is Alabama public radio service of the University of Alabama W. H. P. R. so more than ... our muscle shells at your age you\nKnow the W A L F you know just a little devil you cheat you treat the the Tuscaloosa\nW to six for a I mean the we are Alabama public radio [noise]\n\nViolinist Rachel Barton fine is working toward a world where kids from diverse communities can see and hear themselves in classical music I wanted them to be able to see a future for themselves facing people who look like them going out there and getting all this that's\nRachel Barton fine on the next performance today from a piano [noise]\nRachel Barton fine on the next performance today from a piano [noise]\nRachel Martin pine and more on the next performance today which happens to be coming up at one o'clock here on the well began this hour with a piece for solo heart bits by France entendre Saturday and so now the number two it's performed by New York all your ...\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise] [noise] [laughter]\n[laughter] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\n\n[noise] [laughter]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nMm [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise] Mm\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nWasn't good\nTo look for a month on the long run on a\n\nWith\nMy mom\n\nAnd they were\n\n\nLearn\nThey won't be [noise]\n\n[noise]\n\n\n\n\nNicholas heart in court conducting the Vienna Philharmonic along with pianist long long in the piano concerto number Seventeen by Mozart\nI'm David deaf in about ten forty four this is Alabama Public Radio's classical music\nAnd her programming today is supported in part by United cerebral palsy of West Alabama serving people with disabilities and helping them live life without limits more at UC BWI you dot org or two oh five some re four or five three oh three one\nAlso children's of Alabama in the states only free standing pediatric hospital serving alien injured children from all across Alabama and the south east since Nineteen eleven information at children's AOL dot org\nLooking Rodrigo is Spanish composer born in Valencia lost his sight at the age of three went on to study piano violin and eventually composition\nCredited for raising the profile of the guitar in classical music even though it's an instrument that he never mastered personally he of course is the composer of the famous concerto their runways and in other works for the instruments\nIncluding this sweet for solo guitar he called it in praise of the guitar it's performed by Croatian guitarist patriots secret\n[noise] [noise]\n[noise]\n\n\n[laughter]\n\n\n\n\n\n\n[noise] Mm [noise]\n[noise]\n[noise] [noise]\n... ...\n... ...\n... and ...\nMany many days and\nThen in\n\nThe\nTwo [laughter]\n\n[laughter]\nBut\nMen and women that they do\nMen and women that\n\nNeeded in ten\n\nW. H. P. ours\n... P. R. Michael shown\nW. H. I. L. movie W A L F in Tuscaloosa W T two three beat the Tuscaloosa\nEvery case ... or I Need them we are we are we are we I we are Alabama public radio [noise]\nWell in opera there is a very famous comic ... known as the barber of Seville which by the way immobile opera happens to be performing tonight and Sunday tickets are available at mobile opera dot org\nBut there's a very notable point in the first act weird the title character enters to this area it's called Largo I'll say to them\nAnd it's sunny here by plus the dough Domingo he's joined by the chamber orchestra of Europe there are conducted by Claudio about local effect told them from the barber of Seville by receiving\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nWell what else they will not be able\n\n\nThose of us who don't want me to come up in la la la la la la la la la la la [noise]\nThat's what you got to the to the\nMan\nI thought it was a\nBoy that must be a\n... a war\nGoing on\nOr not they're not going to\nNot only did\nIt all\n\nBut one of the big one what\nWould you know not be making my career as one of my reading up\nOn your\nKnees\nI don't think I don't think I don't think I don't think I don't think I don't think I don't I\n\n\nDon't know if we\nReally don't know\n[noise]\n\n[noise]\n\n\n[noise] [noise] [laughter] [noise]\n\n\nPerhaps the most famous are you from the barber of Seville ... the Largo all fucked totem plaza do Domingo they're along with the chamber orchestra of Europe all led by Claudio about oh\nBy the way just a one of many arias you'll hear tonight or Sunday as mobile opera takes the stage of the temple in downtown mobile\nFor their production of the barber of Seville tonight and Sunday and tickets are still available to see the barber that's coming up tonight and Cindy mobile opera\nDot org mobile opera dot O. R. G. tickets are still available\nWill lead to live in a way to a PR I'm David duff and support for our programming comes in part for men to grocery in Delhi Tuscaloosa as local yo natural food store offering organic groceries and nutritional supplements since Nineteen eighty open Monday through Saturday nine AM to seven PM\nServing lunch for eleven to two thirty daily menu manner grocery dot com\nAnd also the forty seven day annual ... festival of the arts coming up this weekend some early Sunday nine AM to five pm each day featuring visual artists from across the U.S live artist demonstrations\nMusic and spoken word performances food trucks and children's activities more at ... dot org and the ... now by Reinhold uglier green beer sitting on cello and the royal Flemish philharmonic\n\nSo you know cello and the royal Flemish philharmonic\n\n\n\n\nKnow I mean I\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\nThe\n[laughter]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\nMm\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n[noise]", "year": "2018", "show_name": "Classical Music", "city": "Selma", "day": "19"}