{"month": "10", "state": "AL", "station": "WAPR", "content": "And looking forward to some really great music including the entire presentation of Carl or ...\nOr ... coming up in the eleven o'clock hour\nWe'll kick off with a U.S or NATO from a medical ...\nThis is Alabama public radio service at the University of Alabama W. H. P. are\n... pie I make those shows W. H. I. L.\nMovie W A L F in Tuscaloosa\nDefinitely ... the Tuscaloosa\nTasteful and now we are we are we are we I we are Alabama public radio [noise]\nNot a clock time for classical music six great hours of classical musical Alabama public radio support for class\nIt's nine o'clock diver classical music six great hours of classical music ... Alabama public radio support for classical music is provided in part by bill aggress gardens and home presenting all outdoor cascading chrysanthemums daily November ... through the twenty first\nBetween cascades chrysanthemums on bridges balconies ranged in Laurel towers and here's throughout the garden information to build and grant Dorjee\nAnd by State Farm agent Alison corner will be a loss for in a full range of financial services additional auto homeowners health and life insurance on line to Allison Horner dot com\nWell we want I Want to get started doing the beach line up with great classical music first we'll hear a ... ... ... by ... how did the opposite of the Halloween the Meridian arts ensemble form ...\n\nNa na na na na na na\nNa na na na\nNa na na\n\nNa\n[noise]\n[noise] um\nGroup\n\nIn many many many women\nDid not make the\nNo no no\n[noise] no no no\nNo no\nNo\n\n[noise]\n[noise]\n\n\n[noise] many\n\n\n\n\n\n\n\nNo\nNo\nNo\n\n\nNa na\nOf classical music I'm Bob woodland\nLots of fun to be here today for David dumped on this Halloween\n\nSupport for classical music has provided good part but the six and you will fearful film festival downtown fair hope Alabama November eat through eleventh between forty films and twenty plus short\nAlso between filmmaker battles and gala events to get information film schedule isn't fair hope film festival dot ORG\nLuigi book Corrine this is ... God led by ... and this is\nThe ... ... ... did the opposite of the house\nOf the ... ...\n\nMan\n... for the cello in ... D minor from other would you book or re me from the latter part of the Eighteenth century also known as the house of the devil appropriate music for this\nHalloween day I bought one it is nine twenty three you're listening to classical music on Alabama public radio support to classical music has provided in part by United cerebral palsy west Alabama helping miracles happen everyday\nSuggesting the seasonal gift to provide hope to children and adults with disabilities more information on line that you ... you ate dot O. R. G.\nAnd by goals deemed di ... recent Eighteen Seventy nine in Mobile Alabama between hearts on fire jewelry located on Hillcrest road and goals deemed jewelry dot com\nUp next the a ... a piece of sweet originally in ... D minor transcribe it a trench\nUp next the it's a piece you said a sweet\nOriginally in ... D minor transcribe it transposed ... a a minor or this features the when the identical twins that guitarist Peter and so on hold on a ... by ... by ... on a cello this is the handle\nSweet yeah a minder originally ... by\n\n\nThe\nI\nRead the news [noise]\nWho knows\n[laughter]\n\n[laughter]\n\nThe name\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [laughter]\n\n[noise] [laughter]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\nAnd then\nTo go into the\n\n\nGame\nAnd\nThen we're\n\nTo be\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise] Mm\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\nWe just heard just a Thirteen ease sonata in G. minor\nA violin devils krill performed by David John the violinist company by a rubber ... gone piano\nIt is nine forty nine that means it's eleven minutes till ten o'clock and you're listening to classical music on Alabama public radio\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n\nMm\n[noise]\n[noise]\nMm [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\nAnd\nThen\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] Mm Mm Mm\n[noise] [noise] [noise]\nMm [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\nYeah\n\n\n\n\n\nWe're six minutes into the second tower this Halloween edition of classical music we just heard Antoni ... some of the reasons I'm On the upper\n... and they're not performed by your group all their role model the Roman group as we continue on our Journey Through some great classical music coming up next the piano concerto from my book turned himself a than a shock often ...\nBeen a from a ... world feature the entire ... ... ... other classes from Carl or a call ... or\nSomething something new this afternoon by old worn black ... and ... ... what good it possibly be ... other than the source rivers\nApprentice\nOur forecast for the Alabama public radio listening area in the mobile Pensacola area eighty to hide shafted in Seventy one overnight lows partly sunny skies\nMontgomery and sell them by and central Alabama partly sunny eighty one sixty five eighty one high sixty five overnight low in Tuscaloosa Birmingham partly sunny skies eighty three this afternoon should be a high when I looked sixty seven looking for thunderstorms in ...\nSchool is the Birmingham partly sunny skies eighty three this afternoon should be the high or low sixty seven looking for thunderstorms in the Tennessee Valley throughout the area high this afternoon Seventy seven the valley of course the shoals Athens Decatur hunt will Seventy seven\nHigh end overnight books should be about sixty five in the Tennessee Valley\nSupport for classical music has provided in part but the ... and you will fare who film festival in downtown ... November ... forty films and ... also featuring filmmaker panels gala event ticket information then film schedules in your film festival dot O. R. G.\nLooked dark this is a bridge CD painting of for the ... the other country already a ... the pianist you go to a symphony orchestra conducted by Scott you and the piano concerto number twenty five and she major from ...\nI'm\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nIn\n\n\n\n[noise]\nIn\n\nMiddle of it to do\n\n\nDid you get\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\nI'm from\nAre going on\nMind about\n\nNah nah\nNah\n[laughter]\n\n[noise]\n\nLooks aren't twenty fifth piano concerto sci major ... that's keyboard\nCompany by the dentist symphony orchestra Scott you it's a conductor as we move toward the eleven o'clock hour the entire eleven o'clock hour devoted to Karl ... ... I mean we're on a day on this Halloween Wednesday\nI bought one I'm here today for David up support for classical music is provided in part by yoga Jim delivering yoga lessons to students regardless of the ... body type level classes encourage beginners challenging cultivate the practice of more seasoned yoga practitioners more\nYoga Jim L. L. C. dot com\nPromotes aren't we moved to often box shock often box of course the well known for many reasons but this is the ... to ... ...\nOften blocked off a box of course a well known for many reasons but this is the ... to ... in the uh [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n... a ... a year to you know you will that will will will with a little bit about whether or not it that\nThey were and what did you grow up in a lot of that but if you were a little bit more of a a a\n... oh they do they come up with that gave me a little bit of a\n... ... yeah yeah yeah yeah yeah yeah yeah yeah uh what what uh what what what would you do a little bit of a [laughter]\n... uh or or is it a little bit of a ... or whatever that I read a book or in the state but ah\nYeah yeah yeah yeah that's an issue of like a um a with a with a ...\n[noise]\n[noise]\nMm\n\nMm\n\n\n\nMm\n\nMm\n[noise] Mm [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\nMm\nMm\nMm Mm\n\nMm Mm\n[noise]\n\nMm\n\n\nMm\nMm\nMm\n\nMm\n\n\nMm Mm Mm\n[noise] oh\nOh oh [noise]\n\n\n[noise]\n\n\n\n\nNo no no\n\n\n[laughter]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\nUh\nNo\n[laughter]\n[laughter]\n[noise]\n\n\nThink you know what\n\n\nI mean\n\nLook at the time\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nMhm mhm\n\n\nMhm\nMm Mm\nMm\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\nYeah\n\n[noise]\n[laughter]\n... [noise]\n[noise]\n\n[laughter]\n[noise] [noise]\n\n\n\n\nYeah well what do they blew up going out\nAnd said oh\nNo no no no [noise]\nOh there was a man [noise] oh oh\nOh\n\nOh what a good day to day\nThings that are that you know I\nThink that's probably not really\n[laughter] what about the topic for example enough\n[laughter] oh [laughter]\nMean you know\nHappy to get you out with\nFrom people seem to me you're going to\nBe the best that both sides\nYou know they say they have a deal\nDa da da da da da da da da", "year": "2018", "show_name": "Classical Music", "city": "Selma", "day": "31"}