{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThere's a new way to listen to MORNING EDITION wait wait don't tell me he was around the world and all your favorite program simply say likes to play NPR anytime you want to be updated for one good company\nTry Alexa play NPR or his rhetoric too frequently I think fuels these feelings and sentiments that now or bleeding over into essentially acts of violence\nDonald Trump responds by lashing out at the media the four hours GMT Annette crashing also on the program how'd you warnings from the head of the un fact finding team on the positive range and Muslims still in the in ...\nIt is an ongoing genocide that is taking place\nEspecially this working to remove land mines from the demilitarized zone separating north and South Korea find the remains of two soldiers ... voice could be the ... the kids on the door opening micro drones inspired by ... feet\nBy latching onto their environments with these attacks from mecca doesn't they can generate these forces to have up to about forty times there when\nYou're listening to the BBC well seven lines\nFrom NPR News in Washington I'm ... and President Trump says there is a major federal investigation into the bomb threats targeting several prominent Democrats\nEgregious conduct is a boards to everything we hold dear and sacred as Americans my administration will provide additional updates as they become available and I just want to thank everybody for their understanding\nWhere extremely angry upset unhappy about what we witness this\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAnd building in midtown Manhattan when Hogan of member station WNYC was there a CNN employees spend hours outside their officers while authorities combed the building for explosives\nThey were live on the air when Anchorage had to cut out and evacuate the building outside behind a police barricades CNN staff were rattled but they're reporters kept reporting here's anchor Keith Baldwin right after she interviewed New York governor Andrew Cuomo\nThe day when you don't want to become the news and we all became a little bit of the news today but [noise] ah never been more proud of my colleagues and honestly and my ... they were beyond professionals that I've a scary\nAuthorities say they transported the explosive which was found in the mail room to a remote area forget nation other pipe bombs were sent to prominent Democrats including George Soros Hillary Clinton and Barack Obama for NPR News I'm Glen Hogan in New York City\nThe Catholic archdiocese in Anchorage, Alaska says it will take a closer look at possible sexual abuse within the church Alaska Public media's Abbie columns reports on the steps being taken\nThe church is appointing an independent commission to review files from the last fifty years archbishop ... H ... says the investigation will look into how sexual abuse accusations have been handled\nWe are taking care of business and we're taking care of victims\nThe three commission members have brought a background in law enforcement and criminal prosecutions ten years ago the Catholic dioceses in Fairbanks, Alaska filed for bankruptcy after paying out millions of dollars in settlements to victims stretching back decades agent says the current review\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nAnd Wednesday the Dow Jones industrial plunged over six hundred points Asian markets aren't lower this hour this is NPR News\nThe food and Drug Administration has approved a new medicine to treat the flu NPR's Richard Harris reports that it is not a substitute for getting a flu vaccine to prevent ...\nScientific study shows though flus out is about as effective as other flu drugs on the market including generics this brand name drug is administered as a single dose to people twelve and older it was developed by a Japanese pharmaceutical company and will be sold by Roche and its American subsidiary genetic tech\nThe drug has unique mechanism of action and it is effective against strains of flu that are resistant to a popular flu medication\nJeanette in Texas the drug will be available in a few weeks the wholesale prices a hundred and fifty dollars but genetic says it's offering a coupon that will bring the cost down to as low as thirty dollars for people with health insurance\nRichard Harris NPR News\nThe state of Maine plans to use the state's ranked choice voting system for the first time to our next month's midterms the system allows voters to rank candidates on the ballot and the person with the most first place votes wins\nIf there is no majority winter than the last place candidate is eliminated and vote to reallocate it until someone ends up for the most votes\nFederal Communications commission is proposing a sixty three million dollar fine against ... based broad band company that's accused of misusing government money the SEC claims American broadband and telecommunications bought a yacht private plane and other luxury items with funds that were\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nSupporting ideas and institutions to advance education for all preserving environments and promote vibrant performing arts more information is available at ... dot org\nListening to the ... from the BBC website it's my name's Nick ... she had I had a safe to say that\nIn some parts of the U.S the political atmosphere is highly charged with Republicans and Democrats campaigning hearts of crucial midterm elections now less than two weeks away\nBut tensions are high for a different reason on Wednesday pipe bombs were sent prominent Democrats including productive bomb on Hillary Clinton sold ... CIA director John Brennan who was also one of the intended victims blamed President Trump's within up under\nDonald Trump has not helped to encourage\nThe type of civil discourse and public engagement and his rhetoric too frequently I think fuels the ... of feelings and sentiments that's now or bleeding over into\nEssentially acts of violence\nSo his ... the president criticize the puppy traces he was speaking as a campaign rally in Wisconsin\nWe will find those responsible and we will bring them to justice hopefully very quickly [noise]\nAny threats of political violence art attack on our democracy\nItself such conduct must be fiercely oppose and firmly prosecuted we want\nAll sides\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn\nMore itself up as a figure of university someone who is attempting to take the moral high ground\nHe said specifically to those engaged in the political arena must stop treating political opponents as being morally defective or should stop terrorists need comparing political opponents to historical figures who are villains which is don't often he said well some will the beach and he points out\nThat some of those individuals who have received pipe bombs were individuals who have been criticized by Donald Trump himself for example Maxine Waters\nIt's someone he regularly refers to as a new cute individual as for Hillary Clinton he often refers to her as crooked Hillary it will leave many to say that despite President Trump's saying that the media were to blame and they needed to change that tone on and what he described as around the house to let's say\nThat ready the president himself should perhaps be taking his own advice\nOr what do we know about what was contained in\nDevices well from what we understand at the moment than they are being investigated at the moment and examines we understand at one lab in Quantico which is the FBI Headquarters\nThey all power only have a PVC chewed which contained inside it some kind of pyrotechnics Potter so quite similar to what you would find in a firework they also contained some shrapnel apparently some of them had collapsed inside them they believe\nSo clearly the attempt was for these to explode and then for shrapnel and glass to be shorter lights on top of those people who had open the package not has to be said that they didn't go off and I see detectives or looking at that as a real opportunity for them they believe that means that there's forensic evidence that can be fun\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\n... up to ... million weakest or being held indefinitely without trial Beijing denies the allegations ... their sentence of re education more now from China correspondent John such with with parts to have his investigation\nThe ancient Silk Road city of cash or is it really quiet [noise]\nDoors ... shot [noise]\n... official notice says that missing residents are being looked after\nShouldn't Jang bristles with checkpoints with police in riot gear so intense is controlled and the fear here it's impossible to interview people openly you have to go elsewhere\nDifferently and then my mom and my brother\nAnd a lot and I ... I Believe he moved to the u._k. in two thousand and two and now has a British ... she's a week I Wonder if she ... main ethnic groups last summer her mom came to visit spending a few weeks with rain and his son in London before flying hope\nI made a phone calls to make sure that it's ...\nHer voice on the phone if they you know a war it's as bad hips are only gets ... her passport\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nWe use has found refuge in Turkey a place with ties of language culture and face [noise]\nUp\nTo ... to ... and that was pushing the Chinese detention camp he says simply for reciting an Islamic bus but at the funeral\nOn on the ...\nI don't know where my mother and father are or my brothers and sisters the Chinese government wants us to ... or police or ethnicity and humanity ...\nSelma how blood tests and taught to use it for them at camp inmate who says he was forced to sing Communist Party songs Andrew sites China's new anti extremism laws hold on to the threat of violence but ... will do something\nEvery day someone was speaking but there were two men about what about the other just kicked we fell down they made us Neal again\n[noise]\nTo form a camp inmates we've spoken to are the lucky ones they fled to turkey and twenty fifty since then there are very few reports of anyone being released from the camps [noise]\n\nBack in ... we try to visit a camp where we've heard ten thousand people maybe help but in front\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOther routes on his back here but every time a road block off the road blocks\nThere's no way through when I'm going to get anywhere close\nUp ahead the satellite data once again shows watched towers and wools in schools China does not want the world to see\nJoan such with with a special report\nThe U.S electric carmaker Tesla has reported a profit for the first time in two years and made more than three hundred million dollars in the past three months the company's high profile chief executive you must\nHave promised investors a return to profitability following months about publicity on federal investigations he's called it a truly historic cool to Mr Musk attributed the improvement to an acceleration in production of the company's multiple free vehicle tests but she has jumped in after hours trading in New York\n... is an investment listed on capital which owns shares in the comic\nThink this is really just Tesla executing on what they said that they would do and there was so much doubt and the stock\nThat that's why we see this after market performances because I'm analysts did not\nThink that they would be able to to meet the expectations that they had put forward and I even say there is too much focus on these quarterly numbers on sort of from the get go I you know tests as really a long term story and electric vehicles and economists vehicles\nThis seems to me then again pulling off\nOn the promises that must have made and investors that sort of had concerns are happy to see that there'll be a two independent board members there'll be some additional Twitter oversight worse\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nString of violent attacks against a seemingly unlikely target or ditches accountants and to check the votes of the country's increasingly corrupt municipalities have been intimidated or worse on the oldest of like with officials Africa correspondent Andrea halting has to shovel\nThe thieves broke into a guest house south of Johannesburg shorter female auditor in both legs and fled with her laptop which contains sensitive information about the accounts of the local municipality in another town will do just what chased away after they came looking\nFor some twenty five million dollars that had vanished from the local budget apartment is emerging here today South Africa's government the anger they condemn these and other recent incidents\nOh gee municipalities to cooperate with state or this is not intimidate them\nThere is a lot at stake in recent years the fight against corruption\nThat's focused on former president Jacob Zuma and other high flying figures but the alleged rods goes far deeper\nGovernment does say local municipalities are now failing to account for nearly two billion dollars each year on surprisingly most councils fail that on the woods\nTo Germany now where an outcry in a better than neighborhood has foresee into that John Google to drop pounds to turn an old building into a campus to start up companies\nActivists said if it went ahead than the ... district of ... book would become gentrified with local people fall styles and saw your regional editor might sound as\nLeft wing is cherish crowds bag is the cradle of the counter culture to them a capitalist superstar like Google\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nLeft wing coalition government hailed the about ten or Christian grave from Chancellor Angela Merkel's conservative party said it said the world a terrible signal Berlin was hostile to business\nThat was my son does speculation has been mounting as to when we will see the first height to leave an ultra foster vacuum cheap but transportation system\nNow but announced that the United Arab Emirates will be the ones with the U.S into the future with sons to build the world's ... an American ... says it intends to start work on the ambitious projects next year\nHis Middle East analyst an Johnston\nHyperbole technology involves passenger carrying poets being suspended by magnets in an endless cheap\nAnd it's friction this atmosphere speeds up more than a thousand kilometers an hour a possible this be much experimentation and the rising but now the Emirates is have a job he plans to put the system to use it would be the first commercial venture of its kind anywhere in the world\nPassengers will be able to travel on the tank Columbus along hyperbole track in an area that has an international airport at an exhibition center\nThat report was from Alan Johnston this is the nature him on the BBC well service on that ... just before we got to let me bring you up to date with our main news\nPresident Trump has attacked the media after explosive devices were sent to a number of his political opponents critics accuse him of promoting divisions and specialist removing land mines on the heaven I have any fortified border between north and South Korea has found the remains of two soldiers\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nEuropean made language learning program babble teaches practical conversation and Spanish French German and other languages available in the app store or online at ... a B B. E. L. dot com\n[noise]\nThere's a big struggle going on in this small town right now in rural America disdain for the federal government can run high\nIt's about ten to twelve a different gangs and they\nGo from gang to gang it's very difficult to understand who is with who\nSo it's it's a huge problem\nTo all these people\nI work with this young people when they were very small\nSome people have been signed president as America will say other right wing policies have been saying that there's been an increase in crime sins so eating lots and lots of asylum seekers in in in twenty Fifteen and it it's not his thing\nIt's a difficult question but you can say that most of them really is in this environment is coming from out of cancers way back in time\nSo it's not the nice recent and the ... people who came had ... children or or even the last second generation immigrants\nIt's different ethnic it's not only some island or belt generally it's mixed\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOh from immigrant backgrounds that researches he's steady gangs have ... that what changed many I came to Sweden when they were young from places like Somalia Iraq Palestinian territories in the Balkans or that parents did so want is the violence abound\nMountain the drugs and most of this shooting at all because they are being insulted you know way\nTake into girl friends or given the hits and they take the weapon a shoots before they get a bullet in the navy but the last year they are shooting for killing\nWhy haven't gone out and arrested them\nIf you take this two hundred people we had about two thousand conviction about this uh people so tiny they should drive without license smaller drug related to them and I'm quite small things the most of them of course\nIt's been very hard to get done so the actual shootings and the killings yes convictions that we're getting behind bars\nRight now nobody talks to the police is very very hard to get people who who is Taylor what they have seen because it's it's the silos environment [noise]\nSaid the science is serious convictions around\nThe Swedish government tightened up the low income possession to try to tackle this because it's not only ... this is happening firearms stuff becoming more common in Sweden as a home in twenty ... Seventeen people were shot that last year there's more than twice\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nDemocratic paradise the problem with Sweet Honey than I think you know it's like to powder realities that seed in other countries doing very\nWell you know if you look on all the global rankings seeding is among the top countries but the challenges that we also have a dark reality\nThis is Annette ... he's a sociologist and police officer is that a Swedish combination\nThese was a childhood dream and maybe one of the reasons that made me survive either a goal of becoming a police officer\nAnd there isn't cells and immigrant suddenly came to Sweden for around when he was a boy and he grew up learning how to handle himself\nYou know in the suburbs that I was raised up yeah yeah of course the violence and it's why did they also pleased when I was raising a full of people in those areas to solve the conflict with guns\nAnd they says crime isn't actually getting up and sweet and it's not that it's intensifying in parts of the three biggest cities still can go from that I'm not on\nOur problem have not been increasing but our problem are now becoming more and more concentrated in certain areas certain streets and certain population so if you look at for example the homicide rate in Sweden you know the top highest rate of homicide was I think Ninety eight eight\nAnd we were you know two million or twenty percent less population than we are today by the characteristics of our crime of are serious crime has been changing from you know be previously was quite ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThe existence of those two realities that are creating the problem sweet and prosperous country to most people it's very safe place to live with lots of opportunities but not everyone especially not foreigners who come with little money has access to that lifestyle [noise]\nA Fifteen minute drive from the center of mama does a housing estate ... Rosen gold it's so big it feels like an entirely separate town that you can enjoy ... cuts it's an off\nBuilt in the seventies it's not a popular place to live [noise]\nIt's very segregated [noise] there what do you mean secretary and there are lots of people are without work a lot of people that hadn't having what schools she grants cigarettes in a community worker showed me around and a lot of social welfare takers or to call it ...\nRecipients people own benefit a lot of immigrants and I lost all of a suite of people that have been on social welfare for generations\nSome media reports say it's become so disaffected and tripled the place that it's effectively a no goes and\n... we were walking around quite freely inside secret ... who works for an end GMO free ... which runs social projects the young people and tries to help the lead gangs seems to be on friendly terms with all the states\n\nHas made yeah\nAutomatically [noise] yeah so how do you know these guys who worked in ...\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nWe don't take care of young people jumping out of like we should we can see really only\nThe young people ever get in trouble but ah we don't do anything about it\nWe will come of dozens of apartment blocks orbital sometimes as many as Fifteen people will live in a flat not for full of shops childrens play areas and then a nearby sports home without talking to a young man that\nGive a slight Eighteen year old with wavy Donna Karan a plus ... other than face he's presumably tougher then he looks to getting ready for boxing training he doesn't live on the state but he used to\nThe time I Lived here it was very safe and very normal childhood where we went out to play but then after a time it changed\nWe started the drugs we started the criminals and that's how it is today when did it change do you think you know people became teams and they didn't really\nHave a good time at school some drop early\nThey feel left out so they want to feel accepted and so they go to find smaller groups in slum places you know and and it's all drugs and\nCrime you know do you know anyone friends old friends who've got involved in gangs and that's why they had a friend that started doing bad stuff and he was telling me I Know I Will get shot soon and that is feeling is very terrible\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAddicted to drugs they will not be the same friends you had\n\nHungry young men are a problem in many cities in many countries the added extra in Sweden is that ready access to guns\nKilling four to seven it's a normal weapon mounted\nAn A. K. forty seven and a very powerful\nWeapon just because it's very\n\nGood at apple grant is a specialist in gun violence which don't time police he's been tracking how gang members guessing hold the a K forty seven an assault\nRifle used in the Balkans will and the eighties and nineties and now sold on the black market myself being gangs\nEverything is NPR News daily email\nNPR News dot org slash\n[noise]\nSix o'clock here in London hello and welcome to stay on the b._b._c. World Service would shine bend Jane [noise]\nPresident Trump cools fool civility is rally in the U.S have to suspicious packages were mailed to CNN and top Democrats those engaged in the ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nRussian of Islamic identity is enough to get people detained\nHello from Mike Williams with the sports much football to talk about today from the group stages of the European champions league to the semi finals\nIn Africa confederation cup of south America's ...\nJoined put up all the attention threatening and for a couple of\nThe world [noise]\n\nLive from NPR News in Washington I'm Shay Stevens President Trump opened in ... Wisconsin campaign rally by denouncing bomb threats against several high ranking Democrats and others Marty Michaelson member station WBUR WN\nReport President Trump spent the first few minutes of his speech condemning incidence of suspicious packages delivered to former Presidents Clinton and Obama along with CNN offices in New York City he says his highest duty as president is to keep Americans safe\nThe federal government just get a dog and aggressive investigation we will find those responsible and we will bring them to justice hopefully very quickly [noise]\nPresident also said the media has a responsibility to stop what he called the endless hostility and constant negative and oftentimes false attacks for NPR News I'm Marti Michael send in\nMilwaukee among the people targeted by the package ROMs intercepted this week is former CIA director John Brennan a package address to him was mailed to CNN's New York offices which had to be evacuated and searched rented says he thinks President Trump's rhetoric is behind the violence\nI think one can make an argument that it has\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nRun and says too many Republican Party officials are not fulfilling their responsibilities by failing to challenge some of Trump's remarks and actions\nHealth officials in New Jersey are trying to contain a virus outbreak that has claimed the lives of seven children Rachel holiday Smith of member station WNYC reports that Eighteen cases of the virus had been confirmed\nMedical officials say the ... virus is not much of a risk for healthy people as it might only bring on a cough or paint guy\nBut for pediatric patients at the ... Center for nursing and rehabilitation the virus has proven deadly the facility provides long term care to chronically ill and disabled children New Jersey's health commissioner Dr Sharif el in the hall says his agency is working closely with the facility that specializes in treating fragile patients\nSad reality is there aren't that many facilities that are able to care for them\nAnd the house as a health department will be onsite until the outbreak ends for NPR News I'm Rachel holiday Smith\nNew York's attorney general says Exxon Mobil misled investors about the risks that climate change posed to its operations attorney general Barbara Underwood center Exxon courted investors such as the state's public pension funds with an accurate information\nThey're your lawsuit comes three less than three months after the federal securities and Exchange Commission dropped an investigation into the Texas energy giant\nAlong the same lines this is NPR News\nNew report concludes that federal immigration and health officials were blindsided by the Trump administration's zero tolerance policy on migrants crossing the southwest us border and investigation by the nonpartisan\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAnd health and Human Services officials say homeland security did not always provide the information\nThat world famous Cleveland Orchestra has fired two of its star musicians that's after an investigation found the ... multiple instances of sexual harassment against female colleagues\nAnd in some cases students they taught from C. P. N. I. C. P. and Idea Stream in Cleveland Adrian ma is more\nThe firings were announced three months after a Washington Post story brought to light sexual assault allegations involving William crucial for over two decades proof it was the orchestras concert master the ensembles leader after the conductor but after the post story came out the orchestra suspended him and hired an outside law firm to investigate\nThat inquiry resulted in another suspension of its lead trombone player must be Miller Rosa based on dozens of interviews and documentary evidence investigators concluded the two men engaged in numerous instances of sexual misconduct\nIn a statement the executive director of the orchestra apologize to the victims and announced it would be implementing a new sexual harassment policy\nAdrian ... in Cleveland this is NPR News\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent out whether that's on line over the air or in a bottle more at Sierra Nevada dot com\n[noise]\nThank you very much need food and you can see these days when James ... with us this morning welcome wherever you are listening around the ... with us\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nAnd he's found any expression of Muslim identity is enough for people to get arrested [noise]\nIn the United states and our top story President Trump has vowed to catch the perpetrators behind the suspected explosive devices send to CNN and top Democrats using including ... and Hillary Clinton the packages were all named it figures apparently discouraged by right wing critics\nAnd were mailed a head of ... a congressional elections next month but speaking at a rally in Wisconsin Mr Trump called for unity and said people in politics had a responsibility to help make that happen\nThose engaged in the political arena\nMust stop treating political opponents as being morally defective after\n\nThe language of moral condemnation and destructive routine these are arguments and disagreements that have to stop\nNo one should carelessly compare\nPolitical opponents to historical villains\nWhich is done often son all the time\nYou got to stop and as always Mr Trump has something to say to the media he said the media had also to stop being hostile for that to happen\nPart of a larger national effort to bridge or divides and brings people together\nThe media also has a responsibility to set a civil tone as you stop the endless hostility and constant negative and oftentimes\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nFrom has really set a different tone in Raleigh that he's been speaking out because if you take a look at the recent while he's and he's been doing a lot of them campaigning ahead of the congressional elections\nHe's being very aggressive in his words very aggressive in as a language Coley nights political opponents all of a sudden he is saying that actually people most dope treating political opponents as being morally to fact of\nThe new one in his words should carelessly compare political opponents to historical villains\nAnd or read the President Trump is being cold out on ... see CNN as opposed to the coverage of that rally on this and keep it saying that he was speaking quite HIPAA critically and his words and many people calling out what they might go at the master of incivility in politics trying to ask everybody else to be several\nAnd I think that's partly because he pointed the finger of blame directly at the media\nHe suggested that it was the media who was not striking a civil tone on that it was the media's responsibility to try to bring more order and perhaps a better word token to this debate and that's also bear in mind\nThan in terms of CNN in particular which is a network of Donald Trump doesn't like he encourages crowds to jump out them on booze them calling them fake news and indeed for the media generally on a ... or Raleigh he encourages the crowd to turn ... boots on to hack all the media\nYou so much football around today let's start with the European champions league in Barcelona made at three wins out of three and I didn't even need Leno messy the Argentine watched on injured from the stands as possibly into my line to know\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThan ... victory they'll make Veit to club in next month's funnel after the deal ... side\nSome al Masri of Egypt for nail meanwhile she goes in monasteries gate Boca Juniors to know victory and the first like best semifinal with the Brazilian side permit us in South America's Cup and look at the door as the Boston Red Sox and out sooner lumping baseball's World Series they beat the Dodgers full to Fenway\nTo seize control of the seven game series and there was one point overtime victory for the Detroit Pistons over the Philadelphia Seventy Sixers and the MBA on Wednesday when two full Denver and New Orleans\n... thanks very much in the now than let's spend some time in Spain on ... according to the latest opinion polls\nIt looks like a foreign policies on course to win a seat in parliament for the first time since the end of the fascist dictatorship and the general from ... moving for decades who got the policy is known as ... support is growing since you took a hard line against migrants who have the independence drive in Catalonia\nThat speak to restart loaded an order from the University of Iowa to lead a he joins us now\nFrom New Madrid thanks very much indeed for being that and tell us more about ... they ... policies platform is what it stands for\nThank you very much for having me in festival so what part of that was on the late ... Thirteen splinter group of people start any other reason why the party was founded they argued that if people start to ... founding principles and had focused too much and giving it kind of leading us Heidi ... gender\nUntil recently wasn't marginal party I mean they don't even have a mission ... today in Congress they started to grow a few months ago I originally managed to gather around ten thousand people in Iraq during the week which was\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nFor but do so because of recent history that\nSpain haven't had a fall right policy gaining traction in the same way as say Italy Greece could have had similar economic problems in ... the the ... issue too and the recent history that has prevented people gravitating towards a policy ...\nYeah that's correct actually over the last ... years in Nineteen eighty that far right ... which means that those people that Nelson for these new right populist parties to either not vote\nOr both for the people's party but there seems to be to be changing another posed as I said that gives them a rose ... percent to the boat\nAnd the people's party the ruling party the conservatives at policy in Spain so it wasn't really party anymore so rewrite yes that's true things have changed ... ... a guy who was the ... team so very recently thanks for the correction ... look ... what does this tell us about Spanish politics and how it's developing men in the moment\n[noise] oh that's a very good question I think the rational books can be explained by two factors first you have to deal with the rise of an anti immigration discourse in Europe which also explains the rights of far right parties you know the country's elite Germany or Sweden [noise]\nA dissenting the original ... team with the refugee crisis and has continued to uh to groceries units and [noise] and ah like European counterparts votes added up to it every house to language against immigrants\nUsing that word evasion for example to defer to really get immigration which is very uncommon in Spanish a political the deep debate I immigration is not a\nHard topic in in general on the second thoughts\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAbout to enter like buddy Joe stricter when it comes to the front dictatorship does this policy embrace it it it\nSort of a nostalgia for it to to try to distinguish itself from the past\nI think that's a good question um probably some of its borders they do should Byrd Broncos dictatorship by the party has tried to distance themselves from a Broncos dictatorship for obvious reasons so\nWell thanks very much deeper speaking to us and it's interesting to find out more about development in Spanish politics Louis ... days from the University of either to lead to king about the books policy at will continue to follow that story and um when there's more to say I will tell you about it here on Easter [noise]\n\nLet's go to the Pacific coast of the United states now or ... kind of seaweed which helps to regulate the world's current climate is being devoured by giant purple sea urchins\nScientist say count in ... north of San Francisco has declined Ninety three percent almost gone so what do we know about the ... or ... or ... and why this is happening I spoke to Cynthia catching who's an environmental scientist with the California Department of fish and wildlife sea\nUrchins are typically herbivores they will typically it ... they usually are waiting for the ... to come to to them they usually are are tucked away and that kinda says and and a lot of the the way it will just drift around it can become a detached from the race and justice\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race in more I'd YWCA M. P. L. S. dot org\nThat are are maybe not detached yet and are growing and they will start to climb up the stocks of the of the algae and start nibbling away at the\nBases of that algae why has the Cal stopped growing because of warm water when we're talking about warm waters ... being behind his\n... and and leading to that behavior from from the origins like can we relate that directly to a climate change I think what we're seeing is a very very good example of something that we would expect to climate change and what does that does that having\nSo it's creating some long lasting starvation conditions for for all of the other or before his in his system and it's maintaining a huge swath of the ... sign that is there of any ...\nAnd so that has taken away all the habitat for the fish that was lives and the and and summer and in that bled since the ... and it has taken away all the the food for all the other organisms that would eat on it normally\nTell me first about how you began detecting that this was a problem and the this was happening\nHappened rather quickly it was over the course of a year we lost Ninety percent or more of the ... for us along\nA stretch of coastline that's more than two hundred and fifty kilometers long sought to see we would just disappear\nIt disappeared it it was a combination of ... of events that happened that started out with the loss of a major predators church and that just the sea star species and our on our coast and then followed up by a couple of years as very very warm water and\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nReally big storms or really you know a disease or the interaction as a very effective creditor and we don't currently have any of those options are available to us [laughter] um except that we do have\nCommercial or ten fishers on our coast and they can be ineffective creditor at least on on localized scales\n[noise] so the aim is to save the kelp seaweed and this is all happening because of um climate change effectively what Cynthia was saying the ... the water is getting warmer up the seaweed is getting scarcer and so the merchants basically get out of their way to go and feed\nOn that and that's why it's disappearing Cynthia catching their environmental scientists with California Department of fish and wildlife you're listening to you and you stay on the b._b._c. World Service with China and then stay with us more stories to come [noise]\n\nDistribution of the b._b._c. World Service in the U.S supported by gobble a meal prep service delivering fresh dinner kids that are table ready in Fifteen minutes gobbled does the ... so you spend less time shopping and more time with family learned more at ... dot com slash BBC and by fracture creating\nPhoto decorum gifts by printing photos on glass us made a carbon neutral factory\nMore at fracture me dot com slash BBC\nSays a big struggle going on in a small town right now in rural America disdain for the federal government can run high with the midterms approaching and NPR\nSays if they did indeed that either but he's finally Julie lives down the road he's sitting on a swing under a tree wearing a white brings out of hand and kicking his bad feet from his and his life and many\nOthers with transformed with new to say she'll programs of teach it pallet in two thousand and three this did enough of the sections a hand and many say though that his successor ... died on Sunday\nLooked it did look Lula was the best president we ever had for everyone northeast\nOlder poor Brazilians the reach only likes to reach here in Brazil I don't see what's the most a lot has to offer\nNot even worse on life helped my Mac and the revolt ... heads would I vote for him [noise]\n\nNot far away can number ... one of hundreds of communities have slave descendants in his pocket wild that some of the poorest Brazilians and a group that both in our singled out in the navy and not fit to pray creation ... of what's to come back to is a community need\nAny pressure among union while he talked to about ... animals [noise] he's shown that he's government will be one that violates raw fish and we're gonna have nobody to help you to [noise] the workers' party made mistakes\nBut at least the first open for dialogue we challenge we both so narrow that won't happen it's returning to the Eighteenth century\nBob Hope and browse sick lives away [noise]\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\n\n[laughter]\n\nWhich is which jak they see it changes won't mind what that means to resume future to democracy he's deeply and [noise]\n\nThat report\nTheir bike Katie wants it now or South America correspondent reporting from North east of Brazil\nYou're listening to a nice day on the BBC will say they switched shyness ... and then James top story at the moment President Trump has attacked the media after explosive devices was sent to a number of his political opponents critics accuse him of promoting divisions [noise]\nNot if the ... Williams to give us this helps bookstores thank you bend who needs Leno messy a boss to learn and made it three wins out of free and the champions league group stages on Wednesday with the audience on superstar watching on in just from the sounds maybe in some airlines too now at the new camp things to do from the ...\nWill sponsor taught all truth be told them a joint bought some of that group off the conceding lakes equalize that ... been in the Netherlands said already seeing go people who go to Laurie sense also manage emerged airport you're Tina now admits that will be hard\nFor his sons to reach the knockout stage is really going to\nWin the three games and some British Rule that says Boston who purchased one place for the police station\nWith his social\nResults of the night that arguably came in Germany wet bursts your door opened\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nUpbeat and ... of Nigeria to want to hurt him and that's that can lead to wrap up our three\nWon't aggregate victory and he modeled regardless first like the Congo side asked me to a club or convincing photo winners are the mastery of Egypt to stage the temporary second half walk off the British speeches go so beach club Ovie blocked opens their notes\nReach next month spinal pull the first time or they will play Roger Casablanca rural so in the final four the first time meanwhile and bought a salaries [noise]\n\n\nTo like go get Boca Juniors a pseudo victory in the first leg of the semi final with the president's ... in South America's Cup unlimited door as ... earlier when as over the place and make just like every other semifinal\nOn Tuesday in tennis the season ending WG a finals in Singapore continue and the American slang Stevens made it back to back wins in her round Robin group she'd be the best ones are the three sets of top seed I'm Julie kubbeh also came through a three step to\nAgainst the U.S I've been jumpy ...\nAnd ... and especially in the sense that we both play on the really high level and then I started really well but knowing me and came back in the second set and the thing that I was just said not giving up so just staying in the central thing on everything from\nThe Boston Red Sox announce tonight lumping baseball's World Series they beat the Dodgers full to extend wages seize control of the seven game series I had a game three in ...\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a NPR less dot org\nAnd this week and one result we didn't mention in the bullets in that at was club bruised warm Monaco want us to see every Henri took charge of his first European matches the new Monaco manager it ended in ... as we said let's speak to the Belgian football generalist spend ...\nH. L. and newspaper ... ... ... how did it go at full on re only has returned to Belgium on Wednesday\nAnd we're good morning is a it's a it was a good result for cherry already\nYeah took his first born to also in the in the group stage um those are good result but they could have written but that was also the case or color Bruce show a it was an almost ... years old but both these are both teams deserve to have been they said after the game but in the end that was the the fire results were both teams\nAnd they scanned was being played against the backdrop of some controversy wasn't it because it was just a few days after I caught bruised coach was questioned in ... match fixing scandal\nUh yeah to be all that wasn't he wasn't accused for the Mets fiction buff for money laundering so some are important figures now in Belgium football are being a cruise from a money laundering I'm also yesterday so new players um\nYeah it's a big case in Belgium nowadays but yeah it's good that the justice is doing the right things now so um [noise] of course a was a bit overshadowed the game of course but the fans are very loyal to even when they go on the\nIn the end I guess you will get a fine then and then you move on\nWe mentioned teary on returning to Belgium and he was of course we're back to the mountain as his number two in the Belgian national signed as they finished that at this summer's World Cup in Russia\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nAlso before the game was very popular of course with the selfies or things like that or ... going through anything wrong or anymore in Belgium I'm sure a lot of\nPeople in Belgium have that self eight with ... and just finally I on the other guy midnight great we mentioned it in the bullets in that water result ... less Madrid dormant really taking a stranglehold on my great now with a full meal victory of Madrid\nAnd I've spent ...\nOkay oh was it a also a question for me so his surprising result of course um nobody expected that the ... last with with those figures about the yeah and yet we will see it all what will happen with the ... Bruce ... and the\n... they will fight probably for the third place to and to stay in in Europe are also the winter but the ... really surprising result and also rebels in the\nMidfield the actual retail is doing really fine now on a bit of a surprise maybe for some people but it's working very hard on ... ... with their friends eighty thousand people in that sense it's it's lovely to see a\nGood stuff spine crossed a Belgian football journalist from age ... and used by many thanks for your time this morning for a price on you mentioned in the champions league group stages does I mean you qualify for that Europe's second competition that you're openly and\nWe'd go to seek out as well on line if people haven't seen it amazing and defend the free ... and again the only end from Croatia had broken ... she and he slight\nTackles Indonesian behind the wheel in anticipation of Louis swat rise drawing a bull\nProgramming is supported by white WC Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... dot org\nBritish Nigerian artist joy I'm being Joe ... who was in November this November will be opening a solo exhibition here in London she will be exhibiting her work as well at West Africa's biggest art fair art ex Lagos joys large scale paintings explore her British Nigerian heritage", "year": "2018", "show_name": "BBC World Service", "city": "Rochester", "day": "25"}