{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth\nVisit YWCA M. P. L. S. dot org to learn more support from Minnesota Public radio comes from the E. H. Argo healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learn more ed E. H. R. go dot com\nTens of child sex abuse it would let down by the state\nAnd it was very very moving from a so for me it gave me a lot of comfort\nActually said to a couple of victims here\nUm at least we lived long enough to hear it\nBut other survivors say woods I'm not enough Saudi Arabia denies the crown prince was involved in the middle of the generalist your mouth shut Jay and offered his condolences to his son and\n[noise] there was no hiding the joy of these migrants those police\nThousands of Honduran migrants macho on to the U.S that despite warnings from President Trump that they will be granted asylum plus we look back at the heroism of the Norwegian Resistance fighter\nWho has died at the age of Ninety nine that's coming up on the news when\nLive from NPR News in Washington I'm Jim Huck President Trump is planning to tear up a thirty one year old nuclear weapons treaty that was signed by President Reagan NPR's Geoff Brumfiel has more on what it could mean the\nRange nuclear forces treaty was signed it the Nineteen eighties when the Cold War was going strong it eliminated nuclear weapons that the U.S and Soviet Union had deployed around Europe\nWeapons that could have quickly started a catastrophic war in recent years Russia has been working on missiles that the U.S says violate the treaty and on Saturday president\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nNews Washington Britain France and Germany said Sunday that Saudi Arabia needs to provide credible facts for its explanation of what happened a journalist ... NPR's Eleanor Beardsley reports of joint statement urges the those\nResponsible be held accountable\nAfter denying any involvement in the disappearance of cat show gee for two weeks Saudi Arabia said this weekend the journalists died in a fist fight at the Saudi embassy and it's done by all this sudden about face has provoked deep skepticism on both sides of the Atlantic\nFrance Britain and Germany say there is an urgent need for clarification and to back up the Saudi explanation with credible facts that three European allies say nothing can justify cache of just killing\nTheir statement said the truth has to be established and those who committed crimes held accountable Eleanor Beardsley NPR News Paris\nAfter and officials say a roadside bomb killed at least eleven civilians and an eastern province NPR's DEA Habib reports from Islam above the bombing took place on the second day of Afghanistan's parliamentary elections\nThe bombing victims including children it wasn't immediately clear if the bomb was meant to talk of voters candidates are like total officials but there's been relentless deadly attacks against them\nThat violence alongside delays in opening polling stations and widespread technical issues prompted officials to extend voting Sunday it will still take weeks for official to tally the votes but after running such a county collection it's unclear voters and candidates will accept the results\nThat may affect the legitimacy of the upcoming off gone parliament and it doesn't bode well for the more important presidential\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nSixty passengers when that went off the tracks authorities are still investigating the cause of the derailment this is NPR News\nTo health care workers were killed by a militia in eastern Congo NPR's Eyder Peralta reports they were manning uh port of entry to try to control the spread of Ebola\nControlling the cold outbreak in eastern Congo has been hard because it is in the middle of a conflict zone with many armed groups and health ministry says the local militia attacked two members of Congo's rapid intervention medical unit health\nWorkers have had a tough time vaccinating against the disease because of persistent rumors that they are spreading equal up and harvesting organs last week a group of young bikers ... the body of a friend to find out if it was intact\nAfter negotiation they agreed to repair the body and be vaccinated against Ebola because they had handled and infected corps meanwhile attacks by the Islamist group ATF have continued this weekend the group killed Thirteen people in a town at the center of the outbreak in ... NPR News Nairobi\nSome thirty people were hurt when Flora collapsed early Sunday during a party at an apartment in South Carolina near the campus of Clemson University\nVideo posted on social media shows a large portion of a four on the first level of the building caving in as people were dancing causing dozens to fall through to the basement none of the injuries were life threatening\nAt the weekend box office the horror flicks during Jamie Lee Curtis Halloween captured first place the remake of a star is born held on the second place venom and goose bumps to took third and force the needle\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nThree decades NPR has helped them to better understand a complex nation in the world through it in depth coverage of events ideas and cultures and the corporation for public broadcasting\nYou are listening to the newsroom from the b._b._c. World Service with me in jail\nTwo months after he took office the Australian prime minister Scott Morrison has apologized for one of the most shameful scandals in the country's history\nToday with his voice trembling at times he stood in parliament and can breath to express his sorry for the institutional child abuse that lost it decades churches schools sport clubs in China she's old guilty Mr Morrison said that the cries of Australian children had been ignored\nAs a nation we found him we ... them and that was always very shy\nThis is apology is for them and their families to as one survivor recently said to me it wasn't a foreign enemy who did this to us this was done\nBy stride as to his driver's enemies in our midst enemies in our midst the enemies or medicines\nMiss the most and made the speech after five year inquiry which found that tens of thousands of children had been abused Richard Jabbar right who lives in ... was one of them they tend to the piece of priest he welcomed Mr Martin's apology\nI was actually caught it was a I didn't think I wouldn't be but I got aside or listening to it\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nHundreds of people from across Australia gathered in camp Britain here the prime minister speech many survivors have criticized the government's response to the inquiry in particular the national compensation skiing around sixty thousand people and as you pull our correspondent in camera how quickly this listened to Mr ... speech\nSo he spoke at length about the way to the impact on so many lives though both those up survivors victims and those who took their own lives and I think that was a moment the CIA and with many here who say they've come to listen but also to remember those who simply couldn't cope\nWith the impact of the sudden spent decades not being not being listened to not be ... knowledge so the apology I think did carry weight but there are so many concerns about how this issue is being addressed Australia has led to weigh them yet dealing with the questions it raises is still very difficult\nAnd and says I just want more than just words\nAbsolutely so when the key issues as you mentioned is the national compensation ordered dress skiing at the royal commission set at a maximum figure of two hundred thousand dollars for the government has called significantly less to hundred and fifty thousand dollars but also actually the process of\nGetting that compensation is being seen this court bureaucratic by some victims and concerns over having to supply victim impact statements having basically to go through the trauma once again to prove\nThat they were a victim and so many people it's a question of trust for many years for decades they wouldn't believe they would head and so to have to go through it once again in order to get ...\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nIn Nineteen forty three the allies were in a race with Nazi Germany to develop the atom bomb each knowing success could win the war\nThe Germans needed so called heavy water with an extra ... political and its oxygen nucleus did was made only at a heavily guarded plotted where you can in the ... region of Norway\nThis made it a target for the resistance your key random bag and five other fighters parachuted onto a platter skied across country descended into a ravine and crossed an icy river before using the railway line to get into the plant and set the explosives\nThe operation coupled with American air raids the following year\nLet the Germans to abandon their plans and was later described as the most successful active sabotage of the war of words European ruined a bag worked as a journalist and became known for raising awareness of the dangers of war among young people\nAnd I we cast is suffering huge losses and a German station action Chancellor Angela Merkel's conservative colleagues and had a very insist the policy the sea su a holding coalition talks\nTo see is you have given the very up on the un says in Nineteen fifties but are now considering a coalition with the feed voters movement which came said\nThat he was actually the ... and lost their main policy demands a year\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nJust second most populous instead richest states sprung from the towns and villages they've been fighting local issues the sixty is the general secretary ... isn't surprised and not exactly a household name\nBut it's all tied in to me is\nWhen you're a party in the middle of this rather pragmatic and practical that's not always sexy enough for the media it's more exciting when you talk radical so we've flown under the radar sometimes that's changed not naturally for the election and especially after it with us tested as a possible coalition partner and if we go into government we will be regarded differently\nTheir aims are still regional they oppose a third runway from Munich Airport referring to revamp other airports and trained links\nThey want to scrap fees for nursery school places\nThat could cost the state more than half a billion dollars a perceived ... that feeds into the sea su job that they all the free beer party the to share a conservative outlook including on migration the free viruses wants to speed up asylum claims and deportations\nAnd want a candidate style system to attract the migrants the work place needs\nThat could end up reinvigorate sing the sea su and by extension the central government but that's not ... priority\n... owners so ...\nWill saving the national government is not our most important goal I don't know as far as the face of the the ASU leader Horst Seehofer goes up to them to the site for us it would be enough to bring but very on a bit and saving the national government or the country that will be the next step\nEven if the free vote has ended up saving host as a whole for John ...\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\n... after these fourteen cases were reported in three rural areas and initial investigation by the French public health authorities some type ... cross\nFailed to find any comment exposure suggesting the cases will probably down to chance but this was rejected by environmental research is who argued that pesticides used by the agricultural industry where most ... with the most likely caused a fully abnormalities\nThe governing law and Justice Party in Poland has come out on top in the first round of regional elections it's first electoral testings winning an outright majority in parliament three years ago exit polls gave the right wing ... such a two percent of the votes seven percent more than a centrist liberal coalition\nAnd the u._k. conservation charity is planning to kill every man it was on a remote British overseas territory to protect a number of rapid species\nMice were introduced to Gulf island in the south Atlantic and the nineteenth century and have grown in size since then I've learned to eat see bud checks they are now telling about two million every year and the rural society for the protection of birds says it putting some species on the path to extinction southern us\nState of Tennessee should be an easy win for the Republicans in next month's midterm elections\nIn twenty sixteen Donald Trump won the state by twenty five percent in the presidential that but the ... they'd be much tighter big money is pouring in and big names are weighing in on what's become one of the most important Senate races in the country Bob ... actually I went to Nashville to find out more\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\n\n\nAfter James Turner the second to believe that if African Americans in Tennessee both as a block that can ship the scales in the Senate race and sent a Democrat to Washington\nOr new spirit has awakened and uh we just happy to see this energy and now he's got through to the polls\nIt's extraordinary that the Democrats think they even had a chance in this ruby red state\nBlue [noise]\nThe Republican candidate Marsha Blackburn has a reputation as a firebrand she's tied herself closely to President Trump he's campaign for her twice [noise]\nLook I'm not running against Donald Trump I'm running for a Senate seat to represent the people of China see\nAlong the Democratic candidates Phil Bredesen is a popular former governor he talks about his personal brand as a politician who gets things done rather than his party [noise]\n\nThat pitch is aimed squarely at disaffected Republicans but an hour outside of Nashville the party is pretty important\nTo me\nThis is an annual fair in the town of Louis for its Trump country still there is some in patients with parties and shutting matches in Washington\n\nTennessee is an interesting test of whether a political moderate still has appeal in this hyper polarized climate but it's also crucial because it\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nBut what about Phil Bredesen what do you think of you know nice guy I vote for him\nBut he's somebody who might get things done right\nNow he's gonna he's ... he's only going to get done with his party wants them to die [noise]\nIn a state where music is the currency the singer Taylor Swift has raised the odds she threw her mega star power behind tendencies Democrats in a recent social media posed to her one hundred and twelve million followers [noise]\nAsserted millennials registered to vote but that doesn't seem to have changed many minds in downtown Nashville on a party Saturday Night\nIt's like [noise] like I said you know\nI think you're right there that Donald Trump ten in Myrtle Beach and I still can't learn because she has great music and she's a great part that I don't think you should try to tell you for\nThat report but ... ... and we will of course have special election coverage in a couple of weeks time when those midterms are held\nA reminder of our main use the Australian prime minister scope Morrison has delivered enough no apology to the thousands of victims of institutional child sexual abuse that went on for decades unchecked by the state you've been listening to the news room on the BBC well so this with me tonight\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nPrivate delivering audit tax consulting an advisory services tailored to the needs of growing privately held companies to Lloyd dot com slash us flash private [noise]\nPresident Trump says he's spoken with Saudi Arabia's king sound mind about missing journalist ...\nIn the face off a deep recession\nThey weren't using frontier economics with a guy that got stolen graduate schools\nThey were using stuff that vaguely remembered from the undergraduate days yeah so do you get onto the surgeries they'd rather better than the economy of the eighties and nineties and the early successes\nThe financial crisis highlighted the extent to which would who's being tortured universities was increasingly irrelevant\nWhen do you call them was head of graduate studies at University College London a top rated economics departments she saw how unhappy with students were with a mismatch between what they were learning in close what we're seeing on the news I suppose banks and then the whole financial system began crushing down\nAll watching this and in some sense struggling trying to understand what was going on there were similar a sense of students being very perplexed and what they would come and say is can you help us understand what's going on we're not learning to enact classes and they were right there\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nRelatives and one typical question is well your studying economics you can tell us about the global financial crisis and the students having to say well we're actually not covering that you're not classes\nThe fact that students around the world continue to be two courses which seemed to weigh a financial crisis but it was actually raging all around them brought home to many out of touch the profession have become windy colon is the most widely used university textbooks\nIn retrospect she admits these books must stumped subjects that we huge Lee important in terms of understanding the crush\nThings as basic as how finance works\nI can put my hand up I had spent a lot of time writing macroeconomics textbooks\nWhich we're addressing particular issues in the macro economy side or the one published in two thousand and six was all about inflation targeting\nAnd there was no section on banks all the financial system and this was very typical of the way on that correct comics is taught in universities around the world\nAnd has that changed it has changed I write in your textbook that that really catches it in other words with my co author we felt really challenged and I think that was true not just about that of many others\nIf you're wondering why we should care about what's going on economics classrooms remember these are the people who graduate and going to steal the financial systems in which we will depend if they give bad advice and can wreck your economy\nThe growing frustration filled by students and teachers around the world has given rise to a number of new initiatives to overhaul economics courses in one of these\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nBut will it different curriculum be enough\nIn finance in so many other areas the person who pays the particles which you bankers and politicians founded convenient to listen to those economists who argued for deregulation and who's morals allowed them to justify the housing bubble [noise]\nAnd that's a much easier to comics professor at Stanford University in the U.S she's frustrated by economists taking refuge in theory and seeing what people want to hear well turning a blind eye to bind even criminal behavior by buying cars that can freshman financial stability\nThere is definitely a problem it is a very very shocking they remain\nReally fantastic early in the sense of how they explored the system\nBut in the end ignoring the biggest elephants in the room and all the flooding incentives and all that deception and fraud and all the excessive endangerment that's entirely unnecessary it's just taken is given it's just what they accept the system\nAnd does she think this has changed following the crisis\nWhat you hear is more about you know very shockingly you know stuff happens and you know we're doing our best and it's going to be sort of the big groups at crisis just wakes you up because you notice it\nAnd then he's like oh you know we really had terrible the regulations before let's fix it but then the fix is really not quite right but then you just kind of move on and say well I did my best can be prevented stuff happens\nNot much of a comfort to think of the economists could be happy with the idea that stuff happens some things clearly going wrong\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAllergy that had blinded to central banks and other policymakers the blind belief that markets work well on their own unfettered market will deliver for wellbeing for all citizens has been\nAt the center of you might say conservative economics sings Adam Smith\nAdam Smith actually understood that wasn't true\nI think it would be horrified at the abuse of his ideas he recognized that ah whenever businesses get together they conspire against the public interest to raise prices\nBut somehow and the two hundred and some years after Adam Smith that conservatives I'd miss used his ideas\nEven more astounding was the fact that beginning in the Nineteen fifties sixties seventies and my own work or in the seventies and eighties advances in economics explained why markets often don't work the reason that this will hand often seemed invisible was it wasn't there\nThe notion of an invisible hand and supremacy of markets is based on the idea that if everyone buys and sells things in their self interest and threads freely without government intervention everyone will be better off\nJust Stiglitz won the Nobel Prize for economics by identifying some of the ways in which the key assumptions about perfect markets offload the presumption that everyone has all the information they need to make the right decisions just isn't borne out by experience\nThe notion of asymmetric information is very simple it's just that somebody knows something that somebody else doesn't know and the banks obviously\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\n... doctor needed their students the markets basically worked perfectly\nWider economists expect humans to behave like rational calculating machines despite all evidence to the country\nFor some this tendency indicates a key problem with the hearts of economics which is to explain human behavior as if it were a science and the only works if you imagine all humans are the same responding in the same way an old contributions to the economy can be counted\nJournalist country muscles book who cooked Smith spinner argues the traditional economic theories and methods only makes sense if you imagine humanity be self centered so unlike humans as almost a different species in fact some economists have given the species him in ... economic us\nEconomics ... doesn't have any feelings at least they failings not relevant to his economic decision making he's that sort of rational big calculating brain that is always acting additive self interest and all of a set of characteristics or characteristics that we have been told to view as male\nAnd even more er visits sort of all the characteristics that economics guys to great lengths trying to exclude from these models like\nEmotions family the faulty feelings compassion altruism\nAnd all of the things that we have been told that these are not economically round event they send notes anything that we need to studying economics days like suck you the same things that we have been torched view as female I notice the after the Chrysler people were saying this great is\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nWay it's all that makes that CNN and failed economic models in economic theory that is actually based on that\nI agree with Katrin Schumann that people are simply rational ... keyed mentions of what makes us human that this was an important reason why Congress fail to see the crisis coming\nThey do not understand the hubris collusion and trading testosterone that makes bankers appear to be on steroids even when they not\nMarket train his rights to highlight the rest of the factors that influence decisions she's expecting too much of economics or indeed any discipline to incorporate all aspects of human behavior\nThe growing depth and breadth of knowledge requires more specialization but to understand how to tackle road we'll problems more into disparities required\nCriticized tomorrow night with low was in a low thirties sunshine and cooler for Tuesday with ... only in the upper forties\nSupport from Minnesota Public radio comes from the E. H. Argo healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology in healthcare learn more at E. H. R. go dot com\n[noise]\nKinda welcome to stay on the b._b._c. was service Lawrence put on and James ... this morning [noise]\nEmotions in the Australian parliament to the prime minister's commerce and apologizes to victims of child sex abuse going back decades as a nation we found them\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nCaptured and the fighting the ends of the physical Calif a bias in this country does not mean the end of the ideology\nMikhail Gorbachev his back in the news with a warning on arms control Wilson business coming up to him on these things but it's like this will be [noise]\nLive from NPR News in Washington I'm Jim hawk\nPresident Trump confirmed over the weekend the tends to withdraw from a landmark nuclear weapons treaty with Russia as NPR's Shannon ... reports the intermediate range nuclear forces agreement signed in Nineteen eighty seven was an attempt to ban all short and medium range nuclear a non nuclear missiles\nThe U.S says Russia has already violated the ... treaty to the development of the missiles that can hit NATO member countries Kingston reef is the director for disarming research the arms control association\nThe Russians deny that they are in violation of the treaty and in turn a had accused Washington far less credibly in my view of in a in a compliance\nMilitary competition with China is another reason for the U.S withdrawing China never signed in Nineteen eighty seven treaty which means that can develop medium range missiles without constraints leaving the INS treaty could revive Cold War tensions and the likelihood of a global arms race Shannon and sent NPR News\nAnd phone service in the Florida Panhandle is improving but tens of thousands are still without electricity after a catastrophic hit from hurricane Michael on October tenth NPR's Debbie Elliott reports residents now face the ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOrg to learn more\nPiled soaked furniture and household items curbside city commissioner Eric Langston says that town at thirty five hundred has much work I had\nA long time and to get back to normal\nOfficials say they're at the mercy of aid from the state and federal governments because the city's tax collections depend on tourism and water and sewer bells Debbie Elliott NPR News port St Johns Florida\nAt least thirty people were hurt one off or collapsed early Sunday during a party on an apartment in South Carolina near the campus of Clemson University Lee right person says he was dancing with a group of friends when the floor gave way\nYou've got to say somewhere but I was up and mix and you know I'm jumping I have my hands up in the air and the mixing all I can see the the myself is is following like this and in the wake of cause I blacked out and not seeing like girls everywhere with blood all over their face and everything like that\nSome of those who fell suffered broken bones after they fell into the basement of the woods ... apartment complex none of the injuries were by threatening\nCongolese rebels killed Fifteen civilians and abducted a dozen children in an attack at the epicenter of the latest deadly Ebola outbreak Congo's military says the violence has a gun force crucial virus containment efforts to be suspended\nConfirmed Ebola cases of reach two hundred two in this latest outbreak including one hundred Eighteen deaths\nThis is NPR News\nI'm finished journalist has won her case against pro Kremlin hackers who Stockton harassed are both online and off as Teri Schultz reports it's the first time pro Russian disinformation outlets have been sued and the European\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nMen and last week she won one of her abusers the founder of a pro Russian website was found guilty on sixteen charges and will serve almost two years in prison\nThe other man received a one year suspended sentence they must pay a combined fine I'm a hundred and fifty six thousand dollars or as as the verdict has sent the Russian troll universe into overdrive and that she still being sent hateful messages she'll have a book out about her experiences in February for NPR News I'm Teri Schultz in Brussels\nA United Nations backed fund has approve more than one billion dollars for Nineteen new projects to help developing countries tackled climate change\nDuring a four day meeting in Bahrain officials overseeing the green climate fund also agreed to start seeking fresh money next year that's because the Trump Administration is withholding two thirds of a previous three billion dollar commitment\nFor Austin freeze warnings cover a large area stretching from the mid Atlantic to Arkansas and Missouri a high pressure system from Canada is bringing a truly drier mass into the region freezing temperatures are expected until they break\nI'm Jim hook NPR News in Washington\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including warning night and stretch sessions retailers nationwide more dream wave chair dot com and the ... foundation\n[noise]\nTypes that they've been taught everybody Wilkinson you stay with Lawrence and James on the way America's national security advisor he's in Moscow just off to the U.S announced\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nTwenty fifty fifty five [noise]\nWe saw in Australia we're just a few hours ago the prime minister to live in a historic national apology to the victims of child sexual abuse spoke Morrison said it was a day for the country to confront the suffering that so many I didn't do it in silence\nAs a nation we found him we ... them and that ... the ... this is apology is for them and their families to as one survivor recently said to me it wasn't a foreign enemy who did\nThis to us this was done\nBy a stride as to his drivers\n... comes off for a five year long inquiry and responses to the abuses in churches schools\nAnd the Australian defense force among other places will make McKenzie is invested generous in Australia who did some of the original research on the issue make eh thank you for talking to us I Know a many of the survivors the beach in the audience when the national apology was made did many of them except it\n[noise] I think like many of these things in the apology officially at lifestyles guys I'm white to stay in the dining knowledge and suffering that's currently in Port and it's an important symbolic\nOr for many many years in some cases many decades victims have been asking for a minor in the Catholic Church and other and there's other churches and other institutions to say sorry that I had a national government deliver a path\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more white and say\nLike well for example because obviously clearly the key issue now is not just ah what happened in the past but making sure this never happens again\n[noise] and they and one of the K findings of the royal commission was\nThat the spy is happening it's happening again and again I'm not on the scale of previous offending but some of the cases they roll commission dealt with were alive caches and I went historical\nOr one of the cage changes the government has introduced a national rate risque and which is a I mean are we giving them can get compensation without going through a complicated civil court probably say so dealing with the institution that cues of being responsible or hosting the offender\nOr so that's a major change will die there's still a lack of uniformity around the country and respect of that national redress game one of the problems is some institutions\nAre unclear as to whether they're buying into it'll supporting it\nAnd then there's a whole range of a ... she's around ensuring that a future potential victim to protect it started in a child's safety standards\nAnd yet uniform across the country where we have a ... are starting to see what you're responsible for such changes and in some states and Britain quicker than others so yeah I guess the real focus in what many victims are calling for is assigned fuckers thought the national government owned showing those recommendations are fully implement\nThe Brazilian ... presidential candidate juggle so NATO has threatened to ban the policy of his left wing rival if he wins the election and Mexican volunteers me giving food and medical\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nDead in his Mercedes that the U.S ground pre in all states just one case ahead of his nearest rival Sebastian federal Ferrari\nAnd this means that Hamilton missed head to Mexico next weekend with some but still to do it was a very special day for ... and the other three are Ari\nWho ... nine years of age secured his fast growing pre when after one hundred and Thirteen races max stuck in the second in his rental\nAnd football intimate contact in my real economy school to dramatic injury timeliness they beat rifles AC Milan one nail in it to the city or into remains said in the tables six point softly does event is\nAnd the drill for next month's women's Africa a couple of nations was made a glitzy ceremony in a crowd on Sunday night\nHas gone up will face Algeria Mali ... ruin in group a Nigeria the defending champions who won eight of the tent tournaments I saw a top seats in ... the day will say South Africa Zambia and Kenya the temperature will kick off on the seventeenth of an event\nLike more from the shop in twenty minutes time allows business and it really is kind of have to explain to eat you how it's going to adjust its spending plans to comply with the eurozone rules\nThe European Commission was really a ... room to revise its plans to sign the first draft of the budget is on affordable a European Commission is demanding to see a new budget by midday on Monday which isn't going to go down well politically in Italy the news is here from a business that's what is the basic from Italy wants to do this I just want to spend spend spend money it was not spend\nMoney it doesn't have exactly to Italy had elections back in ... remember that resulted in\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\n... basic income for the pool and increasing spending on infrastructure the question is how they got in to pay for his plans the Italian government says it will pay for that with more borrowing the European Commission says ... you've already got an enormous debt and that means\nThat's against the rules for more on this now I'm joined by ... an economics that Louis ... University in ... I think that they ... the Italian governments that it's going to pay for all this with higher growth but growers in the economy and easily has been pissed distantly week and that's the problem\nExactly growth has been slow and has been lower in the last I Would say Fifteen to Twenty years the government to claim said that the new budget or that the uh contains a lot of additional spending will be financed by higher growth\nAnd did you succeed them now likely in fact the Vancouver actually says the main things that are the good old age that there was already ... is so or as slow it down even farther\nAnd on top of that the economic uh the ward that cannot make environment is definitely not positive and this means that the the outlook for the economy is negative so I Would say that it is likely that the doctor said that uh will be larger or if the government among the and the promises has made\nWhat do you expect will happen today than at midday who's got it back down here wrote him oh Brussels\nI think nobody's going to a break down I think the government the wheel or a stick with the we did a budget so we didn't plan and we try to find a clash with the European institution which is a populist government\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nRecently a growing sense of a satisfaction with European situation as a consequence especially of the\nDealing of the immigration policy or you will militia and policy and uh it's a title against supporting dean do you sense the institutions we'd probably a sponsor that a lot I think we will see has turned off\nOkay make elaborate from at least I get back to the ...\nThe business of senior U.S military commanders coat on Britain to take back British medicine sipping captured on the battlefield in Syria us also wants help in the rebuilding of Raqqa from wet jumps to bail reports\n[noise] forty Columbus was from the front line us backed Syrian troops occurring at that final drill before they will be the last big battle against the group known as the Islamic state in northeast Syria there'll be up against an enemy of more than a science\nSurrounded but still willing to fight to the end [noise]\nI mean the Kurdish come on to the Syrian democratic forces tells me the extremist still include many foreign forces and the general ... says that includes an unknown number of British ... [noise]\nSDF has already captured seven hundred foreign fighters among them to know as we speak to a ... shape and Alexander Casey associates of the food on yes executioner known as ... D Joan\nNow held in limbo as prisoners in Syria script the u._k. nationality\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAbout this on the record civil council is trying to get that shot to the bank on its feet but they complained that none of the city is destroyed bridges to be repaired much a racket is without the central services like really moved to\nAn electricity under a still only a sleeper cells are preaching says he\nCouldn't shut up with them I'm a ... says everyone you cannot be the destruction of the city should help rebuild it including Britain and the U.S\nAnd we had that ... ...\n... for lichens records to a sick man the meat have help and support to save his life\nYou can hear racket is returning to some people might not see much of the city is still alive and ruin the question for the people around here now run your own pace to to rebuild that country\nFor America's say they weren't at least until there is a peace process for the whole country\nThese children's future little suffer if you will walks away\nIt's one of the education programs funded by the U.S State Department\n... who is in charge\nWe actually have um some children some girls or I just tried one girl was married at eleven and she had had as I said had been hit by shrapnel say her face is Marty\nAnd so they married her off at eleven she was divorced at Thirteen and we got her into the program and at first she wouldn't speak for when I met her she was one of the top performing students in on her lettering and being able to rights and to draw\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nFor this program and we'll say there's an effort to force of the nation's to do the Trump Administration is cussing [noise] two hundred million dollars to help stabilize Syria [noise]\nThe ... direction is that in terms of million affect your program it anywhere and all night finding will actually end at the end of January\nCountry can now is the senior State Department official in the country\nThe president said that this is a burden that needs to be shared a ISIS is a a a scourge that affects a much more of the world than just zero or even the United states and so it's the obligation of the international community to help with that [noise]\nAmerica still has reached on the ground more than two thousand tree [noise] it says it's other nations if need to move it seems to see if you want to responsibility\nFor these off the mouth of the\n...\n[noise] distribution of BBC World service in the U.S has supported by electric Craig bourbon and crafted and small batches for a full flavor tipping experience forty seven\nPercent alcohol by volume Elijah Craig Kentucky straight bourbon whiskey barge down Kentucky sink wisely drink wisely and by progressive insurance protecting commercial\nVehicles and offering ways to protect small businesses from financial losses liability or progressive commercial dot com [noise] [noise]\nTwo and a half weeks before election day survey after survey shows healthcare is the issue voters care about most and Missouri Senate race has boiled down to a debate\nMe ... and they simply want to stop me from leaving the house\nThat's kinda what I one of the opposition activists in Cameron and uh the only you had from our reporter Randy Joe saw [noise]\nWhat about some stories this morning comes as a migrant cameras on in Mexico and uh that's kind of one of our top stories from the newsroom and the headlines and the question of the migrants not really a camera and the boatloads of migrants crossing the Mediterranean remains as a constant headache it's so constant\nIt's kind of not really even in the headlines anymore ... believes\nThe NGO should played no role in trying to save lives in the central Mediterranean they use those rescue boats\nYou may remember of basically being beat taxi service and for the people smugglers\nAnd encouraging migrants to make the dangerous journey across the Mediterranean\nIn order to facilitate this the Italian government has closed its ports to the non profit organizations or one boat that operated by the Spanish NGO ... open arms decided to defy the Italian government it's set sail for the central Mediterranean from Barcelona will happen next\nOur correspondent James rentals was on board [noise]\nWe are just setting sail now from Barcelona [noise]\nHeading into the open office of the Mediterranean [noise]\nWhere sailing on a convert had your choice they're eleven of us on board [noise]\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learn more at why WC A. M. P. L. S. dot org\nAnd they both we have you know of course watch it leaves interior minister ... says he accuses you and other NGOs whipping taxi services for migrants how to respond\nRunner or a ... a issue no that was\nA child in the city is one of the traits in the world Ninety seven thousand shapes plus they hear every year around two hundred and fifty of them every day maybe even ten an hour I don't think we are at the pool fuck talk or important enough to gather all the attention\nThat I get I guess if you send in the focus now you can't use Italian ports you have to travel for days it's an expensive operation how long can you keep doing\nIt for ... he was supposed to but\nWe are us citizens response to such we won't stop operating we have the support of many European citizens but things that people don't have to die around an abandoned in the military [noise]\nWe've been saving for a movie for days now we've made it from Barcelona all the way to the Italian island of Lampedusa in the central Mediterranean\n\nPlus three in the morning [noise]\nRed and green fashion line [noise]\nWe're really close to that vote now how do you know it's a fishing boat and not a migrant\n... we can see that [noise]\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nOh I see around me now\nKind of a murder case is one of the crew members on the ship she's a former competitive swimmer\nAnd she's worked for many years as a lifeguard\nDuring this mission we'd be in the past seven days we haven't seen any migrants how is that for you when you just don't see any one\nI think that healing is take a train it's just the thing because\nWe only know that they are now we're waiting for those painful because the ... percent are up and then um we didn't know how many like put a lot of the so we need the same thing because we\nAre able to help and now I'm I'm you feel if not the way the ... because of course because when you have at least we are here\nBut in the\n... I'm I'm late because the yet another level and please [noise]\nNine days off we set sail from Barcelona I can now see the ... of Jeb up in the distance\nThe Astros votes will continue its operations in the Mediterranean for another few days\nThey haven't found anyone yet\nNo way for them to rescue\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\n... has to live in a national apology to thousands of victims of institutional child sexual abuse [noise]\nLet me see a lot of ...\nWanting change the titles celebrations are on hold for British drive into his house and you could only finished the that the u._s. formula one grown pre in his ... just one place the head of his nearest rival Ferrari Sebastian federal\nHamilton would have wrapped up his fitness for office championship how'd you meet some federal by eight points that he fell just short Kenny rocking and won his first grade since March twenty teens my stuff and ... seconds I'm off to get rid of his team strategy\nWe should have been able to suffer the game that you get from from a super software to soften the size of the stock is quite significant Kimmy capitalized on that\nI couldn't do anything about that but then once he was the head with quicker I couldn't keep up with them being that I saw a tire on and then we've printed on eleven which is way way too early and they came out nine seconds behind so I had to catch up by the time I caught up the cause of death from bad to worse throughout the race\nFor Hamilton and you need to finish in second place in Mexico next weekend to be crowned champion\nIntimate contact in my early ... scored a traumatic injury timeliness they beat city rivals AC Milan one now in said yeah the result keeps in touch with us in the table six points behind needed event is it's fun you know last second in Spain Sunday's are just two points behind buffalo not\nAfter a tuna when ... and in English Premier League action to lake goes for ever to help them be crystal palace to nail\nPolish said any I had a penalty safe by England's goalkeeper children think fits\nFrustration and for how to spell throwing much since\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nNo one would have because just because of who we we played a role to lose if we're close to put\nThe drool for next month's women's Africa a couple of nations was made in a crowd last night now has gone up and hold is Nigeria will be the top seats for the tournament which kicks off on seventeenth sniff ...\nGone up a drone in group hey with kind of ruined Algeria Mali Nigeria will say South Africa Zambia and Kenya including the the tournament will also served as qualified for next just women's World Cup with three places on of tennis the season ending WG a tournament continues in Singapore today\nNo doubt he was a big match up of the day it's it's ... or ... against American Stevens and if all of the house to us so champions\nAnd something that's kind of such a body and stuff has been a lot of scientists on his side\nHere and I should have huge of course we had a coming back from New York she had four hundred and four hundred and fifty different media outlets are waiting for her to press conference if you look at it you know in the beginning of the year ... people knew what they didn't really care as much because she wasn't that successful\nBut um yeah something beautiful to see that you can create you know how to get to that one individual can spark something like this where they are the nation and that type of energy to actually come from\nFinding the NFL the New Orleans saints player Drew Brees since become Anita pulls closer back in history to sort of five hundred touchdown passes you did it in the twenty to twenty three when as a ... [noise]\nIn ... which are loaded with the sport and we stick with the sports\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAnd the area whether outlook for the twin cities a sunny day expected today with high temperatures in the mid fifties low temperatures were fall into the upper forties during the afternoon winds from the west five to ten increasing to the northwest around Fifteen in the afternoon\nOn Monday Night clear skies was loose in the lower thirties sunny again on Tuesday was high temperatures expected in the upper forties\nClear skies on Tuesday night with lows near thirty and on Wednesday mostly sunny with high temperatures expected around fifty degrees\nStage of the BBC aids any income said celebrating experimental an apple and God music we'd go insects notices he of native instruments the amazing ... Juliet phrase that tells us what it's like to work with the young living ... as opposed to singing the music of someone centuries dad\nYou're talking with us and you can you can discuss what they mean by such and knocking on the page will buy a Saturn musical gesture\nWe chose to hew brunt of the London contemporary ... methods of movie what Canadian finding as mayor of Benjamin plays a peace inspired by the voice of cooked a vein and Israeli ... tells us how I Love one simple to or don't\nTo this day one of them I found it comes to coincide say within ten minutes they were taxing the and give me advice that I should write things that are among the law that cars they have a two and all that trouble coming up on the outside backstage\nLive from NPR News\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\n... shocking and deeply troubling she says those responsible must be held accountable inept credible investigation\nBritain and France and Germany issued a joint statement suggesting their relationship with the Saudi Government will be determined in part how it carries out of an investigation and a pledge that nothing like this ever happens again\nTo re shells reporting was brings that talks apparently deadlock between Britain and the European Union Laura Miller reports that prime minister Theresa May faces a crucial week which could see her continued leadership role threatened\nThere's widespread dissatisfaction across the political spectrum over how prime minister may is handling ... negotiations\nIt's looking increasingly unlikely a deal will be struck by the deadline next march\nMaybe once a limited extent gym to work out how to prevent a heart Irish border between Ireland which will remain in the EU and Northern Ireland which is part of the United kingdom this would violate the good friday peace agreement which remove security checkpoints\nOne conservative lawmakers says Britain cannot be led by someone who has been quote\nAn abject failure to govern had such a defining moment in British history but Briggs administered Dominic ... says of maize deal is defeated in parliament\nBritain will not get better terms from the U. N. or no deal Brexit is inevitable for NPR News I'm Larry Miller in London\nIn North Africa hundreds of migrants have charged a border fence that separates Morocco for my Spanish enclaves as Lucy above ... reports one person died but about two hundred made it onto the Spanish territory\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nWhat's right for their control migrants usually attempt\nTo jump in large numbers to heightened air probability of making it across an order to legally make it to the Spanish mainland they must be granted asylum this year span became the main entry point for migrants crossing into Europe\nAs a mid October forty seven thousand four hundred and fourteen migrants had crossed and sustained by land and sea\nFor NPR News I'm Lucy ... in by salon a\nNewly formed hurricane willow rapidly gain strength on Sunday and is now a category for storms spinning away on the Pacific off Mexico maximum sustained winds are blowing up one hundred forty miles an hour is is NPR News\nUs national security adviser John Bolton is beginning to days of talks in Moscow after President Trump announced his intention to withdraw from a landmark nuclear weapons treaty signed by President Reagan in Nineteen eighty seven\nTrump said Russia has violated the terms of the treaty or Russia has repeatedly denied allegations that it produced an has tested such a muscle [noise]\nJulia Louis Dreyfus was in Washington DC receiving the Mark Twain prize for American humor at the Kennedy Center last night as NPR's Elizabeth Blair reports she was honored by her peers like Jerry Seinfeld and younger comedians who grew up idolizing her\nAs Elaine on Seinfeld Julia Louis Dreyfus can be snarky and messy and have just as many jokes as the guys on the show and that made an impact on Tina Fey\nBecause she's not afraid to be on like ... not on screen and not in person\nLet's go do something I don't want to just sit around here\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nTurns out to be true\nThe Mark Twain prize for American humor will be broadcast on PBS in November and listen to ... NPR News Washington\nAt the box office the horror flicks during Jamie Lee Curtis Halloween captured first place the remake of a star is born held onto certain\nPlayers I'm Jim mark NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent vote whether that's on line over the air or in a bottle more it's the iron Nevada dot com\n[noise]\nAnd welcome to the ... stage on the BBC well ... ... it's a ... day and said to London and I'm walking up to the stunning ... cent nukes it's a restored Eighteenth century Czechs this now home to the London symphony orchestra and wake I'm behind the scenes of their rights and yet called and said\nDo we make me ... only if we get acceptable areas through a gig a theater production a film shoot or in this case\nAn album or music come sit way again to ... and the right things for musicians who at the cutting edge of creating or discovering new sounds fought\nTo fruit sounds like stay with me the London contemporary ... will be performing and telling us about what can we can vote on headset Nick is on\nCanadian violinist NATO Benjamin is playing\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nAnd our wonderful colleagues at the music that BBC Radio free a recording\nThe whole concept last week at discount program talking to everyone [noise]\nOver the country who comes in sure\nBecause the very interesting you never know what you're going to get by on more\nInteresting than most countries because usually you know what you're going to get on your heart for patients are here are very low expectations on something interesting and what not like the whole program but also enjoy summer\nOkay let's go in\nTo the door by the way\nIt's his fleet they exist please open and close to ... that has been very quiet [noise]\nWorks tangible about walking in to add I sat next is the sense that anything can happen\nMusicians leaping boundaries to discover new forms and music and it's not just the musicians the audience has its mind why Dave hadn't talked to some of them later right now as you can probably hear engineers laying cables music stands debate positions and the sound checks began\nBut it can um the table and everything just say sets up to the direction and her husband do you think thank you very\nSent loop says a decommissioned Eighteenth century church because of its time test acoustic it's the perfect time to the London symphony\nOrchestra and of course for all the other concepts\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more he's\nThe Santa along with Robert ... of the London contemporary orchestra there are really big deal and the experimental contemporary music same they do loads of film what have they been around for ten years she\nKnew a I Know somebody of conform to the BBC problems which is essentially the largest classical music festival in the wild your properly is that flashed last musicians we may hear 'em will as being part of a process of gathering\nThe ... than us working with a composer healing naive when young you have to be quite different from anything else you can you describe you brought laptops or you can talk to them\nWell yeah that's the first thing that it makes me makes me think I have a dialogue with them it's not just looking at um some nice to meet you back on a on a piece of paper that has already been through the filter of a publisher\nYou're talking with the person you can you can discuss what they mean by such and knocking on the page will bias such musical gesture and you can awesome what inspired them and get get all sorts of extra information out with them that you you can't do with somebody dead [noise] um and also you can fool my relationship with them said that's it\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more wind WC A. M. P. L. S. dot org\nSomething very special very passing on its own something about\n\nHe [noise]\n[noise]\n[noise]\n[laughter] ooh\nNo\n\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nTo church in London it's a BBC open it come sit innovative disruptive and old together\nWithout apology with bringing in music from the leading edge of the ... case contemporary scene now west Canadian violinist may read Benjamin [noise]\nWalking in\nTo the gamble on something to do I love this or um [noise]\nWell it too well I found mischievous play playing with\nThe gamut on their uh [laughter]\nWe might know [laughter] but they all say shiny inside of us every route to touch them dead last year for about ... [noise]\n[noise]\nMan\nSo you're playing a piece for the ethnic come sit by ... and it's called full nearby and I see and that's the you know [laughter] um is it a special commission to piece was commissioned by you have a sympathy passive she\nShe did so Cassandra compose this piece for me in two thousand twelve this is a piece which Cassandra I think on her website she says it's a dedication to me because of my no nonsense playing or something like that which I think is a great compliment\nThe pieces short and fast burning piece which is based on the sound of Kurt Cobain singing voice from the Nirvana on plug it in New York album that was recorded in Nineteen Ninety three he's singing the song where did you sleep last night which is uh\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more [noise]\nI mean I think when you heard that this was based around something that cuts of ended with his voice\nJust just not such a Muslim where anything comes from so you when you find do you need to know that or you just playing a beautiful composition by kasandra mullah\n... well I think it helps to have a sound in mind so hearing the sounds that Cassandra happens to be focused on when she was composing the peace and being able to listen to that kind of as an artifact the sonic artifact\nThat's very inspiring because of course uh I guess for me when I play violin I'm always focused on the curiosities of sound and imagining sound in that way so yes I think it it's inspiring\nJust the kind of audiences have come to a ... like this experimental music events like this all honestly I think\nAnybody could come to these events they are so broad reaching in the different styles of music that are presented\nI think whenever I think about an audience I think of however many individuals in the room and I think I'd like to make something available for them and so they're free to engage with that in whatever way they want to they're free to to say I love that I've never heard that before\nI heard something new or they're free to say wow I really didn't enjoy that that was too harsh too much cracking too much Kurt Cobain for my listening but the point is that each little morsel that year\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to Minnesota Forward when it's time to talk forums on race YWCA NPR last dot org\n[noise] right and then they narrow Benjamin playing pool now by kasandra men are [noise]\nYeah I read I the ...\nHow it goes well sure about them than the same time would ruin busted a knee to buying a so\nUnder this eggs in the first experience\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nThat states have not won at the outset backstage didn't go way there's no mostly come from the London contemporary orchestra ... instrument who make infect techno\nDistribution of the b._b._c. World Service in the U.S has supported by T Rowe price offering a strategic investing approach that examines opportunities first hand since Nineteen thirty seven zero price invest with\nConfidence and by carbon I offering data protection solutions for businesses including automatic back up for servers and point protection high availability and disaster recovery and data migration learn more at ... dot com\n[noise]\nTwo and a half weeks before election day survey after survey shows healthcare is the issue voters care about most and Missouri Senate race has boiled down to a debate over covering preexisting conditions I Would never dreamed of the answer there\n\n\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR started word\nStage with me Nikki Beatty ad where here again at al essay and looks at the house of London taking the pulse of the I've only got music scene here\nWhat we get the privilege of experiencing these open air concept is hearing a new piece of music that's NASA being HUD anywhere in the world before previous people primary as I Am with compose at least ... he's what we've grown up with\nIs being primary edge tonight with soprano Juliet phrases singing Lisa he'll walk a three grown up gets a world premiere tonight I'm that to me would be almost exciting how do you feel\nWell very sly said slightly nervous I met a whole range of things yeah\nSo one huge ... the wonderful Juliet to performing\nWas that things that suddenly became collaborative you needed to change would always say this is a hard and soft composition well how what was the ... and I have had quite a long relationship speaking to one another\nSo we tried to material and I had a very good sense of how her voice worked\nAnd ... says her personality which is very important for a performer one thing I think\nThat ... you know both going for with something which was very personal quite intimate but also not precious and finding the ... tree together was um something which we worked on\nIn the end the competition was essentially composed\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nImposed by gerrymandering Hopkins is nineteenth century British poet and\nAt the time when Julia and I first met we had a whole range of things on the table one of the things that we were talking a lot about was trying to set a\nWhich had an innate musicality and Hopkins poetry is beautifully musical he has he's incredibly inventive rhythms amazing sound passing sit to allow that puts you to be in any way\nSo when people experience ... ...\nAre they having live music thing said is it just the cause is that something going on in the background described it for us I Know you didn't want to have too much away [noise]\nSo the idea for the work was that it needed to be food Juliet to perform live and for all the rest of the material to be played three loud speak is one of the things I'm really interested in is different tuning systems I found a way\nThrough this by thinking well it's quite difficult in life performance to create a situation where you can face seamlessly moved between different ...\nWell yeah because I think um it's quite a complex wells I have a background in India so I understand Indian title systems and things like that well it's very complicated for but for the name\nThan out in there and I am a layman can you explain these different chanting systems maybe picking up on this threat from the Indian music to begin with you know when you're using particular scales in that tradition\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to Minnesota Forward with it's time to talk forums on race why W C. A. M. P. L. S. dot org\nYeah actually it's a Kenyan on what you need to find your place so voice can can really think any Sony continuing does actually an infinite number\nMaybe a good analogy would be I'm watching his weight is when I was child I had a ... twelve colored pencils\nAnd then if you're working with this system is cheating\nIt's like you suddenly got your books the Hudson chi chi Le Pen so [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n\nMm Mm Mm [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\nProgramming is supported by wind WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\n[noise]\n... [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\nLisa aliens of three grown us based on a general manly Hopkins Palin\n... sat back state and the b._b._c. will service where asking you to open your mind to this open air come sit\nExperimental Avalon God musicians performing works that you're most likely wasn't of HUD if you're talking about the um social media to hash tag s ... let us know what you think\n[noise]\nI didn't like insects are a lot but I Do like techno music insect techno that full could be a very interesting new sounds to me\nNative instrument or a bustling dwelling to you I Know ... and then an Australian Felicity men get their music is built from electronic and vocal adaptations of animal and insects recordings\nSupport from Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulate\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nEverybody strong emotions any astray in parliament as prime minister ... apologizes to victims of child sex abuse going back decades\nAs a nation we found them\nWe the ... and that was always very shy\nSo we talk about the thousands of migrants walking income voice of America they hope they've made it into Mexico we speak to our correspondent as the political route of the issue\nGrows in the U.S by Mikhail Gorbachev it back in the news with a warning on arms control on the head of the midterm elections we've got to Tennessee but African American ... say they can tip the scales and send a Democrat to Washington\nNew spirit has awakened and uh we just happy to see this energy and now we've got into the fall [noise]\nBut as soon as as well [noise]\n\nLive from NPR News in Washington I'm Jim hawk Ottawa is being urged to ban China's state run telecommunications giant from taking part in developing Canada's next generation wireless network has been carbon jak reports a former defense minister sites espionage and security concerns\nFormer defense minister Peter McKay says being a state run company while way could potentially be order to use its equipment to spy or even to disable devices and infrastructure in Canada while ways the world's biggest telecommunications equipment manufacturer and a leading smartphone maker\nEarlier this month two U.S senators also urged prime minister Justin Trudeau to ban Huawei from Canada's wireless networks\nAnd carpet jak reporting Jordan says it will not renew Israeli leases on two tracks of land\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\n... summer or a few square miles of agricultural land used by Israeli farmers\nThe lease agreement expires in less than a week and Jordanian members of parliament as well as protesters have urged the king not to renew it some have also called for Jordan to scrap the entire peace treaty Jordan has made clear it is committed to the peace agreement with Israel Jane around for NPR News Amman, Jordan\nLeaders in Iraq have signed onto a lucrative arrangement with General Electric and the German company Siemens to develop a rocks power infrastructure NPR's Shannon vents and reports the tons of agreement comes after and turns international maneuvering\nSiemens had been the front runner for a report eight Fifteen billion dollar deal with Iraq to supply the country with power generation equipment but after pressure from the Trump Administration Iraq's government may get some of the work to us based GE\nAccording to Bloomberg News and the Financial Times U.S officials warned Iraq's prime minister not to move forward with Siemens and then if you did so us a rock relations would be at risk\nAlongside the GED deal the U.S has also reportedly signed a broader agreement to help Iraq no doubt it's energy sector and make the country energy independent Senate and sent NPR News Washington\nIn a sign of growing pressure on Saudi Arabia turkey says it will announce details of its investigation into the killing of journalist ... G on Tuesday\nTurkey's president vowing to go into detail about the killing Saudi Arabia contends he was killed in a fish fries by pro government media and turkey have reporter to different narrative saying a soft\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nFederal Reserve for raising interest rates this past week but as Steven back now reports fed policymakers give no indication they will bend the pressure\nIn past administrations most fed criticism came from cabinet members but dropping self has bashed the central bank though it's led by his nominee Jerome Powell this week Trump called the fed his biggest threat for raising rates too fast he'd previously called the fed crazy and far too stringent\nBut when fed policymakers raised raised last month\nFor the third time this year they planned further gradual increase is former chairman Alan Greenspan says fed officials should quote put ear muffs on and just don't listen\nPal seems inclined to take that advice saying they don't consider political factors in judging what's best for the economy\nFor NPR News I'm Steve back near\nOne of Taiwan's fastest passenger trains derailed Sunday along curbing stretch of track killing at least Eighteen people and injuring more than one hundred Seventy others the ... express was carrying more than three hundred sixty passengers went it went off the tracks authorities still investigating the cause\nA firefighter has died while emergency services responded to flash flooding caused by heavy rain and southern Spain the firefighter went missing when his truck overturned on a flooded roads Saturday Night in his body was found hours later fast moving water flooded homes streets in bridges and the southern province of Spain\nLast week Thirteen people died and flooding on the Spanish island of Majorca\nI'm Jim Huck NPR News in Washington\nFor NPR comes from NPR stations other contributors include\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nAll the stories and welcomed news site with Lawrence and James on the way we'll be hearing from Tennessee strongly Trump country on how Democrats have hopes for the midterm elections we how Mexican volunteers giving out food and water to the Honduran migrants on march to the U.S from white Italy could end up on the northeast up in Brussels overspending with money it doesn't have\nLet coming up on Tuesday [noise]\nWithout seeing Australia well and if you as you go to the prime minister delivered historic national apology to the victims of child sex abuse ... said it was a day for the country to confront suffering so many injured in science\nWe on every survivor in this country we love you\nWe ... and we only hear\nMatter if you were here at this meeting flies or elsewhere this apology is to you and for you you're presidents and participation Mike's tangible at work to diet and give strength to others who I get to share what has happened in the world\nHas the Australian prime minister Scott Morris and saying sorry on behalf of the nation to victims of child sexual abuse\nHundreds of people gathered in camera on Monday to him is to Mars and deliver the emotional address in parliament it follows a five via inquiry could roll commission\nWhich found tens of thousands of children who suffered abuse in the nation's institutions over a period of decades at the inquiry which concluded last December HUD more than eight thousand testimonies from victims about abuse one of those who testified in who was also there to here Scott Peterson's apology\nProgramming is supported by YWCA Minneapolis bringing the community together to Minnesota Forward with it's time to talk forums on race on October twenty two you can visit YWCA N. P. L. S. dot org to learn more\nTalked about institutions the churches all these people that were doing the wrong things for us to pay for size to trust people like he bought the place up to church the nuns people at the institution cytokines up Salvation Army every ... where kids go\nAnd spicy looked officer in love and care for\nThat we're getting abused basically mentally and sexually\nHow does this kind of occasion\nMeasure up when you were comparing it with something like criminal justice majority rule in your case the man who abused you ended up dying in prison how do you weigh those up this is a different kind of justice a different kind of moving to closure how does it compare with the criminal system\nThe criminal sentences or even two pitfalls or any any thing to do with children today it's a polling like every time I pick up a pipe I and I said a five year old child right like and I only get either a month where's\nThe justice in that for that famous for that child and I it's it's appalling the justice system needs to stop and look at it the sample since and and to protect more kids and the kids when they leave their stories and now believed\nIt took just either for somebody to actually hey we believe in ... sorry so many times many charge you know and just that would last year when I got a settlement\nI had all of a French fry it was not your fault and wait to leave and that to me was just old\nBack down and I think the government there we ... a stick or would we did a budget so we didn't plan and we try to find a clash with the European Institution He's a populist government there that uh is high and get the next to European elections or in the spring\nAnd there is a finding domestic popular support by showing that people can uh a fight against the European institutions the institutions would probably a sponsor that but I think we will or cs enough\n... at least that's the ... and we'll be watching what happens in about three hours time they've known as many things\nThat [noise]\nThe former Soviet leader Mikhail Gorbachev is back in the headlines describing a decision taken by President Trump has showing a lack of wisdom that came off the American president announced plans to withdraw from a Cold War era nuclear weapons treaty mystical shelf was the one who signed the original document back in Nineteen eighty seven with President Reagan\nAnd one person who would have certainly read the critique is Mr Trump's national security adviser John Bolton who arrived in Moscow on Sunday it doesn't look like miss the boat and we'll have an easy time I'm encouraged that professor of international relations at the European University in St Petersburg\nYes I Am from a ... and most of them is the reason I Would say when\nWe speak when we discuss this new or you know the news about the abbreviation those fighting this three day which was a member of the talks about there are three two to three to was\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nTo to to forget about the three day when he was a wise and back in there and I'll do not believe\nOf the mystery that sound Fifteen Years to go\nAnd the rest of was you know accused of violating the three to four at least like Cy so stay on the U.S and what ... what what's the difference between those stalks and the new ... with your client you know I see that this is I'm not ... the domestic problems\nBoth Russia and the United states ... not right now can you expand on that ...\nYeah I I can do that or did you wrote deterioration of Russian American relations ... to start to well from the Russian site that took stock since that are just so I was in the whales\nAre often Mr Putin are needed to you know to to to keep to hold his power off the the beef protest against the ... election and [noise]\nAnd from the United states side they're already been deterioration to start this from doing to sixteen since Mr Trump was elected president though then they can states\nAnd you know we we all full all this way for for a you know of criticism towards Russia Russian meddling in Russian but you see patients somehow in American domestic politics but it's more about the American domestic ah\nFrom but it is a major conflict than it's most Russian American idol a sense you know we all all day or so face which looks like Jordan back to the Cold War era this is not the Cold War Russia is much weaker than the ... the Soviet Union and you'll still be\nRussia a was old is in the way our man that is this cost [noise]\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\n... Tennessee a pretty something about twenty five percent in the presidential election but now there's actually a contest going on in what has traditionally a deeply red Republican state big money is pouring in big names of weighing in almost become the single most important Senate race in the country ... went to Nashville Saddam [noise]\nAt the new hope Baptist church in Nashville voting is a faith issues [noise]\nAfrican Americans didn't turn out in large numbers for the presidential election and they don't like the result so black clergy has mobilized\n\n\nAfter James Turner the second to believe that if African Americans in Tennessee vote as a bloc that could tip the scales in the Senate race and send a Democrat to Washington\nOr new spirit as awake and and uh we just happy to see this energy and now he's got to the polls\nIt's extraordinary that the Democrats think they even had a chance in this ruby red state\nDemocrats that there is a long time but [noise]\nThe Republican candidate Marsha Blackburn has a reputation as a firebrand she's tied herself closely to President Trump he's campaign for her twice\nIn ... grade\n[noise]\nLook I'm not running against Donald Trump running for ... to represent the people who are trying to St Bernard along\nThe Democratic candidates Phil Bredesen is a popular former governor he taught\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nAnd\nThis is an annual fair and the town of Louis for its Trump country still there is some impatience with parties and shutting matches in Washington\nAnd the other\nTennessee is an interesting test of whether a political moderate still has appeal in this hyper polarized climate but it's also crucial because the Democratic wind here is key to helping to party take control of the Senate and that's a deal breaker for me [noise]\nI Love Donald Trump\nI think America back on a run right now I think we're re re spreads out all over the world but what about Bill Read it then what do you think of him out nice guy I vote for him\nBut he's somebody who might get things done right\nNow he's gonna he's ... he's only going to get done one of his party wants them to get done with the extreme conservatives and extreme liberals a moderate and it's really really nice to have [noise]\nAnd but you don't know if you're going to vote for the moderate feel granted I sure right now I'm not you might I might and is that one of the main reasons why yeah [noise]\nIn a state where music is the currency the singer Taylor Swift has raised the odds she threw her mega star power behind tendencies Democrats in a recent social media posed to her one hundred and twelve million followers [noise]\nAsserted millennials registered to vote but that doesn't\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nIn Myrtle Beach\nAnd I don't think I did write music and he did great and I don't think he tried to tell you more\nThan\nThe Republicans have pulled ahead in the polls but so much work depend on who actually showed up to the [noise]\n\nRussia\nIn Nashville a looking ahead to to the Senate race there that is one of the\nMost hotly contested once in the mid term elections lots of mid term stuff goes to the special ... will service programs being accurate from uh from America Jimmy ...\nWho's report you may have had will be a part of that as well uh we'll bring you all the five here on new state as well [noise] yes indeed uh what's come across in a yeah what's that about ten days time something like that would be a couple of weeks\nSo that's it for the suspicion of nice to meet with James Lawrence thanks very much for this thing I'll be back tomorrow Florence will not put back on your way airwaves very soon into yourself [noise]\n\nDistribution of the b._b._c. World Service in the U.S is supported by hacker\nOne building organizations reduced risk of a cyber security incident might partnering with trusted Packers to find and fixed software vulnerability before criminals can exploit them more at hacker one dot com and by Raymond James offering personalized wealth men\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nAnd then they said that old transplant and so rich stood at the China liver transplant registry as if this was proof that they were somehow ethically procured\nThat registries no shape and two independent or public scrutiny so we couldn't tell whether the information that would actually verify that claim\nBut also that register was established in two thousand and five at a time when all the organs by the Chinese owned admission whistles from prison is so it didn't seem it very useful piece of evidence to say that the Trump sponsor registered\nAnd then we um enlisted the services of a Chinese speaking reset Chuck who actually looked into the hospital documents from ... province department of health to find out when the pilot program started that\nAnd those documents showed that the pilot program didn't stop in ... hospital until late ... eleven so his research program run for Eighteen months before that was even a pilot program actually hospitals\nAnd in fact his hospitals only approved use hops not live as so we've really felt that he had provided any proof of soul\nAnd then he and his colleagues address the claim that they would have needed three times as many donors to get the same number of living\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a NPR less dot org\nThat claim that we look to that type ... which was in Chinese in ... ... ... and that type it was just a discussion article about how ... D C D and there was no evidence in that type it just showed that the Chinese retrieval rights with Ninety percent\nSo we felt that that lesser in fact raised some questions that they don't sit and it certainly didn't amount to prove that they would not lying there between the logical\nSo we thought we'd oh ...\nI don't know where did you come from\nSo I went up to ... to ... off the tool but he didn't want to talk to me [noise]\nYou're draw the line for ten minutes [noise] you'll pay from threatened to sit on\nYour paper was attracted to New Hampshire so I'm going to be more [noise]\nDid you\nTo pay for you misled before about you as you said there were no business with a shame you don't want want somebody questions as I approached\nA group of is largely female entourage formed a tight circle around him so protecting him from me and then they heard off after the whole down the escalator and into a new way to vehicle\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nKids English he wanted to give back\nJust helping another English teacher Phil ... who died in China last may\nWhen feel lost his life after complications from type one diabetes last month he donated his organs leading these Chinese dumped has done like bowed at his bedside\nHe said if I've got the opportunity and I'm In a in a situation then let them type with I think\nIt was hard for this is a report from ... channel seven news tight here not to convince the outside world of China's newfound direction it's rather an illustration of the kind of publicity campaigns now used within China\nTo encourage open donation in China many people hold Confucian beliefs which teach the body should remain hole in death\nA tradition which is potentially in conflict with this new cold football ...\nSo how many people have become open donors in China\nChina is knowledge to performing the second highest number of ... in the world of the usa around ten thousand is a figure of ... is an official soul says\nThe campaign group the international Kurdish and and ... abuse in China believes the figure is higher they got research is to analyze published Chinese medical data on the capacity of transplantation facilities\nEthan Goodman presented the assessments to congressional hearing two years ago\nThe Chinese medical establishment calmly claims that China prefers ten thousand transplants for years you know managing the typical state licensed transplant center in China three or four transplant teams thirty or\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nBack at the envelope answer you can do it right here are not ten thousand but over fifty thousand transplants for a year\nOn the campaign has also conducted another research project ringing around Chinese donation senses\nWe used to have dedicated researchers who call every day\nThe same centers every day where you could donate your organs\nAnd the phone rang and rang and rang sometimes they would not pick it up for over a month finally when somebody did the researcher of instructed to say I want to volunteer I'm going to donate my Oregon's by the way how many donations have you got so far that said five or ... three\nWe're talking about cities of well over five million where they'd gotten five donations period total I mean there was almost no volunteer organ donations at all and now the numbers if you look at them that are appearing there a while they look pretty suspect it looks like they're just pretty much making them up but but I'm not on the ground I can verify that\nWhile these findings suggest a low up take China now has a national database access throwing up where people could offer to donate that opens\nSo how many are now registered I off the person in charge when Jay to transplant surgeon and form a Chinese minister for health and courage chat and director of China's national organ donation on transportation committee\nNot think the quality and all that shit stinks\nSeventy percent of the people in China Seventy percent of the Chinese people I've been into the late ... as long as the season is fat open and transparent so how many have you had found any less than ... and the summer of ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty six you can visit why W C. A. M. P. L. S. dot org to learn more\nYes on everybody how does that explain the number of Trump's bombs in in the country I mean how many Trump's lots of taking place each year your\nYou'll you'll sure didn't know that the concept more to the wind shear board is going to force the recipient otherwise so quick to ask your questions yeah because I think you have a different way the official\nFigures I think it's about ten thousand uh Charles ... is that right\nOff the air we have a Fifteen thousand\nOrgan transplantation at full including teeny leave a hot law right now every year in China ... billion people buy into ICU you I I feel\nThat restitution for that one kid is nothing to do with the next you know you'll you'll give it a very nice understanding\nWell how come I like I was labeled I was offered to live a very quickly\nBut but you're from a hospital in China about that now is that possible what's your question how is it possible if I wake up as a member of the public yes one of the first hospitals I raise that getting the say say yes it's possible we can do your should come every but you're in a short space of time that I was a possible how is that possible\nYou you'll you'll ... you'll you'll just to be the only the sense that you would just be something I'm not a happy to share the questions that you've seen what have I Try to do is overseas or a handful pupil\nBasis on the and the sun's out here on the political agendas until ...\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nBecause of all human beings well who who manatees and so this was sick for about ... million\nFilm really shows people being offered him a very recent film in ...\nI Know nothing about the big deals I always listen to the opinions and even some of the criticism from global feminine I don't want to be an honest answer the question somebody will be some political agendas well okay\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit wind WC A. M. P. L. S. dot org to learn more\n[noise] the world that you fast on air on line on your phone at all things considered we cut through the clutter and take you beyond the headlines there's more to every story listen every afternoon it's\nOur sense of who we are not the most personal level we all have our own family background in general sense we all all of U.S policy the human species but it's the stuff in between that puts us in groups or tribes and often motivates our behavior\nGender religion ethnicity nationality things all the system's fault lines that seemed to separate us from them are my guests today is Kwame Anthony Appiah an academic on public intellectual\nDon't close yourself off people who live with people that die both identities tend to be less bigoted than people did that and said don't allow yourself to\nBe channeled off into a world in which you've only are among white people only among Catholics only among as straight people and so on\nBats Kwame Anthony Appiah all know how to talk after the news\nLive from NPR News in Washington I'm Jim Hodge landmark Cold War nuclear arms treaty between the U.S and Russia is on the brink of collapse President Trump says he intends to withdraw from the Nineteen eighty seven agreement accusing Moscow were violating it for years as Matthew Bodner reports Russia is threatening to retaliate\nSpeaking to journalists in Moscow the Russian foreign ministry senior arms control official said that us withdrawal from the treaty would be a very dangerous step in a lengthy Facebook post the head of the Russian Senate's foreign affairs committee with more blondes\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nSaid that he wants to renegotiate nuclear arms control and bring China which is not currently a signatory into the fold for NPR News I'm Matthew bother in Moscow\nPresident Trump now says he's not satisfied with Saudi Arabia's explanation of\nHow journalists ... lost his life earlier he called the kingdom's account of a fist fight to turn deadly credible meanwhile NPR's nor was when I was reports that Saudi Arabia's foreign minister told Fox News his country is conducting a thorough investigation\nI'd have been a message that said none of those involved in ... that had close ties to the Saudi crown prince Mohammed bin Salman on\nThe individuals who did this to this size and scope of this was an operation that was a roof operations\nAs you can also noted that the investigation was still in its early stages and he said that Saudi officials currently don't know the exact positive that or where his body as it is unclear when the Saudi investigation will conclude Turkey's president has promised to reveal a statement on Tuesday newer was was NPR News Washington\nA Swedish woman who try to stop on the Afghan a man's deportation by keeping a flight from taking off will now be prosecuted for the act as Teri Schultz reports Swedish authorities have a Twenty one year old could be sent to jail\n... says she was trying to save a life by refusing to sit down and an airliner bound for Istanbul that was carrying a failed Afghan asylum seeker back to cobble she delayed the flight for two hours until both she and the men were taken off the plane ... her stand up with the crew on her phone and it went viral\nA Swedish prosecutor says purposely delaying a flight is a violation of Sweden's aviation act and he's speaking to\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nStorm with wins topping out at one hundred fifty five miles an hour there's a possibility of life threatening storm surge powerful winds and torrential rain fall this is NPR News\nAt least one thousand Central American migrants have made it across the border into Mexico as a heavy stream of migrants emerging from Honduras in Guatemala push northward out of their countries around five thousand strong they say their final goal is to arrive in the United states reporter James Frederick filed this report from the town of temperature the Mexico\nI'm here in the central square and thousands of people from the migrant caravan arrived here today but it was not easy to get here they walked one two three miles from the Mexican border to get to the city of Chula\nTemperature it's got about Ninety degrees today it's very humid here there are lots of women and children lots of vulnerable people here there is Red Cross treating some people here and others are just trying to get some rest some water and food before they continue north as soon as possible\nJames Frederick reporting from Tampa to Mexico\nA United Nations backed fund has approved more than one billion dollars for Nineteen new projects to help developing countries tackle climate change during a four day meeting in Bahrain officials overseeing the green climate fund also agreed to start seeking fresh money next year\nThat's because the Trump Administration is withholding two thirds of a previous three billion dollar commitment\nFrost and freeze warnings cover a large area stretching from the mid Atlantic to Arkansas and Missouri high pressure system from Canada is bringing a\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race why W ca NPR less dot org\nBooks down in support of the David Gilkey ... memorial fund established to strengthen NPR's commitment to training and protecting journalists in high risk environments and the end he Casey foundation\nTo hog talk on the b._b._c. World Service my guests today has become one of the world's leading public intellectuals suits focused much of his attention on identity how we humans see ourselves and others through the complex prism of race gender religion class and nationality\nFor Kwame Anthony Appiah the drive to dig deep into such questions comes from a very personal place\nHe is the child of a so called mixed marriage his father was a lawyer and will connect ... politician in pre independence gone to\nHis mother was an English woman to address the classic stall Kwame Anthony Appiah was a gifted student who went to Cambridge University and became a professor of philosophy on law at New York University He is a gay man who was married to his partner of more than two decades\nSo his own life is a fascinating example of how complex on multi led a sense of self can be\nAnd yet the way we humans define ourselves and define others often it tends to be focused on division we use race religion on the class to separate us from then increasingly in this young century the politics of identity seems to be fueling conflict on hate\nSo is there an antidote to this preoccupation with group on tribe well Kwame\nProgramming is supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nA little bit on who I'm Talking to a taxi drivers are usually\nI explain that I'm half a gun at enough British by origin and that I live in the United states that are that gives me three countries to talk about in terms of some sort of national origin\nTo you when you describe where you're from and and the sort of ... of your identity although ... are you thinking that you're sending signals to your interlocutor about about who you are\nYes I think I'm sending signals I think that sort of as it were weak signals from faraway planet or something because because they don't tell you as much as I think many people assume\nUh they they will so I I grew up and got on my father was going to end but that doesn't tell you very much about how interested I Am and gun or it doesn't tell you how much I never got us as I Am ... that that that he is and so on many people that would be more informative to know what their nationality is you know if if at\nBut I end up pretty quickly in a conversation I think you move beyond the the stereotypes into into more detail and then it doesn't matter so much that it's not all that helpful\nWould it be too simplistic to say that in in all of your work on a race religion and creed as you put it on gender and all the different ways that we can\nIdentify ourselves into identify ourselves and others your conclusion is that frankly we roll so complex and so unique that almost any label we apply is in some way or rather misleading\nI think that's right if you take all the big labels that you know the race religion nationality I'm even talks\nProgramming is supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nOf ... so you ... I mean this isn't just about Donald Trump won Glenn other look at the populism and a nativism in Europe where they are very loud and Matthias L Vietnam I interviewed on how to recently in Italy and you're flipping Victor Oh about an hour you can look at a whole host of I'm frankly you could look beyond the shows have Europe to India where\nThe current government uses nationalist and and polarizing cultural messages\nAnd it does so but the point you alluded to earlier you ultimately are not to miss the new believe that the trajectory of the human condition is in ... in that positive sense toward a more universal is the more\nHumane understanding compassionate humanity I guess how can you square that with what you see well\nUh I I guess because I'm looking at it over a longer horizon than just five or ten years or ten or Twenty years I'm thinking about how much things have improved in these respects or in many ways over the last century or so for example\nThink about the massive improvement in the condition of wanting to ask people in many many countries over the last century look at the massive\nReduction in a racial or discrimination in the law in the United states over the last hundred years look at the edge of the increasing coming together of Europe at the same at the moment of these moments of nationalism\nProgramming is supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nSee is in the direction that I Would regard as up one area where I can see that you would find solace would be in the way in which certainly in the western world ah societies\nAnd cultures view a gender issues particularly the sexuality I mean your your uh unknown locked in for very long time in out gay man you took advantage of America's change of the law so that you could Mario longtime partner\nHow far can we go\nWith the notion that human beings are now free\nTo choose their identities in ways that we never even thought for not just in terms of\nOf sexuality but even in terms of of basic gender where now there is a a very powerful movement to to change the way the binary way we see men and women are a lot of people who define themselves as known binary there are others who are transgender ring and society slowly appears to be moving\nTo to accept them in New ways where does this end well\nI don't think he ends the ... there are two things at the airport and about where it doesn't that doesn't then with the disappearance of identity we are reforming our justice system but by not getting rid of gender altogether I can I can ... I Believe that I live alone all into the remote future\nWe'll still have ... it'll be more complicated than the old simple binary system but there will be men and women and some people in between\nNow and I was the question is where the self identity and because the interestingly I I'm I'm blushing between different spheres but but I I'm mindful on ... not so long ago we spoke to a woman code ritual dollars ... who is white parents age but\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit wind WC A. M. P. L. S. dot org to learn more\n... being black is and she said look I I've never identified as white I feel myself to be black so therefore to that extent I'm black\nWell I think she's a very good case to think about because you ask what's the relationship between ... and and another I think you have to think of these things as a matter of a negotiation you can't simply declare the meaning of your own race all on their own race is a social category you need to\nIf you if you don't like where it's put you you need to persuade the well to change that is what trans people have done\nThe trick trans people have done what Rachel Dolezal didn't do which is they've\nCreated a movement to allow them to be what they want to be in our system they've asked us to change the system have I'm happy to respond affirmatively to that request and change the system I don't think it has any harm to me to buy masculinity\nTo adapt the system in that way and even if it did a little bit of how do I am asking them the I'd be happy because it's obviously very important to them\nA fragile do they'll have could have provided a could've made these arguments of ... began the thing and if you could have done this in the way that was a little bit more\nStraightforward because what she was actually doing she knew involved concealing something that other people thought was important that she didn't think it was important and that's an interesting fact about that\nBut unfortunately a black in America doesn't belong to her and so the only way can be changed in the direction that she wants and I'm just I'm willing to listen to her arguments and doing it that way\nIs if she makes the arguments creates the movement and she can't do that on her and she has to do it with other things have to persuade other people\nThis interview and indeed in some of your writings you would have been very consistent\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a NPR less dot org\nTo overcome the lies that currently under paying our identity\nWhile I think the most important thing for us to overcome and to the extent that getting rid of the lies helps I'm In favor of that is is the the moments when identities leads to to hostility and hatred and division\nThat's the thing that was looking for for that I think some things can be said or but these are just things that are known to social psychologist one is\nDon't close yourself off people who live with people of diverse identities tend to be less bigoted than people did that so don't allow yourself to\nBe channeled off into a world in which she only are among white people only among Catholics only among 'em straight people and so on open your eyes open your social experience do people have all the major kinds and do things with them that's not about\nRace or religion or or sexuality but there are about soccer or about to go to the movies are about\nA in a building something in your community together worked together with people because I think working together with people of diverse identities makes the identity is less dangerous and then frankly if you have folks ideas about them as long as the falls out as hell leading you to behave badly\nI'm not so worried about the people have false ideas about absolutely everything not just identity level of ideas about cooking and it and if it doesn't do much home I'm not too worried about the final thought\nWe have a a thinker and rice or in the United kingdom kingdom come David good heart who said that these days the most important distinction and identity that that one can use when looking at people in western society between those he calls [noise]\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nTo people who are not so immobile whose fault purchases or perhaps more localized not so\nOpen and then they according to David good hot I'm much less interested in the kind of ideals that you've just been painting with me\nI Am happy to live in a world with the somewhere as I just don't want them shaping the will to the rest of us in a way that makes us it very difficult for us to do what we want to do so if my my favorite example this is the American example of the Amish in Pennsylvania\nThey close themselves off they don't like to talking to strangers and they don't like money they have like ... like lots of things that I think of as ... as sort of an ethical Boston will and they've made a will to themselves I think they're entitled that I Believe I Believe that that that their freedom is a simple as anybody else's freedom\nAt ... and they don't do any harm to the rest of us they go right into the will campaigning against the others they just live separately I don't mind that I think if you want to be somewhere like that that's fine\nBut if you want to be the kind of someone who wants to take over the United states or Britain and turn it into a country of somewhere as a than I Am a on the other side from you I I I'm a live and let live kind of person\nI understand the attractions of locality I remember the pleasures of of my grandmother fingers really Richard after that goes to show so it's a lovely place that I can imagine that perfectly decent life\nOr living there are all the time mostly hanging out with people prevention apps and it's not the life that I've chosen and they sort of people who wants to live that life I think that's fine but I don't think they should um ... shape of world in which what I wanted to do is impossible\nAnd we have to end the ends on the up here it's been a pleasure having you on hold for it\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAdvisor dot com and delight private delivery audit tax consulting an advisory services tailored to the needs of growing privately held company delight dot com slash us slashed private\n[noise]\nTwo and a half weeks before election day survey after survey shows healthcare is the issue voters care about most and Missouri Senate race has boiled down to a debate over covering preexisting conditions I Would never dream of the answer they're\nAnd then the phone rings you went to the next one was like a drug and if you're good at that as a law says hosts safe for boys that come from that by financial but ... says ... go in the sense of the film and\nDavid ... sounds like an elite athlete driving himself constantly to achieve his personal best\nWhat if you have the insecure that you'd have sometimes that can mean complacent and I think his whole market people like this that they are quite worried about becoming complacent because they tend to know who the complacency quick he leads to stuff ... which leads to decline and ultimately ...\nSays David reframe security as paranoid as she tries to complacency and certainly a relentless strive to excel at least some nice family select full when recruiting\nWhere there is an effort to find people that\nThey've been reasonably restless and not easily satisfied\nUntil recently you've al ... who's a senior partner at McKinsey FM which NBA graduate soared around the world dream of joining he explains that mackenzie you're looking for traits with personal stories to tell about it\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nYou were not over this person to achieve with your chief in place but you were\nDrawn to that and believe in yourself and put the extra work against uncertainty and managed to excel I think was more interesting than someone that was maybe a piano Stuart tennis player from age three and that was always is number one all be in yeah you excelled in that\nAnd the talks to some discipline in some hard work but it would be less inspiring as evidence for Dr and overtreatment\nAs soon as I had to reach us us and blah I raised the bar against myself and I continued to invade the\nConsultant Jessica comedy if KPMG ... to ... to achieve\nLike never ever achieved and felt that I had was satisfied with what I had done and I think that there is an element of that in probably in what makes a good employee because we're always always de la ... bass\nMichelle argues these times create the ideal environment for exploiting insecure I've retrievers by combining a ton of competition with the lack of transparency\nThe reward at the end of the year depends on your evaluation in relation to these\nOther and you don't know what that producing you just know that they're super smart and that they're working super hot so\nThe standard of evaluation escalates because\nIndividuals are being pitched in competition with each other\nBecause everyone in the system is setting themselves incredibly\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThese college or is there is no designer there is no management really an investment banks the top person and an investment bank does what everyone else is doing and that is being inclined contact and pitching deals\nSo there is no power being exerted from above that up process cease being created by the individuals themselves that then tracked the individual\nIf ports of acute narrative the pumps ship structures and said that you're related to that position ...\nGerman human never felt cities despite being a ... an elected by his fellow partners to become that label CEOs\nI felt that I was there\nOnly because I had the good with off my ... as as if I was to lose it mocked position would be undermined\nShortly after being elected Jeremy hosted he's focused upon the conference\nI basically sit on stage all day two to three hundred and fifty pounds as if you'd have awesome afterwards and said what was that lot it's a very self confident he delivered yes [noise] I changed my shot five times that stay because between each session I was at ... dripping\nAnd it's still because the room was halt I cannot tell you how many you're thin or otherwise I popped in order to make my back Nazis rigid on by the end of the day I simply could not believe\nYou develop mechanisms to give an impression to people of self confidence even if you don't have it yourself\nHow does this relate as striving effect to professionals mental and physical wellbeing according to our next Michelle for the first full years most young banker can withstand the pressure by develops\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nIntensive ...\nOff the ... on a project which was more intense and that's why I'm Out as I did it come tasted dining out in a way that was detrimental to my house\nIt's not necessarily the loan I always say is the problem it the long hours on an unrelenting\nAnd sustained basis I have many many mountains yes I could not sustain the high quality of ... and I needed to take a break because I was actually not allowed to say I went to see a psychiatrist stopped whacking and I went in to the ...\nIt takes extraordinary strengths to reveal such vulnerability but what does Jessica's intensely personal story tell us about the system as a whole professional funds out is just an unfortunate but inevitable casualty of all David money\nDidn't eat those qualities of resilience and the ability to cope with stressful situations I don't think at least we couldn't figure out a way that you could avoid that\nWithout losing business it's a highly competitive world out there and at the top and they're all many people aspiring to do the ... and the source of clients that we work for half the choice of any or in the world and if you come to liberate for them at a time they wanted to live as\nAn in the manner in which they wanted to live as there are plenty of others who will see can quit T find yourself ... from your position at the top if you are too if you like trying adult for you Michael Moore lifestyle approach to how you ...\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nHave to be well and that was partly proactive but also increasingly conference are demanding that just as in the past like I've looked for\nDoctors teams and we have time to will interview junior people to find out how well they're being treated and decide whether to retain some X Y on the basis of the ... if they get in the short run the risk for a lawyer and say no to a client\nBecause that's something else that might be more important particularly when it's something else there's no work would I say it is very high but I genuinely believe that is changing\nI start shows right but the performance culture in these elite farms is exceptionally strong just listen to David money for them a ... a senior partner and Jerry ... chime in boxes investment bank\nI don't think anyone who comes into the palm and shit sending my son can be on the any illusions about the challenges that going to face and the degree of stress that going to have to deal with\nI think perhaps as a large though was so shocking to me than secure retrieve or would you do a lot of parts of Julie will move all\nListening to the program you may realize that you just felt insecure and which even care about someone who lease say here's what I've learned from my own experience the insecurity that tribes he may diminish as he succeed but it never goes away so it's important to make peace with it recognized\nVulnerability to being manipulated by your organization and by other people and then to channel you're insecure she says it works full year round isn't against\nThe newer and ... and ending report\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nTo life anybody who is suffering mentally and physically for whatever reason what I find particularly fascinating about this is that to some extent it is self imposed and that that's what I Want to try to understand what I find disturbing about this idea is that\nThe people blame themselves and don't understand the extent to which the organization is actually creating the environments and exploiting their insecurities\nI think that ... you know you're going to be extremely well paid that you all kinds of selling you so do we really want\nOur financial system our legal system out accounting system not consulting system being run by people who felt that sells for money I'm not sure they'd be making the best decision\nPolitics discovering what matters\nI'd cursed him around and I report on the environment from the NPR News college wheelbarrow somehow like elderly\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nTo its budget times even if they rejected by the European Commission its debt has already twice the euro zone limit and it wants to increase it could spark another global financial crisis the Italian prime minister today moved to calm those says\nForties early that is a shame no way to get it out to you a little over ... also took\nHe describes the killing of the Saturday Gen ... planned ... they want is the Turkish government hoping to get from Saudi Arabia justice for cash\nAnd joins ... Wisconsin two weeks before us midterm elections don't Trump still a political I sing in a state that moves and not only but significantly in his favor in the twenty sixth the lecture it's all coming out of the nice\nLife from NPR News in Washington I'm Lakshmi Singh\nNewly released surveillance video appears to show a man wearing some of the same clothes Washington Post columnist or ... G was wearing the day he was last seen all live in the Saudi conflict in Turkey\nA Turkish ruling party officials says footage of an apparent double\nIts further evidence of premeditated murder and the cover up by Saudi Arabia acclaim crown prince Mohammed bin Salman denies however over the weekend the Saudi Government conceded for the first time that ... was dead blaming it on an altercation not a hit order by member of the Saudi royal family\nWas still so many questions surrounding the journalists final moments inside of the Saudi conflict weeks ago the German government says it's a spending arms sales to Saudi Arabia and its estimate Nicholson tells us chance or uncle America list\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... started word\nIs that those responsible for his death must be held to account\nFor emitting Saudi claims that she ... she was killed in a fistfight Germany's economy minister paid ...\nA ... other ... members to follow suit and also still palms exports until more is known about what happened to him and he is among the world's leading expulsions of weapons to Saudi Arabia together with the U.S Great Depression entrance for NPR News I'm Esme Nicholson in by\nPresident Trump campaigns for Senator Ted Cruz in Houston tonight after recently declaring plans for another major tax cut for the middle class but NPR's Mara Liasson suspects just talk\nHe's just making it up as he goes along Congress doesn't in session they can vote on this but he said it's going to be major it's going to be for middle income people why because the tax cuts that they already passed or not popular Republicans thought they'd ride these the tax cut bill to victory in November but people don't buy as\nNPR's Mara Liasson will besides mid term some potential democratic candidates already eyeing the twenty twenty presidential race including Vermont Senator Bernie Sanders who's on a nine states tour Here's NPR's Asma Khalid\nBernie Sanders warn folks that if they don't vote Democrats will lose you said in the last midterm elections in twenty fourteen roughly two thirds of Americans did not vote\nFor working people say it'll lower income people so it'll be blown call us at all young people stayed oh not star but it's like the road [noise]\nSanders also saying this was done in crowd for supporting him in his twenties sixteen presidential dead and suggested he's ideas on health\nCare and the economy are more relevant than ever Sanders is one of ...\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nArtificial intelligence predictive analytics and ... loosens learn more at the three I O T dot AI\nFrom Minnesota Public radio news I'm Stephen ... a new NPR New Star Tribune Minnesota poll shows DFL US Senator Amy ... has a much stronger lead over her Republican challenger then does Democrat Tina Smith and her raise the\nPoll found ... leading Republican state representative Jim Newberger by twenty three percentage points\nSenator Smith is up six points over Republican state senator current house late with ten percent undecided late last week before the latest poll results were public ... said she believes she's running neck and neck with Smith and that her campaign has the momentum\nThis race is a cat that we have a real race people are excited to have a new voice in Washington DC to continue what is happening with cats and the economy here in Minnesota is\nHousley wins the special election for the seat Democrat Al Franken resigned from earlier this year she would immediately joined the U.S Senate Mason Dixon pollsters checked in with eight hundred likely Minnesota voters early last week the pool has a margin of error of plus or minus three point five percentage points\nThe co founder of medical device giant met traumatic has died the company says rural Bach and died yesterday at his home in Hawaii at the age of Ninety four Bach and was in electronics repairman when he developed the first wearable battery powered external pacemaker in Nineteen fifty eight\nThe production of locking pliers has returned to the southeast Nebraska town where they were invented and in ... Minnesota based medical products says production began today on its line of locking fires in the ... plant where vice scripts were made until the tools\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more [noise]\nHello and welcome to the news on live from the BBC well service in London on Rebecca can be in a moment is a new economic crisis breathing and could it stops initially Rome is squaring up to the European Commission in Brussels ... latest budget will assess the potential damage\nLater in the program we'll have the latest details on this ... murder case and our own James ... is in Wisconsin two weeks out from the mid ... he's made me think of them are affected by but not against President Trump's trade policy\nWhere they can random but right now but it needs to be done we're new ...\nI think in Milan ... was better off for\nMore on that to come but let's begin in Italy and the potential showdown with the European Commission today it said he published it proposed national budget a fairly routine occurrence\nBut as the third biggest economy in the euro zone which is already in considerable debt it's important particularly as the populace coalition government wants to boost public spending which could punch it late into yet more debt\nYour resume rules mean Brussels could reject the budget and the ... the European Commission is due to spend on Tuesday old this at a time that economists a warning that an economic crisis in Italy could seriously damage the economic health of the whole of Europe and perhaps beyond\nSpeaking to the press today the Italian prime minister ... said it needed to raise the deficit in order to stimulate dates\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more to get out of your all of the eurozone\nBut an amendment will get the view of a member of that one of the policies of the governing coalition that says why should the state and that's the kind of me let me the rest of the world yeah called cookie Dunn is a senior fellow at the Peterson Institute for international economics think tank in Washington DC\nYou have a country in ... which has a very large existing debt and doesn't because of structural features like an aging population et cetera have prospects for growing very fast in the future\nAnd a country like that or if it suddenly stopped running significantly larger deficits than had previously been agreed it is a warning signal\nAnd that is why the European authorities right now are taking a very close look indeed at these new Italian budget proposals because they are actually\nMaking it clear that this government wants to run a deficit that's about one and a half percentage points larger than the previous government\nIsn't it puts them flash on the things that they are and what makes it ... says vulnerable to that because some saying this could be the next flash points to the next global economic crisis\nSomebody's of the signs it's a little bit like what we saw a earlier in the euro crisis if you get to the point where investors are no longer willing to buy any Italian debt that they basically believed that the Italian government financed\nIn the south including in Worthington words sixty four degrees this hour a Lowe's tonight twenties too low thirties pretty typical ladder October whether sixty one in the twin cities and last jak\n\n[noise] this is your bank it can be with me that I live from the BBC\nAnd migrants convoy of thousands of people including children mainly from hunter as it continues to travel up three Central America heading towards the Mexican border\nToday in a tweet President Trump threatened to cut aid to countries that failed to stop the migrants reaching the U.S southern border you'll save claimed that criminals and I'm known Middle East and his his LEDs I'm mixed up with the migrants\nOver the weekend the counter them set up camp in the Mexican city of ... on North America correspondent and Lima peru is traveling with those ... and he sent this report [noise]\nOr appears\nTo be a little that can stop this cone voyage migrants it started in a town in eastern Honduras and people in that thousands strict west across the country and then across quite a mother to the gate from Guatemala and Mexico shut they were stuck on the bridge between the two countries\nBecause anyone who thought that'd be the end of the story was wrong\nSome did decide to turn back what most climate on to operate to white enterprise in Guatemala to cross the river the ...\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nIt's been demanded the Mexico stops the microbes we work with the ... miles inside Mexico totally understand\nBut we don't\nNeed cars and buses run of the migrants as we can smoke started milking many days ago one stop here [noise]\nWe all know hundreds of miles from home after having left home during his eight days ago they marched full day again today\nOn the night they rest in a square in the town stuff with\n\nThe Mexicans came out to give the migrants food and water and how about calling clear the journey is starting to take its toll on many like kind of things in the late forties and traveling alone\nBut she said let me think that when the when the can down sometimes it's\nDifficult when you come without family members or friends I'm so tired my feeder blistered and in pain my whole body hurt and when I sit to arrest have to tell myself to keep going for yeah\nSo what is it that keeps people going many tell us the main driving force just to put food in their mouth\nAnd throat when\nTrump says with criminals but that's not true says twenty five year old I was like you want to work for the future of our families we want to leave the crime in Honduras were risking pool to do that it's a big sacrifice but we really have no choice\nSomebody I don't know something about the animals [noise]\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\n... than the square is just how many children have made this fall sick adventurous journey across the river the boarded what Marla Mexico remains journalists and her young daughter has a lot of our\nChildren have suffered so much on this trip so God overboard them for their sacrifices we are doing this off for them and their future [noise] the jobs we have an interest are worthless [noise] we kill ourselves working nonstop and make nothing\nMedics in Mexico a treat to more the general it's due to sue became ill and the journey missed town square many of us are getting help from volunteers medical workers to\nFill need pool to Strunk can muster if they really are against the odds to get to the U.S many hundreds of miles away during the Trump has promised that will remain firmly shock to everyone here [noise]\nAnd lean bull with that report from Mexico so let's pick up on that point to President Trump's threat to cut aid to Central American countries that fail to stop the migrant convoy\nHis administration has already reduced funding to those countries louder ... is with the into American ... think tank she explained the current situation\nTwenty Seventeen to twenty Eighteen the funding has already been caught substantially for example in this specific case of an door as is it dropped from Ninety five to sixty seven million the other thing is that this funding is usually focused on attacking them why do we know are the root causes of this\nProgramming is supported by YWCA Minneapolis bringing your community together to move forward with it's time to talk forums on race on October twenty fifth you can visit wind WC A. M. P. L. S. dot or to learn more\nProjects so it is kind of counterintuitive to try to caught you know the funds that I'd actually focused on what is the root causes of this\nSo you know saying that if those governments receive age in the United states did more reason for people to prosper and their own country\nThat is actually what has been happening the cooperation from the United states to this country's have more and more focused precisely in this type of initiative that type to strengthen the country's\nUh it's not like now it's got to happen and and some of this project's actually show advancement in this topics specifically so yes these are the things that we know that have worked and that it starts as I mean this is a long process\nBut that are starting to work and caught in it or does not help but\nSaid President Trump's supporters would say that that aid has been wasted because it hasn't gotten rid of the problem corruption still rice across ... countries\nThe power of the criminal gangs is gripping city senses and towns around the whole region and this age issue as opposed to them as pets the moon you give them all the countries need where does it end\nFirst of all I think the problem is that if you pretend to try to solve a problem\nIs very long time and a very short term it's very complicated we're talking about countries that\nYears ago were at war the democracies are starting even view and I'm not saying that I agree with this but there's a lot of people that actually could responsibility of the current situation on us and us intervention I Do end as wars and afterwards I Do believe that this project how old so this is a slow process but\nThis is the one process that works if you say well we're we're not close the border are we going to stop age\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOr to learn more about it\nIf you're gonna you know accept them as refugees and try to establish camp center that it has to port in order to those is because without support it is very limited what those governments can do and what shape that takes is definitely going to be very political and that is the other thing right the rhetoric and the elections being so close\nAlso make this a little bit more complicated this is not a problem of today this carbon is not the first cabin but definitely put in tension and more pressure because of its disability\nWhat other options on the ... the United states to try to stop so many illegal migrants coming through\nI think a lot has to do with the conditions in the countries and promoting migration that is documented and that is legal the other thing is that we do see lower numbers of immigration there are more immigrants crossing and everything but it's in much lower numbers that it was five years ago and it specifically for Mexico you see that a lot\nDefinitely what needs to be done his support this concrete and the other thing that needs to be done is promoting migration that it's orderly\nThat document that that is that it that is checked because the other part of the migration he's the man\nAnd a real factor is that the U.S unemployment is fund or what it has been in decades and there is any mind for this labor\nUp ... wins the into American ... in Washington DC and we'll be heading line to the\nUs in a few minutes sent to Iran's James comer ...\nDistribution of the b._b._c. news or the U.S has supported by home advisor measuring homeowners were home improvement professions variety of projects for repairs to remodel ... reviews and book report was homeless\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nIs you get throughout your day be filling the gaps between the dates most important stories you can hear the bigger picture listen to all things considered every afternoon from NPR News [noise]\nWar the hunting some farmers but on a trade deal that should help\nOthers and the ... campaign weapons event in Milwaukee suburb he talks about the Trump administration's recent trade agreement the UN and CIA\nWhich is given Wisconsin's dairy farmers access to the previous the Clintons Canadian market he told me that's why I don't know Trump's campaign rally later this week will be in a traditional swing district in Wisconsin but in a rural part of the states where the president is popular\nPart of the reason why we asked them to come to also I was I Want her little part of the state uh were dairy farmers protect for what he did a good deal with Canada\nCan I ask you what wild things took place do you think you're telling this story you'll economic stories the good news story why things still so close\nTo the Confederate States in many ways it's kind of like ... you got urban areas you got rural areas suburban areas and the other challenge we have\nHistorical or you look when ... when Bill Clinton was President George W. Bush President when rock along with President Donald Trump is president anytime or the party in the White House is up in the mid term it's always a challenge all across the nation protect player in the states\nYou are you hungry I haven't got a\nOf the president to his on palatable to many voters make it harder than usual for the Republicans roadside\nProgramming and supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty six you can visit why W C. A. M. P. L. S. dot org to learn more\nThe U.S Congress is not ... next month both currently in Republican hands and like governor ... says that means the headwinds are against his policy that he sees the president's notice an accent but there's a liability\nIn Wisconsin we have our largest majority in the legislature since Nineteen fifty seven\nUh we have the highest number of legislature is controlled by the Republican Party seems to Nineteen twenties so we are really at the high water mark and an awful lot of ways so of course when you have a president who is controversial who is opinionated and people are fascinated about him is going to probably result in some give back\nAll our high watermark it's really because of the person in many ways that people identify with the Republican Party\nI'm fascinated by your arms I thought I was gonna have to drag the announcer view that President Trump could be a big problem for the policies but\nYour friends about it yeah it's very it's it's the truth\n[laughter]\nSo night called the big governor's debate and none of the big Senate debate here in Wisconsin time's up as a big crowd out [noise]\nBut I don't care for the politics in fact I'm at the Milwaukee Brewers stadium because it's a big night somebody will find a crunch game and the world series playoff the Milwaukee Brewers against the Dodgers and\nThis was a typical tailgate party you gotta sports guys here in America are faithful having barbecues drinking the local militias fair and that well some of the same thing about\nKids play catch in the car\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race why W C. A. M. P. L. S. dot org\nRepublican but I didn't vote for track and I don't like him but I think his\nHis behavior and some of the antics on especially in foreign policy it's a shame you know and I think people who are maybe more on the fence it doesn't go on and so a lot of Republicans feel that way\nThey're looking at the president in what he does and that will affect the voting for governor for Senate races it has a big impact and there's a lot of independent so I think and then that's going to have a big effect on the election\nAnd is your sense than the very people\nCaught a lot of them will vote against their will will not want to vote Republican because of the president I think so I think so\nHow do you drive yourself are you an independent vote you you're kind of Republican and what about the guy that's running the country as a matter of uh how do you feel about it you know I'll tell you exactly how I feel that him I owe him\n... his back stabbing [noise] is that where she stopped that but I think it's it is\nI think Trump is a double edged sword\nA nearby venue with to prove his game on TV we meet Milwaukee's veteran conservative commentator round Trump critic Chinese\nHe's currently crunching the stops trying to work out well not only the ... he's a home run in these midterm elections his conclusion in a polarized age is nothing less committed arm changed opposes the two parties diehard fans who are the key to success Trump will help\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a NPR less dot org\nCan turn out in general election numbers I think every different result here [noise]\n\nThe Democratic party get out in the dumps you've been told ... rupees Martin Luther king drive a birthday cake is Bruce out for a visit to one of the party's rising national stuff the African American senator\nFrom kind of on yeah I'm On a house [noise]\nBut it's a high risk that I can see a question of why can a senator from California helped candidate for what's going to win a congressional right\nWell first of all\nThe people of my state I I Am here primarily quite frankly I Believe strongly that the outcome of this election is going to be a statement about what we are in the country and\nWhat Americans think about the man who leads the country and perhaps about those who might lead it in the future I see the ...\nTwenty twenty finds out what [noise]\nElection until they're getting all their friends\nTell me in question is how many Goldwyn Wisconsin democratic senator up for reelection fooled when you said that election\nMy two years ago a lot of people as if they see this thing like I said they didn't send out to vote Democratic Party supporters to you're going to do to convince them this time it is\nAlso an issue that took a very high including the legislature making it may get people to vote for really reaching out for younger voters\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a NPR less dot org\n[noise]\nThat you can go\nFrom the Californian sending a message for his fellow African Americans in the room mountains of black people in this city voted for Barack Obama but not Hillary Clinton once again the votes could make the difference in Seventy three year old democratic activist donor is all too aware\nThat a lot different you out convincing people you want to\nMake it sound like I'm going to do you think is Kamala Harris message today may I\nFeel like I had thought but I found him guilty about history of African American people don't come up when you're not African American\nWomen do you deal with it but if [noise] if I'm going to get him and grabbed my hand and taking their voting\nYou're going to be on your will check Robin Carnahan right that's right [noise]\nDemocratic donors ... local baseball team the boroughs out she left out to the Dodgers in the end of the Democrats have little big hits his coming into town including ... bomber on friendly day\nHis name though is not on the ballot in several nervous Democrats have expressed that concern to me that for all the generic confused as a candidate for governor is it the most inspiring on the Republican side Governor Scott Walker's embrace some of Donald Trump's policies but it's part of us\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nInvesting approach that examines investment opportunities first\nHand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence and babble a European made language learning program battled teachers practical conversation and Spanish French German and other languages available in the app store or online at B. A. B. B. E. L.\nDot com stay tuned all things considered follows the b._b._c. news hour here at the top of the hour after hour three o'clock news and weather updates you're listening to Minnesota Public radio news it's now at ten minutes before", "year": "2018", "show_name": "BBC World Service", "city": "Rochester", "day": "22"}