{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nI'm Carrie Miller are you looking for a good book to read that sign up for the thread newsletter text a word book to six seven seven six seven seven and I said recommendations to your inbox once a week [noise]\nIt's been calling for instance today in Riyadh despite dozens of government and business leaders pulling out over the murder of a generalist President Trump says he's not satisfied with the Saudi responds\nI don't want to lose all of that investment that's being made in our guts [laughter] that's very important but we're getting to the bottom of it yeah\nThe U.S president also threatens to increase America's nuclear arsenal to put pressure on Russia and China all we about to see a new arms race Olson [noise]\nChina has officially opened the world's longest the bridge with fireworks but is it an engineering trying or what and spent\nOn the football to Christianity burnout that responds to questions about a rape allegation he's facing by saying that his ... is confident that's coming up on the news from\nMy from NPR News in Washington ... and the first waves of thousands of migrants mostly from three Central American nations are rising in southern Mexico apparently tried to reach the U.S border James Frederick has more from the small town of ... Mexico\nWealth from migrant caravan of kept moving\nMexico many of them are now in the town of weeks [noise] ah they walked about forty kilometers again today lots of them also got rides on the back of [noise]\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWhile President Trump is threatening to cut or reduce aid to Honduras El Salvador and Guatemala for failing to halt the migrant flow\nThe president says he wants Congress to pass another tax cut after the midterm elections as NPR's Mara Liasson reports Trump says he's looking to cut middle income taxes by about ten percent after signing a tax bill last year\nOur and see polling Republican Party polling has shown that people think the tax cut when mostly to the rich but this is\nWhat President Trump does you know he used to call this truthful hyperbole and some of his books\nYou know he's talked about liberals rioting for sanctuary cities even talked about how the arms deal to Saudi Arabia he started out saying it would produce forty thousand jobs in America now he says it will produce a million jobs he said Democrats want to give luxury cars to illegal immigrants I mean he's just improvising\nNPR's Mara Liasson speaking earlier today on here and now\nPresident Trump says he's not satisfied with the Saudi explanation for the killing of journalist Jamal ... Trump is sending his CIA director to turkey to investigate the matter may well Turkey's investigation of ... death focuses on a consulate car found in an is to double parking garage\nNPR's Peter Kenyon reports that Turkish police are waiting Saudi permission to search the vehicle\nPolice found the diplomatic vehicle in a parking garage and the ... district of Istanbul Turkish state TV is reporting that the car was parked there on October tenth\nDays after Saudi journalist ... disappeared after entering the Saudi coastal it it's not clear whether the cars connected to show you disappearance authorities are waiting for Saturday permission\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more resistant\nOn stock markets in Asia shares are lower down to ... percent in Tokyo and Hong Kong following a down day on Wall street\nThis is NPR News\nThe U.S Supreme Court says commerce secretary Wilbur Ross could not be compelled to give sworn testimony on his decision to add a citizenship question to the twenty twenty cents is\nThe ruling temporarily blocked the lower court decision in lawsuits by more than a dozen state and local governments claiming Ross improperly added the question\nThe plaintiffs argued that the move was politically motivated and that it will discourage participation in the sense is diluting political representation and funding in democratic leaning states\nThe Trump Administration is changing Affordable Care act rules to make it easier for healthy middle income Americans define less costly health insurance\nAs NPR's Alison Kodjak reports the new guidance also allow states to subsidize low quality plans that do not cover pre existing conditions\nThe new guide and said the administration may allow states to opt out of traditional Affordable Care act markets states instead could encourage insurance companies to offer health plans with fewer benefits at lower prices and for the first time people who buy those policies may be able to use government subsidies to pay for them\nUnder the SEA insurance policies have to include a standard set of benefits available to anyone at a single price the administration says it wants to offer more choices to consumers and to allow people who don't qualify for government help to be able to find and sharing\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nMake your of luxury massage chairs from Japan with Shiites you point detection and sixteen program to massage years including warning night and stretch ... retailers nationwide more dream wave chair dot com Andy any AKC foundation\n\nYou are listening to the needs to him from the b._b._c. World Service with me tonight Janelle\nWell today the day we find the land the truth about how the Saudi journalist Jamal ... was killed after entering a consulate in Istanbul three weeks ago turkey has been leaking new details for weeks the president Edwin has promised to in the coming hours he will reveal the full evidence\nThe growing international outrage at the ... and Saudi Arabia is shifting and unconvincing accounts of what happened\nHave overshadowed and investment conference dumped devils and the ... death it it begins today that dozens of government and business leaders have pulled out at the event in Riyadh President Trump told reporters that he'd spoken to the Saudi crown prince who denies he authorized to kidding\nBut that he still had doubts about ... session of offense\nRunning over your money because I have a great group of people that he writes out a great thing for people in Saudi Arabia we will know very soon we're from the ... people that do this very well they're coming back to the knights of our own\nAnd I will not emerge as soon as I Am not satisfied with what I've heard\n[noise] and the British foreign secretary Jeremy ... speaking in parliament said the kingdom had to give a more convincing explanation as to how Mr cash hope she came to die both frankly to the house\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more action ... or the economic links simply too important I'll stop this diplomatic and security correspondent junk Marcus well unlikely reaction would be to detect these revelations\nBut I think everybody is holding off\nAt a because they want to hear what the south has come up with they ... they want to hear what the Turkish government what evidence the Turkish government is going to present to the world\nAre on of course crucially they want to see what the United States does and remember it's not just President Trump that there's a player in the world is a U.S Congress\nOr which is increasingly skeptical about the Saudi military campaign in Yemen are also has a say as well and of course for turkey this is a huge opportunity a turkey is a regional rival of Saudi Arabia it sees the fates of the Muslim world and the politics in the region in very different terms\nFor those of the Saudi monarchy\nAnd in many ways a president or the one has been dealt with a very strong hand\nIn this crisis and it clearly is determined to use it to get as much leverage is he kept\nHe really does seem to have been doing that because for weeks now we've had the drip drip of tech his leaks to the media now it seems and the next twenty four hours president at a lawn is about to reveal what he calls the naked truth about the nature of mistakes cash hook gee\nI'm ... Nichols the tux through leaks ah we don't know if one of those leaks necessarily been through a but the scene has been painted of the really quite lurid and I'm sure in many cases quite disturbing details that the Turkish authorities clay\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nChristie on her and now they're noisy allegation which dates back to two thousand nine he's a sports editor downright\nNine years after leaving Manchester Cristiano Ronaldo remains as big an attraction has ever but I had if he's champions league of parents that old transferred to the phones because he's on more than just football\nAnd the first time he addressed the media about the rape allegations that he's repeatedly denied\n'em up your man this is not this ... this statement ah two weeks ago I'm Glad it's of course I'm not going to lie on the situation I'm very happy my\nLawyers they their confidence I Know of course I Am too so the most important and I enjoy the football I enjoy my life the rest I have people who take care of my life and of course the true always come in a\nIn a first physician so for um goods\nModel Kathryn my yoga claims right now they raped her to Las Vegas hotel room in two thousand nine and that she was paid a quarter of a million pounds to sign a nondisclosure agreement that you might just player initially denied the sexual assault allegation virus Instagram Faye Faye\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nWay he made his name was always going to be a big story on his woman created it five years ago he was a folded hair I was well coming on this occasion he how serious allegations hanging over him with his reputation and brand on the line [noise]\nCornell does become one of the biggest and most marketable styles they will spoiled but some of his main sponsors have expressed concern with Las Vegas police reopening their investigation into the claims you've anticipated being criticized for\nPublicly backing their records signing run out of school to get the weekend despite the controversies swirling around him as liberal site it's affecting him\nThan men now David has some other stories money's desk has been heavy fighting in a disputed Somali Region which is left more than ... people dead\nFighting in the area fest erupted in two thousand and for the ... come just after a peace deal in the ... region which is claimed by both the self declared Republic of Somaliland and Puntland an autonomous region of Somalia will Ross reports\nThe governor of the solar region Abdul Rashid Hussein says the funny thing started shortly off the door and the last day as the two rivals sub clans children to each other using heavy weapons mounted on the backs of vehicles\nLengthy peace talks between the rival factions of the do the hunting ground ended with a cease fire just ten days ago the mediator of those talks has appealed for both sides to agree to a new cease fire to end the funny thing which is Scott had hundreds of no matter how does and the livestock\nIn Northern Ireland who spent thousands of dollars of his dead NATO saving some pizzas has been sentenced to two years in prison this report\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. T. L. S. dot org to learn more\nThan ... instead shark you began to use for buying card to buy fast food but he was arrested in October twenty Seventeen when this call ... relatives raised concerns\nThe judge set the crimes were wicked on tools shockey that his actions could only be explained by complete indifference greed selfishness\nMore than a million toilet flushing systems have been recalled in the U.S after several explosions cause injuries around one point four million of the ... systems were both in the U. S. but explosions reportedly cause two dozen injuries including one person who needed foot surgery\nThey also resulted in property damage costing around seven hundred and ten thousand dollars\nThe U.S consumer product Safety Commission has told owners to stop using their systems immediately\nArchaeologists have discovered what they think he's the oldest intact ship ... Bulgaria is Black Sea coast the Greek trading vessel is believed to be nearly two and a half thousand years old it's must read this on growing benches have been extremely well preserved on the seabed about two kilometers below the surface\nAnd once again most of the United states is in the grip of lost who favor the latest mega millions drove will take place on Tuesday with a potential jak ... of one point six billion dollar is the biggest path in history [noise]\nPeople in the west of Mexico anxiously waiting for hurricane when I was expected to make landfall late on cheese steak meteorologists have ruined a storm surges high winds and heavy rain for all the news and on his post that has been following his progress that five cats creates the hurricane Fifteen Wes ...\nProgramming is supported by YWCA Minneapolis bringing the community together to Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nOf a mess outline on cheese steak expected to land on sort of choose the often you know a thing it's got maximum speed of wind of charging fifty Columbus per hour incredible\nThis will decrease slightly for when it makes landfall as expected but it's still expected to be a major hurricane a huge amount of destruction\nIs gonna be about forty five centimeters of rain some Mexican states like ... they've declared a state of alert with flash flooding wins dangerous wave school expected\nNow the U.S National Hurricane center they being oversee closely monitoring this and this storm they described as life threatening um and they've actually described it as explosive and the way it's developed because it was only a tropical storm on Saturday morning\nAnd it seemed developed into a category five hurricane and less than two days so it really is remarkable\nAnd how has this season been for hurricanes\nWell the hurricane season begins from may June goes on to around ... and ... and the U.S it has been well above the average for the number of storms and hurricanes when it is on track to be one of the strongest hurricanes to ever hit the Pacific coast of Mexico\nAnd earlier this month areas of the U.S they would they would really devastated by hurricane Michael which left twenty seven people that that was one of the most powerful to ever hit the north west of Florida\nAnd this is accumulated to make this hurricane season in the northeast Pacific possibly the west on record meteorologist they use this measurement cool to accumulate to clean energy it basically combines storms their tent stay given over a measurement of the ... activity in this area hasn't they'd come out very high\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a NPR less dot org\nHow did that as James Cook tells us that would temporarily shells this evening in Houston\nApproaching the myth points that the president said Donald Trump continues to deploy divisive political record I keep talking about his opponent in ... start to times suggesting\nThat they were just wrong but they actually were loyal to the country under threat in the future of the United states the president talks about this my couldn't ... moving up through Mexico migrants from Central America who say they're desperate for help he painted that has a grave threat to the United states\nBut here that are appealing to me that code ... ... people say they are concerned about immigration it remains the great animating production of many conservatives many supporters of Donald Trump here in Texas we're seeing an intriguing ... between\nFor the Senate and between the Republican Ted Cruz\nWho used to be public enemy number one of Donald Trump the two of them ... just the most subtle insults or even try to fix the presidential campaign\nBut it's a tough ... was praising Mr Keyes tonight there Mr to\nDoing the same likewise he appeared at this rally he's facing a Democrat and ... who is to the left of the Democratic party but polls suggest that disappears within the lead bought for early voting has already been done here and Democrats say they ought to respond to turn out so far\nIt's going to be an intriguing election President Trump is making clear\nThat he's going to take this message of painting his opponents as dangerous white talked to the votes\nJames Cook reporting and that's it from the newsroom thanks\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nForce innovation that works and Baird providing global financial resources and market expertise to clients the world over our W Baird dot com has more information\n\n[noise] healthcare is a problem that people in his district face every single day in New Jersey with fewer than three weeks until the midterms repealing Obamacare is a major issue in a hotly contested congressional race and the issue of leaving many voters on the fence and he just I have\nMushtaq pelvic full hashed tax which he touts hashtags healing\nHistorically when we go back really almost to the beginning of recorded history women were usually the community healers\nThis idea that women's role is to not check is echoed by don't Tel Aviv a wrong\nWere the ones who hops women with their reproductive health their sexual health or general health they were the ones who delivered the baby's took care of\nWomen in their older years and they took care of the whole community not just women but men and children and as we saw the advent of western medicine really starting in the Fifteen hundreds but then accelerating into the Eighteen and Nineteen hundreds\nWe saw a dramatic political and legal shift in that\nWestern medicine deliberately tried to usurp the role of women in medicine so women were prohibited from being in medical schools women were accused of witchcraft for practicing thing\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nFinancial inside somehow medical training she's a Hubble is an has knowledge about nutrition um botanical medicine she says the we can still see about history of discrimination in hospitals today in\nUs hospitals five thousand more women die a year of heart attack\nThan men and this is women who are already in the hospital for something because when we report chest pain where more likely to be dismissed as having an anxiety reaction or overreacting or it being a stress response\nIt's easy to compare men and women when it comes to heart attacks but of even says that women often suffer from illnesses dismissed simply being ... to ... ...\n... since the Eighteen hundreds many of the most common health\nConcern is that women experience ranging from guy to ...\nTo symptoms that may have to do with anxiety or depression or even things like digestive system is what we now call irritable bowel syndrome migraine headaches many of these have been chalked up to being just related to stress meaning there's nothing really wrong\nOr going on or actually talked about is if they were all in women's heads why is that this problem there are a lot of complexities and how this insidious biases actually crept into medicine one is that there\nHas been historically a great lack of research into medical symptoms and conditions that largely impact women so auto immune diseases\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAnd five different doctors to get an accurate diagnosis a so there's a dearth of research\nWomen have largely also been even excluded from pharmaceutical research so even knowing how medications work we often don't know how these are working in women\nAlso of even argues that there are a few financial incentives for pharmaceutical companies to do expensive research into food that people can simply pick up from the local green grocer\nAnd women are having it anymore and as women are not finding what they're looking for in the conventional medical model they are taking back their health if you will by taking more responsibility for themselves so many women are looking to things like\nNutrition changing their diets what supplements might be helpful what botanical medicines they can use what are some of the mind body connection is that they can explore\nThrough therapy or body work or how do we incorporate meditation and yoga\nStacked food and medicine hush tactic gluten free hash tag seats and [noise]\nThis idea of healing yourself using food was attractive to Maxine Ali\n... Instagram post for me would probably be a bowl of maybe it's me the greens maybe\nShe goes so into it that she became a wellness program taking care to post everything she at on Instagram might be some sort of seafood sprinkle on top movie some edible flower\n[laughter] and then you'd have this caption which is describing\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nKind of format of a wellness Instagram post she was inspired by an Internet celebrity I came across the\n... by a really well known wellness Blanca and she in particular had talked about how she used her diet to care itself of a chronic illness\nThey spoke to Maxine who was also suffering due to a chronic illness\nSo also just ... is a digestive disorder that really depletes the energy of the tea do all the time you can't really think\nI'd reached a point with my health or I didn't feel like the medical institution could offer me much because the medical institution treats health very much on an acute basis as ... you have a\nAn illness you get a diagnosis you get treated and then you go on your way but when you go to chronic illness like also to collect is there's no treatment models full that there's no long term plan it's just if you have a flare up here is symbol medication and then we wait until the next ... to me I didn't feel like\nThat was ever going to walk me and so I tended\nTo kind of distance myself from ...\nFrom Maxine she lived to food on her diet to answer questions which stokes who couldn't\nI started seeing for you to very much and the key to healing lap so I cut out please dairy refined sugar and meat fish all of that it was little\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nYeah it's um I mean to the diet due to the diet yes and what you're describing sounds quite dangerous the absolutely it's definitely dangerous of Eva believes that things have to change to\nProvide the best medicine and the best safety for women we really have to start understanding why first of all women are so disenfranchised you know this is not being seen not being heard not being taken seriously\nBeing dismissed being insulted being disregarded and these are all documented phenomenon\nIn the medical literature about this medical biased against women but also start to look at some of the therapies that women really want to\nAs part of their care and start to do more and better research on those\n[noise]\nIt's a strange power do so many women are flocking to these practices which were dismissed and seen as not being violent [noise] and yet some of these women seek out wellness also having that own pain and illnesses dismissed by the medical establishment in the first place [noise]\nIn some ways I find it inspiring the women uh taking things into that own\nInstead of giving up a bean seeking the healing they need and yet this can leave women vulnerable to practices which may not necessarily helps out much often [noise]\nBut maybe the power of wellness for women is less about whether a practice will die it works or not\nWomen want to look out for themselves in a holistic way day in day out rather than just turning up to adults so when there's an emergence\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more [noise]\nIf you've enjoyed this episode you may also like a program and why people ...\nAnd a program on why people like self help\nThis edition of the wife talked to was presented by may ... and it was produced by class since\nI had to say is Andrew Smith\nBack on the top deck of the bus it was time for me to wake up\n\nThere is no for the [noise]\nDiscovering what matters NPR News is a part of your community reporters across the region covering this story and cracker Minnesota Public radio news delivers Catherine Richard Rochester Brandt Williams in the forest lake college health NPR discovering what matters [noise]\n\nSix o'clock in London hello and welcome to these day on the BBC ... James ... [noise]\n... have you with us the Turkish president wretch of type or John is about to review what he says is the naked truth about the murder of them as 'cause you'll see political life to turkey for more than what it was a speech\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nLinking Hong Kong Macau into high would also made the photographer shining a light on the Afghan community past and present in one major Indian city\nPlus Ford still from nice outlet or later as well all of that after the latest world news [noise]\n\nMy from NPR News in Washington ... President Trump campaigned alongside his one time Republican rival Ted Cruz on Monday NPR's Scott Horsley reports that Cruz is facing a competitive reelection race in the traditional leave red state of Texas\nAt a campaign rally in Houston Trump offered an apologetic defensive is America First policies including pulling the U.S out of an international climate agreement and slapping steep tariffs on traditional trading partners\nAs sort of became a\nNationalist and really\nWe're not supposed to use that word you know what I'm a nationalist\nWith just two weeks till election day job is emphasizing hot button issues such as border security and the Supreme Court in a possible side of the GOP tax cut is falling flat with voters drop as recently been promising an additional tax cuts that so far little more than a slogan Scott Horsley NPR News Washington\nThe U.S Supreme Court is temporarily blocking a lower court order for commerce secretary Wilbur Ross to give sworn testimony on his decision to add a citizenship question to the twenty twenty cents as the ruling is the latest action stemming from lawsuits by more than a dozen states in ...\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nAgainst pesticides maker Monsanto is remaining in place but NPR's child Snyder report that a judge in northern California says the damage award must be greatly reduced\nThe decision by the judge in San Francisco comes in the first of hundreds of cases to come to trial liver Monsanto's round up and ranger pro weed killers in August a jury found their products cause grounds key bridge wing Johnson's cancer and awarded him two hundred and eighty nine billion dollars\nLast month a judge signaled she may consider a new trial and the punitive damages portion of the word\nAs Monsanto now owned by bears to overturn the verdict but in Monday's ruling the judge said she was compelled to honor the jury's decision several had written letters urging her to uphold their verdict\nA judge however reduce the amount of money Monsanto must pay to Johnson to Seventy eight million dollars Johnson's lawyers have until early December to accept the amount or seek a new trial trial Snyder NPR News\nLottery fever as high as the combined jackpots for two nationwide drawings now exceed two billion dollars ... millions player Tammy Donnelly says she would share her winnings\nThat many people have to donate money to be a good way to help while [noise]\nThe jackpot for Tuesday's mega millions drawing has reached one point six billion dollars this is NPR News\nCredit scores are about to get a tweak that might help those with weaker credit their eyes at court the company behind widely used psycho score says it's revising the way it determines the number the company says next year it will begin testing a new\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org\nTo learn more reports the initiative comes in wake up data privacy laws in California and Europe\nThe information technology industry council represents a who's who of Silicon Valley companies and the group has been working for months on federal privacy legislation\nSome of what they'd like to see in the law isn't a surprise that companies say for example that any legislation should include provisions that let you there's no how companies are collecting and using their personal data\nBut what wasn't expected was the suggestion that companies would be open to consumers affirmatively opting in to allow them to collect sensitive date that's a big change\nNow consumers have to affirmatively opt out which means a lot of people don't bother to do so Dina Temple Raston NPR News\nHurricane Willa has weakened slightly off Mexico's Pacific coast and is now a category for storm forecasters say well is still extremely dangerous and remains on track to make landfall on Tuesday the national Hurricane Center reports it will as maximum winds are now a hundred and fifty five miles per hour\n... Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors includes the air in Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent doubt whether that's online over the air or in a bottle more at Sierra Nevada dot com\n[noise]\nThank you very much they've gotten used to send divers had everybody welcome to say was shut ... and James ...\nThe next few minutes we'll hear about what might well be a major step in the fight against tuberculosis\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more and Twitter as well at BBC World service [noise]\nWe'd be in the morning in Turkey where president or the UN is preparing to announce information on the killing of the Saudi distant Jamal ...\nHe's expected to use his regular week his speech to expose have a gym this was killed and prevent what his government coups attempts to whitewash Saudi Arabia first Mr ... jihad left its consulate in Istanbul alive then said he died in a fist fight and now says he was killed by rote agents\nThat you go to the middle east correspondent in Turkey despite so much communication official and unofficial from turkey on this issue already what new can the president bring do you think\nI'm actually all the information to international ... was not the divers no confirmation or I'm not in our obesity are because apparently ... he didn't want to this it's all about the rest of the Saudi Arabia or by coal farming\nAnd you'll start looks or continue but now I'm In the ... changed today\n... ... and there may be pocket officially confirmed tell us the leaks and also and my my needs some need information maybe he was the architect that lives are being talked about you know I'm ... now\nAnd added apparently a details of moments in which I shall was killed but presumably that type may well come from Turkish intelligence that would reveal something working whether or not\nUh yes actually and it just talks\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\n[noise] I I'm looking at the newspaper there is a columnist could cut assembly many people think he's quite close to the presidency will reflects the presidency sinking yes he has written that\nWe cannot close this file until the crown prince Mohammed bin Salman of Saudi Arabia is blue to account and removed from his post\nNow I Would be surprised if president or the woman said that in public is that do you think what's he's thinking in prices\nAnd maybe private because you know that I'm not I'm ... good friends with Mohammed in Selma and they had been at all it seems he came to he became ...\nAnd ... you know are gone doesn't like him\nBut ah I don't think who can it can have this in public and I ... to ...\nA very late here um they throw a crown prince Mohammed income I don't think it's nice to meet that huge because ... um it it it won't be affected by ... by does on criminal act because they have done this before\nBut it's all these years that's said to her because you know ah it it said to the speech that he games in Turkey and it's always in Turkey scrap this time today it will be ... to enter the ending is\nHunch is not on the bridge but on a business here in London now are going to be honest on those people get very excited by the origins of amazed me okay ah the bridge you wouldn't be surprised mood that it's been built to withstand earthquakes and tofu says no quake prone region the strongest earthquake in the ...\nProgramming and supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\n... the poll river delta to allow ships to go through it simply six point seven kilometers with a bit actually goes under the water beneath\nTwo artificial islands so under the bridge on a well the bridge over the top then they go down into a tunnel then they come back up and they have a bit more bridge again so just to keep it all going a nicely this is one of the most densely populated regions in the world with sixty eight million people living in it\nIn the past traveling between two high in Hong Kong would take up to four hours\nThe new bridge cuts down to ... minutes is my favorite type ... fifty five kilometers long and it makes it ten kilometers longer than the channel tunnel [noise]\nUm so you got to imagine instead of the channel tunnel having a bridge not be cool you could reach the ferries across you might be able to raise the height you fool perhaps between Hong Kong Macau Tom can raise families\n[laughter] I don't watch [laughter] so er I send me a night and he didn't need it\nDifferently needed and and they're really ... the problem because the bridge was conceived in the Nineteen eighties to solve problems that that region had in the Nineteen eighties family trying it was just opening up at the time\nAnd so they were looking at trying to piece of the Chinese economy or Hong Kong was in the industrialized thing but it was sort of outsourcing gets industrialization to elsewhere and so the Chinese so well this'll be a good infrastructure project lifting these two areas together by some factories will move from one side of the bay across the other\nOr if that's already happened if you like\nThe bridge is a little bit too late\nAnd so some people complained that it's been too expensive and is trying to solve problems that they're no longer that his professor me Kim ...\nProgramming is supported by YWCA Minneapolis bringing your community together to move forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nStarted opening her door and the whole idea you know uh and the discussion was\nTo move economic activities on the eastern side of the ... to the western side you know that was the time when Hong Kong was still the centralized saying as industries\nBut all these developments have been taken over by events the whole economy like the comic structure and the power of adults has changed and transformed and so the original intention of building a bridge for\nThe decentralized session of industrial activities are ... that is not here anymore\nOr professor me coming of the Chinese University of Hong Kong but it's like you\nKnow let's do the about a classic of Indian literature it's the story about a man from a distant land Afghanistan living in Kolkata since then the comedy wallet tell his taken on a life of its own with translations in many languages as well as cinematic adaptations as well the question is\nUh we're just a story and and really begin and reality begin and where does it have a place in today's world photographer was kind of gene and has the latest exit mission exploring the Afghan community of ... and I spoke to her about that\nCompany went out with the characters the ... came about from a short story that was written by but they did not tackle an Eighteen Ninety two apparently when he was inspired while one day walking um towards his home in Kolkata he found out that there's ... there's an Afghan legends\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\nStory of identity the story of connecting back to your roots in a new fire away home\nAnd it's interesting because the story has been used throughout the years as a symbol of that connection between the two countries in between the ... the countries in the region hasn't been an Afghan\nLiving in India whenever I was asked about my identity and where I come from we would either talk about the ongoing conflict is over two decades or is it really positive story if the copyright up all along in my sort of you as a growing up in India I always saw them as a fiction\nBut um that I really wanted to discover through this photography project with his community really exist\nSo you're going to show us around let's course graves\nSo that first photograph described to me this photo graph was\nTaken during a meal that where we were invited to and what if the company by less homes and we captured it because I'm again it was that curiosity and this particular company ... eyes that the same time\nUm the jak statistician of him holding a mobile phone was what really interested as um you know it is short sort of shows the two contrasting wild because\nMost view is identified the company but as as a community who are very conservative and sort of you know I'm over another time almost from another time or not really I'm sort of ingrained into that that the recent um ways of life\nThis ... and really represents the new ... century and\nAnd so the copy what does it actually turns late as the the man or the boy from Kabul so it is\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR started word\nNeeds um that are spread across the city predominantly at the ... back in the day used to that you know for this exchange goods that was going to do to do with selling goods that nowadays I'm old a ... and ... um that\nYou know have a range of different items from tailoring too close thing to defend matching but\nI'm just looking across the room if we can walk across here that is a really interesting one the one with the food and I recognized the food from Afghanistan to my to his lots of land\nAbsolutely at me meat is essential sell um we were invited for what they called the ... which is essentially a can be in a way of eating and they've managed to really present is that culture but of course\nAnd that as soon as a photograph you see next age at you know than doing the prayers and we sat there\nProbably have not experienced it since I left Afghanistan which was\nEssentially you know everybody sharing food on ... sitting and sort of in a tipping their fingers to try and eat from the same plates and it was a very intimate environment and seeing and we really wanted to capture that\nAt space that the company ... sharing the coming in life\nIt's interesting because look looking at the picture right next to it it's a it's a group of men and it's a number of men I don't know a dozen men or something and I'm just wondering as a woman doing that project and it's mainly male subjects that you were photographing did you have any problems\nYes of course despite being from as just\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAnd while this valley the ... how did you convince them to allow you to hang on hang out because these are really intimate pictures of\nOf copy one as eating praying sitting down and talking and having conversations\nThis project was fascinating in that we spent an artist time trying to their that camaraderie that the company by nice\nUm the fact that both photographers myself ... came from Saturday similar countries the world that they currently ... and the wealth that they've been young teen and beat them down to those well it's an environment it really helped us on strike a bond with them\nThat having sat still I mean it took countless Chinese and travels to Kolkata to based on time understanding that well before we actually put them in front of the land\nMust gotten a jeep there I'm speaking to me about the exit mission of the company was and their lives in ... you're listening to you stay on the b._b._c. World Service\nDistribution of the b._b._c. World Service in the U.S is supported by home advisor matching homeowners with home improvement professionals for a variety of home projects from repairs to remodel homeowners can read reviews and book appointments online at home advisor dot com and delight private delivery audit tax\nConsulting and advisory services tailored to the needs of growing privately held companies to ... dot com slash us slash private\n[noise] [noise] health care is a problem that people in the district face every single day in New Jersey with fewer than three weeks until the midterms repealing Obamacare is a major issue\nIs when it happens all your term on yeah you're right it\nRequired them to cope with it after the quote rich or even if as usual ... that are broadly among people not being done to solve that problem to bring people together to forget the difference is that do for each\nShow on there are a number or you know that are\nSo the college in charge of well you ... to ... in the ... or\nIs it ... is it a fight over resources newer or is it a fight is it a religious fight\nContract rights like if you're not overloaded soldiers\n... many thanks for joining us the BBC's newer bringing their joining us live from Katrina\nNo majestic line bounding through the ... and there is one of the great cites a must see the tourists from around the world\nAnd in many African countries the abundance of wildlife brings into businesses and huge amounts of revenue but much of it is under threat in addition to well known problems like poaching and logging a new study has revealed the menu for confidence protected areas such as national parks of costly underfunded\nJenny ... of the University of California is a co will so if this study\nNinety percent of protected areas with lions are underfunded it's a pretty dire situation we found that these parks require between one to two billion dollars annually in order to adequately protect lands that they receive only me about three hundred and eighty million dollars annually and so that's just\nProgramming is supported by wind up you see a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit one WC A. M. P. L. S. dot org to learn more\nKlein and the pressures on protected areas become worse but\nIt's not all bad news because it's only one point two billion dollars I mean relatively us twice as much on the management of its national park system or you know that might be equivalent to a purchasing a U.S up all team like the Detroit Lions so\nFor a relatively small cost we really can't save lions and their ecosystems\nAnd secure the backbone of Africa's parks\nIn the report you make the link a but if there isn't a major increase in funding there will be a decline in the population of ... that were you focus your social norms why what's the link\nOh because lions are the top predator in the ecosystem and so their survival is linked to the entire food Web all the traffic levels below them\nSo they're basically a proxy for the overall health of the ecosystem and we know that strong resilient ecosystems benefit people directly through ecosystem benefits like clean water\nHealthy soils and so saving protected areas saving wildlife is actually saving people it's an investment in people as well\nBut more some would be to this um the funding for parks is long term problem and yet the lines were still look\nThat's a good point um lions are very resilient species generally about where now at a tipping point for their species so unless we act now there are species will continue to decline and so that's why we feel like the timing of this study is particularly\nUseful because we are at that tipping point the actions we take now will determine the future of the lion\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nSpeaking they're just gonna keep heading south when a species reaches a certain point in their population there's really just no turning back\nSo we feel like we're at the point now where there are still enough independent populations that are resilient enough and strong enough and there's enough protected areas which is what we focus on that have good populations of lions that if we invest now we're\nGoing to prevent falling off the cliff\nAnother argument you made in the report is saying there's a case for investing development funding in protecting parks now if I'm In charge of ... lots of money for the vitamin on thinking first of all health and roads and schools not better funding for talk so how'd you make that case\nRight that is because a lot of people don't associate conservation with benefits to people and so they tend to invest in human focus development like infrastructure\nEducation but really investment in parks with wildlife is investment in people because of the benefits to ecosystem on human health but also tourism so it's important to realize that the wildlife watching industry in sub Saharan Africa generates an estimated thirty four billion dollars annually prism\nMore broadly has created six million jobs so when you're investing in wildlife you really are investing and people\n... well she's my strong go pushing that case anyway this journey middle from there on the University of California\nListening to you stay on the b._b._c. World Service James called no and shiny with you this morning and just a few minutes we'll work out and buy we I mean ... proper mathematician to tell us what your odds are winning the mega millions lottery in the U.S the jackpot has swollen to one point six billion\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nThan the u._s. intends to build up its nuclear arsenal to put pressure on Russia and they don't get the bridge in the world has been officially opened by the Chinese President Xi Jinping [noise]\nNow let's get the ports bulletin when he got a lot of this morning show my Ninety One place to start to not to invest all so much against Lester Web one man stood out from the ... [noise]\n... [noise] [noise]\n[noise]\n... as the scoring and setting up two little girls will go on strike up the image of ... also came from behind\nTo be less just three one result which takes the gun is up to both in the Premier League just to point behind much of the city and ... at the top but it's all who was kept in the heart of everything and I both ... says he's been impressed with the pay its commitment\nWhich find any ... but he will do you ... the yeah\nThey are working on the yeah the younger Bush in for for for each other I Know I think the best for my for the dean and also with the with the middle of his\nSee I never know that retention ultra lights him and his current event is they hit the ball and the club mentioned the nineties\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nBut three of our ... weapons a real job and so when I was going to be tough but I think we have a chance you know ... or the way coach once I think we have a good chance to win the\nMain model and over and all those old clubs around the trade going today champion sneak match attempt to check side Victoria passing on a five run a form that gone five games without somebody in the last the last three ... huge pressure and said he will fight to tend to season around\nIn a pick up the other European jumped in the game tonight find Munich Re to Athens and not just the city ... talked on\nThe semi finals of the African champions league will be concluded later today with and go inside the men are they are going to still on the edge of a huge upset they traveled to fool the witness if they don't think she needs here\nWith a one they'll leave from the fence like a semi and those African ... Mohammed something he says victory tonight for the ongoing and with the historic\nEsperanto or one of the top three sides I Believe in in Africa after that ... they are a powerhouse their budget exceeds that of the vast vast majority of African clubs\nAnd it would be so important for and go like football because Premera would become the first and goal or tried to qualify for it captured the final which would be a huge premier again continue to trouble low and and get these improbable away results assignments when there's\nAny other African champions the semi final second like ... of Algeria is an acne of Egypt you have to end up from the fed like in tennis that the women season ending WTO event in Singapore the loving strength to play out of the age taking power\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nAnd playing in the high leather I ... with with my living as a civil and all that and go looking for the two I'm playing better next not\nAnd the weather outlook for the twin cities a sunny and cool day ahead with high temperatures in the upper forties winds from the north west will be light\nOn Tuesday night player with low temperatures nearing thirty degrees Wednesday looks mostly sunny with highs new fifty on Wednesday night partly cloudy skies becoming mostly cloudy with a twenty percent chance of rain after midnight\nAnd lose in the upper thirties Thursday on Thursday night rain is likely highs and the upper forties loose in the lower forties\nWas she a widely temperatures when Trump's too reminiscent pause most powerful men or your partner who died of a poisoned snake bite off to her lover took his life\nWas she covered states woman and scholar who's intelligence was deliberately downplayed I'm Talking about ... the last queen of the dentist either ruled Egypt and Julie was absorbed into the Roman empire\nMost famously she was the Egyptian queen you became the lover of both Julius Caesar and Mark Antony not last relationship and most lies in Shakespeare's play on Sunday and Cleopatra which is cut it off views of her at a since\nShe was the real Cleopatra when you strip by the propaganda a myth we bring together three experts to help us separate out fact from fiction so to join us for the forum on the ... off to the b._b._c. news\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOrg to learn more and believe heading towards the U.S\nAbout Honduras El Salvador that made a lot of money every year we give a bar and they did nothing for us nothing [noise] they just thought they were uh\nDo we give them the amount of money you know what it is you're covered over five hundred dollars like a lot of nothing for our\nGot the president says he's alerted border patrol and the military as he looks to make the migrants mid term election issue the president made his comments before heading to Houston for rally supporting Republican U.S senator and former campaign rival Ted Cruz\nDemocrats believe to be eyeing a twenty twenty runs for the White House or making stops in Iowa a head of the midterms to campaign for candidates on the ballot among them is California senator Kamala Harris as Iowa Public Radio's Clay Masters reports\nThe Democratic senator who gained national attention during the Supreme Court nominee hearings for justice Brett Kavanaugh is making several stops in the state that kicks off the presidential nominating process senator calmly Harris says this election requires Americans to look in the mirror and ask who are we and part of the answer she says is better than this\nThis is a moment to fight for the best of who we are and fight we will and you know I think about it anything that's we're fighting for and the fight where it's happening\nVoters Cory Booker and Bernie Sanders also considered possible contenders for the Democratic nomination and twenty twenty have also made campaign trips to Iowa this month for\nNPR News I'm Clay masters in Des Moines\nThe Supreme Court says commerce secretary\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nFor these leading up to the first potential trial over the citizenship question is expected to start in your city on November fifth a lower court had allowed the plaintiffs attorneys to question commerce secretary Wilbur Ross about his decision to add the question if a twenty twenty cents is\nThe journey are looking for evidence to prove their claim that Ross misuses authority by adding a question that Census Bureau research suggest could harm the accuracy of the information collected from the census\nSupreme Court justice Neil Gorsuch however wrote in his own opinion at allowing the probing Ross is mental process he is quote highly unusual a court order allows ... to permanently block Ross his deposition or for the Supreme Court to hear the cases on the long NPR News New York\nYou're listening to NPR News\nSaudi Arabia's foreign minister says the Saudi team is in Turkey conducting a comprehensive investigation into the death of journalists Jamal because she'll gee\nI'd El Al Jubeir telling reporters in Jakarta Tuesday that all suspects would be detained algae ... died in a rogue operation but the cause of death was unknown\nThat contradicts of public prosecutor statement that the show J died earlier this month after a fight and the sound comes to live in is tumble\nCBS chair Richard Parsons has stepped down over health related issues only weeks after taking the position as NPR's David Folkenflik reports Parsons was expected to help guide CBS after scandals and controversies\nRichard Parsons is a former chairman at Citigroup and Time Warner named to replace CBS chairman Les Moonves after multiple women accuse Moonves of sexual harassment CBS has hired outs\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nNoticed with a form of cancer and says doctors are now advising him to cut back\nThe new CBS chairman ... the head of the company that makes grand theft auto and the former president of the M. G. entertainment and twentieth Century Fox David Folkenflik NPR News New York on ... stock markets in Asia shares are lower following a down day on Wall street shares are down to point six percent in Tokyo down to ... percent in Hong Kong\nThis is NPR News in Washington\nSupport for NPR comes from the Charles Stuart my foundation supporting efforts to promote adjust equitable and sustainable society in its home town of Flint, Michigan and communities around the world more at ... dot org and that listeners who support this NPR station\n[noise]\n\nClarified drives a magic name [noise]\nA symbol of romance some love [noise]\nCrap I Try as been glorified and all they are [noise]\nBy writers from\nFolks are care to Shakespeare Shaw\nStill remains Mr\nTitle shrink [noise]\nThat was the ... truck conjured up by the Hollywood direct test has to be the mail and he's Nineteen touchy for ethics film and I wonder what image the name Cleopatra brings to you in mind the female Egyptian leader whose devastating beauty ... used some of the most powerful leaders and the Roman empire the ruthless\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThat right and so he was the historical figure of ... and how far removed just thought historical reality from the symbol passed down into popular culture on average Kendall don't today's edition of the forum from the b._b._c. World Service we're going to pick some of the most common Cleopatra Mets\nTo build a picture of the real queen of Egypt\nOne of the most powerful female rulers in the ancient world\nAnd to do this report together three experts to help us separate out fact from fiction\nThey are Christian Greco director of the ... or injection museum in Turin, Italy Joyce tells lead reader and Egyptology of the University of Manchester in the u._k. and here in Studio I'm joined by Maria white professor of Latin as University College London\nI can start by asking each of you briefly why you think the character of Cleopatra has captured the imagination of so many people across the world I never say many centuries what's her into your\nMaria [noise] when I Would say that she was a hugely powerful router over a fabulously antique kingdom and she was caught up in a room and story about seductive ... tree and death\nAnd so we tend to fall in love with her like the Romans did but also since the twentieth century we've wanted actually to catch her back from that ... story to return hub to hub status as a powerful ... what do you think Joyce\nAgree anything to do things in Egypt is off the nice thing to his anyway it's an exotic loan this vast wealth in gold\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nWoman will threats in the big leaders of rogue as just fascinated our mind so is ancient Egypt a country with more than three thousand years of history one clip out on the stage dealing with ... the new ... who conquered Timothy to reading your\nSchool will pick apart some of these different stories in a moment but first let's remind ourselves of some of the key moments in her life Joyce can I ask you briefly one was a ... sort of family would she born into\nIssue was more like Mediterranean were very dark hair in dark highs\nMaria despite all its lack of solid evidence this Raman idea of ... a great Ricci keeps cropping up again and again doesn't it across the centuries I wondered if you could give us a few examples\n[noise] yes well just to go back slightly it it is the case it quite a few of the ancient sources say she wasn't beautiful a tool will she Wallace was hugely charismatic and intelligent and in some ways\nIt's that aspect too in that capacity to cities that has been written by this focus on ... and her beauty and it's a foot because very much that belongs to the western world in large part in paintings and nutrition\nAnd we find that there's a ... because it's not perceived to be a beauty\nProgramming is supported by YWCA Minneapolis bringing their community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThe design to explore her appearance and by the time we get to the twentieth century with\nThe development of the retail industry we\nFind that it's a whole production of products that are related to Cleopatra\nAnd here we find that she's made both extraordinarily glamorous but also in a sense everyday accessible you two could have Cleopatra's power except now it's only sexual power you two could have a passion for the price of a shampoo or soap\nPummeled it was particularly good at this in the beginning of the century\nBy the time we get to the Nineteen sixties it's coal ... associated with the stock plate\nIn the sixty three film is above Taylor\nJuice through many stories about the ... she went to to maintain the supposed to be on for the most famous being our space that she pays daily and asked his milk is that any treat them is\nKnown them that we know of um we we don't know that she was in any way can send a bunch of ... looks\nBut again because we believe she's a beautiful woman we also like to believe that she had all these beauty products and this is what she occupy time with whereas infant ruling a country and how many children you know she was ... busy enough without having to do that as well\nA memory of the major ever have physical appearance as those extended as far as her race when did this become in this year and why was it seems important\nI think the written postings about this is in the struggle to reclaim Cleopatra for Egypt so the debate started decades ago I mean even in the nineteenth century a debate about ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nBut will she black\nThis much is particularly in the Nineteen nineties when woods with the rise of afro centrist them and I for centuries in positions Egypt is the point of origin unsaid Cleopatra them becomes in ... of a powerful woman at the starting point of African history\nSit claiming the ... as black with a that has any basis in history will not is it relevant claiming her as black becomes an important counter to the prejudices of gender and race and the possession of Cleopatra by the white male western wild [noise]\nOkay so that was Cleopatra beauty was about ... she's famous resort to produce Caesar with her physical appearance and chums with reference did not accept we just heard\nBut Joyce what'd you actually know about what's really took place about first meeting in on eggs Andrea who really ...\nWell we don't know the story that that we told us that she basically said types of use him but he's much older than her he's much more experience than you would imagine that if anyone was on the ... thing it's going to be at least fifty fifty\nIn fact she may be suggesting him but with all sorts of a political power with um the well is in such a legacy of Egypt in the grain and so on she has a lot to offer in that way as well\nAnd the story of her being smuggled in to see him wrote up inside the carpet and he treated not\nI'm not that we know of no it's very dramatic and is this was the thing looks great team fills in Salem but I'm sure that they know that you're still on the other hand it does seem that she did have to go quite sensitive surreptitiously into ...\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org [noise]\nThe bomb she sat in like a ... on the water the\nPoop was beaten go\nUp all the sales and so but few of the winds will love sick with the [noise]\nThe laws were silver which to the tune of flutes kept Trump I made the water which they beat to follow faster as amorous of that's drugs for her own person\nIt back to the old description [laughter]\nShe did lie in half a billion cloth or go to just you or picturing that Venus while we see the fancy app Web nature on each side to still pretty simple boys\nLike smiling cupid with diverse colored fans whose when it seemed to close the delicate cheeks which they did cool and what they did did [noise]\n\nChristian there are many other examples of ... pushing on extravagant displays of how wealth including many some shifts banquets and she seems to have been harshly judged today's my rabbit historians but how typical do you think the style of living was for an Egyptian queen\nOf course Roman historians to try to blame her as a woman will try to brewing Roman customers I'm bringing ... way of living\nBut actually being a higher ranking person in a row person within Egyptian society should would present herself to her people you know most some to us and the courageous way possible we see in many museums all around the world\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\n... religions the king is a kind of made you to between goats and people that's why he has to be have according to such a cost them and Cleopatra simply was behaving according to the tradition of her country\nA Jewish there's a story isn't she dissolved one of her post in wind is posted at that very famous story to this actually happened\nYes there is a story that she also gets ... the most expensive unquote in the world and she took on her earring and diesel to unwind and drunk catch you know visit that was the most expensive thing you could possibly drink\nActually it didn't happen because it's not possible to take a pill leaving and put it into wind into how they resolve nothing less than wind is really really strong I knew I wouldn't do you any good to drink it\nIt's a story that seems to be device to to disparage Harry again to make a Paris issues not prudent and not in any way like a Roman woman who wouldn't it have light not it's a woman who is sexually ... tend to go around the men away from reading the women\nHere's ... again Cleopatra was of insatiable passion insatiable avarice\nShe was swayed often by laudable ambition\nBut often by over weaning front to re by love she gained the title of queen of the Egyptians when she hoped by the same means do we know so that the queen of the Romans she failed at this time last week\nBesides Maria by late hunted critique ... often\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nMen and funny enough I'm as a drunk that particularly keen on ... being a Trump because in Redmond will drunkenness was a sign of profound female on control\n[noise] well we need to take a short break for the latest BBC News but we'll be back in a few minutes to unpack moments about hip hop try to stay with us\nDistribution of the b._b._c. World Service in the U.S has made possible by American public media with support from fidelity investments sticking a personalized approach to helping clients group preserve and manage their wealth learn more at fidelity dot com slash wealth fidelity brokerage services L L C\nAnd by the three ... T addressing the world's most challenging problem so it's a convergence of artificial intelligence audio tea and elastic cloud computing more at sea three ... a a\nHealth care is a problem that people in this district face every single day in New Jersey with fewer than three weeks until the midterms repealing\nAnd in contrast to the earlier Raymond chronic ... medieval Islamic sources portrayed on top of linguistic achievements ... she was schooler Joyce what qualities did ask griped\nWell they see that many different plant conscious of the one that we say it doesn't mean that they necessarily and highly correcting everything they tell us but it's interesting for us to read some descriptions of Cleopatra which just doesn't go in the same west in way that we used to they see has somebody his stage she's a philosopher she enjoys can you\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAs a woman who was Iraq take on the real sick and who was illogical we see this very logical ... yeah\nAnd how accurate do you think there's much being who was this ...\nI think if we look at what time to Egypt when she was ... when she was left alone when she wasn't cool to think right drawn then we can see the London when her father died was greatly ... to Rhode Island was suffering with years of low not levels in some in and so on\nPulled itself together so that by the end of the ... she was able to find on ... ... ... ... she functioned extremely well\nAnd was about ... ... is an international petition the state swimming he's\nA remnant from mine could which is Nineteen sixty three film care pot trick where she's presented as a woman of global ambition imploring seasons to take inspiration from his cheered the empire building come on to attacks on to the great\n... Penn\nNot a one world one nation [noise]\nWhen people are living in the\nEarly ... last what it is you wanted me\nTo enter the gathering and this one would when people when they\nHad eggs on reality shows that I Am ... he was not an all white people\nThe voices of to the film's famous stars Elizabeth Taylor directs her some Maria what do we know about care packages on missions that Egypt on the wider world\nWhen I should say that the kid uh\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nBeing originally but it certainly seems that\nA concern of given the history of Egypt to that um we we've been hearing about today a concern was how to keep Egypt safe in the context of rooms domination of the Mediterranean she had to find some way or forming a safe alliance with room for the benefit to the people\nAnd what makes it so interesting is that she seems to have done this note these through the production of her children and I was I was mentioning earlier\nOn this production of children would suggest quite an ambition for care Petra because no Tony the she preaches Tony sees a\nTo Z had children with Antony she cools won the son the other the mood she calls one of her children by the name of Alexander she really does as as the film itself suggest have some ambitions that took coop tucked in the memory of Alexander the great and those would be ambitions about\nThe role of Egypt as peacemaker in the Mediterranean\nWell we're getting to be under the ground but before we wrap up it's just one final myth that we should really clear up ... chosen death by snake bite\n[noise]\nIs sad that they asked was brought with those things and leaves and lay beneath them\nFor the U.S Korea ... given orders that the reptile my fasten itself upon her body without her being aware of it [noise] but the truth of the matter no one knows where it was also said that she carried about poison\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nAs we discussed at the beginning of the ... by ... bc e clear ... and his forces had been defeated by his rival Octavian Anthony had taken his life but what do we actually know about ... the final days and ours how much of its historical embellishment\nAs far as we can tell cliff participants have final dies and now is trying to negotiate with Octavian to some light either I to the situation not necessarily for her but for her children and she makes ... office and Balkans if a children's ... she'll do this after the the and he's not having any event\nSo the official story is that she killed herself\nThe classical sits on quite sure how she does this but it suggested that she's done it my snake bite and this this story really takes a whole so that pretty soon after her death it's accepted that this is how she killed herself\nThe snake makes a very appropriate depth wet them for queen of Egypt because clean so very strongly associated with nights and I say the called if ISIS is also associated with snakes so it seems very appropriate\nBut in ... seems quite unlikely because to have the snake smuggled in ... and then to how they might do ... do it's to say the least it's a very ... and such a method of death\nMaria say much has made this suppose romantic I'm tragic and care ... isn't that in major tax like Shakespeare but what do you think it was any suicidal marriage is really about the loss of her lover whether considerations more political\nI think the Romans certainly see it as an act of suffering and grief over the death of Anthony in their view so much as an act of pride an attempt to\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nWhatever weight was done you could imagine that a queen said gifted with the power of self representation would've ensured that she died in a way that matched huh authority as a route to all of the great for only ...\nThroughout the program we've traced a complex tangled mess sending management pure fiction later over the historical facts see Christian I Wonder you spend a lot of time in Egypt and I believe you just come back from that do you think there's any chance we'll never discover more conclusive facts about care Pasha whoever we destined to keep wondering about the truth\nWill think research an archaeological research and particularly will go on we will keep on reading tax to try to interpret tax and trying to find archaeological evidence\nThere are very important an ongoing ask ... going on you know like ... parts of which has been submerged by the Mediterranean so dry there's gotta be going on off the coast in order to find out all the monuments\nIn recent years time and again our colleges have announced that said well we're just about to find all the have found that to all the ... and and to me well that's not true of the research still goes on but one should warm the\nWhat are we looking at a with thinking that can help attract an end to me are buried in the same too is that likely would include ... as a real Egyptian queen\nWe might also be lucky in finding some new education factual evidence which could help us in explaining what really happened in the last\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nSigns of Egypt I don't think we can leave that to us because there's so much Cleopatra information's delight that people are still absolutely fascinated by huh\nI think what we need to do to keep looking and joined find the truth of the story because she's an inspiring woman she's a woman who manages to rule Egypt Sunday successfully for quite a long time most successfully than any of the immediate members of family on the truth deserve to be known they might take as many many years to work out well not treat says but it certainly was looking for in\nA final thought from you Maria\n[noise] what I Would say one of the things we can do in the absence of finding any okay logical material lovely though that would be on the tombs particularly one of the things we can do and in fact we're doing it today is to take a pause nine allies miss that have been created around\nSo for example in in the post Christian world this death by snake business\nWas often actually associated with the figure of IV\nSo when you see a painting of Cleopatra we'd has snake then starts to look like the appropriate punishment of a woman who has seduced and humiliated him on\nAnd so what we can do with that so to material what we can do with him this is take them apart she has been voided all political authority in the history and if we understand prejudices of gender and race we can get for that authority back\nAnd lose in the upper thirties Thursday on Thursday night rain is likely highs and the upper forties lose in the lower forties\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org [noise]\nAnd I knew and care each week we recommend great new movie to see in the theater and those did skiff we also this movie screen at home it's only you can podcast twice a week on the bike you usually\nFind that ...\nThat in the meantime the so called dabble so the debt says investment for him stop today is the Saudi Government host business leaders from around the world has its economic get together will speak the Arab world to find out who's turned up and what this means for future business with the kingdom\nPlus scientist report a breakthrough in the fight against one of the world's most deadly diseases tuberculosis\n... another good night off ... off the ... list his team to oppose eight to ten ... ah with most sports news today I'm get business Hampshire including on a big breach in China that's coming out of this but it's been like this will be [noise]\n\nLines from NPR News in Washington ... Stevens the first wave of thousands of mostly Central American migrants who are running in southern Mexico apparently trying to reach the U.S James Frederick has more from the small town of ... Mexico\nWell the migrant caravan has kept moving\nMexico many of them are now in a town of weeks [noise] ah they walked about forty kilometers lots of them also got rides on the back of trailers or trucks\nOf it there are thousands here in the central square of this little town uh American January north\nThey're also people further south\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAs he wants to middle income tax cuts by an additional ten percent he says he expects Congress to take up the issue after next month's midterm elections critics of the tax bill that took effect in January said benefitted corporations and the very rich\nPresident emphasized that his tax cuts the strong economy and the federal hurricane response during last night at a rally in Houston to benefit incumbent US Senator Ted Cruz\nSomeone left an explosive device at the Westchester county New York home of billionaire George Soros on Monday as NPR's Emily Sullivan reports the FBI is investigating\nPolice say an employee of the house called nine one one after they received a suspicious package and placed it in a wooded area\nState and federal authorities responded to the scene a bomb squad was able to proactively detonate the device\nThat case has been handed to the joint terrorism task force of the FBI Soros a survivor of Nazi Germany occupied Hungary made a fortune of tens of billions of dollars running a hedge fund\nNow fulltime philanthropists he frequently donates to democratic candidates and progressive causes ... has made him a favorite target to anti Semitic smears and right wing groups\nSullivan NPR News\nLeave US military confirms that an American general was wounded in Afghanistan last week NPR's Tom Bowman reports\nThursday brigadier general Jeffrey smiley was meeting with senior American and Afghan officials just before the meeting broke up an Afghan guards suddenly turned his weapon and those president regard ... police chief for spring the room with bullets smiley was her twice in his loom sort of credit going source it as being treated at a military hospital in Afghanistan\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nTom Bowman NPR News Washington this is NPR News\nAgenda in San Francisco is up how the jury's verdict that Monsanto's weed killer roundup contributed to a school grounds keepers terminal cancer but superior court judge Suzanne Delano was reduced the punitive damage award from two hundred eighty nine million dollars to Seventy eight million\nLatinos also denied requests for a new trial Monsanto was acquired earlier this year by German based there\nWhich says that decades of scientific studies in real world use show the active ingredient in round up the safe for humans\nI boil water noticed is in effect in Austin, Texas because the city's lakes are filled with sediment following severe flooding get details from NPR's Wade Goodwyn\nAustin's water is simply too dirty for the water treatment plants to cope with\nTo drink it must be boiled for at least three minutes about a million customers are affected dishes could be Washington's over the water but must be register with boiled or bottled water schools are covering their drinking fountains and cafeterias are coping by being creative\nThe University of Texas and said Edwards students faculty and staff\nMust also he the notice as do thousands of restaurants and fast food joints testing has revealed no biological contamination of the water yet often water says the boil water mandate will last one to two days probably Wade Goodwyn NPR News\nNetwork says it plans to borrow another two billion dollars to help fund the original programming that's drawn millions of new subscribers video streaming service says it plans to spend eight billion dollars on content\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nOr Mac bound dot org and the listeners who support this NPR station\n[noise]\nMany thanks for the news hello and welcome to stay which tapes called on China Neal\nAbout everybody in the next half hour here about possible breakthrough in the battle to overcome tuberculosis crunched the numbers to work out your chances of winning over a billion dollars and the biggest ever lost reject put in the U.S and don't worry we go to a proper mathematician today to some people on our website to BBC was service don't come forward slash used [noise]\nStart in Turkey where president ... type or do you want is preparing to announce information on the killing of the Saudi dissident ... he's expected to use a meeting of his a Cape political party to expose how the journalist was killed and prevent what his government calls attempts to whitewash\nSaudi Arabia first claimed to somehow choked jihad left the consulate alive then said he had died in a fistfight and now says he was killed by rogue agents\nI spoke earlier to the BBC's mark low low and I began by asking whether Mr Ed wants decision to have his speech today translated ... an Arabic and English was a common one\nNot usual and I think it's a sign China that presents headlong clearly wants to direct the speech um at President Trump at the White House um to put pressure on Washington to\nTo harden its tone to one talk and talk on the line toward Saudi Arabia and also of course to ah the Saudi kingdom as well or to to put the pressure on the Saudis to come clean on what took you believe was premeditated murder state sanctioned matter of\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nTo Jamal ... uh the Turkish government believes that this was a planned mud or savagely panned as a as his government says and uh we expect a much more incriminating materials and the Saudis have or I'd have admitted to in the last few days\nI mean the difficulty with the story of course is the fact that essentially it's kind of it but the truth is stuck between two versions of two countries with their own agenda and you also have very different definitions of the truth plus of course as you say the changing Saudi story [noise]\nYeah and and I think when you talk about those two different competing narratives of two players and the ... that raised in order faces a regional power pie between turkey and Saudi Arabia president had one seat is seizing an opportunity here to direct um his his on uh\nAt the Saudi crown prince Mohammed bin Salman who ... who is a regional rival or who has to has formed a front against the Islamists in the in the middle east including techie at the governing party hit but also Qatar which is techies closest\nI'm a closest ally in the region so I think president that are clearly trying to cops and B. S. as he's known mama been so I'm On the crown prince down to size a turkey has described that influential combinations have described him as an enemy of turkey and I think what President at ... really is an action\nTaken to try to sideline the crown prince the problem for techie is that so far it seems that NBS is going nowhere and\nIn fact uh the king's home out of Saudi Arabia simply announced in the last few days but that would be a restructuring of the Saudi intelligence agency and that will be put under the aegis of guess who found ... Mohammed bin\nDina hospital the CIA the U. S.\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThis morning after his impressive display for ... last night he schooled and set up two goals\nFor ... and make a ... they'd be less to three one and now two points of the top of the table and it's ten consecutive wins for the gun is an old competitions also coach and I am remade as captain for the night and commended him for his commitment\nIn the European champion the ... the return of Christianity or another to Manchester United in group age is one of the fixtures of the night ... de Augusta could become the first and goal in cup treats the fun of the African champions league\nThey take one lead into the second leg of the semi final away to a ... inch news yeah Egypt I actually aren't on the city of Algeria leading to nail\nIn basketball the brawn James is still waiting for his fast way not the LA Lakers after they fail to one hundred and forty three points to one hundred and forty to defeat to San Antonio ... says that's not three defeats from three at the start of this record a season and that sort of sport\nMish many thanks we say it in unison [laughter] now China is officially\nOpened the longest see bridge in the world it's fifty five could almost alone and links uh Hong Kong Macau to the Chinese mainland fill it is all our business is a guy like travel or Asia imagine\nIs going to cut troubled times between uh the different regions from four hours to around for a few minutes the bridge which is designed to withstand earthquakes and talked looms\nWas built with four hundred thousand tons of steel enough to build around sixty four towers about sixty kilometers of its total linked crosses over the seat of the ... river delta when someone\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nSixty eight million people another fifty votes to them as long as ... percent longer than the trouble Tom ... very impressive but as it needed\nThe problem here is the definition of the wood needed he said ... the issue in very very carefully the bridge was conceived in the Nineteen eighties ... so some serious problems that China had then as\nIt was looking to open up its calling me I'm looking to integrate Hong Kong while allowing Hong Kong to the industrialized on to explore the factories that it was losing across the mainland\nThe unfortunate problem is because it's now twenty Eighteen and most of those issues on really issues anymore he's professor meet ... ... from the Chinese University of Hong Kong who's been telling us exactly why the opening of the bridges not trying to reach is by everybody\nThe idea of the project has been around for a long time\nWhen it was such a raced uh that was that in the Nineteen eighties when China just started opening her door\nAnd the whole idea you know I and the discussion was to move economic activities on the eastern side of the ... to the western side you know that was the time when ... still\nThe central rising as industries\nThat all these developments has been taken over by events the whole economy like they ... and the parents had doubts has changed and transformed and so the original intention of building a bridge for\nThat the centralized fashion of industrial activities at that that is not here anymore\nNow Wal Mart clippers are actually playing James you want me to ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more all\nThe H ... them be a which is a bridge tunnel system is is like an ... memory loss radicals straight off the tongue that one I'm sure they'll they eventually like you're ...\nYou're listening to you stay on the b._b._c. World Service almost goodbye for me and James Julian Marshall joins us in the city to tell us what's coming up on world update great to see it first of all\nThank you very much good morning but then the next hour of course we're expecting the Texas president or an ... describing is the naked truth about the killing of the Saudi journalist Jim ... G\nA Donald Trump is willing to the U.S may increase its nuclear off and on the one of the world's oldest intact shipwrecks compete but most mothers and rubbing benches has been found at the bottom of the black sea it's more than two thousand four hundred years old and it's incredibly will present\nAre we going to be speaking to one of the marine archeologists who discovered it that's coming up we'll update on the list not for Julian main thanks [noise]\n\nBad you're listening to us in the U.S as a possibility that he might have popped out to buy a mega millions lottery tickets to begin with a chance of winning a record breaking one point six billion dollar check pulled but we'll see also winning\nA little area I spoke to do to lose left and the statistician with Georgia Tech school mathematics to find out why you would have to be very very lucky\nMega millions is a ... a lottery that crosses most of the United states or is about I think maybe four states that are not included so it's really almost like a national lottery in the u._s.\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nAnd assuming no one else chooses the same number and the winners will get their share after taxes or a\n... I'm going to go out on a limb here and suggest that if I buy one ticket miles on winning up Chris Eli\nThat's correct in fact your odds of winning or I'm exactly one and three hundred and about one in three hundred and two million and that's true no matter what the jackpot sizes\nBut win the jackpot size gets large then more people buy because they they're just imagining themselves those billionaire so\nEven if my one in three hundred million short comes off that possibly others who will be sharing it with me 'cause most people have signed up for a ticket\nThat's correct I Believe the the lottery commission has said that they expect Seventy five percent of all possible combinations to be purchased by tomorrow so there's a pretty good chance that someone's going to win\nSo deals on me winning a pretty ... 'cause I'm not in the U.S but the old some someone winning considerably better\nI think it's pretty likely someone will win without or or possibly many people will when depending on how the how the numbers law\nWould it technically be possible\nTo by so many tickets that you would guarantee you self victory\nIn principle you could buy all possible combinations but in practice it's impossible there are\nThree hundred million combinations and the tickets cost two dollars each so if you had six hundred million dollars that's the first obstacle [laughter] and then uh you wouldn't be may be willing to invest\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nLogistics of buying that many tickets I'm going to be easy\n... absolutely not or if you do a back of the envelope kind of calculation or you will find that\nEven if you have somebody going out of all possible numbers in a certain range about one ticket every ten seconds you might be one person might be able to fill out about ten thousand tickets between now and win the lottery is drawn but you need to\nFill up three hundred million so you're going to need to hire a thirty thousand people and that is that old gonna want to share with my ... greedy I Would imagine that they're all going to expect a share maybe they could do a little uh you know if you get the the winning tickets like a heartland the chocolate factory you might be the one who gets it\nIn ... I'm probably not going to win this last round my\nI I Would say that's the safest bet I know and in fact I Would say that no one listening to this program is likely to win the lottery I Know the BBC has lots of listeners\nBut I'm going to go out on a limb if you're listening to this program and you win the lottery called me up and\nProving I'm wrong you know what color south and print calling us up and she had the money that's what I was thinking you know exactly because you know\nOne point six billion dollars to get a little bit I've rebellion thing he said it will be a threat is [laughter] not at my he says he's actually gonna buy a ticket say you know specifically thinks has no chance but he's not feelings advice not maybe there is he said to us at the\n\nDistribution of the b._b._c. World Service in the usa supported by Donald a meal prep service\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nRice University unconventional wisdom more at rice dot edu slash future\n[noise] [noise] healthcare is a problem that people in the district face every single day in New Jersey with fewer than three weeks until the midterms repealing Obamacare\nLet that person will stop or to take an artist and I think for me Aurora and Katie could not be more different [laughter] thing you\nDo want to put your personal ... that that's what they were just wanted to do so you can recognize easy that isn't king of the product\nNo and and and it's it's funny because I was a real fashion about five years ago where all these ... started putting names on projects and I always felt really uncomfortable about that which probably was\nNot really [laughter] the best thing to do for my career but I just felt like oh this is not a passionate about us and that this is an estimate for the artist if anything suit\nCan would you say that the Coleman seem is about how women want to come across these videos about you're listening to how they want to be perceived\nWell absolutely you know when you're working with an artist you're thinking about festival what does it mean to them what is it about you know also you walk away and you listen to the tracking me Steve how you interpret it because sometimes it really opened her interpretation you know I don't always have to\nFall or the lyrics meanings I can walk away and come up something completely different but you know if that has something to say that they want\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nLike I just like still frames and then I just have to read those things together and sometimes it takes me\nA long time I got to you know play the song when I'm brushing my teams that played when I'm cooking when I'm drinking some wine\nBecause the thing I'm trying to the way from is\nThinking about the idea is never watch for me I don't\nThink about the idea and then she would come to me in ways and you can come when I'm seeking and that's why we have looked at when I'm speaking with a pen I just get up and I write it all down 'cause I Know I'm going to forget as soon as I get up and I try to make it as a visual as possible in words and then I sent it to them and hundreds if another hundred\nThe article I Love that idea [laughter]\nReally a hundred percent I I don't know I didn't I didn't believe I I I Do have to say that's that's what it is I shouldn't have been talking about it and\nYou know and then of course I think at some point there's a level of trust that has come in in in my career boosts of presidents of course he gets to a point I was like OK me say this is what we need to do in my truck that this is what we need to do I because somebody quit deposit I'm a business person\nSecond to last quick question but we're not pitching arm cutting that idea very passionate about it I can see I can taste it I can feel it I Do everything from the when you look at the dress you're going to wed the props he's actually the entire vision is what you just have to show up and you'll boxes\n[laughter] you know maybe I can go and\nGimme talks about repeat to listening to the ... over and over again she's brushing my teeth and just drinking wine with it\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nExhaust the listening practice until you just can't you only is it ... you know you almost like yeah you don't even hear the lyrics anymore you just feel it [noise]\nSometimes it's good to just sit with that you know if you can't the problem is sometimes you get a track and I like can you get a treatment by the end of the week and it's like a Wednesday and friday you know so\nThat's kind of tricky and I think for me personally I don't know if it's because I might be in like a slightly bigger market well maybe I'm just not as popular with director Comey but\nYou know occasionally I Do get out of that come to me directly\nBut more often than not I am actually pitching against other directors\nSo that's a little tricky because sometimes an artist cannot talk to study directors or twenty directors have many imaging who knows\nI recently pitched on the cot as a ... and Jay Z and I knew that there was some big guns in the ... pitching on that project and I knew I was lucky to be invited you know but I knew that I definitely wouldn't be able to get on the phone down because in that ... busy schedule I'm not sure they had time to talk to kids [laughter]\nSo I just had to come up with an idea and like what's the best you know I didn't quite nail at that time but that's the part of being a director is that there is a little bit of a risk involved you have to say I haven't had a hundred percent success to show\nThat maybe it's being a director and pitching on American artist and you ... it can potentially be more competitive out that because I feel there's a lot of direct it out there it's the biggest kills me\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\n... music video direct his ... and Kenny ... from Nigeria so you're\nOperating at a level where many of the artist he worked with on huge big names and know exactly what they want\nTo think Academy of specific examples where you have to navigate accommodating to sentencing holding on to create a vision and I know I mean you said that you had a hundred percent success rate but they must have been certain points way somebody when something a little bit different they say just Indonesia yeah\nYou got to understand initially in the beginning it wasn't that way 'cause I mean I have to put myself and especially being a woman in the industry and competing with of course jumps going to matter because it is a male dominated field and then at the at at cross all starting off\nOn television so I was a funny person that now want it to be the girl with the camera so it was an obstacle that I needed to jump over to change people's minds and the only way I could do that only weapon I had\nWas every time you get the opportunity to knock it out the park the first ever project that I did one official project and I did music video and when the music video for an award ceremony at I was one of them\nAnd they had a a song that was going to be the theme song and then they had a lot of the big names pitching for it\nAnd I'm like you know what do you do not like you know I'm directing out it's like yeah I mean this is what we want you to start when you come out of the stage and things like that\nAnd I mean I'm not just one thing I had one day I had a dream about the concept tries to be as visual as possible and I sent it to the guy that you know it was running the show and he called me like I was like a ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nPay these big name just give me what I Need to execute this project so at that point that got that chance eventually to position myself\nAnd it wasn't heritage that I knocked it out the part I might not have gotten long boosted tuition but that is the only project and I had to pitch for it\nBut then once I was able to deliver it wasn't always like a business card universe and a lot of people call me the New England mama girl so [laughter] because they just need a music video and like I Want that person and and that's just how it's been\nLike I can we talk about how much you're charging [laughter] I'm very expensive very kind of holding ... you didn't have to give me the exact figure to give me a sense of how much you're charging a fenced it depends on the project\nThat things I charge denied that things are charging a debt ...\nTheir party like I'll give you figured that projects do that I Do for nothing at all that but I Believe me the most money when they came to me my budget with a little bit too much for them I really love the project I wanted to be parts of it I thought it was something that I needed to be involved in and that particular project might not have\nLightened my pocket at that point in time when I was probably made me the most money down the line because people are seeing that and gone I needed to work in this project right so that somewhere\nIt's an effort is going to be given to me I mean I'm not going to get at your level now I mean I can you give me a sense of how much he's challenging\nAnd it's funny because actually my family has not increased because there's a rule of thumb that older actors get temp set of budget\nIs it what would be typical budget I mean can you give me an example of the budget\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nYou would get more working at a supermarket [laughter] because it's a matter of hours you put into a project where you drop everything and literally just do that you're not making much power that if you're working on a hundred thousand or two hundred thousand dollar project you can end up with a little bit of caution you pocket\nWhen you see the dynamics tempest and what does that mean I tend to send the total budget so who gets the budget well normally the budget comes from the label\nCan get in your experience how on male and female artist treated differently by they record labels\nWell in my experience and this is obviously general conversation doesn't apply to everybody of what we thought it really depends on the artists and like how much they already have to bring to the table but if it's somebody who is to be young and like a little bit lost and not really shore and that stupid talented and have an amazing voice and\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nProgramming on Minnesota Public radio supported by southern Minnesota municipal power agency bringing power to your life in partnership with Eighteen municipal you owned electric utilities online at S. M. M. P. A. dot com\nPeople who can matrix in our minds that they had not magicians scientists and engineers among reassured us the the notes in his to\nBond villains yeah these people don't intend to take over the world did they do have some unusual conscience to manipulate our brains to try to solve some problems facing the wild right and why are we going to be hearing they sound [noise]\nIt's kind of a digital copy and somehow even if you're feeling anxious or stressed out it can trick you into feeling much calmer or at least that's the idea and we're also talking about late this year yeah no as scary as they sound\nThat actually helping people with Parkinson's disease again by tricking that right\nThe only devices we have for making this into a program a district of trail a good humor and conversation we trust these so it's all coming up after the BBC's\nLive from NPR News in Washington I'm Shay Stevens President Trump joined Texas Republicans at a rally last night in Houston thousands turned out to see Trump who's making campaign stops across the country as Houston Public media's Elizabeth trouble reports\nAt Monday night's rally President Trump praised Texas Republicans running for reelection like his former opponent Senator Ted Cruz\nHe defended waters Trump also\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nDan Patrick also spoke at the rally with the president's endorsement boats are vying for re election in November for NPR News I'm Elizabeth ... in Houston\nAt a democratic Raleigh in Jacksonville, Florida last night former vice president Joe Biden warned that Republicans will try to cook keep programs to pay for their tax cuts\nAre saying we have a day\nOr so good at one point nine trillion dollar we watch the budget and there's only way to do that one way or the money is Medicaid Medicare and Social Security\nBiden urged voters to choose democratic candidates who he says will protect social programs for the middle class he told those gathered that Americans are desperately seeking a unified country and people of character to run it\nThe Trump Administration is making Affordable Care act changes that could affect how people obtain health insurance on their own or through their jobs details from NPR's Allison Kojak first\nFederal health officials say they may allow states to opt out of some of the Affordable care act's bedrock rules the new guidance encourage states to allow health insurance companies to offer plans with fewer benefits at lower prices and for the first time people who buy those policies may be able to use government subsidies to pay for them\nSeparately the Trump Administration is proposing new regulations that would allow companies to give their employees money to buy insurance on their own the administration says the plan would give workers more choices and add competition the Obama administration banned that practice because they worried companies would cover healthy employees\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nLies inside a package left in the mailbox authorities say the employee plays the package in a wooded area we're a terrorism task force detonated it this is NPR News\nBudget in San Francisco was upheld the jury's verdict that Monsanto's weed killer roundup contributed to a grounds keepers terminal cancer but your shoes and belonging to slash the jury's punitive award for from two hundred and eighty nine billion dollars to Seventy eight million belong to us also\nDenied Monsanto's request to throw out the entire judgment and order a new trial and the punitive damages [noise]\nYou know ... a former youth basketball coach will likely spend the rest of his life behind bars where the sexual exploitation and abused of hundreds of boys as Iowa Public Radio's Kate pain reports authorities are urging other victims to come forward\nAs state investigators his players for the Iowa barn storm or his knee just now be finding out what was done to them former used basketball coach Gregory Steven has admitted to compiling explicit photos and videos of some four hundred boys she even found some of them in bathrooms with hidden cameras are found all them while they were asleep\nHe also got images by posing as a teenage girl on social media\nAfter pleading guilty to sexual exploitation and child pornography counts Steven faces up to a hundred and eighty years in prison in an interview with the Associated Press estate investigator urges victims to file reports St Gregory Steven's case isn't over yet for NPR News I'm Kate pain in Iowa City\nOn stock markets in Asia shares close lower down three percent in ...\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nMelville charitable trust driven by one goal ending homelessness for good learn more online at Melville trusted dot org and on Twitter at Mel build trust and Americans for the arts and Americans for the arts dot org\n[noise] do you ever feel like your mind if playing tricks and he\nCame up with the idea of using a a a hot feast rhythms in a way to have been done this\nOnce he that dissension within the ... to make you feel that a lot for me it has helped [noise]\nTake the edge of some anxiety inducing situation or help to calm me down this week we're looking at some unique technology strengths of will turn around your office was I just have to pay off my\nFeet designed to help people out to the gym\nI can get stumped I get stuck in all sorts of places I've been stuck in St Louis in how to look at the same job as peaches for about twenty minutes helping them by tricking the brain [noise]\n[noise] well [noise]\n\nAnd welcome to well hats and stuff yeah back to that this is the problem we meet the people trying to sue all sorts of problems with ended up his mind bending nations\nThis week is no exception because disillusioned with looking at a point about manipulating people's brains king tricks send them to try and stole some priests\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nWhat we feel and controls on movements so what if we could trick it to make us behave in a different way is it\nLike when you sit in a bus and the one next Steve thoughts to move and you feel like you moving backwards even though you actually know moving until\n... kind of thing we're talking about ... particularly Asian and it's an everyday example of your brain being tricked will be by accident but there are now people designing wearable tech to try to trick our brains for a specific purpose I'm wearing one of them now it's this respond and I've had mine on for a few days\nAnd I have one to which you gave me about ten minutes ago and it looks like a watch and it feels it wait it's it's like it's pulsating on top of my list what is he doing\nSo the response cooped up all and it's essentially putting fake ... be on the wrist if anyone wearing one and if you've listened very carefully you can have the device being the rhythm of the heartbeat on my wrist right now I can have it is currently be saying about ... beats per minute us quite a slur post strike\nAnd the idea is is tricky my brain into thinking that I should be calm there's after my fight that allows me to pick different settings and comedy minds on keep calm\nBut I can pick two different rhythms on that show ... five beats per minute now if I wanted to be even comma say ... beats per minute I could do as well and so it's all about allowing you to pick different rhythms to see what we would you want to be in a particular point in time\nAnd the one I'm wearing is on a different setting hold ditch that cost him\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nI don't know when it's going to happen I can be health laid on the field with adult and suddenly I suddenly feel they on the coordination and the energy gang when left side which is like my difficulty side um and I can literally\nNot be able to move I can get I get stuck in all sorts of places I've been stuck in St Louis and had to look at the same job of peaches for about twenty minutes and I've been stuck on and\nThe station in London vacancy station for an hour and a cruel to them because I couldn't get on the train\n... smell power she was diagnosed with Parkinson's ten years ago\nAnd now she regularly sophisticated as freezing you have to say oh that sounds scary yeah they they are very scary however health truck stop in London thinks they might have come up with a solution to get people not mountain moving again the solution\nRobber device that goes around to the shoe underneath and then often around the he'll dot leaves I pop pay you set up ... with a company that create devices that help people with the general newer logical disorders to reflect the product here\nAnd I mean for salted it's more shave no it's not it's just she was ... only use as a mechanism for ...\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nLine a few inches in front of each but\nWe'll have a guy I Try and get on and say how ... I'm Sorry the Macs should I get up and have a walk and you can guide me as to\nWhy should be placing them citizens who've been reading strike food safe I've said to the ... on my show is that is coming out as much\nYou can see when you put your left foot on the ground it will have to try\nTo find the less\nStrikes will come after office when I see\nThe places they switch on and off as you take each step forward yeah so when I put my right foot forward a small horizontal line about ten centimeters along with a pair of few inches in front of my left foot\nQuite cool and it's fun to laugh but I'm Wondering how they help people who have freezing of gates happy so\nYes so behind the solution is not just these ... she works closely with professor ... who is ... ... what puff scientific advisor and and you're on the just\nThe essence of Parkinson's disease is that the so called automatic pilot\nIs defective if people with Parkinson's you and I can walk without culture see paying attention to it that automatic abilities lost and people with Parkinson's but you can actually do to trick the brain by by policy that automatic pilot which is more or less just\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org\nTo learn more stepping over the laser beam and in doing so good by post their defective automatic partnered\nRight okay I think I get this for people that have Parkinson's the automatic way of moving at in walking which we all take for granted if damaged so having this visual trigger helps the brain received those messages in a different way yeah another\nReally good way to think about it is generally Parkinson's patients don't have any issues will care style as\nDust because the status going up which acts as a visual cue obstruction by policies that effective power fry the sensory illusion of the lasers walks in the same way it tricks the Brian ... constantly placing a cue\nAnd from out who as we had a bad idea has had freezing ... episodes in supermarkets ... stations this device is pretty useful\nIf I come down in the morning without the season\nNow can I can manage to says okay and then I get to the corner the kitchen and I find it really difficult to stand up and to get my feet move things that I Will have to pull on my leg some holding like putting it around the corner for dragging myself along the the unit\nAnd then I get to the capital and I can't stand up straight to fill up the castles and I'm guessing from the capital to the sink and back again it's just a real asset it's really exhausting and then to have to going to get the milk when I forgot to take it with me it's all those things with the shoes on it still hard what\nBut it makes it possible to do the things is that\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nOver freezing I said if she knows it's going to happen\nHowever there are still occasions where episodes suddenly come on without warning\nSometimes I Do cross quite badly and I I can I Can't predict when that's going to be there's nothing I can do except wait for the medication to what the name and\nIn those situations even if she's got the shoes and by ... move I call the mom and she says era of limitations as well\nI Can't really see them very well outside quite often if I'm On an uneven stuff is like the grass all that kinda fits in Haiti place and that they said this is flat\nYeah I was going to ask about that I imagine a calm the very easy to see the latest on a sunny day yeah mounted\nMentioned to me that when she goes and will do in a field is one of the time she freezes quite a lot and she ... lasers on one of the drawbacks and she felt a independents not peace of mind would massively increase if they were more visible does\nSo it's not a passing solutions from out buddy helps or do we know how well the ... other people with Parkinson's\nSome study was done and it showed that the freezing of gay episodes decreased by forty five percent for those participants off medication and when they were on medication the effect was still positive as the decrease the episodes by about thirty seven percent\nHowever that was a really small sample size only Nineteen participants in a study\nThat small and I wonder how do these you know do they make a stand out to a lot of attention to yourself yet\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nIn public and they chose attention to something people might otherwise wanted to be quite private\n[noise]\nSo these two ideas duffel and later she both of them are about manipulating the mind to make us feel old act different and they must be also the way we can trick the brain fall out of the ...\nYes it's definitely a growing area of what's happening is wearable tech startups like ... she's a kind of tracking you are a scientist labs and that means that the solutions are reaching the real world a lot quicker\nPreviously they would have been but turn on the line for a long time so it's definitely becoming more prominent not kind of coming together of start ups and you're a scientist and professors and you are scientists who I've been speaking to have said that it's very likely we're going to see more of these kinds of solutions in the future [noise]\n\nThis fascinating thank you ... and things to all of you for listening to all tax if you want to see those lazy she's an action go to our Facebook page we've made a video about them and if you want to get in touch the email is both hacks asked BBC does see oh the u._k.\nWe'll be back next week with another mind bending solution to get your head around until then the die [noise]\n\nOf the b._b._c. World Service in the U.S has made possible by American Pie\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nConvergence of artificial intelligence audio tea and elastic cloud computing more at sea three pie OT dog a our\nHealth care is a problem that people in his district face every single day in New Jersey with fewer than three\nPulled their relationships with the n._r._a. which was something that we haven't really seen before and I think it was pretty shocking and new and surreal for people to see that\nYou could chip away at some of that are as power\nDid we see any of the major retailers pulling back from the sale of forums for example\nThere were a number of major sporting goods store is that said that they wouldn't no longer sell assault weapons so that was a very big deal we also saw among that list of a few dozen companies I mentioned that offer discounts\nAll but a few pulling their relationships um Delta Airlines and United Airlines told us they would no longer offer discounts to enter a members who wanted to fly down to the annual convention\nIs there any way of measuring the financial impact on the end All right all of these movies\nHard to know exactly how these companies pulling ties impacted the enterprise finances\nWe know that they are complaining of financial woes in court documents but it's hard to know exactly what that entails but I think one interesting effects of that like I mentioned earlier is if you look at the end are a spending in these twenty Eighteen mid term elections they're spending farts\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nTeam mid term elections\nWe did try exhaustively to speak to the at All right for the ... business daily from the b._b._c.\nThey wouldn't make a spokesperson available we also failed to get any formal comment from most of those companies who withdrawal mess up off the n._r._a. but we did reach one candidate base for them that was caught up in all of these protests David led to stores the chief executive of meant in equipment ...\nIt's a retailer base in Vancouver the price of the Parkland shooting in February was studying some products linked to a significant us weapons manufacturer vista outdoor group\nThere was a petition and to us that had some fifty thousand signatures on it but what we were really watching was the conversation on our our social media channels and there was some twenty thousand conversations that were happening at the time\nAnd it was evident that there was a lot of emotion um a lot of movement on this and we believe that we have to take action based on what we were seeing and what we're finding primary and our social media channels [noise]\nSo what did you do precisely\nWe spoke to the vendors we reached out to industry partners and and really trying to get a feel for this before making a rash decision [noise] the the vendors that were impacted were long Kenyan vendors are bows whose ethics with toasted two hours then says after the holding company\nSo they were very real people um that I was lying to us that would have been impacted by our decisions\nRight so I mean essentially a with the prime mover\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOffering to customers until they stopped manufacturing firearms and since then Mr outdoor I Believe has got rid of it so far on manufacturing business\nThey've got it up for sale I don't think it's being sold yet\nI'm just make an observation here we approached you but obviously we approached a very large number of U.S companies who found themselves goes up in this boycott of um of the n._r._a. or and gun products in the wake of the Parkland shooting you were the eighty one who agreed to take part does that surprise you\nProbably not because as I said that we looked at this from the ... this was a social decision for us not a political idea ideological decision whereas I think in the U.S and his former politicized\nDavid ... of NBC in Canada so how much have moves like this really hit the gun lobby at least in the pocket as mentioned the n._r._a. campaign spending has fallen dramatically this year but professor Bob Spitzer doesn't think financial muscle is key to the n._r._a. influence anyway\nThe key thing to the ... political influence really hasn't been money\nSo much as it has been the zealous loyalty of its base of gun owners and gun rights advocates who will attend the meeting vote based on the gun issue will make a phone call I tend to demonstration when most Americans stay home\nIn two thousand Seventeen for example the n._r._a. spent about five million dollars on political lobbying activities\nIn the context of American politics it's really not very much at all\nBe an array is fine and swimming alone despite its claims of\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nThat's the dark allegation reporting on to the American media in recent\nMonths and their difficulty is that their sources of funding or rather finite and there's a long term existential problem\nThat fewer and fewer Americans are interested in having guns the typical gun owner in America is an older white male and that generation is frankly dying off\nBack in the Nineteen sixties one household and to have at least one gun in it today it's under thirty percent of households and\nThere's an interesting phenomenon there even though fewer Americans own and have guns the average number of guns owned by gun owners has increased today the average gun owner owns more than eight\nSo let's hear from the rich and Mary Wilcox oh too long to gun owners\nThey live in a rural area and they're opening in New York state where they've seen a steady rise in local government restrictions on firearms and ammunition sales they let a reporter skilled at the ... into the house to see some of the many weapons they keep\nThe first one is a three oh wait that would be for deer hunting bear New York state has quite a population of bears and they're actually starting to get to be a problem because there's too many of them might pistols there that's a forty caliber and this one here with my great grandfather's gun purchased in Eighteen Ninety\nIt's more of a buffalo gun for shooting buys and\nHe said like cited when he comes home and the deer and it's really neat what we can have for dinner as a result of that it's just amazing and especially like Venice\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nShoot them you know legal fees they just had somebody just recently just shot somebody in their home in the area that like a very very yeah they broke somebody broke into their house and I literally carry my pistol all the time so and it's loaded for this reason for that reason security\nWhat that does is by me having the gun and gives me a choice if I Need to protect myself or my wife or my family I can do that\nAnd if you look at your biggest crime rates in cities are in cities that don't have guns\nLike Chicago has the highest murder rate in the country they have the toughest gun laws in the country\nTighter gun control it's like you guys for how did you guys see that now\nI think it's a waste I mean they're really chasing the wrong rabbit on this thing it's not a gun problem it's a mental health problem education problem it's\nSociety's problem I mean when I was a kid people brought their guns to school you go to school to be guns and hanging in the back windows of the car or the trucks\nThat had shooting classes in school and nobody got shot like they did okay nothing it it's more of a mental health thing it's more of a societal thing than a gun problem so if you're gonna outlaw guns and the only ones are going to have guns are outlaws they're making criminals out of everyday people\nI mean I don't have a problem with regulating guns and controlling who has them but you can't you can't just blame blatantly said no nobody can have them\n... because then you're going to end up with just bad guys having guns\nRich and Mary Wilcox from a town called water for the New York state well they may be a God as all the new anti gun measures that they're saying but this could just\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAnd into Lucy McBath\nWhose son Jordan Davis was shot and killed and Florida\nNumber of years ago and this year after Parkland she decided you know what if I Want a candidate who's going to support the type of gun reforms that I Do it should just be me and she is not the only one with the candidates like this across the country I think the environment and the United states is different this year than what we've seen in the past\nHaving voters energizing galvanize over something like diamonds will help candidates at all levels I think we'll see effects all across the ...\n... one of course going control is just one small issue affecting voters choices in the upcoming midterms in tomorrow's business daily we're going to be looking in more detail of what has been a record breaking year for us electoral fundraising what difference does all this money\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nYou've heard a lot of stories this past year unexpected once complicated ones stories of joy and surprise sadness and hardship no matter what stories the next day or the next year brain MORNING EDITION will tell you what happened listen every day\nAnd the full accounts from Saudi Arabia of how a journalist was murdered in the kingdom's stumbled\nConsulates European nations specific to Britain France and Germany is saying sorry this just isn't good enough to Saudi explanation does not hold water and that we don't want to let this rest\nWill hear from the caravan of several thousand migrants walking from Honduras through Mexico hoping to reach the United states President Trump's national security advisor has been meeting president Hussein in Moscow to discuss withdrawing from a thirty year old nuclear treaty with Russia\nTechnology's changed fields for two jak reality is\nA change that we both have to deal with\nAnd what role has fake news spreads via social media played in the bitterly contested presidential election in Brazil that's all to come after the needs\nLive from NPR News in Washington I'm Lakshmi sang Turkish media are now reporting that investigators have found clothing and Saturday consular vehicle in his stumble that may have belonged to slain journalist your mouth 'cause she'll Jay NPR's Peter Kenyon reports ... was killed sometime after\nEntering the Saudi conflict earlier this month\nGarage a tendency to black Mercedes sedan had been lifted the garage some two weeks ago after waiting for permission from the Saudis Turkish investigators searched the car and found suitcases and closing the search has been on for the body of ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nWhoever gave the order for the killing must be held to account Peter Kenyon NPR News ...\nThe president's national security advisor argues there's no evidence that Russia's interference in the twenties sixteen election affected the outcome the during a visit to Moscow today John Bolton says Russia's breeding more distress because what the Kremlin did\nRussia formally denies it's been meddling in us elections but U.S intelligence agencies say Russian operatives are still busy attempting\nTo undermine the mid term elections and the Democratic process in general bulletins visit is taking place against the backdrop of the federal investigation into Russia's election interference and whether members of President Trump's inner circle helped\nThe governor of Georgia says he'll call state lawmakers back to Atlanta for a special legislative session to address the damage recently caused by hurricane Michael from member station to be a B. E. Sam Whitehead has the latest\nGovernor Nathan Deal says he's notified Georgia legislative leaders he plans to convene a session next month deal says many communities in southwest Georgia sustain heavy losses from hurricane Michael and he wants to make sure those areas have the resources they need to recover\nGeorge's agriculture industry was hit particularly hard by the storm state officials estimate at least three billion dollars in damages to timber cotton and pecan crops\nThe special session is scheduled to get underway November thirteenth that's after the mid term elections when Georgians will vote for a new governor who will take office next year for NPR News I'm Sam Whitehead in Atlanta\nThe Florida Man arrested for groping a woman after he declared that the president said that sort of thing was okay is scheduled to make another court appearance today for a detention hearing bruised Michael Alexander is ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nEmerged capturing Trump bragging that fame gave him license to grow up winning from Washington this is NPR knees\nSupport for news comes from progressive insurance committed offering a streamline shopping experience were home an auto can be bundled together now that progressive learn more at progressive dot com or one eight hundred progressive\nFrom Minnesota Public radio news I'm Steven John results of a new NPR New Star Tribune Minnesota polls show Republican Doug ward low jumping out ahead in the race for attorney general the survey of eight hundred registered voters last week found forty three percent support ward low compared to thirty six percent for DFL Congressman Keith Ellison\nSixteen percent undecided\nA poll last month showed Allison in front by five points\nUnfavorable opinions of Alice instill out number favorable ones the polls margin of error is plus or minus three and a half percentage points\nResident Trump has endorsed third district representative Erik Paulsen who scene is one of the most endangered Republican incumbents in Congress in a tweet today Trump says pulse and quote has done a fantastic job of cutting taxes and job killing regulations\nTrump issue the tweet even no pulse and has kept his distance from him Paulson skipped Trump's rallies in Rochester in Duluth and has said he didn't vote for Trump being twenty six team\nThe Duluth city council voted last night to approve the purchase of protective equipment for police what critics are calling riot gear the six to to vote came after protesters wearing bandanas and mass shouted and chanted throughout the meeting trying to shut it down councilmember Joel ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more with this purchase\nAt least it would have happened in a way in which people felt as though there are concerns were taken to heart supporters say the equipment is needed to keep officers safe forty three degrees this hour in Duluth forty seven in the twin cities at two oh six\nHello and welcome to news out from the b._b._c. World Service becoming too long from London on pool Hendley today there's more pressure from all corners on Saudi Arabia to provide a fool and Frank accounts of the killing of Jim ... bull\nAs crown prince Mohammed building ... opens a major investment conference in Riyadh\nAlso today will have a report from a correspondent all like Gehring in Yemen's warts and pulled her data\nAnd I found out and getting back to their children often don't want to eat ... day as a young how whenever I Know that most of the time we survive on the bread and tea\nPlus in an unprecedented rebuff to the Italian government ... budget has rejected by the European Commission and we'll hear from the United nations refugee agency about the support they provide to thousands of Central American migrants walking through Mexico at the moment\nTo board the United states border that's coming up in a bounce off in our\nFirst pressure is still mounting on Saudi Arabia following its mission the journalist Jamal ... J died at the hands of its staff inside the Saudi consulate in Istanbul the G. seven group of the world's richest countries has now demanded a full account of what happened to Mr ... make it clear they don't believe so\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nPolicy and the Turkish Parliament is the other one said a plan to kill Mr ... had been hatched afferent early visit to the consulate in which the journalist was told to return in a few days time out to be sent stumble bicycles will know\nThat was the first visit because of the country or to Saudi Arabia in Istanbul this visit by Chris show so if you're doing for the team that organized and plans his murder that's what we understand the plan a road map\nWas launched at that time a security correspondence Frank ... told me what today's G seven demand meant it\nShows that there is a major discrepancy between the Saudis Russian and whether how do you think they've got to this to put an end to all the speculation that this leads back to the crown prince for example to crown prince Mohammed bin salon\nAnd where most of the G seven nations lie on this about\nPresident Trump's position is rather hard to define to to to work at exactly where it is because he's playing Hoffman coat between saying that will be serious consequences if Saudi Arabia at the state is behind this but at the same time saying well we shouldn't ... hundred and ten billion dollar arms deal and\nThe U.S jobs at risk Kepler Saudi Arabia is a big important strategic ally all which is true about European nations specifically Britain France and Germany as saying\nSorry this just isn't good enough to Saudi explanation does not hold water kind of to likewise the saying this and that we're not going to let this rest\nAnd what did you think of the photographs in ... shaking hands with Mr ... son [noise]\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThree between now and then I'm doing a double duty hosting a live debate in the fifth congressional district that's coming up for our listeners in the twin cities at two thirty BBC News are will continue on for listeners in greater Minnesota this is NPR News\nThis is Paul Hendley with news out live from the BBC in London the European Commission aids wielding never before used powers rejecting a member countries national budget\nItalian populist government has been told it's floating commitments made to Brussels by increasing it structural deficit and putting more money into social welfare speaking at a news conference in Strasburg the IV financial services chief ...\nSaid it said they had been given three weeks to send revised plans\nToday for the first time it was a commission is obliged to west you're at a company that a wise it's that off the budget plan\nBut are we seeing no alternative do as an photographs it all in all three of these two little so they held up to an opinion of giving it to a maximum of three weeks for ... at a wise that I'll budget the flying for two thousand nine the\nLorenzo de ... is a former chief economist of their talent treasury and he told me what the next steps might be to Italy and for the\nMost likely I Would say the government will decide to go ahead\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nI return to\nBalance the budget to medium term objective within a short time period for the American point of view it might even be better because here he thought he might be closely monitored and that that would be no middle targets which provide some certainty and at the end of the day I think the situation might not be as bad as people think\nOther people are going into this procedure as you call it a Portugal has not gone down the ... route has been criticized by the EU with little effect\nYeah I mean that keep your mind that even Spain and France have been a for a long while the into the procedure and once you out and procedure you can actually design that kind of ... to pass through the targets that\nWhich is a gradual enough problems with high debt to GDP that has probably the commission and other European countries will ask eat to lead to a half a fast or a return\nTo um to the medium term attractive which is in the case of recently and it would be a balance budgets over the mediums\nWe talk about the Italian government as being a populist one how popular all the proposals that putting food for instance to given minimum level of income to the unemployed\nBut unfortunately the as popular as I say unfortunately because I think that the parents that policy a recipe\nOf the Italian government is not the appropriate one um but there is no doubt that they have support in the country right now I think the key issue here it's not the one that came up on a more or less what we're supposed to be the\nTarget but the the issue he ... the issue is that at the moment are implementing in a Spanish only policy by open eight percent of GDP according to the structural change in the balance is not appropriate it's all you need so\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more of\nAusterity policies does the EU pointing to indeed what example do you point to his former chief economist at the Italian treasury\nThe successful story comes when you have that gradual adjustment in other words you don't wait for the crisis okay to develop you you do that in good times\nAnd these are the successful stories clearly eat that we went through a painful and massive fiscal adjustment that you're in two thousand eleven tooth as a team but since then stabbed him slumped with as a fourteen that's been my plea especially policy so you might argue that\nYou tell a should have done more in order to put the accounts you know that but I think again the issue is not the managing demand is not providing some similar to the math the real issue here is to address the the big problems they still has on the supply side\nThat was the other end so don't you who used to be chief economist to the Italian treasury\nBrazilians are preparing to head to the polls and the second round of presidential elections this Sunday with far right candidate jai you both so narrow expected to win\nThe final weeks of campaigning has been really bitter with accusations that social media such as WhatsApp have helped spread fake news and information undermining the legitimacy of the vote or South America correspondent case he bought some reports [noise]\n\n... says it's a perfect match for the fifth scanned ongoing video written anything music and they finished in looking man warning that ... version assistant for its print to fraud\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more studies\nFor them for the money that far\nIn the newsroom as I sat down one of Brazil's biggest Pape is a small team is working hard Daniel ... is the head of state to Janice in and says the widespread use of ... during these elections has warming ... says\nIt is sold dangers that we can not even know how dangerous it is because really we don't know what we are dealing with you\nCan't fight this bubble just\nTwisting some ... or ...\nOr something because this is people sharing confident with people sometimes we feel like we are just with a bucket of water and the wildfire in the forest fire and just using\nThe example of what you have to do but the problem that we can address\nWhile I was ... about ... you might as well so oh well thanks for guys\nYou know and not just to mind is an activist with ... now and he's got his own face this can you cheat pages I regularly videos he's tens of thousands of solid\nNorthfield for simply want you to ... and he shows me man ... groups on who to fame\nIs how much good food and we [noise]\nSynthesis costs a message saying they're Fifteen times and the patients from a hundred different conversations and those are all ... concession\nOf its full size cause global from mice\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAnd make their voices heard I'd say social media is the perfect example of direct democracy it's direct action by people towards what they feel must be done this\nYear is ... ...\nKnows everyone would agree is a politician he divides Brazilian into tired out his populist the law to a public policy professor Mead invested ... pilot\nThe more since you have in Congress the more TV Time more radio time and the more money to do compared\nTo what happened is that this was designed not to have newcomers\nAnd a newcomer\nActually defeated the system so in a way it was a victory of democracy but the\nParadox is that this newcomer is criticizing democracy is a mood tree despises human rights who says he wants to change the constitution is really someone with a hunted democratic content using your democratic movements to defeat the\nLaw for those you can use\nButter for what they want but if the balls are correct Dr Wilson our will take the top job on Sunday and then he decried fake news in any criticisms leveled at and you have a candidate and he's also accused of spreading fake news to Virginians had to these elections last and deeply divided\nLost his father figure News Corps\nOkay she bought some reporting from Brazil this is news out from the b._b._c. World Service [noise]\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nAnd my whole advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and build appointments online ad phone advisor dot com\nSupport for this program comes from strategies health but non profit health care quality improvement organization recognizing national healthcare quality weak and the people working to improve health care and advance safety strategy health dot org strata sales we make lives better\nI Want to follow up on the Medicare for all I Want you to explain or as you said your concert for that is that allowing all to opt in or is it applying Medicare for all and in effect a single payer system\nIt's a single payer system it's making sure that every single person has the opportunity to have health care\nJennifer Zielinski\nWell at the end of the day we want to make sure people do have access to health care just as representative Omar said it is something where people don't we don't want people to decide between making a car payment paying hospital belt and we want to protect those with preexisting conditions one thing the Affordable CARE Act did address\nAt the end of the day though Medicare for all I've seen Medicare not even work in the healthcare system a lot of our patients who are on Medicare have supplemental plans they have replacement plans so they're finding more competitive solutions within the insurance industry versus using Medicare that they can get\nWith ... for shoes me ... would you vote for a repeal of Obamacare\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nHeart of whatever replacement as you'd like to see\nDefinitely again I Want to make sure our citizens have the health care they do need\nRepresentative Omar you're saying about Medicare\n[noise] you know I was saying that the the reason people are needing supplemental is that they don't have full access and I think it is important for us to recognize that we have the resources and we need to make it a priority to make sure that every single person has access to health\nCare I Want to move on to the issue of the role of Congress and the role of Congress as a check a balance on the executive branch and especially on President Trump's so representative or more for you\nOr how do you see that role of Congress and would you support impeachment of President Trump which I Believe you have a supportive in the past\nI think our system is built on check and balance says and it's going to be really important for us to um have a Congress that that sees themselves as the check\n'em to the powers of ah the executive branch\nUm I have a previously supported the the idea of impeachment and I think our country is being let in the wrong direction\nUm and the continuation of a a Trump presidency um is a real danger I feel to our democracy\nUm but I I think it's even more dangerous really ah for us not to work in in um the feeding them at the ballot box um because when we do impeach him than we risk having someone who could be\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nGoes against every single value that we have as Americans on and and someone who came into power and has extended extended his power by going against the uh the ... community on discriminating against a lot of our citizens\nUh and so I Want to make sure that every one that is associated with this administration is no longer in power and I think we will have a greater chance of doing that when we and feed them at the ballot box and a twenty twenty\nShow when it comes to impeachment on what grounds because you are making an argument for a political disagreements well that's what elections are therefore and you're also saying that if it were to come to impeachment there\nThere might be a with vice president Pence or a president that you would oppose at least as much so tell us than what are the grounds you see for impeachment other than to get elected\nAnd this is a president really that has put on the his his interest and\nOn his financial interests above or the country and the nation's interests are and so there are multiple um\nThings that the president has done um that would qualify for him to to get impeached or even you know if if we were going to have that opportunity\nJennifer Zielinski or you're in the same party if the president what do you make of the job the president is doing and where would you differ with him in Congress in that role of oversight\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nSupport him and when he does something that I don't agree with I Will be the first one calling him out on that he has said some things and done some things I don't completely agree with\nBefore and after the election can you give us an example would be one he talked about winning well I don't want to say that on the radio but I think we know that phrase that he talked about grabbing women yes we'll go with that one um but at the end of the day and you know again I'm working for the people the fifth district\nAnd again I'll call him out on that just like you know a lot of elected representatives have made mistakes they done some things I don't completely agree with a representative Omar you have some campaign finance violations that I Know that are going to be addressed and I stand with the star Tribune and Associated Press and calling for those to be addressed\nLet me bring that that issue up because I Want to get on to other issues you'd vote about in Congress but I Want to talk about all of that with the rivers\nAnd I won't have to I Would love to answer her\nOkay can I can I have a question about that and that is a as a missile ... says the star Tribune rented editorial seeing a that your previous explanations concerning campaign finance and the campaign finance board complaint that's been filed by representative ... address ...\nUh they say that your previous explanations or not sufficient and quote Omarosa fuller explanation to the fifth district voters and soon so here's your chance to provide that fuller explanation and did you use any campaign funds for any travel that was not directly related to your campaign\n[noise] you know it's it's really um disappointing\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThere is a a complaint\nUm the board has an opportunity to look at it\nUm and I have um an opportunity to respond once questions are um risen from the board that has not happened yet uh and so I Do not have um any citation for any violations\nOn since I've been running for office\n... what do you use any funds a campaign funds improperly for any travel that wasn't directly related to your campaign\n\nIf there was um\nAnd and and proper action I Would not have used that um and so in my ad campaign filings um everything that is in there or to my knowledge is proper um and I am looking forward to having a conversation if that even happens with the board about\nAh the purposes of um the expenses on a campaign report\nDid you use any campaign funds for a personal attorney in your divorce or any other capacity\nAbsolutely not um the the the use of the funds were extremely prior to any personal needs I had a ... with an attorney\nYou agree with the star Tribune that voters of the fifth district deserve a full and a a complete explanation of this\nKnow that these accusations um were were made by an overzealous a representative who really is using\nProgramming is supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nUm the these kinds of conversations are just like they have done with um their association with alpha news or in going after Congressman Keith Ellison a and I think\nYou know they're the for the people of my district these allegations were out a before um the the the primary was decided um and in a six week race majority of the people um knew that I Would be the best person to represent them in Washington and they made that decision\n[noise] she'll finally or if the campaign finance board the investigation is done are you confident that they will find new improper use of phones are no wrongdoing\n[noise] let me correct you there there is currently no investigation being done that I Am aware office", "year": "2018", "show_name": "BBC World Service", "city": "Rochester", "day": "23"}