{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nYou want to keep up on current affairs and a lot to do is to be NPR News makes it easy for one source for international national in Minnesota you\nListen to catch up with the world go on that day and we are discovering what matters male or\nLeaders of China and Japan and meeting for the first time in years to improve their frosty relations we examined most broached about this so Google reveals that ... dozens of employees including senior manages the sexual harassment\nWe look at why it's made the announcement now why was it supposedly retired Russian spy poisoned in the u._k. nearly eight months ago we had a special report\nGiven the track record of this was ... I could imagine that he will be very valuable I'm not above that wouldn't be any more interesting defector is when they had Sylvester intelligence\nI'm British universities to contribute to a multi million dollar fund estates benefited from slavery in the past that's coming up on the knees and after this bulletin of world news\nLive from NPR News in Washington ...\nFederal authorities are examining suspicious packages center several critics of President Trump all ten packages intercepted by authorities this week are believed to contain pipe bombs Larry Johnson is a former Secret Service investigator who says there are a lot of questions about the motive for the attacks\nIt could be a person a lone wolf it could be organized of whether it's political groups like there'd be criminal activity it can be national security interests\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nInsane at the U.S southern border a head of a migrant caravans arrival\nFrom member station ... ... reports that the Pentagon is reportedly sending eight hundred soldiers to the region\nIt's not clear what the military will do if you're on the border last spring Twenty one hundred National Guard soldiers were mobilized here but they only support the border patrol agents Santa Cruz county sheriff Tony is that as a Democrat says he has his doubts about what Trump will accomplish by sending more troops\nHave been known to [noise] to try to scare people in in every which way you can see where you could go precision base and and that's obviously it's freezing here today\nThe departments of defense and homeland security did not respond to requests for further information on the troop mobilization for NPR News I'm Jim ... owner\nUs stocks rebounded sharply Thursday regaining some of the ground they lost in the previous session as NPR's John Ydstie reports some positive quarterly earnings reports helped propel stocks higher\nResults from Microsoft Twitter and Tesla helped the market's bounced back\nThe Dow is up more than one and a half percent the S. and P. five hundred rebounded nearly two percent and the NASDAQ added back nearly three percent\nConsumer discretionary technology and communication shares led the markets hire the comeback help the Dow Andy S. and P. five hundred returned to positive territory for the year after they gave up all their yearly gains and more on Wednesday\nDespite the rebound investors continue to be unsettled by a number of factors including rising interest rates and trade tensions\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nHome buying in the U.S has slowed his mortgage rates have risen pending sales are barometer of home purchases that were completed a month or two later\nThis is NPR News Saudi Arabia's public prosecutor says the murder of journalists come all the ... and the kingdom's consulate in Turkey was premeditated\nThat's a reversal of previous official statements that the show jeep was accidentally killed in a fight at the consulate earlier this month\nAccording to media reports the show James eldest son Sala holds dual us Saudi citizenship is now in Washington DC with his family after a travel ban on them was lifted\nLouisiana born blues and country rock musician Tony Joe white has died at the age of Seventy five as Chaz ... from member station WNPR land reports white wasn't accomplished singer songwriter and guitar player\nTony Joe whites biggest hit came in Nineteen sixty nine with a song that combined rock and roll blues in country into a sound that fans labeled swamp rock\nAnd our duty to do for me [noise] salad and he was about a wild animal green called pope week but many mistook it as a reference to marijuana\nTo take that number eight on the billboard hot one hundred and it was founded by a number of art including Elvis Presley Tony go watch love a blues again and child on hunting farming northeastern Louisiana he moved to Nashville and songwriting\nCredits include rainy night in Georgia which became an R B hit and the wailing Jennings tune trouble man for NPR News I'm Chad Sisk in Nashville\nNBC who is making Kelly was absent from her morning show Thursday and that question\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\nContributors include the symbol Family Foundation supporting the national Center for learning disabilities which works to improve the lives of the one in five individuals with learning and potential issues learn more at mc L. D. dot org\n[noise] you're listening to the news rooms and the b._b._c. World Service with me to not to do we still in the United states where Google has revealed it in the past two years the thumb ... full\nShe ate people including Thirteen senior managers flowing claims of sexual harassment the Internet giant released the details in a memo following a report by the New York times that claimed Google had paid millions of dollars to a full ... chief\nDespise him facing misconduct allegations a business reporter in New York is Kim gifts and said\nThis is a memo that was actually a written by the company's CEO sent to staff and it was actually in response to an article that was published in the New York times\nAlleging that Google paid several senior executives\nMillions of dollars even after they were accused of sexual misconduct and removed from the from so this is a memo that says look things have changed here at Google in the past two years we've actually fired forty eight people for sexual harassment including many senior executives\nAnd as a result this is sort of something that they've said look that's happened in the past but it hasn't happened under our watch and I do want to put this number and contacts you know school has said that it\nFired forty eight people for sexual misconduct the company I just reported its earnings it has over eighty thousand employees so well it sounds like a significant number certainly within the company you know when you put it in context it is a relatively small\nProgramming is supported by why do you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years ringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... dot org\nSupport he's known as the father of the Android platform which is the software that's used on\nMillions of phones across the globe according to New York times he was accused of sexual misconduct by a colleague he left the firm and he was paid Ninety million dollars over the next four years in installments of\nAnything from a little over two million dollars a month to tapered off year round one million dollars a month I Do want to mention that Mr Ruben says that he left his own accord and he didn't engage any misconduct and this isn't the only problem affecting Google\nNo it's not you know the company has had a rough year and it's not getting better the company also reported its earnings disappointed many investors revenue growth at the firm's slowed that side of the scene shares in the company declined in after hours trading it's also\nNot the first sort of issue relating to gender and the workplace that Google's confronted this year we saw some disappointing statistics that came out in June that suggested\nThe company's still employees just around around thirty percent of its employees are women it's not a figure that's budge significantly over the past couple of years even though Google has said that it wants to attract more female employees and this certainly isn't something that's going to help them and not pursue\nKim gives us and\n[noise]\nFor the first time in use the leaders of the world's two biggest economic powers off to the U. S. amazing for talks rather than threatening each other and the Japanese prime minister Shinzo Abe's visiting China Today for a summit with the Chinese leader Xi Jinping\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nDevices had been sent to eight high profile people including the former president rocket Baba and he's vice president Joe Biden speaking is speaking at a function in New York was divided and said that politicians have to be careful with language\nMy hope is this the\nBreezes bad of\nWho knows exactly right there were these pipe bombs being mail um my wake everybody in my business a little bit to realize that we have to begin to put this country back together and\nThis division this hatred [noise]\nI don't know if America correspondent Chris ... is following the investigation\nFrom what we understand the FBI have not had a chance to take a look at these pipe bombs they're pretty crude devices are some suggestions that they believe that they were constructed after taking some information from the Internet so that gives you a sense\nReally or just the construction of them themselves at the same time they're pointing out that they could potentially pumping dangerous\nSome suggestions that there were shards of glass inside than they could have sprayed someone if they had exploded but the key thing is they didn't explode and not has provided huge wants to that\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nJust focusing on that area in Florida to see if they can't find who was responsible Chris ...\nSearch and rescue operations are set to resume enjoyed knocked or at least Eighteen people mainly school children were killed in the last day by flash flood the dead sea it's been described as one of the worst disasters in the kingdom in years the flooding occurred off the heavy rain for all this stuff to the end of the summer season\nMold and says you people who were rescued as police helicopters and hundreds of ... ... troops who deployed to the area and being helped by teams from Israel and most of the children who died were on a school outing brigadier general ... al ... and the Jordanian civil defense describes what happened\n... before to my name is a\nSoldier came down strongly for four to five kilometers which is the location between the pool and the bridge on the shores for the dead sea some people ended up in the sequel to others managed to reach rocks and saved our lives thank God we managed to save several\nBut that's see is the lowest point two and a half and ... it's dry arid conditions along with deep canyons make is susceptible to flash floods the BBC's John ... men is is monitoring developments\nJordan's official news agency Petra says thirty seven students just seven adults who were touring a an area of the debt ceiling the Joe day inside of the border were caught up in this incident they say that around three in the afternoon locally heavy rains don't see them within an hour\nThere was a flash flood wall to just flowing down hillsides sweeping away editing and it's ... the bus was carrying these students was swept away by the dealer\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nFrom the edge on the ground there's a vast expanse of water involved to the coast won't problems the authorities if they don't actually know how many people were in the area at the time that kind of information and the number of potential picks is my only new to the next few days\nAt least kind of flash floods do a fairly regularly in the dead sea despite the fact that it's such an area to area\nOr because he's surrounded by steep valley so when the frequent rain does happen it causes these flash floods which rolled down hillsides there's no way for the wall to go with the ground coal subs all the moisture anything in his past get swept away not what happened in April across the border and Israel\nWhen nine or Israeli teenage hitchhikers what else are hit\nBy a mudslide they died in a similar incident\nJoan that man is now Nick has some other stories monies to ask\nUs defense secretary Jim Mattis is expected to order the volumes are at least eight hundred additional troops along the border with Mexico\nHas received a request from the department of homeland security as a group of several thousand Central American migrants make that way towards the U.S\nThey left Honduras more than a week ago fleeing violence and poverty President Trump told the migrants to turn around and apply for citizenship like millions of others he accused them of pushing the security of the United states at risk [noise]\nPolice and the southern Indian state of ... say they've detained more than fourteen hundred people for being involved in violent protests aimed at preventing women from entering a Hindu temple\nThe Indian Supreme Court overturned a centuries old religious ban last month rolling the women of menstrual age should be allowed to enter the supper I ...\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nAnd annual tournament and another held every four years the proposals are expected to meet strong opposition when fevers ruling council meets let's say ... nice cars but I'm not rich ... reports\nThe club World Cup is currently played in December each year but it's not held in high esteem by the majority of European teams ... finds the fifth plans to change that those representing Europe's biggest clubs in leagues remain opposed they argue that players already involved in too many games European Confederation ...\nSays those concerns and it's also worried it's lucrative champions league Suffolk commercially showdown in the Rwandan capital Kigali is that all set to take place\nOn the American transgender activist Compton Janice says she's ending has support for President Trump because of his record on gender equality rising in the Washington Post moves Janice says she had hoped to work with the president and his Republican Party\nTo support transgender people but now believes that being relentlessly attacked by him so far as being no response from the White House\nNow his big questions he washes out it's a question that's close debates and division throughout the centuries\nBut one thing has always been constant you need it painted to produce at painting batches until now there are multiple portrayed inspired by the way to some of its great mouse does has gone on sale in New York are ... ... has the details they see is the first\nTo estimate went on to fish will intelligent software to be sold as a major ocean house to describe the process will the brains behind his opponent from the computer as three ...\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nProtests the computer looks a little outdated and goes I think I Know how to make a painting based on the ... and ... and it has a guy and then the second part of the computer process analyzes and tries to see whether it can tell apart\nThe computer proceeds fashion compared to the human proceeds fashions and if we can then it will try again and if it still can tell them apart they would try and get it again and again and again again\nUntil it can no longer differentiate the computers of action against over these Fifteen thousand that are being produced by humans and that is what was going on sale now\nSo I tell you the question first one what does it look like\nWell it's a portrayed seats will never let them works that kind of share with extended family and they see the ... trade to one of the sons the man that's been given the title of Edmund belly me and I'm now a critical attacks but I went to BBC I used to be sheets on on credentials are pretty low\nBut it doesn't quite look finished she ... she's face is ... ... it's one of those when I got a company in front of me because of the further away you hold it in a more looks like a chance but doesn't that she seemed to have a name doesn't know when they look pixilated and and it's not quite central and the canvas but\nExpected they were too and it certainly managing to fool the computer as well so they produce something nonetheless\nFor this a mouthpiece how much they gave her\nWell the Christie's auction house in New York state the pre auction estimate it seven to ten thousand ... figure to lie to fill the final price for the times that full ... two thousand dollars\nAnd ... that guy bother with that report on Martin piece of a ... to ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nOnline they'd be a B. B. E. L. dot com and by progressive insurance protecting commercial vehicles and offering ways to protect small business from financial Lawson liability find out more progressive commercial dot com [noise]\n[noise]\n[noise] there is an oil boom in ... Texas it's one of the most competitive congressional districts in the country how politics are playing in the oil fields\nOf all that has been some progress already this year more than twenty women have been monitored victims set aside many more women continue to suffer unspeakable obese not should it unreported\nTo TV campaigns are strikingly different said well you'll find inside the popular press which feeds seemingly insatiable public appetite for sensation the stories about women\nToday and said yeah more than two years off the brutal murder of a singer the flow of ... about her mother continues one newspaper even published gruesome pictures from the crime scene [noise]\nProtecting women at risk of violence as a challenge to the authorities the birds and often foods and organizations like counseling against family violence an NGO in\nBelgrade in\nShowing me around the offices is found us ...\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAgainst women the kind of trying to tackle although violence against women and children does often end in tragedy it's not life threatening such as in cases of teaching rape did you do it with any of those cases of it and they\nAlso know these women mainly lived outside Belgrade and never reported violent none of these women probably thought that partners were capable of getting them\nAll the abuses brotherly regular and the men were threatening these women and black male them but none of the victims Celtic all do that saw all the women who came to us survived\nThe most vulnerable come the for protection\nCounseling against family violence operates three safe houses and currently shell says around ... women Yelena not real name was one of them she arrived last year with her children off to ... she describes as a heated argument with a husband she's agreed to speak to us\nNot going to do this with my husband tried to\nCrush Mexico and then when I called the police have threatened to me and went to a in a way to tell them I attempted to kill myself which of course was not true\nThat do to help me by reporting it over to the police they brought him in I was given a medical examination that revealed the extent of my injuries and the whole case was referred to the social services who found me a place a safe house a couple of days later\nIt was the culmination of almost a decade vitamins would break when he first hit me in two thousand and eight I kept quiet\nProgramming and supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nIt became a daily thing it wasn't just physical things it was also psychological I started sleeping in a different room he'd come in wake me up an insult to me so that was verbal abuse\nAnd economic ... too because he'd come to my work and threats and my co workers and my boss so of course I ended up losing my job\nAlthough it's a nice thing violence and saw the first became a separate criminal act in two thousand and two yet in this place at the safe house hair in Belgrade was enables at least in part by the new law and prevention of domestic violence which came into effect in the last year\nIt's been welcomed by many for imposing zero tolerance policy employing a range of new measures including restraining orders and risk assessments\nIt's also the spies to Columbus systemic discrimination requiring special training for relevance officials and penalizing them if they fail to laugh\nThe legislation was aimed at meeting the standards set by the council of Europe convention ... violence one of the steps inside these negotiations to join the European Union [noise]\nNon yet my son of it has been working on cases of domestic violence than than aside from old and twenty five years\nShe's now a lawyer with the women's ... was she was part of a working group calling for changes to the level\nThat offices sit on the floor of an unassuming block in Belgrade [noise]\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\n... graffiti covers cracked concrete rules\nManaged to have the state saying we are protecting you the most wonderful moment before the law the state reacted only if ... happened you needed to have\nA bruise the police they needed to have the evidence that the violence of court actually predominant the physical violence\nNow the law says that the emergency protection order will be issued even in the case when there is a suspicion that the violence might happen and how has it been has actually prevented cases if either [noise]\nSo now we have a for one year more than sixteen thousand emergency protection orders and more than fifty thousand for a long time\nSo he in Ninety percent more than Ninety five percent of the cases the emerges protection orders have been for a long by the courts\nSo that's very good I think this is about preventing incidents from taking place of all those and reacting was it actually happened yes and this is a huge\nChange your mindset here especially for the professionals and for the police and persecution offices her used to you know taking the case he's only been something occur and now they have to react\nWith of the interventions under this new law will walk in more rural low patriarchal settings where generations of Senate side by side remains to be said I asked on yet if there's been an unwillingness and the cost to report to piece\nOf the problem was is one of my friends and she's a prosecutor she said you know\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nReforming\nOr somebody I Know when I reported a list of the police they said do you know what happens next I said well expecting some sort of help from them but they said he's just going to be even more from now on and then I realized when I was\n... husband had to come to the fact that children\nWe have many times when he'd beat me so savagely in the middle of the night that I couldn't get up to cook breakfast for them in the morning\nMy children would come in and ask me watching them off getting me mom you All right can we get you anything to eat [laughter] it was shameful mad at me [laughter] I realized I was no good to myself my children or anyone else\nOne episode in particular that stands out\nHe was totally intoxicated so it was awful\nHe's demanded his ... privileges and I refused him they started to hit me I began to scream\nHis mother and the children came down from upstairs\nI go out and run out of the house he somehow grab hold of a knife and followed me yelling insults he said someone is going to get killed tonight\nI don't know when my son came from he'd just materialized that and said that's going to be me he just came out of nowhere and go between us [noise] I don't know what to say that shook me I realized that it was no longer just about me\nIt would still be more than a year before she managed to escape put a children's the safe house Yellen his story is just one of thousands\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nEspecially now with\nThis law we don't have enough stuff to take all these cases that there's no our problem and there are a lot that\nDozens of judges have reportedly been trained to be gender sensitive and understand victims of unreality but despite this Vanya believe entrenched ... of patriarchy and misfortune he will be harder to shift\nYou still have prosecutors and Serbia that say that my survivalist is that the force and then he is and duty know domestic violence does not exist as a criminal act and unfortunately we do have professional as late as we know that you know we hear them from their colleagues hurricane for them so it's very hard\nShe points out that if we said woman killed and twenty Seventeen died off the reporting incidents of domestic violence to the police and she's concerned that frontline stuff still didn't have the skills to deal with the most thoughtful forms of obese\nHighs reaching about fifty degrees for your friday evening rain showers likely that a slight chance of a few showers after midnight with those lows dipping down into the mid forties looking ahead to your Saturday cloudy skies and the forecasts but it's a thirty percent chance of a few rain showers with high is reaching the mid fifties\nProgramming is supported by the merits entire family owned since Nineteen Seventy one two metro locations Minnetonka and they'll open any Dinah Samaritan tire recognized brands and a commitment to service online at Samaritan tired dot com\nBe elected the country's next president\nHad both an hour and a former army captain is promising to root out corruption and crack\nDown on crime he wants to loosen gun laws and the protection at the Amazon and\nBrazil has one of the highest murder rates in the world and its economy has still ... pitched in South as the pain speaking anti establishment choice but when a man who talks on leave the country's ministry dictatorship has been accused of racist homophobic fees be able to lead this divest in democratic country\nThe left has been mud and corruption scandals and there is that climate change\nIs backing ... could he's election mean Brazil's the ... that's the real story than the b._b._c.\n\nLive from NPR News in Washington I'm shades Stevens law enforcement officials are asking the public for any tips about the ten suspicious packages sent to CNN and from that critics of President Trump\nNPR's Hansi Lo Wang reports that the FBI is analyzing potentially explosive devices found in the packages\nAuthorities say they can't be sure whether or not there are more packages being sent through the postal system so they're telling the public that if you find a baggage that you suspect contains an explosive device to immediately called the police or the FBI and to get it investigated\nNPR's Hansi Lo Wang reporting the state department says a son of slain journalist ... is heading to the United states with his family after the Saudi Government lifted travel ban NPR's Michele Kelemen has more\nThe Saudi king and ground friends offered salad ... condolences and an uncomfortable looking photo op this week amid questions of whether he'd be able to leave the country State Department spokesperson Robert palate dino says the secretary of state raised this directly with the Saudi leadership\nIQ confirmed is uh the secretary of state I did make it clear to Saudi leaders that job he wanted solemn ... to be able to return to the United states and we are pleased with that as the ...\n... says the U.S is still considering next steps in response to what the Saudis are now admitting was it premeditated crime Michele Kelemen NPR News the state department\nFormer Trump campaign aide George Papadopoulos has made his first appearance before Congress since he admitted lying to the FBI Papadopoulos met behind closed doors with two GOP led house committees for roughly seven hours Thursday\nHe later emerged from the meeting to tell reporters that he answered lawmakers questions as truthfully as he could Papadopoulos was censored\nSupport comes from urban homework stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nDecision by the Trump Administration\nGovernor Kate Brown has pushed since January for assurances Oregon won't have drilling off the shores she says she hasn't gotten an answer\nI Am tired of waiting for the federal government to come to their senses and realize that this is a terrible mistake\nThe order brown has now ... directs the agency to deny permits related to offshore gas and oil drilling California lawmakers took similar steps earlier this year round in a tough reelection fight and the benefits of the water and taking a stand against the Trump Administration may be more political than practical\nExperts believe there's not much interest in drilling off of Oregon's coast\nFor NPR News I'm Dirk being hurt in Portland\nAnd from Washington you are listening to NPR News\nPresident Trump says he'll send the military to the southern border to stop the migrant caravans\nMoving through Mexico from entering the United states the department of homeland security has asked the Pentagon to deploy about eight hundred thousand troops for that purpose trumped administration officials tell NPR the operation is expected to be up and running next week\nHundreds of evil in Arizona could lose their jobs at shelters for undocumented immigrant children from member station cage ACC Matthew Casey reports on the fall out of a recent legal settlement between a shelter operator and Arizona's health department\nPart of a deal with the state of Arizona southwest key programs agree to surrender licenses for two of its shelters the legal process that led to the settlement was started because south whiskey missed the deadline tied to increase state oversight\nSupport comes from urban home works stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nTheir jobs he says it could be as many as five hundred of the roughly two thousand southwest key employees in Arizona for NPR News I'm Matthew Casey in Phoenix\nResidents in the northern Marianna islands are preparing to cope without electricity and running water for months after typhoon you two rabbits the region causing at least one death a FEMA spokesman says that a military plane is delivering food water and other supplies to the U.S territory\n... NPR News in Washington\nSupport for NPR terms from Americans for the arts committed to transforming America's communities through the arts and arts education supporting the nonprofit arts industry which employs four point six million people nationwide learn more at Americans for the arts dot org\nBBC well service will come to the real story I'm ... I'm this week we're asking if\nBrazil is slipping towards authoritarian is and if the polls are right this weekend the country is poised to enact the skill of far right politician as its next president giant ... looks set to try and save the left and on the dot the votes his face a stark choice\nWe believe he is he's a hundred percent in politics for a long time and he has nothing that his name\nHe got he got paid to go to the country and he had nothing he hates corruption we all got tired of living on the case if they can't [noise] people that still the case and they feel the future of our country\nThey believed his men can paint that used to\nMaybe he's not by\nAny law or anything like that I Am gay people remain\nPeople who are they should be afraid to go fighting against\nGay people I think they felt bad\nNo they're not afraid anymore that can't do that we are seen as a minority and they said that democracy for the majority and it's not\nA duty to protect it might not be\nHard to market\n[noise] so it was just discussing ... on this week's real story will be discussing his plans for Brazil who supports in an ... who speaks to form their Brazil's but it she teaches should really be trusted with its democracy\nBefore we need a panel let's hear a bit more about ... and how he's come to prominence Kay she wants and is the b._b._c. South America correspondent\nYou've been in Congress and the nanny says he is on\nIn that time you think quite insignificant did it I think his paw that just a few little son of his proposals and become a little but\nHis rise has been in the past year or so and it's taken everybody by surprise he's now running under the social liberal politics very small ... was until the U.S around when on it gained a lot of seats in Congress so\nIt it feels as if anybody who say states within teams to win seats in Congress in he has a bit of a kind of meat is touch if you like\nSuddenly has taken quite a few people by surprise this a rise so late in life\nSo what does he stand for what he's telling\nHe's sending conservative values the role of the family and that's something that he has really made a priority it's made him die ... among the evangelicals which is a growing\nSupport for NPR's brought you by the law firm of Inskeep intellectual property group with offices in Minnesota and Los Angeles Inskeep IP Group aims to help companies leverage the power of patents to protect their innovation you didn't find out more at ... dot com and the cost\nSharing his admiration for them in a tree and the role of the minute the dictatorship between Nineteen sixty four in Nineteen eighty five and not\nWhat if it will say probably the most contentious part of his candidacy um this support\nFor what happens that the porch a will for one of the denial that it really was a a a dictatorship and I think that's one of the biggest concerns um going forward you know ... does his ruling will if he wins\nDoes it mean that there were tons of the ... when he set himself that he wants to have a Brazil from you know four years ago not flooring quite so to people\nYears with regards to the first racism against uh the austerity measures we agree that\nThey were wrong but in addition to that we have to remember that right at the beginning of this second term off do most governments Congress has approved what we call about the bone bus we'd sharp budget bills the inbox negatively into Brazilian budgets and these was employed by the president of the lower house\n... who is in jail right now and also through massive support from Brazil and opposition\nIs the old politics of\nAs worse it is better for us because we can change the game and that has being damaging for the present\nMonica who to that's the problem\nEver recognize any mistake that they have done for all those years you know it was very easy\nRound kind of why why why why Mary easy\nTo have a budget surplus when commodity boom and the first term of a Lula was really I I was very happy with his performance I Would have voted for a little bit I I don't I'm hearing you asked for a long time but if I were in Brazil I Would have voted for a little in the first\nBlack out that he increased welfare benefits an introduced at minimum wage\nYeah and it was the right thing to do but after the subprime crisis you start seeing a lot of counter cyclical policies that were not sustainable in the long run\nAnd by the time that a humid or lacked you see a reverse off many of the policy that the first term of little that little had pursued do start seeing more much more interventionist economy\nAnd when you look at it be to program for these election they just talking about increasing resources for areas like education health which you are very important but K ...\nWe will talk about that in a bit ... in a bit more details of the moment but I just want to think about the backdrop to this election you have so president dude I Do the PG president who is embroiled in corruption finds himself in prison his successor Juma Rousseff who was impeached\nSuggest us to lose a two factors the economy corruption the face of these two leaders that perhaps as as affected this election enormously\nBut what about the other two things that are going on it's all about crime and the conduct of this election crime is an enormous feature Brazilian life and Brazilian concern\nThe for addressing this topic and I took a step back and with all due respect to ... I think clearly Diego this strategy of shift to the blame to others it's not working any longer to the the the first one the scandal when the cyclical\nSupport for Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learn more at E. H. R. go dot com\nThey said that they shifted the blame to the external environment so a yearly this this this rhetoric is not working any longer just look at the polls I mean people are not buying that story and they won't let me let me\nTry food then let's talk about how crime and we'll talk about how this election is being conducted holidays affecting how Brazilians think about which way tonight\nCrime has become endemic in Brazil the reeds have homicides and Brazil\nOr has reached record levels in the last years and now we have three homicides for one hundred thousand inhabitants what puts Brazil among the most violent\nCountries in the world the nature of crime and Brazil has changed there are strong\nOrganized crime linked to drug trafficking in Brazil and who are the sections of the population who are worst hit by this wave of criminality\nPoor people read and it's no wonder this year it is worth noting it is to put people who have areas the how we'll have more poor people have tended to vote more bt that's eight nine ... if you were right if you look at the north eastern part to Brazil when you take\nA huge metropolitan areas such as real which is emblematic of this endemic crime problem those poor people tend to vote to boso now too as a sort of knee jerk\nBased on the idea which in my view was wrong\nThat we need extrajudicial killings for instance with the problem is able to kind of food and that is one of the policy that foods is national such as the kind of crime levels that are\n... just been describing no I think what a lot of people are seeing though is that that wasn't always the case that that you could make the connection but there's a clear connection between corruption\nAnd and the chaos of the ... security system in Brazil I'm really from Rio my home state is like the ground zero of corruption in Brazil\nAnd if you had the governor now former governor who is in prison and the scale of of corruption some being mind boggling\nYou got any can you'll policy hoped to reassure voters that it can tackle crime effectively if it is linked to Brazil's economic second stances and indeed the levels of corruption\nYes first I think we were talking to an international law dish so it's very important to explain that security and Brazil is ... by each state and by the federal government but having\nSaid that as the previous commentators or talking and I agree with them organized crime in Brazil was seen through borders between stay\nThere for one of the measures a dodge ... is a United security service that we work around the whole of Brazil the other kinds of that you both so narrow phrases policemen or people that use means of extra ... ways to kill\nMonica who does not have a defensible I think that a lot of it has to put in context right and uh\nFor example one thing that he complains that the ... nobody cares seems to care when police officers were killed and there is a real a ... by the police force that they are not being valued and that they're not being given\nDoesn't justify that's not the same as general this you're kidding I surely don't really know what are you sure what the sad is that between having a police officer cue than a criminal living in a situation of confrontation we just like how the point if you're in the U.S at such a way to\nThe Brazilian police cannot be compared with the police in the U.S nor the Brazilian society can be compared with\nThe American side of the level of violence and regime\nHas been extreme Brazil is a brute to countries let's make no mistake about that so I think it's completely an justifiable to praise extrajudicial killings ... also NATO has never been\nExplicit about that with ... with the id have and this is dangerous enough I guess it's like a lessening the dogs out\nUnconscious of the time that Marie don't just want to bring you in briefly to talk about if we made the ... to this election campaign and the role of social media just give us a sense of how it's been used\nI just before talking on the social media I think the levels of violence in Brazil like stream hundred and Seventy five homicides the days over sixty two sixty three thousand last year\nHaving said that I Would say there is absolutely never any justification to use extrajudicial killings also consider widespread gun ownership and gun carrying around of guns will only escalate the situation not to make a comma these sort of simplistic solutions\nAnd using the campaigns are coming in to your question using a campaign based on fear fear of what might happen and might even you have heard has happening to people you know is not the way to go around addressing what time ferry complex social issues\nBrazil is a country absolutely\nProgramming is supported by farmers markets of Minneapolis twenty nine markets open outdoors through October an indoor markets open throughout the winter you can visit farmers' markets of M. P. L. S. dot org for market times in locations\nTo take a short break but just to remind you that's just not what you think the program or any ideas the topics you'd like to look into the real story at BBC don't Kato ... is the email treat me at ... and if you enjoy the program as opposed cost you can subscribe to such will BBC the real story in your ... app\nDistribution of the b._b._c. World Service in the U.S has supported by corners offering cloud based workforce management solutions designed to help organizations of all types of SARS is reduced labor cost improve workforce productivity and minimize compliance risk ... dot com workforce innovation networks\nAnd ... on one test prep for the ISI T SAT and jewelry and G. math which designed to improve scores students can do it video lessons practiced questions and experts support at ... dot com\n[noise] [noise]\nThere is an oil boom in ... Texas it's one of the most competitive congressional districts in the country how politics are playing in the oil fields\nWhen he became a including his lead and then you end up homeless\nOnly remains it remains to be seen markets are my all picked by nature\nYou know but it's a it's a it's a signal that they're giving out again you know today if I can bring you and it it is that renewed\nAbout which makes it difficult for the PC well actually there is an anti globalization me not just in Brazil the old days of the wild and one which in which some many people are choosing perhaps to have a different view of the ...\nSupport comes from urban homework stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nA dodge who has a kind of a developmental is approach to the economy where this stage or to have a friend [noise] so what we have ever is is is lawless state versus states that will intervene in the economy to create jobs and to form and the economy more people have in jobs\nMarket we spend money and ... that there is in an economy\nFrom is that they don't start they don't know when to stop intervening right you have a development bank the largest development that has more credit than than World Bank\nAnd that they compete with the banking system rotting front that that's why you have all been dancing with no they can land they can't ... when he companies ... well established companies beginning loans like very low interest rates\nMorning at around ... you said that uh both in our makes very clear comments actually not for example initially they talk about getting a second stokes about privatization of state owned enterprises and then of course\nBoth so narrow immediately boats in and say oh yeah yeah yeah privatization box not metro bras not generations or the ... Ross Perot says almost on the brink of going for privatization is not going to be halted\nIt's all very conditioned\nMaybe ... ... talk has been liberal but I feel the practice when not to be liberal it will be interventionist ... because that's the way Brazil has developed let me just Brazil's development history lit hold on to those two quite distinct\nViews of which way the economy may go I wanted to come back to this idea of Brazil's relationship with its minute cheeks\nIt also has talked about traditional family values very tough on crime and so on there is a memory of course of Brazil's minutes dictatorship which is still rule knowing the repression that followed that there were hundreds of people would disappear do killed and many more were detained and tortured\nAnd I'm the St Louis pasta Nineteen Seventy nine which meant that when they public reckoning on trials about what had happened in those twenty or so years and today the majority of Brazil's votes as is about a hundred and forty seven million of them they didn't live through that but at the regime which came to an end in eighty five\nAnd you documentaries made in style tells the story of a dictatorship bureau women's president's op how the Suzanne ... is a film director and she explain more about the tower\n... left his song and that the deck of that they think about a decade it's a thing that\nThe child was a prison during the Nineteen sixties and seventies where hundreds of women were held because they went against the dictatorship of fighting for democracy prominent women like former president Dilma Rousseff were imprisoned\nThere were also university students sociologist historian doctors and they ended up that either because they believed in the armed struggle simply because they were handing out leaflets against the dictatorship in university the woman arrived in this prison after they'd been held admitted treaty attention\nWhere they've been to chit at least in the Taliban families knew where they were and they can visit to women\nIt's fair to say that I flunked the call last month calls those lovely follows a little more difficult for\nJust showing how the old two miniature dictatorship is being held in Brazil it isn't to fight against corruption a tool it's just militaristic took conservative schools\nWhich is frightening the women who were imprisoned in the town an old of us who have seen this before during the dictatorship Jay ... talks about ... cars and eliminating people who don't share his views\nSupport comes from urban homework stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban homework dot org backslash donate\nSaid they thought it was a possibility a soon ... this ignorance about what happened during the dictatorship\nFifty a set of silence about what happened that people who survive that period didn't want to talk about it and I think this is how we could have another dictatorship people ignorant and think that during that period there was older than president but that wasn't and I think that people think this because of the silent\nFilm director Susanna there are\nA Monica who does this one specific point I Want to pick up from from what she was on there I was saying that which feeds into Web Brazil is heading in democratic times it is that the specific point that ... when he voted to impeach Dilma Rousseff\nDedicated that vote to uh to ... that is an extraordinary things are unelected politician to do\nYeah I just want to see something I don't think that anybody who's voting for both of ... of the leadership regarding its record on on human rights\nAs growing up in Brazil I never until I was a Hitler was sixteen Seventeen years old I never thought that I never knew that I was living in a dictatorship\nRight because my family and my father was a a a salesman and he was a he used to say ah so the ... and my mother was a housewife\nThe and from for many the time of of those years in which you have a ... a dictatorship war years of ah the link those years as economic boom and security and I think that when people\nProgramming is supported by farmers markets of Minneapolis twenty nine markets open outdoors through October and indoor markets open throughout the winter you can visit farmers' markets of M. P. L. S. dot org for market times in locations\nRotation power too and now a days\nAh support for democracy in Brazil has never been higher ... in the ... the the democratization seeing him go do they do then feel confident if these memories are up of faded up not very powerful they re support democracy does Brazil have the institutions\nTo maintain is democracy even if there is indeed who is quite close to them in a tree\nIs astonishing actually because I was born in the age of seven so Brazil was already a democratic country and yes tools show that presidents have never supported a democracy so much as they do now\nBut also polls show that around half of the presidents of sheer it's a off a proximity of ... dictatorship and Brazil um if if I did read that ... it's very clear that the dictatorship was no on is that there was a lot of corruption there\nAnd violence and gave the violence has increased over the last few years but it the violence there was different as well as the kind of state violence where innocent people were killed dissent loss of brass are friendly but\nDoes does resume how does Brazil have the institutions to guard against a return to that kind of a way of life that kind of political life\nMean no absolutely sure if we if you take into consideration uh\nThe first day of the new president of the Supreme Court he he he he was talking about Nineteen sixty four as an advance rather than in a military coup and worry it's worrying also ... percent are is bringing a lot of people from the military too\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\nInstincts but I think a Brazilian institutions in society or strong enough to absorb the shark and protect democracy from deteriorating okay\nSo I Want to look at one of the very specific thing that's important not just in Brazil but beyond the country's borders\nAnd that is the face of the ... and the last four is a vital results in the battle against climate change and actually having a crucible of biodiversity\nThat giant both in our as promised to bring progress which one imagines would come in the form of ... mining agribusiness and to lift environmental laws on protection she can the nominee is anonymous and campaign coordinator for the environmental group Greenpeace she's based in Sao paolo ... an hour I represent a\n... for us he doesn't just represent extreme you write in South America he also can represent a final or a total destruction for the environment because he's contain traumas sounds like threats\nHe's saying that he's staking out Brazil out of the Paris climate agreement\nHe wants is staying most of a protected areas and indigenous lands\nMaking easy access or open large roads in the middle of the forest for timber industry and soy farmers he wants to merge the ministry of environment what the ministry agriculture\n... I\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com highly ... James cone [noise]\nGreat to have you with us this half hour the latest on the investigation into us into the pipe bomb sent a high profile critics of Donald Trump police say they're focusing their inquiry is on the state of Florida\nAre investigating all of this with great precision that can say with certainty that we will identifying the rest of the person or people responsible for these acts\nBut with the mid term elections just over a week away is there any chance that close to tone down the debate will be heated\nThat we'll hear from a friend of the murdered Saudi ... he gives us some insight into what life is like for Saudi dissidents sports ... he used to tell me up when you start to this person that I just will be [noise]\n\nLive from NPR News in Washington ... Stevens a caravan of Central American migrants continues to move slowly through southern Mexico on route to the United states NPR's Carrie Kahn reports that the size of the care of on appears to be decreasing although thousands remain in the group\nThe line of migrants stretch more than a mile on the highway north out of the town of methods to ... thousand spent the night and the town's main plaza\nThe group was headed to the next town some twenty five miles away earlier in the week the United nations estimated the group at about seven thousand people in the Mexican government has said the numbers are significantly smaller according to Mexico's interior on Foreign Relations department more than Seventeen hundred people have left\nSupport comes from urban homework stable homes off for a long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate border Carrie Kahn NPR News\nMexico City defense secretary Jim Mattis assigned in order to send eight hundred active duty or reserve soldiers to the southern us border\nThe department of homeland security requested military police and engineers do a border patrol agents ahead of the arrival of the migrant caravan as NPR's Tom Bowman reports the troops will play a limited role in the region\nUnder law pause you call it taught US law the troops are not supposed to get involved in law enforcement they can provide support functions are engineers military police pilots they're going to be building camps apparently for border patrol but are not getting involved in any kind of law enforcement that'll\nNPR's Tom Bowman the largest NATO exercises in more than a decade have opened in Norway as NPR's Frank Langfitt reports the exercise is called Tritan juncture Eighteen includes two hundred and fifty aircraft and fifty thousand person now\nOfficials say the exercise are designed to show NATO's deterrence inability to defend against any attack from any direction they're also designed to improve interrupt her ability among NATO member countries which became point of emphasis after Russia annexed Crimea in two thousand and fourteen\nPresident Trump has repeatedly criticized NATO member countries for not paying their fair share on defense but the U.S will play a prominent role in these exercises which will feature a U.S aircraft carrier strike group\nThe north Atlantic Treaty Organization was established during the Cold War to deter the Soviet Union and gain new relevance after the invasion of Crimea Russia called Tritan juncture irresponsible and said it would inevitably destabilize the military and political situation in the north\nSupport comes from urban homework stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nMalaysia's former prime minister Najib Ross sock and a former treasury officials that each pleaded not guilty to six counts the criminal breach of trust as Michael Sullivan reports ... was already facing thirty two counts of corruption and other charges involving missing funds from a state owned development company\nIn a crack down on corruption that shows no sign of ending the jeep and his former treasury secretary general you're ones that are doing the work used by the prosecution of improperly using funds meant for the Kuala Lumpur airport and another fund used to help the poor both men pleaded not guilty\nThe gene is already facing more than thirty charges a money laundering graft and breach of trust involving money diverted from these so called one empty beef steak development fund\nThe U.S Justice Department says more than four point five billion dollars worth siphoned from that fund and then nearly seven hundred million found its way into the jeeps personal back it goes\nThe corruption scandal involving one empty be helped lead to the surprise defeat the ... ruling coalition in the ... general election for NPR News I'm Michael Sullivan in Chiang Rai Thailand\nAfraid December twenty eight Seventeen Seventy four edition of the Pennsylvania journal and weekly advertiser with its iconic unite or die snake design on the mast head has been found among items donated to a goodwill center in Camden county New Jersey as first reported by the online news site in Jay pen\nTo paper both three items signed by John Hancock then head of the potential Congress pleading for the colonies to fight against enemies trying to divide them\nThis is NPR News in Washington supports\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\n[noise]\nOther than that and you have everybody welcomed news station of ... and James ...\nGreat to have you with is the United states Saudi Arabia and Russia the heart of our top stories and the next half hour\nYeah and if you stay with us till the end you're in for real musical treat as we talked to ... to Gambia singer and co replace performing as an African cultural festival here in London she gave us the taste of what you play [noise]\nWe start this half hour and the United states where investigations are under way into the suspected packages melt the top Democrats including the former president Barack Obama and presidential candidate Hillary Clinton the police have searched postal sorting office near Miami in Florida we're authorities believe several of the devices may have been processed\nSpeaking at a news conference the NY police commissioner James O'Neill said the perpetrators would not escape justice\nWere investigating all of this with great precision\nThat can say with certainty that we will identify interested person or people responsible for these acts make no mistake New York city's intelligence and counterterrorism terms and capabilities are striking it on\nSuspicious packages were intercepted on Thursday when was addressed to the full but democratic vice president Joe Biden in ... states\nAnd another was sent to a new restaurant owned by the actor Robert Deniro both have been fiercely critical of President Trump he has rejected suggestions that he might be in any way responsible for inflaming political life in America and it's cool for most civility\nSupport comes from urban whom works stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable undignified homes for everyone urban homework dot org backslash donate\n[noise] country like ours into a lot of Republicans as well as Democrats enough is enough let's disagree on health care in this song is personal attacks\nMostly due to the u._s. security analyst when the conservative think tank the Heritage Foundation how seriously does he think we should be taking the attempted attacks\nWell we don't know for sure yet ah first of all we're not sure if these things where ever really intended to hurt anybody or are they you know just some kind of hoax or political theater\nWith a new commission or the new police commissioner saying he said you know taking it as\nWell as I say we don't know yet but there are a lot of experts who are looking at these things I I don't know if they touch them or not that are saying look those those timers\nDon't have an alarm settings so they they couldn't be used to detonate a bomb or they don't wires you're going in and out of both and which is not the way you make a bomb\nSo even if the person intended to hurt somebody there you know they like they failed to read the instructions on the Internet properly\nBut that said regardless of their intent\nYou know this is a serious thing you don't send stuff like that through the mail to people particularly prominent people you get away with it so I think our law enforcement are probably closing in very quickly which whoever did this\nWe'll soon you know for sure what their intent was and what your motivation was as we wait for the precise\nIt to give intelligence agencies in many different countries information about the workings of Russian spy [noise]\n\nSoldiers have told me prompt was a hub for Russian Spies operating aggressively not just in the Czech Republic\nBut in other parts of Europe Yucca gender of the European values think tank in Prague is an intelligence expert\nGiven the track record of history strip all I could imagine that he will be very valuable I looked above a letter that would be any more but the interesting defector us right now and they had Sylvester intelligence [noise]\nThe good schools told me it's like the ... was also a spy check intelligence officers for names of Russian Spies of racing in the country [noise]\nHundred ... a senior general specializing in intelligence believes ... still had relevance information\nIt was working in a high level position where he has to have the knowledge about some of the guys from GR who who are all over the euro for\nHe would've known names exactly what they would most likely he that he had the information the halls of the guys who are still working for a G auto\nCorrect in St Paul did uncover Russian agents that could've been a motive for Moscow to try to kill him\nBut it will play source told me of another potential reason\n... check intelligence officers in twenty twelve they discussed Russian organized crime and it's alleged links with Russian intelligence agencies\nSupport comes from urban home works stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nFood Russian mafia figures\nOn ... at least once\nIf it wants to discuss Russian organized crime with Spanish intelligence\nThere'd be a parallel with another former Russian spy addicts onto the anchor who worked for him I fix this funny secret services on the issue with murder before he could give evidence to Spanish prosecutors and under the waiter has written extensively about the Spanish secret services\nThey've named ... ... cases are almost identical\nLives in ... the British just punish another Secret Service has some enemy of the Russian government and they decide to silence him he's a story is repeated with this creep up that exact same thing happens Richard ... reporting [noise]\n\nHere in the cage black history month ... across the country on Saturday at London's famous Trafalgar Square Africa is coming to ten nobody music food entertainment at a parade and with a bit of luck I'll be in the crowd\nAlong the artists other than James couple of course a lot of needs to\nBe performing at the event will be the economy and musician ... she's the world's first female professional Cora player and a toy is the difficult Mart multi string instruments used extensively in West African music she's also the founder of the NBA Academy of music and culture she's been talking to news stays island decision\n\nAnyone\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\nCalled ... which is one of those most famous history [noise] wait a forcible can we just start by saying who do smoke from the cultural for you to play the courtrooms [noise]\nYeah it's it's culturally a male instrument and mailed tradition it always has been um it dates back over seven hundred years [noise] um so it's a new thing uh for women to play this profession any um and uh it's as they often say it's a news story that's being unfolded at the moment\nI Wonder why are you as well as being a belt to me to do this\nBecause the tradition is rooted in um the cultural values of a gender so um for example just to talk very briefly about the the dating back to a time when\nYou know pre we talking the first the first century um when society we're relying on hunting for a dumb music is always related to the function that it that he played so the hunters were males\nLater when he started to build empires and mighty empire they worry it's so these are all into the ... of the males so the instrumental tradition has remained man\nAnd then suddenly you know people are on the\nBox is coming up\nWas to Portland for you to\nTo do she actually wasn't my intention I'm I was born into agree or find many families out if I'm it's\nSupport for Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com they\nTaught me how to wear my brother my brother and my grandmother efficiently no because what are you the foster family too because [noise]\nThere was no way to know that I was going to proceed to the tradition as a professional um\nAnd like I said something that I actually went away from for many years and and not until I was Seventeen did actually decide to come back to to do it but I'm I'm looking for fame and fortune I have a lot more different motivations behind you there's\nA the motivations for me is actually my own social and cultural development in the country and sort of platform\nThat music allowed to give me is what enables me to channel that sensitized Asian and effort into the sea back\nHome and become ... through ... to be with a lot so many more [noise] you know we saw the ad will join a gym is at right\nNow you have a new government please I wanted to use it to the social political evolution to go do something\nIt's still has a very important role because there have been thirty we always have been very much for the power in the country that has been infected as we'd like to do to\n'em but there's still a lot to be done in terms of the enemy of the music industry would have to say what I really have run for for now two years or four young men and up to Eighteen again a grown very fast so now we are actually on the special forces you to be cutting in the\nSupport comes from urban home works stable homes offer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nOne of the biggest challenges in modern medicine that scientists have created a new type of antibiotics that could help we speak to one of them\nOn an island in Hawaii has disappeared entirely oh how much is a climate change is possible in the what happens to be endangered species that have become reliant on this front John habitats and\nWhat should be the ethics of driverless cars well it depends on where you live in the ... coming up uh to to not be a steep\n[noise] something to listen out for I Try to imagine driverless cars in Cairo\n[laughter] and I just feel horrible and it'll be good to be good to meet an absolute locked out you know like not to know endless cars happening that computer systems overheat chicken blowing up we dated literally ... thank\nYou so much a world uptick coming up with Jillian Marshall and Ninety minutes time it's a good fight for me and at James here at on Newsday and we'll leave you with some of some more music or the other [noise]\n[noise]\nDistribution of the b._b._c. World Service in the United states is made possible by American public media producer and distributor of award winning posts\nAmerican public media with support from ... a meal press service delivering fresh dinner kids that are table ready in Fifteen minutes gobbled does the prep work so you spend less time shopping and more time with family learn more and Donald dot com slash BBC [noise] [noise]\n[noise] there is an oil boom in ... Texas it's in one of the most competitive congressional districts in the country how politics are playing in the oil fields\nThen she comes home with the children come spark from school in about three and then she goes back again to the restroom at five and then she comes back went out with the finished the so it was\nIncredible woman you were all laughing when ... was saying that he wasn't allowed in the kitchen wasn't allowed to help with the ... is this the 'cause you'll input isn't really welcome when it comes to how the ...\nActually tasted because I Would have still the best thing about being married to a chef is getting to taste all the same age sound\nWhen she started I Would give her a lot of advice or opinion but that I don't think she she's quite defensive\n... a nice job yet is so I got it after\nA year [laughter] I kinda like um I enjoyed it and I tell her what I Love and then I tell just tell her what I think it might be better in another way but that's only my opinion and I don't force it really hard\nThat has he developed ways of being very tactful when it comes to comes said what kind of strategy when you've been dating to their homes\nProgramming is supported by near or a new kind of precision pain clinics that pinpoints paying at the source dialing down the need for opioids while dialing up the patients long term health and wellbeing nearer clinics dot com\nThat from ... tasting horn [laughter]\nSo yeah I'll I'll put my ideas three somebody else sometimes\nYeah I think they're really really clear about what they're doing yeah times may tells me that she she just wants someone to listen and kind of support be there for her yeah\nAt home me and my daughter like a real good would've freed bar but again this um she's looking for us She's looking for customers that's what she ... she has to make what the cost most won't I think in the end of the ...\nDown the line he gets as well I think that there's a lot more people involved and tasting the food so a dish that we might change\nWill take good six months to get ... the restaurant it's not like today ah we've got the whole will stick it on there is none of that not only is it just about the customers it's about getting it right every single time\nIt was very difficult with Indian food because you have to go to the balance right through the spices and the parents here you're introduced spices and the dishwasher start middle and then so you have to do a lot of practice to Maine jak the consistency ride taste right every time you do it\nAnd when it comes to cooking as high and and your partner's just sick of this at the end of the day when it when it's the weekend when they have a day off and they came to get in the kitchen you know would you take I that Beth\nI cook in the kitchen to survive I Know how to cook a but Tom current help himself cooking and it can't help himself\nSaid laying and ... doing extra bit some bumps so ... it's out today and they ... as he could find value\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learn more at your age are go dot com\nKind of really into cooking for you then not [noise] do you think you are less good cook\nI think I'm a little bit brave a book because then all that all the time to kind of a nice treat when they do it's not like he's in that little time pushing everyone out he knows what he's doing but he had any shops one meal [noise]\nSo I'm I'm the keep it going all week pass and cooking from a baby bully and and it doesn't spoil it smell like Scott nice kitchen\nWhat about you ... do you cook at home or does rainy come home and and they some cooking\n[laughter] we don't have any hard and fast rules whoever is home cooks so or whoever's home or not tired [laughter] that's all [laughter]\nAbout you Sam do you do much cooking\n[noise] so when we have family gathering or friends gathering may is willing to call for everyone\nIn daily life actually I Do cook for myself but very very basic because she comes home very late but if we have leisure time during we can we do enjoy like\nA very nice date night at home and then she will call for me because I Would spend three hours\nTo cope a really nice steak salad but she only take like thirty minutes so I was like I'm I give up so you do it I remember\nIn the early days I started trying really hard and doing the cooking thing when he came home from work and even when he when you've been eating nice food all day when picky so\nWhat what do they eat yeah when they were heading chefs half guilty passion is\nSupport for NPR's brought you by the law firm of ... intellectual property group with offices in Minnesota in Los Angeles Inskeep IP Group aims to help companies leverage the power of patents to protect their innovation you didn't find out more at ... dot com\nFrom scratch lovingly refer to achieve all telling me to make up or\nDo you make it for her like ... you know like she's almost coming home and your your ... home when ten minutes [laughter] ...\nYeah I'm so tired I don't want to come home and do anything she didn't say oh can you please put it on the political going for me or [laughter]\nIt sounds like a three if you give you a pot and as an incredible amount of support to neighboring state of sorts of what they do I mean ... you actually put your career is very successful scouts or on the side to help tonight than some of these restaurants at break that was I had lost a few years but lost it many more\nOr you know you had three and I did begin to make was get after about three is a there were lots of sculptures and in the back offices and things that haven't been cost yet because we couldn't afford it uh but yeah support with massive with especially at the beginning we had very little money and very little time\nAnd I was in front of house ball I'm an architect\nOr accountant all job lady I wanted him to just be able to cook\nUm why why do you give up your writing career goals for awhile to help him with has what was your mind\nFind it quite difficult to create if I have an untidy droll untold was my own time this rule\nAnd that and also his motivation was to help me make on compromise though so I didn't have to worry particularly if mortgage had been paid all the electricity bill or anything I could just carry on making gripes\nMine would come later it was an investment as time and I didn't feel like it was giving up because I think the the more things that you do in your life is going to give you move store in narrative to your book\nWhen you was supporting tell them to she becomes such a successful chef did you feel you were doing some saying notable tape by enabling someone to produce such good said did you was that pilots have you on my station that you believed him or he was doing\nI was just supporting I didn't think he'd be that good I Know I didn't feel like there's been no but we were just digging in scope Tuesday again you know we we clean the window who needs cleaning well shall we need to show that was what we do\nSam if you are listening to the best described all the help and support that she gave telling you to saying well we do you relate to that because you yourself gave up your own job to help ... all\nI Need to quit my job to be a freelance to support myself in order to help her to open the first restaurant and I got to do my freelance work from nine AM to like\nEight PM so finishing all my work and that our house to help her out to do the branding and everything like brings storming\nMaybe until two AM so continuously for six months incredible ones\nIs crazy that time was crazy and then when she ... her restaurant just opened like I finished my work is six PM and then I go to the restaurant as a reception and a server and working due to am I think that happened continues for six months\nFor me I think that's incredibly good experience because if I don't experience that I don't understand what she was doing\nA show of they do\nSupport for NPR's brought you by the law firm of Inskeep intellectual property grip with offices in Minnesota and Los Angeles Inskeep IP Group aims to help companies leverage the power of patents to protect their innovation you didn't find out more at ... dot com female Indian chef sinus on the u._k. restaurants saying doesn't say\nWe put all our money in the restaurants we haven't ... behind those and they were just a passion both of us to make good Indian food and uh so it's not for the money you're doing it I think definitely domino doing for the money I think the most thing is the children Mr mom\nSo she's only there and the being so what we've done like last year we sat down and decided that really would open three days a week now\nShe got a lot of media work outside the restaurant she has to travel a lot as well so she wanted to spend more time with the children and so we go to restaurant children and me so we\nSupport for Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com [noise]\nAnd I knew and hair each week we recommend great to see in the theater and those does get also the movie screen at home it's only you can podcast why so we want to devices you\nWait till next month to get the results of last Sunday's parliamentary election but in one sense the verdict is already in the ballot again exposed widespread insecurity and the actions of government control\nIn many parts of the country my guest today is president Ashraf Ghani has recently appointed and strikingly young national security advisor ...\nThis is our country if it does not winnable we have no other option we are in this country and we have to live our lives\nAnd protect ourselves while I'm I Do not want to comment on a on colleagues from previous government um they have their own opinion what I can say to you or is this is that changed country as a result of your investment\nThat's how we do a lot more have you on TALK after the news\nLive from NPR News in Washington I'm ... and\nInvestigators are searching for ... Santa motive for the bomb threats targeting critics of President Trump and CNN\nToo suspicious packages intended for Joe Biden were intercepted before reaching the former vice president on Wednesday as might Desmond reports Biden gave his speech on American values yesterday during a campaign stop near buffalo\nSpoke to the same forum at the state University of buffalo where President Obama spoke while he was in office\nThe five hundred cheered him as he called for politicians to rethink what's going on in in division in a series of attacks on President Trump without ever naming the President Biden told the audience reporters aren't enemies of the people in immigrants are not animals\nLoose divisions this hatred [noise]\nWords measure Biden spoke today after conservative firebrand Steve Bannon delivered a slashing attack on Democrats and defended the president in another buffalo suburb for NPR News I'm Mike does room in Buffalo\nNew analysis from the Centers for Disease Control and prevention finds that fewer than forty percent of adults in the United states got a flu shot last year as NPR's Allison Aubrey reports it's a significant decline compared to prior years and may help explain why last year's flu season was so deadly\nA flu shot is the primary way to prevent sickness and that caused by the flu and the CDC recommends that everyone six months and older get vaccinated annually but last year the flu vaccination rate among adults with just thirty seven percent\nThis was a significant drop from the previous year what about forty three percent of adults got a flu shot\nPeople sixty five and older who are most at risk were more likely to get a flu shot but experts say the low rate of vaccination overall may help explain last winter it's severe flu season almost a million people were hospitalized with flu and nearly eighty thousand people died from flu related illness\nAllison Aubrey NPR News\nNone of the Asian Americans claiming they were unfairly denied admission to Harvard because of race will testify at trial W GBH is Kirk Carapezza reports that the plane to sort of building their case around statistics\nGood got 'em as Peter or city ... reviewed Harvard admissions database antiquated the college discriminates against it\nSupport for NPR's brought you by the law firm of ... intellectual property group with offices in Minnesota in Los Angeles Inskeep IP Group aims to help companies leverage the power of patents to protect their innovation you didn't find out more at ... dot\nCom and if the college could not consider race in admissions it would result in fewer black and Latino students being admitted for NPR News I'm Kirk Carapezza in Boston\nThis is NPR News\nAfter two weeks of walking thousands of migrants from Central America are still heading toward the United states President Trump is threatening to send eight hundred soldiers to the U.S southern border to deal with what he calls a national emergency\nTrump says the migrants who were fleeing violence poverty and corruption at home must be stopped from entering the U.S human rights groups say the micro caravan\nIs still in southern Mexico about a thousand miles south of ... gallon Texas\nUs agriculture secretary Sonny Perdue says finding new markets for crops and livestock is a way to respond to Chinese tariffs South Dakota Public Broadcasting's Jeremy ... reports that trade was a key issue during produced trip to the Sioux Falls area yesterday\nSecretary Purdue Jordan ethanol plant and later spoke with agricultural in livestock producers at a farm outside Sioux Falls produce says he has a USDA undersecretary for trade dedicated to opening up additional opportunities for farmers beyond China\nThat's where the folks Japan South Korea Mexico Canada Thailand Malaysia those going to go through that we need to sell more products\nAfter the Trump Administration levy tariffs on Chinese steel and aluminum China responded with tariffs on soybeans pork products in a variety of other goods or do was accompanied by members of the state's congressional delegation during his visit for NPR News I'm Jeremy would have been incest\nMostly lowered down one percent in Hong Kong following games on Wall street I'm chase Stevens NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include American Jewish World Service working together for more than Thirty years to build them more just an equitable world learn more AJ W. S. dot ORG and the listeners who support this NPR station\nWelcome to hard to overcome the b._b._c. World Service with me Stephen ... Afghanistan just held its the parliamentary elections since the Taliban\nRegime was toppled in two thousand and one the poll exposed oily recovering problems of insecurity the dome the country in the years since\nDozens of security personnel were killed hundreds wounded and in some areas voting simply didn't happen as the Taliban attempted to ... Afghans away from polling stations nonetheless millions didn't to announce on results will be declared next month\nThe government of president Ashraf Ghani is likely to hail approach that says evidence of progress on the road to stability\nBut we all the rhetoric want as reality look like the Taliban operate with impunity in swayed ... the national security forces are short on numbers and morale corruption as well as the insurgency undermined the authority of the state\nWell my guess is President Ghani is recently appointed national security advisor ... formally Afghanistan's ambassador in the U.S\nA technocrat with little previous security experience is the Afghan government really in a position to shape the future of the country well I'm dilemma he joins me now on the line from Kabul welcome\nProgramming is supported by near a a new kind of precision pain clinic that pinpoints paying at the source dialing down the need for opioids while dialing up the patients long term health and wellbeing nearer clinics dot com\nIs because of insecurity and the lack of government control of key parts of your territory like Bruce Lee explorers everything that is currently wrong with Afghanistan and its politics\nThere were multiple threats by the Taliban are and there is precedents of attacks on polling stations the African people defied all of that in came out to vote I think that speaks for itself on what the Afghan people's verdict on democracy is and what it is that they want in their life\nThis was the first election that was completely organized by the Afghan government and security provided by the end the s F\nA I think they did a tremendous need a good job compared to what we had in the past\nUm even from the number of attacks that that ... that were um launched on on the election day in two thousand fourteen when we had\nForeign security assistance and the elections or had a lot of support from the international community ah we're much larger scale than we had this year let's\nLook at reality I Do not mean to belittle the bravery of those\nThree or ... million Afghans who didn't go to the polls in face of Taliban threats I Do not belittle that bravery for one second but here's the reality your own electoral commission and\nSay that at least a quarter of polling stations across the country didn't open because of security concerns we know the whole swaths of territory including Kandahar and the guy's name a that was no voting because of security concerns of course there maybe some\nSupport comes from urban whom works stable home suffer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nBecause I knew was one of the reasons I accepted into this job it hurt me personally as an African to know that we failed our security forces from a policy standpoint and I'm dedicated me and the and the national Security Council will be working to resolve all of those issues\nI issued a statement our people our security forces that what I Would be doing is to reflect their voices in our policies it's true we haven't been able to deliver the kind of services that our soldiers in on the front line deserve they have not failed us\nBut I Want to make sure that we also do not failed and when it comes to policies and ... that that protect their lives and their families\nKnow what I'm mindful of mindful of something that Hamid Karzai's former president said as he was leaving office it was something that deeply upset many people are in the west in NATO particularly family members of those who lost their lives because he said this he said\nThe NATO exercise all of its operations in Afghanistan have been ones that have caused Afghanistan a lot of suffering and loss of life\nI Know gains because our country is not secure he said that of NATO's operations and of course\nThe operations costs more than two thousand American lives more than four hundred and forty British lives one could almost say the same thing today to Afghan veterans the families of those who lost their lives in uniform serving\nSupport comes from urban whom works stable home suffer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nOr country if it does not winnable we have no other option we are in this country and we have to live our lives\nAnd protect ourselves while I'm I Do not want to comment on a on colleagues from previous government\nUm they have their own opinion what I can say to you or is this is a changed country as a result of your investment in those are fewer and fewer than one of the reason I came on this show\nIs to tell you and and your viewers that this is not the Afghanistan that you only see it through TV there is so much more to that context I understand that there is only so much news\nA space for a run a son and it's usually covered by the spectacular events which are unfortunate\nBut this is a transform country whether you look at it\nPhysically or you look at it socially I'm I ... a generation Seventy five percent of this country ah grew up in the war\nOr our aspirations are to end this conflict and bring peace to understand where extremely proud of our country and what we have but we also realize that the challenges that we ... we face are also hours we're thankful that we get support from our allies\nOr to help us along that way and know that your investment in this country has not gone to waste yeah that's where a war it's not an easy it's not a war that we have brought upon ourselves it's a war that we must end\nA and it takes a it it it takes more than just a statements to be able to uh to end it there are we are taking measures every day\nSupport comes from urban home works stable home suffer long term positive effects on families consider joining the stability makers a group of donors who believe in the power of equitable and dignified homes for everyone urban home works dot org backslash donate\nThe United states and of course you a former ambassador to the United states on behalf of Afghanistan or let me ask you this\nDonald Trump has said of course that he will keep troops in Afghanistan advise and training fourteen thousand of them but he clearly wants to end this conflict in America's commitment to it as\nQuickly as possible one thing mood in America is privatizing\nThe U.S military commitment in Afghanistan I spoke recently so Eric friends for many of the head of Blackwater who wants to get a piece of that action how would you feel if the Americans offered you instead of the U.S military privatized contracted force\nWe have a decision by the national Security Council and we should a statement this and we will not allow a business is to ah to make to to turn our war into profit\nA it's an honorable cause we're proud of our partnership with our allies we're fighting terrorism a and counter insurgency in this country and and that's not for profit\nA second and more important point about the diplomacy right now\nIt turns out that in October I Believe October the twelve Donald Trump's Afghan and why his own life ...\nHe had talks with senior Taliban officials yes or no did you know that those talks were taking place at the time we told beforehand\nKnew he had talks there Steven ... this I Want to clarify there is a lot of confusion about\nProgramming is supported by near or a new kind of precision pain clinic that pinpoints paying at the source dialing down the need for opioids while dialing up the patients long term health and wellbeing nearer clinics dot com\nOn peace and security we are also had the initiative on the ceasefire where where\nDo you and all and all of us because we have no idea I don't think it was made a straight on said who are very important question 'cause it's about who really is driving efforts to engage the Taliban right now the New York times reports that sources saying quote\nFills that I had these meetings with uh the officials from the Taliban\nJust uh he flew to the Gulf states have ... he quietly met them on Ashraf Ghani your president your boss and his government heard of that meeting only afterwards through news reports is that true or not\nAre you asking me a question that you just one confirmation for or or what is going on it's a lot more detailed than what you see in a news report adjust because few words were not said in a meeting doesn't mean that was intention behind a hiding that it was a quick meeting a and a ...\nI didn't know he has to be very exhausted from his trip you didn't want to be clear then I think you've cleared it up first you didn't know who the ... the special envoy was talking to the Taliban\nAnd it just strikes me that the signals we're getting right now is that the Americans have decided that far from this position in the past where the Afghan government always says we must own\nAny political process with the Taliban now the Americans seemed to be saying no we're going to engage with the Taliban ourselves\nYou you cannot have one incident\nSupport from Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learned more ed E. H. R. go dot com\nMust own and drive the peace process Africans do own and drive the peace process and that's the only way for its success\nIt's not that we we want the ownership just for the sake of ownership we think that without it there will be no peace in Afghanistan and it would be ashamed that all your investment in our and mess investment in sacrifices go to waste\nI'm are asked by a ... through a process where I don't that process and it's very clear\nOur final thought we've discussed and you've been quite Frank about the degree to which the Taliban has a ... a real presence on the ground in many parts of Afghanistan but what would it take\nMuch to national security advisor for you to formally recognize the Taliban's right to a stake in the governance of your country what would it take\nWell where the Taliban contend elections there more than welcome to participate and see that the Afghan people want that process despite their threats\nThey participated in elections if the Taliban really feel that they have a place in Africa and society other than driving fear into them then they must come and content and see where whether the Afghan people really vote for them or not\nThey they can only be a force of military force that um that drives fear can they provide governance and and the Afghan people accept can only be known if they participate in a in in in a democratic process and let the African people choose\nHandler my we have to end it there but I Do thank you very much for joining me on\nSupport for Minnesota Public radio comes from the ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learn more at E. H. R. go dot com\nAnd buy for X. dot com empowering traders to seize opportunities and currency market since Nineteen Ninety nine for X. dot com it's your World Trade it for X trading involve significant risk of Las\n\n... there is an oil boom in ... Texas it's one of the most competitive congressional district in the country how politics are playing in the oil fields\nSo the Nineteen Ninety eight Good Friday agreement the peace process data that was signed has given Northern Ireland a degree of stability prior to that was in decades of conflict thousands of murders and bones and people were fair to just the troubles which\nDoesn't seem adequate enough to me it's part of the good friday agreement the British Army would have been on the streets of Northern Ireland there would've been checks on roads and people being stopped in their cars and\nI'm with a peace day not fell away and essentially for the last Twenty years we've enjoyed what everybody refers to as an invisible border\nSo people can come and go without any restriction Reno without having to show documents and the idea that you might go back to there being any sort of the it presents or a military presence or anything like that along the border as if the concern to people\nPeople took the risk of violence returning if there is able to we established between the Irish republican all of the night and it's a real\nThreat I think that it is you know when people talk about a return to the trouble is I don't think about three list\nSupport for Minnesota Public radio comes from ... H R go healthcare education software with diverse unrealistic patient care simulations to teach human centered use of technology and healthcare learn more at ... H R go dot\nCom in Northern Ireland the chief constable George Hamilton said is\nThat if there was any sort of border infrastructure or people in those people that are ... and all that work would become a target\nThan it is the police Judy to defend people who are being targeted says if the police then arrive at the border then they become a target as well so\nThe play service here how serious concerns about ... a new day hard border breaks it would mean from a security point of view if all that people in ... would actually like to see the ball to come back\nWell everybody says you know political parties in Northern Ireland devote persuasion is old say that they don't want to be a hard border but I think that people are suspicious that some people might actually want to see a hard border because\nUnionism view is that north and on and can be treated any differently to the rest of the case was in the future if there was any trade deals that\nThe Northern Ireland wouldn't be excluded from that whereas the majority of the party's view the boxed off as sort of the best of both worlds I was speaking to some business leaders over the last few days and\nThey said to me you know we've called her head in her hands because we're being offered this opportunity to have this sort of best of both worlds arrangement on it's not being accepted\nHow much of a discussion topic is for people on the day to day basis in way you are and ... this is something that you know most people are talking about a lot of the time\nIt's something that everybody's talking about a day in day or walk ... that has done is put the issue of the constitutional position high up onto the agenda where maybe it hadn't pain in the past the peace they'd had sort of felt the constitutional position whereas now I with Brexit\nOr is she unity and away The Waltons on the agenda beforehand so it's interesting that union is feeding the ... will strength and northern Ireland's union with Britain whereas people who would never have been talking about the idea of Northern Ireland and the republic of Ireland\nBecoming one that they're not talking about that as a serious consideration and some people who would actually have a ... when the British union aside if things are now starting to soften up to the idea so it's a very interesting set of circumstances and certainly it's something that's been discussed on a daily basis you know every radio show every\nTV show every talk show every polling older by these questions Milwaukee one for the future of Northern Ireland you know how do you feel it but\nThe idea of Irish unity\nWere in the middle of this big storm and everybody's looking at us not least because we're going to be the border between you and the u._k. but also in the context of the D. U. P. propping up Theresa May's government and have enough control at Westminster where\nTheir views have to be considered seriously by the British Government in a way that they've never had to do before\nThat was freelance journalist Amanda focused and talking to my colleague man what a subtle ... you're listening to business daily and today we're exploring the issue that could and Britain's Brexit negotiations the Irish border all\nIts history of division explains why the ... has become such a sticking point for the Brexit negotiations that's an old two parents and the British Parliament this week wet pro breakfast and piece from the British prime minister his own party have been threatening to try and asked to\nThat has been lurid talk of a political assassination of ... with Theresa May entry ... anonymous sources have called the killings on\nShe survived so far but the border issue remains so how might it be resolved if indeed it ever is I'm joined\n... and now it's been a tough week for two reasons maybe you could say that most ... can you know how she fed this\nWay he you're absolutely right you could say that most weeks and I think there's ... on one level she has some good day some bad days in some suffering ... relationship with her I can only describe it as a ... divided conservative policy\nBut I think what doesn't change is the big picture which really does look around the grim and challenging for her and that is\nHow enough to she got a deal about Britain's withdrawal and future relationship with your that somehow satisfies yes that fee brawl divided conservative policy which doesn't want any businesses in the u._k. too much which doesn't put a Boulder Northern Ireland and and and if that was enough which satisfies the e twenty seven\nSo I'll be laid out a complex set of conditions that needs to be felt that all the different policies that needs to be satisfied but I actually the parameters of pass a fairly clear on because Europe has kind of pretty much light down you know what it needs to see how can it\nBe you're absolutely right and I think in many ways that's why we are in the horrible fix that that we are in that if you like\nThere's a contradiction in the ... projects among the EU is prepared to offer I mean if we're really going to strip it back to basics Justin and if you\nIf you think about it what what was what was leave all about it was taking back and I quote control of a bull has a ... ... and um money well it's quite tricky to figure out how you do that and have friction less trade with the European Union and not have a bold and Northern Ireland\nUnless of course the European Union was to say guess what you can actually have a ... do you kind of something special we will recognize British rules and regulations\nAs in hot equivalent ... and that is why we are in the fix that we're in the basically Britain has been saying we'd like everything that we used to like about a thing as a you none of the things that we didn't like it\nSo what we're seeing is the ... middle of a negotiation about how much they says brinkmanship how much that is both sides kind of holding out for the best they can possibly get how much compromise can you do you think it's possible within their positions of the two policies\nI think some of it as brinkmanship I don't think that a you feels like compromising very much cause that things will hang on a minute you know the people who voted to leave it you'll mess\nYou clear it up and clearly Theresa May hasn't got very much room for compromise given those are much mentioned divisions\nAnd our policy so I guess what's going to happen as if I had so rarely if someone put a gun to my head was to say that that will be maybe they'll scrape together with Dale but one that\nPuts off all those issues that we've been talking about just the more the exactly will the future relationship\nBe won't will happen with trade what will happen precisely ... about the ball just so they sort of settle on making sure that there is in chaos next march march of next year when Britain leaves the European Union but all those issues who's going to compromise how is the future relationship gonna what\nThat'll get sort of kicked in and that transition period between next march and the end of twenty twenty\nBullets and if they can't agree you know if that is struggling to agree just on the divorce agreement just on this withdrawal agreement then how life is it that that will come to a final sacrament they'll come to the the we get enough compromise between the two parties to come to a settlement that there'll be able to actually\nFind some kind of a deal for breakfast\nA fantastic question and of course it's it's one in a way\nWhen when you ask is what drives Brexit if people are already in use yesterday about Brecht said crazy they hang on a minute that that this these talks transition could go on forever and ever but it also both those people who would have preferred to remain in the European Union saint who think this this just looks like a recipe for kind of\nChaos and disaster Britain's soles of in the European Union but ... ...\nSo have a long long procession pleases neither remain as an all leave us\nOkay let's just go back to the issue that these programs about the Irish border that's struggling to a great for the withdrawal agreement for this divorce agreement how are they going to come to a Sacramento and the longest I bought my assessment of the border look like who's likely to compromise look\nIt's an immensely difficult question just kind of cost some really smart people have been looking at it for two years and of course\nYou know that the reason there's nowhere in the world whether it's notable the mother to country song and the customs union so in a way that even the u._k. are trying to do the impossible I suspect\nThe compromise in the short term and it will only be able to show some will be that the whole of the u._k. would have to stay on the customs union until a future relationship is works out with Maine no native would be such a close trading relationship that would be no need for both Raul absolutely no sign\nThat was Rob Watson the BBC's Westminster correspondent and Rob we'll be back to help guide us through", "year": "2018", "show_name": "BBC World Service", "city": "Rochester", "day": "26"}