{"month": "10", "state": "TN", "station": "WWTN", "content": "The unfortunate result of these circumstances is that drivers are often unable to get treatment and the early stages of disease minor illnesses become severe leading to hospitalization and disability the driver then may lose their CDL and become unable to work\nThis creates a downward spiral that leads to extreme financial hardship and possible unemployment\nGo to truckers fun dot org today and learn more about how you can contribute if you are someone inside the trucking industry may be a need\nTo learn how SDF can help we encourage you to educate yourself in tears on the sink Christopher truckers fun today donate if you can you never know when you may need some help too\nTruckers fund dot org let's band together for a better tomorrow era currently here for the St Christopher truckers relief fund\nIf you could help a truck driver get back to work make their pile of bills less daunting give them one less worry wouldn't you\nEvery year thousands of truckers lose their jobs homes and more when a medical problem causes financial hardships but with your donation to the St Christopher truckers relief fund you can help get them and their families back on the road donate today a trucker spawn dot org that struck respond dot org given today at truckers fund\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W ... carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLately it seems like everything we use every day is getting an upgrade when the bad we sleep in the race that we use when we wake up that we've neglected one of the more important products in the daily routine that old worn out toothbrush I'm Simon and the and I'm a product designer after I learned how important brushing your teeth as to overall health\nI was at the dentist to ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable\nQuip sensitive suddenly vibrations that a gentle on your gums and a built in time and that pulses to guide you round your mouth\nAll packed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with free shipping attention to the section an quip the time magazine distinction of one of the best intentions of the upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill plan sign up now I'd get quip dot com slash W W L and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O\n... say two exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible as possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures and children learn more at St you ...\nYou're talking about it we're taught Ninety nine seven WCBS view sweater traffic and talk [noise]\nIt's MORNING radio he's our money and I'm Jerry ... eight six six Ninety a red eyes so where's the movement going [noise] uh we are now uh Fifteen\nDays off right and I didn't write Y. days out from a election day for some reason I'm thinking it's a week from tomorrow but no it's there to ... it's a it's a two weeks of from a tomato early voting and yeah yeah early early voting starts for us today yeah yeah yeah so uh so again dump up\n[laughter] yeah I'm\nLike ... it's because\nI I ... I went to agree with the exact with 'em but you know the ... you go back to the polls and and there's some frustrating things going on right now in in the house bowls and I know there's a lot of ah like in those districts there a lot of the uh you know local news agencies that do their own polls and TV stations and papers\nAnd everything else and they make that may not make necessarily a\nAn R. C. P. or something a on a grander scale\nBut if you look right now the toss up at thirty one in the house uh and and still at five thirty eight now overall poll or um I guess likelihood that the the the Democrats will check the house I what's frustrating for me is I'm not seeing major pollsters\nIn in certain districts right to read those\nTossup zones are and and we'll go over it who's got the momentum you know right now yeah uh we'll we'll hit that coming up a following of the top of the hour we'll look at the some of the uh uh different races that are being polled\nAre out there we saw the the president's approval rating the NBC walk or Wall Street journal poll yeah forty seven percent approval rating better than Obama yet the midterms of twenty ten yeah uh and and so when you look at this and it just very briefly and then just just a quick summary when you look at it\nUh for for for me it looks it right now it looks as good as it can for the Republicans and immature [noise]\n\nListen to read I radio show wherever you are with our free app for your iPhone or Android more info at red eye radio show dot com and use the key word mobile\nTo keep you trucking cc are tired of some sort of dedicated providing high speed tires are cutting edge to\nThousands of devoted service liquid over a hundred service draw the line ...\n... going on and on but\nSo let's just say we're upset at all are sixty\nNineteen forty five [noise]\nWhat does it mean to the corner office well now the seat behind the wheel of the new ... and the prestige of the corner office takes on a whole new meaning\nTo sleep designed to be ergonomics dash large LCD display controls at your fingertips hole to create a more comfortable functional workspace that set you up for success to take a virtual tour of your next office space visit free lighter dot com slash corner office that's\nFree liner dot com slash corner office free lighter runs smart\nOctober ... excuse officials Texas Chicken fried steak restaurant you celebrate without electricity chicken fried steak and eggs or chicken fried steak dinner for only five Ninety nine\nFor instance what you're going to do it for him chicken sized schools in Raleigh smuggling route country agree it's just fun you know all the forty six just fun to celebrate chicken ... expected participating hundreds of restaurants in South central slumping sitters October twenty six so I'm just going to be that guy who make\nThanks for calling consolidate ... can I help you I sure hope so I'm In credit card bills yeah I have to credit\nCards that are making minimum payments on and another that I'm behind on I oh about five thousand dollars\nLike interest rates have hang between Eighteen and twenty two percent that rate it'll take like Twenty years to cast wow Twenty years inside it credit can give credit at Columbia payments and reduce or even eliminate your interest charge as he should be able to have anything I can tell you what do I have to do ... getting ready to elevate your freedom ...\nWe're consolidated credit to we're here to give you freedom from debt going now for your free consultation if I had known it was this easy I Would have called years ago\nOnly children by my two sixty seven fifty eight hundred Barbie sixty seven fifty eight hundred and five five to six to seven fifty\nDepending on the surface of the critical of the one with so much more ... more than ... remembering somebody might you might want to remember when the MIT organ damage he was he will be one way says why they were just they originally commissioned license number D.C thirty two\nDiabetes high blood pressure anxiety magic everyone's on them if you're a fifty year old male maybe it'd be free and you may even have type ... diabetes\nA million dollars of term insurance may only cost you about two hundred bucks a month called term providers speak with big Lu at eight hundred five nine oh Seventy five sixteen big we will find a term my policy for you even if you have type ... diabetes are overweight or I have high blood pressure\nTo providers help thousands of people like you think they can afford term life insurance\nHenderson bail Nashville\nStudio were taught I mean I [noise]\nAles or tipped in your favor goal eight hundred and five nine oh it was Seventy five sixteen big Lu we'll answer your call and worked to fit you into a term life policy that you can afford remember big lose IQ\nHe's on meds to go late hundred five nine oh Seventy five sixteen eight hundred five nine oh Seventy five sixteen\nOff at a tribute to him in which he reportedly says he repeatedly declared his love for the kingdom and these people even though he disagreed with some of the practices of the current Saudi leadership\nThe emotion of the Republicans is extremely recent it's not the hatred of Trump that's summer for the last two and a half years and that's been there for two and a half years this is stuff that is fresh in people's\nMinds I don't know what's going to happen in the election looks like right now that they're going to\nAh keep hold of the Senate mhm or the house I just I just don't know and uh I don't think when you look back at Ninety four and Ninety four nobody really got a good read it that nobody saw that wave coming in the house\nNobody start coming right and and so I don't know about the house is it a possibility the Republicans could hold onto it yeah uh I don't know how in the mid term like this you can determine\nOr\nA extrapolate what the turnout is going to be all I can tell you is I understand that in a in a midterm election\nAnd the party not empower\nNormally gain seats\nAnd the excitement level is normally with that not say that there is and didn't excite voted voter excitement level and the Democrats I just see an unprecedented in a mid term at least in recent times where there has been so much motivation from the party in power which is the Republicans\nNot to lose that I saw the interview that was that was done with\nA a a bait or work Robert Francis over the weekend it's an issue you truly are a rock star and I looked at you and I said I heard that over the weekend and I thought well no and you and I hate that term to begin with for politician of what is the main way we don't like to practice in political I dollar tree but since that has been made I looked through and I said\nLook look at what Trump is doing some still out there filling huge arenas two years later ... he's going to stop now bomb it into the same thing I don't think Obama could have done that two years later ... well now it's not the same excitement\nWell because ... and we warned in fact if you look at the what happened in two thousand eight a than your four year that was there after that ah the inauguration and two thousand nine\nAnd then you saw what the Tea Party the birth of the the modern day Tea Party or or the game I guess in terms of the the momentum of that Tea Party and ... and early by two thousand nine and ... and it kind of carried over\nBut ultimately the rock star thing was over and we warned between election day two thousand aids and an operation day two thousand nine\nFor Obama we said okay for people that wanted the rock star keep in mind he's going to have to do things that are presidential\nAnd those things are not going to work for you by the way that was so [laughter] [noise] so\nAnd years ago [laughter] because [laughter] come ... leave off the charts now or to the fact that you know to the point that in fact a beta does not need the former presidents of campaigning in Texas um but but\nThe that that didn't carry over the ...\nThe Trump momentum is built on a number of things and real things it's not rock stardom but if you want to talk about a political rockstar and that would be somebody in my opinion that that that performs gets things done on his agenda\nNot not that Obama didn't get things done on his agenda they got Obama carried through you know they had to lie about it but they got it through a this president got affect them things done on the economy\nThis president got in and created\nMore jobs is president got in and work with Republicans to bring taxes down and I don't think we've had this conversation we don't think he could have that anyone else could have done that Republicans are alone could have gotten the down on the corporate rate to Twenty one\nPercent but you look at those accomplishments that's where the following that's where the ... it's that's where it's built and then as you mentioned the Kavanaugh saying something new to and wanted to do\nIt woke up conservatives it woke up the maybe some of the rhinos who had a band in too many conservative principles\nAnd have them re look\nI guess we are examined the threat to democracy the constitution and everything our entire system and process in place during that Kavanaugh debacle that whole thing so that threat became real this is not\nSome kind of rock stardom oh we think looks great or we think he's cool or we like\nThe way he tweets it's based on real things there's a big difference\nBetween skate boarding throw water burger parking lot and getting the corporate tax rate down to Twenty one percent\nWhile you know ... you know we're talking about this said that if there is a\nIf they're ... and we had mentioned you know the ... or work here in uh in in Texas that that is viewed as the rock star mhm\nWell uh Bud Kennedy of the star telegram and waited out the other day and I just read the article that he wrote based on the tweet yeah there's a place called the originally theater molds like three to five hundred people that's it couldn't fill it couldn't fill\nYep\nThat's what it was three quarters cornered Bud Kennedy who's three ... you know three quarters full and did an article\nAs beta burnout already here so when you talk about it ever existed or done I've ever really right did did it ever really exist or was it hype just what was it was it hype and the rank and file or high death in the media right right right is you know is it is the point so\nIf you look at the excitement factor or and again I don't look at crowds just going to visit a candidate a you know she a candidate\nAs the the be all end all as as to whether people will go out and vote or not\nAll I Know is this that on the issues right now on the economy it's a plus for the Republicans\nOn on exposing what the Democrats really really want and and what they really believe when it comes to this country and they do they even believe in the constitution do they believe in free speech that they believe in\nSecond Amendment do they believe in due process under the law and we're finding out no they don't actually don't believe in the tenets of this country right right and those are pretty simple things to understand maybe the separation of powers you don't understand maybe exactly what the role of the Supreme Court\nYou don't understand but you do understand due process\nYeah your age and you do understand the second amendment\nAnd most people do understand free speech and maybe not everything that's in the first amendment\nBut they do understand the free speech everything that the Democrats now do not believe in and are bragging that they don't believe in in those particular things and then you have a caravan of illegal immigrants\nThat are promoting it and the media is giving them as much publicity as possible they're going to show up Trump's they're coming to the border to crash the border has the mid term elections\nAre just Fifteen days away and it would take them I Will read one thing that to go what is it the eight hundred miles right I Would take them five hundred and forty seven hours which means okay so should they should be closing in on the border come election day ...\nProbably not something the Democrats want to be promoting as much as are promoting it right or the media is promoting as much as they are going to promote it\nBecause until I think Kavanaugh illegal immigration was still the number one issue of concern for Americans and as you said if there's a conspiracy out there in our priest\nShow meeting Trump did it in order to get them build the wall right Trump is funded this whole thing because of the fact that that's a lot of conspiracy theory that didn't because boom\nThey worked for him if there's if there's anything that that could\nGet get it back on track in terms of the funding for for the wall that he wants the motivation right now go ahead keep promoting the care of and right up to election day do it and let's see what happens let's see what happens on election day because\nEven if the Republicans took the house\nWhat kind of solid victory is that I mean long lines ... I I mean Democrats took the\nHouse and you know by by just you know what ten Fifteen margin right two or three marching mass ability so even if they did that what kind of long lasting ... if if you think about the promise of what they've got to deliver\nWhat is it\nFree stuff well they'll the house have other funded\nWhile they were they would still have to be ... again you would you would you would still have to be the resistance how can you be the resistance and govern\nThere's ... there's no way you can't it's all about obstruct\nIf nothing else so what do you do to that delivers numbers for people\nOf the president's working and and getting results in\nUnemployment in taxes and real things that people seeing their bank accounts in their lives every day what you're doing is working against one man tell me how that works for your long term even if you take the house this fall\nGet the latest issue of amplify absolutely free\nTexting go eight eight to eight nine eight eight that's a G O eight eight to eight eight nine eight eight\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raise that we use when we wake up but we've neglected one of the more impulsive products in the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is to overall health I worked with dentist to ... ... ... toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quit a sensitive stomach vibrations that a gentle on your gums\nAnd built in time and that pulse who's the guy do around your mouth all packed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three shipping backed by thousands of dentists quip is one of the first electric toothbrush is accepted by the American dental associations upgrade your cat\nAnd stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill packed free at G. E. T. H. O. U. I. P. dot com slash W W O\nWearing anytime on demand to catch up on Eric and Gary Starbucks or the day is it red eye radio show dot com and click on demand that's red eye radio show dot com\nA great product deserves a great look housed lubricate or is introducing their new logo on their new labels houses more than just their diesel free Dan type jobs they have a\nFull family of ... products from house meaner power cleaner of top of the lines useful injector leader and liberate papers to house multi purpose liberator and penetrating oil an alcohol free products was over one thousand one uses so much for the new logo and all the great health products on the market how's lubricate or a family company with\nA family of products that you can trust\nIf you depend on a truck to make a living that American Trucker magazine is for you [noise] each month magazine is that the information you need to keep your truck running and making you money\nFor new product for the latest in regulation American tracker has what you need to know and if you're running your own business American trackers business editors him rainy there for you\nThis were announced author and Mrs expert has more than twenty five\nYears of experience in the trucking industry and knows what you need to maintain a profitable operation each month ... business some trucking offer solutions that difficult problems faced by any trucking organization American chapter magazine is not just for people looking to keep their trucks on the road\nAnd it's also for those looking to buy or sell vehicle\nThe American trucker marketplace connection with thousands of buyers and sellers across the country who may have\nThat perfect track here looking for\nThat don't miss another issue of American tracker magazine to receive your free coffee treasure dot com and sign up [noise]\nAttention all authors page publishing as looking for authors have you written a book and want to get it published he's publishing we'll get your book into bookstores and for sale on line at Amazon apple I do in other outlets\nThey handle all aspects of the publishing process for you printing ... publicity copyright an editing go eat under advisor or one thirty six eighty nine now where you're free author ... should get that seat under advisor or one thirty six eighty nine for your free author somebody should get\nAgain eight hundred bonds or one thirty six eighty nine your world disgusted daily life in local all day long [laughter] we're talking\nNinety nine seven two yet [noise]\nListen on your Amazon or do you see the looks a little red eye reviews them anytime he wants to see the looks a little radio [noise]\nAnd he's currently on Gary McNamara a chick six Ninety right out yeah it was a reporter on this week it was on that that said you're a rock star to uh know better yeah but yeah Rochester right here Roger you really are no you really are a rock star I just uh yeah I Do not a senator and won't be but you're a rough [laughter]\nThat would have been a bird\nWith thank you very much I mean you're not going to be a senator but you're a rock star\nOh my gosh we were just looking at the polls I'd\nI'd we haven't seen one from last week a\nWhich is interesting in that in that Senate race between Ted Cruz and a Robert Francis O'Rourke in Texas but in those latest a couple of polls are Ted Cruz is about fifty and has a pretty good leap so we're not ready to\nCall it just yeah that was interesting because he said over the weekend [noise] apparently that is not going to run for the presidency and twenty twenty mhm yeah I was interesting about Wall Street journal wrote I loved her editor from last week we are all Native American ... a guy who are only American style but does said\nThat they believed that killed any chance she has a running for the presidency ... because she would just be she will be forever or Warren general ... she will be ... ever\nA marked for that so right when you hear the fact that people talking about by and I thought about this uh sometime over vacation because you know you're you know while Biden's too old he still says he won't run but by and probably if you look at the polling still Democrats won by more than anybody\nMhm Mm well then Hillary naturally would think well why not me again\nRight and that thought from whatever age talking about that she's you know hasn't ruled it out yet I mean that just send those social media severe uh yeah it just exploded and we're all thinking oh in the Trump at a gum it leads\nYes please make that happen please happen again and it's just I just hold while she just won't disappear and now you know her and bill new weeks you know ... you know before the midterms going out and uh you know they want to get their ... and ... you know they're going to be out there and and sharing the Democrats on me while the Democrats are going\nWell I mean what did you have there just fresh out of the whole a cabinet thing right we're just a couple of weeks out of that and remember what you had you had some of the hash tag me too movement a leaders and celebrities coming out saying\nNo we should've repeating we should have called bill out then\nOf course they always say that because she didn't win if she were president now they wouldn't say that Twenty years later than you know so well and ... exactly Twenty years that we should we would get in a time machine and then go back and then remove him from office\nBut here's my question they go out on you know what they're what they're doing they're testing the waters right how much influence does she have well she can't go out with out build\n\nSo\nWhat are you going to do and even if she did she can't go out without a million questions about bill from her own party not from Republicans we've been asking\nThe questions for decades\nSo what do you do\nPlease jump in the water's fine Hillary twenty twenty\nLet's see a rematch good luck because here's the first thing well she's not going to be the only one right so\nNow we know the DNC will be working to make sure that of course she's ushered in you know make it seem like Bernie's really catching fire but not really [laughter] like we learned in twenty sixteen\nSo as she's in well don't count Bernie out well then Jones thinking the same thing in the opposite you know well wait a minute if she's in well maybe I Am in\nSo then you've got your Kamala Harris you're got\nAre probably not Elizabeth Warren [noise]\n... now but you've got you're going to have a field that is going to be greater than it was what did they have three three and a half candidates go up against Trump no but if you in their primary\nOr a [laughter] ... well build me a heck of a lot more I I I well I don't know I I\nI'm not going to you know you you have to and you said this earlier it's going to be\nEither who hates Trump more than a combination of\nWho hates Trump more and we're going to give you everything right and so right now the base level for the Democrats have been ... over the weekend or last week\nWhen she came up again with her guaranteed in a ... plan yeah of six thousand dollars was one of the figures that was thrown out so now it's\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W ... carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raise that we use when we wake up\nThat we've neglected one of the more important products in the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is the overall health I worked with a dentist to ... ... ... toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quip has sensitive stomach vibrations that a gentle on your gums and built in climate pulses to guide you round your mouth all packed into a beautifully slim and dies at least many him design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three shipping\nBacked by thousands of dentists quip is one of the first electric toothbrush it's accepted by the American dented association upgrade your or capped and stopped brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack three at G. E. T. Q. U. I. P. dot com slash W W out one\nCan get through on the phones sound off on our Facebook page\nYou could even type it in all caps super talk Ninety nine seven double duty as [noise] Internet radio he's are coming on Jerry McNamara eight six six Ninety ... to Rick in Virginia Rick Hi you're on Radio Welcome to the show I read they fight how you doing I'm\nI was just thinking this is not totally relevant to the topic but I was thinking that all things being the same except let's say that Brett Kavanaugh was a liberal a judge and he was appointed by a liberal\nA precedent um do you think that those in the media who are on the left and those in the media on the white and the\nLiberal and conservative politicians would have taken the exact same position had everything being liver stick to it but everything else has to say just wondering what\nI I I I Know this that Republicans I mean you had you had people like us that criticized soda my your ... and and criticized Elena Kagan but it was on the specifics of how she would rural as a judge\nBut they got Republican votes they weren't demonized the way the cabinet was demonized\nRight it did I mean so how I Would say no it it would not be it would not be exactly the same based on the history of what happened to them they were criticized and they were severely criticized by construction is like us to believe that you should follow the rule of law we went back and looked at ... or\nJust sort of Meyer Yahoo who talked about the fact that uh oh sorry I'm not supposed to really talk about the fact that we legislate from the band right right uh we had to lay in a cake and when she couldn't answer the question\nAbout a ... but she was asked by a senator or whether the government should be able to tell you what food you know you have to you have to buy and she didn't answer the question because it got down to what she believes the Supreme Court is\nActually you know a a a a buyout how you're supposed to rule as a judge but uh no I I don't think it would have been if it would have been a number one it wouldn't have happened you're not going to have a liberal justice or then again with Trump never know but you could you could have early\nFor you and I asked him to the point from the color if it was a a liberal president who appointed a liberal justice and there was an accused you're like a you had a doctor for it but if you but they will fully reverse it be it being Dr Ford had a right leaning affiliation\nAs opposed to left leaning affiliations I'm no that wouldn't have\nThat it wouldn't have played out the same way because the media wouldn't have done the same thing that they did here I mean the behavior would be different yeah I mean it would be quite the opposite\nOr use you see it all you you see it already whether it's you know senator brown of Ohio mhm they're not pounding him for stating that the\nUnfounded allegation against a ... him is a political hit job or not covering him not covering up the same way like well no no no no I don't know I don't believe it would be the same no color\n... and I think we've seen is like you said we've seen that demonstrated I don't know how many times now\nAlong the way um I don't know that that I don't know that anybody\nWould expect it to be the same any\nEspecially any critical thinkers that's watching the entire process play out in any given scenario would expect that to be the same but now if\nThat was ... all of those items were reverse what\nYou saw from Kavanaugh was the first there's nothing to cry or that you\nKnow that's right that's right great point there's no there's no way to you know that was a precedent that was set by the lab and by the way that's the new normal for them this is kind of behavior [noise]\n\n\nAs soon as ... radio on Westwood One\nCheck out all the latest news events trucking information jobs and pod cast at red eye radio show dot com that's red eye radio show dot com\nOh before we get back on the road let's stop at this cat scaling way definitely we might try to you know I'm no good with technology try at your\nYou can process the entire way on your smart phone and email your paperwork anywhere that's right so this is that we've been getting through the cat feel so fast and you for ten minutes\nWay out I kept giving no excuses guarantee you get an overweight sang after ... a lot of cash scale either reimburse you for the fine we're going to court which I don't have the cat's tail locations we've got your back you can now saves time went by using your smartphone\nDownload them we my truck out from the Google Play store or the app store [noise] find out more we my truck Josh\nHey drivers apps on your phone and given more tourism\nFunny videos but I wanted to make life easier on the road [noise] well you got the ... pilot for pilots flying J you can sort of odd shower real time parking war starts ... even get savings and reward is always in touch with you on it and\nWe got it and I was flying J downloaded\nFree my pilot happened to start saving today [noise]\nRead I radio and our sponsors are devoted to trucking safety that's why we're proud to bring you the red eye radio million mile club\nFor twenty seven years we've been saluting drivers will surpass the million mile mark with preventable accident free driving\nBy reaching this milestone you can be a part of an elite club of drivers who share remarkable safety records and demonstrate superior driving skills\nIf you or someone you know it's a truck driver with a million miles or more driving was outer preventable accident register online at red eye radio show dot com that's red eye radio show dot com\nThe red eye radio million mile club would not be possible without the support of our great sponsors including Petro stopping centers\nHow's liberator ... family of companies motel six the sink Christopher fund cats scale and ... products we applaud the individual truckers athletes who drive with care and keep our highways say\nDiabetes high blood pressure anxiety med everyone's on them if you're a fifty year old male maybe it'd be for you and you may even have type ... diabetes\nA million dollars a term insurance may only cost you about two hundred bucks a month\nCalled term providers speak with big Lou what eight hundred five nine oh Seventy five sixteen legally will find a term my policy for you even if you have type ... diabetes are overweight or I have high blood pressure during providers help thousands of people like you who think they can afford term life insurance\nHenderson bail Nashville\nStudio were taught I mean I [noise]\nScales are tipped in your favor goal eight hundred and five nine oh Seventy five sixteen big Lu we'll answer your call and work to fit you into a term life policy that you can afford remember big lose like you\nHe's on meds to call eight hundred five nine oh Seventy five sixteen eight hundred five nine oh Seventy five sixteen\nFirst accounting of events listen off the Gulf racial this was an operation wearing vigils ended up getting the whole season was they had made the mistake when they\nSaid they tried to cover up what\nSites such cold implications being cut staff and accidents in Riyadh Eighteen people arrested but there were still holes in the Saudi narrative leaf they say that cooperating with Turkish investigate us but still ... is missing a\nYou got to talk about the real things and I saw this again yesterday somebody who's making an analysis of Trump\nThey said look Trump's popularity still there because Trump's popularity is still with the average person right\nThat he's you know he's with he's with the average person who looks at the elite and they don't look at him as as part of the uh you know the ... in Washington but they look at the elite they look at the\nUm oh what a ... ... what do they call it the um oh what we found out what we know ...\nWhat we now called deep state ... the establishment what do they call it the swamp the swat swat yeah when when we when we we look at the the the great and they view that the Trump that Trump ... and his opinions\nThe opinions of the average man there is a relation of the average person\nTo Donald Trump right part of it was well he's also anti elite intellectual\nAnd I thought about that I go well I'm not anti intellectual I mean that's not what attracts me to Trump would would attract me to Trump is the part of his intellect where he actually has the right answers [laughter] so yeah I I don't know who actually wrote that whether it came from somebody who is more\nA liberal to say you know anti intellectual or whether it is that mindset that exist with the populace that were against anybody that we use themselves as an intellectual because intellectuals are always wrong ... ah I'm not sure where that was but the fact is she relates to the average person out there and he speaks like the average person do mhm\nAh but the fact is he actually has\nIntellect that\nSolves a heck of a lot of problems and a blood test of the reality of things that we actually face or in the world would still a willingness\nTo negotiate you can look at North Korea now again that's still on you know that's still a great unknown as to what's gonna happen there you can look at Saudi Saudi Arabia you can look at\nUm a a China and what's going on with the with China right now we think the president has said great successes we also think that he's made some some errors especially in dealing with Canada and Mexico for example in trade we don't believe that we ... I\nIf you were a Trump supporter on trade what he was talking about when he ran for office and what he actually got were two totally different ballgames\nCompletely yeah and what he was talking about on the campaign compared to what he was ... but he actually got and promoted the good at what he got was completely different\nThan when he was running for his campaign as we've said if his most loyal if the always Trump ... want to support it and go with it we're fine with that because all we care about is the actual substance what did you actually get\nAnd does it promote more free trade to promote\nA more more good things but the ultimate thing that he promoted which actually negative it raises the cost of cars\nIn the United states Canada and Mexico and that's a bad thing mhm and now I think the average person who understands economics who is in caught up in the political I dealt with three will admit that's a bad part of the deal the always Trump or just ignore it big nor does if it doesn't exist were not just going to go there\nHe got the deal he said he was going to redo NAFTA he did that to well what was it NAFTA I don't care don't want to know and that's fine that's part of a demographic that's going to vote for every president that I'm sure but that's not the only demographic they voted for Trump we broke it down to eight different demographics\nAbout six months after the election and there's a ton of people that in that eight demographics is more now more United\nAnd you can even add an ninth in there which are the never Trump hers which have now come aboard mhm so Trump for all of the good and the bad has United with the help of Kavanaugh and the help of the Democrats and then speaking bluntly about what they want this\nCountry to become a have\nUnited around Trump and they do look at Trump he is that I think your head that isn't\nThem right and and I think\nYou look at the end and you said this earlier if you want to look at the ... the the real rockstar\nLook at the terms in terms of performance in terms of getting things out Trump over ... come on I'm close because one thing that that is going to always resonate with American people is a good economy\nIt's going to be\nA man I'm doing okay everybody in my family seems to be doing okay\nA job status doing OK and or getting better you look at the unemployment numbers and the kittens where the liberal media can't argue any of those points anymore they can't break it down because you you just simply can't those numbers now they can be manipulated\nBut in breaking them down in terms of the performance as as long as we've used the same standard\nStandard with the same standard of approach basically on those numbers you cannot have a debate about the unemployment or the GDP or anything else because\nThe last president was judged by the same exact standards all of this basically wraps up into one thing what is it that the other side wants to do is that a threat to this existing ... you know economy right now in other words\nOr you know I'm really I'm I Am doing a little bit better you know my jobs doing better or making a little more whatever it might be I'm I'm taking home a little more taxes are lower [noise]\nNot only that but I remember you know we said this and I don't know if anybody's ever used the exact same words that we used and I think we used to probably [noise]\nAh I think this was early in the primaries and we continue to say it all the way through the election\nAnd we and and the media has completely missed is totally ... but it's not just that you'd be analysis that I was telling you that I read yesterday the Trump is the average ... average person the average person looks at them as the average person what does that entail the average person if you cause that to me doesn't describe\nThe the the substance at just that's labeling people I use an average person therefore he likes Trump's because Trump relates to the average person because they believe he's like the average person what does that mean\nAnd you and I actually use the L Word back way back in the in in the campaign I Believe that and and I believe this too but I Believe the Trump loves America ... and I believe he loves Americans and he loves Americans first\nUm\nBut he loves Americans and I think the people that support them I think part of the political I dollar tree which is different than Obama's political I dollar tree right is that they look at him and they say here's a guy that truly loves America\nAnd he loves to me he cares about me yeah he's rude and yeah he screwed but when it gets down to with\nA law that comes from the anger that we believe that he shares with us\nBut these other people don't love America\n... and we love America and how do we love it and now the left only media would get insulted we love America no you know you don't believe in due process yeah both Cuomo America's never been great right but ... exactly mhm you you really you really don't you don't really believe in the first amendment you don't really believe in the second amendment\nYou don't know believe in due process you don't believe in a presumption of innocence what do you really love about America you and I had brought this up for over ten years when we've gone\nThrough certain issues and said women if you don't care about this and you don't care about the constitution because what makes us Americans do we live in the same geographical place oh no it's we share an idea and one is that idea the ideas the constitution and the United state us\nAnd when you have a group of people are political party were\nChecked that this was a bubble thought\n'cause that's what the Democrats have tried to much above his alter ego trip was America we love America\nWhat do you mean I Love America to actually if you don't believe in the constitution you don't love America\nYou may love the concept of what you as a group all think America should be but you don't love America the way that it exists under the current constitution and the rules and regulations that we have you and I've talked about it when you talk about the fact\nNow there's they're talking about well the president needs to remember the president's see is no longer effective or that needs to go yeah the the the electoral college needs to go to the Senate needs to go from what they don't understand what those are key words that you don't believe in individual liberty\nBecause we are not a direct democracy we are a constitutional republic and\nThe reason we are as to protect the rights of the minority this to protect the individual rights and the rights of the minority exactly what they claim\nBut they believe the Democrats claim that they they think about so we look at all that and that's all part of loving America so\nWhen you hear when I say that I've always got response or it's above the thing that he loves American we don't know based on the actual specifics of what the Democratic Party is promoting ... what we're calling for which is anti constitutional mindset and\nAn anti constitution ... yeah and we can make that point and you and I said for the longest time but it's still left that doesn't believe in the first amendment oh for them yeah mhm but for others they don't and we have broken that down before they don't believe in the second amendment and now they don't believe in due process under the law\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. peak carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in the race that we use when we wake up that we've neglected one of the more impulsive products and daily routine that old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall health\nI was with the dentist to cramp ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable quit sensitive suddenly vibrations that a gentle on your gums and built in time and that pulses to guide you around your mouth old packed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for\nThree shipping attention to the section on clip the time magazine distinction\nOf one of the best inventions that they get upgrade your ...\nAnd stop brushing better with quit\nQuit start suggests twenty five dollars and it's guaranteed for life with a refill plant sign up now I'd get clipped dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O\nThe possibility of lung cancer can be pretty scary especially for ... million current or former smokers in high risk that's why I said by the skin down wants you to know this is a breakthrough low dose E. T. skin that can detect cancer early and it only takes sixty seconds you stopped smoking now start screening\nWeren't easy quiz to see if you're eligible visits said by the skin or it could save your life St ... cannot just brought you by the American lung association swim forcing this should have been the council\nMyth a show live anywhere anytime on demand to catch up on Eric and Gary's topics of the day is it red eye radio show dot com and click on demand that's red eye radio show dot com\nDiabetes high blood pressure anxiety med everyone's on them if you're a fifty year old male maybe it'd be free and you may even have type ... diabetes a million dollars a term insurance may only cost you about two hundred bucks a month\nCalled term providers speak with big Lou with eight hundred five nine oh Seventy five sixteen big we will find that term my policy for you even if you have type two diabetes are overweight or I have high blood pressure during providers help thousands of people like you who think they can afford term life insurance\nTo buy a million dollars of a ... term life for you all you need to do is called big Lu at eight hundred five nine oh Seventy five sixteen Lew will make sure the scales are tipped in your favor\nGoal eight hundred and five nine Seventy five sixteen big Lu we'll answer your call and worked to fit you into a term life policy that you can afford remember big lose IQ he's on meds to call eight hundred five nine oh Seventy five sixteen eight hundred five nine oh Seventy five sixteen\nThanks for calling consolidated credit counseling sat at says can I help you I sure hope so I mean that is a credit card bills yes I have to credit cards that are making minimum payments on and another that I'm behind on I oh about five thousand dollars interest rates have hand between Eighteen and twenty two percent that rape it'll take over Twenty years to cast wow\nTwenty years consolidated credit can give it credit at Columbia payments and reduce or even eliminate your interests he should be able to pay everything I can tell you for years after death ticket they ... getting ready to elevate your freedom from God\nWe're consolidated credit we're here to give you freedom from death going now for your free consultation guy had known it was this easy I Would call ... years ago\nOnly children by two sixty seven hundred Mumbai abusive to seven fifty eight hundred five five do sixty seven fifty reading on the surface of the some of us I'm like no more than ... remembering somebody might be my mum about them on to become a member of the MIT\nWe're going to be able to go from one licensed by the corporation commission license number D.C Nashville is our largest radio news ... news right here if you already talking ... that would make to our\nBills less daunting give them one less worry wouldn't you\nEvery year thousands of truckers lose their jobs homes and more when a medical problem causes financial hardships but with your donation to the same Christopher truckers relief fund you can help get them and their families back on the road donate today a truck respond dot org that's truck responded dot org give today at truckers fund dot org\nShow thanks where they show tonight on all this is going to touch on something that last caller mentioned about it you know he was trying to get you guys' opinion on the older than ... completely different ...\nIn this narrow it Kevin on that so just came up to my attention\nOkay and then let's say was completely disarm so\nWhat group for conservatives or Republicans would be like ... like scratch your weight and kept ... thing or your shirt like\nI didn't understand who will go on our side with the ... ...\n... nobody knows who's serving as or you're if you're talking about the behavior of the the uh the uh\nInterrupted so disruptive kind of and we're getting some interference on your costs will let you go\nUm if you're talking about the disruptive type of behavior or the after the the committee vote on Kavanaugh the Kamala Harris and and uh and others walking out that kind of behavior who on the right would do that I don't know of anybody that would do that our point was that\nIt would have been a different scenario based on the media treatment of a set individual had everything but that's really more about the media treatment um and what we do and we did go back and and talked about the working down of the um\nUh you know what how they have acted or behaved as a judge during the confirmation process for Sotomayor or for Linda Kagan and what they might do in a in a certain scenario but that was based on their behavior as a judge you still had\nRepublicans vote for them and you still had and that was their treatment of them was based on again how they would behave as a judge that was part of a what Lindsey Graham and say\nYou know he voted for Elena Kagan and sort of my ... and so what the behavior be\nYou know I'm a a a ... well a Lindsey Graham getting up and walking out likely not no because I think what you saw and Lindsey Graham and\nUh his ah emotional or the you know statement that day during that hearing when Kavanaugh was there was based on the ... the behavior\nOf those on the left and how they were treating this and essentially a shredding the process and and I think that's what that's what that was it for the\nYou know a liberal president and it was a a liberal justice or liberal judge a that had been appointed and during this process there was a conservative leaning or a you know a woman that using him of doing something with the behavior be different by the media would have been treated the same\nLikely not no but it was kind of a you know with all due respect to well the answer I think we all know that any critical thinkers that I don't expect a\nLindsey Graham or or another conservative on the committee or or Republican on the committed to get up and do what come out with Harris did you know after the committee vote get up and storm out\nThat wasn't the point\nYou know but all way way but then again you can't make the case he was trying to make the case that it was the same and I'm like no it was unprecedented what happened right and you you can look at Justice Thomas you know that goes back you know twenty five\nOr ... that goes back twenty five years ago and and uh you know he those hearings were held and then but then but then he was he was you know confirmed and I believe some Democrats even cross the line and voted for him yes they did I Believe that yes they did well I Believe it was a Democrat said it at the time\n... yeah\nAh so yeah so you know they they ... but this was unprecedented nothing nothing we have ever seen\nA it in our lifetime or in modern times has has been like this so to even question that to me uh shows ignorance and that doesn't mean stupidity of means a lack of knowledge\nAh on on history and that's why we brought up and said that didn't happen was sort of minor and that didn't happen with Kagan there were people that disagree with that because we we believe\nThat sort of my or and Kagan many times not all the time\nOn the with\nThe cell tower right to sell to our cases the cell tower that they agreed with ... they you know that ah they use the in their writings they used um\nHe talks about you know how he lost his seat teachers' aides going to make sure they get a ... they're not going to teach to the cashed\nOut of it I mean he's talking about state issues which shows the ignorant [laughter] yeah I mean the Democrat Party place she\nYou know to the ignorance of the bail even teach civics down here in the morning ... age I'm sixty five years so I I was a Democrat like everybody was in Texas until the mid eighties\nAh we're always conservative or moderate Democrats but he's ... past show I mean it's you know just the back [laughter]\n[laughter] oh no it just amazes me it's like I wasted thirty three years in the air [laughter] ... treated at the ... you know that the constitution video had right let's get\nA ... yeah I understand yeah I understand there's always been the ad on the there's always been that uber service uh there there's always been the oven flows I mean if you\nIf you were walking around the Nineteen thirties as an adult in this country you would have seen or you know the socialist mindset that really really really really existed at that time so uh the anarchist movement that ah in in the first part of the twentieth century\nUh that that existed in this country could get a just as wild at at times one of the things is the the fact is do do as many people still hold his radical views\nAs you see maybe a little more right now I don't know how many Democrats rank and file actually hold the views of not believing in due process as the mainstream of the Democrat leadership now does write one of the brain are seem to see where is there a big just right now now we\nWe know that on many of the issues the ... if you if you actually polled Democrats on all the major issues out there as to what they would want\nYou would see as we saw back in and we noted back in a twenty twelve especially\nWhen on the issues the majority of the public agreed with a Romney Ryan yeah on the issues they read with ... and if you take a ton of the issues that rank and file Democrats believe\nThey disagree with what the people they vote for a does and I think to a much greater extent\nThan any Republican voting for a Republican president directs right yeah\nYeah because you think about this if you think about the conservative never Trump spurs the vast majority of the issues that they disagree with Trump on is his tone yes\nIs it similar to what they\nAre a lot of the left criticizes him for his words in his town and it's not so much the job that he's done\nYou know they may pick apart you know whatever it is [laughter] the tariff babies [laughter] by the way we're the original ... babies um but but but they may become part these things or this or that but ultimately if you got down and you were to ask the never Trump or is the conservative never truckers\nUh well okay the corporate tax rate Twenty one percent did you think that was going to happen or do you apply that do agree with that um the unemployment rate the GDP where we are right now\nUh do you think we're moving in a good direction of the president's done a good job on a number of items I don't know how you would have even as a never\nTrying and I I Believe the president should fight more when it comes to the debt he's taking little victories was I'm cutting the federal government this much\nBut it's doing nothing to solve the budget problem ... you're a Charles does he throws out but the fact is he knows he's not the legislative branch and yet he knows he the one power ... this isn't this isn't the president alone\nThat has you know created this deficit spending\nThese other Republicans in Congress including a significant portion of conservative or formerly conservative [laughter] ... who wants to identify conservative Republican congressional members that are also wanting to spend my eight eight a ton of money well\nWell how do they get tax is done Roy Moore last yeah and they realized oh my gosh we got to get things done\nA because we may lose the Senate at some point we've got this slim you know victory here are slim margin now and it they didn't ... the Republicans in the Senate didn't get it done until after that lost the president had been working toward that but again this answer tight if they're not going to do anything right\nI think the president you still work harder and still talk about more which he does not ... you probably at the end I I'm thinking that probably the White House says look we can't win this because our own party doesn't care any more about the debt well you know what's ... what's really disappointing I guess the downside of the\nCapital of the thing or what have may have motivated a lot of people or whether it's a never Trump or his or or the the moderate Republicans a who now are standing up and for conservative principles again\nIt could be too little too late not not in the Senate but in the house and the president and the Republicans\nIf the just imagine that that the Republicans maintain power in the house and the Senate the motivation to get things left now work on getting things done right that's very real but it can't happen if the house isn't there\nIf you lose the house is going to be limited in what you can get done [noise]\n\n\nAs soon as ... radio on Westwood One listened to\nRead I radio show wherever you are with our free app for your iPhone or Android more info at red eye radio show dot com and use the key word mobile\nTo keep you trucking cc are tires to serve\nAs dedicated providing high speed tire sort of two thousand devoted to service\nOver Fifteen hundred service from five minute alignment check [noise]\n[noise] going on and on but\nSo let's just say we're upset at all are sixty four\nSee service different UCR tires dot\nFor eighty years Detroit Diesel has been the legendary driving force inside many of the best known trucks on the road to our latest destroy technology bonuses thinks he says he earned a reputation of\nBeing a total disaster solution dedicated to old enough time and our customers bottom line and we're committed to continuing on legacy for another eight years and beyond when you demand it all the mandatory\nEighty years of innovation dedication and recognition [noise]\nIf you or someone you know he's struggling with addiction please call this toll free number\nRight now eight hundred three nine o nine five to eight that's eight hundred three nine o nine five to eight by calling your addiction team you're taking the first steps to recovery their advisors are ready to take your call right now your future is still a bright place to help you need\nCould be one phone call the weigh eight hundred\nThree nine o nine five to eight that eight hundred three nine o nine five to eight this call is completely confidential end if you have private insurance there could be little to no cost to you even if you've already been to treatment give them a call there is no need\nTo let addiction ruin your loved one's life\nTake the first steps now at eight hundred three nine o nine five to eight\nEight hundred three nine o nine five to eight that's eight hundred three nine o nine five to eight\nDid you ever look at the ... and your coffee cup and didn't realize that's exactly what happens to your teeth\nParis swamps is the five minutes solution to get your teeth white without visiting the dentist this is John Green the c._e._o. of\nParis swaps into your teeth or ... from coffee tea or smoking all it takes is five minutes with power swabs in\nFive minutes you'll see an average of two shades wider chief and in Seventy six shapes its clinically proven to white natural teeth as well as caps Anthony here's the secret is it to the church and that was developed by Dr Martin ... that live stains off of your teeth best of all there is no matter if you strip search trees that you have to leave in your mouth for an hour just rub your teeth for\nFive minutes and you're done to try and Paris rubs risk free call one eight hundred\nSix seven eight nine ... nine six night that's one eight hundred six seven nine o nine six nights\nI guarantee you're white white smile will have your friends talking about how great you look try which free today one eight\nHundred six seven nine o nine six nine that's one eight hundred six seven nine o nine six now\nHave your same veil Nashville\nScooby oh we're talking about I mean I [noise]\nI'm pretty take you to court even put you in jail with one called to wall you'll never need to talk to the IRS again our average clients settles for about ten percent of what his old we offer free face to face consultations in your local area call eight hundred Seventy seven zero for three three that's eight hundred Seventy seven zero for three three\nIt you don't necessarily have to get to a point where you have to prove that it goes comes from a direct of all the way you know at the top right uh that uh that that someone or a group of people were directed to do something or like the Irish thing right\nBut the tone is set\nAnd the tone is set by who while the tone is set by the people that are put in place to have those departments in this case the department of justice or the state department\nSo\nThat tone is set that we don't need I mean\nLet's face it at least one of the secretary of state was thought it was okay allowed an above board\nTo have her own email server outside the security server and we all know why that reason ... the the reason the real reason was\nAnd it was to avoid the freedom of Information Act and she thought that that was well wasn't lawful\nBut she was trying to tell people that was allowed and above board\nLook when you have that pattern of behavior expect that the rank and file in all these departments is going to act accordingly whether they get a directive to or not right\nYou know we we wonder about our top secret so I read this oh man did when I was on vacation I Can't remember who wrote it but it just popped into my head now as you were talking about it that talked about Hillary Clinton you know while she removed herself ... uh you know from having top secret clearance\nYou know she she\nRemoved herself and the point was made well she should have been removed a long time ago right\nIf if putting a server in your house if being so ...\nUh with at the minimum careless and then the maximum absolutely premeditated\nOr a mindset of breaking espionage law them by allowing the top secrets of the country to go through your private server which now we're told\nForeign enemies were able to access if that doesn't get you to lose your security clearance what in the hell well right\nThere are no top secret if somebody can be so careless\nAnd not lose their top secret clearance just as passionately secret mean if yeah and and I read that I said oh you know that's the point that came out of this is not\nWell she voted to really did it it wasn't that it was taken away from her that still pointed should have been taken away from our right\nWhere's the oversight\n\nBut from the judge or I Want to read part of the transcript\nA from a U.S district court judge Royce Lamberth the transparency group judicial watch initially sued the department of or the state department and twenty fourteen seeking information about the response to the Benghazi attack\nAfter the government did not respond to a freedom of Information Act request other parallel lawsuits by judicial watch are probing issues like Clinton server whose existence was revealed during the the course of the litigation\nThe state department head of a mid ... uh moved to dismiss judicial watch his first lawsuit on the motion\nFor some re judgments sane and an affidavit that it it conducted a search of all potentially relevant emails and the possession and provided them the affidavit noted\nThat some more documents and emails could be forthcoming but Lambert denied the request to dismiss the lawsuit of the time and on friday he said he was happy he did charging the state department officials had intentionally misled him because other key documents including those on Clinton's email server\nAnd in fact not Ben produced it was clear to me\nThat at the time that I wrote initially that false statements were made to me by career State Department officials and it became more clear through discovery that the information that I was provided what's clearly falls regarding the added the adequate\nSee of the search and this what we now know turned out to be the secretaries email system Lambert said on friday he continued\nI don't know the details of what kind of I G inquiry\nA there was into why these career officials at the state department would have filed false affidavits with me by the way that's perjury yeah when you do that yes you're telling the court somebody when you know to be something else I don't know the details of why the Justice Department lawyers did not know false affidavits were being filed with me\nBut I was very relieved that I did not accept them and that I allowed limited discovery\nInto what had happened during the tense exchange with Justice Department lawyer Robert Prince Lambert press issue accusing prince abusing double speak and playing the same word games but Clinton play into\n\nThat was not true that's a quote the judge said referring to the state department's assurances in sworn declarations but at a searched all relevant documents quote it was a lie\nAnd I thought about this the culture 'cause we talked about the culture of the Obama administration the culture that existed in the IRS whereas we know they purposely we're trying to hold up\nThe uh the uh tax or documents what do you call it again the tax um of all I got my bike here are the um\nWhen I go to church ... no no no the ... though they were trying to hold up these groups that wanted to get a tax exempt taxes I write towards again status yes they held them up by\nThe way ... you you want to know why I'm against the income tax I'm against the income tax for that reason right there I'm against the income tax because the government should never have to review any group as to their intentions as the federal government was able to do\nThat's why I Believe there should be a sales tax mhm that's why I'm against an income tax write because the government has used the income tax to get involved and to censor people and to do things that they have no business being involved in your life right now and\nThen by the way you're touching on something I referred to earlier\nYou know that that whole process of\nAnd well it was a couple of rogue agents remember that yeah it was a couple of rogue agent yeah no it wasn't no it wasn't and we're not saying it it was a direct order from the White House down what we're saying was there was a tone a clear tone that was set we know\nWe know to be the behavior the pattern of behavior during that administration on many levels the question is\nHow far does that go and was the tone and the department of justice or the state department just that look will do anything we want to we don't we don't have to tell the truth even to the courts well\nAnd and when I when I look at when we look at the situation with the IRS which you look at all the rest this seems the Irish might be minor [laughter] compared compared to everything else when you when you when you look at for example here at the department of of\nOf a state where the judge is saying you lied to me yes you absolutely lied to meet you committed perjury you let an affidavit says his accusation right\nOr you know it to a ... to them you look at what went on so that we're looking at the FBI and the department of justice you're looking at after when the Pfizer application\nWas declassified on the other documents declassified but the president didn't release it but send it to the inspector general of the department of\nJustice who looks at what looks at corruption you look at how they were so willing and the state department to lie on Benghazi yeah and and this is why the whole thing\nOr with the um\nOh I just I got my like your and but on the air for a while [laughter] we're going on vacation I Do I [laughter] I was a show he mhm with the ... the debt\nMurder of of ah of Mr jumped to show your over in Turkey or wherever it happened where we've sold on all the information because nobody has been able to independently verify what turkey has said\nI'm sure somebody in the CIA may know but the average person doesn't know and this is why the Democrats have no business on talking anything about this administration\nAnd how they handle it so far especially when there's a lot\nI'm back to San Diego to helping you and they'd better line\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in to the raise that we use when we wake up that we've neglected one of the more impulsive products and daily routine\nThat old worn out toothbrush I'm Simon ... and I'm a product designer after I learned how important brushing your teeth as to overall health I was a dentist to cramp ... toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quit sensitive stomach vibrations that a gentle on your gums and built in time and that pulses to guide you around your mouth old typed into a beautifully slim and dies medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for\nThree shipping backed by thousands of dentists quip is one of the U.S electorate toothbrushes accepted by the American dented association upgrade your or a cat\nAnd stop brushing better with quit\nQuit start suggests twenty five dollars and it's guaranteed for life with regional plan sign up now I'd get clipped dot com slash W W O and you'll receive your first revealed pack free with a quip electric toothbrush that's your first refill pack three at G. E. T. Q. U. I. P. dot com slash W W out what\nI say to exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible as possible through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures and children learn more at St you dot org\nLike a girl not hardest hot cat it's a documentary on the number of women running for office in the twenty mid term election\nWe may\nHear what it's like to run like a girl in such a heated political climate last year we marched this year we run [noise]\nOne find us on apple ... cash for wherever you listen to your high gas\nOr dark you know be a part of the conversation by calling the shovel tell a hotline at eight six six nine zero seven three three three nine red eye radio and shut will tell us what matters is inside for superior cleaning the packs a punch reach for houses meter power cleaner with meter power cleaners new ideas for detergent\nYou get the most advanced cleaning technology available dirty deposits clogged you reject hers and reduce engine powered\nMeaner power cleaner cleans your system and keeps a clean guaranteeing minimum five percent increase in fuel economy and\nAbsolute ... combating the premature where ... pumps added up for several years for the best cleaning power and top engine performance grab a bottle of how's meaner power cleaner\nI'm here with a unit royal truck tires engineer to talk about the unit royal LD tend Dr ...\nYes the long lasting ... tennis smart way verified and concerts higher contraction that grips the road and there are actual tiger close I'm tired of course not\nAnd you call yourself an engine maybe next time\nAround all the time has what smart truckers one without the high price and there's a ... truck tires dot com today\nHey if you're driving right now and you'd like to read the informative and entertaining content found in the current September October issue of rotating magazine or if you'd like to listen that's right I said listen\nAs a voice easier on the years in mind reads the stories to you well listen up for starters the print edition preferred by Ninety percent of vote your drivers isn't down a little for free as an F. R. E. E. N. N. E. T. H. Petra location nationwide\nAnd if you're not fueling at a TA Petra location today while you're in luck you can simply go to ... king dot com on your tablet or laptop to read a page turning version\nWould you prefer to read wrote cheating on your smartphone will scroll down version is also available at Rhodes king dot com simply click on view digital version or current issue\nTo listen on your smartphone or Bluetooth connected headset or speakers just activate by clicking on the speaker icon for any story and voila just start listening road king dot com\nSure we talk about politics and so much more super talk Ninety nine seven WPN news wetter traffic and talk\nShow for every was living in a regional [noise] review\n[noise] all\nAcross America a six six Ninety red eye he is aren't currently non Gary McNamara\nThanks so much for being here this morning or early voting starts for us here today in Texas I don't know when it starts across the nation for other ah states but just Fifteen days away from election day in so much talk about as we've been doing throughout the morning back you we go let's talk to Mike in Washington state Mike Hi you're on red eye radio Hi Mike\nThank you this whole meal or the thing is just like it's just so frustrating for the voters because it drags on and on his coming up with nothing it's false accusations and it's I think we're going to win the house because of it because people are sick and tired of it\n... it's interesting because there there was a report that was out last week my dad said uh they expect mall or a judge to issue here is the core of his report\nAfter the midterm and I'm Wondering why after the midterm and and what's going on why is the media\nThey just a band in this story and I mean they've banned in this story completely there's really nothing going on like what you saw up until a I don't know what a couple of months ago maybe\nAnd then we're going to win the house I well I I don't know that we will but it's interesting Mike there what I don't believe was is this uh like the FiveThirtyEight thing saying that you know they an eighty five percent chance that the Democrats will take the house\nBecause you have to get into all the different polls and all these districts and I mean there's a ton of them but then we can break it down much easier into those thirty one tossup states right that that right now according to our she'd be there are thirty one tossup seats there are things like a Texas thirty two\nUh Pete Sessions and his Democratic challenger is someone who was in the last poll which was twenty eight days ago\nToday a was within a point now we know because we live here in in this area we know that that district is a north of Dallas County uh and so there has been a they're a demographic shift that's been going on\nThat shift has been happening really over the last uh probably\nA three to five years but really over the last few years especially because so much growth in this area brings individuals and for jobs right so there's a the the demographics change so that could be an actor\nWe don't know my question is why are we seeing those big posters and these\nA tossup districts and why are we seeing these new polls come out especially a couple of weeks out because if you're looking at the house you would think that there was some interest there by the media in order to hire these pollsters these major pollsters are to do a more in depth polls we maybe we'll see some starting this morning\nAnd into next week a and over the next couple of weeks as election day is one week from tomorrow but my question is really not if five thirty eight or any of them are wrong or because um who was it that uh had the\nBasically the the it was like a fifty fifty on the houses that NPR a couple\nOf weeks ago they said it was just going yeah yeah so and and it came out to eat yesterday that in what is it likely of voters or the Republicans are moving closer right okay that that came out just yesterday I think I have writers somewhere yeah\nThe the the story here but it's so much tougher to tell on those\nHouse seats I just I I Wonder that if we're going to gain in the in the in the Senate mhm and so that's you know that's looking at a populations across the state and right here or that you know I just wonder how they extrapolate it out to so many of these races where\nIf they're using the public polls out there there are so few of them so few and far between felt that you know if you're going to the internal polling polling which I'm sure as being done by the campaigns you would have the better you know a better guest sat that\nRight yeah it it gets here\nIt is a a a Dems mid term advantage narrows among registered voters yeah my new national poll a few weeks before the midterm election shows the chances of a blue wave are far from a slam dunk for the Democrats NBC Wall Street Journal poll released a Sunday shows forty eight percent of registered voters\nWould prefer having Democrats in control of Congress compared to forty one percent supporting the GOP these seven point gap is narrowing from a twelve point kept the Democrats had in September I don't know if that tells you anything though\nWell and and again I mean registered voters ... we've got to talk about likely voters and then again what the motivation is on election day this we've been talking about this it has changed since the Kavanaugh confirmations leading up to and since\nI don't know to what extent I Can't tell you it's motivated the left or the right more we do know there's no doubt the right is motivated Republicans are motivated right now are they more motivated than Democrats I Can't tell you that\nLaid on her with a monthly ... and lead under dot com website has all the latest news and information to keep your business operating efficiently from industry experts to award winning writer and columnist owner is the number one source of tracking information in North America\nInformational women are executive report blonde videos international trucking use it more easily accessible from fleet under dot com\nAnd if you're looking to buy or sell a truck fleet owner John ... towers I asset nation joined the donor on Twitter and Facebook here when others are safe and remember to visit we honor dot com every day for the latest\nIndustry news signed up to receive the flea owner free daily newsletter and you're happy a fleet owner in print\nAttention drivers here's the deal is a new tractors excellent wages what other for the company paid health care premiums weekly home time finicky that'd be a CDL so I'm not a career right out of school professional training and reimburse tuition joined the other six thousand drivers who choose to drive in Holland you work hard for us if we take care of you for more information\nVisit careers Dodd Holland regional dot com for call for for one seven or did you get on board with a holiday we make that\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little lists sixteen months one hundred percent on line\nSex fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in to the raise that we use when we wake up\nBut we've neglected one of the more impulsive products and daily routine that old worn out toothbrush\nI'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is to overall\nHealth I worked with dentist ... ... ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quip sensitive stomach vibrations that a gentle on your gums and built in time and that pulse who's the guy do around your mouth all packed into a beautifully slim and dies or the medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for\nThree shipping backed by thousands of dentists quip is one of the first electric toothbrush is accepted by the American dented association upgrade your ...\nAnd stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill plant sign up now I'd get clipped dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O\nNews weather traffic and talk we pretty much have all unique we're talking Ninety nine seven WPN\n[noise]\nCame running radio he is or hunting I'm Gary magnum\nOr eighty six six Ninety or a red eye so all in all when you look in the upcoming election now that the many people will be into\nBig time this week in the early voting starts but\nFifteen days from now sixteen days from now we'll definitely know what the situation or is it we're really entering interesting times ... it's a it's closing up a real will there be a blue wave less people believe that a lot less people believe that than they did\nA back or six months ago it looks like right now the Republicans will hold on to the Senate what will happen I don't know what's going to happen in the house but the Republicans for a mid term election where they hold\nBoth the legislative branches and the executive branch is a lot stronger than you normally we'll see in the mid term ... I can think I can make\nStatement pretty safely yeah right up there's a lot of energy a and a ... a lot of passion and a lot of excitement in Republicans for a mid term and\nIts excitement that I don't know that I have seen we talked about the ... the jailing of the party especially during the capital process\nThe jailing of the party I haven't seen I don't know I don't remember that in in my lifetime in terms of coming together so quickly on the recording on the core principles really\nAnd and the one thing that's happening right now that I that I just shake my head I said wow all you have a lot of Republicans saying\nSee this whole thing of the caravan was set up by Democrats and wanting to get boats for the election we went just the opposite this was the last thing that I Would want to see if I was a Democrat five to ten thousand illegal immigrants\nOr in a caravan going across Mexico in order\nTo uh come to the border right of the United states are white you know during an election time in some in the last thing I'd want as a Democrat right that supports Trump and his position on this call to build a wall [noise]\n\n\nAs soon as ... radio on Westwood One\nShop thousands of trucking assessed resolve line that I was eighty dot com or call one eight six six for Iowa eighty for your free catalog\nOver electronic he's proud to support the fight against breast cancer by partnering with bright pink travel centers of America and Petro stopping center to bring you the twenty ninth LCD bright pink CB radio is limited edition right then CB\nRadio is helping to save lives the wrestling ovarian cancer by empowering women to liberal activists for every radios old man who was makes me donation device thinking the fight against cancer the right to the\nRadio is available for a limited time exclusively a travel centers of America and Petro stopping centers\nTruckers quick question for you how\nDo you say entertained when you're not on the road some truckers watch DVDs on laptops\nOthers just bring a book on their home some people even resorted trucks dub GV are spotty lifeline no thank you me I like to one line at the end of the day with live HDTV in my cab\nWith just horrible satellite antennas it's easier than ever mounted to your roof are still until your day is over then just shut them up in your sleep or gas theaters are lightweight shut up and minutes and don't require a line for connection blood it gets even butter with dish there's no long term TV contract disappearing as you go programming you pay\nFor only the most you actually use check it out at this from my truck\nJohn John parents' lead owners want to give your truckers the comfort of home on the road is due to safety GV years perfect for leads to an older TV you love to watch it at home in the comfort of your care\nAnd you have to put up with trucks GV and over again find out more desperate mud drug dot com today restrictions apply\nRed eye radio and our sponsors are devoted to trucking safety that's why we're proud to bring you the red eye radio million mile club for twenty seven years we've been saluting drivers will surpass the million mile mark with preventable accident free driving\nBy reaching this milestone you can be a part of an elite club of drivers who share remarkable safety records and demonstrate superior driving skills\nIf you or someone you know it's a truck driver with a million miles or more driving with out are preventable accident register online at red eye radio show dot com that's right I radio show dot com\nThe red eye radio million mile club would not be possible without the support of our great sponsors including Petro stopping centers\nHow's lubricate or the ... family of companies motel six the sink Christopher fund cats scale and cover electronics we applaud the individual truckers athletes who drive with care and keep our highways say\nDiabetes high blood pressure anxiety med everyone's on them if you're a fifty year old male maybe it'd be free and you may even have type ... diabetes\nA million dollars of term insurance may only cost you about two hundred bucks a month\nCalled term provider speak with big Lu at eight hundred five nine oh Seventy five sixteen big Lew will find that turned my policy for you even if you have type ... diabetes are overweight or I have high blood pressure during providers help thousands of people like you think they can afford term life insurance\nHenderson bail Nashville\nStudio where dogs I mean I [noise]\nScales are tipped in your favor goal eight hundred and five nine oh Seventy five sixteen big Lu we'll answer your call and work to fit you into a term life policy that you can afford remember big lose like you\nHe's on meds to call eight hundred five nine oh Seventy five sixteen eight hundred five nine oh Seventy five sixteen machine\nAnd the fact that he is heading up the investigation makes it totally incredible\nCongressman Adam Schiff the ranking member of the house intelligence committee accounts ABC's This week there are several things the U.S could do in response\nWe are to suspend military sales we ought to suspend certain security assistance or and we are to impose sanctions on any of those that were directly involved in this murder\nOther members of Congress are saying the U.S should immediately expel the Saudi ambassador to the United states Lindy Kenyan washing\nVote mhm well then you may hurt my vote make my vote worth more don't vote if you disagree with me\nBut you know it's funny we've 'cause we were like\nWhen we're talking about polls earlier on a you know more ... more serious about that kind of more Syria I think I don't know about Syria is not any more serious maybe a little bit [laughter]\nI don't know\nWe were making a point earlier that the president today will Trump the Trump for a guy he will Trump for a guy he will campaign for a guy movie you once said his father helped assassinate\nKennedy [laughter]\nHey let's go out and gets just above [laughter]\nListen we we don't know that's where you need that's why in politics you need very short memories about the effort if you don't have any sense in the primary have\nNo friends it reminds me of the former governor of Texas Rick Perry and after the primary season to twenty sixteen and then you know he went on and and ultimately a well what's worked for President Trump when President Trump became President Trump but someone someone on the I think it was the NBC or something or you know are asking Rick Perry on a TV interview well\nSo what you're saying is a president or what you're saying it was Donald Trump was it your first row so he goes\nWell no I was my [laughter] best ...\nJust to point out the stupidity behind the question um but when you when you when you look at you know the polls and everything that that that are going on and and you kind of break down the numbers with you know what's what's gonna happen over the next couple of weeks\nAs people try and break it down we've we've said look the pollsters need to get into pre qualified people okay Kenyan name the three branches of government okay good you're in\nUm you know because this is we were talking about the house full specifically that there aren't a great deal of them certainly the internal polls with the campaigns yes but we don't we're not going to see that ah so you know go back to you know a number of them\nWere they haven't had a recent poll in Texas started to Pete Sessions\nYou know trying to keep his seat there are in taxes are there hasn't been a poll in in well twenty eight days ago\nAs of this morning and I'm like why is that why wouldn't there be want so you you look at that and\nAnd you do wonder about that you know methodology but then beyond the methodology it's the qualifications of the respondents because I think we have to start asking those questions because if we're if we're getting I told you during the break the top of the hour a mid showed towards the almost middle or and show meeting\nI said to you you know I'm quickly\nBecoming the old man that's screaming the world is going crazy but here's the thing I'm right I'll be in the history of old men I'll be the first one to be correct completely [noise]\nUm and also better um but the but the [laughter] the whole uh you know qualification of respondents in polls seriously but this is why I I really do look at the hospitals and I don't know I don't know five thirty eight is right and there are metal ...\nEverything look at I just don't trust anything right after Nineteen Ninety four and nobody really saw that coming right now but he was able to to uh you know a predict that coming so I don't know it as as I said the only thing I can do is look at it and say\nA President Trump and his numbers are the highest that they had been the NBC wash or the wall Street Journal poll that\nThat have that have come out even higher than Obama's was in in in twenty ten ... now the Democrats got hit heavy in twenty ten ... uh and there was a price to pay for a ...\nObamacare [laughter] yeah but but ah you know they they got hit heavy what you have here is\nYou have a president that his his approval numbers are higher now than when he started wasn't the case for Obama you have a his approval numbers are going up you have a United Republican Party which you didn't even have a month and a half ago you did not have ... you're not a Republican Party\nBefore the the Kavanaugh hearings for the most part\nAre you have a United Republican Party and it's not because they love Trump or the Republican Party so much especially the never Trump hers what they have seen is they have seen the Democrats and they have finally come to the realization that oh\nThey're really bad yeah yeah I don't know apparently they don't believe in\nIn in in due process you know and things like that so you you've got that going on right now but you also a very strong economy and you have an economy that's pulling extremely well in in a in some cases a better than in recent any recent time\nAh people extremely optimistic about the the uh the the the economy\nWe sit back in twenty sixteen when somebody called up and said you guys are going to be surprised when Trump wins and we said actually know he should win just because of the economy alone based on elections of of of the past and ah so you\nYou have that and then want to call it the Trump Card and\nYou have this and I don't know how this is going to affect the election but you couldn't pick of the worst time you and I were talking about the conspiracy theories we heard about the caravan coming in from Central America and you know ... ... you know a crossing and and crushing the southern border of Mexico to nominate\nGetting by all the police the hundreds of police that were set up to block the caravan which now some reports yesterday's say it's ten thousand illegal immigrants heading to crash into the U.S border\nIn the next couple of weeks and we hear his sister sorrow cirrhosis funding as the Democrats are funding is they're doing this in order to destroy Trump in the mid term election\nWent really um I\nThink the effect might be the opposite of that there has to look at who who's\nGoing to get the benefit if there's anything that can put the funding back on the table in terms of a real discussion a politically for the wall then it's something like that but but but even before we get there we talk about the motivator we look at the national polls on illegal immigration\nThe people by and large than with the president on that they may not it it starts to break down a little bit more when when you talk about wall but illegal immigration a and sanctuary cities and everything else the people by and large\nStand with the president not only that but I've heard that the Democrats are jumping on the I mean they're they're in the dark I started jumping on the caravan and thinking it's to their advantage right and and also they're jumping on the the whole voter id thing right voter suppression by having voter id will the vast majority of Americans agree with that\nSo Democrats were actually looking at this some Democrats are looking at the caravan and\nThe you know the the uh a voter id as this is something that can push him over the finish line in two weeks and I'm sitting here thinking to myself this is bizarre as Elizabeth Warren coming out with her fractions [laughter] with her ethnic fractions last week [laughter]\nOh by the way in in in other news we want to make sure that we cover everything yeah or Elizabeth Warren said she changed her mind and took a DNA test proving her heritage because Americans trust in government is at an all time low and she wants to rebuild it yeah\nShe said she changed her mind and the incumbent\nOr spoke at her second debate against Republican state\nA representative a jet deal in the U.S Senate race she was asked by the moderator why she had said in March that know DNA test was needed to prove that she had some Native American heritage she said she ultimately took the test reporting the result late last week that showed\nA relative six to ten generations ago was Native American ultimately she said she took the DNA test because she believes one way to rebuild trust in government is too is by posting a her full family history on line so anybody can take a look yeah\nDeal shot back that the issue is not about whether senators Warren ancestry it's about the integrity\nIn my mind I don't care whether you think you benefited or not from that claim it's the fact that you've tried to benefit from that claim and I think it bothers a lot of other people and it's something you haven't been able to put to rest since the twenty twelve campaign when she first mentioned having\nNative American heritage that led president Donald Trump to start start mocking her ... he had it I don't care what percentage she claims to be Native American I just care that I'm One hundred percent from Massachusetts and will be working for the people that state and but still it was bizarre that she decided to do that you and I were on vacation but I really sat there and went\nReally really I mean and it was it was set up a proactive and deliver it and then the result she thought beyond that just ... they're not just checking it out but then taking the results and proving something with it [laughter]\nAnd I'm a corrections throughout the morning while the Boston Globe I'm like yeah this is bizarre bizarre things are just thinking about this is the the really the three things that that uh the social justice warriors\nThat was driving them crazy first is cultural appropriation what you're operating might cultures yeah\nWhat do you know what ... what do you mean well the yeah the ...\nIn the nation came out and said look we you know we can't stand by her claims based on this test because this DNA tests doesn't assigned you know doesn't tell us which nation\nSomebody has chest pain or help with Asian inspired to fainting that's important and it usually would pay a lot of attention to if a person as a fainting spells doing exercise\nAny of those instances would be a reason to see her doctor for more information talk with your health care provider or visit Mayo Clinic dot org\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLately it seems like everything we use every day is getting an upgrade when the bad we sleep in the race that we use when we wake up that we've neglected one of the more important products in the daily routine that old worn out toothbrush I'm Simon ... and I'm a product designer after I learned how important brushing your teeth is overall health\nI was with a dentist to ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums and a built in time and that pulse who's the guy do around your mouth\nOld typed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three shipping attention to the section an quip the time magazine distinction and one of the best invention is that the upgrade your ... and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O U\nG G keeping you connected coast it goes from a comfort of your guests have to find out more dish for my truck ... from a drug dog gum um\nThere's no doubt increasing productivity and efficiency is important to you and make sure you're illegal promise not just them lying by simplifying operation on the track dot com or red eye radio show dot com forward slash ... promoter me when I\nMean on\nAttention all authors page publishing is looking for authors have you read the book and want to get it published he's publishing we'll get your book into bookstores and for sale on line at Amazon apple I do in other outlets they handle all aspects of the publishing process for you\nPrinting ... publicity copyright an editing go eat under advisor or one thirty six eighty nine now for your free author ... should get that seat under advisor or one thirty six eighty nine for your free author somebody should get again eight hundred bonds or one thirty six eighty nine\nPotential drivers here's the deal is a new tractors excellent wages whatever say company paid health care premiums and weekly home times finishing up\nYour CDL how about a career right out of school for fashionable training and reimburse tuition joined the other six thousand drivers who choose to drive in the hall and you work hard for us if we take care of you for more information visit careers Dodd Holland regional dot\nCom for call for the war was seven boys did get on board with a holiday we make ...\nDiabetes high blood pressure anxiety med everyone's on them if you're a fifty year old male maybe it'd be for you and you may even have type two diabetes a million dollars of term insurance may only cost you about two hundred bucks a month\nCalled term provider speak with big Lou with eight hundred five nine oh Seventy five sixteen big we will find that turned my policy for you even if you have type two diabetes are overweight or I have high blood pressure to providers helped thousands of people like you think they can afford term life insurance\nDemand or when we're talking about ... or all we're talking Ninety nine you know when you add by nine whether demographic and Tony ... will make sure the scales are tipped in your favor goal eight hundred and five nine oh Seventy\nFive sixteen big Lu we'll answer your call and worked to fit you into a term life policy that you can afford remember big lose IQ\nHe's on meds to call eight hundred five nine oh Seventy five sixteen eight hundred five nine oh Seventy five sixteen candles\nAnd [laughter] and our computers went down completely out of a half hour of I mean just everything dead yeah like we're already because look at the right here ... have also looked hard copy oh I just want to have a smartphone I doubt smartphone too we are going up we were doing the show on our smartphones\nAnd the hard copy of that even though it's a pain in the butt to do before every\nShow ... when the computer goes you're really needed at that point you had to reference back 'cause every book marked everything necessarily online on what phone ... the the ... are getting cool now especially well for anything right it depends on what you do for a living but he pretty much any\nIndustry there's there there are so many out so I guess that that can help you do you do for a living and for us it's of course\nAbout the news and the events and all of that and there are some really cool apps out there ah that that kind of you know bring you some stories and I I think do a really good job a Wall Street journal and and some of the others\nAre that have been really good and I rely more on my\nPhone that I Do my ... I you know I use my phone for for everything and so it was friday was friday or Thursday of last week and\nA and finally it was a couple of months the and and I finally went and ... because my least was up where I bought my phone ... like twenty bucks or something they're right by the Galaxy Note ... ...\nAnd they said well aren't you going to up to a Galaxy Note nine and I went I don't know mhm they said what do you mean I said 'cause I the galaxy ten is coming out it's not a no doesn't have the little style is apparently I said but that is\nFive gee ... and I've kept this thing over you know over three years and I've had bitch just about three years now so I\nHaven't and keep the next one three years I don't know what to do and I honestly don't know what to do and I got the galaxy notified and it does everything except\nI have to keep you know\nGetting rid of apps and because I don't have any storage space lapped right at thirty two gigabytes is all you had\nOn on this one so I keep running out of it so I have to now it doesn't take long if I Want to like the Gulf at ... you just sit there and you go when you open it up and you know go in and then make your Gulf preservation and then I can you know move on right and and get rid of that you know on stall that one\nBut that's really now that's the first world you know for a first world problem mhm that I had last week I don't know what to do I don't know what smartphone\nTo eventually get and if I Am going to pay what you have to pay for one of them\nI Want it for three or you know three or four years this next one especially right and the five gee it's supposed to be rolled out next year and ... and I want the five G. mhm and they said well yeah but you can get this us yeah but I got to pay a penalty at it I'm not going to pay that kind of money 'cause this thing suits me fine\nBut it really is amazing the work that you can do on your smartphone yeah and I think about just going back going back to when I started the show with you mhm the little flip on that I had [laughter] right yeah that just started having a member you could take the little video I mean just tiny but you couldn't do anything with it yeah it was on my little flip an order that was so cool\nYeah and it it is clearly and how our cat but\nYou get to well I Can't get the H. D. streaming because now I get to wear [laughter] I'll watch you know whatever you know videos comedians on YouTube lately this is what has been um but I'll you know if I'm or a you know whatever it is\nAnd I want the streaming to be you know age gee and the whole\nThing and I I I got a new phone a few months ago and it's got you know I've got with my as the card I've got a I think a half of terrified\nYou know I Know what do they always say oh you'll never used that as much as six months later you use\nTo ... you know you just said six months ago that wasn't me um you know it but it's but that's the [laughter] that's the nature of of how all of this is working because of the acts\nYou know do what we're expecting the apt to do\nBut then on the entertainment I mean how many millennials now watch forget about watching a Youtube video for a few minutes or on an airplane while you're traveling or something\nThey'll watch Netflix you know and and watch a full movie on their phone and I'm thinking wait a minute\nDidn't you just want the fifty inch TV he's six months ago but they want their phone to pretty\nMuch be their entire or to deliver I guess all of their sources of entertainment and that requires you know quite a bit of storage", "year": "2018", "show_name": "Red Eye Radio", "city": "Hendersonville", "day": "22"}