{"month": "10", "state": "PA", "station": "WVYA", "content": "Pension and treatment in the last three years we've reduced the amount of opioids we prescribe by fifty percent\nAnthony ... three medication assisted treatment centers to help patients recover from attacks and learn more guys in her ... had enough\n\nOf this was WBRC eighty nine point nine of M. W. B. I. H. D. one Scranton Wilkes Barre hazel than W. B. Y. I. eighty nine point seven Williamsport ... three of Maine's Berg Mansfield and WPRI you Ninety One point five of them ... streaming live a W. V. I. A. dot org\nThe puck spill translator at Ninety four point nine of them is made possible with support from the Richard L giggling junior charitable foundation\n\nThis [noise]\nIs radio hour\nEach week groundbreaking had talked to\nPet technology entertainment design design is that really would stemmed from Steve I'm never known that delivered and head conferences around the world gift of the human imagination we've had to believe in every possible thing the true nature of reality back and [noise]\nThose talks those ideas adapted for radio [noise]\nFrom NPR [noise]\nI'm Guy rise coming up [noise]\nUltimately we're interested in understanding how life works ah every year I have an inkling of where we are what we need to do is figure out how the brain does so that was a biological beach machinery we now have technology that could in theory you allow an individual to upgrade their email\nThis episode what makes us\nFirst this news\nLive from NPR News in Washington on Barbara Klein protesters are amassed on Capitol Hill in Washington D. C. and the hours before the Senate is expected to confirmed Brett Kavanaugh as Supreme Court justice among them is twenty five year old Matty laboratory who traveled from Scranton, Pennsylvania it's just hard [noise]\nIn the country that you love and believe in and have so much for it it's all about women's don't matter\nAnd I feel like that's what I get from everyone voting have an eye and\nMeanwhile on the Senate floor of this hour lawmakers are delivering speeches supporting and opposing Kavanaugh though is NPRs Amy held reports it's all about a foregone conclusion that Kavanaugh will take a seat on the high court as early as next week\nThirty hours have been taking down to today's final confirmation vote after the Senate advanced Kavanaugh's nomination on friday Joe Manchin of West Virginia is the only Democrat who was indicated he will vote for him\nMentioned was one of four undecided senators who signaled their support for Kavanaugh yesterday mentioned was explaining that he waited for Republican Susan Collins to do it for a new one I saw she was going to\nDo that I ... I don't watch [noise] then I [noise]\nWhen he was interrupted by protesters shouting ... Democrats are hoping to marshal the national protests over how the allegations were handled into votes in next month's midterm elections Amy held NPR News Washington\nSecretary of state Mike Pompeo has met with Japanese prime minister Shinzo Abe's in Tokyo today he says he wants to ensure the two allies around the same page before he heads to young young to meet with North Korean leader Kim Jong on\nMe [noise] and your wife for a unified view which will be of North Korea pumps\nOur view which will uh be successful in North Korea\nPalm pale will also try to make progress arranging a second summit between President Trump and Kim political tensions are rising in Brazil ahead of tomorrow's general election NPR's Philip Reeves reports\nJust over three decades after the end of military dictatorship Brazil could be about to take a turn to the far right\nPolls show a surge of support for ... into a congressman and retired army captain bullshit NATO has strong backing within the military his opponents portrayed him as authoritarian yet many Brazilians approve of his tough talk about crime and corruption and overlook his record of offensive remarks about gender of sexuality and race\n... dollars spent much of his campaign in hospital after being stopped at a rally\nTo win out ... without a needs more than fifty percent of the votes otherwise the top two candidates go to a second route later this month when both are not as expected to face his chief rival for another ... from the leftist workers' party but raised NPR News British new to\nThis is NPR\nSpanish opera singer month ... one of the world's greatest soprano has died in her home city of Barcelona she was eighty five\nSpain's king Felipe is expressing condolences calling ... a legend of universal culture with an unequal voice the BBC's Danny everhart report [noise]\nMumps or a couple of years voice was paying for the um power [noise] I've heard here in which he needs Madame ... [noise]\nShe wrote some humble background to conquer the world's greats opera houses ... may take key international breakthrough at New York's Carnegie Hall in Nineteen sixty five when she had to replace it probably in the title role of don't exist you create your own job\n\nStanding ovation lofty twenty minutes but she reached out beyond the world of Oprah to most famously singing the Jew at Barcelona with the lead\nSinger of queens ... appeal to home city and the anthem of the Nineteen Ninety [noise]\n\nQueen guitarists Brian May has posted a message on Instagram saying ... was an inspiration to the group and Spanish tenor Jose ... says ... had a voice of great range and a flaw this technique\nI'm Barbara ... NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites you point detection and sixteen programmed massages including morning night and stretch ... retailer nationwide more a dream wave chair dot com Andy ... each case the foundation\n[noise]\nCloudy this afternoon with ... and the lower seventies cluttered this evening with a slight chance of showers lows in the mid sixties and mostly cloudy on Sunday with a slight chance of showers or thunderstorms in the afternoon highs and the upper seventies you're listening to WBAI FM\nIt's the Ted radio hour from NPR I'm Guy Raj so imagine a big thick book about the size of a dictionary and inside that book each and every page filled with just\nThick book about the size of a dictionary and inside that book each and every page filled with just four letters just four letters\nPrinted over and over\nA G C anti drug for limited to be in a D. N. A.\nFour letter that 'cause every species in the planet has\nIs made up of four letters each representing a chemical compound arranged in such a way to make you feel\nThis is really where the information comes from is not the four letters but exactly how they're connected to each other so is it a G CG or\nA a G. or a CD or a a just by the way is Sam Steinberg I studied gene editing technology in Tempe says if you print it out all of the\nAsian g's and T's and tease it takes to\nComplete your entire genetic code which by the way is a lot of letters the genome is three point two or so billion letters you know you would have hit a lot of pages or if you had every pitch filled with ... g's and T's have\nEight hundred dictionaries worth of genetic\nCode or something like that for one person for one person so could you say that every single out of\nOur our our physical traits the color of our eyes are characteristics or personality traits come from for chemical\nI Would say that wow and that's actually all the information to turn a single fertilized excel into an adult human is contained within that singular Gino\nNow here's what's really crazy sixty years ago we didn't even know what do you know was the answer to the question what is life wasn't mystery and that of\nCourse the other question I wanted to know you know dynamic explain life after I got tired of of what was the essence of life\nLife whether the essence of life that was the question answered by James watching who spoke about it on the stage and and watch and along with his partner Francis Crick discovered the essence of who we are\nWe got the answer and plenty of February and fifty three and that was one Watson and Crick discovered the hidden language of DNA you know if you just put a next to\nPeter and the next to see you have a ... [noise]\nSo we saw how\nHome radio players will be there with our new music director Mike I'm ... and our new team with are now in America for finding ... pop I don't mean to not have six on W. V. I. A. F. N. [noise]\nSupport comes from wildfires in October is national seafood month a meal plan that includes fish is the heart healthy one while for salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more wild for seven dot com\nCloudy this afternoon with ... and the lower seventies cloudy this evening with a slight chance of showers lows in the mid sixties and mostly cloudy on Sunday with a slight chance of showers are thunderstorms in the afternoon highs and the upper seventies this is double ...\nSupport for the Ted radio hour comes from the University of Florida where solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nFrom Elijah Craig family owned makers of small batch Kentucky straight bourbon whiskey he lives a crank barge town Kentucky forty seven percent alcohol by volume Elijah Craig promotes responsible drinking and from the any tape the foundation\nThat Ted radio hour from NPR I'm Guy rise and on the show today ideas about who we are what makes us us\nAnd we've been talking to a biochemist Sam Steinberg who's been explaining how a new gene editing technology called CRISPR calf nine could make it cheap and easy to create humans who are you're basically talking like super heroes right like perfect vision superhuman strength perfect SAT\nScores right those are the ... I think if that's the science fictional vision of what\nChris brood could all well [noise] we have\nLong lists of gene variants associated with certain traits and some of those are silly like whether or not you're a morning person [noise] but we also have long lists of gene variants that are associated with things that might be desirable like having extra strong\nBones or leader muscles or lower sensitivity to pain or lower risk of Cornell heart\nAnd as those lists continue to grow\nWe now have a ticket\nPain or lower risk of Cornell heart disease and as those lists continue to grow\nWe now have a technology that could in theory [noise] allow an individual to upgrade their gee you know\nBut why would that be the science fiction version if it seems like that that technology is a promising like if there was a way to make a child more resilient a painter or give us a hierarchy is you can imagine that people would want to take advantage of all those things right\nI think they will I think the challenge then is to is to think about how we can ensure that that technology if it becomes available is used safely because we're certainly not there yet but also I think equitably\nThere's a great example in the world of HIV aids so it turns out one to two percent of all humans have a specific genetic mutation that is associated with HIV immunity because this gene variant they have\nEssentially masks theirselves and the HIV virus can't get inside\nSo what a friend you know delivered it into a fertilized egg cell into a human embryo so that that future child even though neither his or her parents have that mutation will still have HIV immunity\nWe might assume of course they would want that but it's still\nA game changing idea that we would be able to make those decisions and not just selected traits do inherit from the parents something we can already do with ... and genetic testing but kind of installing new variance into their genome that they would never have gotten from their parents\nIf it's like a pre emptive solution for for for something that may never come come to fruition like ... like we're just saying hey just in case we're going to give you immunity against the thing that you may or may not ever meet\nAbsolutely so do you consider that a an enhancement or that disease prevention is you know many people see they divide DNA rewriting or gene editing into kind of\nTwo different categories one being disease prevention and one being genetic enhancement but I think there are many that far right smack dab in the middle so yeah with the with the HIV immunity genes easier five\nThat's disease prevention but it's preventing a disease that you may never get so in in a way it's kind of conferring a genetic advantage and I'll just state again that's a gene variant that exist naturally but only one to two percent of humans have yeah so it's clearly giving you an advantage above what we might call normal human species functioning\nBut I mean I mean a part of me wanders\nSweeping during that you know you know what I mean like there's a project that just kind of has sort of happened since the beginning of human evolution and we were completely be up and being that\nThat's certainly one way of looking at it and yet evolution is inherently cruel [laughter] for someone that has a genetic disease that's kind of a a crummy hand that they've been dealt\nSo I think this comes down to the question of of how sacred is the genome and is it something that should remain untouched on tainted left alone of course where we do in any one patient that's a lifesaver for that patient\nBut when you think about human evolution over the course of hundreds or thousands of years now we're talking about a technology that will not only affect that individual\nBut that individual children and their children and their children and their children and\nSo that's where I think you have this very radio issue of directing future evolution you know\nSaying that sounds hyperbolic it sounds like science fiction but I think the technology will get to a point where you could use it ... embryos to install things like HIV immunity were strong\nFiction but I think the technology will get to a point where you could use it him embryos to install things like each of the immunity or stronger muscles and maybe someday gene variants associated with higher out you were being a morning person if that's what you'd like to be\nThat's where things really take off [noise]\n[noise] [noise] a hamster and Barry is working on a book about all this it's called a crack in creation gene editing and the I think of all power to control evolution you can check out his attack at ... dot com\n[laughter]\nHow today's show we're asking a very important question which is\nOkay do you have the answer do you know who we are\nA Idaho I Am [laughter] but\nAh every year I have a a a an area where we are\nThis is Steven Pinker I Am a professor of psychology at Harvard University and I write books on language mind and human nature\n[noise] so what what is it that makes us who we are\nWell there are some uh intricately complex circuitry in the brain\nFabricated over millions of years by natural selection that equip us with a set of motives and emotions and mechanisms for learning and thinking that make us who we are\nOkay there's a lot to unpack here so to begin to understand what Steven Pinker just said and to understand what accounts for the differences between us we kind of need to understand how far we've actually come in trying to figure this all out just even can you can you help us with us [laughter] okay I'll do my best\n[noise] okay just to get us started human beings have debated nature versus nurture for hundreds even thousands of years that is whether who we are our personalities are behaviors\nAre either entirely inherited from our parents or whether it all comes from the environment around us that when we're born our minds are basically like blank slates and\nAll of a structure comes from socialization culture parenting experience\nThat was Steven Pinker unattached age back in two thousand two in this idea of the blank slate it was especially popular in the second half of the twentieth century and it meant that a lot of us went through high school biology hearing stuff like that\nMan has no nature from historian who they are taking you got the man has no instinct and the anthropologist asked we want to give the human brain is capable of a full range of behaviors and predisposed to non from\nA scientist Stephen J go without ... why should have been such an appealing notion well there are number political reasons why people are found congenial foremost if it if we're blank slates then by definition we are equal because we're all equals zero equals zero\nBut if something is written on the slate and some people could have more of an others and according to this line of thinking that would justify discrimination and inequality\nAnd other political fear of human nature in fact I\nIf we weren't blank slate we can perfect mankind the angel dream of the perfect and then with the of our species through social engineering whereas if we're born with certainly stinks and perhaps some of them come down to about fitness prejudice and violent [noise]\nFirst of all they're a number of reasons to outfit human line here's a blank slate and some of them just come from a common sense as many people have told me over the years anyone who's had more than one child knows that kids come into the world with certain temperament and power\nPulled me over the years anyone who's had more than one child knows that can come into the world with certain temperament and have forgotten all come from the outside [noise] oh and anyone who I\nHad both a trial and they have certainly noticed that the child exposed to speech from acquiring human language when the house well presumably because of some difference between them [noise] anyone who's ever been in a heterosexual relationship notes that the minds of men in the minds of women are not English of um [noise]\nResent a program that includes excerpts from an age where you can't beat it wasn't like glory as well as early learning and ... and the ... the ... like you to enjoy this concert or don't see the ... make reservations\nBehind it or by phone five seven zero six five five to\nSupport comes from Kent ... owner of good neighbor walls specializing in design restoration and construction of field stone wall since Nineteen Ninety six he's proud to participate in show his work at the twenty Eighteen artist open house weekend in ... county\n\nCloudy this afternoon was highs and the low seventies clouded its evening with a slight chance of showers lows in the mid sixties and mostly cloudy on Sunday with a slight chance of showers are thunderstorms in the afternoon eyes in the upper seventies this is double ...\nSupport for the Ted radio hour comes from the University of Florida\nYou're noon eyes and the upper seventies dishes WBAI\nSupport for the Ted radio hour comes from the University of Florida where solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nFrom Elijah Craig family owned makers of small batch Kentucky straight bourbon whiskey Elijah Craig barge town Kentucky forty seven percent alcohol by volume you lied to crack promotes responsible drinking and from the any each take the foundation\nIt's the talk radio hour from NPR guy rise and on the show today ideas about who we are what makes us us and according to a humorist they Frank and this short talk it's not that complicated areas on the stage [noise]\nThis is the human test\nA test to see a few a\nTrees raise your hand if something applies to you [noise]\nAre we agreed [noise] yes [noise] been let's begin [noise]\nHave you ever eaten Booker long past your childhood\nIt's okay it's safe here [noise]\nHave you ever made a small weird sound when you remembered something embarrassing [noise]\nHave you ever purposely lower case the first letter of a text in order to come across as sad or disappointed [noise]\nHave you ever ended attacks with a period as a sign of aggression [noise]\nHave you ever laughter smiled when someone said something to you and then spent\nThe rest of the day wondering why you reacted that way [noise]\nHave you ever seen to lose your airplane ticket a thousand times as you walk from the ... to the gate [noise]\nHave you ever put on a pair of pants and then much later realized that there was a loose saw most up against us\nHigh [noise]\nHave you ever tried to get someone else's parents were so many times that it lock their accounts [noise]\nHave you ever had a nagging feeling that one day we'll be discovered as a fraud\nYeah see safe here [noise]\nHave you ever hope that there was some ability you hadn't discovered yet that you are just naturally great cast\nHave you ever broken something real life and then found yourself looking for an undue button\nIn real life [noise]\nHave you ever marveled\nHow someone you thought was so ordinary could suddenly become so beautiful [noise]\nHave you ever stared at your phone smiling like an idiot while texting with someone [noise]\nHave you ever uh subsequently texted that person the phrase I'm staring at the phone\nSmiling like an idiot [noise]\nHave you ever been tempted to and then gave in to the temptation looking through someone else's phone [noise]\nHave you ever had a conversation with yourself and then suddenly realized you're ... years so\nWith yourself and then suddenly realized your view [noise] so [noise]\nHow's your phone never run out of a battery in the middle of an argument and it's sort of sounds like the phone was breaking up with both of you [noise]\nHave you ever thought that working on an issue between you was futile because it should just be easier than this or this is supposed to happen just naturally [noise]\nHave you ever realized that very little in the long run just happens naturally [noise] have you ever woken up\nBlissfully and suddenly been flooded by the also remembrance that someone had left to you [noise]\nHave you ever lost the ability to imagine a future without a person that no longer was in your life\nHave you ever look back on a matter of them with the sad smile a bottom and the realization that futures will happen regardless [noise]\nCongratulations you've now completed the test you are all human [noise]\nIs writer and humorist they Frank [noise] got a couple of other great talks at Penn dot com [noise] on the show today what makes us\nUs [noise] can you explain what it needs to be conscious like what is it [noise] consciousness is\nThe most the ... thing for any of us and we all know the difference between being conscious and not being conscious\nDishes and al ... he's a professor of neuroscience at the University of sex in the u._k. consciousness is any kind of\nExperience at all whether it's a visual experience of the world around us whether it's an emotional\nExperience of feeling sad or jealousy or happy or excited or from experiences of intending to do something or being the cause is something that happens consciousness is the word that we use to sex inscribed\nAll the different kinds of experiences that that we can have ... I think that pretty much sympathy for conscious system there is something it is like to be that system where it's something that isn't conscious [noise] better than [noise]\nAnd how consciousness even happens and if we can recreate it artificially it's a question that we're still trying to figure out because what's more fundamental about being a human then knowing we exist\n[noise] and also explains more from the stage [noise]\nLast spring this question is so important because consciousness that each of us is all areas without that as well\nThat's nothing at all and when we suffer we suffer consciously whether it's through mental illness or pen and if we can experience joy and suffering what about other animals might they be conscious to do they have a sense of self and ask them teachers get faster and smarter\nMaybe they'll come a point maybe not too far away when my I find develops offensive at St existence now I actually think the prospects for concerts I pretty much\nIn the store I'm going to tell you our conscious experiences of the world around us and about sounds within it\nAll kinds of control to the ...\nWith three and the cargo olive in ... [noise]\n\nI Love this idea of a controlled police nation\nIs is that is that what we experience and how we experience the world that it\nIt's a control to loose nation we are just essentially hallucinating all the time\nI Love this rise I Wish I could take credit for it but but I Can't but I Love the fries you could\nNation we're just essentially hallucinating all the time [noise]\nI Love this rise I Wish I could take credit for it but but I Can't but I Love the fries because\nIt points out that everything that we perceive consciously or unconsciously but let's talk about consciousness for now is a construction of the bright I mean it's easy to think that we are in our eyes and objective reality is revealed to us through the windows of our eyes scanned\nWhat conscious perception is is basically just somebody sitting inside us go looking out there and they see a red tie boat I see a path in life than the\nGame there's matter writers ahead\nReal back to reality [noise]\n\nThat's right but the truth is that whole perceptions are active interpretation that acts of informed guesswork that the brain appliance encountered century die so I think the way I can think of it is that there is no line in the ... and I found that was\nGoing on in the brain or electrical impulses whizzing around and complex passing an out of all the oldest passing much in the in the brain ... appears [noise] [noise]\nAnd in some sense we we've known this for a long time so since meats and it's been pretty clear that colors red yellow green seven colors and no objective properties of objects in the world they are attributes of of reflected\nLight and and the brain the visual system will make inferences based on wavelengths of light and about what color or something it\nOr something as basic as color is not something that we just passively receive from the world we activity attribute it", "show_name": "TED Radio Hour", "year": "2018", "city": "Williamsport", "day": "06"}