{"month": "10", "state": "PA", "station": "WVYA", "content": "With one hundred plus bachelor an associate's degrees an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nWith one hundred plus bachelor an associate's degrees and exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nThis was your arts and information station W. V. I. eighty nine point nine of them W. V. I. H. D. one scratching Wilkes Barre hailed and W. B. Y. eighty nine point seven FM Williamsport WTO eighty eight point three of ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township\nStreaming live a W. V. I. I. dot org\nOur Pocono translator at Ninety four point three of them is on the campus of east Strasburg university\nThis was listener supported public radio W. V. I. F.\n\nThis [noise]\nEach week around breaking had talked to\nHead technology entertainment design design and that really would stems from the from ever known that delivered and hadn't had conferences around the\nWorld gift of the human imagination we have to believe in possible thing the true nature of reality that and [noise]\nThose talk radio [noise]\nNPR [noise]\nGuy rise coming up the definition of food is something that sustains a nerve Russia's we all think we taste food and ... and yeah that's an illusion food processing completely\nChanged or we can change the way we led by thinking about where we grow thing how do we grow things we ... this episode the food we eat first this news\nLive from NPR News in Washington I'm Barbara fine after two weeks of denials Saudi Arabia is emitting that journalists Jamal 'cause show Jay was killed inside its consulate in Istanbul the BBC's Martin patients report\nSaudi Arabia claims off point broke out between ... and the people waiting for them inside the ... which led to that\nBut many will question Saudi Arabia's ration of banks which suggests this was some kind of kidnapping operation that went wrong that's in stark contrast to Turkish media reports which said Mr ... she was tortured march towards a man is faulty dismembered\nTurkish authorities say they're searching for a show Jay's body and will reveal the findings of their investigation President Trump meanwhile calls the Saudi explanation credible and it's praised the kingdom for acting quickly but several lawmakers on Capitol Hill say they disagree\nPresident Trump leads a rally in El cone of that ad today the last stop and a three day campaign swing for Republican candidates in the upcoming midterm elections Trump was in Arizona last night and NPR's Don Gonyea was there\nThe president is highlighting news reports of a caravan of thousands of migrants heading toward the U.S border from Central America to warn of dire consequences if Democrats are elected it is signature Trump political rhetoric as sledgehammer\nHe calls a Democrat evil and wanting open borders to allow criminal elements into the country this is a new Trump campaign slogan from last night in Mesa, Arizona\nDemocrats produce Bob's Republicans produce job the president is trying to boost voter\nTurnout among his strongest supporters this trip was to Montana Arizona and today Nevada all places with very close US Senate contest\nStrongest supporters this trip was to Montana Arizona end today Nevada all places with very close us down at contests Don Gonyea NPR News Scottsdale, Arizona\nViolence has disrupted Afghanistan's long delayed parliamentary elections several people are dead after a suicide bomber attacked a polling station in Kabul today Jennifer glasses in Kabul\nThe suicide bomber was trying to get into a polling station when he detonated explosives killing and wounding police and civilians it is so far the biggest single attack on the election there's been a number of bombings and attacks around the country\nBoth the Taliban and Islamic state warn voters to stay away from the polls but Afghans have been defiant standing in long lines to cast their votes in a parliamentary contest that was supposed to be held three years ago it was far from perfect\nProblems with technology and logistics at polling stations opened late or not at all so the voting has been extended through Sunday at nearly four hundred voting sites\nFor NPR News I'm Jennifer glass in Kabul\nThis is NPR\nTens of thousands of protesters are choking central London demanding a second referendum on Britain's separation from the European Union among those they're London Mayor Sadiq Khan who says things have changed since the twenty sixteen vote you don't mind\nThe list for the dissent shouldn't be exposed to the British people is stranger\nMeanwhile fear over fake news and its influence on elections is engulfing Brazil the head of the presidential election a week from tomorrow\nAs NPR's Philip Reeves reports from Rio de Janeiro the messaging platform WhatsApp says it's taking immediate action to stop companies from sending math messages to influence voters\nJust over a week remains before an election runoff the ... a retired army captain from the far right is expected to win by a landslide [laughter]\nThe controversy is being triggered by newspaper report and Brazil sang business executives have bankrolled ... messages spreading fake news about ... leftist opponent Fernando a dashing\n... denying involvement\nThe scandals ... quantity of Hadiya motive for misleading election related materials spread all walks up which has more than a hundred and twenty million Brazilian uses workshops as his ... misinformation by closing accounts and using fact checkers\nAnd it says it's sending cease and desist letters to companies sending out about messages Reeves NPR News ... NATO\nAnd I'm Barbara Klein NPR News in Washington support\nFor NPR comes from NPR stations or their contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future are available where books are sold\n[noise]\n\nThirty percent chance of scattered showers this afternoon ... and the upper fifties mostly cloudy this evening with a forty percent chance are scared showers free overnight lows in the upper thirties and partly sunny on Sunday\nIt's the Ted radio hour from NPR I'm Guy Raz so how can I Want to do this week should we just eat well [noise] well\nVery good on route or we can do potatoes and\nShould we just eat well well\nVery good on route so we can do potatoes and root crops and carrots and Bob the solid crop [noise] the beach roots and the onions and the leaks and all manner of things is\nPamela Hearst by the way on the ... that comes from ... which is a small town in West Yorkshire Martin told him that it is in the north of England\nT. O. D. M. O. O. D. E. ad\nAnd it turns out it's one of the best places to be what great time suffered just a little bit hungry so great turnaround spreads and block currents and white currents and\nLogan berries and strawberries and all sorts of other crops hubs and a tail and you name it means we do a load of beans are edible flowers and all sorts of staying was\nPretty good for our polls um unpack\nWe can even grow melons and a ... so yeah there's there's no shortage of great things all that stuff\nGrows in cold gray and rainy Todd Martin and when we say in ... well\nYou will die in the middle of the time you come along the canal the suit growing on either side all the time ...\nIt's public food to ... you will to a police station on those a maze growing in the front door at least one member station ... absolutely absolutely and raised beds and private goddess people growing a heck\nOf a lot in front of our college we'd go to the railway station we put it in the park we put it along grass surges we've surrounded our house\nAnd we've had to both so if if I'm walking through through time more than that I just like [noise] no she like a bell pepper growing and just pick it up and start eating it nobody's going to say hey what are you doing that's my bell pepper no of course I don't\nKnow that note but the really interesting thing is that it it it helps throw back some attitudes about individuals' behavior because as I say we brought them at the railway station and all over the place\nAnd we've got big signs that say food to Shaq wow if you want to pick rocky 'til you want to come out and do you want to pick a pepper or whatever that ... to\nPick on the truth is nobody takes everything they pick you know ... and ...\nMartin has been like this for a decade or so ever since ... started a movement there to bring the community together around food and that is how her movement incredible edible was born the idea for it came to her on a train ride one afternoon when she was coming back from an environmental conference\nDuring the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with the game for Assad the war in treaty image to Gabriel ...\nTonight at six on W. V. I. A. about\n[noise]\nSupport comes from wildfires in October is national seafood month a meal plan that includes fish is a heart healthy one while\nFor salmon specializes in Alaska sockeye salmon carries a wide variety of other fish and shellfish find salmon and more wild for salmon dot com\nMostly Clyde this afternoon as a thirty percent chance of scattered showers highs and the upper fifties and mostly cloudy this evening with a forty percent chance of scattered showers for the overnight lows in the upper thirties this is W. vi\nSupport for the Ted radio hour comes from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information that build on dot a W at\nFrom staples with print and marketing solutions for business including color copies and presentations booklets in manuals signage and banners more at staples stores or staples dot com staples and from the listeners to support this NPR station\nIt's that Ted radio hour from NPR I'm Guy Raj and to on the show ideas about food a connection to it and its power to change so much about\nThe way we live [noise] I just bought a bottle of water and on the label it said gluten free interest as\nWell and it is [laughter] this is food writer Mark Bittman truth in advertising and marketing describing how over the past fifty years corn and soy and wheat have become staples of the western diet\nOne thing led to another corn and wheat and soy were easy to trade and easy to ship and easy to sell and easy to process\nAnd the government through direct and indirect subsidies encouraged the growth of what we now call mama cropping which means really really big fields of hundreds and hundreds of acres at a time planted in one crop\nWhich means really really big fields or hundreds and hundreds of acres at a time planted in one crop an endless rows that are all cultivated an harvested mechanically um but if you look in the late nineteenth early twentieth century of it what was being grown in Iowa\nIowa was I think the country's biggest or second biggest producer of tomatoes that was a huge producer of apples I mean this is a place where almost anything can be grown and now I Know I was just in Iowa and again you can't believe drive drive through miles and miles of corn and soybeans and there's nothing else but corn and soybeans\nOnce you have that stuff you have to figure out what to do with it yeah so now you know the principal uses of those two crops are animal feed\nBiofuels ethanol and then corn and soy oils for frying and highly processed food made out of corn and soy\nSo we got the beginning of the heyday of value added food which contained as many Soyuz corn products as could be crammed into it home cooking remain the norm but its quality was down the tubes there were fewer meals with home cooked breads desserts and soups\n'cause all who can be bought at any store not that they are any good but they were there\nMost bombs cook like mine a piece of royal made a quickly made salad with bottled dressing canned soup cans fruit salad maybe baked or mashed potatoes or perhaps the stupidest food every minute rice for dessert\nStore bought ice cream or cookies my mom is not here so I can say this now\nThis kind of cooking drove me to learn how to cook for myself and it wasn't all bad\nBy the seventies forward thinking people began to recognize the value of local ingredients we tended gardens we became interested in organic food we knew or we were vegetarians we weren't all hippies either\nSome of us reading and good restaurants and learning how to cook well meanwhile food production had become industrial industrial\nSadly it was at this time that the family dinner was put in a coma if not actually killed by the seventies home cooking was in such a sad state that the high fat\nAnd spice contents of foods like mcnuggets and hot pockets and we all have our favorites actually made this stuff more appealing than the bland things that people were surfing at home at the same time masses of women were entering the workforce and cooking simply wasn't important enough for men to share the burden\nSo now you got your pizza night so you got your microwave nights you got your grazing nights you got your fend for yourself nights and so on [noise]\nLeading the way what's leading the way me junk food cheese the various stuff that will kill you\nGet ... and ... like what you were saying earlier ally that has to do it with the fact that like we ship food all over the world right [noise] yeah I think part of the problem\nIs that this could go back to cooking because\nOne of the problems with the way that we think about food right now is that we expect to have any food we want within minutes\nIf you want to mango you're gonna be able to get a mango if you want it tomato you're going to be able to get a tomato well that is really not sustainable so if we start thinking more seasonally if we start cooking at home more with ingredients that are\nUm I think appropriate might be the right word and I'm Talking about more root vegetables in winter beats and turnips and potatoes and so on were really eating much more in tune with what nature is offering us and what nature is offering us is abundant it's just\nAnd so on were really eating much more in tune with what nature is offering us and what nature is offering us is abundant it's just not everything\nSo I mean you are an omnivore you eat everything but you you are a guy that a lot of people are gonna look to and say okay well you you've written all these books you are a food to eat like I think of luck that men and food and so we want to know what we should kind of eat\nWell I Do think you know I did this book called the ... going before six and\nA few years ago and um basically it's a strategy the more plants by saying let's be very strictly vegan until dinner time and then do whatever but I you know I think that the rules are very very simple I think the rules are one defining what food is often it's things that don't have\nLabels and you know of the head of broccoli doesn't need a label because that are broccoli we know what's in broccoli\nUm defined what food is eat only that and then within that category eat as many plants as you can as you can eat\nThat's it yeah\nWithin those rules do eat what you like to eat and you're going to have a good diet\n\nOverconsumption of animals and of course junk food is the problem along with our poultry consumption of plants now I there's no time to get into the benefits of eating plants here but the evidence is that class and I want to make this clear it's not the ingredients and plants it's the plants it's not the beta carotene it's the carrots\nThe evidence is very clear that plants promote health this evidence is overwhelming of this point you eat more plants you eat less other stuff you'll live longer not that the fact\nAnimals and junk food we don't need either of them for health votes have been marketed heavily creating on natural demands were not born craving whoppers or Skittles\nWe have to take matters into our own hands not only by advocating for a better diet for every one that's the hard part but by improving our own and that happens to be quite easy simple formula eat food eat real food [noise]\nWe can continue to enjoy our food and we can continue to spin yarns about our favorite meals were reduced not only calories by our carbon footprint we can make food more important not less and save ourselves by doing so\nWe have to choose that path\nThank you [noise]\nFood writer Mark Bittman you can see his entire attack at ... dot com [noise]\nUm well I Know you have to leave marks thank you thank you for doing this and I I tell you the one one of the things I really miss being paleo now for the next [laughter] who knows how long is a great recipe that you put out years ago was that pasta and spaghetti sardines bread crumbs\nHere about the great use of sardines great how can you not eat pasta ... you can get sweet potato pie which is which in paleo come from a housing prices gonna kill ya\nMarket messing that like forty percent of stuff in grocery stores is a real food but they had to estimate what what percentage of the stuff in grocery stores has added sugar I don't have to estimate at Seventy four percent will act Seventy four percent of all of the food in the store\nHas been spiked with added sugar in some fashion [noise] is it [noise] hidden in plain sight Oh absolutely\nIt says Dr Robert ... he's a pediatrician and a researcher at the University of California in San Francisco so there are fifty six names for sugar I mean did you know to know tuition digital them or are that's even yes\nSan Francisco so there are fifty six names for sugar I mean did you know to know tuition digital them or are that's even has the most famous now\nApple puree or evaporated canes you yeah my favorite because cages so you know students healthy right what happens when you evaporate dangerous you get sugar [noise]\nWill also have the latest on the caravan of would be migrants from Central America that's next time on all things considered from NPR News [noise]\nThis evening at five\nSupport for WBAI it comes from the economic Kirby set presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin ... at the ... center on Saturday October twenty seventh at five PM\nMostly Clyde this afternoon and say thirty percent chance of scattered showers highs and the upper fifties and mostly cloudy this evening with a forty percent chance of scattered showers for the overnight lows in the upper thirties this is W. vi\nSupport for the Ted radio hour comes from like fuck life lock with Norton works\nIn the upper thirties this is W. vi\nSupport for the Ted radio hour comes from life luck life luck with Norton works to help protect identities and the information on devices from cyber criminals learned more life lock dot com [noise]\nFrom twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash NPR radio\nAnd from the doors do charitable foundation who clinical scientists development towards support promising early career physician scientists and their research effort to improve human health\nIt's that Ted radio hour from NPR I'm Guy Raz today food why we eat what we eat and why our food is sometimes so much more than what we put on our plates\nWe all think we taste food and ... and yet that's an illusion in the sense that ah most of what you're tasting the fruit you the ... the to the smoky are actually being dictated by nostrils but our brains ... wonderful job of Ben ... and\nThe information I get from my nose and makes me believe it's coming from I ... this is Charles Spence a head of the ... research liberal tree ... university what is the cross model research laboratory [noise]\nI'm a celebrity here in the psychology department where we look at how the census interact\nAnd gas our mouth and nose interact when we eat but said or mouse and our years we didn't experiment\nWhere we're feeding people a potato chips out each time they put it into a potato chip we would change the sound that they could sometimes making their own crunching ... [noise]\nSometimes quiet sometimes boosting just certain frequency [noise]\nRebel show that as soon as you change the sound it changed the Christmas the crunches the freshness on these other attributes that\nChild says how our food sounds even looks can change how it tastes\nOne might call a white wine artificially ... with an odorless tasteless food dye\nAddict and appropriately you'll find the experts the winemakers will get fooled into spelling leaving tasting what they think because of red wine all the ... of the tobacco and the dark chocolates mistake fruits and so on even though they're actually tasting um it used to watch\nAll of this Charles says feeds into a larger idea\nThat how we experience our food is more than just about the ingredients here's Charles stats on the stage\nOr here this morning to tell you about the perfect meal\nRural convinced we can take the food we enjoyed the flavors ... of the wind in the last\nBut if I look at what's going on is created by the atmosphere in which we even drink\nOut of the question is how to study how to measure is I'm a tendency among the scientists like when you're a guest strong as it does think people like your eye and a brain scan to give them something to eat something to drink and see what you talk to the brain light up the hill that kind of your brain on flavor or New York astronomy is one problem here\nWhich is that in fact in the matter is that one of these ... how long have you back with your head 'cause I'm Still with a Cuban Yom ...\nPeriodically squid sin ah some drink you call it have you put your head all kind of a jolt and that ... the brain scan alignment but it's got to tell you something to do something useful but it doesn't tell you about the perfect meal because no one has had that perfect meal and one of those situations [noise]\n\nWhat exactly defines a perfect meal\nI'm actually a different for each and every one of us I mean it can be with somebody who's very very simple it can be fishing trips by the seaside or it could be you know so you all summer holidays by the beach somewhere these often will stay in people's\nCan we have some very very simple it can be fishing trips by the seaside or it could be on your summer holidays by the beach somewhere these often will stay in people's minds as as best meals but ... would I guess has to be there is um the mood you're in on the people you're with so because of social aspects of dining\nOr no one has ever had that perfect meal when the fighting with that part and I say\nPart of the thing about these kind of holiday meals that seem to stick with doesn't resonate in the end and you can have quite capture when you get back home he says you're moods you pretty relaxed your holiday less stressed Tripoli with your family and all these things come together to help enhance the experience and make it something sort of truly memorable\nYou think about like um how many times have you met her friend is just come back from a holiday and they say oh you've got to try this amazing red line that I tried in Greece and then you try it and you were sort of thinking\nThat phenomenon how we've all learned versions of its um I was going to problem solve rose a paradox that used to describe a northern Europeans um but to Kelly who gave for that so holidays to the Mediterranean\nUh nothing has some well or on the side of the sea sipping not Rosie wind blew looking into that love his eyes [noise]\n... you can hear the sounds of the sea smells of the ... and not tasteless like the best possible and you've ever had\nSo great that you want to buy a Baltimore case and bring it back to share with your friends and show a good taste you have in and you bring it back\nAnd then you're disappointed\nAnd your friends are like this is really cheap birthday\nThat and say well how is it something about when the bottles when they're playing with a cold and not you know sport the wind things not about a tool we never eat or drink no we're always somewhere in a certain environments in certain states of\nMind on all mental state and environment both together that kind of impacts what we think we're tasting and how much we enjoy it and we saw in a way to miss attributes I suppose some of the pleasure of the situation [noise]\n... pleasure into what we think about food\n[noise] in fact says Charles these ideas about how we experience food have actually convinced some chefs to try out certain methods of flavor enhancement and these are methods that have nothing to do with the ingredients\nFor in a good mood food tastes good isn't a bad mood I ain't never tastes good is this illusion about flavor we think what types in the wind the glass but our brain has about everything else the thousands of single the smell of assaulting the or the warmth of the San ... all of that play against their parents\nOn top chef capturing that insight or in the dishes or\nAny of that too much than style restaurant in in Switzerland to recent star restaurant\nA white tape across\nThe ... ... it was an eye glasses or and I play nothing there's just a plastic car people wait and see what he calls me here seven o'clock hour here and everyone in the restaurant and I can see what what type of the whole nothing will happen until somebody picks up seriously that plastic how I Wonder if they get up you know there are\nA little one euro tower and they make the millions out into the some of the table that that'd be laughing I didn't even guaranteed within a minute you have a whole restaurant full of moving fire was\nLaughing Dina's and that is the moment when the first is comes out because then he had successfully nothing more than one euro table enhanced the mood and he knows that will improve even the type of uh two Michelin saw a restaurant\n[noise] wow so so like from from a neurological perspective [noise]\nDo we fully understand what's happening like why that's the case\n[laughter] uh no so we didn't know that it does happen but it is the case\nAll of a classic example of just how important the environment is what we taste I work with a young chef coaches if you have here in London and he's ...\nKind of classic example of just how important the environment is what we taste I work with ... which is if you have here in London and he's been I'm sending out question I asked for several weeks have to ... his restaurant\nLet's say what'd you remember yeah I think they will ... flavor was the soup and people are convinced they can remember but in fact when you check was actually on the menu that kind of constructing something they experience where they felt about it and the brain kind of fills in the rest of the details of what they think they thought they reaching\nOur most chefs that you talk to are they on board with with your ideas did did they think yeah it is it is about the experiences right or they or did they say that this is totally absurd it's all about the food and the taste\nThe food uh of course there are still some chefs who say no no it is just what I was taught in Colorado School it is just the sourcing the preparation but nothing else but\nIt was the case so I'm In a restaurant or do you serve the food in their plastic cutlery nah as a silver isn't it and what does your restaurant exactly oh it's in the country has looking at it and they ... so they the same things in the one hand but clearly\nYou can have as little food just by itself it's always on something in a certain environment\nAnd those kinda contextual factors are always that it cannot be avoided [noise] so I certainly think there are a growing number of the younger chefs who are now pumping up starting out\nThere and Venus who who are really thing for the first time in history saying we don't need to just about the ingredients and cooking preparation techniques we really need to know about the mind those that were sitting [noise]\nCharles Spence wrote about his research on how we experience food in his latest book it's called the perfect meal\nYou can see his entire talk and Ted that NPR got dark\nSo let's get shifted a little bit more creative about what's on our plates because that's what my ... my name is Marshall bicker and you are in a log in in again where's lagging Indian", "show_name": "TED Radio Hour", "year": "2018", "city": "Williamsport", "day": "20"}