{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany\nThere'll be arguing HD Ninety point three rooms and Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three kinda G Harry W. N. C. H. D. one oh three point nine ... W ... one great aren't in\nW. W. E. S. H. D. idiot point I had not just go W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight point by Brewster and WAMC am fourteen hundred Albany\n[noise] I Will vote\nChicken from judge cabinet\nAnd with that declaration from Republican Senator Susan Collins of Maine Brett Kavanaugh was put over the top I'm Jeremy ... this hour a special report from NPR News the Brett Kavanaugh vote for the past three months the process has been polarizing and partisan would you say you've been through hell\nI I've been through hell and and so this is not a job interview\nThis hill contentious from the moment his name was announced and so I Will oppose him with everything I've got Kavanaugh's nomination almost derailed by accusations of sexual assault and here\nBecause I don't even if they said they did he tell you what happened to me a bad habit I and I were in high school\nSo how did we get here what does it mean for the court and the country they would have for the NPR special report on the Kevin albums first news [noise]\n\nLive from NPR News in Washington I'm Janine her on the Senate floor this afternoon Maine Republican Senator Susan Collins took away any doubt on where she stood on Supreme Court nominee Brett Kavanaugh saying she will vote to confirm him\nCollins says she did fine Christine Blasey Ford's testimony compelling but she said that are cooperating evidence the allegations of sexual assault should not prevented confirmation\nI Do not believe that these charging ten terribly per bad judge cabin up front surfing on the court\n[noise] how long is also praised having a judicial record saying he received rave reviews for a twelve year track as a judge and West Virginia democratic Senator Joe Manchin says he also will vote to confirm Kavanaugh\nMeanwhile President Trump says he is very proud that the U.S Senate capture procedural vote this morning me moving Kavanaugh one step closer to confirmation as NPR's Scott Horsley reports the final Senate vote is expected this weekend\nThe president's nominee cleared friday's vote by a narrow margin fifty one forty nine leaving some suspense over the final outcome but with Republican swing vote Susan Collins and Jeff Flake announcing their support for Kavanaugh he appears to have the backing you needs for confirmation at least that's the hope of White House spokeswoman Sarah Sanders\nSaid having all had demonstrated exactly what you would want out of a Supreme Court justice he met over the last several months and I think that I'm\nMoving into the weekend we certainly hope that the Senate will vote to confirm\nIf confirmed Kavanaugh would be the second justice Trump is installed on the high court in less than two years the president is also put dozens of conservative judges elsewhere on the federal bench Scott Horsley NPR News the White House\nIn Chicago a jury found a white police officer guilty of murder and the shooting death of a black teenager and twenty fourteen NPR Cheryl Corley reports it's the first time in ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nIt took the jury jumped a few moments to announce the verdict\n[noise]\nGuilty of second degree murder guilty of sixteen counts of aggravated battery with a firearm and not guilty of official misconduct\nAt the center of this case was the dash cam video of the twenty fourteen incident which showed Van Dyke shooting Seventeen year old ... McDonald sixteen times as he held a nine foot inside the release of the video the shooting sparked widespread protests\nMayor Rahm Emanuel said the jury reached its verdict and now the effort to build bonds of trust between residents and police my carry on Cheryl Corley NPR News Chicago\nWall Street with lower by the closing bell today that out on one hundred eighty points ten to twenty six thousand four hundred forty seven that's more than six tenths of a percent and that's act on one point one percent losing Ninety One points to close at Seventy seven eighty eight to five hundred dumped sixteen points ending at twenty eight fifty five this is NPR\nAmericans are borrowing more money especially for autos in student loans the Federal Reserve that's consumer debt rose by twenty point one billion dollars in August with seasonally adjusted three point nine four trillion dollars that follows again of sixteen point six billion dollars in July\nA Ukrainian filmmaker is stopping a one hundred forty five day hunger strike and a Russian shale standoff with President Vladimir potent who ignored appeals from around the world to let them go and there was looting Kim reports from Moscow that the filmmakers says he had no choice because for an authority it's we're planning to force feed him\nElection so began his hunger strike a month before Russia hosting soccer's World Cup tournament hoping to draw attention to dozens of Ukrainians jailed by Russia's annexation of Crimea twenty four teen\nFilmmaker himself is from Crimea and refuse to recognize Russian authority they're a Russian military court sentenced him to Twenty years on terrorism charges\nIn a letter published by his lawyer himself says he will end his hunger strike on Saturday to avoid being force fed celebrities from French President Emmanuel Macron to writer Steven King called on putting to release cents off but the Kremlin into that he moved out for a pardon himself who seem Kim NPR News Moscow\nTo people will share the twenty Eighteen Nobel Peace prize now do you um you are at an Iraqi woman who became a global advocate for victims after being raped and tortured by ISIS and Dr Denise ... a ... surgeon who treated countless rape victims in this war torn country\nThey were awarded a prize today for fighting against the use of sexual violence it's a weapon of war this is NPR\nSupport for NPR comes from and be used by over three million businesses for hiring more employers can post jobs and huge green or question to build their short lived a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\n\n\nThis is a special report from NPR News the Brett Kavanaugh vote I'm Jeremy ... in Washington\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nHe will change the balance of the Supreme Court replacing the courts swing vote Anthony Kennedy and he may have an impact on control of Congress and how much President Trump is able to accomplish for the remainder of his presidency\nThis hour how did we get here what does Kavanaugh's confirmation mean for the Supreme Court and what are the ramifications for the country a country that is in the midst of the me too movement and a month away from the mid term elections\nLet's start with the defining moment on the Senate floor when America found out that Brett Kavanaugh was all but guaranteed to sit on the court\nMr President I Will vote for judge Kaplan\nMaine Republican Senator Susan Collins with her closing argument in support of Kavanaugh that came after a contentious three months that began on July night\nHe's a brilliant jurist with a clear ineffective writing style universally regarded as one of the finest and sharpest legal minds of our time\nPresident Trump had promised to nominate judges who oppose abortion rights Kavanaugh's name came from a list given to the president by the federalist society an advocacy group with the conservative agenda with Kevin uh told senators that he viewed the landmark roe versus Wade decision\nSettled law as a judge it is an important precedent of the Supreme Court by it I mean roe v Wade and Planned Parenthood versus Casey been reaffirmed many times Casey is precedent on precedent which itself is an important factor to remember\nAnd I understand the significance of the issue the jurors credential issue and I understand the significance as best I can\nI always try and I do hear of the real world effects of that decision as I tried to do of all the decisions of\nMike Horton of the Supreme Court he also promised to be fair and impartial judge being a good judge means paying attention to the words that are written the words of the constitution the words of the statutes that are passed by Congress not doing what I Want to do\nIn early September Democrats used there two days of questioning Kevin a\nTo point out that they weren't given enough information about his record but after the first round of hearings Kavanaugh's confirmation looked like a sure thing\n[noise]\n\nSupport for WAMC sum up the films no showing tea with teams and monsters and many in right back\nThe children's act in Woodstock at Fahrenheit all the other night in both locations upstate films dot org and junk kill music offering school band orchestra rentals with school delivery to upstate New York in western New England locally owned and operated since Nineteen thirty John kill music dot com [noise]\n\n\n\n\n\nWe're back now with a special report from NPR News the Brett Kavanaugh vote I'm Jeremy helps in in Washington so what does the nomination and confirmation process we've witnessed over the past three months I mean for the Supreme Court the conservative Kavanaugh will replace Justice Anthony Kennedy who was for three decades the swing vote on the court\nWe heard from retired Justice John Paul Stevens this week is Ninety eight was appointed by Gerald Ford and said Kavanaugh should not be on the court\nIs the thing to the rule judge and he should have been in for a when he was nominated but I think that is his performance during the hearings cause me to change but I Would\n... an extraordinary moment of former justice saying that about a nominee\nWell what he said was that because Kavanaugh had framed his entire critique at his the second round of hearings as a partisan attack not just on Democrats but I'm liberal groups and I'm like liberal activists\nThat all those people when they come to the Supreme Court\nCould rightly maintained that they won't get a fair and unbiased hearing from him and you saw Brett Kavanaugh today the wall Street Journal tried to walk back is what he said called his emotional comments but he didn't say specifically which ones in any event Steven's point was that uh that he\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nLikely possibility given Kavanaugh's demeanor and how does that happen\nAlso that of justice accuses himself or herself\nIt usually happens when there's a set of rules you know that say you're supposed to recuse yourself if you had any financial interests if your family is involved in any remote way if you're some very close friend has some financial in something like that there's a whole set of cannons of ethical conduct but\nBecause the Supreme Court is the last place to go and if you recuse yourself there are only eight and they could be tied\nUm the justice has tried very hard not to have those conflicts\nYou can't take back a conflict like this and and I doubt that he's going to bow out out of a lot of if any cases because of what he said well\nTom Goldstein President Trump has had a number of rallies where people chant lock her up about Hillary Clinton and Brett Kavanaugh I got up there a before the Senate Judiciary committee and said that this was revenge on behalf of the Clintons\nCould he be a an impartial judge in a case that involved the Clintons were a left wing group he pointed out left wing groups as well\nWell the Clintons might be a very special case a given also his involvement with the can start investigation in terms of\nThings involving liberals and conservatives and yes there's I think zero percent chance that he's going to recuse himself it would be in in essence an admission that he can't be neutral in the front issues like abortion affirmative action same sex marriage and the like I can see him doing that I think that\nWhat he is likely to do is probably try and find some opportunities ah like he has recently with the editorial that he wrote to try and asked for some sympathy from the public and understanding exactly the kinds of pressure that he was under and when he was feeling in terms of how his family was\nUnder the spotlight we've these attacks and try and kind of walk back the sense that he has some active partisan and get back into the mode where in his original testimony when he first came before the the committee and really gave a this air of being a truly neutral arbiter of questions that come in front of him\nI Want to go through some key issues here that people are thinking about as they contemplate what Kevin I Will mean for the Supreme Court abortion first of all you know what do you think this is going to mean for the issue of abortion well I think it's\nPretty clear that at at least\nThere are five justices on the court who now will begin to whittle away at abortion rights they may not overtly reverse roe versus Wade but we could end up in a situation in which in those states where abortion is ... that the abortion rights are\nAre popular they remain and in those states where they are highly unpopular they know there is no longer a clinic there because they can't function under the rules that are laid down by the state law\nWhat about same sex marriage a Justice Anthony Kennedy a who is retiring who did retire or authored that decision Tom Goldstein about same sex marriages that issue going to come up\nAgainst well I don't think in terms of whether there is a right to same sex marriage it would be very surprising to see the court kind of do a one eighty on that there are areas of the law where there's just playing the joints where\nYou don't have to overrule something so to take abortion the standard is whether it's an undue burden on the woman's ... exercise of the right well who knows what that means you can feel into that whatever it is you want almost and that's why a more conservative court can allow more state regulation but there is a right to same sex marriage it's a binary light switch on light switch off thing I Can't see them doing\nIt where there isn't necessarily a right to\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n[noise] like a king you require the florists too is against same sex marriage to design\nA floral arrangements for your wedding or as we saw a ... a cake wedding cake or a photographer to take photographs or go to the photography studio and have them develop photographs of your same sex wedding\nI mean ... most states have laws that require\nEqual treatment of everybody you can't just pick and choose who your customers are as long as they behave themselves\nBut their ... you know so far that remains the law of the land as it is but unless Congress were to pass a federal statute requiring equal treatment of\nUm same sex couples for example it's not necessarily true that that would ... that would be true everywhere\nRight one thing that you're likely to see is a Supreme Court that's more sympathetic to religious objections to doing things for example involving abortion or same sex marriage in light\nThe county clerk who doesn't want to provide the marriage certificate that sort of thing the core right maybe there but the things that actually also help same sex couples really feel like they're equal maybe more in question what\nAbout the issue of presidential power President Trump is currently under investigation the Robert Mueller investigation is going on ... will will cabinet being on the court make any difference there well we\nWe know that he has said things that are at least ... the police questioned the correctness of than famous Nixon tapes decision which would which required the ... President Nixon to turn over tape recordings that incriminate at him in the end that we're putting into an ongoing criminal investigation\nUh it is true he's also said that it's one of if he cited it in a list of one of the great cases showing the independence of the judiciary\nBut he also said things that may be set had said maybe it was wrongly decided that we really don't know where he is on that what we do know is that he's a very very strong advocate of executive power in a wide array of areas\nAnd even proposed at one point that Congress should pass a law that would exempt that President from criminal investigation or civil suits while he's president\nNo on this question he only has one vote obviously but I Do think you'll probably get a lot of respect for this he spent a lot of time the executive branch you spend it in the White House and he was part of the Ken Starr investigation and so his view of how disruptive this can be to the presidency to have you know criminal proceedings in Grand juries like may get a lot of attention from the other justices\nWhere is Kevin are going to fit a on the court in terms of the other conservatives you already have Justice Alito Justice Thomas now justice Gorsuch pretty reliable conservatives and Justice Roberts as he become the swing vote on the\nOn Robert in it in a technical sense there probably are some cases like the case involving Obamacare and wishy cats the deciding vote but mostly\nObama and the other conservatives and in the court or at least pretty much in lock step on the outcome I mean he dissented in gay marriage he dissented in gerrymandering he descended in a whole bunch of other you know ... ... in a whole bunch of other cases as long as Anthony Kennedy was on the court he\nCould move the balance board a little bit when he decided that this was a subject I'm which he agreed with the liberals to some extent or another there's nobody like that in the center of the court now there are four pretty liberal\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nModerate liberals but they are on the liberal side and then five quite hardcore conservatives with chief justice Roberts I think really worried about the court institutionally not going too far too fast but uh that's probably what's holding him back I think\n\n\n\n\n\n\n\n\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nI'm Jeremy ... and the vote to confirm Brett Kavanaugh to the Supreme Court comes on the year anniversary of the me too movement it also comes a month before the midterm elections which will determine whether Democrats or Republicans control the house and the Senate and how much President Trump will be able to get done for the remainder of his presidency\nNPR congressional reporter Kelsey Snell start with you what does this mean for the key races coming up well\nThe one thing that we are going to be watching very closely as what it means for Heidi Heitkamp a Democrat from North Dakota who voted no uh she was under a lot of pressure to support Kavanaugh because she is running for reelection in a state that President Trump won with a very significant margin and twenty sixteen\nPolls have shown her slipping recently but she put out a statement saying that she was making her decision based both on the fact that she thought that his performance at that hearing was part of ten\nAnd because she worried about the message it would send to women and young girls about the treatment of the way that we're in an America treat the accusations of sexual assault\nShe is in a precarious situation here running against a very conservative House Republicans who had strong name id in that state\nAnd she as far as I can understand it from talking to people that know her well made that decision here but that got decision may be a really big and you know it may take a hit for her in the polls or the person I'm watching as Joe mansion in West Virginia who is the only Democrat who voted yes\nAnd he said that he had it looking out for what's right for West Virginia again a state that President Trump won fairly significantly in twenty sixteen\nDominican much in our NPR lead politics editor is this going to impact the races of people who don't have to vote on this I'm thinking of people like Beto O'Rourke a who's running in Texas against Ted Cruz\nWell he's got his own uh uphill battle and uh that's the fact that a Texas is Texas [laughter] that's a different situation but I think he's right to zero in on some of these red state Republican a red state Democrats who are running in places\nThat President Trump won you know Texas is among those kinds of places but first and foremost you gotta look\nA like a ... you mentioned that Heidi Heitkamp you know someone like John ... studies and no he said in Montana Montana's seems finding his race but Joe Donnelly who I really wonder if he would have rather\nKind of said nothing or before saying no immediately after uh that Thursday hearing uh I don't think Democrats quite realized how this was going to fire up Republican white men in particular this\nUh you know our NPR PBS NewsHour Marist Poll really showed a big shift among Republicans and it was driven by by men within the Republican Party\nOr who shifted very quickly\nAnd you know you have something like eighty percent of the Republican Party right now saying that the elections are a very important and that significant because that's basically a tie statistical tie with Democrats\nAnd Democrats had a ten point advantage on that over the summer now does that remain this high or does that recede given the fact that cabinet looks like he will be confirmed and the fact is\nDemocrats democratic women democratic men they have been fired up the entire time and are expected to stay at that level\nOkay well let's listen we've been talking to a a couple of strategies it's on each side here this is John ... a Republican strategist and here's what he thinks that this means what we found that\nIn the last week is there certainly seems that some Republicans\nStreaming support for W. AMC comes from Albany ... now open the mastery family children's emergency center a place for ill and injured children more information ... AMC dot EDU\nRepublicans are not huge fans of this president he makes up for that oftentimes by getting conservative Democrats\nBut at least from a lot of the surveys I've seen in the last week\n... the number one that the Democrats overplay their hand that there wasn't even that they didn't believe professor for they just were unhappy with water the tactics that they saw the Democrats taking and felt that uh they were they were just merely playing politics\nAnd um so it was interesting too it's ... it's ... the Republican Party of this and um I I think the question now ... can they keep that sort of small momentum going all the way until election day\nOkay so that's a Republican strategist this has democratic strategist Anna Greenberg\nI think it's very helpful for Democrats I think it's I'm going to ... galvanize women who are already feeling aggrieved\nBut I also think that the way from ... down and attack doctor for ... rallies and ... cabin ... ... really I just think all ... ... fairly easily been confirmed in the end um galvanizing Democrats either more\nTells me I was down on Capitol Hill earlier today I'm Talking with the protesters outside the Supreme Court and outside the capital and some of them said to me\nI think he's gonna be confirmed but that's just going to make me more excited to go out and vote for Democrats this November ... what do you think when you hear those two strategist who who is going to be more energized well\nI think that ... it's really hard to get people Democrats more energized than they already are\nI Do think that there is a question that has been raised not just Democrats but by some Republicans about how much they support for the president that we're seeing right now it's conditional on this issue we've seen that happen over and over and over again where a Republican voters and Republican elected officials will join Trump side\nWhen he's doing something that they like and then quickly abandoned him when he does things like ... rallies and says things that are politically incorrect or offensive\nAnd that's been the story of the relationship between traditional Republicans and this president since he was elected and in fact in the became the nominee so I it will be interesting challenge to see if that changes in that situation as well\nYou know what do you think\nI Want to wait and see I realized that I'm I'm a I'm really not helping you at all here but [laughter]\nBut I I don't actually know I'm inclined to think that this was a bump for Republican enthusiasm and it will recede at least partially because probably because some of the wives of these guys will tie them up and not let them go out and ... [laughter]\nAgo ... the thing is you when you're talking ... Republican and Anna Greenberg ... democratic pollster and both very good at what they do they're both looking at how this plays with their bases and like I was saying both bases are fired up over this right\nThe real issue I think for what's going to determine this election\nIs ... how those swing voters those middle road suburban women are ... you know go out and vote in this election do they go out and vote in some of these kind of moderate to right leaning district in these house district now look remember Democrats need twenty three seats the Internet twenty three seats\nTo take back the house I think that what we've seen over the past week or two\nWith how the Senate numbers have moved there's the very real possibility\nThe Democrats wind up losing out in the Senate\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAbility has been a real possibility from the beginning and it's starting to look more like the most likely scenario because the ... the Republican leaning a suburban women have\nReally moved very sharply and been sharply opposed to President Trump a all alone and there was a huge list of a potential targets in those are in those swing suburban district\nAnd the numbers in the Senate let's read reprise those or reprint those um there are a twenty six to ... twenty six Democrats up\nFor Democrats Democrat and only nine and then only nine Republican seats and and and that ten of those are in overwhelmingly red states so a of a democratic seats the of the seats the Democrats have to hold onto our and overwhelmingly red states\nIt's a it's it requires a huge uphill climb\nWell it's worse than that it's actually the worst landscape ever for a Senate map that any party has ever face in the direct election of senators\nI guess Lindsey Graham would say it's it's hell and beyond hell [laughter] so so ... for Democrats um we're in the midst of course of the me too movement and even during this entire nomination process for Brett Kavanaugh\nTo executives at CBS News became the latest men to be ousted ah it because of allegations of of a sexual misconduct let's say", "show_name": "This American Life", "year": "2018", "city": "Albany", "day": "06"}