{"month": "10", "state": "NY", "station": "WAMC", "content": "St fruit store deli winds and spirits downtown or after a locally owned a community minded grocery and specialty food store so it's like twenty two white tastings every Friday four to seven states recruit dot com [noise]\n\n\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. UNH the Ninety points reruns in Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown to UCLA HD Ninety One point nine Plattsburgh WC again HD Ninety three point three temperature Harry ... three nine tai chi and robots\nW. M. U. H. D. one oh five one great Barrington W. W. E. S. H. D. eighty point nine mount Kisco W. N. D. H. D. Ninety point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany\nFifth grade it was so long ago who can remember that far back to whole year's I remember out of\nLike the old things like we used to read at the vet Harry Potter and um we made ... Harry Potter and like they have like new kittens now I I I look back at them and I'm like I look at them and I'm like wow you know it's changed and like I Wish it was still there somehow\n[noise]\nThis is Caitlin end is in seventh grade at the ... school in Chicago\nJust you actually visit to fifth grade\nClassroom room to heaven and fifth grade teacher Mrs can't fairly often\nAnd reminisce about past\nRecently I went to the shelves and like the [noise] like books are still they're like are America\nYou're talking about the book or America yeah\nYou know when the nice thing about like\nWhen we used to read that book and\nUm how it like it showed that says faces them\nBack and fifth grade she covers a copy of our America one of those people who covers you get\nIt was her copy though\nThey're not allowed to write their name in front of books at her school they had numbers and my number but I think it was like thirty [noise]\nSo you did find them thirty\nYeah I did have stuck in it was just there with that it's paperback cover and you know everything that was mine is not mining [noise]\nI think that's the hardest thing\nFor Thirteen tonight they paid into another catch them into another teacher gay new environments and you know in different things to learning\nWell old memories to leave behind [noise]\nTwenty years from now Thirty years from now\nWhen you try to remember backed seventh grade what do you think you're going to remember from this year [noise]\nI think I remember\nBarely [laughter]\nAnd that kind of strength so to think that you're going through all these experiences now that somehow we're going to get wiped off the blackboard\nYet but um I even have that exchange now like I Can't remember things from like second grade a seeds like some things like I don't remember this kid he wrote this ... ... it's like you're ... pretty as heroes and something like that but like I Can't remember\nTeachers really well like I used to a different set of but that said okay\nFeel about that because you know it it's a part of me it's like you don't even remember what happened it's kind of hard because it it was it's been a part of you [noise]\nWhen I ask ... which of her friends she wouldn't remember it all someday\nIt wasn't hard for her to answer [noise]\nI'll probably forget I'm\nLenny ... probably forget Diana and Maria I'll figure it um [noise]\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nights five seven five one zero to register\nSomeday they'll just be gone race in the history of her life like they'd never been there in the first place we forget must have everything and then sometimes they go back and try to remember and it really is no predicting\nWhich people and places moments we're going to be able to get back\nTo Anna Maria\nWasn't the b._b._c. Chicago is this American Life from Ira Glass today in our program returns childhood where'd you find out what you do not find when you go back\nWhich I did and for acts act one benign mop head in that act of thirty four year old man investigates who he was nine years old and we're into thing or do he would just as soon not remember [noise] act to hunt gonna gray flannel suit\nWhich mortgage broker discovers that the punk band he was in in the seventies it's hot in Japan and decide to leave corporate life for a little bit and go back on tour [noise]\nLike three REO Sharon Shimon Peres David been gory an enemy American teenager who dreams of someday being the prime minister of a nation where he does not even reside act for\nWhen we were angels which we hear the purest possible student uprising imaginable the most innocent documented by an actual student using the crew to strolls telephone answering machine and the shiny red boom box stay with us [noise]\nHow ... was a producer in our program for many years and back when he was working here at today's show is a rerun you made a decision to return to his childhood you went searching for somebody named Susan Jordan who he and his sister Kate and the parents knew for about a year when I was growing up in Cincinnati\nThese are the things that I remember about Susan Jordan me and her three in the background and telling about the day camp I went to that summer I Can't get myself to shut up and they had alligators and snakes I can hear myself telling her and this one time this one alligator got out and the counselor had to catch it and on and on like that [noise]\nMen Susan flipping through one of the time my book rock and roll through the decades sixties [noise] she has long brown hair incredibly skinny\nIt's Nineteen Seventy five she's wearing bell bottom leave us a faded Jean jacket she points to a picture of a bloated man in the powder blue runs them jumpsuit sitting cross legged on the stage before a crowd of crying women [noise] that's my favorite picture of album she sent this information Tim somehow personal an important [noise]\nI mean to them writing in her car [noise] I'm going through this phase where I'm trying to notice things don't report to adopt I start trying to notice the guy in the motorcycle next to us he apparently doesn't want to be noticed especially by peculiar nine year old dying at him to the passenger window [noise] what are you looking at near\nA turnaround that in fact the dashboard did he say something to you Susan ... [noise] what did he do\nNothing or he didn't say anything it's fine look green like\nTell me what he said what did he say to you I stay silent [noise]\nI Know if I tell her what he said she'll get out of the car trying to kick his ass which scares me the comforts me to\n\nSusan Jordan was our babysitter [noise]\nShe watch my sister and me every day after\nStreaming support for WAMC come from birch are Center for weight loss surgery where the focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nFor a year Susan got another job\nThe\nLast time I saw it was Christmas Eve Nineteen eighty two sixteen the cashier at thrift way food supermarket in Cincinnati where I Lived the place is packed all twenty five registers or going people are lined up halfway through the back of the store I look up and there's Susan Jordan sheets miles we talk\nShe doesn't have many items so I check them through as well as I possibly can I Can't recall one thing we say to each other although I remember being distinctly disappointed to hear that she's married she has been some kind of business Kern her husband's probably something having to do with the building of redwood decks she seems happy\nMeanwhile there's a line of last minute Christmas shoppers mounting behind her\nAnd tell her to hold on I'm trying to get my break we can catch up she says great steps aside [noise]\nI keep signaling to my manager but there's no one to relieve me\nI keep Clinton behind Tucson making apologetic gestures\nI can still remember standing there holding on one bag of groceries smiling back at me\nFinally she tests man the shoulder [noise]\nI have to go she says but I come in here all the time I'm sure the around\nI worked at two or three for two more years I never saw Susan Jordan again\n\n\nThat drives me crazy that I never saw her again [noise] [noise] if I hadn't run into the store I don't think I'd care but somehow having her play with to me seems like a huge role in my life when I was a kid\nAnd then getting just a taste of what it would be like to talk with her as a peer\nI've never forgotten that moment\nI Know it's ridiculous but after years of thinking about her imagining what she's up to wondering if she ever things about me I just had to find her\n[noise] [noise] [noise]\n[noise] [noise] [noise]\nI start with my only lead to one former employer of her that I Know\nI'm I'm a do you want to know I'm calling\nI Do I Do\nWhy did you want to get off of it because my family wouldn't functional that my mom and it was pretty bad [noise]\n[noise]\nThe girl that I Lived with\nAt that time she was taken all on a truck\nAnd every time I Would come home they would always try to get me to take drugs with them or something and I I really do it much at all\nAnd it was really it was it was tough to come home and\nI I guess I must have been suffering a little bit I missed I really miss my little brothers and my little sister and they were gone\nAnd I was\nI guess ... maybe trying to substitute\nI think maybe that's one of the reasons that I remember that we remember you found that that was because I think it works both ways I think that we felt if that didn't make you feel closer to us I think that we we bonded and well\nI was desperately I guess I was looking for a family that I mean it [laughter] it's only you knew you probably wouldn't hire me but I mean that people are complicated now what I really wanted to do with spend more time with your mom and dad but I was terrified\n[noise] I mean I I just couldn't I couldn't do it I was too shy you know a lot of times they it was I thought they were asking me to stay longer and talk\nAnd I would just run out [laughter] and I'm sure they were [laughter] and they probably know what's wrong with her but I just couldn't do it\nSo you sort of talk to us that sounds yeah I was comfortable around kids because you know I had kids in my family [noise]\nUm\nThree times it's subjective are hard times came up on your settle hesitancy and Susan's with\nThe first I thought it was embarrassment but that wasn't that exactly no it wasn't until we've\nBeen talking for hours that I realized what it was\nShe was waiting for the other shoe to drop\nShe hadn't forgotten that are passed it happened she just forgotten that\nAnd for hours that I realized what it was\nShe was waiting for the other shoe to drop\nShe hadn't forgotten that are passed it happened she just forgotten that I witnessed part of it interfere it became clear the one that have been knowing under our entire conversation was that I was calling to say she'd damage me by exposing me to it\nI don't think I was kind of accent because there was a lot of turmoil in my life and in my family and that's what my fear is that I might have had some kind of negative impact on people\nAnd I know probably I did on a couple of people but they were my age but\nYou know you just want to remember yeah I was a baby that are the kids love me blah blah blah [laughter] but I\nI Would be devastating if I heard anything different Mm\nAre parts of the past you don't want to go back to ...\nParts of yourself you don't want to go back to\nProduce and Jordan the airport that I remember is he or she just as soon forgot [noise]\nAnd it turns out I'd also done my best to forget what I was like right there [noise]\nDidn't think of myself to swear at all but Susan Jordan reminded me in the gentle terms possible\nWhen I was nine I was anxious and bookish\nNot just the missing and all that I just kept thinking these kids don't know how to play\nWhen I went to your rooms I didn't it didn't seem like you had a whole lot of\nToys I Hope I've got this right but it just seems like they were mostly folks and more educational things I mean I remember you had planned it in your room a chemistry set\nAnd I didn't remember that Kate had hardly any dolls\nYou didn't seem quite as playful as other kids that I had they not just in more serious in general no mainly I think that's what I did was try to play\nAnd\nPerhaps the most amazing thing about this whole story and how little I memorized the deceived us about each other even if they had deceived us about ourselves\nAs Susan said at one point each of us remembered what we need to do about the other I needed to remember that part of Susan but she doesn't think about much her toughness in the face of hardship [noise] she said she mostly remembered the side of my family but I just take for granted that it was common our house that there are books there wasn't much fighting\nIt was the first time in my life where I had ever seen that ... people lived differently than the way I live and that's what I decided I wanted for my health and\nYou can try to return to childhood by looking at ... or visiting the old neighborhood or listening to recordings or you can find someone who knew you back then someone you haven't seen since they still carry within themselves to the picture of view it's unclear about the years in between\nThe remember you better than you remember yourself\nAnd you can do the same thing for\n\nOuts limburg he did that story back when he was a producer here at our show with the tide Kathy company called ... media and he's the host pod cast without fail\nTo hunting a gray flannel suit [noise] for a long time David filled with the president of a mortgage brokerage firm in Beverly Hills as you might imagine in Beverly Hills they handle rather large mortgages you dress is beautiful clothes clean cut\nBack in the Nineteen seventies in England where he grew up he was in a punk band called the automatic there were never really big commercial success but there were respected known in the history of punk by people who care about that kind of thing\nA few years back there were not series of connections he ended up visiting his teenage years to the first time but going back on tour in a version of his band in Japan here is that something that happened I mentioned it to a client\nAnd and I said well you know I played in um in the ... when I when I was a kitten and you're not really interested in and then the next day he sent me a copy of\nOver ... and said is this year and I sort of what it was and I watched as what can I watched the sort of price shoot through the roof you know and then I began to realize wait a minute [laughter]\nTime collectible [noise]\nSit down to brass tacks here how much we I think that one actually went to forty eight dollars I particularly like looking as you know all that sort of a\nHow the groups that were going and twenty five cents [noise] um [noise]\nYou know music business or offerings along punk climbs or that you know I don't want to live out nonsense at the time and it was good to see that uh [noise]\nYou know that as their their records when values you relate to I mean it was it was ... that history came out on the rights of it [noise] yes that ah there is a sort of Darwinism uh in in uh in record collecting [noise]\nWhatever that I went to conceive Vicki the drama and\nRicky collected everything and he very kindly lent me uh these two scrapbooks so I took pictures and and things out of that I just put it up on a had a friend put it up on a website and um\nThen I got an email from ... in um\nIn Japan's saying you know I play in Japanese ... band and a ... a ... percent yes uh-huh and uh you'll record changed my life wow ... ... and he found out through the website that you know there was an on released album W off you know if you could put me in touch with a ...\nOf a base Michael Woods we ... we struck up a deal and then they said well would you come over here and play some gigs to uh you know from my [noise]\n... so you go to ... how old are you at that point a forty five forty five years old a little bit\nOf gray hair coming in the middle ground hack coming in and uh and\nAnd what really wasn't sure whether I'm you know I'd still be able to do it because I haven't played those songs in twenty two years you know not in my shower no to any one uh I mean\nPrior to being married I mean I remember dating women for you know uh yeah you never knew that I played as it has had ever played ...\nPrior to being married I mean I remember dating women\nFor you know uh yeah you never knew that I played as it has had ever played ... no it wouldn't even come up wouldn't come out really I may not have a guitar hanging around but you know lots of other guys did to would you ever pick up the guitar and play for yourself yes I read a lot of songs my dog during this period [laughter]\nAnd for this I'm disliked\nI guess that because I apply myself think clearly and do a little work as well as some intelligence helping out I Am a geek in truth I'm far from it\nWhen you first read that to yourself when you first saw it of your reaction was it was pure horror [noise]\nRecently Adam Davidson and occasional contributor to our program found his old high school diaries\nAdams mama's Israeli status American and grew up in New York [noise]\nBody was in New York His brain as the diaries reveal somewhere else entirely\nI remember when I was writing it I remember very clearly although ...\n[noise] his brain as the diaries reveal [noise] somewhere else entirely\nI remember when I was writing it I remember very clearly although I don't say this and the diary that it was very clear to me that this was the diary of the future prime minister of Israel\n[laughter] I mean [laughter] um\nThat that I Would one day be prime minister and it would be very important for history for people to know\nThat the thought of a young Zionists does he compared its way to lead his nation [noise]\n\nNow our our regular listeners during this American Life might remember that that you've been on our program describing your experience in Israeli Army summer camp that was right before I started writing this\nDiary remain another sure let's see um\nThere's so much wrong with Jews in Israel that I'm going to have a job ahead of me\nOne thing it's a lack of any strong Jewish identity among most Jews this attitude seconds me huge ... of the world stop worrying about money and wellbeing\nI Do not know what exactly I'll do but if the situation continues when I'm a bit older than watch out world jewelry here comes Adam and wash out will generate here comes the Adam was on Capitol [laughter]\n[noise] wow [noise] [laughter]\nIt's interesting that you actually are addressing a readership [laughter] oh that's a that's a kind of amazing and that readership is is world jewelry [laughter] [noise] yeah [noise] the Jews of the world will one day read this book and we'll say\nIf he knew this at sixteen how could I be living so badly [noise]\nCan I ask you to just read one of the passengers were you talk about Israel\nSure let's see\nI mean I have this thing from January fourth Nineteen eighty seven I memorized the hope ... which is the Israeli national anthem a few minutes ago that will help me in Israel\n[laughter] amazing that you're in your prime minister of Israel in in what are the things I Need all that I Need to know the national anthem will probably address the funds recite that at some point or there'll be a ball game or something and the other thing is you're right exactly [noise]\n\nJanuary fourteenth Nineteen eighty seven Wednesday I'm getting more and more angered by the effects of Arab propaganda they blame the Jews for everything in the world including Jews go along with it\nEntirely ridiculous I mean I really thought this was this was a testament for the ages I really thought that this writing was powerful and persuasive to anyone who would read it would immediately become as scientists [noise]\nAt sixteen I had such an inflated sense of myself there was so much going on in my life than that I can remember and I wasn't recording it instead I was creating this ridiculous fantasy of you know\nI'm not just a sixteen year old kid who's you know having crushes and\nYou know a hopeless geek who can't get a girl that kept them and being scared and confused about growing old I'm I'm the future prime minister of Israel and everything you know goes through that but\nKnow I mean maybe the maybe keeping a diary when tells the truth maybe that's a luxury of being a certain you know kind of person\nYou know goes through that but I don't know\nI mean but maybe the maybe keeping a diary one tells the truth maybe that's a luxury of being a certain you know kind of person in a certain kind of situation may may maybe maybe other people in another kind of situation need to actually\nMake up a little fantasy ... yeah I think um\nI didn't have much anxious about being the future prime minister of Israel is very calm and confident and comfortable with it and I had so much extra but every other aspect of my life [laughter] I Know it's just kind of a maybe it was a good solution you know\nThere was a good way to deal with this with with what I was going through to have this space where I could just be [noise] you know one of the great ... uh\nI Wonder what are the sixteen year old Adam Davidson would feel it knowing that finally you know an audience of a million people with with getting some of the reading from this diary\nI think this would feel so small to that sixteen year old this would feel so nothing I mean I remember I was very disappointed in very sad about my parents\nI mean I was reading biographies of course of all the prime minister of Israel and and I would just think about my parents and just think how do you wake up every day knowing that your actions won't affect\nMillions of people like how is that enough motivation you know to have your petty little craft and your petty little family and your small little apartment like [noise]\nYou know it just seemed pathetic\nAnd I mean they have the kind of life that you know I mean basically I I Want my for myself what you're saying though is that the sixteen year old you would be cringing at\nYour thirty year old just as you're thirty year old version is cringing at sixteen yeah that's very true yeah [noise] he would be very very disgusted\nTo be heard this this radio peace\nIt would seem like I had settled in the ... that are way\nThese days staff writer for the new\nBoy when we were angels\nHistory originally came to us from a graduate student and we frankly studying trying it the New York Academy of art and she mailed a radio show a story that you wanted to get them to the program in which he had done is that she had recorded the interviews using her little micro cassette answering machine\nAnd then to edit the quotes that she had gotten which you would do is that she would record by dubbing and recording on to her shiny red boom box\nIt was crude yes but the story sounded remarkably like story from this American Life\nNow for one reason or another time considerations that unsolicited story never made it on the radio but this week's show however we had her put together another story using that same style which we added music to here at the radio station to make it fully sound like story on our show\nIndustry that an incident that happened to her back when she was an undergraduate [noise]\nKept university it's a pretty straight place\nEntertainment for most people means fraternity tigers\nIf not the sort of place you'd expect people to watch it guy sitting on another guy shoulders pretending to be a giant\nIt happened by accident in Nineteen Ninety four\nMy friend got with the top\n[noise] it was beginning of the school year and ...\nAccident in Nineteen Ninety four\nMy friend's got with the top\nIt was beginning of the school year and we were um [noise] out aboard one night and we decided to go up to the quad\nAnd [noise] I guess basically got up on a on phones back and he started yelling and screaming about how giant he was and how magnificent he was and I'm actually right after that I might have gone back and said yeah you know I also try it [laughter]\nAnd uh I guess that really struck a chord in me I thought that was pretty amazing\n... ... ... ...\n... I bought a lot about it um [noise] it actually good you know start me thinking along the killer pat\n\nScott talked about the idea one night in the dining hall\nThe next day on the way to class\nHe saw signs all over campus that that in both pretty\nI Am nine feet tall and see giant man eight pm on the quad\nScott had no idea who put them up\nHe learned later that the science were posted by a guy who had overheard him talking at dinner\nGot decided he would go to the cloud specified time and undertake the challenge\nHe would need to create a character in costumes for the giant\nGiant man of blooming boy\nFiber even know exactly it was something like you know oh I Am trying you know just the you know loud but just kinda weird [noise] you know sort of [noise]\nProtesting and [laughter] you know I don't know", "show_name": "This American Life", "year": "2018", "city": "Albany", "day": "27"}