{"month": "10", "state": "AZ", "station": "KTAR", "content": "Inspires asleep solution that works inside your body with your natural breeding process it delivers mile stimulation to keep your airway open during sleep giving you and your partner the wrestle sleep you need inspires FDA approved and currently offers more than one hundred and fifty leading medical centers across the country\nDoes it inspires dot com to learn more preview important safety information and find a doctor who can help determine is inspire is right for you the freedom to sleep like everyone else is just a click away at entire sleep dot com that's inspires sleep dot com\nOr whether he's Arizona's news agency a\n\nFollowing the advertisement by purity products these statements have not been evaluated by the FDA this product is not an end to design those trees to prevent any diseases\nWelcome wants to get a ... by purity products\nHave your host marks the most so glad you could join us today it's a power pack program in fact our story originally Fifteen Years ago when there were no TV show sixty minutes captivated\nAudiences around North America with a special segment of the French paradox\nYou remember the French paradox this is the counter intuitive concept that says red wine actually promotes our cardiovascular health and vitality scientists were intrigued well fast forward ten years Harvard researchers in Boston test over thirty thousand compounds searching for the one the best activates genes to control our weight\nOr energy healthy aging and even ...\nOver thirty thousand compounds searching for the one that activates genes that control our weight or energy healthy aging you needed longevity\nThe holy grail of medical research and what did they find out of thirty thousand compounds tested the single best gene activated was was beer its role yes resume its role the active ingredient found in that's right red wine five years later we're its role is one of the hottest breakthroughs in Lucille to healthy aging\nNow yesterday says that's just how the story so here in the rest of the story Dr Alan ... let me introduce Robert Twenty years documenting who's been institution in New York radio host in his own highly successful health radio show\nHe holds a PHD in clinical nutrition he's been a long time to formulate er and high level advisor for purity products that your husband welcome\nAboard mark always great speaking to you\nWell it's great to have you with us now let's assume this was also nominate on those people out there who just to vaguely familiar with the story what exactly is ... and why is it all over the news today\nWell first of all it sure is all over the news especially the Health News\nYou know I read about twenty health journals a weekend every one of them seems to have an article about resveratrol basically resveratrol is what we call a poly feeding all it's found in red wine that's found in purple grape juice it's found in berries it's even found and peanuts\nAnd the interesting thing about resveratrol is it's actually produced by plants\nBy plants themselves to protect themselves against any kind of injury any kind of infection and against any kind of radiation\nAnd the scientists really first became interested in resveratrol mark about Nineteen Ninety two when raspberry patrol was first isolated from red wine it was also found at that point in the skin of grapes as well\nAnd this is what got all those scientists interest in the early studies showed that resveratrol seemed to extend the life of fruit flies of worms and even some fish\nWell anything that extends the life of anything is going to pick the attention of scientists\nAbsolutely wow well\nBy two thousand six Italian scientist discovered that resveratrol extend the life of certain fish by fifty six percent and an even increased their swimming ability well also in two thousand six\nAnd here's what really got them interested a Harvard researcher David Sinclair reported that resveratrol counter acted the negative effect of a high fat diet in mice bite thirty percent\nNow given that most Americans seem to be on a high fat diet\nThis was pretty darn interesting well later research goes on to show that resveratrol had a very positive effect on a number of interesting things like blood sugar levels like normal cell growth and even seem to protect the intestines and the colon it definitely supported normal ... activity in the body it improved in ...\nThere was even a great study at the Institute of genetics and cell biology in France that showed that it dramatically improved indoor and storing aerobic activity\nAnd it even proved to support brain function great study from Weill Cornell Medical school in New York I was just reading at an even neutralizes free radicals but the reason the bottom line reason mark that it's all over the news nowadays is research at Harvard\nThey found that caloric restriction eating less actually slows the pace of aging and extended the lifespan in laboratory animals by forty percent\nWell whenever our health is threatened any perceived health threat like not eating enough\nCaloric restriction your body feels threatened this which is on what they called the longevity gene in your body it switches on sort of a protective mechanism that begins on a secular level metabolism changes\nYour ability to adapt and cope dramatically changes as a major positive influence on growth hormones and stress hormones there's actually an increase in repair all of this switched on by a family of genes we called sirtuin but here's the Cape\nAccording to the work done by David Sinclair at Harvard now this is important\nThe most potent activate or of the sirtuin genes in addition to caloric restriction is resveratrol and a great hope is that what's happening and all these animal studies all these amazing benefits with resveratrol will translate into people as well\nAnd this is why millions of people all over the world are now taking resveratrol pretty much every day\nWell this is amazing but let me just step back for a moment I Know you've been working with purity products for several years of their co Q. formulas but now that your co enzyme Q. ten which is just as important as reservists role especially for your heart healthy and uses in some ways it's got even more evidence behind so let me ask you this who needs it wouldn't gently is good for\nWell first of all let's take a quick peak or what a ... is a co enzyme has any substance in the body that speeds up the rate at which\nFirst of all let's take a quick peak or what a co enzyme is\nA co enzyme has any substance in the body that speeds up the rate at which a chemical reaction takes place it's like a vitamin in many respects well co Q. ten is the nutrient that is responsible for the energy that's the key word the energy that supplies your brain your heart\nYour liver your kidneys in fact we need co Q. ten to literally convert all the food we eat into energy\nWow that's amazing yeah well that's what it's all about not only that but it's a very powerful anti\nOxygen and I remember Marc let's go back to Nineteen sixty three that's awhile ago\nWhile I was teaching for the first time physiology and nutrition and I remember speaking about co Q. ten at that point and this is Nineteen sixty three\nAnd at that point it had only been discovered six years before Nineteen fifty seven at the University of Wisconsin where they were looking for what makes the heartbeat they were literally looking at hearts and saying what is making this darn thing beat well they found out that was co Q. ten\nAnd that co enzyme Q. ten supplies that energy in fact by Nineteen Seventy eight a British biochemist named Peter Mitchell wins himself a Nobel Prize for describing what he called the bio energetic energy created by co Q. ten\nSo we could say it's so darn important because your energy is related to the amount of co Q. ten and your body and without an adequate supply of co Q. ten you're living in what we call an energy deficient state your heart and he's co Q. ten\nIn fact the highest concentration of co Q. ten in your body is right in your heart muscle your brain needs co Q. ten at all times co Q. ten supplies energy not only to your heart and brain but to your immune system it supplies energy to your lungs to your liver\nSo needless to say we all of this energy\nThe key is that as we age and this is unfortunate levels of co Q. ten fall we lose this vital organic energy now in fact the research shows by the time you're eighty\nYou've got less than fifty percent of the co Q. ten and your body as you did when you were age twenty wow yeah it's really quite dramatic so I Would summarize co Q. ten by saying it's what I call it daily essential\nI mean you could eat sardines and mackerel and peanuts we're co Q. ten comes from but it's not going to be enough just from your diet\nWell documented and I was just ... that'd be quite a bit of research that it was time to combine to hook you tune and the research will know why he's proud of is cutting edge combination here because of their huge super boost formula what can you do for people\nWell its energy I mean the combination of these two incredible nutrients resveratrol and co Q. ten in fact\nOne of my students called the advantage I liked that so I adopted the term it's combining to amazing nutrients unto themselves which spectacular but when you combine them indeed this spectacular\nThis if we can call it that this is enhanced this advantage this cardiovascular advantage\nThe cardiovascular benefits benefits to your brain function and cognitive performance it even is involved in healthy aging and it's important for supporting immune function is great for your skin it's great for energy and enduring and a robot capacity and as we said before it\nSupports normal ... activity throughout your body and I think this is the ultimate combination not remember mark as we said the energy in your body is converted by co Q. ten add to that the benefits of resveratrol this combination\nEnergetic mitochondria without co Q. ten you don't have energy combine that with resveratrol I'm telling you pretty darn amazing\nNow that you present purity products occasionally does these free bottled give was this was something really special why is that is so important\nWell I mean you really get an opportunity you get a chance to see for yourself what I'm Talking about\nMean you can hear me speak about energy and physical performance and there's nothing quite like experiencing it for yourself\nI mean you hear me say some pretty amazing things\nAnd you say well that's pretty interesting but until you know until you try this for yourself by taking too soft gels a day of this co Q. super boost formula you're not going to really appreciate what I'm Talking about and the best way to do that is to call the number you gave out get your free supplied try it for yourself and you'll see the difference\nMore with our guest Dr Allen pressed movement but right now already products recognize leader in the field of evidence based nutritional solutions has an incredible free bottle offer today for the first thousand color so don't miss this chance\nLater in the field of evidence based nutritional solutions has an incredible free bottle offered today for the first thousand color so don't miss this chance his up the phone call now operators are standing by the callers free\nOne eight hundred Seventy one three six three three three one eight hundred seven three six three three three get the call and be one of the first thousand people and get your free huge super boost formula\nNot available in stores only directly to purity products you just pay for the shipping limited one per household the toll free number again one eight hundred seven three six three three three one eight hundred seven three six three three three\nOnce again we're talking with Dr Allen press them and now that the person we talked about the co Q. ten we talking about there is very strong\nBut you've added vitamin D to this and I knew there was a meeting with Dr canal from the vitamin D council and it's made me a believer would you added vitamin D and you've added vitamin B. twelve yeah now many people go through life not knowing that they've got to co Q. ten deficiency with vitamin D vitamin B. twelve those are also important to why did you had these factors\nWell right now I think at this point in time there's more research being done on vitamin D that pretty much any other vitamin or nutrient and the reason is listen to this one\nBillion people worldwide do not get enough vitamin D and their diet according to the New England Journal of medicine wow I mean that's a lot of people\nAnd we found out some pretty amazing things with all of this research now listen to this\nWhen most people think of vitamin D day I think a bone and bone health you might think of sunlight as well or vitamin D also plays a very powerful role as a supporter of the immune system\nIt supports immune system health and immune system activity quite dramatically in fact it also helps support brain function memory cognition it helps calcium build bone of course\nBut also it's very important for heart health for your blood pressure and the great new study out of Harvard Medical school and the University of Iowa talking about the importance of vitamin D and lung function it supports a healthy colon on top of all of that and a great new study out at the University of Hawaii talking about vitamin D and colon health\nI mean who thinks of those things right\nYeah that's amazing so I think it's a welcome addition to this amazing formula the co Q. super boosts formula in addition to that I said to channel look we should put some B. twelve in here as well it's called ... and\nI say that because the twelve converts the carbohydrates and proteins and fat that you're eating convert them into energy\nAnd this is all about energy and wellbeing when you're sitting down to eat your breakfast or your lunch or your dinner if you don't have enough to be twelve that great meal that you just said is not going to be converted into energy in your body\nDown in New York and so you try this unique combination of the one hundred milligrams of co Q. ten the advanced research all the way you find them in these huge super boost formula that you know what you're missing but it's what you mean by that\nWell I Want you to experience it I mean I Know you've heard about how co Q. ten and resveratrol and B. twelve and vitamin D and by the way there's even some vitamin a and this amazing formula how they all work together\nTo create what I call the environment of energy and your body not only physical energy mark but mental energy indoor instant stamina I mean who would that mean raise your hand if you don't want to energy endurance for stamina everybody wants it\nAbsolutely I mean come on and this is a great way to do that and I said ... you know let's held them about it and let's let them experience it for themselves\nWell absolutely must have been fascinating but Dr presents for people who are tuning in late husband a quick recap here what exactly is Cuba's ... super formula who needs it and why is this in your opinion the next generation of cookies supplementation and how does purity sleep bottle offer work\nWell look I think there is a distinct advantage to having energy endurance and stamina and if we were going to isolate the nutrients and create what we would call a daily essential and somebody gave me the assignment list the top five or six nutrients that we need to literally give us energy\nTo build endurance to bill stamina I went to list the following nutrients\nCo Q. ten resveratrol the twelve and vitamin D day this is the advantage of we're speaking about\nAnd rather than going out and buying all four or five of these different nutrients you get them all in one with the co Q. daily super boost and the idea behind this is you take two a day\nYou see how it works for a month and you'll find that you're going to be on the phone calling to order more because you're going to have a lot more energy just make sure you're in that first thousand of the day today and get a free offer that we've been talking about\nEthical or one thousand I understand the daily offer expires so don't miss out\nWell give it a number of the moment Dr precedent is always a huge pleasure always interesting talking with you\nThousand I understand the daily offer expires I don't miss out what\nWill give it a number of the moment Dr precedent is always a huge pleasure always interesting talking with you thanks so much for joining us today mark my pleasure\nWhy appreciate it now one more time have that pencil and paper handy right this number down it's one eight hundred seven three six three three three\nOne eight hundred Seventy one three six three three three that's the number I Want you to call its toll free operators are standing by purity products recognize leader in the field of evidence base nutritional solutions\nAs an incredible free bottle offered today on their revolutionary co Q. ten plus raspberry ... super formula now here's the deal be one of the first thousand callers today and purity is going to rush you out of free bottle of their co Q. super boost so you can see and you could experience the power of co Q. ten and reservists role for yourself\nYou pages for shipping only four Ninety five and the shipping is a hundred percent refundable by the way so wherever you are whatever you're doing make sure you're one of the first thousand callers today and lock in this free bottle you'll feel the energizing power pure these co Q. super boost in every single cell in your body\nAnd you'll be glad you get this product to try now remember when you think of coke Cuba's raspberry throw the cardiovascular health the cognitive and brain performance and think energy in a difference co Q. ten is the body's natural catalyst in the production of cellular energy\nAnd with ... spiritual you experience the amazing benefits of the key red wine molecule\nWhich you been seeing all over the news lately so don't miss this chance to pick up the phone and call now\nMake sure you're one of the first thousand callers today to qualify for the special radio offer\nThe free bottle of her expires at the thousand and first caller call now one eight hundred seven three six three three three one eight hundred seven three six three three three\nYou as we age co Q. ten levels decline as Dr president said get it back with co Q. super boost just like thousands of satisfied purity customers to each and every day you'll see and more importantly feel\nThe difference this is not available in stores and it's not available online the purity website only right here through this special offer\nLimit of one free bottle per household that toll free number again one eight hundred seven three six three three three one eight hundred seven three six three three three call right now operators are standing by\nThe call this free one eight hundred seven three six three three three one eight hundred Seventy one three six three three three [noise]\nThe proceeding was that the advertisements by purity products the statements have not been evaluated by the SEA this product it's not intended to diagnose tree cured or prevent any diseases\nArizona's news station Katie a our news on Ninety two three F. M. K. I. T. A. R. dot com and streaming live on the Katie a our news my mom\nWas guiding light or life some ... bell bottoms under a discount bomb and your mom wouldn't want us to cry now she'd ruined his two bands\nWith me ... all one came in\n... from time to cook but not anymore and provide asking how they look they look at ... ... ...\nEveryone calls lands here in general manager at culture on camel back I Want to personally invite you to come to our indoor shown to search for the perfect vehicle\nHere's what you can expect\nWe have some fantastic offers this month stop dreaming about the trunk of your dreams and come get the trunk of your dreams imagine now price below MS Artie bully loading you want heated seeds cooling seats twenty inch polished aluminum we'll check check check all safety features this truck launched nothing\nNow receive this erupted teen hundred ... grew gaps four by four with up to twelve thousand dollars off find out more coal joined candle back dot com\nPhone talk more about how unique this exclusive ever strong formula is from purity part of it even has a finished product clinically study which showed an increase in upper body strength in power but tell me what's in it and why you like it so much I mean this is more than just creating right\nOh absolutely I mean average drawn this is a very comprehensive formula pat I didn't want people to just feel stronger when they use Korea Team you know we're dealing with people in their fifties sixties seventies I wanted people to feel more comfortable as well so not only do they use the finest Korea teen money can buy this\nIn their fifties sixties seventies I wanted people to feel more comfortable as well so not only do they use the finest Korea teen money can buy this stuff from Europe to Korea pure Korea Team I also added something called coffee Barry extracting coffee Barry extract a powerful antioxidants stronger\nThan blueberries and strawberries helping to protect the muscles helping to protect the brain\nBecause we know are antioxidants systems aren't as strong as they used to be in our twenties and thirties but I also added some vitamin D because vitamin D incredibly good for the muscles\nAs well as the immune system in the bones so this is an all around when when you got your vitamin D you got your fruit XP for your joints you get your coffee very extract for the antioxidant protection and of course the finest creating money can buy the best of all packed\nToday it's free purity knows you're going to see these benefits hey we're talking about strength we're talking about power we're talking about energy we're talking about supporting thinking bone how this is a wonderful product when you try it you're going to live at you and I feel the difference and it's fast a week or two you're going to feel more powerful purity want you to have a free bottle\nPad I Know later on the show you're going to give out that phone number\nSure well you know we mentioned how great Korea Team works for women take a moment and share that story you told me before the show about the award winning Seventy year old senior swimmer who uses every strong\nRight right ... and I'm looking at our picture right now are printed it out for this show Seventy years old this picture she's got six medals around her neck it's the two thousand Fifteen national senior Olympic Games you know she writes to us that she was getting a little tired during workouts at age Seventy of course\nShe didn't have that same stamina but she fortunately heard about or ever strong formulas she started using it and almost right away was invigorated in her work outs and had more energy throughout the day\nI'm quoting from her she says I feel\nMy investment in every strong was one of the best choices I ever made it's always a morale booster when people think I'm fifty patch she looked fantastic wow and I hear this stuff all the time\nThat this isn't one of those vitamins are like a multi vitamin you take it you don't really notice the difference this is a substance that you can use to help get some of that youthful them and vigor back at some of that strength back it's wonderful\nYou know purity is giving away free bottle of ever strong but purely products didn't stop there in fact you insist they also give away a free bottle of their B. twelve energy melts which are great for instant energy now I Know that you love this combination tell us about the incredible double free offer\nYou you know when I think about Korea Team or I think about every strong I think about muscular energy I think about muscular power but it's all about energy and feeling great feeling energized and\nThe next thing I think that when I think about energy is be twelve when you think about energy think beat swelled and the problem is for fifty plus there's like you and me pat\nWe're not absorbing to be twelve as well as we used to in our sixties seventies eighties so when you supplement with B. twelve you tend to bump back up those B. twelve levels and that's what purity speeds twelve energy melts are all about\nTheir fantastic they melt in your mouth tastes delicious and you bump up those B. twelve levels and that's great because the twelve helps us make red blood cells which carry oxygen to the tissues also there's bias in in their for their hair skin to nail show people love the beats well been itchy mouse pad be one of the first thousand cause\nYou're just gonna pay six Ninety five per shipping\nThat if you don't notice the benefits we've been talking about today\nPurity will even happily give you a Becker six Ninety five so nothing to lose\nAnd you're going to love the benefits you get with this every strong formula\nSurety products a recognize leader in the field of nutritional supplements has an incredible free bottle offer today on clinically tested ever strong this is their exclusive combination of the elite Korea pure Korea teen amplified by coffee Barry extract plus a thousand units of vitamin D plus\nThe joint promoting action of fruit ... be more on here's how it works the one of the first thousand callers from today's show and purity can rush a lot of free bottle of every strong\nTo try for yourself or you pay for shipping that's just six Ninety five\nYou try it you'll be the judge it's that simple even the shipping is one hundred percent refundable\nSo you have absolutely nothing to lose even better as a special bonus today you also get a free bottle of purity B. twelve energy males to awesome products together free just call now one eight hundred five eight zero eleven Seventy five\nThat's one eight hundred five eight zero eleven Seventy five\nWas over three hundred clinical studies Korea teens supports sprang\nStamina power indifference\nHealthy brain function and basically helps you get back you're rich no matter what age you are so this is a double free bottle offer today now the double free offer is not available in stores or online it's only available by calling purity products on this special order line today one eight hundred\nFive eight zero eleventh Seventy five that's one eight hundred five eight zero eleven\nAnd purity products on this special order line today one eight hundred\nFive eight zero eleven Seventy five that's one eight hundred five eight zero eleven Seventy five call right now so you don't miss out\nJust to pay for shipping and handling and even that's refundable to get your free bottle of ever strong and the three B. twelve energy melts call right now operators are standing by one eight hundred five eight zero eleven Seventy five that's toll free\nEight hundred and five eight zero eleven Seventy five one last time slowly call now one eight hundred five eight zero eleven Seventy five All right\nSo we were so busy at the top of the show this ever strong formula does so much for us we haven't even touched on the incredible brain benefits I mean some of these studies you sent me an absolutely incredible\nAs you know I'm very into neutral picks the anti aging community has taken a keen interest in Korea teen specifically the cognitive benefits of Korea Team\nOh absolutely this is one of those areas where Korea Team really shine you see what we need to understand is that your brain even though it's only two percent of your body's weight it utilizes twenty percent of your body's energy this is a very thirsty Oregon for\nEnergy and just like your muscles soak up decree it seemed like a sponge\nBecause this is a naturally occurring molecule in the body it passes right through the blood brain barrier your brain or an soak it up like a sponge and it increases your Korea Team phosphate reserves in your brain so now in your brain you have more readily available resources to do was to recharge\nThose neuronal batteries to make more energy inside the brain so basically what do you notice what your memory is supported and pat scientists have done some amazing research here they found the people that take Korea teen it supports their memory it actually helps the brain to utilize\nOxygen better it supports memory and people that are sleep deprived\nIt's been shown to help people add numbers quicker and for longer periods of time without mental fatigue get this study pat\nJust five days five days of eight grams of creativity and supported mental tasks in subjects that we're getting rapid fire question scientists were asking them math questions in science questions over and over and over and they found the folks aren't Korea Team didn't fatigues quickly\nMentally so this is amazing stuff it's like a turbo booster for your brain it's like a super charge you for your muscles that re chargers all your cellular battery so all of your cells tissues and organs have more readily available energy\nOr dark I loved that ever strong appeals to athletes and people want to get more reps in the gym maybe get some extra power and their workouts but you're also saying there's a big push nutritional community to encourage people in their forties fifties sixties seventies and even eighties to leverage the power of Korea teen to stay fit strong and healthy but you say\nKorea teen is going mainstream you know I share the story with you before my mom who's in her late seventies now she's taking creating she works out a couple of days a week three days a week she goes to novelist does the free weights because she's got osteoporosis she wants to maintain her muscle mass and she wants to make her bones stronger and as you pointed out creating helps to do that\nAnd then the other three days during the week she'll go and she'll swim now she's not trying to get bigger stronger or anything like that but even at her age Korea teen has benefits\nOh yeah and what blows me away about that story 'cause you told me before\nIs that her medical doctor recommended for your team for and that just goes to show\nHow much more mainstream this is it's called every strong and it supports the muscles that supports your power your strengths your speed if you're an athlete you're certainly going to love it\nBut even if you're not an athlete you notice the difference let's go to another study one more review study this out of the journal current aging science December of two thousand thirty and I thought this was very cool\n'cause the researchers looked at the body of research out there on creating and seniors without exercise they want to see what happens when seniors take Korea teen and they don't\nExercise so I'm quoting here ... supplementation without associated resistance training seems to enhance muscular string power and insurance increase lean body mass for those that don't know what that is they're talking about muscle and improve the functional capacity of the elderly\nThey go on to talk about how it supports bone health as well and then they finished with this creating supplementation without training and the elderly\nCould potentially delay atrophy of muscle and unproven difference and strength so here again we see bottom line ... is very very effective it's gonna help you to feel stronger whether you exercise or not it supports your strength and power your brain health", "year": "2018", "show_name": "The Drew Steele Show", "city": "Glendale", "day": "22"}