{"month": "10", "state": "AZ", "station": "KAWC", "content": "In the Nineteen fifties the girl who took apart radios for fun wanted to tackle advanced math\nHer guidance counselor had other ideas why do you want to take calculus to just going to grow up and have babies how she became a pioneering astronomer any way on the next big picture science [noise]\nTo the evening at seven on key WC eighty nine ... [noise]\nIn observance of Hispanic heritage month assemblies library will host the ... annual division between the art work of art is it continues through October ... you got the San Luis branch library and Seventy five six seven you you can find further details you my library dot org\nIt's eight o'clock and you are listening to K. A. W. see you\nTuesday evening at seven in ... the eighty nine ... than [noise]\nIn observance of Hispanic heritage month assemblies library ... annual mission featuring the art work of art is it continues through October fifth you got the San Luis branch library ... Seventy five six seven you you can find further details you my library Donald lord\nIt's eight o'clock and you are listening to K. A. W. seat Yuma K. A. W. P. Parker eighty eight point nine up in in ... a WC dot org a service of Arizona western college for more than forty five years\nBringing NPR News to the Colorado River communities of low pause and ... counties\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and reviewed publications in the world doing K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven and St Paul's cultural center\nFor information visit K. A. W. C. dot org ... made possible in part by a grant from Arizona humanities\nWhether in Parker tonight mostly clear skies in the forecast the low around sixty two and a calm west northwest breeze sunny skies tomorrow with the higher Ninety One and a light variable breeze\nIn Yuma tonight clear skies but the low around sixty eight in northwest window five miles per hour tomorrow sunny skies behind your eighty nine and a south south west window five to ten miles per hour\nLive from NPR News in Washington ... Stevens\nMania was Senator Susan Collins says she'll vote yes to confirm Supreme Court nominee Brett Kavanaugh Karlan says Christine Blasey Ford's testimony that Kavanaugh sexually assaulted her when they were teenagers was compelling but should not be the judge off the bench\nThere are some who argue that given the current special counsel investigation President Trump should not even be allowed to nominate a jazz says that argument ignores our wreaths and head straight\nCollins says the Supreme Court confirmation process has been declining for over Thirty years and she hopes the Kavanaugh nomination is where the process is finally hit rock bottom meanwhile Alaska Senator Lisa Murkowski says after agonizing over Kavanaugh's nomination she decided to vote president during tomorrow's confirmation vote\nAnd Chicago police officer Jason Van Dyke has been convicted of second degree murder and sixteen counts of aggravated battery and the shooting death of a black teenager as WB easy St Patrick Smith reports Van Dyke was let out of the courtroom in handcuffs\nVan Dyke shot teenager Laquan McDonald sixteen times and two thousand fourteen shooting was captured on video shows McDonald walking away from police and Van Dyke unloading his gun continuing to shoot even after McDonald's falls to the ground\nDuring the trial that I took the stand and tried to explain why that video didn't match up with his perception the jurors spoke to the media after the verdict on the condition that their names not be revealed and they were asked what they thought a Van Dyke testify this is a juror number two four or five\nHis testimony was incredible to me\nHe was trying to remember stuff that he's saying that maybe wasn't from\nVan Dyke now faces at least six years in prison for NPR News I'm Patrick Smith in Chicago\nUs job growth continued last month the ongoing demand for workers pushed the nation's unemployment rate down to three point seven percent level not seen and nearly half a century but NPR's John Ydstie reports that the pace of\nThey thought a Van Dyke testify this a juror number two four or five\nHis testimony was incredible to me\nHe was trying to remember stuff that he's saying that maybe wasn't true\nVan Dyke now faces at least six years in prison for NPR News I'm Patrick Smith in Chicago\nUs job growth continued last month the ongoing demand for workers pushed the nation's unemployment rate down to three point seven percent level not seen and nearly half a century but NPR's John Ydstie reports that the pace of job growth slowed in September\nThe economy added just a hundred and thirty four thousand jobs in September the smallest months they gain any year Sarah houses senior economist at Wells Fargo says Hurricane Florence was partly to blame but workers are also getting harder to find\nSo we think is given how scarce flavor is that we're likely to see that the trend in in hiring continue to flow\nEconomists have been predicting a slowdown in hiring for a while as the number of potential workers on the sidelines of declines still the average job gains over the past three months to remain strong at a hundred and Ninety thousand a month John Ydstie NPR News Washington\nMost street stocks close lower today on worries about rising ... and interest rate the Dow Jones industrial filled a hundred and eighty points this is NPR News\nA navy veteran in Utah accused of sending suspicious letters to President Trump into defense officials\nIs charged with threatening to use a biological toxin as a weapon thirty nine year old William Clyde Allen mailed on bulbs containing ground Castro beans the poison rice and has made from the pie product of castor oil production\nThe nation's largest mattress retailer is closing seven hundred stores as it seeks chapter eleven bankruptcy protection court documents show that Houston based mattress from\nHas more than a billion dollars in liabilities and more than fifty thousand creditors mattress from has more than three thousand us stores and has been aggressively expanding award winning Claymation animator Wilmington has died from Oregon Public broadcasting April bear has this remembrance\nThen wanting Academy Award in Nineteen Seventy five for his short film clothes Monday's in twenty Seventeen he noted in a documentary it was the first time and stop motion project with every nominated for an Oscar\nHave to remember that this is a time when around the world Ninety eight percent of animation was to D cell animation you know the classic uh looney tunes tons of them\nSo just to even create an experiment with this was way out there and\nSubsequent any wins and hid Claymation commercial promoting California Raisins propelled them since the top tier of the global animation community paving the way for dozens of original features and short\nSentence family said Thursday he died after a twelve year battle with blood cancer he was Seventy for NPR News I'm April there in Portland, Oregon this is NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the artists foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at arcades foundation dot org and the corporation for public broadcasting\n\nAnd it said I'm sick stay with us for a night of beautiful jazz here on K W CD point nine FM and K. A. W. C. dot or\nDo you mean county library will be hosting a live performance of the territorial chapter of the Arizona old time fingers association it will be next Tuesday October night from three to five at the main library which is located at twenty ninth to oneself twenty first driving Yuma it'd be like more information you can contact us\nAnd its partners at ... foundation dot org and the corporation for public broadcasting\n\n... stay with us for a night a beautiful jazz here on can you do when you see the point nine FM and can you do when you see Don or\nDo you mean county library will be hosting a live performance of the territorial chapter of the Arizona will type figures association it'll be next Tuesday October night from three to five\nAt the main library which is located at twenty ninth to be one twenty Bruce driving you it'd be like more information you can contact us at night to eat ... for seven six nine zero Mm\n\n\n\n\n\n\n\nMade made a movie\nWhen you tell me well\nIs ... in the mid\n...\nMy heart\nOver the ...\nTo ...\nMusic\nMom how\nOver the ... the numbering\nMusic in\nNeeding new you know we'll\n\nLying in the\nMountains or riding on you\nWhen you leave them in any way\nNeed\n\n\n\nThe\n\nMy man named\nKnow if you're\n\nBeautiful rendition of sky lack from refined barber the music in the night\nWith the beautiful locals of Darren Tucker Rosalind Barbara on Sopranos or sex Matt in dollar piano jak I ... on bass Derek Philips are drawn\nFollowing up with another new release for pet Martina from formidable due to Duke Ellington sound with pet Martina or guitar ... aren't Oregon and Carmen and tore junior or draw\nEnjoy the music [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]", "year": "2018", "show_name": "Best of the Village Jazz Series", "city": "Yuma", "day": "06"}