{"month": "10", "state": "DC", "station": "WMAL", "content": "In a day it's designed but the strongest material in there on site lab and it saves you even more time and money all of cascade work is done in\nHouse so that means you don't have to go from Dennis ... oral surgeon back to your dentist as many as four times what a huge price tag\nOne doctor one office one incredible procedure and one price cascades so confident in our materials in their work but they backed them up with that ten year guarantee and can assure you of the best price literally anywhere on full mouth dental implant\nWhy would you go anywhere else\nSee cascades many success stories by going to cascades one dot com and then called them at eight six six twenty five sleep that's eight six six twenty five sleep\nDo you what I Would watch WMA all washing\nDishes [noise]\nJournalist disappearing fallout paralyzing virus out of a coup d'etat\nIn terms of the U.S is that in Turkey for audio and video relating to the disappearance of Washington Post journalist democracy if that exists\nMeanwhile corresponding Caitlin Collins reports senior Trump Administration staffer Jared Kushner has come under greater scrutiny as the White House tries to craft a response to the presumed murder of ... inside the Saudi consulate in Istanbul\nWe are told the behind the scenes he's helping shape the response to that he's the one who taught to the Saudis and told them they needed to call for an investigation into that that if the parents of this reporter uh and it's also comes with President Trump is getting really frustrated with the news coverage of this and this idea that he has his clothes the relationship with the Saudi officials\nDeputy attorney general Rod Rosenstein defended the special counsel's Russia investigation telling the wall Street Journal the probe is appropriate and independent correspondent zero memory report sources say more indictments are possible after the midterm elections\nOne of the main character and that we haven't heard a lot of out lately is Roger Dow and when that President longtime political advisers and he even said publicly that he believed he could be indicted for some kind of criminal activity he just doesn't know what\nA virus that could lead to paralysis has been reported and at least twenty to say this corresponding bill Michael tells us\nThe CDC is investigating one hundred twenty seven reported cases of ... or a FM including the ones that have been confirmed more than ... percent of the cases reported so far or people under Eighteen years of age the average age of patience is four years old\nThe Los Angeles Dodgers are one went away from ... trips to the world series for the first time in forty years Clinton ... seven innings and the Dodgers grabbed a three game to two lead and the national league championship series by donning the Milwaukee Brewers five to\nGame six friday night in Milwaukee\nYou and they all do as an adult to Ryan appear sports betting could soon be legal the district D.C.'s considering it after a Supreme Court ruling allows cities to legalize sports betting\nLegalizing sports betting would bring a lot of revenue to the district according to proponents that money would go to early childhood education and the arts council member Robert White spoke at a public hearing today\nWhen we have an opportunity to create a new markets a new revenue stream that really can fun early childhood development I think that we have to act\nBut resident Murray dreadful opposes the idea saying the start up costs will be too high on top of that\nCosts just revenue is regressive that is it hurts the poorer than most\nHeather Curtis sound WMA Allen W. N. A. L. dot com\nPrince William county is a step closer to having a spur solar farm the county board of supervisors gave its unanimous approval for thirty million dollar solar farm in a rural area of no silver Ginia\nThe solar farm would be the first in the county\nOr desire is to absorb that sunlight and turn it into electricity\nMatthew mayors with Virginia solar Prince William county supervisor Janine laws and supports the plan\nPreserves the rural area otherwise you know it could be developed by right with thirty plus houses the\nFarm will reportedly generate enough electricity to power over three thousand homes barber Britain W. M. A. L. W. A. L. dot com\nBen Jealous says it was an error when he requested a meeting about support for his campaign for governor\nWith a Maryland lobbyists who was convicted of mail fraud Eighteen years ago jealous of the Democrat was asked about several calls he made to a lobbyist as just rolled out an ethics reform plan Wednesday\nAt a news conference just said he would not meet with lobbyists convicted of fraud or corruption charges a jury convicted investment advisor charges sheet of fraud investors out of millions of dollars using\nAnd he said he would not meet with lobbyists convicted of fraud or corruption charges a jury has convicted investment advisor charges she'd have prompted investors out of millions of dollars using more than eight hundred thousand dollars to pay for prayers from Hindu priest in India jurors convicted fifty six year old daughter Bennett from Maryland on Wednesday W a male news time\nDonald for out W a male drafted why they're on the carpet cleaning traffic center\nThose are the you know the bell we've still got his life river road to ... to seventies ... actually continues north found on the spur of the democracy boulevard also so the feeling on the air or clean up the slows travel to a friendship but even the springs\nUp to just beyond Allentown wrote for the results of the earlier pressure over on the left shoulder there are still ... found online Ninety five would root route one to the arc for fun now from garage door repaired on com here's the WMA oh weather Channel's forecast\nTonight low forty three sunny tomorrow honey fifty five\nYou've got an Amazon Echo you've got a new way to listen to you know there's this huge morning some\nLimbaugh leery of more\nI listen to this one time set up see for the people who do and they all skill once your devices enable safe Alexa way be able to you know it's really that simple wherever you can actually getting breaking news on the Inside Story just never be easier to get all the ...\nIf you suffer from E. D. and you've seen your doctor about the little blue pill you know can be expensive and seeing the doctor and waiting at the pharmacy can be a hassle\nWonder if I told you that a certain little blue pill just came off patent December eleventh and they've seen active ingredients in the little blue pills now available in generic form available to you for just thirty dollars for a month supply that's a big discount no more getting ripped off by the big pharma companies\nWith four hymns dot com you can bypass the doctor's office pharmacy visit and see huge money on your prescription you deem is just go to for ... dot com slash health\nConsultant licensed physician aired following their confidential medical review you can have the proper prescription deliberate directly to your door for a fraction of the price and today will supplies list you can get started with the trial month for just five bucks that's right five dollars\nHere's what you do just go to Fort hymns dot com F. O. R. H. I. M. S. dot com slash health today and get started for just five dollars while supplies last visit for him is dot com slash health right now for him the dot com slash health see what's like purple details mental services to him by former available and all the states do you\nHave\nA welcome to citizenship Hiroshima got tons to today President Trump takes on Stormy Daniels president from versus Saudi Arabia President Trump versus Michael ... but we begin today when the president of the United states and I think that if the Democrats win the house it's not his fault\nThat's not a shot I mean you wouldn't expect President Trump he he's not really a the buck stops here guy does not his note motto he tends to operate more and they the buck stops wherever I'm not\nAnd therefore if the Republicans were to lose the house it has nothing to do with President from now let's get real about that with a soaring economy the Republicans shouldn't be doing better in polling than they are Democrats are highly motivated to get out and vote partially because of President Trump's I think it's extra because I'm\nNot really believe it or not I think that Democrats are motivated to vote because of Republican is in the White House and it would be the same thing if it had been Jeb Bush I think they would have been motivated to the\nMidterm elections are really bad or sitting president and this election cycle is no different if it turns into a rocket blowout of turns into Democrats winning forty fifty said then you might start talking about the impact President Trump has had obviously President Trump has a unique gift\nFor both getting the worst out of his opponents and the worst out of himself from time to time and my tape from time to time I mean not infrequent basis which is why we're not talking about Stormy Daniels mushrooms Mario Cart and horse race as well get to all of that in just a second but President Trump said yesterday that if the Republicans do indeed lose the house it's not on him\nIf they don't go out and vote than they have themselves to blame because they'll lose wealth tremendous amount I built up [noise] eleven point seven trillion dollars and we'll see report on it\nSo you know when when he suggests that it's not his fault because we have\nNo great autonomy he's right that we do have a terrific economy right now\nThere is a study out today and it shows that the United states has now number one number one in competitiveness for the first time in two thousand eight after the second highest overall gained from the previous years ranking from the world economic Florida according to Ryan ... over a daily wire\nThe top five countries where the U.S safer for Germany Switzerland and Japan all which saw their scores increase in twenty Seventeen according to the wall Street Journal\nEconomic recovery is well underway with the global economy projected to grow almost four percent and twenty Eighteen and twenty Nineteen\nReports data adding that the recovery remains vulnerable to a range of written since potential shocked at just the way for economists to hedge their bets that journal noted that the warning sided caught a brewing trade war between the U.S and China as\nA possible hindrance to growth that could potentially derail the recovery and detour investment the report scores countries on\nBeing cited quote a brewing trade war between the U.S and China as a possible hindrance to growth that could potentially derail the recovery and detour investment the\nReport scores countries on how closely they match up to the competitive ideal\nUs scored an eighty six percent of impossible one hundred America's vibrant entrepreneurial culture and its dominance in producing a competitive labor market and nimble financial system are among the several factors that contribute to making the United states in innovation ecosystem one of the best in the world this prompted President Trump to weed out all the good economic news\nOren Cass in his book you talked about capitalism is great at generating all sorts of consumer good\nWell he said that we may be living in a time very soon where people can't find fulfillment in consumerism and said they find it so much in job now there's no question that a guy making twenty thousand dollars a year and working is probably happier than a guy making twenty thousand dollars a year for well they're not working but the real question is how much\nEconomic wherewithal you have to sacrifice how much free market you have to sacrifice to give that guy a job at twenty thousand dollars as opposed to just redistributing and this is really a fascinating economic debate and his breaking out I think it's premature but it's fascinating coming up we'll\nTalk about the new debate on the right and left on where our economy should go from here a lot of concern about automation job loss about whether we need to change the fundamentals of our economy I'm not quite sure and I think it's kind of a problem Ventura\nWon all five point not F ... am thirty WMA how\nWith all the recent news about online security breaches it's pretty hard not to worry about what am I dated guys making online purchase are simply accessing your email could put your private information at risk you are being trapped on line by social media sites marketing company and your mobile or Internet provider which is why I decided to take back my privacy by using express BBN\nExpressed VPN has any news apt to run seamlessly in the background of my computer phone tablet turning on expressed VPN protection it only takes one click\nAnd expressing insecure and none of my your Internet browsing\nEncrypting data hiding your public IP address protecting yourself with the ... pm costs less than seven bucks a month so it's really cheap protect your online activity today to\nFind out how you can get three months for free\nAnd express VPN dot com slash then\nAt the X. P. R. E. S. P. N. dot com slash Ben for three months free with a one year package go check it out you should be protecting your own mind information that express VPN dot com slash spending learn more again that it expressed VPN dot com slash bend go check it out right now sprint ... dot com slash and let them do we say you\nKnow this is ... author of a best selling book cancer step outside the box\nI Want you to do some very important information in Nineteen eighty five president Ronald Reagan requested that carnivores it'd be sent directly to the White House at a time when only the president could have pain this world class healer carnival or capsules or use around the world to keep people healthy\nNow you can protect yourself and your loved ones in this age of superbugs with Seventeen naturally occurring compounds\nThat instinctively respond to abnormal cells only\nWithout harming a single normal so if you want to stay healthy now is your chance to literally wake up you're critical immune cells\nTo attack harmful invaders that don't belong in your body one eight six six Venus fly for order from carnivores dot com that we are in I. V. O. R. A. dot com that's one eight six six eight three six eight seven three five boarded carnivores dot com protect your immune system is the only one you've\nGot his couponing touchy parents I mean the Fifteen Percent a year later called now\nAttention all authors page publishing is looking for authors have you written a book and want to get it published page publishing we'll get your book into bookstores in Brazil on line at Amazon apple I do in other outlets\nThey handle all aspects of the publishing process for you printing ... publicity copyright and editing go eat under advisor or one thirty six eighty nine now where you're free author ... should get that seat under advisor or one thirty six eighty nine for your free author certainly should get again eight hundred bonds or one thirty six eighty nine\nOr you or someone you love one of the nearly one million Americans living with Parkinson's disease there is no known cure\nThat you have the power to help the teams that participating in a clinical trial the Michael J. Fox foundation will help you get started and is it Michael J. Fox dot org slash participant to download the new park in ... in fact it's free and\nIt's available right now that's Michael J. Fox dot org slash bring them back\nPain slurry O'Connor and I love this time of year don't you nothing's better than lying in bed on on on a night and drifting off to a quiet rest full night's sleep\nBut if you or your loved one has sleep apnea the sounds of snoring maybe keeping you up all night you've probably tried to see path mask but if it's just not working for you you're not alone now there's a silence masked free treatment option available right here in Washington DC area it's called inspire\nInspired is asleep solution that works inside your body with your natural breeding process that delivers mild stimulation to keep your airway open during sleep giving you and your partner the rest will sleep you need inspiring is ...\nSo it delivers mild stimulation to keep your airway open during sleep giving you and your partner the restful sleep you need\nInspire is FDA approved in currently offered more than a hundred and fifty leading medical centers across the country visited inspires sleep dot com to learn more review important safety information and to find a doctor who can help determine if ... is right for you\nThe freedom to sleep like everyone else is just a click away it inspires sleep dot com that some ... by your sleep dot com\nThompson creek windows can lower your utilities improve your comfort in the fifty percent Mary Walter here and you've heard me feeling you in on the fact that Thompson creek says it all the design build and instill replacement windows and you will never pay the middleman markup mostly\nNew dealers are just brokers any markup when no value will Thompson creek window company is different because they are the manufacture and they sell directly to use the homeowner with no middlemen\nBuying directly from Thompson creek means you get high quality windows at an affordable price and now is the best time to call for a ... well before the cold weather sets in\nHis incredible fall half on sale\nBy two windows get one fifty percent off plus zero interest until may twenty twenty eight five five fifty seven creek today and ask about their incredible fall half on sale the towns in creek dot com for details and you get more for your money I've Thompson creek called eight five five fifty seven creek today\nMornings on them all week days five do mine Washington Mall WMA how Washington comes to the dog\nWill\nCome back as a bunch of hero show so new battle has broken out not even really between right and left but within both right and left over the future direction of the American economy and it's across the political boundaries is really quite interesting\nOn the one hand you have to say globalization and redistribution what do we do with the people who are left behind who are working jobs that get eliminated\nNow the normal answer in the past was get a get a new skill we doubt that's why America fans from coast to coast and isn't just relegated to the eastern seaboard\nBecause people legitimately gave up plots of land in New York and decided I'm going to go out to the middle of nowhere I'm an across territory where people want to kill me that would go out in the middle of nowhere to set up a claim and then I'm going to work on that claimed by myself at risk of death\nIn order so that I can make something more myself but that is the American ideal but that's what it was going by the wayside because we now believe that\nEverybody is entitled to things were entitlement culture and so what is broken down is to separate use of where the economy should go from here\nEven over one is globalization and redistribution free markets everywhere and if people are left behind then we have a a basic income but a universal basic income or we have a social welfare net a safety net and that's how we pick up for the folks get left behind\nThose people we just give them money basically the ... everybody's looking at her and then everybody who's left behind a little bit we give it a little bit of extra money to make them feel better and so that they can live better that is my number one and\nA lot of folks in sort of the Trump camp said that's not right and the burning camp say that's not right they say instead we really need is a new model of how to thing and the model of how to think is about jobs how do we provide jobs for people because jobs provide meaning that if you don't have a job you have less meaning\nSo what if we just restricted the free market itself what if we put barriers on the free market\nTorrance credit or an ... he doesn't really we're we're we're recommend tons of restrictions on the free market he talks about different ways that we can shape public policy in order to make the markets freer actually relieve regulation to make it easier to generate jobs but President Trump has suggested restrictions on the free market he's he has suggested\nRestrictions on global trade for example\nAnd there's a real push by someone from getting populist right to restore union power even though it is Americans voluntarily moving out of private union not companies breaking unions that had led to the dark union in the United states\nSo that model number two is you restrict me free market economy in order so that everybody has their job and that again is more of a left leaning version so it's kind of fascinating 'cause you have liberals were for globalization and ... and redistribution neo conservatives or for globalization and redistribution and you have liberals who are for workers\nAnd not free markets and you have conservatives short for workers enough market though the actual answer to this problem is look at what free markets to\nLook at what free markets do and if President Trump were really a free market minded guy that's what he would be saying right now he me ... all human judge pointed at his economy because you're all worried about technological development you're all worried about automated cars and trucks and all the rest of it well guess what\nThere is no question that that capitalism has a process of creative destruction attached to it\nThat goes to show her the famous economist coined the term creative destruction that every time a new industry has created old industries are destroyed the car industry destroyed the horse and buggy industry we'll write when out of business there were literally people whose job it was to make wooden wheels and they went out of business when cars\nThe trees are destroyed the car industry destroy the horse and buggy industry we'll write when out of business there were literally people whose job it was make when we'll and they went out of business when cars came around but\nGuess what that created new jobs in the car industry and you know jobs and making parts for those cars in other words certain jobs get destroyed that we can all live a better lifestyle and people have to learn to adapt in Asia and at the history of humanity forget capitalize and the history of humankind is adapting it'll just saying the environment around you\nAnd where there is apparently audio evidence an audio recording shared with both the U.S and Saudi Arabia\nComparing that to Brett Kavanaugh Brett Kavanaugh account they happy camper right now come the hell on I mean really apparently on the recording a voice can be heard inviting the constants leave the room the voice of a man Turkish authorities identified as Saudi forensic specialist so I'll I'll tell geeky\nCan be hurt recommending other people present within this music well he does members Mr ... body\nAccording to the according to the tape shot he was not interrogated instead he was beaten up drug and killed by Saturday operatives would flown in from Riyadh apparently he was dismembered while he was still alive so things went real well over there all of us again is deeply deeply ugly of course\nThat doesn't actually answer the question as to what President Trump should do however\nAnd this is where president from best claim is that he's basically just a real is trying to make deal as far as possible and well he appreciates the human rights violations or bad he's not going to stay up nights worrying about the Saudi Government\nCommitting human rights violations that we all know they've been committing for years on it I mean the same Saudi administration\nThat has been quite friendly with radical Muslims for decades on and the vast majority of the of the ... of the nine eleven hijackers were Saudi so the vices of say the Saudi regime is not exactly a wonderful wonderful regime but doesn't mean the United states doesn't have interests with regard to Saudi Arabia\nAs an example of president from saying the sort of thing repeatedly he was asked about Helsinki or you remember he had that meaning in Helsinki with lemon pudding where he was very complimentary approved and it was not his finest hour Trish Reagan who has a brand new show on Fox Business which is what we're watching sheep pressed President Trump on Helsinki here's what Trump had to say with food\nThey want me to go off and have a boxing match was among said it was nice to have [noise]\nBut what happened is when I walked off the stage everyone so that was great for on the plane all of a sudden the fake news settled for for some tough enough and let me see if I was too tough as a couple of soup [laughter] I could have a very good relationship with Russia having a good relationship with Russia would be a good thing that a bit\nOkay so there was never that read to him when he said that about Russia he said the same sort of thing about Kim Jong il right this is how Trump acts with regard to bad dictators he basically determines whether he needs them or not and then he tends to treat them nicely if you need them because this is how Trump is personally with all the people he deals with\nIf you need you he's very nice you if he doesn't need you then he called you a horse race that's what President Trump does and so when people are confused and President Trump isn't calling mom and been sold on a horse race that's because that's not how President Trump operate\nThat does not mean however that what the left says about Trump's relationship with Saudi Arabia is true so Ben Rhodes who is just the worst than rode the former national security adviser to President Trump\nHe's just awful he's just awful he was the guy who lives in the American people about the Iran deal he was the leader of the Iranian regime outreach effort on the part of the Obama administration actual outreach effort to an evil dictatorship believe sponsor of ... on planet earth attacking President Trump suggesting Trump is somehow responsible for Saudi Arabia acting\nLike Saudi Arabia journalist\nEverywhere are less safe and and let's face it we have a president who says are also the states so for a values like freedom of speech and dissent\nSuddenly are very endangered around the world [laughter]\nThat's a friend of mine that I think it's getting much worse and and so this vacuum a penny advocacy for democratic values I think is putting people at risk and there's nobody else who's going to fill that vacuum if is president United States in the United states of America is not doing that\nThis is why Trump supporters are not going to resonate anything the are saying these days the media covered foreign minister ration that didn't outraged actual terrorists for years upon years upon years\nSo in Trump says listen I'm not going to go crazy over this out anything most Americans are basically going to say okay well All right now is that the proper action not a proper action is probably the sanctions that the very least an insistence on some sort of change in Saudi Arabia but we do have leverage over the Saudis to pretend we do is foolish but\nPresident Trump is much more of a foreign policy realist than some of his predecessors and as a foreign policy realist I think that it is not\nFully outside the bounds of propriety for him to\nSuggest that it's it's a little much to abandon the Saudis in the middle of an actual ongoing Middle Eastern crisis between Sunni and Shia okay in just a second I Want to talk about the great battle of our time which is not Saudi Arabia versus Iran or even Republican versus Democrat it is President Trump for the Stormy Daniels we'll get to that\nAnd just one second but first let's talk about your online security with all the recent news about online security\nThe Republican versus Democrat it is President Trump for the Stormy Daniels we'll get to that in just one second but first let's talk about your online security with all the recent news that online security breach is pretty hard not to worry about where my data goes\nMaking an online purchase or simply accessing your email could put your private information at risk you're being tracked down lined by social media sites marketing companies your mobile Internet provider\nNot only can they recorded browsing history they often sell it to other corporations who wants to profit from your information which is why I decided to take back my privacy using express VPN expressed VPN as easy to use apps that runs seamlessly in the background of my computer\nPhone and tablet turning on expressed became protection it only takes one quick expressed\nVPN secures and anonymous your Internet browsing encrypting data hiding republic IP address protecting herself with expressed began costs less than seven bucks a month so what are you waiting for its rated the number one VPN service by tech radar it comes to the three day money back guarantee if there was no risk involved\nProtect your online activity today find out how you can get three months for free at expressing VPN dot com slash men that e X. P. R. E. S. S. I. V. P. N. dot com slash then for three months free with a one year package that's express VPN dot\nCom slash bend to learn more go check it out right now the other big story on everybody's radar today is a story about tiny and our space the great romance of our time so President Trump floated off yesterday you'll recall when\nHe decided that he was very very happy that Stormy Daniels had had been forced to pay attorneys' fees and the state of Texas on a ridiculous defamation lawsuit that she filed against him\nHe pointed out yesterday no I can go after her stays in her third rate in the in the great state of Texas to confirm that or she science has nothing about me\nA total of ... and everybody went nuts because he calls her horse face now there was a theory on line that he we know President Trump is just bad spelling there was a theory on line that he didn't mean to ride horse basements right horrors face a and you know unkind but\nBacktrack harsh but true in any case\nShe she does not ... ... you know it's not good policy for the president of the United states doing any of those like let alone to be saying that a woman he wants Chad is ... ... weird kind of self own\nWay right or or that woman that I had sexually was so terrible and ugly huh okay that's that's a way to do it as well and then it gets\nStormy Daniels then replies any typical classic fashion for what she has no she's a classy lady you know the kind of woman who's featured in New York magazine not kidding Thursday full photo spread of Stormy Daniels in the new feminist leader because she gets paid to have sex on camera and then had sex with a married man and then refused to shut up about it after being paid a hundred and thirty thousand dollars to shut up about it\nShe's a feminist heroine she is Susan B. Anthony\nMy goodness so here's here's what she's which we did\nLadies and gentlemen may I present your president in addition to his own shortcomings his demonstrate and his incompetent have for women and lack of self control on Twitter again and perhaps a penchant for ... game on tiny\nSo this is weird because now she suggesting that she is an actual horse ranch has he has a penchant for ...\nWell the only thing is that about horses was that she's a horse race which I got to say I don't think he's really ... I don't think the Stormy Daniels is a horse that should be any objective measure but in any case she says it has a penchant for ... which is weird or and then she says game on tiny so the romance of tiny and horse face\nI mean that is this how when back when they first met\nOr Trump walk up and said you have the other states and Trent\nWe are tiny and then these passionately made out\nIs it basically how that went well that wasn't the end of the story the end of the stories of Michael ... felt the need to sign it to jump into Michael ... who I\nI ... I'll be honest with you I've been saying for for months now that I Want my ... not only to run for president but to win the nomination for the Democrats because I root for entertainment value around here if we're going to live this news cycle let's live at\nI mean come on what I'm saying the town red we're going if we're going to stay in touch that God has decided his vengeance upon us Shelby this news cycle and let us ramble in arson so Michael ... desperately wants to run for president and the last three weeks has destroyed his own party's credibility on Brett Kavanaugh\nLost a lawsuit against President Trump now he jumps into the Stormy Daniels Donald Trump fight with the videos so good that I Want to make it my permanent ring town there is Michael ... sounding off for those who can't see\nMichael ... you know this is this really high style he has taken his phone turned it into sell the mode and now he is filling himself speaking very seriously and the camera\nAbout horse base here we go\nIt's a sad day in America when the president of United States colds a woman a horse Foose Donald Trump should be ashamed of himself\nI don't care if you're on the right the left or the center no man should call a woman horse face please the president of the United states I have orders I think it's a disgrace I don't care\nIt's actually the president of the United states I have orders I think it's a disgrace I don't care what your political persuasion is you should condemn it as well oh\nIt is so wrong the wrong thing he said his client off from paid his client on the hundred and thirty thousand dollars to shut up about nailing or ten years before while he's running for president but the real problem is he called her a horse face no one in this country should be called the ... under amendment eighty seven of the constitution it should be illegal\nI Would bet money but if you took a racial DNA tests of\nOf racial does all she has more African background that Elizabeth Warren has Native American background\nAnd now I'm desperate to make that happen so Rachel if it wasn't and right now I Will pay for twenty three and meet us because I Want to know whether you are more black was born in his Native American that we can laugh endlessly as a media which ripped new to shreds\nPast and has to say that you are more black and Elizabeth Warren as Native American I think that will be absolutely delicious okay well we'll be back here tomorrow with whatever insane crap\nIs happening in the news because there's always something in there will be back then [laughter]\n\nIf it were rich W a Mayo Washington shot one thousand dollars for talking to\nYou and me now to [noise]\nThem in the last day on barbecue that President Trump said he did not want to abandon ally Saudi Arabia over the disappearance of a Washington Post journalist and he asked for audio recordings Turkish sources say indicate he was killed by Saudi agents in Istanbul correspondent ... says the U.S is awaiting investigators reports\nIt's going to be quite interesting to see exactly what sort of differences are similarities there ended up being between the report that turkey comes up with and the one that Saudi Arabia decides issue or will actually given the various different ... eating interests and of course various different nations economic ties to the came to\nThe final Washington Post column written before journalist ... she disappeared in the Saudi consulate in Istanbul\nFocuses on the Arab world need for a free press in the story posted on line she'll she writes the Arab world is facing its own version of an iron curtain impose not by external actors but through domestic forces vying for power\nOf course on his ear Crawford report Don McGahn has served his last day as White House counsel\nThe departure was anticipated but according to CNN was extradited after President Trump chose Patrick simple looney as his successor Don McGahn leaves his post after serving Twenty one months as White House counsel steering the west wing through the handling of the Russia investigation and guiding the president's two Supreme Court picks through the confirmation process\nMore than fifty years after his heroism during the Vietnam War sergeant major John Kennedy has been awarded the medal of honor at the White House correspondent Barbara Starr report the eighty year old veteran is the three hundred US marine to receive the highest honor of ... in military service\nHers are major Ken way is the fifty eight the United States Marine to receive this honor for service in Vietnam he is the first to receive it while still living\nStock's dropped with the Dow often Ninety two points the sci fi down nearly a point and then as the only like three member of a coup that\nYour mail news will join Ryan fears woman charged with hunting investors out of millions of dollars if convicted on fraud charges today following a two week trial\nJon Benet convince people to invest in her luxury sportswear company and then prosecutors say she use their money to finance her lavish lifestyle prosecutors say her purchases included more than one hundred thousand dollars of astrological gems\nProsecutor said Bennett Haiti Hindu priest in India more than eight hundred thousand dollars to pray that federal investigators wouldn't catch her\nThe FBI also found evidence she kept voodoo spells on government attorney she was indicted on Seventeen counts including charges of securities wire and bank fraud had her Curtis ... dot com\nDemocrat Jennifer Wexton picks up a big endorsement in Virginia ... congressional district\nJennifer Wexton is challenging incumbent Republican congresswoman Barbara Comstock Washington Post editorial board which two years ago backed Comstock this time is endorsing ... Comstock recently telling the Larry O'Connor show\nWe need to have some type of bipartisan representation and not have a one party down\nThe post calling worked in a breath of fresh air writing Comstock is voted with President Trump Ninety eight percent of the time barber Britain W a male and W. M. A. L. dot com\nJealous as it was an error when he requested a meeting about support first campaign for governor with a Maryland lobbyists\nW. A. L. W. M. A. L. dot com\nBen Jealous says it was an error when he requested a meeting about support first campaign for governor with a Maryland lobbyist who was convicted of mail fraud Eighteen years ago jealous the Democrat was asked about several calls he made a lobbyist\nAnd he rolled out an ethics reform plan on Wednesday at a news conference jealous said he would not meet with lobbyists convicted of fraud corruption charges\nAnd the Washington Redskins plan to honor longtime reporter rich Chandler when they hosted Dallas Cowboys on Sunday\nTaylor died unexpectedly Tuesday at the age of sixty three W male news tiny kennel for now W a mail\nPeachy county only out a little bit of beltway watch for break lights between VW parkway in kennel wars avenue\nThat's the work so that takes out the right leaning shoulders to just say to the left to find that on the southeast southwest freeway speculate eastbound between seventh street and the third street tunnel west bound slows from South capital getting over to the third street tunnel but then it's wide open after that on the fourteenth Street Bridge in Virginia\nI'm arguing the crazy now from garage door repaired uncommon W. M. A. L. weather Channel's forecast\nTonight low forty three sunny tomorrow high fifty five [noise]\nCollege here and just around the corner colder temperatures no and I are waiting\nChannel very heavy showers and storms coming through your everything you need to know why when\nGuys right now along with the heavy rains are two main culprits with these forms that are coming through accurate dependable forecast the weather channel I mean Iran Daniel my ... year old just raised one oh five point not F ... hey why\nAre you in jail I used to place a job board only to sort through tons of resume to find a female candidate for ... my hair salon that old process was not smart then I went to the appropriate\nTechnologies dance resumes for me to find the right people and actively invite them to find the wagon qualified candidates fast smart recruiters read it never went by employees in the U.S right now for free at different ... dot com slash free that the recruiter dot com slash free dip recruiter smart because we're celebrating hiring ever went out three years\nHave you tried that trendy need eating out you can have months frivolous fun with people who just love to play a game but if you were ready for something more grown up try to match over thirty thousand new people a day are heading to match\nFor grown up conversations that lead to great date and beyond our listeners to go to match dot com can aren't for free today you thought it would end informative profound to get a deeper sense of the people you'd like to meet start for free today at match dot com match dot com\n\nGood evening I'm Jon Benet Jon Benet showerhead into Vietnam [noise]\nAnd my colleague can cause some friend Gordon Chang the Daily Beast is here we're looking at the strategic picture for Eurasia and the twenty first century\nLooking at China the rising power the fall and why\nThe secretary of defense Jim Mattis traveling to Vietnam for the second time in this year usually it's just once a year the second time to Vietnam to help us is James Holmes Jim homes as the wily chair maritime strategy at the Naval War college\nHe blogs at the naval diplomat\nIs a surface warfare veteran of the United States Navy ... a very good evening to watch in Vietnam for the secretary of defense and the U.S navy good evening\nGentlemen thanks for having me on is always a well I guess I guess in general terms I guess two things are at stake in Vietnam first of all they're just the need for a for partners in Southeast Asia or if you're going to do things to uphold the freedom of the seat in the Southeast Asia we need we need help\nWhich to directly to the second point which would be just location I mean we were here for real estate people all the time but it's all about location well Vietnam has location the United states\nHas no strategic position in Southeast Asia and most of those who are willing to to provide us access to their bases so that we can do things like roads freedom of navigation operations or so forth\nWe were used to we used to having a good relations with the Philippines than the president was brought into office a couple of years ago has proved to be very mercurial tally of the United states\nSo it's we're we do we just we just don't see him as somebody we can get on a totally therefore to diverse portfolio it only makes us to reach out to the former\nAnd June that former folks in Vietnam as also got strengthening relations with Japan and also with India it seems to be\nFormer ... in Vietnam is also got strengthening relations with Japan and also with India it seems to be a a critical country in the defense plans of other countries are and it seems\nAlmost to making in South central in terms of the coalition to protect the region from the Chinese\n[noise] yeah there's a there's a there's a running debate we have with our students are Newport about whether small states have strategies of everything about strategy as being something for a big power says it ourselves such as Russia such as China Germany or whoever the case may be\nA and I I think it is unquestionably a fact that a small said like Vietnam or the Philippines have strategies and in fact I Would say there's even a greater is a premium on having a good strategy if you can't afford the pro resources at things like the United states does not\nThat includes rolling admission to help you get started and you could get credit for your career experience [noise] affordable courses ... digital course materials for most program and the flexibility on online classes to teach her busy life if you've got no University of Maryland University College is made for you [noise]\nOur next undergraduate questioned starting about ... seconds are advisors can help you to them it's the right plan for you to earn in demand degree from a respected the university me for you started today the un he dot edu slash mania UNBC dot edu last radio certified to operate in fucking if I should have\nA big screen stores warehouse clearance event we need more space than we are moving to a bigger warehouse me big savings one pain no interest in what you want to say began all sampling open mind on all clearing those audio system all t._v. and fire ...\nMiles in theater seating don't miss this one's in a lifetime big savings opportunities in the big screen stores\nWarehouse clearing the ... locations in Maryland and Virginia\nWe are so big dreams doors and we\nBig from that first period our prices be best buy and own mind guarantee was we felt a little more you get divorced from life free delivery and installation is second to none yet this\nFall and your schedule is drawn to the vice in top notch service for over Twenty years hundreds of five star reviews prove\nStill why buy anywhere else big dream store\nMark ... weeknight from six to nine on Washington small W. N. A. L. Washington comes to talk [noise]\nI'm John bachelor with Gordon Chang [laughter]\nVery high in technology and China we welcome Brandon ...\nHe's the founder of the white could report [noise] he's a contributing editor to American greatness as well as a contributor to the American spectator Brandon I go immediately to lung march five booster\nThe Chinese have not successfully tested it since there was an unhappy event or in a previous launched sequence\nThey've now scheduled it a little delight to January twenty Nineteen they need the booster for their\nSpace station plans and for their plans for a lender on the far side of the moon what is your best information about the long march five have they solve their problems or do we hold our breath and see if it works good evening to your Brenda\nWell good evening John and thank you again for having me on and hello Gordon and to answer your question I'm back home in Florida we have a saying even a blind pay confided slot once in a while um the Chinese yes it's true they're having some technical difficulties\nBut to be fair we here in the United states in the sixties and seventies had our share of technical difficulties with our space program if you give them enough time though they will adapt and the Chinese are heavily invested\nAnd they're heavily committed to achieving a what we know in the national security policy arena as space dominance\nAnd they are they are putting that so whether or not the next launch\nAnd the next few months we'll work [noise] uh I think it probably will but even if it doesn't they're going to keep trying until they get one right and we hear in the United states unfortunately are not competing the way we should be the way we did against the Soviets in space and so they basically in China have a lot of time to perfect\nA the technology they're trying to create and you\nSaw in a trance like quickly there's a moon writes on and there's only one contest is that is\nThat that is one hundred percent correct yes Gordon\nFriend and I'd like to just choose the topic a little bit because I heard you speak yesterday and I was absolutely flabbergasted it's something that you said which I think is critically important which I think every American news to hear and that is um we all know that Google has declined to participate\nWhich I think is critically important which I think every American news to hear and that is um we all know that Google has declined to participate in a Pentagon contract to develop the cloud some ten billion dollars\nA lot of people in Google or upset that this does not fit in with the Google philosophy of don't be evil\nBut I heard you say and and I just was completely astounded\nThat Google is about to participate in a technology contract in China were affected the partner on the other side is the People's Liberation army if you could just run through that because there are a lot more details on that but I think everyone needs to hear this\nYeah so basically a quantum computing is it's the next revolution I'm that's that is the thing is is the next industrial revolution whoever can figure out quantum computing first\nIt's basically like having the cotton gin you know of the laugh and dust revolution ... it will completely change the way the world works\nUh the Chinese presently have what's known as quantum Internet basically it plays upon string theory and basically without getting into the mechanics of it\nIt's a physics has shown that to a particle could exist in the same place to different places at the same time and the Chinese have figured out a way to manipulate that particle to transfer encrypted data between the two particles\nI Am it's work they've been asking says twenty sixteen\nFrom that technology that initial investment they spun off technologies like the quantum radar which can be a it's believed can see through the F thirty five that multi trillion dollar\nA program of ours to build the great stealth fighter vacancy through it and there are marrying that to the S. four hundred Russian built defense system\nAs well they are now investing heavily in an actual quantum computing center and on and we and they have reached out to Google about a year ago and Google has expressed interest\nIn not only sending over talent to this a massive new center there building which would be probably operational around twenty twenty twenty Twenty one\nBut Google also wants to infuse cash this is under the umbrella of a state owned enterprises in China which happens to be basically reporting to the People's Liberation army the Chinese have actually not been very secretive about the fact that the quantum computing center that they're building that Google could potentially be helping with\nA is actually not only for civilian purposes but also for military and in the same way that Google and Apple's investment into a I research artificial intelligence research in China is also going to be used for Chinese military purposes\nLet me set the formula here if I understand this correctly Google as evidenced interest and participate in the ...\nAnd Vance advanced work on a lie and quantum Kim ... corner and quantum computing at the same time Google's employees have\nRaised a raw when Google was looking to compete with Amazon and now with Microsoft for the super secret cloud contract ten billion dollars a year at the Pentagon\nI lay out this task very clearly Gordon\nThis looks like Google is siding with the non transparent dictatorship\nAnd ... the transparent military that protects Google's copyrights\nYeah I mean that's the only interpretation I couldn't think of John I'm this is something that I think the first of all the president needs to think about\nAnd we need to start thinking about whether I'm you know in a company which is headquarters in the United states which does business in in our country is permitted to help the Chinese develop their military which is considering to kill Americans\nAnd brand and have you seen Google addressed this paradox in any fashion\nWell no and if anything there's you know they're they're they're continuing to seek to do business in China I Will say though are in both cases of the the AI and the quantum computing\nOn Saturday Night actually going forward with it this is all you know starting the groundwork right now but I if when less awareness has risen I think\nI I think that things will go on without the American people knowing until it's too late and so much part of my my hope is to raise awareness among the American people to say hey maybe we shouldn't have some of our best companies going\nOverseas investing in the centers that could be used to it or leave defeat the United states enough you know whether it's economic or military competition and there's something very interesting that there is a man\nBy the last game of Slater twenty seconds bread oh go ahead or basically\nThe there was the English English mint is the reason why we won the industrial revolution against Britain it was a British expatriate and name Slater they called him Slater\nEnglish man is the reason why we won the industrial revolution against Britain it was a British expatriate ad names later they called him slate of a traitor in England and so the same thing might be happening with American companies going over to China building up our our rivals\nUh somehow that phrase that they liked early on and Google garden that don't evil thing ... I think a couple of words fall it off and just evil stuck on the wall and evil Brendan ...\nFounder of the white party he writes for American greatness and the American spectator Gordon Chang of the Daily Beast on John bachelor [noise]\nYou mentioned the national review on line three hundred and fifty thousand Chinese students studying in America are they a problem Michael that is developing this escalation of aggression he's that turning those students into ... unhappy people are unhappy visitors to the United states\nWell obviously it's it's hard to you know you can't generalize about all three hundred and fifty thousand but what we can talk about John hard the undeniable actions on the part of the Chinese government\nTo mobilize in some cases weaponized the students they've done it lessen the United states but they've done it in places like Australia and other countries where they form a very vocal interest blocks ah and they try to suppress anti Chinese discussion or Chinese um lectures or Chinese events on\nCollege campuses uh they will go out as as large crowds trying to drown out anyone who is taking a critical stance of China they\nAre in other element along with the Confucius Institute at the state uses to try to portray only positive a\nPositive views of China now in the United states but we also know is that the government is very carefully watching them that there are in essence agent provocateurs tourists were sent to make sure that none of these students say things that we can conduct themselves\nThe students are saying things that can be construed as critical of China\nOr to send a chill or into the ranks of those students and it it really cuts against everything that we say that well when they come here to this country they're going to experience academic freedom and intellectual freedom and therefore they'll go back and change China and the fact\nIs is that they feel probably even more under observation and more under surveillance here when they're studying abroad than they do in China\nYou know Michael what'd you say is absolutely well hundred percent correct about Chinese students here\nThey are under surveillance by the Chinese government by the Chinese students and scholars association or embassy personnel but you know some of them actually do express discontent like those who started that hashtags not my president movement in California\nThose Chinese students were very clear that he didn't like the idea that ... was eliminating term limits for himself and for the vice presidents or this is a real indication but Chinese students do actually think and have views that are very different from the Communist Party\n[noise] sure and we and what we want to do is encourage that we want them to be able to number one be here and feel the freedom to speak their mind but\nBut even perhaps more importantly than that be exposed to different views be exposed to a a critical set of um discussions about China China's role in the world the United states and the like um we you know the degree to which these students are going to be influential back in China or in in which\nThe degree to which they carry these views forward as opposed to feeling some type of pressure to ah to abandon those views or do they stay here you know all of these are the open questions I think what we can say or at least at at the\nThe largest level of of looking at the data of Chinese students in the United states is that we now have the experience of millions of Chinese students having studied here many of them are probably the majority having gone back to China at least after some period of residents in the United states\nAnd as far as we can tell having very little effect on the path of society so it doesn't mean that we should\nUh turned our back on them or burn them we should be encouraging them uh but for the broader argument that what this is going to do is ultimately help liberalized China well we we still have to see evidence\nOf that Michael Flynn is the Williams Griffith fellow in contemporary Asia at the Hoover Institution running most recently at the national Review Online about Chinese aggression Gordon Chang of the Daily Beast I'm John bachelor\nRussians have hacked our elections are infrastructure and our government but the United states has master hackers to the best one of the CIA cyber age who defies all notions of what a deadly by looks like in bite former intelligence agent\nA master hackers to the best one of the CIA cyber age who defies all notions of what a deadly spy looks like in bite former intelligence agent Erica nuisance page turning new thriller the tables are turned in big power cyberwarfare\nEric Anderson is new novel from done books as bite B. Y. T. E. bite now on sale at Amazon dot com or visit to you and then book dot com\nWashington Mall W A L Washington comes to talk\nIf you could talk what would they say I have been killed in the end of rage I'm responsible for a child speech impediment I and the reason a child can read\nBecause you can't the lead paint doesn't mean it's not on walls doors windows until today lead paint poisoning effect so for one million children if you're homeless built before Nineteen Seventy eight plug on to link Free Kids dot org or call ate hungry for two for land rush to buy the coalition to end childhood lead poisoning ... and the council\nBalance of nature's fruits and veggies in a capsule\nHad cancer F ... jet as nerve damage and the tea and I have ... and that book I\nShow my life's changed cancer factor learning how to live with it but starting damage nature I felt that the first month I felt different\nIt may ... defense that way that they had if clear I have more energy very rarely gets ... not that any more except that skiing it's just amazing I ... I don't know what I did the right I Am today if I didn't start down to nature\nFor a limited time use discount code John and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one or go on line to balance of nature dot com and use discount code drawn\n\nWe can't professional and get any ... any garment side he fell ... isn't a natural twenty nine guys why spend more for the same clean when he\nReal men\nDo not make the vinyl mistake the window man dot com had been to Dc metro number one choice in real true\nOne hundred percent fiberglass replacement windows for nearly thirty year with the window man carrying Marvin infinity and integrity all trick fiber glass windows and to fiber glass window line from Jane party no other window company can even compete\nDo not settle for cheap vinyl or imitation fiberglass and now say about that seven hundred and fifty dollars on fiber glass windows from the window man dot com Marvin insanity is bully constructed over real true\nOne hundred percent fiberglass eight times stronger than vinyl and we'll never rot war band or above plus ... infinity replacement window is often historic district approved schedule your free at the at the window man dot com or visit their Fairfax show room Marvin Jane party seven hundred and fifty dollars on the window man dot com down\nPrior selves excluded minimum perch supplies\n... repair visit garage or a ... dot com Hi Chris plant here and you've probably heard me say that a lot and here's why for over forty years overhead door company of Washington DC has been the gold standard for service and repair\nTheir professional experts truly care about giving you the best experience possible hey nobody wants their garage door to break down but if it does you'll be glad you called the experts so one more time remember when you need garage door repair visit garage door repaired dot com\nHey Larry O'Connor here recently I met with David Foster and his team at foster remodeling solutions expansive designing selection show room\nFor the past thirty five years foster remodeling solution that has been providing northern Virginia families with award winning home renovation projects to best with their current and future lifestyle whether it's a redesign of your homes lay out to age in place a new ... kitchen for those who love to cook for a bathroom\nThat will make you feel like you're living at a spa foster remodeling solutions can make it easy David explained that no matter the need the key to a great home renovation projects is proper planning\nHonestly you're going to be shocked how simple the entire process can be an old craftsmanship it's amazing for complimentary consultation\nAnd thirty percent off of design agreement called the company I recommend foster remodeling solutions seven three seven four or five eleven ten that's seven three seven four or five eleven ten or on line of foster remodeling dot com foster remodeling solutions they're process\nSeven three seven four or five ... or online and foster remodeling dot com foster remodeling solutions\nThey're process makes perfect propagating whether together every ten minute weekday mornings I'm ... and Washington comes to a song [noise]\nI'm John ... or this is John ... my colleague Monica Crowley of the London Center for policy research looking at the last days to the mid term we begin with the economy because the American people over a great period of time the century the last century\nProfessors at you and you see are very knowledgeable they work in the industry because I got a degree from you I'm you see I got promotions that helped me move up in the world can earn more\nBurn your degree on line from ... to take university designated by the NFL ... at the center of academic excellence and information assurance\nUnlock your potential at University of Maryland University College made for you [noise]\nOur next undergraduate session starts October twenty second\nOur advisors can help you develop the right plan for you to earn him in demand degree from a respected State University made for you started today\nThe un PC dot edu flash radio that you used the dot edu flash radio certified to operate in Virginia by chef\nDo you what I Would watch WMA all washing\nDishes [noise]\nJournalists story nickel plan on barbecue that\nPresident Trump one's tricky to hand over the recordings that claimed to have the torturing presume death of Washington Post journalist Jamal ... inside the sunny consulate in Istanbul New York times correspondent David Kirkpatrick says it's becoming increasingly difficult for Saudi Arabia's crown prince to distance himself from what happened to the journalist\nOf the fifty affected by the story for\nAppear to have close ties to the crown prince himself that is they've traveled with him as members of his security detail\nSo while they may not be under as direct control the facts that says they are closely associated with him is going to make it harder and harder for him to avoid some degree of responsibility\nThe post published a column written by ... before he managed it warns that governments in the middle east have been given free rein to continue silencing the media at an increasing rate\nGiven the attorney general Rod Rosenstein defended special counsel Robert Mueller's Russia probe telling the wall Street Journal it's appropriate and independent corresponding Sarah Murray report sources say more indictments maybe on the way\nThey would expect that that's all it becomes like later on down the road after we get through the mid term elections and that they get to that point now where Robert Mueller wants to get hit any last few cases on the board or at least through the finish line in terms of the indictment and then start preparing his are poor\nCabinet secretaries got a request from President Trump about trimming their budgets for next year\nI'd like you all to come back with a five percent cut\nI think if you can do more than that\nWe will be very happy there are some people sitting at the federal I'm not going to board yet but there are some people that can really do substantially more than a\nTrump dubbed the idea the nickel plan the dollar ... after the minutes of the Federal Reserve latest meeting show broad agreement on the need to raise borrowing costs for their\n\nRun like a girl is a nonpartisan I guess it's a documentary on the number of women running for office in the mid term election\nLike to run like a girl and she's a heated political climate last year we ... this year we run\nFind us on apple pie ... wherever you listen to your gas\n\nI used to post a job board only to sort through tons of resume to find a few candidates for ... my hair salon that old process was not smart and I went to the appropriate technology games resumes for me to find the right people and actively invite them to find qualified candidates that\nWays every group Rita number one by employees in the U.S right now for free at the recruiter dot com slash free that the recruiter dot com slash free zip recruiter smartest way to be reading of irony I remember when I was ...\nFirst lady Melania Trump toured in intensive care unit at a Philadelphia hospital today to learn about the care being given to newborn suffering from opiate withdrawal a few things\nAnd in intensive care unit at a Philadelphia hospital today to learn about the Caribbean get into newborn suffering from opiates withdraw\nAnd she thinks tied to the bare than seeing a newborn faster and I'm anxious to do all that I can have signed a light on that make\nThe number of tornadoes in Kansas or Oklahoma and Texas has been on the decline over the past few decades is correspondent and then hating explains\nSex is still gets more tornadoes in any state but tornado alley is moving east according to a study in the journal climate and atmospheric science researchers don't know why this is happening but they found a slight decrease in tornado activity in the great plains along with an increase in Alabama Arkansas Ohio Michigan and other states to the east and north\nThe Dodgers beat the brewers tonight kicking being three to National League championship series lead heading into friday game six in Milwaukee the coup that\nStory is called the ugly truth about time share\nEverything you've done your family fiber about buying a Tom sure you need my help hello I'm ... McDowell CEO and founder of Wesley financial group two years ago\nI started helping votes cancel their timeshare contracts and in the process started what's now called\nThe Tom shirt cancellation industry Tom shares the only thing that you can buy that you can't tell me how much is going to college or when it's going to end what do you buy time sure you give them a blank check to fill out any amount they won't for annual maintenance and assessment phase sound crazy\nThe crazy thing is this never ends even when you die your families\nNow going to be stuck with this burden stop the insanity\nTo stay calm office now I guarantee you if we can't catcher timeshare contract you'll pay nothing\nCalling for your free information get eight hundred Seventy six fifty four hundred that they'd had read some of those things that people are a hundred eight hundred Seventy six people were Andrea this story\nIs called the ugly truth about time share everything you've done your family fiber by buying a Tom sure you need my help hello I'm shot McDowell CEO and founder of Wesley financial group two years ago\nI sort of helping folks canceled their timeshare contracts and then the process started what's now called\nThe Tom shirt cancellation industry Tom shares the only thing that you can buy that you can't tell me how much is going to cost or when it's going to end when you buy time sure you give them a blank check to fill out any amount they won't for annual maintenance and assessment face sound crazy\nCrazy thing is this never ends even when you die your family is now going to be stuck with this burden\nStopping insanity to stay calm office now I'll guarantee if we can't answer your timeshare contract you'll pay nothing\nCalling for your free information get eight hundred Seventy six fifty four hundred that's eight hundred Seventy six but if people are a hundred eight hundred Seventy six people around right\nNow\nI'm John ... this is the John ... the south caucuses the Caspian Sea\nOf great interest and I learned from professor Brenda Schaper\nBrandon is a visiting researcher at Georgetown University Center for your ... your Russian and east European studies series\nShe's also a senior fellow at the Atlantic council's global energy center professor shaver I Am learning as fast as I can about it and extremely complicated region with states and\n... and leftover pieces of the Soviet Union and now the Iranians story\nA pending the next wave of sanctions by the United states Iran is increasingly isolated I Believe the United states wants to cut Iran's banks out of the world banking system\nIran has very few friends in the world one of them as Russia and now according to a photograph I'm looking at and a report while another friend for Iran might be Armenia Armenia is a small state it's not the classical Armenia I've learned\nFrom a hundred years ago it's a very small version of it of the capital as the Arab on it is not participating in the riches of the region we've discussed this in the past the pipeline politics\nFrom the Caspian Sea but it does have a longstanding access to Iran so is this the ah the photograph between\nInterim prime minister Nicola ... and president of Iran Hassan Rowhani is this just neighborly friendliness or is there are some things to teach it that is changing in the region good evening to\nGood evening well John to add to the complexity of the cats have caucuses into the Caspian regions culture religion does little to explain any of the alliances and and the region and and actually um Iran\nIn region culture or religion does little to explain any of the alliances and in the region and and actually\nUm Iran and Armenia have how it'll since the breakup of the Soviet Union um Iran and Armenia have had very a cooperative relations there they're usually pretty quiet about it because it it definitely applies in the face of Iran self the self declared Islamic solidarity\nUm but ... due to the war between Armenian Azerbaijan\nUm you would think that the republic of ah the Islamic republic of Iran would be interested in supporting the Azerbaijan is she a nation that lost over ... is the last twenty percent of its territory over nine hundred thousand Azerbaijan ... she became refugees\nI'm at the hands of Armenians 'em but yet the AR ... Iran has actually I'm almost the poster child for real politic when it comes to its bordering a regions\nIndividuals and businesses with tax problems listen carefully if you owe over ten thousand dollars in back taxes ... tax returns\nUs tax you can help you take back control the IRS ... is your paycheck closure business and filed criminal charges our team of tax attorneys couldn't stop collections and get you protected us act shield offers approach protection guaranteed to get you protected today us to actually all those eight plus rated with the BBC so called a hundred by one nine\nSeventy seven Ninety six us to actually killed eight hundred by one nine Seventy seven Ninety six\nChris plants show weekdays ... new on Washington Mall W. N. A. L. or Washington comes to Tong\nI'm joined us so this is John ... a welcome Lara Brown\nLara Brown and George Washington university to comment as a political scientist with days to go twenty Twenty one days to go to the midterm election what we see in the polling and how this comports with political science\nHistory about midterms following a close election or a White House held by the opposite party to the ambitious out of power party Laura a very good evening to you I think I cage that enough so that I I didn't get too far ahead of myself\nThe elections that you are profiled these last weeks and months we've been talking about this\nIndicates that the Democrats are on the edge of doing the obvious which is winning the house from the Republicans somewhere between twenty six thirty six seats is enough at this point there's chatter about a blue wave there's also chatter about a red wave\nDo you think do you see anything inconsistent in the polling and the polling is very careful I'm watching the New York times polling they pull every night and they give the numbers as they do it do you see anything in the polling to indicate a an interruption in the conventional wisdom that the Democrats will win a majority in the house of representatives good evening to\nGet evening thanks for having me on the most difficult part about polling is that pollsters half to\nEstimate and this is where the art is what the turnout is going to look like and the heart of that usually happens through screens of registered voters they asked them how likely you are to vote so you get what are called likely voters screens some of it also happens\nI'm through the responses themselves you can start to tell by the the amount of sort of information people have the enthusiasm that they have in certain questions that you asked them um\nHow likely they are to participate and all of that\nInformation kind of helps a pollster understand what turnout may look like\nBut the problem is we're in something of an unusual mid term environment we're seen both parties bases\n... very enthusiastic I'm almost equally enthusiastic not quite but almost and\nInterestingly enough people are saying that they're planning on voting with a high degree of certainty and that is just\nNot usual in mid term election in other words mid term elections yes we have this dynamic of waves\nYes there are times where all of the sort of the enthusiasm of the out party builds up and sort of cast this referendum vote against the president but\nWhat we're seeing in this instance is it both parties bases are very excited I'm and we're not really sure a little bit about the middle of the electorate\nThe middle of the electorate is nonpartisan it's either independent or not terribly excited either way it's waiting for that last week under that last day so is there another way to judge George to measure or to get some mid term does the money tell the story Lara\nYou can or the last day so is there another way to judge George to measure or to get some mid term does the money tell the story lower\nMoney certainly can suggest some enthusiasm and it is true that money has uh some very real\nImpacts on whether or not candidates are able to win I think as political scientists have long studied and Gary Jacobsen is I'm sort of high on the list of canon of\nPolitical scientists who have understood these dynamics but one of the things that is true is that incumbents have to raise money\nBut because they are already known they usually um are raising money in a defensive posture in other words um they need to raise more than the challengers but at the same time I'm every dollar that they spend\nDoesn't help them as much as say a dollar a challenger raises and spends and that just has to do with the familiarity of these candidates challengers are usually not known so every dollar that they spend um\nMore to help them advance their causes in other words there's a better marginal return on their dollars spent\nBut the truth of the matter is for both candidates the challenger and the incumbent there is essentially a saturation level um or there is a diminishing returns that go with the additional dollars spent\nArmed oh look I'm told about that saturation level but we passed it about a week ago that there are there no minutes left on any TV channels anywhere in the important battleground districts\n[laughter] that's right and\nOf course so much of half of this is also happening on line so there's a lot of digital advertising um where people are spending money but really what you're looking at here is\nIf a challenger hopes to sort of beat an incumbent they need to raise typically at least half as much as the incumbent raises and spend that amount what is pretty extraordinary about the election we appear to be in is that\nMany of the Democratic challengers have out raised the Republican incumbents\nThat usually doesn't happen it is a rarity and it does suggest that the energy is on the Democratic side of the aisle but we do have to realize that um challengers need to kind of be known if they're going to essentially when\nThere's a twist there too I saw the New York times feature of the story about the candidates for the Democrats in Texas O'Rourke this is the Senate candidate against Ted Cruz has raised some spectacular amount of money tens of millions thirty eight million was not named I don't know what the total some is\nAnd and is not spreading it around the way Congress of the way members of Congress usually do and so there's all and all a lot of the money this is a New York times reporting was coming from California New York in other words off from Texas\nAnd that's the power of online that's the power of crowd funding but at the same time I wonder if that's effect of money all or is that in detail but political science can help with\nWell at the end of the day all money is good money and that you can spend it I mean I Do think that one of the things that Beto O'Rourke\nHas um declared is that he's not taking pac contributions so that is helping him at this level at which he can say all of this money\nWherever it's coming from is happening through individuals giving to me um and that does allow him to spend an extraordinary amount he did thirty eight million in the third quarter he did twenty three million in the second quarter so there is no doubt he has\nPlenty of money for all of the media advertising buys\nHe wants to do [noise] um the real question is will it persuade\nAny Republicans because obviously the challenge for bait or work is the voter underline voter distribution and registration and Texas we know that there are more Republicans there though there are many Democrats who are not registered\nAnd this is sort of the new fight of the Democratic party which is\nTo you engage in persuasion or do you try to turn out voters who have not voted before and in some of the states that they're in right now in particular or some of\n'em these more contested typically Republican states like Georgia I'm you are seeing a lot of of questions about\nUm who can actually vote and who should be voting\nLargest to detail her with less than a minute to go the conventional wisdom also shows that the Republicans retain the Senate in some fashion whether it's a pick up where\nHere with less than a minute to go the conventional wisdom also says that the Republicans retain the Senate in some fashion whether it's a pickup or stand pat and do you see anything to interrupt that we have about thirty seconds\nNow again I think this is where the underlying distribution of voters matters a great deal um if you look at the state for Democrats are on the defensive\nGranted they are incumbents and they've raised money but they are in very Republican states and with a enthusiastic Republican base it will likely be hard\nTo secure those votes for them\nLara Brown is a political scientist she's a professor at the George Washington university I'm John bachelor this is the John ...\nI think in many cases like does they they kind of weight but they will obviously will have all the\nTechnical reports which will come out from the investigation and they will definitely will be able to give getting light them they will be able to kind of give feedback whether they feel confident enough to put dust on our back on a you know and the next uh know launch was the crew\nAnd until they there are there are demands for use and to to to and from I ... have you seen a schedule changes in any fashion after this accident [noise] um\nThere was a slight change which might take place because in fact to Iowa nuclear say might actually are the ones the next launch a ... because uh because what's going on is there is a right now the international space station is under stuff\nThere is only the people instead of six which has scheduled and that could which is up there right now needs thirty third and this the soil which is they will use another story the spacecraft which is ... the station\nAnd sort of sorts of like a ... life both he's also has a sort of expiration date so he needs to come down to really soon at least in December on January so what they see the uh the way and they still launch the next to\nElizabeth or less so it will kind of a but he plays the one which was was not able to make up their ... will be able to relieve that Korea which is they're on board and body in the back uh was in a\nTimeframe or allow it required by the by the expiration date of that so he was which is that right now in orbit so it's kind of a juggle of several missions ... several um uh several lunches says the same time so the so I don't use that they might actually launch early as ... plan before\nDavid ...\nAny chance they would make a decision to leave the space station without a crew and take the chances on that what are you hearing about that\nAre either ... or a member of that before they launched that's ... that's pretty which which they plan to launch lethal as early as they have the uh the rockets whiz on land payloads which was military satellites essentially all lined up to me that that is that the lights on one kind of a trip to the station so those\nAre the so that their decision to launch the crew will be based on a\nSuccessful launches so does the vehicles ... if they discover any other programs soars they bump into into ... and you know as a threat ... men from the engine you didn't standpoint or otherwise\nThey have a choice essentially it to ... which is on board the international space station right now back home and leave the station on land this kind of last resort they\nDo not want to do this of course by the facial has on board computers they can uh control the station by saying they'll commands from the ground to the states have again it's a last resort but they can do it in the mirror of course Mir space station if you'll remember\nOr was that that I Am a on land for for a number of years some ... ... ... if possible it's not impossible it's old\nI read on Russian space lab that there is another troubled rocket they're looking to restore to regular service that the proton rocket or they're looking for many launches in twenty Nineteen are they satisfied that they've solved all the proton quality control issues\nYes I Believe said they uh they said that ... most of the program ... am they continue improving a corner to come through which is kind of in the white\nProblem and that's probably not not even was one or two rockets it needs to be done from year to year and that needs to be in the study what was the white but they believe they're confident that they can fly again and in fact they had successful large before the prominent ones now that they don't have\nMany commercial customers now because most of them are shifted to the ... space in Europe so ah so the problem is to win back confidence so they all lining up sort of fades at all if finance the arrests\nWell space in Europe so ah so the problem is to win back confidence so they laying up sort of fades at all if financed the Russian missions which they hope to fly a due to most of the thousands Nineteen and hopefully as a result of the other\nI Know she'll customers south side of Russia will come back to ... as well\nAnd it totally jak he keeps the website the Russian space swept out comments subscription side I recommend to follow as you see we completely depend upon Ross cause most Senate investigations and its quality control\nAnd until he's the author of Russian space the past explained the future explored David Livingston doctors face of this based show this this hotel Mars episode and I'm John bachelor [noise]\nLonging small family and a half or Washington comes to talk\nBalance of nature's fruits and veggies in a capsule\nI spent years studying how to make this the best I didn't make this because I wanted to make a company other companies are starting to catch on to this and I buy every single other product that comes out so I can look at it and see it and test it and I fear that people will buy some counterfeit\nDon't be fooled this is the real stuff we have absolutely the best process and I can say that because we purchase every single one and check them out\nI mean that was on the market nobody ever worked for the first thing that's really where nothing can compare what the benefits of balance of nature\nFor a limited time used discount code John and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nBatch one eight hundred two four six eight seven five one or go on line to balance of nature dot com and used discount code John [noise]\nFerry residents this is to speaking I'm Sorry did you take credit\nFerry perhaps you have the wrong number\nActually no I'm not familiar with the credit ferry and I know all the fairies were tight knit bunch why don't you tell me more about what the credit ferry does maybe the ring a bell\nThe credit ferry magically raises your credit score so you'll be more likely to receive better interest rates [noise] I'm pretty sure there's not a credit ferry but I Do know you can improve your credit rating by paying bills on time and keeping your credit card balances low\nAnd I could help\nMe when I leave money under children's pillows adults no kids only but I Do know a good dentist\nThere is no magic to improving your credit but there is help and it's free good credit for it to work a public service announcement brought you by the consumer bankers foundation the Leadership Conference on civil rights education funding the ad council\nBut the big screen stores warehouse clarity event we need more space so we're moving to a bigger warehouse me big savings plus I have no interest in until twenty wanting a big on all Sam's on Fox and clear and the all clear impose audio system all t._v. and fire plays console bought all\nOffice section those in theater seating don't miss this once in a lifetime big savings opportunity living cream stores ... warehouse clearing the Ben Stiller locations in Maryland and Virginia we are\nBig dreams door and we are the big screen next birth Harriet our prices beef Best Buy and online guarantee plus we felt a little more if you get back there for life three hours delivery there's\nStill a second tonight and yet this fall and your schedule and tries to vice and top notch service for over Twenty years hundreds of five star reviews prove\nStill why buy anywhere else\nBig dream store do\nNot make the vinyl mistake the window man dot com has been to Dc metro number one choice in real true\nOne hundred percent fiberglass replacement windows for nearly thirty year with the window a man carrying Marvin infinity and integrity all trek fiber glass windows into fiber glass window lines from James hearty no other window company can even compete\nDo not settle for cheap vinyl floor imitation fiberglass and now save up to seven hundred and fifty dollars on fiber glass windows from the window man dot com Marvin insanity is bully constructed other real true\nOne hundred percent fiberglass eight times stronger than vinyl and we'll never rot war band or above plus Marvin insanity replacement window is often historic district approved schedule your free estimate the window man dot com or visit their Fairfax show ram Marvin Gaye and party seven hundred and fifty dollars off the window man dot com\nSelves excluded minimum perch supply store is called the ugly truth about Tom share everything you've done your family is fiber about buying a Tom sure you need my help hello I'm ... now\nThe story is called the ugly truth about Tom share everything you've done your family is fiber by buying a timeshare you need my help hello I'm ... McDowell CEO and founder of Wesley financial group ten years ago\nI started helping votes cancel their timeshare contracts and and that process started what's now called\nThe Tom sure cancellation industry Tom shares the only thing that you can buy that you can't tell me how much is going to cost or when it's going to end what do you buy time share you give them a blank check to fill out any amount they want for annual maintenance and assessment phase sound crazy\nThe crazy thing is there's never ends even when you die your families now going to be stuck with this burden stop the insanity\nTo de calm office now I guarantee you if we can't can answer your time sure contract you'll pay nothing\nGoing for your free information get eight hundred Seventy six fifty four hundred that's eight hundred Seventy six fifty four hundred eight hundred Seventy six people were a hundred and\nDelivery O'Connor's show on now we have to read it on Washington Mall W. N. A. L. more Washington comes to talk [noise]\nThe roofing more always uses the highest quality building supplies available hey it's Chris plant and you already know that roofing and more is be trusted choice for affordable roof starting but did you know there are also northern Virginia is most qualified citing contractor and they ... mirror James hardy remodel her\nIncreased the beauty values trying for durability of your home with James hardy fiber cement citing built to outlast all other options on the market today James hardy fibers cement citing as America's number one citing choice\nTo learn more about low maintenance fibers cement citing options for your home call roofing more at seven three four six seven zero two zero six\nOn line a roofing more IMC dot com that's roofing more high as ...\nDo you are they all left him with British W a male Washington shot one thousand dollar for time\nYou have A L cumulus\n[noise]\nFinding evidence was serious illness I'm only a front says President Trump wants turkey to hand over the recordings that claims to have the torture and presumed death of journalists ... move comes as secretary of state Mike Pompeo urged Saudi Arabia's crown prince to get to the bottom of what happened correspondent Jamie ...\nHeld large crowd trends that every fact about what happened is going to come out and that you have to quote ... take responsibility and how stressed that they have to deal with the people\nInvolved and hope lies that they have to deal with than sharply\nFederal health officials have issued an unusual warning about a growing number of cases of polio like illness called acute floods that my wife does also known as a FM Centers for Disease Control claim sixty two cases have been confirmed and twenty two states in recent weeks about ... percent of those affected of children\nWho are running out more about the New York city detective accused of coach go with this in the Harvey Weinstein sexual assault investigation Steve captain bum explained\nDistrict attorney Cy Vance alleges that in NYPD detective told one of ... accusers that she should delete some things from her cell phones before she turned him over to prosecutors the Manhattan da claims that in twenty Thirteen detective Nicholas the guardian directed a woman identified as complaining to\nTo delete anything she didn't want anyone to see the NYPD detective was removed from the winds teen sex assault case last week\nThis information led to a dismissal of one of the five counts against winds dean defense attorney Ben Brafman claims that the evidence showed what happened was consensual deep casting about New York department\nConfirming the U.S received a hundred million dollar payment from Saudi Arabia the same day Pompeo arrived in Riyadh timing raised questions about a potential payoff but the money had been pledged for Syrian stabilization back in August [noise] I'm only a Francis [noise]\nAttention DC area how would you like the chance to earn cash every month inconsistent mailbox money will listen to this after\nDean Cain known as Superman on ABC's hit TV show Lewis and Clark and now all real estate investor with a national real estate network are getting away their\nRiches in real estate kid for free to anyone who calls now they'll show you their formula for flipping houses in your spare time for potential profit if you're interested in barking on a new adventure and possibly changing your life then you need to call\nRight now call one eight hundred five seven seven eight nine one now to get your free which is in real estate cat\nCalled eight hundred five seven seven eight nine one now when you also get free tickets to a live training of that plus ... gift pack which includes a\nFree meal of free smart watch the networks guy do investing plus that special bonus their brand new tax lean investing kid free just for attending ... eight hundred five seven seven eight nine one that's eight hundred five seven seven eight nine one for your free riches in real estate kit today was\nThought to be the oldest fossils on earth might actually be just a pilot Bronx just almost ...\nYears ago Australian scientist found some on structures in Greenland that they said we're partly a leftover from microbes that live on an ancient the floor\nThese tiny fossils were said to be about three point seven billion years old which would have made them the oldest fossils ever discovered\nHowever a different research team has published a study that says those tiny structures probably were not fossils but we're instead just some rocks in a statement the Australian team defended their discovery and said this new team of researchers did not take their samples from the same place I'm Johnstone\nLA Dodgers are one way from bank to bank trips to the world series for the first time in forty years Clinton crush or worked seven innings and the Dodgers grabbed a three game to to lead the national league championship series by donning the Milwaukee Brewers\nBombed a two game six was friday and\nWe all want more time with our debt\nI'm due to game six who's running I\nWe all want more time with her dad's brothers partners and friends and our son\nTime for more conversations more catch more ... lives about now it's our time to make it they gather we can stop dying to young by tackling the big issues from prostate cancer caring hands or mental health\nIn time to sign up as a member ... changed the face of men are you\nBehind on your federal student loan payments you may qualify to have your entire student loans forgiven with one free call that's right if you're a teacher a police officer firefighter or work for a nonprofit\nFederal programs are still available to have your entire student loans forgiven student loan options to give you free information on all the programs that can help call now eight hundred three seven four oh three one one eight hundred three seven four oh three one one eight hundred three seven four oh three one one\nAids Larry O'Connor and believe it or not Thanksgiving at my holidays will be here in the blink of an eye I Can't believe that it's true though so is your home ready for entertaining your family and friends are your carpets looking or smelling\nTo be embarrassed by dirty garbage just called zero ... they'll have your carpets looking smelling and\nFeeling brand new again they've done it for me and I got to tell you is there were red clean is the\nBest whether it's your home or your office is zero will have your old dirty carpets looking new again don't spend all that money replacing your carpets when all you need is a zero ... clean stains and orders from the kids or pets will be gone forever\nAllergens in mold will be removed so you can breathe easier again don't have carpet that's no problem as they were bred clean can also work wonders on hardwood floors tile and grout\nColds who were rez right now ask for the W on a special get three rooms of carpets cleaned for just a hundred and forty seven dollars plus a hallway clean for free minimum supply called seven oh three three eight to twelve Twenty one seven three three eight to twelve Twenty one or online at zero ... D. C. dot com spell it forwards or backwards it's the same\nZero are easy usual your MRI at Washington open MRI and he takes takes MRI\nThat [noise]\nI'm John that this is the John ...\nIs June nineteenth sixteen\nThe world war is underway to a great catastrophe not only for the allies that would be Great Britain France and Russia but also for Germany and its ally ... Austria Hungary empire because of the blockade famine\nThat is the larger frame for a story that is compelling from the moment it begins we're going to go on a voyage with a submarine it's called ... and\nIt's without weapons and it sets fail the middle of June nineteenth sixteen from ... to go up the canal and then head to the high seas\nDwight ... the author the book is the Baltimore sabotage Sal German agents American traders and the EU boat George slammed during World War one\nDo I congratulations then a very good evening to captain current act of ... as it sets sail what is his thinking what is his mission you have twenty five enlisted men six officers what if they told him to accomplish as he fails to America good evening to you\nJohn well all current and go first to get that you vote from a kill to the United states ... carrying ... primarily ale and a is that the American diet industry needed desperately and the pharmaceuticals at a\n... year because Germany manufactured that stuff that\nNobody else could do as well or as much of who they were bringing it out but they were there to bring back um or material raw materials for ... industries\nTickles iron strep are and I'm\nRubber stamp caught and all kinds of Chavez about cheating under tons of the stuff they're going to take back and he was going to be the first of eight boats there would eventually launcher regular transatlantic weekly prayed to the United states picking stuff\nWith the United states needed bringing back poor materials that Germany needed\nSo it was to be a commercial venture and corrupted built the boat but it was built for a legitimate line and there was a mass of this being entirely private correct wide and though though it was obvious that these were healthy men on board and that Paul current cat a reputation as a\nAs a officer in the German navy they maintain the pretense that this was the commercial enterprise for profit a subtle correct\nSeven years ago\nSeven years ago Debra beat breast cancer with surgery and traditional radiation than my cancer came back and I went down\nThe experts admit star Georgetown University hospital confirmed endeavors diagnosis and arranged for her to receive proton therapy one of the latest breakthroughs in cancer treatment from line and the proton therapy\nPrecisely target the tumor\nHairs healthy tissue and she had a bad hair to traditional radiation\nPersonally important to me because my\nWas located near my heart\nMeant star Georgetown University hospital is the first and only hospital in the region to offer proton therapy so patients no longer have to travel for their cancer treatment today I'm cancer free\nMore information visit med star Georgetown dot org slash proton\nFor an appointment called a five five to one three forty two Ninety eight\nWe're counting down the days till two thousand Ninety during the clearance counts down that capital view GMC in Greenville\nGet clearance pricing on hold twenty eight have you extend GMC with up to twelve thousand I'll select models like GMC the Arab pick up four take up to thirty percent of viewing gotten course that's way\nMore than other view of dealers and that's up to Seventy eight hundred in total saving the clearance counts down that capital viewing GMC in Greenville exit twenty three of the beltway Chevy capital dot com sciences gives me when I told her qualified\nMark Levin week nights from six to nine Washington Mall W. N. A. L. Washington come to talk [noise]\n\nOn John ... so this is the John ... do I\nThe Baltimore sabotage ... German agents\nAmerican traders and the ... during World War one and Nineteen sixty you both do you do it's land\nIs underway and it's headed to Baltimore it will arrive and be received by considerably significant figures in espionage in sabotage this is the Baltimore sabotaged so they put everything together\nThe shipping company the way the L receiving company and the people who arranged the dock and all of the Steve adores everything for the ...\nAnd including the media coverage of the press coverage at the time or the same people involved in sabotage going on routinely there's anthrax there's blenders they're setting storage facilities the fire and they're going to be a spectacular explosion before you ... at before you do it's land sales again for Germany\nBut we need to introduce some of these figures which are you cannot make this stuff up\nDr Paul ... is the money man he was born in Eighteen Seventy eight he is extremely well educated Lehigh University MIT a naval architect\nHe is also a German a double agent for Germany why\nWell there are a lot of Germans\nIn your living in the United states and just like there are a lot of other people who are immigrants living here he was born in the United states where he really was an immigrant whose parents were in in those days particularly the Germans tend to living in colonies just like [noise]\nOr ethnic groups here in America is still living in colonies way of Chinatown in San Francisco largest outside of\nThe orient prison example but they they tend to maintain their own customs their own interest so when the war started it was so we're concerned neutral and the Germans in this country we're naturally understandably\nGerman was and how can they had been a member of a naval intelligence agency called the top and dance which we won't go into his is really complicated but panel the naval side of this thing and and he'd been involved or that\nOr what they call the at the top and dean cell in Baltimore ... probably\nFifteen Years he's ... he's a German as a secret agent that's what are you\nOh yeah he well he's he's an American business rare first right you know and and then have but he's he works for the cheap through the German ... in Baltimore and ultimately a German embassy in Washington DC\nUnfair and start here the gum pass through yet so he and he knows ... he's the only oh yeah so he is he's an elite figure buddies that secret age and he doesn't give out a card weighing I'm German age and I'm working those rights are are\nWorse and they did in ... he and his father have a business extremely well to do and they've had their reception for you you both for you ...\nYou know one other many hires however hinge\nCaptain hinge free drink Hinch off ... who is former imperial navy German imperial naval reserve command he is at the beginning of the war his ship is quarantined is a is a ... a captain intern interned kept in America so he's out of work\nBeginning of the war his ship is quarantined as a ... is at a captain intern interned kept in America so he's out of work and\nHelp can recruit Sam pinch and she is the failing man who's going to receive you've ... land as it lands but Hinch is also the operative the agent extorting they're put together the sabotage south he does everything\nHe's a straw boss for ... hill can work the top in the navy runs as you both sides of the preparation section pulling teeth the army runs the ... the politician oh the operation\nBoth operations are parallel but separate entirely separate milking is the only guy that brings them together\nIn a new under under one half if you will and he he pushed very successful in keeping the two of them separated so that they vote\nFor the both the operation you book was never compromised in any way it really didn't it did bring you do I didn't bring any explosives to the United states didn't bring the anthrax that was all brought in by army agents who came\nThrough the blockade coming to the United states so with anthrax landers\nExplosives I'm sitting there is hidden in special luggage and things that got through the inspections then they brought it to the ... in Baltimore and she had been apart active people intelligence up it up and danced in Havana can he brought his ship into Baltimore we chased him by the British\nSo he was in turn and he was told you contact silken and you'll have a job for you and wink by that time he'll can it already been in contact with the German army to a guy named for Ritalin noticed that\nDark invader a yet fundamental and he spends most of the war and uh with and the British authorities because they take 'em off a chef we don't have time to go down that road I mine although a wonderful story All right great star a hinge anyway pinch put together the reception of the you know the a tugboat\nThat brings you George Land into Baltimore to tie up at the pier that you have a photograph they're wonderful photographs and twice book of hinged on the on board the ... the tug watching you Joyce land so hinge actually usa straw bath\nOn sometimes he's this habit tours sometimes he's a shipping agent\nAnd when he when he's ...\nHe's he's getting was the front man or for the company you know the eastern forwarding company and he was the front man for a Schumacher and company which is a tobacco import company belong at him and his dad\nAnd he's the guy who does all the press work on behalf of the ... stuff\nHinch is a guy who does the leg work he's the one that organizers doors who are going to be the center tours he's the guy who organizes\nThe fact he goes and he went to New York and got the book and he he did all the day to day operations sort of the general manager really and um of this of this operation both sides of the\nPan Hinch was also part of the Sabbath tours who put together something called cigars which were delayed fuse as they would toss on board ship mostly out of New York they sometimes out of New Orleans and you have records of thirty seven ships damaged or sound because she has this\nYeah you're right there was thirty seven right there on that in in that area that we know about but there are fifty that building again is that there are really unexploded\nSays wild ring I mean they're going in all directions in addition they're receiving you ... with all of these headlines that is what you have to do like they invite the media the pressed to come forward they give their visit their visible all the time and yet there than there are a major sabotage during\nThe ... they were the most successful active German sabotage you bring in the United states in World War one they were never discovered none of them were ever arrested none of them ever brought to trial\nAnd they did escape spectacularly as well the thing they were chased everyday people knew about them but they couldn't bring them to justice but do I met summer is the author of a spectacular story\nIt's not lost you can see it in the headlines re near New York times Nineteen sixteen everybody's fascinated why is the you plan coming here what is this business about is this\nAn enemy warship is that for us and it goes all the way the Lansing the secretary of state the president knows about it in a moment we're going to meet the wife of the of the vice president of the United states because this is the celebrity you ...\nThe Baltimore sabotage cell German agents American traders in the ... World War one I'm John bachelor this is the John ... or something [noise]\nWhile five point nine ...\n\n\n\n... the other half of the army out to the Russians when in fact he needs to be sending forty divisions to face the Russians and ate divisions down to face the Serbs but instead he sends twenty against the Serbs and um [noise] two and a twenty eight against the rush and they're not nearly enough for the Russians are going to build the strength of a hundred and Ninety six divisions\nThe three Army Corps that are sent against the Serbs are in the hands of tiara who is the rival of Conrad and post your and he's even less effective as a commander and more hysterical as a man searching for victories and Conrad\nAnd what they what they wind up doing is trying to cross the dream river\nTo press into the mountains and we learn from the first time and Jeffrey's book that the Austrian citizens are totally unaware of how to fight a war they're\nBarely trained and this is the first and best of the draftees they don't have enough weapons is generally a Jeffrey said but they fight badly they bunch shop and charged with band into what's your insulating fire and it's a disaster in the heat and they were beaten by their own tactics and I said that correctly Jeffrey\nYeah yes exactly and and and you're right this really hasn't been covered if you look at history the real world one\nUh the the ... and it's it's quite puzzling how they actually lost but no story and has really gone any detail and how that campaign was fought and how it turned and uh you know what happened was the the ... and as you said these were the best troops and the author and good are these with along service troops\nAnd my book by the way\nHe concludes by saying really by\nThe end of Nineteen fourteen is game over because the train to army has been moderately annihilated and the train obviously been an island and they start getting annihilated in the Serbian campaign and the Russian Campaign Nineteen fourteen and what's happening here in August in August September Nineteen fourteen as they\nInvade Serbia is we've seen these troops even though they are technically the long service professionals or anything but and that's because\nThey are stronger in army was so\nNorth Korea is that it it it didn't keep the troops very long with the colors and then when they and they and they would furlough the troops frequently and or in other words instead of keeping them two or three years of constant service\nThey would just send them off for six months back to their villages because they couldn't afford to pay them so these guys were very lightly trained that had very little practice or with their rifles\nThey had no practice infringing there'd been no combined arms practice maneuvers where infantry practice with the artillery to sort of advance with covering fire and deliver the artillery shoot them through enemy positions this was unheard of\nAnd so because the troops were so a poorly trained and poorly equipped\nAnd also hard to leave because remember this is a ... army speaking a dozen different languages there is a German language of command eighty words that all recruits regardless of nationality need to know but you know realistically they don't really know them I mean you're taking on educated peasants\nThey probably heard these trends but they have a hard time remembering what they all mean\nAnd then the heat of battle the chaos about all these units completely come undone and you see total demoralization in suing against you know very light reverses where a whole unit will just turn around and retreat covering the ground with his weapons and equipment as it recruits are back out of Serbia\nSo the invasion of Serbia which was meant to be a\nExpedition quick strike toward value that would that would uh envelop the Serbian Army and then and occupation of Belgrade and the partition of the king them into little pieces much of which will be taken by Austria that rest by off to Balkan allies instead to serve the Austrian back\nAnd defeat them a defeat them in August they defeat them in September and then they defeat them again in December three invasions in Nineteen fourteen all defeated by a Serbian Army that had maximum strings as a dozen division\nThe first to turn back he's at the end of August by August twenty fourth tiara quarter to a ... withdraw\nJeffrey there were atrocities committed in Serbia and I'm surprised to see that there were atrocities committed right away also when ... was that an order from ... very carefully you put pictures in here ... ... civilians was that commonplace ... and was that known about Indiana\nOh it was absolutely commonplace and it was definitely known about are the two friends for rather rather separate uh Serbia was regarded as being a different kind of place than Galicia the rules were supposed to be a more strictly enforced English\nAs being a different kind of place than Galicia the rules were supposed to be a more strictly enforced English there were no rules in Serbia because there was a great hatred between the kingdom of Serbia and the Austrian Empire the Serbs called the you know the half birds\nYou know birds with borrowed feathers because they felt that they were camped\nOut on Croatian territory Serbian Hungarian polish Ukrainian territory but what\nWere the Asperger's they the the Serbs\nCalled them ... because they came from southern Germany and they thought it\nJust a in a way that this south German dynasty the founded and the thirteenth century was still governing Serbs and Croats\nIn polls and Ukrainians and checks they thought it completely obsolete and the hamsters\nReviled the service for treating them that that kinda disrespect the thought of them as rascal you little boys that needed a good\nBeating a and they also had observed the the the Balkan Wars in Nineteen twelve Nineteen Thirteen playing the use of atrocities by all sides Bulgarians ah you know Bulgarians Greeks\nServes in the Romanians in all of these battles the book or is there was frequent resort to atrocities in order to intimidate civilians and make ... stations easier for whichever nationality was trying to make them\nAnd so the the the the Austrians joined the difference was is that the Austrians were held to a higher standard re they went into Serbia saying they were going as a western symbolizing agent and they were going to improve Serbia they were going to ah make Serbia you know ready for prime time and in fact they went in and they behave\nAbsolutely and the most of the most appalling way I mean I I toured all these battlefield in the course of my research\nAnd you see chardo houses all over north western Serbia are these little chapel set up with ... goes inside depicting villages with their hands are bound behind their backs\nBeing shot at point blank range men women and children by half brick troops and their pike gray uniforms\nThat that in August to fourteen we're going to go north when we come back because Conrad remember him he has four accord that are for armies that are attacking north unaware of the fact that the whole of the Russian Empire is coming his way\nJeffrey borrows the author a mad catastrophe the outbreak of World War one and the collapse of the apps Berg empire on John bachelor [noise]\nOne of my point nine at them and the Washington Mall W. N. A. L.\nBalance of nature's fruits and veggies in a capsule had cancer ... I have no damage and the tea\nAnd I have ... and that look like the mic\nShow my life's changed cancer I've had to learn how to live with it starting balance of nature I felt that the first month I felt different\nIt may catch it defense that way that may have you know it's clear I have more energy very rarely does ... not any more it's back skiing it's just amazing I ... I don't know what to say I am today if I didn't start pounds to nature\nFor a limited time use discount code John and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one or go on line to balance of nature dot com and use discount code drawn\nFrom the time we enter school age children were taught about the power of reading\nAbout it is important and keeping connected to the world around\nIf you have difficulty getting words on a page that's no reason to stop breathing talking book free program from the library of Congress\nPeople have trouble reading normal size print like books or magazine you could qualify for free talking books about when you subscribe to talking books in a special good player will be delivered to you for free\nYou finish one from Molly ball can order more from the thousands of his alimony title program and the postage are free called toll free one eighty five seven we won eight eight eight five seven or eight\nTeams from a selection of books and magazines ... five seven three\nOne eighty five to seven seven three three\nDimensional librarian seven and a blind and physically handicapped\nWhich do you think is riskier for your path scuba diving\nOr squirrel chasing riding\nOr drinking from puddles twists and turns [noise]\nOr fleas and tank [laughter]\nEvery day dangers are what make being a risky business bottom line is important\nFor every ten to receive Iran Lincoln wellness exam twice a year\nHey dangers are what make being a pad risky business at home mom why it's important\nFor every penny to receive a written statement on wellness exam twice a year\nRisk assessment from your veterinarian professional and creating", "year": "2018", "show_name": "The John Batchelor Show", "city": "Washington", "day": "18"}