{"month": "10", "state": "FL", "station": "WJCT", "content": "I had a back\nAnd beyond their way down anytime that they might be my friend and I was young I Love oh da da da da da da da da da da\nDu you yeah yeah ... ... ... a man\n... or ...\nOr ... or ...\nAlong the ...\nUm when I'm like oh no no no\nLana wander into law remember\nMe no I mean\nSomething above you know I'm a\nThe\nThe law\nI mean you\nKnow I mean I Know well known around the\nA on a\n\n\n\n\n\n\n[noise]\nNo no no no I mean you know I'm new to me\nKnow\nThe oh\nWow\nRight or not we don't\nNa na na\nNa na na\nI'm\n\n\n\n[noise]\n[noise]\n\nOh\nWell that's pretty much rep for the joint for this Monday Night we started this ship with ... with Mr leach will ease the pain but ... it's a group the cues again with rock and cry and the blues fabulous Catholics my girlfriend and I wonder why\nBig bill McNeely with nervous Minerva she was making me nervous just them so that will do it Harlem not during behind the snow with Willis Jackson joined us again next Monday Night at eleven for another edition of that you join until then to get the jump job and we'll\n[noise] mhm\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\n\nMm\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\nMany places in downtown Jacksonville being considered for demolition or redevelopment have had their history last how can we bring you stories back to life while determining a future ... W. J. C. P. and partnership with\nModern so each present the Jackson forgotten in space Tuesday October twenty third at W. J. C. P. studios the evening begins with a receptionist six followed by a panel\nDiscussion at six thirty or as BP with is free of that at W. J. P. T. dot org slash about sponsored and pork pie downtown investment\nFirm do up and they'll lose two acoustic music listen to after hours Monday through friday nine PM only of eighty nine nine up in your community your world your music [noise]\n\nBases they'd be nine nine W J Street to get them Jacksonville providing news information and music for Florida's palm coast to George is golden arch what's on your computer or mobile device that W. J. C. C. dawned on me\n\nI Hope you're on your Jaycee\nBe with you over the next hour\nHas we sample several collections of deliciousness for your musical palate on friday of our show you hear a brand new music from India I read that momma and later you'll hear new music from Quincy Jones and mark Robinson vocal ...\nLet's get right to the music with an old school track from Nineteen Ninety three here is one of my favorite Kevin Campbell with can we talk right here on taste test eighty nine that though ...\n\n\nHe\nDelayed the chili that\nAgain even\nIn my life as I can\nDo this and I thought id and\nBiking judged by body\nAnd penny game show makes pleasure like I\nCheese\nCheese guy\nThe issue with nothing on the ... the\nBut I don't want to do this I was I mean\nWhy not give did is equally and weak issues to bring any exit you're lugging back up the\nChain black\nEyed peas\nHe died\nWe know when you think he's a man\nWith demand been no my blog\nAnd they didn't catch me in\nAnd they all\nJust I get them up I don't even think we owe\nThe\nEvery other day and ... ...\nYou know well that's okay he's like a champagne any still I still you have a\nFor me\nNa VE Day and again I'm sure\nThat\nHe\nHas no no I mean\nYeah\n... yeah\n\nThey\n\nBeen there\n\n\nRun\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[laughter]\n[noise] [laughter]\nYeah you're right I mean like Mardi Gras long walk on a road bike ride it like a\nLight brash and they're real nice burn ... one more laid back at home and you know and so you think you're right you're burning more\nWorld though you were on their\nMackerel wow body so low\n\nI Know you may have a real feeling around by the day I don't know what\nI'm In I'm yeah I'm a\nRight [noise] yeah\nI'm On a mountain in\n\nBit oh\nWhoa\nWhoa whoa\nCome up from the show\nBack and the law while they LA how\nMe I'm Diane ... and I do you play\nRolled up\nDownload it on my own and then\nThen ha ha ha ha yeah thanks\nKnow\nAbout among they're going to be\nThe way I Would change the phone call me up may go on to be\nWatch out for some advice like someone might like\nShe drinks like corona like\nHave no concept dominate the world gold concept on me all the guys in the projects the ground interrupted marching when the worst thing that could have a jacket and ran back down to about my own and I go around the yellow jacket around\nNot lost on me neither got much it sounded\nComic um yeah\nI\nNeed the money\nThe show you something also real or is this real\n\nThough I'm a I'm In I'm\n... na\nNa\nMoney to\n\n\nAnd he's the one\nThat it is only\nHey this is David I'm our hero taste tests\nI really hope he had been enjoying the music I've been playing tonight\nThat was kept writer by little dragon\nFor those directly played summer by the Carter said energy\nDisclose it outside of our said\nRight to take a quick break and return to get\nMore\nTo go anywhere in\nThe Florida Theater present Spanish guitar legend been essay and his dance troupe on October eleventh then there's a whole new show way go but essays backed by stage full of musician celebrating flamingo ... ... ... samba and more October eleventh at the Florida Theater tickets Florida Theater dot com\n[noise]\nWhen Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that some of which have been collected in a new book on the next fresh air we talked with his son Adam Cohen who wrote the introduction Adam also produced you want to darker the album his father recorded shortly before his death joined\nWeekdays at noon on eighty nine nine W. J. C. T. your community\nYour world this is Ira Glass of his life and coming to Jacksonville even talk I costs seven things I've learned or tell about your story like videos waiting that never been on the radio Saturday remember temp", "show_name": "Doo Wop Revival", "year": "2018", "city": "Jacksonville", "day": "08"}