{"month": "10", "state": "FL", "station": "WJCT", "content": "A\nI'm not\nSaying no no no\nI'm Glad to be a\nI Love you know\nI'm I'm\n\nA I'm\nA\nGame a game [noise]\nI think [noise]\nAnd there are\nA\nGaming us John Adams\nJohn I'm going to be a\nFive day or a big\nFan ...\nKnow that a lot of\nTalk and found a man and I'm and I'm I'm I'm I\nAm now there is no longer a\nI'm\nAlmost ...\nI in a row\nAnd a half dollars up to ...\nMy bank and yet he got\nA call ...\n\nNa na\nNa na along the\nWay the ball\nAnd the loudest calls outlined the ball like\nIn a sea who\nDay and age that\n...\nThe athletes na na na na na\nNa ... who\nNow I'm In it all\nKnow why are\nDay\nYa and\nIn a way the ball ... along a lab where I Am a ball like\nAn eighty he he who\nLive in a band yeah it is a\nCall ...\n... if that happens a lot of man he\nUh well\nAh for\nA while oh\nWow ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha you know you know you like\nA\nYou know ... ...\nOh\nNo ... no lie\nWell soon my\nAnd I live a lot of my ...\nGod\nNo no no to crawl ...\nOh\nNo no no no no no no I\nI Know oh\nNo no no no no no no no no\nNo no I don't know why well may\nRun off and ... and I I I'm a high\nSchool\nOh [laughter]\nOh my\nGod oh whoa whoa whoa whoa whoa whoa\nWhoa man why well may\n... you know\nOh no no the a ha ha ha ha ha\nHa Hi maurie oh oh\nOh\nDid you join an eighty nine nine playing forty fives in Seventy eight sexually their computer but they're from the original forty five Seventy eight snap crackle and pop ups all included hope you enjoy the vocal groups like too many to list but it's a need to know you can hit me up on an email and we will lead Chanel\nSo next time it's to join take care and forget the jump Johnson and Wales\n\n\nMm\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\nHi I'm mayor Lenny Curry knowing your evacuation zone is critical for your safety and the weather emergency\nVisiting public library to get your two thousand Eighteen hurricane preparedness guy\nStay informed with real time updates jacks ready dot com or download the jacks ready to also identify your specific zone and important information\nKeep your radio one eighty nine nine the designated emergency broadcaster for northeast Florida [noise] relax\nW. J. C. P. your community your world\n\nBroadcasting from Florida's palm coast to Georgia and the golden eye ... eighty nine nine W Jaycee DSM Jacksonville\nWas an anywhere on line at W. J. C. D. dot org [noise]\nGood evening and welcome back to another episode of taste tests on eighty nine nine at that\nWe've got some great elections for you to see national wind down\nWhether Sunday is the end of your week or the start of what is definitely bound to be an even better week we hope I use it\nIt is the top of the hour and we're going to start the purse have our show with a new tracking titled or\nBy St Louis we drink Jay Warner\nFollowed by spread to and\nBy John Margie let's get right to it you know what to do [noise] ...\nI feel myself\nHe had to rely on myself I almost want to\nGo spend my time I Know\nYou've got a nod a teenager you usually see na\nNa na na na na na na\nNa na na na na\n\n\nNa\nNa na\nNa na [noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n[laughter]\n[noise]\nTell me I've changed and I know I live\n[noise] say I'm drinking too much taken too much in its skin is\nAh I never\nGone back to me and them you think you\nSaid the fact that any game and\nYou\n...\nI Am [noise]\nThe day you\nKnow from his thinking let\nIt's true I think generally the ban on same\nNah nah nah I'm Sheila\n...\nCounty I change and I know I live in\nI Know I'm trying not to my childhood trauma ...\nUm [noise]\nIt ... me and I'm going\nTo have to think that the [noise] pick up\nI'm a I'm\nI'm a I'm a in a\nOr maybe you know\nOn a show\nOn a show me from a ...\nCha\n...\nThe\nMuch he\nHe not only\nA\nDown she goes to the\nUm the oh\nI don't know jeeze\nA\nOoh\nOoh\nNo cheese\nTo\n\n\n\nYou're\nMuch\nYour\nPush\nUs so much [noise]\nSo to just to\nThree to choose from\nThat brings me all\nThe line number than ... ... ... ... ...\nYou're new to the\n\nUn and know how to weigh\nIn no way\nNo way that would be\nWell\nGet get to\n\nLong can\nThey can't do that during the day\n\nOn the right now ... ... touched on T.\nV. nine nine or ... ...\n... community [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\nThe ...\n...\nPays better lounge role\nIn shaping the blue\nThen we're going to breed can\n\nThe\nTo cope with children who\nAre well on on the news for you to\nHold on a\nLearn from the\nLong\n\n\n[noise] [noise] [noise] [noise] [noise]\n\n\nOoh ooh [noise]\n[noise] [noise]\nOh\n[noise] oh\n[noise]\n[noise]\n\nWho\nWhich in the\nA quick break and come back with more music from Adrian drink\nAny single pinpointed a new year on taste test\nRight now you're listening to Michelle indeed go children one before that we played down here and held by then\nDon't go anywhere there's much more to come\n\nOn the next ... shared Jonah Hill co stars super bad money ball and the wolf of Wall Street he wrote and directed the new film mid nineties about a group of skate boarders in the mid nineties that's the period when Jonah Hill was skateboarding but he was never great\nBecause to be great skateboarding you have to be willing to swim on your face down stairs\nOn concrete over and over and over and join us\nWeekdays at noon on eighty nine nine W. J. feed your community your world\nI'm Carol hills artistic visionary I way way left China to be able to create freely now he's moving to the u._s. but he's not assuming anything about American freedom\nYou know on the surface us the defending ... rights but deeply\nUs also costs a lot of problem for other people\nOther nations I weigh ways new home on the world\nWeekday afternoon three on eighty nine nine W. J. C. T.", "show_name": "Doo Wop Revival", "year": "2018", "city": "Jacksonville", "day": "29"}