{"month": "10", "state": "FL", "station": "WJCT", "content": "Uh does not send you ain't that the greatest well well it certainly sweet music ... especially some of those kids we spoke to after the contact remember\nAudio girls like oh but I think he's not good but it's got an echo I but I think he's going to get\n\nWhat do you really think about who I like that but not so hot that was always a good had really like that but I bet you\nAre you okay but I got to have pets domino and say oh\nAround them out but he said that oh that's always a good movie but more audio thing about that I read it got bigger for a while that's about all of us are you must have always thought that way about you\nKnow if you're sick I don't even\nRealize there are no longer life\nI wanted my love of my need him well for all those that do areas again\n\n[laughter] [noise]\n\nI\nDon't know what those are the guys who\nAre saying\nYou got a black and they get home at the\nLaundry love the\n\nOn a game you know so little do when\nStill a lot of what the child who let\nMe get a little while\nAgo K O lo\nO lay lo o\nLo go one way of looking\nTo model not too hard but there\nWas no way\n\nA\nMan\nLa la la\nLa la la la la but I'm\nGoing to go away\nNo no no no lush puts in\nA way\nThat\n\nThe\nOh the\nAround\n\nBut I'm\n\n\nGoing to bring me no\nNo I'm feeling all man\n\nAre you going to my\nFor money and my\nI'm In a\nNew barrio\n\nHey\nMom you\n\nOne no\n\nI'm not\nAt all\nNo [laughter]\nNo no ground on me [laughter]\n\nNo no I'm\nOne of\n\nThe group I'm Around well bring you know\n[noise]\n[noise] [noise] Mm\nMm\nUm\nRecreational marijuana is legal in California and eat is booming\nOn the average day we service um anywhere from three hundred four hundred orders in Los Angeles right now and the number is growing every day I'm a rebel you know that industry need by the way disruption\nThat is what it needs to tech companies and we'd I saw my marketplace\nWeek nights at six or eighty nine nine W. J. C. T. [noise]\nRelax radio claimed the soundtrack of your life nightly at midnight on the an eighty nine\nOffend W. J. C. T. your community your world\nNotices eighty nine nine W. J. C. DSM Jacksonville providing news information music ... Florida's palm coast to Georgia scolding I listen on your computer or mobile device that W. J. C. C. ...\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise]\nTo taste test I'm your host gave me for the tuned in on eighty nine nine isn't\nOver the next one I'll be sampling simple collections of deliciousness for your music\nTo some charity lake\nCrystal Lewis in French\nBit later in the show stick around for a new music to Michael rushed\nHere's loves face a nickle every mix\n\n[noise]\n[noise]\nI don't know\nI mean do you do\nAnd\nI'm not sure that we don't need to know me cry don't die\nDay\nAsked each day\nAge and I\nIt's just that when you\nDidn't know that you know there are\n[laughter] and\nNa\nNa na\n\n\n\n[noise]\n\nLearning but in New\nYork\nNot near the end up in the basement\nYou're black you know what you're doing to try\nMinimum ... minutes debating\n\n[noise] [noise]\n\n[noise] they just listening to inject it into a night\nI'll be more close to we just heard region using the jumps between played well the thing is like ... like me that's almost like when ... and I would agree to bring\nUp next we have new music from the newcomer sharing you would need to be joining us as a gift when I get it to last\nYear's low down right here on to\n[laughter]\n[noise]\n[noise]\nExtra thing to do I hope you enjoy new music tonight\nYou just heard new music from the midnight hour\nWith track by lives advantage Ross that was a new remakes official so amazing it's definitely a great project compilation with production from Adrian Young and Alisha eat before them that we played love down\nCharity league and an R. and B. classic by body will make\nThe best way I feel about\nComing up next to let's take a bit of a musical journey with music from LA producer Alexander meant Freddie better known by his stage name exile was also known to ... beach and keep the element of Seoul mixes\nAfter the song will take a short break in return with music from\nStaying in shaggy\nMichael Robinson and\nHere's mecca mix by exile\n\n\n\nAnd making making the bank but I Want to make [noise]\n[noise]\nNew genuinely and intervene\nWow [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n... ... what we will return to the program or a short\n[noise]\nMany places in downtown Jacksonville being considered for demolition or redevelopment have had their history last\nHow can we bring these stories back to life while determining a future forty ... W. J. C. T. and partnership with modern city present the Jackson forgotten in space Tuesday October twenty third at W. J. C. P. studios the evening begins with a reception at six followed by a panel discussion at six thirty\nArtists BP with his free events at W. J. C. D. dot org slash about sponsored in part by downtown investment authority Tallahassee\nMayor Andrew Gillum isn't the political fight of his life he's wanting to be Florida's governor against former Republican representative Ron defensive polls show them in a dead end Gillum star power get him across the finish line will meet the mayor next up on one at\nThe weekdays at Penn after first coast connect on eighty nine nine W. J. C team your community your world", "show_name": "Doo Wop Revival", "year": "2018", "city": "Jacksonville", "day": "22"}