{"month": "10", "state": "RI", "station": "WEAN", "content": "Looking for a car credit not great well isn't it time you financed with blood was born in east Greenwich and they were against that have the best financed reason unbelievable prices in cars with zero percent if your for Seventy two months you can be driving on the boards also models interest free log onto what auto dot com\nOr just on the radio now let's show you with Social Security is all about with the convenience of saying that your own kitchen table hold their today for zero one Seventy seven to seven to seven that number again is four zero one Seventy seven twenty seven twenty seven or check out our Web site that you could ask fest\nDot com that's easy C. L. I. D. as in financial assistance services dot com don't let your retirement become mediocre\n\nThen we will be from the New England truck solutions to the news on and on the eyes of an event than I Am six thirty [laughter] somebody be known as accumulation\nSpecial report deadly Pittsburgh Senegal shooting I'm Christopher cruise among the eleven people killed in\nThe shooting yesterday morning a married couple and two brothers the youngest victim was fifty four the oldest Ninety seven eight man three women us a journey Scott Brady said this morning it was clear that alleged gunman Robert Bowers targeted ... shot because of their face\nDuring the course of his deadly assault on the people the synagogue Bowers made statements regarding genocide and his desire to kill\nJewish people buy ours is now in the hospital had surgery last night he's being treated for multiple gunshot wounds he used to be arraigned tomorrow afternoon FBI special agent in charge Robert Jones said it was the most horrific crime scene he has observed in his twenty two years with the FBI or\nThree different locations inside of facility where we found deceased victims\nAmong those who condemned the attack Pope Francis and Israeli prime minister Benjamin Netanyahu but mayor coated the darkest day in the city's history I'm Christopher cruise\nThe coordinators of a caravan of several thousand Central American migrants moving through southern Mexico toward the U.S border\nUrged its members to rest today it appears they are doing so the Boston Red Sox now lead the Los Angeles Dodgers three games to one in the world series pinch hitter Mitch Marlon says they could wrap it up today\nWe went into the postseason saying we had to get eleven wins a and we've got ten right now we've got one more to go and uh you know it'll be a lot better when uh when when we get that a lot of fun but uh you know that's that's the mindset right now we just got to we've got to continue to do it we've been doing and uh and get that last\nGame five today in Los Angeles the I hate it when I first ever down is like either one way ticket in central Iowa another in New York City and last night's estimated six hundred eighty seven million dollar\nPowerball jackpot the fourth largest in us lottery history each winner will get almost two hundred million dollars if they choose the cash function I'm Christopher cruise\nMessaging ...\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that\nDegree in as little as sixteen months one hundred percent on line\nTo find out more text forward\nTo seven nine six four or five\nThat's S. O. R. W. A. R. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online text forward\nTo seven nine six four or five\nThat's that's a large W. A. R. D. to seven nine six four or five top\nDefense Department official confirms the Pentagon's budget will be cut\n... depend secretary Patrick Shanahan says the administration has requested a national defense budget seven hundred billion dollars for fiscal twenty twenty that's down from seven hundred sixteen million from this fiscal year\nPresident Trump first floated the budget cut last week saying he is asking every cabinet had four or five percent cut next fiscal year which begins next October ... puts Defense Department officials in a bind since they were already finalizing a budget with the bottom line of seven hundred thirty three billion\nBase budget cuts comes as defense secretary James Mattis has been considering budget growth and three to five percent Randy Kenyan Washington\nThe top story of the hour forty six year old Robert Bowers from Pittsburgh now faces at least twenty nine federal charges prosecutors say he entered the tree of life synagogue in the city\nYesterday morning armed with an assault rifle in three Gluck handguns and shot and killed eleven people\nAt approximately ... rate in terms of credit history Amazon ... promotion other restrictions apply\nRhode Island's number one board dealer is setting the standard again and again flood foreigners over one hundred brand new Ford Escape or just one twenty nine from us that's right one twenty nine per month blood as every color every option and everything you're looking for like ... dot com [laughter]\nMoving expenses there's a million ways to get into a credit card debt but one sure way to start getting out\nOf von ... von ... access to online and secure loans from two thousand dollars for thirty five thousand dollars a competitive race and no extra charges were being back early over five hundred thousand customers have experienced the convenience of alone drove on no wonder a lot has an a plus rating from the better Business Bureau the application takes ... by\nFour thirty pm central time Monday through friday funds are deposited as soon as the next business day and now it's odd but also give you a fifty\nDollar Amazon dot com gift cards as your first name but it's made on China to check your loan options and to get their special radio off or go to Yvonne dot com today and enter promo code for three fifty three when applying batch a B. A. N. T. dot com promo coach fifty three fifty three of dot com ...\nFrom the cease gave Christmas Day cold weather center here's your exclusive accuweather forecast\nClouds in some somebody breaks today with the highest fifty six mainly cloudy tonight a bit of rain later on low forty one tomorrow periods of ... in the morning and in the early afternoon type their fifty seven with WPRI most exclusive accuweather meteorologist the Travis\nAccuweather on of voice of southern New England news talk Ninety nine seven of them and I am six thirty WPRI [noise]\n[noise] this\nAll play slots at twin river casino down\nYour share of over two hundred thousand dollars in cash gifts and free slots play during I guess getaway extravaganza injuries while you play them through November twenty eight and then on Saturday December first page of the river events in an interview and the prices you why do you play some more chances you'll have\nSo has a twin river casino hotels today so much more so close\nWhen the need for senior care arises there's no place like home your loved ones should never have to give up living at home\nVisiting angels will provide home care for your mom or dad at home up to twenty four hours per day including personal care meals and light housework you'll select your professional caregiver with visiting angels look up visiting angels dot com or call eight seven seven\nThree seven four list that's eight seven seven three seven four Liz franchises are available visiting angels America's Choice in senior home care\nProducts are made by ... rate in terms of credit history Amazon sponsored his promotion other restrictions apply the website for details\nHow did I get into credit card debt a trip to the emergency room\nMoving expenses [noise] there's a million ways to get into credit card debt but one sure way to start getting out of von ... von ... access to online and secured longs from two thousand dollars for thirty five thousand dollars a competitive race and no extra charges Burbank back early over five hundred thousand\nCustomers have experienced the convenience of alone drove on no wonder a bond has an a plus rating from the better Business Bureau re application takes medicine if approved by four\nThirty pm central time Monday through friday funds are deposited as soon as the next business day and now of vaudeville also give you a fifty dollar Amazon dot com gift card after\nYour first name but it's made on China to check your loan options and to get their special radio offered to go to Yvonne dot com today and enter promo code fifty three fifty three when applying bats a B. A. N. T. dot com promo coach fifty three fifty\nThree of dot com ...\nYou're listening to the W. B. R. O. rewind bleach interview an hour and a few laughs along the way\nHave a a bubble gum machine law degree that's worthless so somebody who doesn't actually has a real one that does this stuff all the time it's been regards to of been welcome to the show thanks for calling in today appreciate it\nGood afternoon I'm at now than you are you you have some ... somewhat of a conflict here writer you are you going to be being are involved in the arbitration in that situation\nWell I'm not conflicted in any way I'm newly ... how the city or work in this particular case and I'll be\nServing as the cities are all other trader a the grievances go to remember the ... and ... ... or so called tripod type animals and I am the partial a writer for the city which means I advocate for the cities and the great\nCredit to the city picks one the union picks one and then there's a middle of the road that they both agree on type of action board the situation\nYes for all of a traitor is elected or on the panel of labor Robert ... the American arbitration association or has put together\nOr some people on the conflict is you have an interest in this you're going to be arguing for the city or\nWas like in his southern Rhode Island's bring new luxury dealer featuring Lincoln's explicit land of Lincoln Lincoln Lincoln MDC and the only twenty eight ... Lincoln Navigator one Lincoln of never against such funds here alone luxury\nThat's that's a large W. A. R. D. to seven nine six four or five\nYears thinking about the change in weather shouldn't say John life\nWe have blankets and that just adds flannel sheets ads covered throws energy saving drain our prices are the lowest around forty dollar famous labeled men's memory foam\nSlippers first ten dollar is one hundred dollar notch her daughter's teams just twenty five dollars and Ninety percent savings bond dresses sweaters jackets pants Nick top\nFrom America's favorite department store mention ladies winter fleece jackets our ten dollars ladies marina wool socks regularly eight dollars three Ninety nine apparently\nHave many different here is a large selection of all purpose and industrial heart check out our agreed selection I said lady three M ... blind leather gloves for just six dollars don't forget that coffee fight Haiti count ... single serve coffee for Nineteen Ninety nine and getting handler crazy Dale gift card free\nGet a lot more for a lot less\nThan ... and you're listening to the W. B. R. O. B. Y. bleach in an hour and a few laughs along the way\nBeen or gossip is a a labor attorney who usually management side works for cities and towns all over Rhode Island is considered an expert in this field or just curious about the validity\nIn the the legality of site agreements and and then I always considered just decided agreements just to be completely just by their nature invalid but you're saying site agreements happened as long as they're ratified then they're part of the contract and you're good in ... you know it's just a name that you know\nIt's it's just a description if you will write but\nAside agreement is a collective bargaining agreement it's made\nBetween a representative of the union representative of the municipality\nIt's just usually doesn't happen in the beginning when the entire contractors decided just happened to be nine terms or something like\nThat yet what they call in the executive oriental the middle of the contract kinds of issues arise but again it's got to be ratified it\nThat it and ratified it's a valid single subject collective bargaining ...\nRight and so if it's not ratified but yet carried out as if it had been and somebody finds out about it what\nSort of relief or or recompense Kan city get from people who have been collecting money supposedly illegally\nOr a couple of options for informal\n... on the defensive defending a grievance that allegedly arises from a violation of the side agreement so cool site agree that it has an affirmative defense the site agreement is invalid and on and force in terms of any um any\nOther remedies or diminish the power to you may have upon discovering that is a Spider Man out there that may not have been properly ratified or they may be claims arrest training for unjust enrichment of certain employees under the terms of the agreement [noise]\nUm and other forms of relief but that would be dependent upon the nature of the site agreement particular effects\nSo if you're somebody you know she was in the case of war but if somebody was found to have been getting an extra payments for something that was done in a side agreement that was ratified they have to pay that back individually\nIt's impossible that possibility that could be a claim made restitution the ... the a cash conversion if you will of leave to uh\nTo body was a mate pursuant to an unlawful agreement and unjust enrichment would serve as a basis to recoup some of that money\nIf you have people who are in political positions or appointed positions who are you know fire chiefs who are on this ... any collective bargaining agency ... negotiated between the city and a collective bargaining agency who knowingly get into an agreement that they know was not\nValid because it was ratified and executed anyway\nAre they criminally liable have they are they they committed a crime at that point\n[noise] well that's a pretty that's a pretty broad state and it would again be driven by the facts whether or not somebody knowingly and willfully and to this\nWhat is your Chevy GMC Honda and Toyota and Subaru all have in common there are all in for Steve we own condition and what more Denise religion there were against the wind over two hundred three on cars all makes almost had incredible love on to John John now\nPretenses or to a steal money in some way under the construct of aside agree and then there's always that possibility what I find in my practice is that oftentimes municipal officials may\nGood faith mistakes and those mistakes that based on ignorance and I use that word in the sense of it's a ... not knowing\nWhat the law is a there's some belief out there that aside agreement can be made at any point in time during the life of a of a collective bargaining agreement and if the union\nAnd a manager agree upon it it's somehow a enforceable and that's why when I\nGive presentations to the league of cities and towns and I speak to elected and appointed officials I remind them that they should always consider whether or not the subject matter is that they are negotiating I read the mandatory or premise a lawful or unlawful\nWhatever agreements they strike be sure that those agreements are presented to the proper corporate authorities within them in a ...\nOtherwise the agreement is void I'm going to give you one example\nCan I just say one real quick to sing to you I I I Know that you're being you're a lawyer and you have to be exact and your speech and you have to be exact in you and your\nUm in the possibilities whenever speaking about this but I think more blunt well just I'm just seeing as an observer and she'll be seen as I find it wholly unbelievable that any fire chief\nOr any cheap many department or any solicitor or anybody who's the head of a union who are pretty much experts in the stuff that they use it all the time anyway would ever get into a site agreement and ... and not know that ... doesn't ... than it has to be ratified that's that's beyond my but my my belief\nI mean how can I can see why you hold that believe yeah uh I can tell you that\nI have seen people that are completely ignorant or to what\nShould be done now whether or not people are acting in the various ways uh again that that's dependent upon the particular circumstances but most\nOf my clients are sensitized to the to the fact that they don't strike deals\nUnless they follow the proper process and I'm certainly these questions of bound in the in the war were sick leave grievance and ultimately the greed that's process will play that out but\nYou know a unions are very crafty\nUh about sidestepping if you will uh the the formalities of ratification and uh you know one case I add in Providence involved the so called minimum staffing provision communications division\nI couldn't find anything in the main collective bargaining agreement about minimum staffing put dispatchers\nAnd when the case was being ready for ... and I show up at the ... and learned that the union had a Nineteen and a half year old stipulated\nArbitration award would they showed up at the creation and said we're going to agree to minimum staffing in the\nPolice dispatch operation and of course my reaction was Nineteen and a half years old even if it was a valid collective bargaining agreement and even if it was ballad a as having been ratified\nCollective bargaining agreements limited to three years in duration right well you have a trader wound up enforcing that stipulated award and I went to superior court and justice ... Cheney very wisely\nVacated the award and the union asserted that while we make the deals all the time and that's part of our living relationship with the city and those stipulated awards are just as valid as a main collective bargaining agreement\nWhich the judge who responded well that really puts any city in town at a disadvantage holiday to divine whether or not these agreements exist and wherever they kept it wherever they maintained and was stipulated arbitration or whatever blessed by the city council\nBeen I going to run for the news or if it gets time thank you for clarifying all this as much as you would hope that helps thank you remember constantly is never going to talk about this may come\nThe Christmas Day whether he was your age you one of the forecast clouds and some of the race today the highest fifty six mainly cloudy tonight a bit of rain later on low forty one tomorrow periods of rain and results\nLooking for a car credit not great well isn't it time you financed with blood was born in East Village and there were against that have the best financed reason unbelievable prices in cars with zero percent NPR for Seventy two months you can be driving on a force also models interest free log on to what Tom\n... voice of southern New England news talk denies seminar for him and I am six thirty WPRI\n\nThis is Joe ... co owner of the kitchen counter tops center of New England I've often wondered why people looking for kitchen cabinets and counter tops go to a store that sells weed ... employed\nWhen Casey see any is new England's largest design show or on foot kitchens bathrooms with over forty working displays in three thousand square feet of installed countertops\nWe all for ten cabinet lines and complete kitchens deliver them as little as five days Casey see any has more than five hundred calls are granted in courts countertops the Jews from an onsite fabrication with installation\nA a legally and\nForce forcible type of document I don't know I'm waiting to see what the arbitrators come back at but once we found out that that document it existed the chief a discontinued that policy that was going on a a grievance was filed by\nThe uh the union firefighters union or the\nChief denied the grievance and that was appealed to my office and then at that point it's up to meet to uphold that the denial or reverse that denial I upheld that than I ... and I stood behind the chief finding that the document was not properly\nThey're still getting their their sick time bone is it's just not calculated without based\nOn this um this site agreement that appeared now based on\nLet's talk about when we talk about that side agreement for a second I mean is it a is it beyond a is there any any sort of the definition or any sort of a type of site agreement that you could ever possibly see being legal in the city of war for any ... chief executives to make with any sort of union outside of the council purview\nAs well as the eye and the um originator of a ratification by the city council of any agreements entered into of this nature I can tell you that if there's going to be any amendment to an agreement or if there's going to be agreement at all have required the ratification of the legislative branch of government\nWhich is the city council to making it right an agreement and that's what happened uh and then if it's ratified it uh it uh you know it becomes implemented\nSure I'm so there's no sense in other words there's no such thing as side deals with mayors of any kind of it is well\nI I don't know if there's any such thing as side deals but let's just not legal thing as a ... ... ... and fossil five deals underneath the ordering that currently exist in the city is with all this which of which I was one of the I in fact I was the original sponsor of that or\nThere's an audit going on right now in the city for this issue right there are ...\nThey're a tool and it's going on right now ... there's one going on by the council auditors are\nThe council president roller commissioned in a way to get to the bottom and get some factual information on this also and\nThere's also when or where ah the bargaining group the firefighters bog in a group of firefighters union I'm only ... I I was an order thing for him to perform an audit also so that there probably will be\nThe results of to put\nAudit pursuant to this particular issue both in calculation and I would think you know the manner\nIf for whatever reason we find out that there was improper payment made these firefighters for for sick time will you seek restitution from them\nWell not it it's tough to say at this time simply because um that would be reaching a conclusion a conclusion that I cannot make at this point we're not having all the\nFacts before me if there's a ... it's not just the numerical number\nOr that there are other factors involved relatives illegality and I wait the findings of the average reader and and nobody want to paint any finding or or a or a hypothetical actions based on a finding a\nAre you going to war against would you support an advocate for these order to be made public\nOh I there there's nothing or listen as far as I'm concerned it all documents should be public accepts something that uh that hip all related to things of that nature Mm that an individual uh is entitled to their privacy for right but the ... you know\nI I Am all for open government and you know\nKnow there's a question about there being a non ...\nRhode Island's number one board dealer is setting the standard again and again flood board has over one hundred brand new borders gates were just one twenty nine from us that's right one twenty nine Vermont blood has every color every option and everything you're looking for like ...\nAh I don't know what the nondisclosure agreement maybe but uh I Would say that uh that may be the ... the party that commissioned the audit but I think the party that receives the audit enjoys the benefit\nOf the results of those ... wants to see them otherwise what's the purpose of an order right I mean to keep it private\nNah it's up to make any sense right\nWhat is the right so if but if you find that there is a you know there's there's evidence that this was wrongly given out to firefighters for whatever reason will you then seek for either state police or some law enforcement agency to figure out who made the deal how we're against against city law\nWell you know the thing is this going out for a legal enforcement of such a thing in a criminal nature uh requires intent if there is criminal intent involved\nIf it's a civil nature there's a different way to approach it for restitution and again I Can't make a conclusion on either side of that without seeing all the facts and the results with those facts as they come back rubber that's what I Can't imagine I mean I I I Can't commit to you know we're going to hang everybody higher I Can't commit to we're going to get all that money back\nAgain um you have to look at a uh all factors to recipients the participation or the intent of individuals' there's there's many many\nAs you expect to get the evidence of intent from an audit\nI Know but that would probably uh I I Would think that uh any findings of a um\nArbitration would give you some factual information\nThat if there was any indication of some sort of malicious intent or or or are you know criminal intent or something of that nature ... that are at that point the responsible parties would turn that over to legal authorities for for ... ... you know as a criminal thing right but you can't\nProceed on hypothetical basis whatever whatever you know I might buy a mega million tickets and I went you know I I don't know what number I'm going to play right but I'd like to win it yeah\nI just think that you know just knowing where your mindset is going into and what you're predisposed to do is important for people to know because I think it's a big issue somebody's making side deals that somebody's gonna pay for ...\nAnd you know something I I'm all for equal enforcement I'm all for equal treatment I'm all for open government I'm all for disclosure but I cannot reach a conclusion on any issue until until I have all those facts before me mirror and when I Do when I Do you ... you will be you'll hear me loud and clear\nAll right man I Know you're going to run because I'm up against war two we have limited time thank you for coming on a preacher look forward to doing it again\nHuman voice of southern New England W. P. R. O. N. Gresham raw soccer with me here on the ground showing WFCR oh\nYou're from the last several football by guys on friday I have an even money gambling five gas and the reality is when you bet for pictures in the very true that is not a recipe for making money says not arrest you for being right to more often than not they're going to be spread more when they're going to win\nSo much as I was the last six to nine pm until you are\nA vital lovely lady look we got a letter from spike soldiers went on vacation and let them into my country club for cats and dogs [noise] let's see what he says the is second best friends to this place is they catch me out\nNo wonder they call it a country clubs down my resistance specializing in luxury pet care since Nineteen fifty eight they've got cools central air conditioning for security and fire alarm system play the music and the owners live right here they cater to my special diet\nGive me lots of room to run and shower and he would attention I'm In closing\nSome brochures room dome Ira ... my advice to you canine to get easy just to leave him around your owners to ... billion scratched this number in the furniture do nine for three to four seven fetch tonight for three to four seven\nAt least some travel magazines around then when you're owners go away you'll get to stay and do my record because to lucky dogs\nMessaging ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more checks forward to seven nine six\n... group wants your car any make any model what pays more than anything or around because we're a certified buying center had will buy yours even if you don't buy ours log onto our high car buyers are tough\nMBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online tax forward to seven nine six four or five\nThat's s a large W. A. R. D. to seven nine six four or five\nThis is a court ordered notice current and former foreign Lincoln and mercury owners are less sees can receive payments and other benefits from a legal settlement related to allegedly defective tectonic airbags in their vehicles\nTo see if your vehicle is included and to file a claim to auto airbags settlement dot com or call one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five nine six\nPeople\nAll over the state people are warming up for the voice instant game from your Rhode Island lottery\nYou can wind up to fifty thousand dollars instantly to\nRent or non winning tickets for a chance to win a trip to the voice of experience in Las Vegas in LA with a chance to went up to a million dollars and a seat at the voice live finale and\nIt it it was what you've seen say you know it's time to officially in publicly asked\nThe state police to come and look at this or to ask the U.S attorney to come and look at this\n... I'm Sorry could you repeat that oh\nWell from what you've seen and what you know about your with your what you've seen so far is do you now think that there's time to publicly call as a city council president for federal law enforcement or state law enforcement to come in and look and see for crime has been committed\nWell I I just said that as far as investigations that on cooperating with any investigation or\nHave you been contacted by adding out yet and that's as far as I Want to go have you been going to make it into one way or the\nOther guy from New England trucks allusions to sell some of them than I Am six thirty WPRI stations [noise]\nSpecial report deadly Pittsburgh synagogue shooting authorities have released the names of the victims of the Pittsburgh synagogue massacre and the city's leader has her Justin is is that just suggested by the president\nPresident Trump said things might have been different if there was an armed guard outside the tree of life synagogue were eleven people were killed Pittsburgh Mayor Bill to do do disagrees saying that's not the way to protect against irrational behavior\nThe approach that we need to be looking at\nHow we take the guns which is the common denominator of every mass shooting in America out of the hands of those that are looking to express hatred through murder\nBut do do called it the darkest day in the city's history but\nStress its resilience in the face of tragedy ... Pittsburgh\nAnd suspected gunmen forty six year old Robert powers of Pittsburgh is set to appear in court tomorrow he faces twenty nine camps including hate crimes and Kate's\nThe man accused of sending pipe bombs to prominent Democrats and critics of President Trump will go before a federal judge tomorrow afternoon homeland security secretary Kirstjen Nielsen tells Fox News Sunday that Cesar say I did not have the right to terrorize America\nAnybody in the first amendment I had heard kids threatened or commit an act of violence that will not be tolerated there is no place for hate a country hate it hate violence and violence they will do all we can at the department of homeland security can ensure that such attacks are not perpetrated\nTropical storm Oscar is poised to strengthen the system is more than eight hundred miles east of Bermuda packing Seventy mile an hour winds officials in Florida meanwhile have once again raise the death toll from hurricane Michael\nForty five people were killed by the powerful storm including thirty five in Florida the Florida emergency management division says two more deaths were confirmed in hard hit they county racing the total there to Twenty one I'm In [noise]\nOr the products are made by ... rates terms like write history Amazon sponsored this promotion other restrictions apply the website for details how did I get into credit card debt a trip to the emergency room\n[laughter]\nMoving expenses there is a million ways to get into a credit card debt but one sure way to start getting out of von ... von ... access to online I'm secure loans from two thousand dollars for thirty five thousand dollars\nWhat auto group wants your car any make any model what pays more than anything or around because we're a certified buying center and we'll buy yours even if you don't buy ours log onto our car buyers are tough\nNo wonder about has an a plus rating from the better Business Bureau the application takes medicine if approved by four thirty pm central time Monday through friday funds are deposited as soon as the next business day and now if I Would also give you a fifty\nDollar Amazon dot com gift card after your first name but it's made on time to check your loan options had to get their special radio off or go to Yvonne dot com today and enter promo code for the three fifty three one applying bats a B. A. N. T. dot com promote fifty three fifty three of dot com codes five three five three\nSuper heroes and video game characters are among the most in demand costumes is Halloween Google\nCold spring guys stand experiment in trans tracking popularity through online searches there are old favorites dinosaur unicorn which pie written princess\nBut separate heroes they're strong on the list last I checked Spiderman was begun at or near the top of the list over the past week characters inspired by the apocalyptic survival video game Fortnite\nVideo games the search engine says inspire four percent of all costume searches if you want to see how your dress up plans right or maybe get some ideas just Google freight guys I'm Jan Johnson\nTo take it to one that's seven hundred and forty million dollar Powerball jackpot the fourth largest in us lottery history players in central Iowa and in Harlem in New York City have matched all six numbers in last night's drawing I'm In ... [noise]\nMessage and to raise ... earning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in as little as sixteen months one hundred percent on line\nTo find out more text forward\nTo seven nine six four or five\nThat's S. O. R. W. A. R. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online tax forward\nTo seven nine six four or five\nThat's that's a large W. A. R. D. to seven nine six four or five\nMiles from the sea gave Christmas Day cold weather center here's your exclusive your weather forecast\nClouds in some somebody breaks today to hire fifty six mainly cloudy tonight a bit of rain later on low forty one tomorrow periods of rain and result in the morning and in the early afternoon type to fifty seven with WPRI was exclusive accuweather meteorologist the Travis\nAccuweather on the voice of southern New England news talk not in a seminar for him and I am six thirty WPRI [noise]\nIf you've been putting off getting at here restoration listen up this is what you've been waiting for diesel final hair restoration centers individual graph technique or I G G is a highly advanced scar free procedure that moves your own hair one follow go at a time without they use a scalpel or stages giving you a denser a more natural look\nDeStefano hair restoration center is the only practice in New England that performs this unique I. G. G. procedure in fact\nDoctors fly in from around the world to observe their techniques call now for your free I G G consultation financing is available with payments as low as one hundred Nineteen dollars a month\nI G G is suitable for all hair styles it's less invasive with no ... no pain and no visible scarring so you can be back to work the next day plus it's affordable on just about any budget\nCall one eight hundred eight nine eight hair to learn more beds one eight hundred eight nine eight hair call one eight hundred eight nine eight hair or visit checkout I G G dot com for details welcome\nTo Jimmy Hi you're new nine weeks it was so good how do you make it\nQuality ingredients in line I mean we definitely don't sing along with ... when it's making my pairing things you baby right and we don't use it maybe Harry or to carry that one phrase nine green we said the calling like I mean not face these sandwiches\nOkay I'll take a turkey Tom don't name on it makes it harder dry our new nine green we ... we were yeah imagining a better bank\nStarts with looking at the savings rates most banks offer in saying really capital one is building something better you can open a capital one savings account with one of the nation's best savings rate from anywhere like here for here\nHow would you like motor trench twenty Eighteen truck of the year for only one Ninety nine per month we'll say hello to forge twenty eight gene Ford F. one fifty a best friend for the best price anywhere just one hundred and Ninety nine dollars per month only at point forward and he joined Narragansett\nBanking reimagining what's in your wallet consumers only offered capital one ... twenty eight in capital one you are listening to the W. B. R. O. rewind reach me give you an hour and a few laughs along the way [noise]\nAnd your voice of Rhode Island talk six thirty Ninety nine seven W. B. R. O.\nThey suspect is in the custody of the FBI\nI Want to remind everyone not to defend it in this case as in every case is innocent until proven guilty\nTo defend it male destructive devices to citizens of this country who currently holds or have held for highest public offices\nPresident Brock Obama former secretary states Hillary Clinton former vice president Joe Biden former attorney general Eric Holder Congress person Maxine Waters US Senator Cory Booker former CIA director John Brennan and former director of national intelligence James Clapper\nThey uncovered relating fingerprint from one of the envelope containing ... had been sent to congresswoman Maxine Waters we have confirmed this fingerprint is that the seas are saying\nThis part of the broadcast sponsored by Rhode Island visit Rhode Island French town wrote in North kings town for prescription eyewear for everything you do Rhode Island ... [noise] I got a line for you for three eight nine seven seven six four three eight zero toll free one eight hundred three two one nine seven seven six one eight hundred three two one\nDirty P R O a reaction to I think the quick work done by a the federal law enforcement agencies that had been engaged in this process alone with the New York city police I'm sure a\nHi I'm Dennis Becker's ... you know some things in life are just built to last like my baseball career that lasted twenty four seasons in one of these new customers resigned garage doors by garage headquarters and their quality is life out\nThere whether resistance and dominant and their best door price guarantee\nJust like where I threw my no hitter\nIf there was a hall of fame for garage doors garage headquarters would get my vote to\nMessage into your ...\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty\nLeaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line to find out more\nText forward to seven nine six four or five\nThat's S. O. R. W. A. R. D.\nTo seven nine six four or five star to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs online tax forward\nTo seven nine six four or five\nThat's that's a large W. A. R. D. to seven nine six four or five\nHi Kevin Mahoney here was when the truck solutions and ... we have to say that when New England industry leader and detailed production insulation animals\nFor a true one stop shop because we all aspects of the job without having to outsource any weights specializing in vehicle rats and fleet changes [noise]\nIt was one of the few graphic companies in New England that off the highly acclaimed three M. M. C. S. friend warranty\nSix five nine zero zero zero\nOn line to anti trust solutions\nWhen it comes to your marketing and direct mail needs save yourself a headache go is a signature printing signature offers an exceptionally easy and powerful multi touch marketing programs that enables you to leverage a combination of print male female and Internet ...\nImpact of your message from design to variable printing to white ... signatures here for you locally owned and family operated contact a signature experts at four O. one for three years twelve hundred\nOr on line ... signature printers dot com\nAnd listening to the W. B. our own rewind featuring interview an hour and a few laughs along the way\n\nLooking for a car credit not great well isn't it taught you financed with blood born in east Greenwich and they were against it have the best financed raising the prices in cars with zero percent if your for Seventy two months you can be driving on the boards also models interest free log onto what auto dot com\nOh political violence to take root in America can laugh about a half\nAnd I'm committed to doing everything in my power as president to stop it [noise] I just got\nBottom line is that Americans less unify [noise] and we my show the world that we are United together in peace and love and harmony as fellow American citizens [noise]\nOkay [noise]\nAll right then let's see if you can put two days back to back Mr President [noise]\n[laughter] let's let's see [noise]\nLet's just see right [noise]\nCell phone numbers for three eight zero toll free one eight hundred three two one WPRI wrote emailed me and Dan at six three O W e appear that\nKind of as I said at the top of the conversation\nWe started a little late because we were carrying the press conference from the federal officials the attorney general who you heard right there FBI Secret Service I'm beyond\nRegarding this fifty six year old suspect in Florida they think is responsible for and we'll charged with responsibilities sending out these Thirteen packages\nUh hopefully there's no more of the system uh reportedly\nHe was living out of that van that's got all the make America great paraphernalia on it a media has identified a picture of him at a Trump rally or he reportedly is a ... a registered Republican but he's a guy who's at a troubled past\nUm he's\nGot he's got a record he is threatened to use explosives or in the past he was known to law enforcement\nUh what it is the pin this guy on Donald Trump\nI don't know how you do that\nI've never heard Donald Trump say we should start sending pipe bombs\nTo democratic opposition\nYou know we we we have to\nBe discerning about this\nBut there is the president responsible for a for setting a tone in this country every president has been responsible for setting the tone in the country this is not a new expected responsibility\nAnd I I'm I'm\nI'm completely missing how we've gotten to a place where so many people would die on the show suggesting that he has no responsibility to do that\nBut that he is so misunderstood he's only ... the the level the level of discourse on this program every time we talk about Donald Trump ...\nWhich is why you know whenever I can I avoid them now this isn't a void will uh we are going to be moving back\nTo the governor's race cars today a was Sunday the assertion that Alan ... made today on an immigration matter\nIs outrageous out rages sleep on true\n\nAnd we're gonna play that for your coming up sooner than later this NBC ten story it it will look we may run a little little thing later on just to have some fun top ten dumbest stories of Tony Eighteen\nOr this one's in it this one on furlough a two year\nOld story that was already resolved there was nothing new in this story about this little oil thing he had on his property with the e M\n... it and and so because she's a former employee now disgruntled it's like it's like a like a relationship gone sour has truly flipping the bird on on on video\nHim in ... they'll they'll kill your benefits meaning his is unemployment checks because not because he's a state rep\nTrying to throw his weight around but he's a former employer knows that the ... who who felt that the time the guy was double time in the state\nIs it that it's we're is the discernment on the part of news organizations not to run something just because you get a cheesy video I got to tell you something channel ten used to have a high high standard channels tens got a lot of work to do\nIn terms of its standards it really does\nLook full disclosure and transparency I'm On channel twelve payroll\nBlood Lincoln is southern Rhode Island's premier luxury dealer featuring Lincoln's explicit lineup of Lincoln and Casey Lincoln Lincoln MTV and the all new twenty Eighteen Lincoln Navigator what Lincoln of Narragansett unparalleled luxury him ... surface\nOf four days a week or two shows on Thursday ... five nights a week my right to the seven thirty blocks problems have been like but I'm an equal opportunity attributed for good and smart and people who listen to me for a long time know that\nThere's nothing like having taken on a you know back in my own employers want and what I think they have to so I'm just I'm seeing that just to try to create a little bit of sanity up every channel ten is lost in standards\nWho we got a video of drilling flipping the bird let's go to temperament like oh come on really\nWho we can we can we journalistically grow up a little bit around here me for the most part you don't tend to be a good job still but that that that story that they ran last night who is pure stupidity only be doubled down by Ellen fun\nUsing it to for his conspiracy theory\nYou know on ... in in in intro low\nThe dumbest dumb as I I guess I morphing you're I I guess I'm morphing I can feel myself morphing into another subject and I'm dying to talk about\nUm so I'll take it would take the more calls on on the bombing suspect and then we'll ... we'll continue with my my lay out of this particular thing and then I'm going to play for you the Alan ... fun\n... no ... across the room you couldn't get you couldn't he couldn't get out of the room with his ... knows from the immigration press conference he had today\nAre\nAll right for a laugh ... P. R. O. J. lo\nO that Michael again yeah\nYeah um\nI Believe the Democrats are way more on several then Trump I mean we've been listening to the media or check the Democrats but yet we finally got somebody standing up to the ... standing up to the media during that same thing the Democrats have been doing the Democrats lie and\nThere is no difference between the immigration process sees between the Cranston police department and the Providence police department and the Central Falls police departments\nNow while the politics of immigration or twisted in played differently by the elected\nLeaders when somebody is picked up for a crime\nAnd his suspected based on the finger printing and everything else that they got to do of being of either incorrect or illegal status Cranston Providence and the Central Falls all do the\nSame thing you lie in campaign in ... son of a boom in is in theory aiding just sit here and listen to that garbage and I mean garbage [noise]\nFrom Allan Fung I have no idea what that sound effect was but I Will tell you this\nYou shouldn't buy it\nAnd we'll take that audio and we'll test it through the state and you'll find out that every damn pd in this state does the same thing that Cranston Dick congratulations to Cranston for doing the right thing and it's no different than what Providence or Central Falls does\nAnd how dare key lie about that in this campaign\nNews talk six thirty and Ninety nine seven have him W. B. R. O. along with WPRI twelve I Witness news more sense newsmakers and they said he lives we joined us Sunday nights as sick as him White House ... interviews with southern new England's top politicians and other newsmakers then\nAt six thirty join host time they see as he showcases emerging businesses interviews business leaders and the owners and highlights local business drafts newsmakers a sex offender executive suite at six thirty Sunday nights on news talk six thirty that's Ninety nine seven have found W. B. R. O.\nThe a lot less money for a lot more TV TV so big you feel like part of the actions of where you think you're in the theater physical fiscal center in Warwick has all the way the TV's including smart ... from when he boarded Seventy five inches\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit light up of Lincoln M. K. C. Lincoln ... Lincoln him Casey and the all new twenty Eighteen Lincoln Navigator for Lincoln of Narragansett unparalleled luxury impeccable surface\nThe rain um flea market every Sunday for the showroom fifty five electronic drive in more ways just off Jefferson Boulevard and it'll discount dot com\nIs your business looking to relocate far you seeking the perfect spot for your new offices are manufacturing operation gum explore the historic Kilmer email in New Bedford home of the oily museums grand panorama boasting rustic finishes Campbell parking water views and he's the highway access\nTo kill ... has rental spaces available from one thousands of fifty thousand square feet\nAnd our ... management structure teams is ready to build to suit your business the visit ... today for more information\nMessaging data rates may apply earning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more text forward to seven nine six four or five\nThat's S. O. R. W. A. R. D.\nTo seven nine six four or five star to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the WPN carry business graduate programs on line text forward\nTo seven nine six four or five\nThat's that's a large W. A. R. D. to seven nine six four or five\nA vital fluffy lady look\nWe got a letter from spy on his went on vacation and let them into my country club for cats and dogs and let's see what he says the second best friends that does this place is the catch me out\nNo wonder they call it a country club down my resistance specializing in luxury pet care since Nineteen fifty eight they've got cool central air conditioning for security and fire alarm system piped in music and the owners live right here they cater to my special diet\nGive me lots of room to run and shower him with attention I'm In closing\nSome brochures from dome Ira country club my advice to you canine gene kid easiest to leave 'em around your owners to find\nBetter yet scratched this number in the furniture to nine for three to four seven to nine for three to four seven at least some travel magazines around then when you're owners go away you'll get to stay a dome Ira country club to lucky dogs\nAnd you're listening to the W. B. our own rewind featuring interview an hour and a few laughs along the way [noise]\nBut you know would it kill you every once in a while to fully a little far\nUm and I actually can't remember the last friday afternoon with my father had five o'clock open so we actually were just goofing around I guess it's just a political season\nBut let me give you a boom boom boom anyway [noise]\nBecause ... signed the agreement to cooperate with federal officials when we find a criminal in our jurisdiction who's here illegally\nRichard Thaler crews will not be terrorizing the streets of France in any further our officers were in constant contact with federal officials and actors processing an arraignment and district court\nThey were waiting for him and took him into their custody while many issues surrounding immigration czar complex and requires cool heads I cannot for the life of me figure out why we can agree that criminals who are here illegally have got to go\nWhat if this had happened in Central Falls to Providence whose mere stood at a press conference and pledged not to cooperate with federal officials\nThis guy would still be roaming the streets\nThat is such who we\nNow I miss something and I listen to this thing six times [noise]\nI don't know what the crime is Alex you remember what the crime is I've I've got back on the table but a million times he just said he got picked up on criminal charges so the students got like three aliases if you go back and listen to do a seventh movie I listen to what six times I I don't know what the crime was would this guy\nSo that was funny hat oppressor today on immigration and I we had this conversation last week or two weeks ago I was trying to explain to you\nThat both\nRhode Island's number one board dealer is setting the standard again and again blood borne has over one hundred brand new Ford Escape for just one twenty nine from us that's like one twenty nine Vermont flood has every color every option and everything you're looking for like ...\nThe same process these would their police departments for different politic ... it in in painting them with different political brushes to suit their own political needs were lords is no better with the sanctuary city crap\nHe's ... you know all about the ... you know I Am a single we are proud sanctuary city and they're poor\nPolice department is doing everything that any other police department is doing in terms of diligence with those who are committing crimes\nWho are also here legally\nThey're doing the same thing that Cranston doing prints who's doing the same thing the provinces doing the differences that there's political motive Kay Allen fund ... the city of Cranston did sign a piece of paper that the the the the uh the um\nThe Trump Administration was looking for a\nTwo affirmed that which they were already doing there's nothing new in it's their own police chief chief one quiz told me that rage\nHere I'll play that for you to come up in a bit in is outrageous the politics of this immigration stuff\nIt's one thing if they were telling you the truth and they could do the the they were doing something differently the city of Cranston was was you know knocking down doors looking for you know illegal immigrants who might be critical grinning crimes more so than the city promised that we'd have to say that's what they're doing but\nThat's not what they're doing that's not what they're doing\nAnd for him to his shirt does this do that had three different names would have been walking the streets of Central Falls or Providence based on those law enforcement agencies having no interest in processing them with the feds is come sleep bonk\nBonk\nNo ... and even James deals or think there's a bang up job in the city of ... as central\nFalls but you have a different political point of view on immigration in general that's true but they're law enforcement process these are no different than Cranston ...\nGod Almighty\nSandy and Cranston you're on WNPR oh hello\nI can die on things first of all I Want to thank you and uh the other has the other shows on your station 'cause I think what you guys is really important and um I think you guys are really getting really stand down to ... I don't always agree with what you said that\nOh [noise] what first of all first of all\nThe Trump effort to penalize cities and towns or or to threaten to penalize cities and towns on federal funding was met with ridiculous bravado on the part of some Democrats across this country\nRidiculous ...\nThat they wouldn't that that that they didn't need that money that they could they would stand on principle\nRather than worry about the money and I do believe\nWe should be from the New England truck solutions to the news I mean I Am six thirty WPRI accumulation [noise]\nPittsburgh massacre mid term elections in ... the gunman behind the deadly shooting rampage at the Pittsburgh tend to God heads to court tomorrow as investigators study is background\nAuthorities have search the apartment to forty six year old suspect Robert Bowers and are combing through his car and social media and hope to find surveillance video as they investigate the killings in this tight knit Jewish community this is us attorney Scott Brady\nDuring the course of his deadly assault on the people the synagogue Bowers made statements regarding genocide and his desire to kill Jewish people\nAuthorities say the eleven people who were killed ranged in age from fifty four to Ninety seven that included a husband and wife in their eighties and two brothers ... Pittsburgh\nBecame mid term elections are a little over a week away house Speaker Paul Ryan town CBS his face the nation that the jail he must share the blame for the bitter political rhetoric\nConservatives we always thought this was sort of a left wing Lenski thing unfortunately the rights practices identity politics now as well\nWas like in his southern Rhode Island's from your luxury dealer featuring Lincoln's explicit land of Lincoln and Casey Lincoln Lincoln him Casey and the all new twenty Eighteen Lincoln Navigator what Lincoln of Narragansett unparalleled luxury impeccable surface\nFunctionally working and I think we as leaders we got to figure out how do we make inclusive aspirational politics strategically valuable again\nCalifornia officials are warning of possible fled danger over seven million Californians face potential flooding this winter in areas hit hard by this year's wildfires authorities say people who live near foot hill and down slope neighborhoods are at the greatest risk round can't absorb the water which picks up ash topsoil and debris\nLast December a mudslide in Santa Barbara county killed twenty three people after the massive Thomas Fire Dave out for Los Angeles\nTimes of the storm Oscar as forward in the Atlantic and his eight hundred miles east of Bermuda Oscar as the fifteenth name storm of the twenty Eighteen hurricane season I mean ... [noise]\nMessaging to raise ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more text forward\nTo seven nine six four or five\nThat's S. O. R. W. A. R. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs on line text forward\nTo seven nine six four or five\nThat's that's a large W. A. R. D. to seven nine six four or five\nAnd self driving cars hit the road their program also have to make some life and death decisions\nHere's the question you see a trolley heading toward five people on the tracks who will die if the trolley follows its natural course but if you pull the switch to send it to a side track that will kill one person and you'll save all five so what do you do\nWell these are the human decisions at self driving cars must be programmed to face and a massive global MIT study of ethical dilemmas found some geographical differences Asian and some other eastern countries were less inclined to favor sparing young people over the elderly\nBut southern countries favored the young over the old virtually all countries believe the lives of people were more important than animals live I'm Evan hanging\nIn the Boston Red Sox now have a three games to one lead over the Los Angeles Dodgers the Sox beat the Dodgers Ninety six in game for the twenty Eighteen World Series I may and Kate's [noise]\nMessage in data rates may apply earning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that\nDegree in his little less sixteen months one hundred percent on line\nTo find out more text forward\nTo seven nine six four or five\nThat's S. O. R. W. A. R. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online tax forward\nTo seven nine six four or five\nThat's that's a large W. A. R. D. to seven nine six four\nOr five boys of all the New England W. P. R. O. N. quest show last soccer with me here on the ground show on WNPR oh\nI ... I haven't even money gambling five guys and the reality is when you're for or against the truth that is not a refuge for making money not arrest you for being right more often than not they're going to be spread more when they're going to win [noise]\nSports with the question to nine pm until you are\nFollowing program has been paid for by Massey an associate it is for entertainment and basic informational purposes only and it's only responsible for its combat it does not reflect the views of cumulus media W. P. R. O. S. management or staff\nThis is Mandy on money help pleased to have you with us today I make another attack and enjoying as I Am age we find yes\nWas like in his southern Rhode Island for a mere luxury dealer featuring Lincoln's explicit letter of Lincoln and Casey Lincoln Lincoln MTV and the all new twenty Eighteen Lincoln Navigator for Lincoln if there were against it unparalleled luxury impeccable surface\nYou called today here's the phone number four zero one three three three eight thousand now you're the kind of person who welcomes the little chaos and your financial life maybe you favor those Mannix the wings are one extreme to the other and you don't mind that occasional roller\nCoaster ride with your assets while you're probably really enjoyed a certain two week period back in February and earlier this month here in October that wind volatility came back with a stomach turning vengeance in the stock market\nAnd a lot of people were anxious about that especially if they neared retirement and with this increase volatility there does come this sense of financial vulnerability sometimes especially if you are getting close to that retirement finish line\nBut today jet we're going to provide our listeners with an antidote to those feelings of anxiety and vulnerability and we're going to talk about the wild market swings and what we can do to gain some more confidence we're going to turn to some fundamentals and you're going to give us Jeff perspective\nOn the recent market volatility\nOr short you know when you're talking about stock market volatility you know little context is important first let's define volatility\nIt's basically rapid unpredictable and significant movement in the value of an equity such as a particular share a company stock or if it's the entire equity market you know the stock market is people refer to it\nYou know in technical terms for the mathematicians that might be listening it's a measure called standard deviation now that in simple terms mean how much is going to move up or down from what you expected to be let's try to make things as simple as you\nKnow again I forgot to in some of the stuff not easy to make simple let's face it\nUm for contacts let's look back at twenty Seventeen one of the strongest performing years for the market in recent history you know we saw steady sometimes spectacular bull market we also saw one of the least of our two years on record so the stock market according to key index measurements\nOf twenty Seventeen was the first year since Nineteen Ninety five without a three percent decline in the U.S and the five hundred\nThinking about that since Nineteen Ninety five you know and that is some tea tends to move a lot more than that\nThe highest was two point eight percent in in change now historically there have been three or four pole blacks and the pull back is to find is five percent a corrections ten and beer market is twenty percent\nSo when you look at it there's generally been three or four pull back so five percent or more every single year as typically as well as one ten percent or more correction\nSo you know when you look at it we went through a long period of time where we didn't have that and then all of a sudden it came back you know so sure enough\nHis repeated itself in February and again earlier this month you know bringing the sense of complacency that often accompanies a bull market to an abrupt them for a lot of people\nToday with the F word talking financial fundamental back and help those of us who are nearing retirement or already retired get off the roller coaster and worry less about wild fluctuations in the value of our assets now the first fundamental is asset diversification suggest what's your next recommendation\nWell this next one actually also related to asset allocation in diversification heading into retirement it's important not only to maintain a strong cash reserves\nBut to be prepared to use it when the situation weren't no flexibility is key and managing your assets in your income sources for your retirement years a cash reserve provides options as to how and when you draw your retirement income\nYou know let's say the value of the investment portfolio from which you're drawing all of a sudden drop substantially\nWell that's a time when instead of drawing from that depleted value account\nPerhaps you can draw from the bank and said that\nJust one of those options so rather than selling last stock or some other assets to generate that income\nYou know it just like All right let me leave that alone for now and let's go into our more protective places that didn't lose out and will drop from them which again goes back to our philosophy of splitting assets typically in the fifty fifty mood so that\nHow would you like motor trends twenty Eighteen truck of the here for only one I mean I Will say hello to forge twenty eight Ford F. one fifty so desperate for the best price anywhere just one hundred and Ninety nine dollars for only a point forward in eastern edge or never gave it\nDirectly into the stock market\nSo that gives us a balance and we can show that it absolutely reduces your level of risk on the entirety of your portfolio and we use a specialized software that gauges risking your current portfolio that will analyze for you when you call in\nBut we also use that when we prepare to build a new portfolio for you if that's appropriate for us to do for you\nTo the size of this cash reserve what do you recommend that we should have in this reserve and where do we keep the money\nYou know that number can really be all over the place I'm at a recent summer I shared where I've met with some people that had a boatload of money in the ... almost a half a million dollars and they only had five thousand dollars in the bank\nFor for emergencies and I'm like well you know why is that solo did you just recently spend a lot of it and I said no that's we figure that's enough for us I said well what if you have an emergency they really need a a chunk of money but we'll take it from a four O. one K.\nAnd I'm like shaking my head going wow that is not a good plan\nIt is important to have emergency money to me it's that's kind of part of your foundation so that you have a certain amount that you know is absolutely there for you or another term than I use this as one of my other high highly technical terms that I think you'll like Meghan it's called pillow money\n[laughter] about money do I sat in my pillow you\nKnow it's just that when you're ahead it's the pillow at night you're comfortable and confident because you have X dollars\nSaid okay let's take nickel [laughter]\nSo you know and I I've been calling it that literally for decades you know and everybody's pillows sizes different ... somebody recently sold the business they had over a million in the bank\nThat's way too much so I talked about the pillow money and I said so what would be your pillow number and they said well probably half a million I said okay I think that's a little high but if that's what it takes you to sleep well at night that you know you've got a half a million in the bank\nFine just understand that you will probably be losing money on that half a million because the lower rates of return\nAnd it's taxable and you have inflation and when you factor all that together even though you might be making two and a half percent after taxes and inflation at best you're eating\nSo you've got zero growth going on there\nSo it might be a little much but that's their number and if that's their numbers and we worked with the balance of the portfolio and structured as we feel is appropriate and then we kind of walk them through this is what we're going to do with your portfolio and this is why this is why we put some protective positions this is why we want some in the market like cetera\nAnd then we just kind of work it in so that we can help them you know achieve their vision in their goals for their future in their retirement years\nSo that commonsense approach to your emergency money and your investments and retirement income sounds appealing to you\nIf you've saved two hundred thousand or more of your retirement the number here it massing associate thing is for one three three three eight thousand remember we are a local firm started the company right here born and raised in Rhode Island and my mom still lives in the house I was born in which is pretty awesome that doesn't happen all that often\nSo you're not dialing a one eight hundred who knows where you calling somebody from out of state\nYou dealing with local advisors right here that kind of know Rhode Island no kind of our mindset 'cause we might think a little differently than others and that number again is for one three three three a thousand we look forward to your call\nHad that terrific website for you to check out if you want to head over to nasty and money dot com you'll learn more about Jeff and his team mass he has battled N. A. S. S. E. Y. diversifying our assets jak told us about that keeping a cash reserves to great fundamentals\nYou help us whether the volatility storm and now that we had the\nFundamentals that go hand in hand you have anything else we can learn\nWhile there's tons but you know we are limited to an hour [laughter] shut everybody [laughter] you know it and yeah the next fundamental has to do a psychology and our mindset\nYou know maintaining focus on the long term investment goals in the big picture\nIs important because that will help keep your market behavior whether that's positive or negative in perspective and hopefully help you resist the urge to make those knee jerk reactions about your assets that don't support your long term goal\nWhat their Chevy GMC Honda daycare Toyota and super all have in common they are all in for Steve free own condition at Fort Fort and he's written a generic ... that's right over two hundred for your own cars all makes all models and incredible prices are going to flood Otto John job now\nA knee jerk decisions that's not a good idea reminding yourself of your long term retirement strategy and goals and the fact\nThat retirement could last Fifteen twenty twenty five or more years you know helps you remain clear headed in the face of volatility now recently the prominence journal had an article where they were recognizing the woman here in Rhode Island that was a hundred and ten years old we are living longer there's no doubt about that\nIn the city of east granted it's just recognize one of their residents in town who is a hundred and one\nYou know so we are absolutely living longer so you need to keep the long term perspective in place so that you're not scared when when there's some volatility and the other part of that if you are that\nTouchy with the volatility of the market that would lend me to say that you may be to expose and perhaps you have too much of your money in the market\nSo that's a real good reason why you should call three three three thousand\nHave us analyze your current portfolio for you we do it on a complementary basis so it's not going to cost you anything and you will get an absolute mind full of information about your current holdings as well as your level of risk\nAs measured by a particular software called risk alive so I don't know but here again for a one three three three eight thousand if you save two hundred thousand or more we'd be happy to meet with you and take you through a process\nThat's four zero one three three three a path and if you'd like more information to start working with cat on your retirement your chair yet let me ask you what types of panic during the ... the uh typically the when volatility high in the stock market\n[noise] well I think he kind of stems from the the mindset that some people have that they have to check their balances in the stock market every day every week you know and they get consumed with what's going on in the market and that tends to raise your level of anxiety\nSo I think that's that's not a good thing and if you're there checking your your suffer every day you know it's almost like [laughter]\nYou know you know people that have it any type of an addiction and and I don't mean to make light of this we have an addiction it's like you can't stop yourself\nWell there are some folks that are addicted to checking their their market account every day and I think that's counterproductive and for most people that is not a healthy thing to do because the market you have to understand will go up and down\nAnd they could do both every day\nSo why kind of wrap yourself into that every day kind of thinking when you can hire a professional that's going to handle that for you and then you can just enjoy your retirement years because that's what we try to do for our listeners we set up their their program their portfolio\nIn a manner where there is a level of assets that can't go down if the stock market does and then we have some that is invested in the market that does go up or down based on what's going on in the market however were not investing that part of it\nOr in a very aggressive manner we tend to skew on the conservative or conservative moderate scale but when we take that in context with the other position that you can't lose we lower the overall risk of your portfolio to a very low number and we'll show you that\nSo if you save two hundred thousand or more fuel retirement aren't local number of years for one three three three eight thousand one of our advisors will sit with you get a sense of what your vision is for your retirement that goes you want to achieve and then we'll look at the uh current holdings that you have\nSo in our opinion we believe that fix the new these can fit in that space and there are two different general categories\nThere are some that are really built just for um the protective side if you will where they can't go down at the stock market goes down\nUm and they're good for accumulation and then you can just withdraw as you feel you need to\nAnd then within certain restrictions I might add because with the ... one of the downsides\nIs that you generally are only allowed a percentage that you can withdraw each year now most of the plans are ten percent that you can take out each year\nSome of them are at seven percent of very small number restricted to a five percent withdrawal now in the context of a of an overall plan none of those are problematic because the other half of your portfolio is ...\nFlood Lincoln is southern Rhode Island for a mere luxury dealer featuring Lincoln's explicit ladder of Lincoln and Casey Lincoln Lincoln MTV and the all new twenty Eighteen Lincoln Navigator for Lincoln of Narragansett unparalleled luxury impeccable surface\nInput and get the money put into your account so it's very simple but a fix annuity or can be a very good way either for accumulation or the other category is for guaranteed retirement income and we do a fair amount of that type of planning\nBecause many of her clients and it seems more so our our lady listeners are concerned about making sure that they get that income for the rest of their life and what what I hear most is I I don't want to become a bag lady when I get older [laughter]\nAnd you know I kind of laugh but it's a very serious thought that they have they're very they're that concerned about ensuring that they have an income that they can rely on for the rest of their life\nSo that's the type of planning you would like to take advantage of our number here messing associates his four oh one three three three eight thousand if you save two hundred thousand or more of your retirement we look forward to your call\nNature you check out ... ... and money dot com for more information Massey founder and a S. S. E. Y. as a non volatile source have guaranteed income for retirement we do know\nThat ... can be a viable option for some of that's just the type in the new what he's going to allow us to avoid volatility\nWell if avoiding volatility and guaranteeing income other goals then we're talking about fixing it would eases my preference I'm not a big fan of variable annuities because they tend to be a little on the expensive side\nNow the fix to notice coming different varieties you know there's the immediate annuities you know you pay single premium they stop paying you the next month and they'll pay you for whatever term or you have chosen whether it's five years ten years the rest of your life et cetera\nOther types of annuities begin payments at some point in the future and those are just called deferred in coming days so one of my favorite times\nIs an income annuity that is structured so that we do a single transfer into the into Haiti and it accumulates and a preset\nPercentage now this is by contract as an example um there are many different companies out there so let me just pick a number so let's say it's six and a half percent and that's your roll up number\nAnd that's just a number I'm just picking for an example it's not any particular product because actually are products of better than that but let's just use six and a half\nEvery year that you defer the six and a half percent will be added to your income account value\nNow you will still be tracking the market\nAnd if the market goes down you earn zero but at the market goes up you share and some of that growth now what's important to understand what those particular types of programs they're not geared for you to make a lot of money more the value is in that rolling up income account\nBecause that will increase in this example at six and a half percent every year so if you have a ten year period that you can differ well it'll go up six and a half percent compounding for ten years\nNow if you need it in two or three years you can also take it in two or three years you'll only get six and a half percent for two or three years and then you turn on your income from that account\nThere are really a wonderful type of program and the base product that they're on there was a report out by a professor from jail a Roger if it's something that clearly says these fixed index base the new disease should be seriously considered\nAs you look to where you should put your money compared to putting your money into bonds as we move forward and the basic premise of that is because we're in a rising interest rate environment and as a as\nInterest rates continue to rise bond holdings are going to have more downward pressure on their pricing so you're you're likely going to earn more with a fix an expat so new to you than you are in a bond moving forward because of this rising interest rate environment\nNow that's not my opinion that was if it's in summary if you will based on researching the market for Ninety year period and that's what they came up within their report that came out in January twenty Eighteen\nSo if what we have been speaking about today diversification structuring your income cetera if that sounds appealing to you I'm number of years for a one three three three eight thousand\nGive us a call if you've saved two hundred thousand more fuel retirement we'll have you with one of our advisors will first see what your vision is and your goals will gather your statements do a deep analysis come back and report that to you in a very simple manner so that if\nWhat auto group wants your car any make any model what pays more than anything or around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\nTo understand so if you'd like to take advantage of our offer and go through our complimentary process our number of years for one three three three eight thousand we look forward to your call\nTo get off the stock market roller coaster rides to the fundamentals Jeff ... says another financial fundamental to help protect you and your accent from volatility that's now\n[noise] [noise]\nIt used to be easy to create a retirement strategy worked forty years saved money live off that money for a few years during retirement things have changed for many retirees reliable income is harder to come by we're living longer than ever\nSo that chunk of retirement money now needs to lash still eighty five\nNinety who knows maybe even a hundred\nDon't be alone called Massey and associates a messy and associates and offers no obligation retirement income strategy sessions Justine will begin to your unique situation at if possible designed a custom strategy don't generate the supplemental retirement income you mean\nCalled Massey and associates gang right now to schedule your retirement income strategy session\nFor one three three three eight thousand that's four oh one three three three eight thousand investment advisory services offered only by duly registered individuals' through eighty wealth management Elsie [noise]\nThey just nasty on money I make an attack alongside jab ... his phone number four zero one three three three eight thousand glad you're spending some time with us today well volatility unpredictable things in the stock market it's here and the\nFact of life but it doesn't have to really are like gets been walking us through a theory that financial fundamental to limit falling or ability to the ups and downs of the stock market fell what that next fundamental that we should know jet\nWell this one is as fundamental as they get have a strategy for retirement and stick to it\nYou know we spoke earlier about avoiding panic driven money in investing decisions by keeping the big picture in mind you know what is your vision what are your goals your timeframe make cetera\nYou know an actual formal both on our retirement strategy basically is the body meant of the big picture this is a plan that connects your assets two goals for retirement and includes strategies for growing and protecting those assets\nAs well as meeting your goals and usually includes specific steps to take and specific products to use as well so that we accomplish as many of those goals as we can now obviously\nWe try to help you achieve all of your goals but there are some times where there might be one of those goals where we might not be able to hit a hundred percent I mean you have to be realistic with what with what can be done\nSo it's important to just be realistic but the goals I mean shoot for the moon of course with your goals but\nThen we'll see what is based in reality and what like might not be and then we have to be very honest with each other about okay look we really think we can do this this and this but this one might be a stretch\nAnd if we're clear and truthful up front then hopefully our listeners are going to say yeah well I you know I see I understand what you're saying based on the map\nThe key words here are specifics and strategy it's a strategy and then it should pull a lot of different parts into a coherent coordinated\nFull pi if where you will or a full puzzle\nAnd it's also all the different ways that all those moving parts will work together and they can we do that and our goal is always to do that in a simple manner so that you when you leave here you're not driving down you know getting back home going\nDid you understand what he said I'm not sure that I understood what he said either well that's not helping anybody so we want to keep it\nTo the point where on the way home you're talking about wow that was really easy to understand I finally get it now and now I think I have a clearer picture as to where we're going to go with our plant that's what we're shooting for", "show_name": "The Matt Allen Show", "year": "2018", "city": "Wakefield-Peacedale", "day": "28"}