{"month": "10", "state": "RI", "station": "WEAN", "content": "What their Chevy GMC Honda daycare Toyota and Subaru all have in common they are all in for Steve free own condition at what forward and he's written a generic as if that's right over two hundred three on cars all make all models and incredible prices are going to flood Otto John job now\n\n\n[noise] from Illinois I'm brushing studio away from the general election dog nine seven AM next door to me are\nElection central I'm quarters [noise]\nFrom the revolution solved wash news center this is the W. P. R. O. news at twelve o'clock\nBlown Douglas ... breaking news from Pittsburgh at this hour police reporting a suspect is in custody after a shooting that has caused at least four deaths\nAt least twelve people shot at a Pittsburgh synagogues all happening less than two hours ago three police officers also been shot\nThis happened at the tree of life synagogue in Pittsburgh squirrel hill neighborhood about ten minutes from downtown Pittsburgh squirrel hill is the hub of that city's Jewish community the president of the local Jewish Federation just commented on the shooting\nMy heart goes out to all these families um the should not be happening at\nPeriod it should not be happening in a synagogue it should not be happening in our neighborhood here and scroll\nHill there were three services being held at the time of this morning shooting at that Pittsburgh synagogue but they have taken someone into custody but there are multiple deaths there and even more people have been shot were for a stormy Saturday in southern New England here the rain that will be measured in inches in some places\nThe nor'easter will be out of here by about dinnertime WPRI accuweather meteorologist Steve ... says that most will get some street flooding and pounding on the roads but\nThe winds are expected to be a problem especially the closer you get to the coast\nThe winds are going to be quite strong especially late this morning and in the afternoon wind gusts around forty five miles per hour and most spots but along the coast can see some guts to fifty even sixty miles per hour for a time when like that could be so much trees that come down and some power lines surely will be possible as well\nNational grid told us yesterday that they had moved additional cruise into the area to uh take care of any power outages as they occur but nothing widespread across the national grid service area in Rhode Island and Massachusetts as we speak\nAfter a seven hour and twenty minute gained the Los Angeles Dodgers acted a bit like they had won the whole World Series but they'd only just won the third game it was a sweet ending for Dodger infielder max monkey he hit the whole run that put an end to the longest game in World Series history\nWhat do you go through a game like that discouraging on both sides and so just be able to come out on top of that regardless of what the you know [noise]\nThe standings worked for the series that's a huge win for us\nAnd the next game is tonight we get another one against Sunday of the red Sox are up to games though in the series even with the Dodgers win last night\nFederal officials are looking to everything that Caesar salad like has been doing leading up to his arrest on friday he's the guy accused of sending more than a dozen mail bombs to those who do not ... those who are critics of President Trump's mainly\nDemocratic a democratic politicians and other known Democrats around the country corresponded drew Griffin reports that the fifty six year old has a criminal history that goes back to the Nineteen nineties\nA couple of things stand out two thousand to\nThe power company is threatening to turn off his power he\nThreatened them with a bomb charged with threatened to discharge destructive device apparently made some sort of threat that he was going to blow up the power company much bigger\nThan nine eleven in two thousand for another crisis in his life he was arrested for steroids possession [noise] we now know that there was some kind of intervention trying to be taken place by his family\nThat involve drugs at that time and in two thousand twelve of bankruptcy that appears to be the time when he started distancing himself from his family and becoming somewhat estranged\nFederal federal officials are hoping that there are no more bombs allegedly made by this man from Florida still moving through the mail utility company involved in a series of natural gas explosions and fires in three Massachusetts communities last month says it will not me\nHow would you like motor treads twenty Eighteen truck of the year for only one I mean I Will say hello to port boards twenty teens Ford F. one fifty the best for the best price anywhere just one hundred and Ninety nine dollars per month only a plug for it and he joined there were against it\nOver north Andover in Lawrence between December second in December sixteenth officials say they do expect though that have most people on line with their natural gas in hot water again before that but there could be some chili nights in the ... valley before everybody service is restored\nComing up WPRI sports [noise]\nWeather and all the way next more of the John lawful and show W. P. our own use time has trouble for [noise]\n\n... read automobile museum presents drunk or treat Sunday October twenty eight\nFour to seven at Fort Adams and move toward bring the family and your sweet ride to our dreams trunk or treat dressing your best Halloween costume show up your car and bring some candy for the trunk or treaters details that bar drain auto museum dot org [noise]\nRain date Monday October twenty nights you their\nRent cover band baby paid\nWith money and navigating credit union it's not easy but then we have money quickly and securely on line or right from your member of the night now wearing new to exchange account numbers to use the money I can learn more about\n... navigating venue dot org not again kind of ... federally insured by and the way my money in our lifetime serving but evacuate if you're setting financial institution terms and conditions may apply\nIf you've been putting off getting at here restoration listen up this is what you've been waiting for Easter final hair restoration centers individual grab technique or I G G is a highly advanced scot free procedure that moves your own hair one follow go at a time without the use of ... giving you a denser a more natural look\nNice to find O'Hare restoration center is the only practice in New England that performs this unique I. G. G. procedure in fact doctors fly in from around the world to observe their techniques call now for your free I. G. G. consultation financing is available with payments as low as one hundred Nineteen dollars a month\nI G G is suitable for all hair styles it's less invasive with no ... no pain and no visible scarring so you can be back to work the next day plus it's affordable on just about any budget\nCall one eight hundred eight nine eight hair to learn more beds one eight hundred eight nine eight hair call one eight hundred eight nine eight hair or visit check yet I G G dot com for details\nWPRI sports Red Sox as we mentioned lose game three of the world series to the Dodgers three to do the play again tonight at eight o'clock hour time Celtics in Detroit for seven o'clock game Bruins hosted Canadians seven\nUm Providence ruins or in Springfield tonight to the patriots takes Sunday off but we'll play Monday Night in Buffalo against the bills that eight Fifteen kickoff can be hurt your news talk Ninety nine seven at ... am six thirty W. P. R. O.\n[noise] from the sea scape Christmas decor weather center here's meteorologist carries when the camera with our exclusive accuweather forecasts\nSo Doug there is a flash flood watch in effect and rain will be heavy at times before tapers off later this afternoon windows to forty fifty miles an hour to down trees and power lines ... fifty for\nA ... hour later on tonight low forty eight variable clouds for tomorrow with the highest fifty nine degrees but W heroes exclusive accuweather meteorologist Kerry when demand\nThat we've right now we've got to forty seven degrees at the weather station I'm Douglas at WNPR our news the John Hoffman show continues down WPRI news ...\nJohn love one show\nMe while I witnessed is out and you know they go in there as a comparison\nBut what is a show about nothing I Wish I could get that excited about that as an army helicopter pilot he wants to understand the operational like the ... and ... and one example of one\nOf my own it but you know I\nMean I Love your one\nRight over here if you're a Republican you'd be maybe why you're getting\nMay give Democrats win again Democrats part is democratic\nLately well now we call that a two shot nobody like uh\nWhat's your Chevy GMC Honda and Hyundai key a Toyota and Subaru all have in common there are all in for Steve we own condition I bought bought any religion or against it that's right over two hundred three on cars all makes all\nModels had incredible prices are going to flood Otto John John now\nThere's some ... I Believe I think budget is like seven eight million dollars a year I Believe some of those ones that go out of the country right because ... ... type of humanitarian issues but I Want to be locally not locally ... I Want to focus on road ... who are suffering need help\nAnd you know so whatever those issues are the immunities that will also job very poor would outreach program to suffer\nThis secretary's day for whatever reason it's focused on new arrivals\n... legal ... wherever they may be they have people chasing\nA series on buses and having people standing registration for\nWhat about the Rhode Island is good to meet you in a race you who are disenfranchised what are we doing outreach Peruvian\nBecause those folks down you know like Harbin tree\nWest Philly I'm Josh where wherever the case may be hope valley ... I mean it's a half a million registered voters will not participating and that's what I told the students I think we're ... oh my God was five hundred students had worked for him and I I use the Ronald Reagan approach\nTrust and verify it involves your parents who go talk to you where are you going back to the voting system you know I mean because people would just encourage ... with the you know they give it take Washington or you know the Democratic party in Rhode Island ... at the double it\nCan make some kind of run out of time and and also I Want to find out how people find out more about your campaign and how can they contact you\nOkay well what do I said ... what ... what do I talk about Facebook I vote for five nights\nOr a knife to a headquarters direct direct we don't have the job we go directly to the people were going to pull a big upset\nOn this ... take my word for there's a lot more coming out this is who we are already like Delhi and that's the big ever what\nLarry ... you'd like to be your secretary's day you're listening to the gym often radio broadcast back with more after the\nSouthern New England we on TALK six or seven\nW. B. R. O. these these these unelectable Andy's on the radio off Saturday mornings at eleven AM he's John love the former congressional candidate retired army helicopter pilot here to take a look at politics pop culture twenty first century ...\nJohn Laughlin every Saturday Night live when I Am going to be on the voice of southern New England talk six thirty seven W. B. R. O. fall\nMeans harvest time and nowhere is the hardest tastier than at apple leaned orchard and green do your own apples and he teaches at apple land and try Rhode Island ... sunny and hot pick up a pie or kids especially base and some delicious jams or Japanese\nLand also have candy gourmet chocolate apples Vermont maple syrup even follow him decor land orchard open daily from eight to\nOne thirty five ... avenue in Greenville is it online or let them on the stack up a land orchard\nBy Tony ... is our rights Medicare open woman is you know through the ...\nNot sure if the changes to your parents when physicians come closer to a point of view and take advantage of free services time getting around don't worry we'll come to your closest ... ...\n... machine destroys R. I. dot com seniors choice and our independence nursing not affiliated or north by the center for Medicare and Medicaid sort of\nJay kale engineering design and it's all a carrier infinity system for your home or business today these scarier systems have the highest rebates in the market they are quite an energy efficient you could save over fifty percent on your energy bills just by having Jay kale replace that old clunker Jay kale engineering also specializes in to\nHow would you like motor trends twenty Eighteen truck of the year for only one I mean I Will say hello to forge twenty Eighteen Ford F. one fifty ... for the best price anywhere just one hundred and Ninety nine dollars per month only a flood forward and he went into it and they were against it\nYou can be done in a matter of hours as well as a duckling split systems called J.K out today for a free estimate there a factory authorized carrier and Abby and dealer for installations and service license in Rhode Island\nEn masse fans and improve national grid BP I installer plus financing is available Jay kale engineering your cooling heating and water purification experts\nI'm Tony ... is from Jay chaos engineering give us a call today at Fort whole won three five one Seventy six hundred\nYou work hard on your play hard and let's face it from time to\nPlay people around the world depend on tiger bone tiger bomb goes right the rate from\n... from Atlanta herbal ingredients have your mom promotion number one selling pain relieving lightning remedy weren't\nAvailable in outer banks and the convenience factor gel caps so whatever your age I lifestyle roaring\nWith tiger mom at work where it hurts the Arab League stores everywhere\nAs a small business owner you make every dollar county so what can you do with ten dollars go to this to print dot com today and you'll get five hundred high quality custom business cards for only nine Ninety nine that's less than two cents for cars\nCan add this brand your satisfaction is absolutely guaranteed it's never been easier to turn five hundred strangers to connections just visit this to print\nDot com and use promote code thirty eight thirty eight and check out that this to print dot com promo code three eight three eight\nAnd I have all my friends they had this is a perfect day by the way you know it's who you think about it if you want to do work on your car even if you have your own garage gonna bringing is going to be wet and repeating that you want to go to gear head or where you can put it up on the lipstick old towel dry things off before you start working on it\nOr in work in the comfort of a nice will lick lean spacious garage with every tool available all at your fingertips that's what gear head does\nIt it's if you do it yourself or uh in in this day and age more and more of us needs to be do it yourself as being especially breaks if you can change a tire you can do you break it's not that hard it really isn't you know in in ... to show you if you're if you're under ... Iran is a master mechanic who is the mastermind over there at your head\nOr but Sheryll really runs the joined she's seven three nine zero zero nine zero G can schedule your women seven three nine zero zero nine zero you know they they'll do everything for you if you want I mean the runs like I said I'm asking McCain if they've got this deal\nWhere if you pick up the parts you bring your car by their for Seventy bucks they'll put the uh the brakes parts on for you um are Seventy bucks and and you get the lifetime warranty if you buy me one of the big box stores and if you like me and you keep a car for a long time that's important because then you'll be able to know exactly\nWhat's going on with with your car that they've got every specialty tool you can possibly imagine they're open seven days a week in your head and they are located in two fifty open beach avenue in war really easy to find\nA right across from the U Haul places ... during the ... you go right across the street from there and your gear head gear head why automotive super center check them out [noise]\nBack to the John Laughlin show waste we'll glycerin vibe or a phone call John now at points where you W. P. R. O. or one eight hundred three two one WPRI row [noise]\nAnd we're back well forty six often with you I Want to give you a bill from Providence on the on the email wrote 'em or your poll I Would comma we'll vote phone\nUh I'm concerned about the effect of the clueless bought off major media such as the as a as usual pessimistic about the results\nAnd then it's kind of a side note he says you're playing of the Jefferson Airplane track during the break white rabbit reminds me of Marty bailing unfortunate reason death he was probably the principal creative force behind the ... airplane\nI was slightly amused to read that he was annoyed that grace slick understandably got most of the credit for the group's success resident rest in peace Marty so music fan and a a voter as well say you're not because you know all about this music stuff over their radios just let him\nThat's ... you got the politics I got the ... things get that kind of a so there's there's a link protected market on my little\nPaper here okay uh and so you know curious what your thoughts are on the election I think it's going to turn out if you buy anything has changed your mind in recent times let's grab Lynn in Warren linear you are on the John ... thanks for calling good to have you\nHad a car wreck at ... okay I had to go in and get an ad for a ballot because they're not going to be All right um\nI heard on the radio that today with a laugh but you can get one that's like a couple of weeks ago they walk in the town hall and say oh Iran at all\nHow would you like motor joins twenty gene truck to be here for only one Ninety nine per month we'll say hello to forge twenty a gene for that one fifty a best friend for the best price anywhere just one hundred and Ninety nine dollars per month only a blood forward and he joined ...\nAnd then okay I'll go [laughter] that's all right [laughter] I Know you've got to fill out a farm yup that's for the ... right but\nYou can you can do an emergency ballot you know let's say you just call the way on business and you just found out about it uh you know in the old days they used to make you prove it they would say are you going to be out of town to get an airplane ticket yeah and you have to show them the airplane ticket but now they don't even ask you there just okay I told them ...\nMatter of fact deadline I could have gone in and gotten in American\nAlright alright okay well how about a good mood you ... you don't mind my asking I perfectly direct mine oh but you're uses anonymous forum and [laughter] you could tell that fine okay how to put you down ... ... they're\nDo it well or really deserve our support\nAnd I want to introduce you to my friend Mike ... is the proprietor of ya Maria which is over in the ... section\nOf upgrades and tell us about ya Maria\nMaria right all of them like we are\nA lot of the year and a half now live there and knock on wood with doing well a good good following my customers are great I Love 'em all so hopefully we can keep on going\nExcellent excellent today would be a great day with the rain and they get out there to stop by ya Maria and get one of the things people may not realize about your business which I Love is you can get food to bring home warm up in the either the microwave or the conventional loving and have a delicious home cooked meal right at home tell us about some of the entrees you got\nYou know we have some of the tradition traditional ... dishes the prestige which was like I was on you know I'm ... I'm trying some new things I mean our daily stuff you know was on you big macaroni and cheese\nShepherd's pie was all going very well on people seem a lot of we switch our troops up daily um chicken noodle Greek egging lemon possible as rule which isn't Greek\nThat's all right they tell you without any at all you got to tell you the neighborhood so attractive\nBut I'm Down and when we take suggestions you know as if somebody's looking for something that we can do it will do it\nNow you know it might not be too early to think about it we haven't even had Halloween yet but Thanksgiving is going to be coming up right you can can you get the cookie trays the nice Greek pastries and\nYes yeah a lot of that work do you call up ahead or for the bigger orders I Would say yes but we're going to stop putting out a a big variety of cookies for the holidays and we're going to offer them either you know mixed or individual or trees how was however they want it\nAnd they should call it has to do for the for the ... how many people [noise] like twelve fourteen people yeah yeah somewhere around then yeah\nThat stuff happens this is that a home recipe to step peppers that is yes tell us about this stuff happened because they are out of this world that's mom's recipe you as much I can really say about it without giving out and they see that [laughter]\nThey are delicious and and also it's a great place ya ya Marie is on um on Christmas reading tonight veils um it's a great place to stop by for lunch because when you do sandwiches you're not you're not buying like the whole cuts that stop and shop\nYou know you're actually roasting beef and you've got the actual turkey breast and you have to slicing machines and they're all flights you can get a slice of the water and your sandwich which is their effect\nWill use in a ... as corn beef and Angus a strong army and we try to go with the top of the line and stuff which we what makes this such a big if that does it really does\nI mean that's literally keeps coming back you don't have the the cheesy cold cuts from the local supermarket you've got the actual thing and you actually roast the beep right now so it's not like it's you know pre packaged or anything like that we do our own and it's like every day or\nEvery day while so what time you start in the morning well I usually start around seven or eight [laughter] too bad no it's not too bad I Try to prep as much as I can the day before so I don't have to get there too early right right but um but everything's made in the morning and you've got to the uh the Greek favorites to tell us about some of the Greek papers the spinach pies [noise]\nUh ... it's called spinach instead of cheese wrap in the field though\nI'm a buckles off of ... of the ... places phenomenal\nIt really is not a family recipe as well yes and it's his grandmother still doing the cooking she does some of it yeah I Do some of it was passed on a lot of those recipes and\nWonder Chevy GMC Honda and Toyota and Subaru all have in common they are all in for free on condition that flood forward and he's written a generic ... that's right over two hundred free on cars all all models and incredible prices logged on to flood Otto John job now\nJeeze I've been cooking since I was eight years old really yeah the mom would get you in the kitchen in there and have your work and I would sit there and watch her and and then if I didn't like something the way she made it I might try to change it up a little bit we can get a little bit yeah you know got to stay with the times too 'cause people are more than the flavor now than they were back in the ...\nYou know they're looking for those odd flavors or different flavors and that's what you're going to get it ya Murray is now in in um you still do the wieners their member you do know we'll continue the way it was because of what was happening was people were coming in looking for the ... and they choose the table and they'd be like you know what forget sanctions on yeah [laughter]\nSo you know and because we pride ourselves on everything being fresh I was thrown away so much I said you know what this is not even worth it\nYeah yeah I'll make sense that makes sense I mean my my favorite story but I Am ... I went in there and I had an anchor and for stuff happens and I was going to bring stuff ... home and this was like every that guy's nightmare right for the woman in front of me talking last you've got that right [laughter] so my advice he was get there early well\nWe've been we've been bumping up because obviously with the weather change and everything's people's input hot stuff so I'm making more so that I Try not to run all I really don't like running out of hatred and people away yeah yeah so uh I've been trying to keep up with in so far knock on wood we've been\nBut literally I was waiting in line and the woman ahead of me like an after that you know maybe I'll take those lessons stuff happens is killing me [laughter] [noise]\nThe stuff happens it's just tremendous in the ... to the family that's actually my recipe really there is that is tremendous thank you and uh [noise] what can you give us any little secrets and now you what's in their\n... and still fresh ingredients or\nYou're not going to give up anything I Know [laughter]\nYou might have to order order [laughter] a little bit of this a little bit of that you know\nBut it is tremendous its ... made daily and it's out of this world that if you if you like it'd be partly to even if you don't just try it because it's one of the few places we can get a good ... that's rational made an absolutely delicious that what do you get coming up a ... now the ends of new entrees what do you get sick\nI mean we started doing chicken marsala I'm really we are showing steps now\nUm be stroganoff a ... I've been taking suggestions and trying them all and see how they go and write they seem to be going what do we tried to anything took off that you didn't think was gonna [noise] um no not really I mean it was once it's out there and it was just the look cells is also really does it does if\nYou've ever been the arguments exam and you've got to go there what's the address tonight fill in a sixteen Seventy four Cranston street sixteen Seventy four Cranston street if you haven't been you've got to go is what's gonna happen is you're going to see the steam table in the details like right next to the cash register area\nAnd no matter what you came in for you're going to find something in that scene table you're going to you know what that just looks too good I Need to get that and you can you can eat in a but a lot of people I guess like the bringing home for supper\nYeah a a store front of the little small so we have a couple of tables well um we have a lot of people that do either really yeah more so than I expected really ... um my original plan was to target take out you know people taking the home but now\nThey've kind of changed my mind on that and I was like I might have to look for a bigger place what are your hours are typically a ten thirty to eight Monday through Friday Saturday to five on Saturday and absolutely no Sundays no Sunday no Sunday [laughter] some days off I Need it\nYeah your I bet you do it the one week um I wanted to ask you about the lasagna because you make a Greek lasagna it's not like an Italian right what's the big difference between the Greek lasagna and the Italians on\nWell in the Italian resigning as you've got to go up ... you know cheaper cheeses the sausage Italian sauce I'm In the Greek was on you [noise]\nIt's um [noise] the noodles instead of the flat lasagna right on the ground beef that's seasoned with the Greek we knew what it is\nYou know that that one and I can give you the original and the cool you know but um and then it has a bishop ... sauce on top well now what is that that's all white cream sauce really yeah\nSo that has a little hints of not Megan it wow so it's definitely a totally different flavor right or is that it's actually one of my favorites and I grew up on that one and I love it wow\nThat's an old family recipe yeah excellent so you can you can get a tray of that to take home how would you warm enough when you get home\nThe oven or Lebanon or a ... if I had a big fan of the microwave yeah you know you could do it in a commercial of and I'm On the Greek was on your you'd probably have to do it uncovered three fifty right that you know depending on how big the PIN is with depend on how much\nBlood like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explains it light up of Lincoln M. K. C. Lincoln him getting actual linking him Casey and the all new twenty Eighteen Lincoln Navigator for Lincoln of Narragansett unparalleled luxury impeccable surface\nAnd maybe take a drug for dinner and have something really ... you know it's a ... memorable meal then you've got to go to ya Murray is because that's that's where you're going to get a lunch it you have a big big lunch grown we've been doing very well lunch really\nThat's all we have like I said we have a good following the locals so I'm no complaints at all and I got to say on all my cousin was a great as they really are I've had places where you know you get some people that are kind of a but not all my customs integrate\nTerrific yeah that's wonderful I Try to get to know everybody on the first name basis I tried disease or many of them sometimes it takes me a little bit about problem to have my [laughter] I'm at I mentioned GM doesn't have you know they don't know every one of their customers under debate\nBut that that's a nice thing about a neighborhood family Blake like ya Maria and you can go in there you can get what you want and you\nFeel like family you get to know that the crowd you and your lovely bride work there's oil there and now you may even catch a glimpse of grandma and the kitchen so yeah she's been leaving early so well you know how old is she know Seventy four Seventy four she's entitled to I mean I don't believe there\n\n\nIn in the shopping mad at\nThem from a brass\nOn the all time a new\nAd and daddy\nCan spray\nA gang on the\nLine from the New England truck solution studio they scan it was talking I mean I Am six thirty WPRI\nSucked station [noise]\nSpecial report deadly Pittsburgh shooting I suspect have surrendered after opening fire inside of Pittsburgh synagogue leaving multiple people rooted or dead correspond at ...\nAt least four people have died an additional three police officers were evidently injured and gunfire though their injuries the extent of their injuries or has not been made clear in jest yet President Trump says he is monitoring the situation it looks like the\nResults are coming in and they're far more devastating than anybody originally thought in the morning in the morning they\nWas the shooter but they had the shooter or they would but the results are very devastating using the numbers come in\nThe government has been taken to a Pittsburgh hospital plus the University of Pittsburgh Medical center system says it's treating multiple victims from the shooting but would not say how many and Pennsylvania governor Tom Wolfe state resources are being directed to local law enforcement officials in Pittsburgh I may and Kate's\nI suspect accused ascending fourteen pipe bombs to prominent Democrats faces a court hearing Monday afternoon correspond a judge on\nThe word has come from the FBI Director himself in the news conference yesterday saying we're not out of the woods yet or in other words the postal inspectors service the FBI others need to be vigilant\nIn case there are some other packages this is as you know a coast to coast investigation with packages found in New York California Delaware DC and right here in Florida as well\nThe remnants of hurricane Willa are battering the eastern seaboard today meteorologist Eric van dam\nGostin Nantucket over fifty miles per hour or the wind will quickly died down as we head into the day on Sunday in the store will be gone but not before creating quite a bit of rainfall for this area I Ninety five is going to be very tricky along the east coast today so this area is going to see some treacherous driving conditions\nSixteen million people are under coastal flood warnings I'm In ... [noise]\nI'm Nick ... a select quote agent with the true story that could save you hundreds of dollars a year\nA woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him\nWell I shopped the many highly rated term life insurance companies we represent and found re who was forty one and takes medication to control his cholesterol a ten year five hundred thousand dollar policy for ...\nHow would you like motor treads twenty gene truck of the year for only one I mean I Will say hello to forge twenty four to one fifty up front for the best price anywhere just one hundred and Ninety nine dollars per month only a point forward and he joined there were ...\nLife insurance you're probably paying too much\nFor your free quote cult eight hundred for four or five sixty three sixty three variants ate hungry for four or five sixty three sixty three eight hundred for four or five sixty three sixty three or go to soy quote dot com suits Nineteen eighty five we shop you save\nGet full details on the example policy of political ... commercials reports could vary depending on your health insurance company in other families not available\nAnd all the\nNew poll suggests Americans are in the mood to go and a gift buying spree for the holiday the Gallup Organization asked what will you spend on holiday gifts this year the answer quite a bit although maybe not quite as much as last year\nThe government estimates consumers in stores an online spent nearly four percent more last year than they\nHad in November and December of the previous year this year the pollsters say American adults will shell out an average of eight hundred eighty five dollars on gifts\nJust shy of the nine hundred six dollar average from last year but otherwise more than any other holiday projection since the recession I'm Jan Johnson and museum and America's\nHeartland honors the unifying experiences of US military veterans the grand opening of the fifty three thousand square foot eighty two million dollar national veterans museum and memorial it's getting underway in downtown Columbus ohio I'm In tapes\nYou work hard and you play hard and let's face it from time to hurt that play people around the world depend on tiger bone tiger bomb goes right to your aches and pains\nMe from a blend of herbal ingredients tiger mom in the nation's number one selling pain relieving light and a rabbit in at work and ... and a convenient to gel patch so whatever your age our lifestyle roar\nWith tiger mom it works where it hurt they were blitz doors everywhere\nAs a small business owner you make every dollar count so what can you do with ten dollars go to this is a print dot com today and you'll get five hundred high quality custom business cards for only nine Ninety nine that's less than two cents for cars\nAnd at this point it's pure satisfaction is absolutely guaranteed so it's never been easier to turn five hundred strangers to connection just visit vista print\nDot com and use promote code thirty eight thirty eight and check out that this to print dot com promote code three eight three\nFrom the sea skates Christmas Day cold weather center here's your exclusive your weather forecast truly and\nTurning out ... developing ... thirty seven very windy with rain heavy at times to bar that can lead to flooding winds can be strong enough to cause damage flipped over right address tomorrow night with W Pete Rose exclusive accuweather ...\nAccuweather on the voice of southern New England news talk and I do not have enough him and I am six thirty WPRI [noise]\nTacos burritos too for the hungry as\nThe taco shop and Harris bill has what youre craving if you're hungry for a way forward exciting take on south western and Mexican dishes in the auto jobs where you need to be everything is made to order and served in a casual family friendly atmosphere drove a taco jobs unique daily creations for lunch or dinner designing for take out the auto shop\nOn ... street and Merle bill ... job is all goes up on Facebook for good talking to his job our eyes dot com\nThe taco shop tacos in your mouth\nHi Stephanie on the air from seniors choice ...\nMedicare open enrollment ends December seventh seniors choice arrives here to walk you through the process will help you select the right Medicare health insurance plans and if you can't come to us we can come to you take advantage of our free services call us at four O. one for seven four\nEighty three six three online at ... dot com\nYou can join our own independent Jersey City not affiliated or north by the center for Medicare and Medicaid services\nLead Jay kale engineering design and it's all a carrier infinity system for your home or business today these scarier systems have the highest rebates in the market they are quite an energy efficient you could save over fifty percent on your energy bills just by having\nJay kale replace that old clunker Jay kale engineering also specializes in complete commercial rooftop systems from designed\nTo the duct work the insulation an service replacement so these units can be done in a matter of hours as well as the duck was what system called J.K out today for a free estimate there a factory authorized carrier and now being dealer for installations and service licensed in Rhode Island\nAnd mass ads and approved national grid BP I installer plus financing is available Jay kale engineering your cooling heating add water purification experts I'm Tony\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit light up of Lincoln M. K. C. Lincoln ... Lincoln him Casey and the all new twenty Eighteen Lincoln Navigator what Lincoln of Narragansett unparalleled luxury impeccable surface\nSix hundred ... ways that exactly Fifteen seconds will be on there you want to make it to show you listen to me [noise]\nLadies and gentlemen it's that time again time for a radio broadcast filled with intelligent talking when you rub on tape from the smartest radio host in the business don't call me stupid\nStupid would be you know some people\n[noise]\nThink he's a former politician and candidate for Congress 'cause I Love going to read\nBody complains about connotations everybody has a ...\nYou want to keep bringing James without ... you want freedom for me a former army helicopter pilot\nI Love snow in the morning\nTodd healthier habits that federal regulations\nFor third Roger Roger Starbuck director and\nNow he's on your radio to ask the tough questions where do you get jeeze\nThat's right now say mine\nI'm Mr reminds me\nMind by some raising a lot that we got a little Colorado radio because I Am are you all non white\nThem or you will learn permission to speak freelancer she was too I was telling [noise]\nMean I was three eight nine seven seven six eight hundred three two one W. B. Allen is now the broadcast from the beautiful city of east Providence where we happen to be right now Alan ...\nHawaii I'm good how are you ready and have to do with you and your yes indeed\nYeah and I just wanted to call in combat I Know it's a little off topic like uh I just want to register my absolute discussed with\nFat log in its goats furlough or when I was rolling his elected away or whatever ... patio purse or ... or ... or basketball because I really think\nThat I'll just left there was only ...\nCould take this rate\nAnd I think the numbers are bearing that out so you know I I that's the first point I just I mean I Can't believe what it was an opportunity that and I think that what a loss again or you could see where this has added another forty to forty two percent\nVote total for the governor or you know it's it's a it's unfortunate but you know jokes all L L it goes down I don't think ... out of it like\nA it doesn't look good doesn't like yeah what\nDoes it or it's just really really a matter of this not ... it's so distasteful did they decide but I mean by the way I mean ... what other personal peccadilloes they have with them or at least they have anti\nYeah I think in the case of Joe Joe is upset it down from for reasons that aren't abundantly clear ah I don't understand pad Morgan um I've known her for a long time about a lot of respect for her she was chairman of the republic Rhode Island Republican Party for crying out loud\nAnd she can't bring yourself to support the Republican candidate I mean I I think she's been duped by ... to be honest with\nYou I mean she she public said Johnny has several hours yeah yeah he would rescue support the winner of the Republican yeah\nWith all her and it is in like in my life in a liar and not worthy of belief than anything else that goes out of her mouth I'm Sorry\nYeah I mean and it's certainly that yeah\nAnd you know ... people that don't say a vote but all of that joke shrill oh isn't it ... to ... yeah and I could do the math and I'll tell you one to one it takes one out of their flocks boxer or tally well what what was the percentage teeny ... to ... yeah and that's ... that's ...\n... she had to call for three eight nine seven seven six eight hundred three two one WB arrow and you are listening to the John lumps in radio broadcast right here in the USOC six thirty in Ninety nine seven defend WB Ira we will be back with more after that\nWhat their Chevy GMC Honda daycare Toyota and Subaru all have in common they are all in for Steve free own condition at what for Denise religion Narragansett that's right over two hundred three on cars all makes all models at incredible prices are going to flood Otto John jobs now\nIn the news talk six thirty and Ninety nine seven have him W. B. R. O. along with WPRI twelve by\nWitness news presents newsmakers sending secularists we joined us Sunday nights as sick as White House ... interviews with southern new England's top politicians and other newsmakers then at six thirty joined host ten leasing as he showcases emerging businesses interviews business leaders and the owners and highlights local business drafts\nNewsmakers is six and the executive suite at six thirty Sunday nights on news talk six thirty that's Ninety nine seven W. B.\nR. oh\nLet me tell you about the code we sit in the code we sit in what you're doing for dinner tonight you're going to grab your lunch of ya Murray as well what are you doing for dinner why not head over to the coup we sit in one of their many fold bruise just a great time of year to go to the villages appetizers you know and one of the things that makes the place so special\nIs they put out the very best and seafood dishes including ... big seafood casserole casserole shrimp skippy and Italian meals including chicken veal parmesan eggplant parmesan all of them and if so course they're famous\nPrime rib dinner or surfing to her which is tremendous enjoy their fabulous luncheons they've got lunch and special starting just ten bucks during the football season you know which is now you get to watch the millionaires tight pants or you can come in and enjoy half\nPrice ... pizza and appetizers as well as wrap your special so that's terrific for watching the millionaires in tight pants if you're having a birthday shower or a bridal shower birthday party um give them a call eight to eight or seven to six that's eight to eight four Seventy six they've got a website can we use it in dot net\nDecrease it ended a proud sponsor of the brandy project now we've got to get these guys and to tell us a little bit more about this but it's a saving sheltered dog and support a great cause and it proceeds course new proceed\nOr go to the brand new project than a and that's what they're into his ... the shelter dogs I guess it's named after one of their dog named brandy\nThere at two twenty six weeks it avenue in West work that we sit in we're always treated like family\nI'm Nick ... a select quote agent with the true story that could save you hundreds of dollars a year\nA woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him well I shocked the many highly rated term life insurance companies we represent\nAnd found a re who was forty one and takes medication to control his cholesterol a ten year five hundred thousand dollar policy for under twenty seven dollars a month\nThat's almost twice the coverage for less than half of what he had paid if select quote hasn't shop for your life insurance you're probably paying too much\nFor your free quote cult eight hundred for four or five sixty three sixty three bands eight hundred for four or five sixty three sixty three eight hundred for four or five sixty three sixty three or go to select code dot com since Nineteen eighty five we shop you save\nGet full details on the example policy of political dot com slash commercials or price could vary depending on your health issue and company in other fact not available\nAnd often noted author former chief medical correspondent and salon policies are Dr Bob are not\nThe human body has billions of pain receptors block those receptors with the anesthetics found in salon ... plus and you'll have relief\nSalon ... plus contains two anesthetics including the maximum shrank lie to gain available that are prescription they numb aggravated nerves for effective lasting relief for relief try what I use salon ... plus in the silver box with a blue wave\nAudrey automobile museum presents trunk or treat Sunday October twenty eight\nFour to seven at Fort Adams in Newport bring the family and your sweet ride to our dreams trunk or treat dressing your best Halloween costume show up your car and bring some candy for the trunk or treaters details that Adrien auto museum dot org [noise]\nRain date Monday October twenty night you there\nYou'll be there on time if you go to find time watching jewelers because find time watching jewelers you can get your watch repaired so it works you'll be to the uh the car thing that was mounted card thing\nOn time because you watch where Richard socal is the owner he wants to tell you about all of the wonderful things that find time watching jewels or up to they've got a great selection of beautiful jewelry ... vintage in modern fine jewelry you got a wedding in your future you had to talk to find time watching ... it's a great place to find that beautiful diamond her wedding band\nOr if you get a dead battery and your watch no problem they can fix that they pop to back off they lean it they put in these new battery\nAnd you're you're up and running in no time and they restored and repair your watches injury as well and all the work is done right there\nLooking for a car credit not great well isn't it time you financed with blood was born in east British and they were against that have the best financed raising prices in cars with zero percent if your for Seventy two months you can be driving on a force also models interest free log onto what auto dot com\nOr and so if you look through your old draws and you find you've got a ton of old jury bring it to find time watching jewelers get paid for it top dollar time is now they're accepting all that the old unwanted golden jewelry\nNow they've been in business for almost Thirty years you can look them up on the Web it find time watch dot com where you can call the owners Richard socal seven three eight ten ten it's seven three eight ten than buying time watching ... come see Richard post wrote an app and our village bag only across from city hall tell them John ... century\n[noise]\nOf no like to look Sean Laughlin show voted Rhode Island's best radio talk show and look category of subtle days after eleven before to hosted by former politicians who are white haven't\nAnd the calm before the storm or into the storm now we get that nor'easter working on trying to find out what the what\nThe latest is on that is the wind in the rain pick up a little bit for three eight nine seven seven six eight hundred three two one WPRI what you\nKeep saying Easter I haven't seen one ... one in this\nNorth eastern or north north\nOf LA so many things in life confused me that's that is my mission and like to go in the radio and confuse you back a life [laughter] that's what I Do it you know have if you're just saying we're going to try 'em a pot roast and I uh well you know here's the thing I've I've never been a pot roast guy I'm I just don't care for my\nLovely bride makes a pot roast and and um you know we've been married a long time so she kind of knows that pot roast is probably not the way to go but I ran into somebody was telling me about this stuff called Mississippi pot roast now Mississippi is not known theoretically for his part rose but I guess it is and it involves you put ranch dressing sprinkled in there and\nAnd the butter and you put the whole thing in a crock pot and you plug it in you leave and you come back and it's that supposedly falls apart or the end it's supposedly very good um so we're fixing to find out the suit so he keeps making the Mississippi pot roast even as we speak\nUm I didn't know you know the Mississippi was known for its pot roast I you know I don't know what Mississippi ... what would Mississippi be known for other than having the really long name that you learn how to spell in third grade\nLet Jon is be your host no matter what you're celebrating done a figure that out give Andrew call she knows all about it two to eight six to nine nine that's due to eight six to nine nine\nYou know it's a terrific spot to go you're really gonna enjoy John his restaurant they're easy to find them they have a parking lot which you won't find at the the Italian restaurants on the hill\nYou gotta give your keys to some Eighteen year old kid the hot rod around the city in park it or you got to try and get one of those ridiculous pick up things and put it in the window you know what to do any of that John as they've got a big parking lot right at six fifty nine killing the street and Johnson now they are open Tuesday or Saturday at eleven thirty AM checkout John is\n[noise] and now back to the John Laughlin show employees except my apologies my whole life I don't know respect respect for money one called John now at points we ate W. P. R. O. for one eight hundred three two one W. P. R. O. that's fortunate the John ...\nShelly sponsored by navigate credit union helping business is like yours Gulf over one hundred years now serving Marianne from Eighteen branches for exact locations log on to navigate the U. dot org [noise]\nAnd we're back John Laughlin with you on the ... radio broadcast or where you can\nIn and be part of the show for three eight nine seven seven six eight hundreds reach you won W Paris fascinating you know some of the um the comments actually got on the Facebook I actually had someone comment that someone named drew from the Rhode Island Democrats texted her and called a book called her by name and asking her to vote for Gina\nAnd she wants to know how did you get my cell number and my name is not displayed publicly on social media or anything because they have research and when you have six million dollars you can buy a lot of research and\nOne of the things that you're going to find and I think it it could be pivotal in this election is that uh the ... campaign is going to have\nThe best get out the vote campaign that money can buy a first of all Democrats are always do it better than Republicans to begin with a they just do a and secondly ah her get out the vote campaign is going to be I watering the way it does work have you ever noticed when you walk into the polling place and you signed the little thing and you show your ID or whatever and they\nThey go John Law flooding and then they shout out your address well the reason they do that is there are people sit in a little tables that have the same voter lists and so when when I come in and they shut up my name they take a pen and they draw a line through that name on the voter list\nRhode Island's number one board dealer is setting the standard again and again flood board has over one hundred brand new Ford Escape for just one twenty nine from us that's right one twenty nine per month floods every color every option and everything you're looking for like ... dot com\nThat call all those voters and they'll say hey Bob Smith I noticed um you didn't get an opportunity to vote a wonder what's going on are you planning on going voting\nAnd you know you say well you know I was thinking about the going but I Can't can't get there because my car won't start the uh good get out the vote campaign will say oh don't worry about it we'll send somebody to come get ya and literally a ban will show up they'll pick you up and they'll be a nice hot cup of coffee and bring it over to the polling place to make sure that you vote for them\nUh and so that's part of the whole get out the um the get go camping because and that's a key that's pivotal to being able to to win a race like this especially races closely contested in\nAnd like I said going back to my time you know many years ago or in the town of Lincoln when I was working with the Democrats in the tunnel link it as a young lad uh they they back then they had a a solid get out the vote campaign that use they call it the bingo cyst I don't know why they called bingo but they do\nOr where they literally were able to keep track of who's voted who hasn't and and based on prior data they know who the voters are likely to vote for them and they go get them and they bring them to the polls\nTo make sure they vote 'em in the past you know there was always a legend there was some shenanigans that went on with voter id before a voter id\nAh in which they would vote in place of people who hadn't voted but that's that's the story for another day and another time\nAh but the Democrats do that well and it's costly it's expensive because obviously you can tell it's manpower intensive you got to have the people in the polling places they've got to be able to get that data\nUh they've got to communicate that back to headquarters in that somebody's going to be able to act on that data and that all takes it all takes time it takes money and so that got out the vote campaign is is pivotal or three eight nine seven seven six eight hundred three two one W. P. R. O.\nComing up next by the way be changing gender show is going to be hosted by hosted by a ... or ... is going to be hosting it on the changing gender show so old number thirty seven straight from thirty seven studios will be in here to ah to host the changing gender show coming up next a\nWhen we come back at the time it's time to review movies we have yet to see on the John Lawson show with none other than while you're humble those radios crystal Adams and professor David each day we'll be back with more after this\nSaturday's estimate of how jackpot is seven hundred and fifty million dollars ten dollars or more on a ... ticket to be part of the Powerball wrap\nThem details that are a lot dot com fall names harvest time no where is the hardest tastier than I Am a land orchard and green do\nYour own Apple's own speeches that apple and try Rhode Island's ... sunny and hot pick up a pie or tear this rebate and some delicious sand or Jack ... also have candy tour made chocolate apple Vermont maple syrup even follow him decor properly and orchard daily from eight to say\nOne thirty five ... in Greenville visit online or let them on the upper land orchard\nWhen it comes to your marketing and direct mail needs save yourself a headache go is if that signature printing signature offers an exceptionally easy and powerful multi touch marketing programs that enables you to leverage a combination of French male female and Internet from eastern track\nThe back of your message from design to very low printing too wide format for I think that you're here for you locally owned and family operate\nContact a signature experts at four O. one for three years twelve hundred for online eggs sickness refrigerators dot com\nI'm Nick ... a select quote agent with the true story that can save you hundreds of dollars a year\nA woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him\nWell I shocked the many highly rated term life insurance companies we represent and sound re who was forty one and takes medication to control his cholesterol a ten year five hundred thousand dollar policy for under twenty seven dollars a month\nThat's almost twice the coverage for less than half of what he had paid if select quota hasn't shop for your life insurance you're probably paying too much\nFor your free quote called eight hundred for four or five sixty three sixty three bands eight hundred for four or five sixty three sixty three eight hundred for four or five sixty three sixty three or go to select quote dot com since Nineteen eighty five we shop you save\nGet full details on the example policy it's local dot com slash commercials or price can vary depending on your health insurance company in other fact not available and on the pie I'm Dennis ... you know I probably don't over a million pitches in my career being a reliable quality performer has always been important to me when it comes to maintaining our home I look\nFor those same quality that's why it was a no brainer choosing garage headquarters for a new doors are curb appeal got a major league upgrade talk about increasing home value\nFestival is came with a reliable closer\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit light up of Lincoln and Casey Lincoln Lincoln him Casey and the all new twenty Eighteen Lincoln Navigator what Lincoln if there were against it unparalleled luxury impeccable surface\n[noise] Hi I'm Dennis Becker's way and you know some things in life are just built to last like my baseball careers lasted twenty four seasons in one of these new customers designed garage doors by garage headquarters their quality is life out there whether resistance is dominant and their best door price guarantee\nJust like where I threw my no hitter\nIf there was a hall of fame for garage doors garage headquarters would get my vote goes\n\nLike barbecue I Love barbeque I Love barbeque Carolina barbeque is a new entrant into Rhode Island you've got a check these guys out it's hard to get good barbecue in Rhode Island and you can get it at Carolina barbeque they're right on the reservoir avenue there twelve fifty five kind of across the street from Garden City a tip doing construction but you can still get in the parking lot just a little tricky\nBut it's not hard you just take that right if if you're coming from the north you take that right and you go right in the parking lot and you're at Carolina barbeque\nWhen you walk in the first thing you notice is the place the aroma\nOf that all that succulent barbecue is just going to blow you away and they're in the air it's it's in the air and it gets you taste buds ready ah and you're really gonna enjoy the fall of the bone ribs there are tremendous variety of chicken wings they've got they cook their brisket for twelve hours you won't find any Mississippi pot roast there you're going to get the good stuff\nUh everything the pulled pork the choice of fried grilled wings intend different styles sauces you know it's a great place again to watch the game with a cold beer mixed drink and enjoy some great\nBarbecue right here in Rhode Island tasty Carolina they're open every day\nAt eleven o'clock in the morning every day check them out at Carolina barbeque company dot com that's Carolina barbeque company dot com once again they're twelve fifty five o reservoir avenue a next next to tell us right there and right across the street from the Garden City as we like to call it and you haven't had barbecues you've tried the best Carolina barbeque\n[noise] know time's the charm Loveland movie review we want to get\nOn a movie out now I Know nothing about three mile wouldn't make any money as John reviews movies to see and tries to convince you to see them on a Bronx you my running canals post wrote in Warwick Remington elsewhere friends [noise]\nAnd of course this re reviewing movies we have yet to see a none other than radio crystal Adams your humble host why and professor David easily have you seen led foot car club now are you for\nVassar I'm a little bit early and a little bit around the edges yeah little voice\nI wanted to say publicly what a great brother you are you Ari or a credit your sister takes off on a holiday in Italy and you pay to paint her house for last\nYear on she's she's traits that around the whole where\nNow you know\n[noise]\nThe family [noise]\n\nWhen I came out\nLike\n[noise]\nWhat was\nFrom the New England trucks solutions to the news talking I mean I Am six thirty WPRI sucked cumulus station [noise]\nSpecial report deadly Pittsburgh shooting the FBI is investigating the deadly attack today inside a synagogue in Pittsburgh as a hate crime Pittsburgh public safety director window has threats\nAre are multiple fatalities there at least six centuries to include for police officers\nThe police officers injuries at this time or not life threatening the other individuals are critical and serious nature they were to take him to three or ... level one level two trauma center here in the city of Pittsburgh that being the Allegheny general UPN safe\nAnd U. P. M. C. U. U. P. M. C. plus B you the absolute mercy President Trump says the world is a violent play\nWhen you're over is it just sort of goes away but then it comes back in the form of a madman a a\nGo the suspect has been done\nWhat their Chevy GMC Honda daycare Toyota and Subaru all have in common they're all in for Steve free own condition at Fort any religion Narragansett that's right over two hundred three on cars all make all models and incredible prices are going to flood Otto John job now\nAround the synagogue I'm and Kate's that suspect\nAccused of mailing pipe bombs to prominent Democrats and critics of President Trump will appear in court in Miami Monday afternoon correspondent Joan Johnson parts Cesar ... that is run ins with the law before\nHas an extensive criminal history dating all the way back to the early Nineteen nineties including a two thousand two threat to blow up a utility company suffering a fate worse the nine eleven\nAnd Los Angeles Dodgers in the Boston Red Sox say south again tonight after battling it out for seven hours and twenty minutes in game three of the world series announcer Charlie Steiner the Dodgers radio network with the final moments\nGot back from the way\nThe red Sox lead the series two games to one I mean cakes [noise]\nI'm Nick ... is a liquid agent with the true story that could save you hundreds of dollars a year a woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him well I shocked the many highly rated term life insurance companies we represent\nAnd found a re who was forty one and takes medication to control his cholesterol a ten year five hundred thousand dollar policy for under twenty seven dollars a month that's almost twice the coverage for less than half of what he had paid if select quota hasn't shop for your life insurance you're probably paying too much for your free quote cult\nEight hundred for four or five sixty three sixty three bands eight hundred for four or five sixty three sixty three eight hundred for four or five sixty three sixty three or go to so I called dot com um since Nineteen\nEighty five we shot you save\nGet full details on the example policy it's local dot com slash commercials or price could vary depending on your health issue and company another family not available in on\nThe Titanic not the movie but the ship is getting a ...\nOf course ... after hitting an iceberg\nNineteen twelve Australian businessman and politician car bomber isn't trying to recreate back\nBut allegedly will have a new ship it as an identical copy of the lighter\nGigantic do with why grew to be outfitted with plenty of white votes and we'll have a welder about riveted whole post modern ... it will eventually make what was your favorite journey from South Hampton England to New York but the maiden voyage will be from Dubai to New York inspected in twenty twenty two are Joe Ramsey\nI ran aground day is ready to hit the road again and we'll begin a new world tour early next year gone day has announced that her forty two day concert series we'll kick off march Eighteenth in Albany New York\nIt's a first north American Tour for the singer after a terrorist bombing killed twenty two and injured more than five hundred during your performance at Manchester Arena in the u._k. and may twenty Seventeen and Cape [noise]\n... a select quote agent with the true story that can save you hundreds of dollars a year\nA woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him well I shocked the many highly rated term life insurance companies we represent\nAnd found re who was forty one and takes medication to control his cholesterol a ten year five hundred thousand dollar policy for under twenty seven dollars a month that's almost twice the coverage for less than half of what he had paid if select quote hasn't shot for your life insurance you're probably paying too much for your free quote called\nEight hundred for four or five sixty three sixty three bands eight hundred for four or five sixty three sixty three eight hundred for four or five sixty three sixty three or go to so I called dark um since Nineteen\nEighty five we shop you save\nGet full details on the example policy of political dot com slash commercials replace could vary depending on your health issue and company another family not available and often\nCease gave Christmas Day cold weather center here's your exclusive accuweather forecast\nRain tapering off not before it's heading a time when justice forty to fifty miles per hour down trees and power line five fifty for rain to bring to a shower late tonight and redo the clouds tomorrow we appear owes exclusive accuweather I'm Carrie ...\nAccuweather on the voice of southern New England news talk six thirty ten Ninety nine seven F. L. W. B. R. O.\n\nYou work hard and you play hard and led fateful times they hurt\nPeople around the world depend on tiger bone tiger bomb goes right to your aches and pains\nLooking for a car credit not great well isn't it time you financed with blood was born in east Greenwich and they were against that have the best financed raising prices in cars with zero percent NPR for Seventy two months you can be driving on a Ford's also models interest free log onto what auto dot com\nConvenient how could jump arms or whatever your age I'm ... our robot\nWith tiger mom at work where it hurt\nVulnerable stores everywhere\nIn the small business owner you make every dollar count so what can you do with ten dollars\nGo to this to print dot com today and you'll get five hundred high quality custom business cards for only nine Ninety nine that's less than two cents for cars and and this can print your satisfaction is absolutely guaranteed it's never been easier to turn five hundred strangers into connections just visit this to print dot\nCom and use promote code thirty eight thirty eight at checkout activists to print dot com primary code three eight three eight\nThe following program has been paid for by changing gears it is for entertainment and basic informational purposes only and it's only responsible for its combat it does not reflect the views of cumulus media W. P. R. O. S. management or staff\nHave time for changing gears a new six thirty ten Ninety nine seven and a half hour P R O U weekly look a trucking business and politics [noise]\nAre you ready for change area oh Mike Collins and Chris Maxwell\nOn line up\nAnd actually not to my colleagues and Chris Maxwell that's my extent house pinch hitting today for an changing gears\nAnd it is changing gears it is not changing genders as our\nPrior host Jon law when a want you to think I think Mike in Chris in their sponsors relate that very much so we shall not mentioned that again today crystal okay but we had a clear the air on now my extent healthier and changing gears Chris and make\nUh your regular hosts are down in Texas right now big old Texas I think\nI think they're in Austin right I think so I think they're an awesome Mike went up to San Antonio and actually talk with him this morning and went and visited the Alamo yesterday uh my wife and I had been there years ago\nGreat historical place uh it's not like a Disney Parks femur ... theme park or anything like that it's a big clay kind of stone building but great great history and\nAnd when you read all the accounts of what happened there so one area will will um\nWill ah well ... well I'm going to come back to Austin in just a second but I also got to clear up another thing from John ... the guy such a trouble maker you know I mean all off I mean he calls me thirty seven studios right now that you know anyone to why crystal do you know I called the thirty seven studios\nI Know there is a connection with the whole thirty eight studios the baseball team and is\nNow so so as you know I as for for those of you who don't know me I I run a public policy think tank of course we spoke out loudly against the thirty seven [laughter] see I got me saying against the thirty eight studios fang\nUh we've ... decided to pay the bonds we should've ... there were more obligation bonds we didn't have to pay and we shouldn't have being paid them but\nSo that so so I was outspoken on the whole thirty students issue will my number one I played for the red Sox were those or you don't know that and I used to sit the bench for the red Sox in Nineteen eighty six\nWas number thirty seven so he calls me thirty seven studio but but again we got to Laughlin the troublemaker this is not this is changing gears and I have nothing positive to do with thirty eight studios so yeah so we just have to get those things\nI Can't do this anymore but the state's taxing me in the kingdom ... I got a quick\nAnd they know that you know you show goes kind of emotional things on TV you get those twenty five thousand\nTruckers are actively campaigned for ... for this one guy and he he would over one I'm doing a ... I'm doing I'm I'm\nYou're already there I mean we got to take a break can you stay on the line to talk more on the other I loved that guy we're going to go on a break on changing gears makes those back with\n\nThe New England W. B. R. O. N. Gresham raw soccer with me\nHere on the ground showing WNPR oh I I Do\nRhode Island's number one board dealer is setting the standard again and again flood board has over one hundred brand new Ford Escape for just one twenty nine from us that's right one twenty nine Vermont flood has every color every option and everything you're looking for like flood autos\nFor good faith or is that is not a refuge for making money says not to arrest you for being right more often than not they're going to be spread more often that they're going to win\nSo much with the last six to nine pm until you are\nIf you're a small business and thinking of relocating\nNeed more space or just one better space check out west Davis ... comments inclined to that point\nFamily owned and operated the descent or brothers had units from five thousand up to twenty thousand square feet they offer great incentive packages like ten and fit out no common area maintenance charges long and short term lease is in fact new tenants received the first two months free located at three forty two and three thirty eight companies circle in North kings down costing descends out at four zero one\nTo eight for six six six zero\nI'm Rick Edelman could your emotions be getting in your way when you're trying to make good investment decisions our brains are actually designed a trick us so you might unknowingly be making financial decisions that can cost you money and that can hurt your ability to achieve financial security come join us for our new fun and entertaining seminar mind over money\nHow your emotions can keep you from reaching your financial goals learn the science behind your emotions and the simple steps you can take to help you manage your money more confidently learn how to identify emotional decision making to help you take control of your money and your investment strategy to help you feel good about your future\nJoined us and Fox Perot Tuesday November thirteenth at seven pm just Fifteen dollars a person twenty five a couple register at ... dot com that's rice Stillman dot com or call us a AAA to plan wreck that's triple late plan wreck\nAdvisory services offer through enemy and financial services security officer yes I guess he carries ... ... s IPC\nNow bank to changing gear on news talk six thirty and Ninety nine seven F. W. B. R. O. U. a weekly look at trucking business and politics coal mining Chris now I force we ate WPRI oh more one eight hundred three two one WPRI oh\nNow you're my college\nCourse max Harry Harry your house Mike ... house today filling in for Chris and Mike or down in Texas and we have the Texas challenge today I'm challenged towns to\nText me a picture of the great Stevie rave on who you who you hear the pride and joy song on the way on the bumped out okay we're we're talking trucking and before we go back to Tommy ... let me just discuss with Tommy so ... are toiling actually came up yesterday at at our banquet Steve Moore\nWas talking he had a question and the question and answer session with them after someone asked him about the tariffs right the international terrorists that Trump and he told the long story about about how Trump doesn't believe in Paris but he's using the ... as a negotiating tool to try to eliminate all tower so that everybody can have\nZero tariffs and and and Steve Moore said something now that's not usually something states have to worry about the states can impose tariffs then I I had an my jumped I'd say yeah but we can impose tolls we could but tolls on goods coming into our state so Tommy to your point and this is the secret of liberalism\nI don't I Will have to ask Mike Collins and Christmas 'cause they'll know better than I Would but I don't know if you're going to see that trucker\nWho's going to be punished by the tolls and and maybe but you know what happens those those tolls don't get absorbed by the trucking company get passed on to the consumers yeah so if they're shipping produce or if they're shipping milk for the shipping beer or whatever it is they're shipping\n... this they're going to go up by a penny or two every everything we're ... everything that gets truck to go up and that's the secret of liberalism as they\nImpose these little tiny taxes so that you don't notice some but over time they build up on the rest of us you know a little taxi or a little extra cost there are a little little the here and it's why people are leaving our state they can't afford to live or any more than the than the jobs aren't good enough to pay for the high\nCost of living I'm self micro Chris can find that sympathetic story I agree with you if we can find that trucker whose put out of business by the toll that could be a game changing kind of thing but I I think it gets spread out to you and me what do you think\nAre you know for what I'm saying is it affects everybody of course when they when they bring in the ...\nWhen they bring in this the serial when they bring is friday hamburger the dog the stakes\nAre everything it's commerce and Rhode Island is trucked in those prices are all going to go up the somewhat offset what the truckers have to pay but the truckers are also going to be taking money out of their pockets and what I'm saying\nIt's not make believe guy many a trucker ... male and female\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit land of Lincoln and Casey Lincoln Lincoln him Casey and the only twenty Eighteen Lincoln Navigator flood Lincoln of Narragansett unparalleled luxury him ...\nThey're run a lot of ... especially ... wonderful women Rhode Island\nBut they're but what what if they saw people suffering and if they understood what this ... thing that Gina Raimondo for some of the people of Rhode Island they would immediately say enough\nYou can talk about feminism twenty four seven you could talk about the woman's I go for it but we don't like what you've gone for good people the people who stayed or what I noticed in that that might and Chris they got the legal ankle every court you know they they want to get this thing over threats I appreciate that I think what they're doing is right but\nI think to to just put all your your your cookies in one basket and not go with the election I think is going to wind up being one of the biggest mistakes and that's where we go Rhode Island is through that you know we we make the mistake when it comes to ...\nWell ... thank you let me let me expand on that before before we have to go to the bottom All right thanks for call and tell me that I mean I think his comments are right on and I'm going to expand on on what time you said here okay because ... and we talked about this yesterday what Steve more at our centers freedom bags well deals in state freedom banquet by the way is that\nHe showed an amazing chart about how growth solves a lot of problems we've all heard about the national debt right every year the national debt gets higher budget deficits increase\nAnd and he showed a chart of how you know we've all heard the less we tackle entitlements right there at the national desk kind of go completely out of control and he showed a charge to show here's what it looks like it's going to happen\nBut that that assumes that growth rates stayed the same as they were under Obama which was about average about one point nine to ... percent gross domestic product\nHe said if we can continue if we at three percent instead of going up because because when there's growth in the economy there's more money that comes into the treasury\nI got it was proven under the Kennedy tax cuts in the sixties it was proven under the Reagan tax cuts in the eighties it's probably going to be true proven true and I think we're seeing early signs of the tax cuts here and the two thousand teens um that that revenues actually go up when you lower\nTax rates because of the growth and and that ... actually started bending down at three percent\nOf the last two quarters we've had four point three percent in three point five so we've been significantly above that three percent line which would take to bend down the national debt so back to Tom's point\nWhen we add all the this is what ... do this is what the liberals this is what the progressives don't understand is that they're hurting themselves they think they're taking more money they think they're grabbing new sources of money that won't hurt the economy but they're killing growth\nEvery time they had one of these new taxes are fees and Tom is exactly exactly right for three eight nine seven seven six eight hundred three two one WPRI oh are we can talk more about that in in a few minutes the only thing and and the other thing Tom you mentioned that we're going to talk about\nLater in the show too is he he mentioned women\nI introduced a woman from Connecticut who's starting a new women's organization nationally and they're looking at looking to establish their first few chapters in Rhode Island and I can tell you in in ... after I tell you I think you'll be interested in it that she got some sign ups in the first few policy circles\nAre going to be started in Rhode Island what's policy circle out so we'll we'll talk about that a little bit later but it's a conversation discussion kind of like a book club about politics run by a woman I was that's when my my wife describe it this way I think that's a good way to think think about it so you\nThis ... that we we saw about two months ago there's there's a group called the socialist veterans of Rhode Island\nAnd these veterans at least the ones I Know you know fought\nFor freedom\nSocialism is the opposite of freedom freedom socialist government control of your life by authoritarian figures who pretend they're looking out for your best interests so it's an affront to these men and women who risk their lives fighting for freedom to see other veterans\nI'm now in door saying\nTyranny I guess in a way as what I Would call it um\nRhode Island's number one board dealer is setting the standard again and again flood board has over one hundred brand new Ford Escape or just one twenty nine from us that's right one twenty nine Vermont flood has every color every option and everything you're looking for like flood autos out\nOf the visual uh I talked about our center and how we had just gotten back from our annual meeting in Salt Lake City Utah and we had about fourteen hundred people there from sixty different think tanks a lot of\nNational organizations like heritage and Kato and all kinds of national groups were there as well\nUm [noise] and and one of the receptions\nSalt Lake city and I said you know you know you're not in Rhode Island when they serve at the reception cans of polygamy Porter\nBeer polygamy Porter and I had a picture and it had three to a guy in the two women naked intertwined could I mean I'm the beer and I like\nYou know you're not in Rhode Island when you when you go to a reception [laughter] and you see that polygamy ... that's what they serve in Utah now does offend the Mormons polygamy apparently has been out of style for about a hundred\nFifty years or so or ... something like that at least that's what I understand but anyway the legend still lives on V. as a beer or so if any if you've\nEver had I I didn't taste it I don't want to touch the can but it was a guy I started to get some skis I didn't even want to touch the can [laughter]\nSitting there might take a sip but if any of your head polygamy Porter I'll let me know alright and I'd like to know what it but now I don't want to know what to say so I\nLooked at the label and I just love how is it the vitamin why not just have one [laughter] I don't know why why why why have just like oh you had to add that in Chris oh my God that's hilarious\nSo that [laughter] so so that was that was the highlight of my trip to Utah I'm by the way you can also Twitter me Amsterdam\nThirty seven ... seven if you got any comments or questions will put on there you can call for three eight nine seven seven six eight hundred three two one um WPRI oh yeah we had a great\nTime out in Salt Lake City we had an outdoor or one of the evenings we have the whole University of Utah stadium football stadium to ourselves that food set up throughout the stadiums some inside some outside we could run around the field goal in the stands I actually eat in the\nPress box and that was actually where they had the opening ceremonies of the Winter Olympics Winter Olympics when they were in Salt Lake City and in Park City so that that was the stadium\nWhere they had the opening ceremony so I was pretty cool man who was hosted by our fellow think tank out there in in in Utah I'm\nSo\nWe talked a little bit about some of our centers goals\nAnd you and you know I Want you to have this image in mind you know ... what's the biggest problem in our state Chris what would you say is the biggest problem in our state\nCan I just say government okay [laughter] yeah and that's pretty much it that's ... ...\nAnd the result of that government that overbearing government is that we don't we're losing people mhm right we all have\nFriends and family and so so I watch it I Want you to picture of this and this has been effective when I've done this and the ... the perfect for radio why should a shut your eyes I Want you to listen to the sounds of pots going\nAll right and I don't want you to picture the holiday table that your mother or grandmother has working hard to set right and you hear the cooking in the kitchen and the the\nClanking of the ... and the pots and the opening of the oven doors and and then picture of the shuffling of the chairs in and out as people take their seats and the clean king of the glasses that you have your wine or soda or Perrier or whatever you drink\nA on a holiday and then imagine imagine sitting down but not hearing that\nBoom because nobody's there all the kids have left the state looking for greener pastures your grandkids same they graduate college or high school and they've left I mean how many empty chairs are there at your dinner family holiday table\nUm\nAnd that's a great and that's really what we're trying to do we're trying to make wrote on our mission is to make Rhode Island a\nBetter place to build a fence build a career and raise a family\nAnd right now we're not keeping pace the nation is growing in population all bought a couple of states are growing in population we are now we've been stagnant that just over a million people for ten twelve Fifteen Years\nAnd we're not growing like the rest and because of that we are going to lose in two years a congressional seat we're going to only going to have one\nWas like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit light up of Lincoln and Casey Lincoln Lincoln and Casey and the all new twenty Eighteen Lincoln Navigator for Lincoln of Narragansett unparalleled luxury impeccable surfers\nBe punished for not attracting enough people here\nWell it goes back to like what you said about overbearing government yes people are leaving because if they want a reliable credible government but they don't want to be run by them\nAnd like Tommy day and they don't want every little tax or toll stuck on 'em every time you go to the beach or you go to collect your\nTrash next thing you know you sneeze and somebody will just pop out and be like hey there you don't have five cents right exactly I mean so that's what we do in this day we don't have any one tax it's ridiculously high but we have every tax that the very high ... and ... and now we have\nTold and who knows where that's going if we're going to be towing cars to the end and it's all ... you know and I don't know why it is I don't know why I think I Know why it\nI I think the special interests well it's because of progress we're so let me let me jump ahead to that by the way here's another great question that came up after after the um\nLunch and yes there were a little private get together with Stephen Moore of the great economists who spoke as our keynote speaker so we had about a free our we for you to get back to the airport and we had a little reception was all of our the donors and supporters\nAnd he he said Mike I noticed you use the word progressive that a lot I go yeah so we've been talking about that for about a couple of years here\nHe goes well yeah I actually think that's a compliment and I think that's a word that doesn't help you know what do you mean he goes what progress as a you know just think it's progress right progress lives of forward thinking he says I think you're doing them a favor\nWhen you call them progressive and I said huh it dries up well that's what they call themselves first of all I said but interesting\nI said well what would you call a steady such Stalin is [laughter] I said well All right I'm not sure I Will get get away with that but but it is an interesting question is is that you know so if you're not does progressive sound like a good thing to you don't know what do you think as a positive connotation to you\nNot anymore not anymore okay I mean you know at ... at face value or just the word ... was fine but now it's been skewed in so many directions you hear it and you just kinda cringe\nI'd like to think that I had something to do that because I've been I've been screaming about progressive isn't so maybe in this state we've been able to have people think of progressive ism is something that's not good but apparently nationally because that's what Steve Moore was saying is is that it's not a it's not a bad sounding word\nYou know and then maybe you should should use another another one in fact I just got Texan from our our chairman [laughter] another suggestion instead to call them Solomon is we're we're regressive regressive as or regressive Marxist so all ... they're all true\nBut anyway because I mean regression comes with the you know like when you think children things like that and the throne tantrums that makes sense\nYou know but then people say well you shouldn't give people labels and in ... and all that and I said well but you got to delineate between who is who you're going to know which team Iran right I mean did the red Sox Dodgers they were different uniforms right well I'm says Red Sox most of the Dodgers\nI mean so you're you're sometimes we we where Republican Democrat uniforms sometimes we're conservative libertarian liberal or progressive uniforms are regrets of uniform which one do you like best\nI like regrets that that's pretty good like regrets and that's funny yeah\n[laughter] I like that one it's it's a little nasty it depends if he if he got a thick skin and it's funny now to be civil now we're trying to have civil debate if I if I don't think so if I call ... what are you guys think out there for three nine seven seven six I call somebody regrets of that's not an insult you know think\nWell I mean it if anything hopefully it's an insult enough to stimulate something intellectually and not take it to that regressive on the playground level\nOkay All right so we're I'm going to think about this and I'm going to talk about it with my staff maybe I'll do some Facebook polls and\nWe'll see what what terms I again I don't want to term that's the clever restore the nastiest because that's how people on social media everybody tends to go there right eye out what's going to be the most effective an accurate and we have to be accurate way to to describe this this far left\nFringe that's taking a grabbing a footing nationally and especially here in here in Rhode Island so what we what we talked about", "show_name": "The Matt Allen Show", "year": "2018", "city": "Wakefield-Peacedale", "day": "27"}