{"month": "10", "state": "PA", "station": "WESA", "content": "Your membership makes this community stronger help support it right now with a phone call is supported for one to six nine seven to nine five five\nYou can also contribute online right there on the Web site at W. E. essay dot FM and thank you so much for your support\nW E s a is supported by oil and ... in celebration of attempts anniversary of ... restaurant in one bar\nChef owner Sonia film presents a daily changing menu of salads small place and soon crust pizza from sustainable ingredients information is available at diamond hyphen P. G. H. dot com Pittsburgh NPR News station\nStreaming at W. E. S. A. dot FM [noise] this is Ninety point five FM W E s they Pittsburgh Ninety three I found it I mean you know to to Eighteen Baltimore and one hundred and twenty five of them W to six three A. W. Johnstown and one of the four point one I found\nW to a one page leading airing SARS Ninety point five HD one first Pittsburgh NPR News stations dreaming at W. E. S. said that FM\nFunding for here and now comes from that for the creators of that law to simulate somewhere accelerating the pace of engineering and science and learn more and now we're not income\nFrom NPR and W. B. or Boston I'm Peter O'Dowd I rounded\nYoung hearing now coming out the death toll from Michael rises as residents like autism and growing oysters to aquaculture anticipate the damage with the lectures washed away\nThere's another Lipman are small business is done for at least a year to\nAlso new evidence about what happened to your ... object inside the Saudi consulate in Turkey and serious problems inside a California immigrant detention center inspectors found a news is made of bed sheets in several so\nA man killed himself at a detention center using bed sheets and I've been to\nOther attempts and artist for members and murdered young gay men Matthew Shepard Twenty years after his death coming on\nThe news is first\nLive from NPR News in Washington I'm Laurie London\nMany homes and businesses have been reduced to rubble after hurricane Michael obliterated entire communities along the Florida Panhandle two days ago Dolores ... from member station WWNO us she reports on what it's like for people in Panama City who are trying to leave the coast\nPanama City residents don't expect power to be on for weeks much less having their homes rebuilt\nFor those with cars intact that wanted to leave Thursday and head east they had to drive up to Georgia and then back down to Tallahassee through other hard hit areas many of them without gas or power either the main highway I ten east is open today but many local roads in and around Panama City are still closed\nTend to air force base which is located a few miles outside Panama\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt CMU dot edu flash I I I\nThey had to drive up to Georgia and then back down to Tallahassee through other hard hit areas many of them without gas or power either the main highway I ten east is open today but many local roads in and around Panama City are still closed\nTend to air force base which is located a few miles outside Panama City is also reporting devastation to its buildings and many fighter jets as well as destruction of its marina for NPR News I'm Dolores ... in Gainesville\nAnd in North Carolina officials are assessing the damage and starting the daunting task of clean up but with trees and power lines down and half a million people in the state still without power North Carolina governor Roy Cooper warns conditions are still dangerous\nBe careful and use the proper safety equipment and don't touch downed\nPower lines there have been at least eleven storm related deaths including a Virginia firefighter who was responding to a crash north of Richmond as Michael lashed the state he died at the scene when a tractor trailer hit his fire truck\nAnd American pastor is hoping to be on a plane back to the United states after being freed from house arrest and spending two years in jail in Turkey\nAndrew Brunson case has been the center of a long diplomatic dispute between the U.S and turkey which has repeatedly called for his release a Turkish court sentenced Brunson today\nTo three years on terrible aided and espionage charges\nThat allowed him to leave the country\nThe Democrat challenging Texas Senator Ted Cruz this November as broken a fundraising record within a three month period congressman Beto O'Rourke raised more than thirty eight million dollars Ashley Lopez of member station\nK. U. T. in Austin reports Beto\nO'Rourke has been lagging in the polls lately that he is vastly out fundraising his opponent in fact he received more than tripled the amount Ted Cruz raised which is about twelve million dollars and the same time period\nAccording to our rights campaign he received more than eight hundred thousand individual contributions none of which he said came from a political action committee or corporation even though ... individual campaign is raising a lot of money Cruz had been receiving a lot of support from conservative groups across the country\nThat's Ashley Lopez reporting this is NPR\nSupport for NPR comes from NPR stations other contributors includes the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and I owe to solutions and industrial scale learn more at sea three I O T dot AI\nYour days you're afternoons they're more interesting when you listen to W yeah say which is a good reason to make a contribution now during our full membership drive\nYour gift will make for more interesting afternoons to come please give on line of W yeah say died at them you can call for one to six nine seven to nine five five good afternoon thanks for being here for here and now I'm Christopher ears and I'm joined by Brian swore\nGood afternoon and thank you we want to make a few people from last hour leg to Deborah in Pittsburgh another donor an open mind and Colleen in Pittsburgh as well\nFor all becoming members and guess what it's a new ours we have a new goal we're looking to raise a thousand dollars for W E s say this hour you can help me this important goal by giving now would for one to six nine seven to nine five five\nYour financial support will ensure that all the programs you enjoy the news you trust will be\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nAnd Colleen in Pittsburgh as well for all becoming members and guess what it's a new ours we have a new goal we're looking to raise a thousand dollars for W E essay this hour you can help me this important goal by giving now it for one to six nine seven to nine five five\nYour financial support will ensure that all the programs you enjoy in the news you trust will be here every day on W E s say you can also give on line a W E S H ... FM\nHelpless meat that one thousand dollar goal for one to six nine seven to nine five five O W e essay you hear stories about events that change the international order you hear stories about discoveries that revolutionized our understanding of science years stories that move your soul maybe they bring a smile to your face for it to your\nTo your high you get all of that on your commute to and from work and throughout the day that's got to make W E s say we're supporting support is now become a sustaining member eight hundred eighty dollars left the rest of this hour for one to six nine seven to nine five five on line at W. E. S. A. dot ...\nYou know listeners support accounts for almost half the funding a W E s say your donation is an investment in the programs you enjoy you decide the amount that you want to give whatever's comfortable for your budget whether it's ten dollars a month or a leadership circle of a hundred dollars a month\nYour support has a big impact\nAnd it helps fund all of the programs you love your on W E s say\nMake that phone call us support right now help us get closer to the goal by calling for one to six nine seven to nine five five you could also give on line right there on the Web site at W. E. essay dot FM and thank you so much everybody who supports once again the numbers for one to six nine seven to nine five five\nFrom ... I'm ... I'm\nPeter O'Dowd this is here and now Michael is now a post tropical cyclone over the Atlantic ocean at a tight the storm was the most powerful hurricane to hit the continental United States in more than twenty five years at least eleven people died five of those in Virginia as Michael moved up the coast\nThe story is now one of recovery for devastated communities in Florida Georgia the Carolinas here's lands Hansen resident of Mexico Beach Florida speaking with NPR\nThis is a war zone how you're going to get outta here this city is destroy the whole area is going to get there got turned out all these houses are rebuilt it you're like I recognize electrical ditch let's check in with NPR's Joel Rose Hi Jill\nHi thanks for having me I understand your emergency operations center just outside of Panama City what are you learning\nYes as you say I I'm just a couple of miles outside of Panama City here at the emergency operations center where\nFirst responders are sort of gathering from all across the region a parking lot is in fact totally overflowing with vehicles today military coast guard utility companies you know it's spilling out into the neighboring into the sort of a swamp land and fines around the building\nI learned more though from my trip into Panama City I've just come back from you know going down into the stadium and really looking around at the damage and it's pretty staggering\nWith a lot of the pictures that we've seen so far has been focusing on Mexico beach so is it as bad where you are in in Panama City because in some places it just seems like homes and businesses are just totally wiped off their foundations\nThe damage in Panama City is pretty extensive I mean I've never seen so many trees on the ground or bent over power lines on the ground all over the place I mean you drive around the city and and you just are constantly driving over them still there's lots of debris in the ...\nScreaming on W. E. N. appointed by Carnegie Mellon university integrated innovation detail on a master's program\nAt ... dot edu flash I I I\nHomes and businesses are just totally wiped off their foundations or the\nDamage in Panama City is pretty extensive I mean I've never seen so many trees on the\nGround or bent over um power lines on the ground all over the\nPlace I mean you drive around the city and and you just are constantly driving over them still there's lots of debris and the roadways the you know some houses are seem like they're more or less okay others look like they're okay except for that they have a tree you know leaning on this on the roof\nAnd then there are other buildings where the wind just shared the whole face of the building off I mean I saw several churches that were just you know I really missing their facades or their side walls and you could pure right into the sanctuary and you know see the pews from from standing out on the sidewalk I mean [noise]\nEvery day for one to six nine seven to nine five five you can also contribute on line at W E S H ...\nYou know we just heard from Susan in Pittsburgh thank you so much for Susan for her membership and she wrote radio is still the best medium and Ninety point five in Pittsburgh excels we are fortunate in Pittsburgh the quality and decency and radio journalism is alive and well thank you so much for those lovely comments and\nThat's why we're here to ... to encourage you to support all this quality journalism on W E s say\nYour membership reflects the importance of having WBFO say at home in the car on weekdays and weekends to if the station is part of your daily routine consider giving ten or twenty dollars a month\nThat's a a little bit to go to a to help\nPay for the value you received for W E a safe for one to six nine seven to nine five five or W E S H ...\nFM for one to six nine seven to nine five five help us meet this goal of a thousand dollars for this hour we are a well on our way six hundred and forty dollars left to go become a sustaining member right now help W yeah say keep the news that you count on on the air\nFor one to six nine seven to nine five five you can also contribute on line that W E essay dot ... and thank you\nFunding for here and now comes from landmark college serving students who learn differently with faculty specializing in L. D. support associate and bachelor's degrees transitional bridge semesters and summer programs for college and high school students more at L. D. branch dot org\n\nIt's here now first lady Melania Trump launched a social media frenzy when she said she's one of the most bully people in the world here's a clip of her interview with ABC News correspondent Tommy on it\nI Would say I'm the most ... percent on on the world you send you the most bully personal out one of them if you see what people are saying about that's why I you know my feedback thing today the focusing on social media\nShe landed right into that aforementioned social media frenzy joining us for our weekly social media news roundup semi okay hosted the stream and out of high they're not listening to twist that it was in fact I spent most all public figures or get a torrent of criticism Michelle Obama was called an ugly monkey\nBy a public official and those are the knights of Columbus\nBut you know in this case bullying is a prime part of her husband's style so what's been the response to this\nOn the whole people and taking a defense lady's comments particularly save as late as ...\nAs an adult your critics of trying to send you a message and how you perform menial job which is ineffective at this time constructive criticism is not funny it is\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt CMU dot edu flash I I Try\nTo this on the how people were taking a the first lady's comments particularly seriously uh Frankie ... on Twitter\nAs an adult your critics are trying to send you a message and how do you uh performing your job which is ineffective at this time constructive criticism is not bullying is the right to the people we pay for your travel and protection and we're not gaining anything I mean to switch over to Facebook and Williams give us give us a little quiz\nI'm not sure if the correct response to the situation is eight won't won't\nBe thoughts and prayers see I really don't cat do you do the best eat one of the above he's going with all of the above and one last comment to round up this little section ... roaches says on Facebook\nI'm just going to sit here and watch old prove a point loss out loud on to the ... which is I mean of somebody eating popcorn enjoying all the comments whizzing by\nLook at the New York times writes that she's not wrong I mean she does a\nAs other first ladies have receive a torrent of abuse ... comments those racy photos from her career as a model but you know he or she has this initiative maybe she should I I don't know that'd be thinking of the kids in school who are you know so bullied and don't have any protection\nSomehow those comments were coming out online about real people online and youngsters and and uh people who are being bullied into suicide so as that is a a more serious aspect of of what she's talking about it doesn't mean that she's not being bullied but she is a public figure and she has out that\nMaybe she could just sort of you know sort of share with them that you know you're not alone uh but anyway on the topic of bullying Instagram has ruled out some new technology they say it's going to recognize bowling just tell us briefly what\nThis is that the ... and the ... looks at either a video or comments that they can set a might be offensive to you might be bullying it sort of like all to official intelligence and not so to you can apply to your video and your comments and instead grab\nAt all so they have a kindness camera which is another failed at and not feel too will send out love an ... I'm pretty ... and bright colors and you can also get in a variety of different languages people saying nice coming back to you when did that ever happened\nI think that's one of a weak spot where you know what we should link actually let's do this we should linked to a young men who had this initiative on his own of you know telling somebody that they are worthwhile and it was wildly popular so willing to that as well why not you can get like ... you\nKnow hearts and let's see there's actual media ... yes let's do it either ruin it and\nI have to ask you quickly about an uproar over now deleted tweet\nA from a user by the name of blue star navy mom three she made a post saying that her son was afraid to date in this me to era when you know he graduated number one in boot camp was awarded an award house ... but she won't go on solo dates because of the current climate or false sexual accusations by radical feminist so I vote\nHas to take him to he responded what\nWell first of all people study Mimi flying this this comment because\nHer son is a navy fat and he's let's just say he's not exactly hideous he would probably be the opposite of Haiti as that goes on very well in social media people were Mimi find him too when he found ... pizza and ... and his his name he said that was my mum sometimes the people we love these things that hurts us without realizing it that's totally surrounds\nBecause all of this to protest on that was banging around his mum saying aimed to\nAnd he said I respect and hashtags believe\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program at\nThe end you dot edu slash I I I\nFor me me find him too when he found pizza and he is he's ... he said that was my mom sometimes the people we love these things that have to say that we ... it's tennis around because all of this to protest on that with gang around his mom saying aim to\nAnd he said I respect and hashtags brief winning and I never have never will support\n... came to he's coming out of the feminist I'm uptown navies and the cat died on an ally oh say can we say you're being game is a ... point how to look out for him I wanted to add to that with my mom he's using he's ... he's staying philanthropy ...\nAny okay hosted a shame on al Jazeera English I'm sure that will be a conversation if any thank you Joachim it's here now\nAnd during the surprise inspection of California's Adelanto immigration detention center officials found new suits made of bed sheets and a litany of other health concerns\nThe inspector general's office at the department of homeland security published a heart harsh report this week detailing problems inside the building a private company runs it for immigration and Customs Enforcement of houses up to two thousand people waiting for the immigration cases to be decided\nJoining us now is ... she's a reporter for the Los Angeles times and she's been covering the story former welcome thank you this was a shocking report to read inspectors found new is made of bed sheets in Fifteen cells how is that possible\nUh well that's a good question you know I think that the reason that the office of inspector general issued this management alert\nSaying these sort of where issues that needed to be addressed immediately because you know a year ago a man killed himself at a detention center using bed sheets and there have been to other attempts\nAlso using a bed sheets so I think when the inspectors with the office of the inspector general walked through Adelanto on this a surprise inspection and found that these nodded bed sheets were just hanging from from vents and so many cells I think that was a sense of urgency is estimated to be addressed\nFor should we imply then that that many people inside the facility worst suicidal or or could they have been for some other reason making those says\nYeah I I don't think so um you know people are told\nThe inspectors that they use them for various reasons they said that they would on for all the\nThe bed sheets to give themselves privacy that they would use them as sort of clothes lines but they were also told by one man that he had seen suicide attempts using these new says and that the guard sort of laughed at them off and then call them suicide failure is when a\nWhen the attempts weren't successful so uh so now I don't think it was the case and every person's case but it's clear that that this has happened before and that officials were aware of that\nAnd it wasn't the only problem inside the building by any means what else did you find [noise]\nSo the other things that the office of the inspector general highlighted a that they found during this unannounced inspection in May of this year was\n... you know one of the big things and this has been an issue in Adelanto for years since it opened back in two thousand eleven was a question of untimely an adequate medical care\nUm and then the other problem that they highlighted was improper and overly restrictive a use of segregation and you know the thing about an immigration detention is it's supposed to be what they call civil detention it's not criminal\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free friends\nFor years since it opened back in two thousand eleven was a question of untimely inadequate medical care\nUm and then the other problem that they highlighted was improper and overly restrictive a use of segregation and you know the thing about an immigration detention is it supposed to be\nWhat they call civil detention it's not criminal detention it's not supposed to be unity of nature and so there are national standards that sort of govern how that's supposed to happen and so when you're using disciplinary segregation in ways that are more punitive a that becomes a problem\nWhere we also learned that doctors stamp their names on patient records without ever seen the detainees a dentist said that he didn't have time to do ... and the detainees could just use string from their socks to ... their teeth [noise] um it was the last say about what kind of medical care they're supposed to be receiving\n\nIt will you ESE supported by shady side academy students that shady side learn to balance hands on curriculum firm investigating trends in Pittsburgh evolving neighborhoods to growing kale in the schools on campus farm\nUpcoming open house information is available at shady side academy dot org Ninety point\nFive W E s a Pittsburgh NPR News station and highest Jeremy ... from here and now\nThis isn't the sound of a leading the real question wasn't cut I continue to do good as I define it in my home\nFree to present the facts free to pursue the truth\nAnd so it's not clear for here from them again or or some of their testimony again free from commercial and political\nThere always are dark spot is of course we're talking about the economy here three\nBecause of your support call for one to six nine seven\nTo nine five five will give on line yeah say Don FM\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station from\nPosters Smith printing posters on wrinkle resistant fold the fabric the transports flat for conference presentations poster Smith provides a service to research communities worldwide learn more at posters Smith dot com\nAnd home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nBusiness here and now there are new reports that missing Saudi journalist ... was murdered\nThe Washington Post is reporting that turkey has audio and video proof that he was killed and dismembered inside the Saudi consulate in Istanbul\nShot you wrote columns critical of the Saudi Government for the post and he hasn't been seen since he entered the consulate more than a week ago his disappearance has raised questions about the close relationship between the U.S in Saudi Arabia\nThe BBC's mark low and joins us now from Istanbul and mark you have your own reporting that's similar to the post what are you hearing\nI Do it at a source close to touch investigation of said turkey has gone documents that evidence to support the class\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\n... more than a week ago his disappearance has raised questions about the close relationship between the U.S in Saudi Arabia the BBC's mark low and joins us now from Istanbul and mark you have your own reporting that's similar to the post what are you hearing\nYeah that'd be a source close to touch investigation of said turkey has got to document that evidence to support the claim of state sponsored murder of ... she went into the Saudi ... ten days ago\nAnd this also said tells us that anchors official position is still that I'm ... is missing about that a tax intelligence knows for sure that he was murdered\nI'm not a backstop the American news reports and all that audio and have a ... a video evidence the recordings showing that mistake a show she was a northern e\nKilled but also interrogate and tortured before that um they're very gruesome details coming out including recordings allegedly of him being beaten\nI'm On some reports that his body was just men but I'm the Saudi or officials Saudi authorities are still flatly to knowing all the allegations how reliable generally speaking is Turkish intelligence\nUm I Would say that it is it's it's it's pretty reliable in terms of what they leak to Turkish pro government media um there's just not strange communication strategy with his government here in techie where they don't really speak directly to\nForeign media for example they and they don't actually have a ... communications department but they do leak through the state media so I think what's happening at the moving pictures that\nThe Turkish government is maintaining a study more cautious approach that for example turkey has welcomed in Saudi officials here to be part of a joint Saudi ... investigation or the Saudis have proposed\nThat is the tux playing nice and saying that we're going to we don't want but all our diplomatic relationship at this stage\nBut they all leave King I'm a incriminating evidence on a day to day basis and therefore tightening the screws on the Saudis and trying to get the ... western backing for the ... position the question about that joint committee the Saudi Turkish investigation has to be how credible\nIt can be if it includes the Saudi Government yeah and and I think that it's sort of basically being compared to for example if Donald Trump was to set up a joint suddenly the crimes inquiry what the Russians I mean I I really think that they say is kind of\nUm a diplomatic nice city on the parts of the tax entertaining the Saudis on this but they are pretty clear that they have called the evidence to back up their expression allegation\nAnd there is some more irony here as well the turkey is pushing a case that a journalist was murdered on its soil while at the same time the country is one of the world's biggest jailer of journalists are people noting that at all\nThe biggest jailer of journalists I mean yes it has been noted particularly by Chuck E. ... such a spot and\nYou know that says at techies not treating journalists in the same way it is a journalist is alleged are being treated that it's not even know murdering hey we're talking about uh how tech is locked up on this which is obviously a also an attack on persuade them and completely unacceptable by in a ... attack on on on liberal values but\nBut uh yeah there is some distance do between the two cases I think here\nIn our country a mission that this case is threatening us Saudi relations which have been very very close over the years but from your perspective there and his stumble how much is this case threatening the diplomatic order any across the region well I think that turkey is very\nThat it that you know the racial Saudi Arabia is important it doesn't want to destroy that relationship at this stage bought a I think that you know clearly tech\nScreaming on WGN supported by Carnegie Mellon university integrated innovation detail on a master's program\nAt the end you dot edu flash I I I\nFrom your perspective there are new stumble\nHow much is this case threatening the diplomatic order any across the region well I think that turkey is very aware that it that you know the racial Saudi Arabia is important it doesn't want to destroy that relationship at this stage\nBought a I think that you know clearly tech he's not going to sit back and simply accept what is in effect the flagrant violation of its sovereignty aid it won't support from the U.S from other western governments in and taking a tough line towards the towards the Saudis and speaking of diplomacy there's one other breaking news story want to ask you about today\nA U.S pastor Andrew Brunson\nHeld in Turkey in prison in Turkey for two years has been released today by the Turkish government\nUh what are we learning about that [noise]\nYeah this is a country that produces more news than it can can see I'm ready and the American pasta Andrew Brunson he was detained in the ... the failed coup here in twenty sixteen accused of supporting terrorists groups\nOr he has family the American government is always have always had that's completely baseless and they put pressure on the tax to release him president to add one has always maintained he could not interfere with the ... independent to protect us traditionally which is seen as laughable bike by critics of of tacky and what's happened today is that he has finally being released\nA he was sentenced to two or three years one month Fifteen day sentence which basically a corresponds to the time already spent in custody Andrew Brunson will finally be able to go back to the U.S and and uh it was the source of must've friction between the U.S and and ... governments\nThat sanctions tariffs and the plunging of attack US Currency that as well and I expected to east to some extent\nAnd it will be seen most likely as a diplomatic victory for the Trump Administration the BBC's mark low in Istanbul thank you so much pressure\nNot back to the U. S. where a candidate in Georgia's hotly contested governor's race has been hit with a federal lawsuit Republican secretary of state Brian Kemp is running for governor and he was sued yesterday by groups that say his office is jeopardizing the votes of some minority residents ... campaign denies that it did anything wrong\nBut his opponent Democrat Stacey Abrams is calling on him to resign as secretary of state\nJonathan breeder is counsel with the Brennan Center for justice is Democracy Program at the nonpartisan group that advocates for voting rights Jonathan thanks for joining us\nThings around the reporting is that camps office stole the registrations for fifty three thousand mostly black and Hispanic voters based on a law known as exact match what can you tell us about that\nExact matches the policy by which if all the information on a voter registration form down to the digital ... doesn't match perfectly with existing data and driver's license for Social Security information the voter registration form is put on hold and in some cases rejected entirely\nDo most people on that list no that they've been excluded\nThey're supposed to get a notice in the mail but often times people don't receive those or understand what they need and sell the burden is and placed on the voter to fix this problem which in other states without affect their eligibility or or voting at all\nSo in total comes off as a secretary of state has canceled nearly a million and a half voter registration since two thousand and twelve\nHis campaign that saying that he's making sure that only legal citizens cast a ballot and that it has never been easier to vote in Georgia um what what do you make of that are you aware of any voter fraud problem in Georgia and it's missing in level\nFree to pursue the free to explore we're Ninety forty five W E s say Pittsburgh's NPR News ... the sound of a free friend\nMillion and a half voter registration since two thousand and twelve\nHis campaign and saying that he's making sure that only legal citizens cast a ballot and that it has never been easier to vote in Georgia um what what do you make of that are you aware of any voter fraud problems in Georgia and a significant level\nThere's no significant evidence of voter fraud and Georgia and although voter lists maintenance is important there is no connection between aggressively purging the voter rolls the way Georgia has and making is more secure at\nCamp is also a putting a fair amount of the blame here on Stacey Abrams his Democratic opponent she started a voter registration group in two thousand and Thirteen called the New Georgia project in camp is making the point that\nIn the process of signing thousands of people up through that project they did a sloppy job and that he was just pulling out those improper registrations I mean it does Stacey Abrams in her group deserve any blame for maybe doing this in in a poor fashion\nVoter registration drives our a vital lifeline to get certain communities who don't have as much access to government offices registered to vote if there is information missing or sometimes happens", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Pittsburgh", "day": "12"}