{"month": "10", "state": "PA", "station": "WESA", "content": "Covered the news in every way you expect the news it's important to you the in depth coverage of important stories around the corner and around the world go to the phones right now for one to six nine seven to nine five five or W. E. S. A. dot FM\nAre looking for just one more contribution we have about a hundred and fifty dollars to raise one person taking the Baron ... we're going to meet this goal you and a two people giving Seventy five dollars and we meet the goal but we do want to meet this go before the hour is out we have just a few moments in which to do that please take a couple of minutes to give right now\nFor one to six nine seven to nine five five or online at W. E. S. A. dot FM and we thank you an advance for your support\nFor NPR News station\nStreaming at W. E. S. A. dot FM [noise] this is Ninety point five ... W E s they Pittsburgh Ninety three I found that I mean you know to to Eighteen Baltimore one hundred and twenty five of them W to six three A. W. Johnstown and one of four point one I found W to\nA one page leading errands or Ninety point five H. D. one Burke bits burden on the news stations dreaming at W. E. S. H. dot FM\nFunding for here and now comes from that word the readers of mad loud and simulate software accelerating the pace of engineering and science you learn more and network dot com\nBoom NPR and W. E. or Boston I'm Robyn Young I'm Jeremy Homs and\nHe's here and they're coming up as President Trump surveys the storm damage from hurricane Michael today we'll hear from a family that lost their homes\nThere the moment that we didn't realize that everything that we build you know in the family and his home is gone and not including our community that the places we love her and\nAlso the latest in technology for the blind including a camera on your glasses you could hook up to a sighted person\nOf a double tap on the home button on the phone and call him in our age and\nConnecting changes hunting starting video please wait [noise]\nThese stories and President Trump sixty minutes interview coming up here in the news is first\nLive from NPR News in Washington on Lakshmi Singh a joint Turkish in Saudi investigative team and searching the Saudi conflict and assembled turkey nearly two weeks after journalists ... entered the building and apparently never came out he is feared dead\nThe mystery surrounding the show the whose columns have been critical of Saudi crown prince Mohammed bin Salman puts the Trump Administration in a highly sensitive diplomatic position with a U.S ally in the middle east NPR's Michel ... element is traveling with secretary of state Mike Pompeo who is on his way to Saudi Arabia this hour to meet with the crown prince his father\nWashington Post columnist Jim ... show was last seen entering the Saudi conflict is down ... earlier this month President Trump said\nFree to pursue the re to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nIn a highly sensitive diplomatic position with the U.S ally in the middle east and peers Michel ... element is traveling with secretary of state Mike Pompeo who is on his way to Saudi Arabia this hour to meet with the crown prince his father Washington\nPost columnist Jim ... show was last seen entering the Saudi constantly ... earlier this month President Trump said on Twitter that the Saudi king denies any knowledge of what happened to the show gay Trump says he spoke by phone with gangs all non ended sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there and\nThe cases straining us relations with Saudi Arabia though Trump has made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nShould President Trump ever make another Pocahontas dig against Senator Elizabeth Warren the lawmaker from Massachusetts will respond with a DNA test she has released the results which offer a strong evidence that she has Native American heritage going back six to ten generations\nUntil now Trump never seem to believe warrants claim at his rallies he has mocked her as a fake Pocahontas or a markets deeply insulting to Native American groups several months ago in Montana he even better generous donation and senator warrants favorite charity if she could prove them wrong I Want\nTo our fear favorite charity\nIf you take the test so that shows you're\nOn his way to Florida this morning President Trump told reporters he never said that the president and\nFirst lady Melania Trump are in Florida this our viewing hurricane recovery work NPR's Quil Lawrence reports from the Florida Panhandle hundreds of people are still in shelters\nTarps and chainsaw or in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative about\nWhen the lights might come back on there is no cell phone signal and much of the region locals have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle from all over the state Quil Lawrence NPR News Miramar Beach Florida\nThe Dow is up twenty nine points to twenty five thousand three hundred sixty nine an as that goes down twenty seven asked him he's off one this is NPR\nSupport for NPR comes from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and I owe the solutions learned more at sea three I O T dot AI and the ... foundation at ... dot org\nAnd a very good morning good afternoon to you what time of day is it this afternoon\nAt four minutes past one o'clock we're taking just two minutes\nBefore we get to hear now Johnson with Marie of capital into as we're on the backside of our membership Dr asking you to help us keep it on track\nBy making your contribution right now the money that you give\nWell we take that money and we invest it right back into the programs that you listen to the programs that you value in into the W E S a newsroom so please give what you can whether that's five dollars a month or ten dollars a month\nMaybe you could afford a little bit more every dollar makes a difference at for one to six nine seven to nine five five W E S H ...\nYou know NPR became the best source for news because it has the best\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nDid you value in into the W E S a newsroom so please give what you can whether that's five dollars a month or ten dollars a month\nMaybe you could afford a little bit more every dollar makes a difference at Fort one to six nine seven to nine five five W E S H ...\nYou know NPR became the best source for news because it has the best source of funding you\nYou put the best correspondents in the field you put the most inquisitive people in the news anchor chairs and you put the most demanding people behind the editors task it all happens but only with your contributions to W E s say\nWe need your support to continue to provide quality programming like hearing now which is coming your way in just a moment it's really easy it just takes a couple of minutes to become a member go to your phone and call for one to six nine seven to nine five five or you can go to our website W E s ain't got ... and if you have\nThe means I'm asking you to consider joining our leadership circle by becoming a member of the one hundred dollar a month club that's when you set up a sustaining membership\nOf a hundred dollars a month or more and you're supporting the news in a big way plus there are meet and greets with NPR folks who come through town public radio folks this past year Wade Goodwyn it uh we had a Joshua Johnson we had ... from science friday\nWe're creating other special events including a we're going to be hosting here at the radio station for leadership circle members of all things considered happy hour's will have a little program with that\nUh you get a date sponsorship as well where you can have a day with a three or four announcements acknowledging a personal event that you want to acknowledge on the air such as a birthday an anniversary or graduation so these are some of the things to be part of the hundred dollar a month club when you give a W E S H ... n thanks for your support\nFrom NPR and W. B. U. R. I'm Jeremy ... and\nI'd rather than young it's here and now in today President Trump answered reporters' questions before boarding air force one to travel to storm ravaged Florida in Georgia asked about the disappearance of Saudi journalist ... Trump said he spoke with the king of Saudi Arabia\nSwitching firmly denied any knowledge of it he didn't really know maybe I don't want to get ... but it sounded to me like they were all blown out\nPresident Trump also said he sending secretary of state Mike Pompeo to Saudi Arabia let's kick off the week ahead in politics with NPR lead political editor demented women now had medical\nGood a good morning or good afternoon how are you [laughter]\nLet's start with a missing Saudi journalist the president picking up on a theory that your colleague NPR's Jackie Northam told us is popular in Saudi Arabia this was broke killers but in a consulate you know even Republican lawmakers want punishment that the president seems unwilling to carry out in blocking an arms deal\nWith what do you what's your sense of what's going to happen here well\nIt certainly complicated geo politically for this president he seems to have revealed himself pretty plainly as somebody who wants to talk about you know specific transactions and it's very transactional person this is the way he was with his real estate deals and the thing that kept coming up for President Trump was the fact last night on sixty minutes that\nHe said look they we get billions of dollars in a you know these weapons sales and who doesn't want to hurt jobs when it comes to re piano or any of the other uh arms makers\nWell and and as others have said these aren't really commitments for sales are more like promissory notes you know they they may not have an anyway but and some of them\nThat we've got on the back of a nine point five W E s a tote bag end as well as on and amazing mug again that combo is yours today only when you get Fifteen dollars a month give us a call for one to six nine seven to nine five five or give on line ... Evan\nYour financial support comes with no strings attached it's free from commercial or political influence and that's what makes it vital to W. E. essays future how often do you tune into W E s say maybe ten twelve fourteen times a week that's five hundred seven hundred hours per year and five or ten dollars a month on the Sistine her plan is all it takes to become a new member\nSo go ahead give us a call for one to six nine seven to nine five five or W. E. S. A. dot FM I Love that you bring up the new members kindly because we've got so many incredible sustaining members\nAnd and people that have given in the past and that's why we're here today that's why you can listen now so\nI think ahead think had to future generations think ahead to next week be a part of the reason that we continue to bring such quality programs right here in the Pittsburgh area we'd love to hear from you for one to six nine seven to nine five five Fifteen dollar a month level will get you that amazing combo gift that he has said that FM thanks\nFunding for here and now comes from the listeners of WB or Boston and college wind where consultants work with high school students to identify and achieve their goals in high school complete the college admissions process and negotiate merit scholarship awards more at college fine dot com\nIt's here and now and now look at some of the latest technology for the blind and the vision impaired with our friend and go to guy Brian chosen director of technology at the ... Center for the blind\nAnd Brian you have all sorts of things spread out here in the studio and we're making a video so people can see this for their loved ones will posted it here now dot org but would you like to start with\nI'm going to start with the simplest of technologies one that has a lot of impact on blind originally people and that is our ability to pick the right medicine with regard to medicine on some bottles here and attached to its side is a little digital recorder others kind of comical a recording on here\n[noise] [laughter] [noise]\nWow what a great thing\nInstead of having to put rubber bands on to indicate whether or not this was once or twice a day or three times a day mad I can rely on this kind of labeling\nThe that is amazing I'm a first of all who knew that Abraham Lincoln had a prescription\nFor Sam Axe [laughter] knows this\nFor NPR News around\nMy talking scale 'cause I don't want the rest of the household here with the bad news of the morning on that talking scale\nSo we learned the mascot we control volume and with the new eco family only the one closest to you respond so you don't have this problem that's saying something down the hallway only habit change something in the living room that\nI mentioned frail a moment ago braille\nLiving around that long a just a couple of hundred years and it still under development ah we recently adopted in international standard for English rail because they're the brick ... differently than the Americans than the Australian\nBut the big change in braille is what's called a refresher will break I'm going to turn on this orbit reader it looks like a label [noise] like the little dog electro mechanical or raising up in the ... you know\nA couple of years ago I was showing you a refresher will prevail display and you were astounded at the price of three thousand four thousand dollars just one now costs five hundred or so brio is becoming more affordable than it's ever been before\nAnd now I'm going to trim magnification vast majority of blind or visually impaired people use the mission\nSo out of those who are legally blind about eight out of ten of some musical vision so we use closed circuit TV devices are going to turn this one on\nThe small Katie yeah come on\nIt gives me some trolls true [laughter]\n\n\n\n\n'cause I think it helps you know the color of your ... name\nSo the color identifier that are brought to assure you last time costs three hundred and fifty dollars just one tells twenties wow and this is maybe the size Saddam cocky sob exactly I'm going to hold it against my time\n[noise] [noise] [noise]\nNow I'm going to visit my dance and they say\nVery dark brown they lying I'm wearing a black man\nAnd and that tells me guess what the battery\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute detailed on a master's program\nAt the end you dot edu flash I I I\nKnow I'm pointing it at my pants and they say [noise]\nVery dark brown that lying I'm wearing a looking on the black panther oh Bryan and [noise] yeah that tells me guess what the batteries dying oh [laughter] when is it that far off wow\nSo I'm now manage my own parents with shirts with ties in my household something that I always had to rely on somebody else to do in the past I Want to see the classes that get help with so\nI'm going to take off my regular designers shades hear them and put her on a pair of glasses but they have a camera mounted just above the no no way\nSo I'm now going to take a phone it's specifically a over rice and phone that has only one purpose and that's to do what I'm about to do with it for a variety I ready for service and now if I double tap on the home button on this phone is calling in Iran agent\n[noise] um\n\nMm Mm\n\nMm no [laughter] [noise]\n[noise] [noise]\n\n\nOoh\n\n\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd Geico offering motorcycle an RV insurance more information available on motorcycle an RV insurance at Geico dot com or one eight hundred\nNine four seven auto\nIs here now back to President Trump's comments last night on sixty minutes continuing to question the importance of addressing climate change\nI think something's happening something's changing and it'll change back again I don't think it's a hoax I think there's probably a difference but I don't know that it's manmade I Will say this um\nI don't want to give trillions and trillions of dollars I don't want to lose millions and millions of jobs I don't want to be put at a disadvantage for others are pushing\nFree to pursue the free to explore we're Ninety forty five W E s say Pittsburgh's NPR News station the sound of a free friends\nHappening something's changing and it'll change back again I don't think it's a hoax I think there's probably a difference but I don't know that it's manmade I Will say this um I don't want to give trains and trillions of dollars I don't want to lose millions and millions of jobs I don't want to be put at a disadvantage\nOthers are pushing forward in fact they're fighting there saying that fighting climate change can be job producing and we're running out of time according to last week's Intergovernmental Panel on climate change there's just about a decade left\nTo take on President action to reduce to reduce the extreme impacts of climate change\nTheir report recommends reducing current emission being released into the atmosphere\nBut also capturing the carbon dioxide that's already out there what's known as negative and missions so let's take them with Gregory minute a professor of public affairs and environmental studies at the last ... school of public affairs at the University of Wisconsin Madison professor technologies will be needed to\nDo it using photos synthesis to take C. O. two out of the atmosphere and then store it into would in a tree or in plants that has the potential to remove\nBillions of tons of Syria to from the atmosphere so that's really appealing it all of these\nUh schemes to remove the uh to have negative have some concerns about them and the biggest one with planting more trees is that if you're planting trees um that's land that potentially could have been done something else with and if it's if that's something else is growing food\nUm that's a real concern because that's one of the biggest impacts of climate change is worrying about crop yields in the future\nAnd if we're going to have food prices go up because we're using land for food and using it to ... to a that's a negative a negative effect some things like growing trees that we think are pretty benign um have negative impacts because the scale has to be so large\nWell and also we know that dead trees only store carbon for so much for so long I'm it may not be long enough\n[noise] yeah there's a permanent issue with a story in the ... too and I'm\nIn trees that um if not such an issue for storing it underground for example\nOkay so let's move on to some of the other ideas carbon capture storage what are some of the ideas there\nSo the idea with carbon capture traditionally has been you take a a power plant that's using fossil fuels and instead of venting the CEO to into the atmosphere which is what we do now\nYou find a way to collect it in the flu gas and compress it put it in the pipeline and stored underground so that's a way to avoid the will to going into the atmosphere\nWith negative emissions there is a way you can actually remove CEO to the atmosphere using that scheme by\nAgain planting crops and instead of using the crops for food you would use them for energy it takes you to that's in the atmosphere\nPhotosynthesis will store that field too into the crops than you burn the crops and the power plant and instead of putting that seems to back into the atmosphere you're gonna do the same thing compress it and stored underground and that has the potential to remove\nA billions of tons of ... too and in this case stored underground where it tends to be more stable and will stay there as long as we needed to\nIt has a similar negative side effect that we had with planting trees in that you need to use a farm land for growing those crops so for using that land for\nCrops that we're going to use the stores here too and put it underground we're not using that for food and again that could uh Craig food security issues which is something we want to avoid what\nNot and by the way I\nStreaming on W E n J lauded by Carnegie Mellon university integrated innovation in the town on a master's program\nAt the end you dot edu flash I I I\nUsed a farm land for growing those crops so for using that land for crops that we're going to use the stores here too and put it underground we're not using that for food and again that could a Korean food security issues which is something we want to avoid what when\nAnd by the way I just said Steven Pinker is a terrific and provocative new book at night and it now and you know he talks about the fact that a lot of this is going to be on our technologies that we aren't you know we don't even have yet that we're going to come along but we're not just sucking it right out of the air\nYeah I mean that's an appealing one to do as well so this is using chemical process to use and you know we've already been doing this and things like submarines or space craft where you need to remove the ... to the humans are generating just by breathing\nAnd so the ideas could we do that at an industrial scale and capture CEO to that's in the air capture that's due to compress it and then store underground\nThat is appealing one of the most appealing aspects of that is it doesn't have this large land impact that almost every other one of the schemes has\nThe biggest downside so far has been it's been dismissed as a prohibitively expensive things so\nSomething like three or four times as expensive as these other schemes\nClimbed more educated switch to start up and they say the cost shift between six hundred and eight hundred for metric kind of C. O. two captured 'em get another company in Canada can protect crushing two hundred fifty per metric can fix catch expensive\nThat's expensive and just to put that into comparison if you look to kind of the average price of CEO to over the whole world now I think a number of about five dollars is about right there is other places it's high like in\nSweden and then the ... you've got prices in twenty to thirty dollars but overall it's about five so that's that's way higher like by a factor of a hundred\nBut I think what's interesting about the technology is is the concept come down so as you say claim works did this first the world's first demonstration plant a about a year ago and that was six hundred dollars per ton of see what to\nTheir next plan plants they're saying they can do for between a hundred and hundred and fifty dollars per ton of C. O. two\nThere's another company called carbon engineering in Canada that has things that can do it for about a hundred to two hundred there is a U.S company called the global thermostat\nThat uh is doing it the first demonstration in Alabama this year and they think that'll be about a hundred and fifty dollars per ton and they have plans to get it down to a hundred after that so this idea that the costs of technology makes it impossible and we should just um dismiss it\nIt seems to be I'm falling away as we look at some of these real plans being built without severe problems and with costs that seemed to be starting to come down so there is a potential to really get the costs down to make it affordable and not have the land use impacts\nOne of the biggest concerns that I Would have is to do this in a real way\nWe need to be removing billions of tons of CEO to by mid century um and so we need to be doing this on a large scale pretty soon right now so there's three companies we've mentioned that's it for the whole world in terms of commercial director or capture and I\nI think that adds up to about four hundred people in the world employed by these companies but that really doesn't fit with a scale that challenge we're facing so that's that's the real challenge for direct heir captures how you scale up from three companies doing on the order of five or six plants to something like that\nFried was slow free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nCommercial director or capture and I\nI think that adds up to about four hundred people in the world employed by these companies but that really doesn't fit with the scale the challenger facing so that's that's the real challenge for direct heir captures how you scale up from three companies doing on the order of five or six plants to\nSomething like six hundred thousand plants is which is what we're going to need and the next five or ten years\nSix hundred thousand well are you getting the investors excited about that\nThat that may be the future but look again Steven Pinker writes set the more speculative end of this kind of thinking includes plans to disperse pulverized rock it takes up CEO tuition weather's too at alkaline clouds of the oceans to dissolve or C. O. two in the water\nFertilize the ocean with iron to accelerate photosynthesis like plankton and again ... out of the atmosphere in different\nWays where do you say though to how her job I'm a fellow of seeing things at MIT who says in the fact that there's a danger that this might lead to complacency in reducing a sea of two emissions if people start thinking well we're just going to scrub it out of the atmosphere\nChecking and sustaining member because reporting of that nature\nComplete facts document to more correct fact is essential to my own decision making throughout the day\nHi I'm Steve snow Zach from region square please join me as a sustaining number so we can continue to be an foreign visit Wu said thought a phone on\nToday's program supported by St Edmunds academy or co educational independent school in squirrel hill dedicated to serve in the cognitive social and emotional needs of students in preschool through eighth grade\nInformation sessions are up to ... to November December eggs and December thirteenth registration at us at ... dot net [noise]\nLocal national global smoking weed five Wu said which works NPR News station [noise]\nSubscribe to our podcast and or assessment visits the essay on them\nIs Ninety point five FM W E essay and Ninety point five each one Pittsburgh Pittsburgh NPR News station streaming and da da da da da and\n\nFunding for here and now comes from that for the creators of that law to simulate software accelerating the pace of engineering and science you learn more men were not come from NPR and W. B. or Boston I'm Jeremy ...\nRather young hearing now coming up as President Trump visits hurricane ravaged Florida residents reflect on what they went to a motel owners next to college is sorry he didn't evacuate\nMonday for gold up each day and he had so much stress in his boys he\nLooks like we did the wrong thing I should just serve we did and he said there's really no these are\nAlso Sears filed for bankruptcy or are there lessons for Amazon and President Trump says I'm wrong killer in a conflict could be behind the disappearance of the Saudi journalist these stories and get ready for all the predictions about what's going to happen in the mid term but really how good are we of forecasting the future of\nThe room with expert predictions so often it heads I win tails you forget\nAbout coming up here in the news is\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nAmazon and President Trump says I'm wrong killer in a conflict could be behind the disappearance of the Saudi journalist these stories and get ready for all the predictions about what's going to happen in the mid term but really how good are we of forecasting the future of\nThe room with expert predictions so often it heads I win tails you forget about coming up here and now the news is first\nLive from NPR News in Washington I'm Lakshmi sang President Trump and first lady Melania Trump or spending the next few hours in Florida in Georgia being briefed on the hurricane recovery that Eglin air force base this afternoon Trump applauded what's been done so far off it\nYour\nLast week hurricane Michael roared ashore in Florida's panhandle is a destructive category for storm with one hundred fifty five miles per hour winds it level neighborhoods Mexico beach population of a thousand was nearly wiped out the hurricane Rick how they can for states from Florida to Virginia it killed at least Seventeen people\nA team of Turkish in Saudi investigators are searching the Saturday consulate in Istanbul, Turkey the scene of the disappearance and alleged murder of Saudi journalist earlier this month NPR's Peter Kenyon reports that officials continue to deny any involvement in a journalist is appearance\nIn the morning Turkish officials announced their intention to search the consulate as well as the Saudi consul general's residence and diplomatic vehicles but the surge didn't begin until after dark\nTurkish investigators have claimed the journalist ... was killed inside the consulate on October second and his buddy disposed of\nSaudi officials reject the allegations investigators focused on the arrival of Fifteen Saudis Istanbul on the day 'cause she'll be disappeared Dimon departed the same day Saudi officials say 'cause Yogi left because within an hour of arriving but it provided no evidence to back up the claim Peter Kenyon NPR News Istanbul\nThe Russian Orthodox church is breaking ties with the head of the global orthodox community\nAfter the accurate medical patriarch in of Constantinople decided to grant Ukrainian clerics independence from the church in Moscow for the first time and hundreds of years since Russia annexed Crimea from Ukraine in two thousand fourteen calls for the Ukrainian churches independence have intensified [noise]\nStrong winds and dry conditions have prompted Pacific gas and electric for the first time to shut off electricity for some of its customers to prevent wildfires in parts of northern California from member station ... in San Francisco Ted Goldberg has an update\nPie Jeannie has turned off power for some fifty nine thousand customers in three counties north of San Francisco and three other counties in the Sierra foothills the proactive electricity shut offs live some school districts to cancel classes for the day\nPG and E. which is the largest utility provider in northern California says the move is in the interests of safety at a last resort due to extreme weather conditions\nThe national weather services wind speeds reached Seventy seven miles per hour or two locations in the northern part of the bay area on Sunday evening over the summer Cal Fire announce it PG news electrical infrastructure cause at least a dozen fires in six counties last October\nFor NPR News I'm ... in San Francisco\nThe Dow Jones industrial average is up forty seven points this is NPR News\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more\nDreaming on W. E. N. say it's supported by Carnegie Mellon university's integrated\nInnovation Institute details on the master's program at\nCMU dot edu slash I I I [noise]\nSeven points this is NPR News\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nNPR and W. E. essay or on the radio today thanks to our listeners who give that tell W E essay works\nThe people who listen to it and invest in it by making a contribution during the membership drives you can join them by becoming a sustaining member at W. E. S. A. dot FM or call for one to six nine seven to nine five five good afternoon I'm ... year with Virginia Alvino young\nThanks so much probably so excited to be listening along to you on Ninety point five ... say no matter where you are and especially during this hour because we have a special special special offer in place just for the next about Fifteen minutes or so\nMaybe you've been meaning to get around to giving your contribution will now is the time because for the next twenty minutes\nYour contribution is going to be matched dollar for dollar and I know you know a good deal when you see one and this is going to make your contribution go twice as far\nFive dollars a month turns into ten dollars a month et cetera et cetera all that matters is that we hear from you in the next Fifteen minutes or so for one to six Ninety seven to nine five five or give on line the offers down there to W E s they'd rather than\nYou might be thinking my financial support won't make that much of a difference let me tell you it will W E essay was founded on the principle that listeners support no matter what the amount is is the most important source of station revenue\nSo joined other listeners who have given before you like Elizabeth in regents square she says now that I'm Out of grad school unemployed it's time for me to support the station that keeps me informed and keeps me company on my commute\nWhile as ... we're here with you on your commute and we'd like you to join Elizabeth by giving at for one to six nine seven to nine five five or W E S H ... more and more listeners\nAre choosing to become sustaining members as their first foray into membership\nThe way that that works is very easy you choose the amount and just let us know how you'd like to pay it and it's just going to automatically come out of your credit card or your banking account and don't forget that when you become a sustaining member that contribution is going to be matched dollar for dollar just for the ... next about Fifteen minutes\nIt takes only about two minutes however to make the call for one to six nine seven to nine to five five we'd love to hear from you again as you become a sustaining member of this hour W E s say that at then thanks so much\nFrom NPR and W. B. U. R. I'm Jeremy ... I'm Robyn Young it's here and now President Trump and visiting the Florida Panhandle today to see the devastation left behind by hurricane Michael Charles Smith in what was the small town of Mexico beach is grateful for the attention and they help from FEMA\nAs you know by now Mexico's beaches quaint no high rise hotels so Michaels direct hit nearly wiped it out Charles Smith owns what's left of the Gulf view motel it was destroyed in fact he's in Alabama now that's how far he says he had to drive to find a place to take a shower\nCharles we're so sorry for the destruction and also you state during the worst because you've been through hurricanes like open all so you didn't realize how bad Michael would be you must have been terrified\nUh yes ma'am I knew I was going to die or right before that it really it we'd had no electric circuit TV labor gold up each state but he is so much stress news Boulder she should\nFree to pursue the re to explore we're Ninety point five W yeah say It's NPR news thanks sound of a free press\nMy how bad Michael would be you must have been terrifying\nUh yes ma'am I'm very I knew I was gonna die or right before that it really hit we had no electric so I couldn't see the TV [noise]\nMy neighbor called up he said he had so much stress in his boy cease it looks like we did the wrong thing I said yes are we did\nAnd he said it looks like I said Yes sir I said it's been really good knowing you sir\n[noise] on the phone lines went dead held on for a bit\nI grabbed all my cats and took him down stairs put them in one of my rooms could I figure the roof you don't blow off the top\nWhen every winter the rooms the water started coming up under the door and around the side of the door\nNeighbor's house came through the front [noise] that I tried to get the cash out to put them in the stairwell but the water was too much I grabbed a hold the door knob it would not move it would not there was too much water pressure than the wall started collapsed in I was able to get one door open\nI grab one of my cats just threw it in the office they went up to the upstairs I went back down or the other ones\nAre the door slammed on me the water went up went from\nTwo feet to for\nTo float me after the roof and I got sucked into the laundry room with a four cats and then the fridge raider hit me because everything is ... you you take everything that floats and put it right about four feet where you're at and it's not staying in steel\nTwice as far as they don't leave any money on the table we'd love to hear from me right now for one to six nine seven to nine five five were given line W. has they'd done at them\nMore and more listeners are choosing sustaining membership designating a set amount of your budget each month is an affordable way to support all of your favorite programs and make sure that we have the money it takes to keep bringing them to you and giving a little money every month is the best way to maintain a strong future for the station and the programs you love\nSo give ten or twenty dollars a month now it for one to six nine seven to nine five five or W E S H ... and if you choose that\nTen dollars a month of what's right for you and what's right for your budget guess what that is going to turn into twenty dollars a month when you give right now it just takes a few minutes to do and\nThat was the best time don't let this sit there on your to do list for the rest of the week 'cause this match isn't going to be here forever so if you've been meaning to give her you'd like to upgrade your existing sustaining membership now's the time to do it\nFor one to six nine seven to nine five five is the number to call again that match in play for just a few more minutes this afternoon or go ahead and give on line it's easy to do maybe you're they're listening already go ahead and click on the donate now button at W. E. S. A. done at them and they tend to Ninety point five ... ... E S a news thank you\nFunding for here and now comes from the listeners of W. B. U. R. Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance available at\nGeico dot com or one eight hundred nine four seven auto\nThis year and now the midterms are three weeks away and pundits and politicians are working hard to make predictions about how they'll turn out we often look for predictions tell us what will happen in politics and the economy of technology and another things but as the saying goes making predictions is hard especially about the future\nSo how do you do it well joining us now is ...\nRead it for free to explore we're Ninety forty five ... W E essay ... NPR News the sound of a free friend\nThe midterms are three weeks away and pundits and politicians are working hard to make predictions about how they'll turn out we often look for predictions tell us what will happen in politics and the economy and technology and in other things but as the saying goes making predictions is hard especially about the future\nSo how do you do it well joining us now is Dan gardener who is the author of future babble and super forecasting the art and science of production Dan welcome\nHi Jeremy so why is it that we humans always want to know what's gonna happen in the future when it's really hard to do that in a lot of ways\nYeah uh it really stems from\nA really fundamental need we have a need a psychologically rooted need for control a sense of control of our environment\nAnd what do you need for control of your environment you need to know you need to know what's happening now or if you're looking into the future you need to know what's going to happen and if you look into the future\nAnd you've got important questions on your mind and all you see as a swirling vortex of uncertainty that's deeply disturbing you have to our race that uncertainty and one way that we erase uncertainty is by turning to experts and saying please tell me what can happen next\nOne the experts that I think of when it comes to productions that get it pretty right at least in the not too distant future our weather forecasters yeah I have an app that tells me in ten minutes it's going to start raining exactly where you are right now um but you know where are we good at it and where we bad at it\nWell it's interesting that you highlight weather forecasters because of course people tend to make jokes about weather forecasts as they always get things wrong yeah ... exactly the opposite in fact weather forecasting is the gold standard of forecasting\nNow the big difference between the weather forecasters in one of the reasons why they're so good\nAnd so many other domains [noise] is it the weather forecasters know how good they are and they know when they cannot do so many other demeans that's not true people use vague language like something's probably going to happen or that's pretty certain or there's a good chance that [noise]\nUh and nobody keeps track they do keep score and so if you look at\nThe big famous pundits who tend to dominate the news whether it's politics or economics or anything else [noise] um they don't actually have proven track record scientifically scored track records we don't know how accurate they are in the same way that we know how good a baseball player is by looking at his batting average\nIn is the goal of a forecast to change the future to be able to make a decision once you know what's gonna happen or once you think you know what's going to happen that will change the outcome\nThis is an absolutely essential point very often when you talked about forecasting people talk about well how do you make an accurate forecast but very very often when forecasts are made\nIt's not actually accuracy the people are interested in there all sorts of other reasons why people make forecasts so you know a pundit on television might be making a forecast because it's ideologically congenial for the audience that very often happens\nOr they might be making a forecast because it's shocking and it's interesting and entertaining [noise]\nUm there's all sorts of these other competing interests and one of those is to cause change so for example if I warned that some terrible thing is about to happen it's not necessarily that I Believe that is in fact the case\nIt may be that I'm trying to spur others to action in order to prevent this suppose a catastrophe [noise] um so\nRead it for free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free friend\nCompeting interests and one of those is to cause change so for example if I warned that some terrible thing is about to happen it's not necessarily that I Believe that is in fact the case\nIt may be that I'm trying to spur others to action in order to prevent this suppose a catastrophe [noise]\nUm so we have to be careful when we're looking at a forecast we have to ask ourselves is this person just trying to get me to straight goods to be as accurate as possible or do they have other interests at stake\nWhat are some big flops some production failures that stand out in your memory\nWell I always liked to say that the Nineteen seventies where the golden era of failed predictions um it started really making sixty eight with the population bomb by Paul Ehrlich was a huge bestseller basically said that there will be mass global starvation within a couple of decades [noise]\nWrong or and then the Nineteen seventies were absolutely stuffed with the most amazing forecasts and and happily for humanity most of those forecasts which were wrong we're all ... they all said we're going to run out of oil [noise] um\nWell it reminds me of Y. two K. right that we all thought the world is going to end with two thousand came along and nothing happened\nThat's that's exactly right Y. two K. was another one there is a very long litany of these things but you know a one of the unfortunate aspects about forecasting is this\nIf I go back to old forecasts and say hey do you remember what that guy said ten years ago well let's take a look at what happened and it turns out it's wrong\nI can tell you from experience that people kinda yawn because it's an old forecast who cares about old forecasts old forecasts are old news but if time passes and somebody's forecast happens to be right\nThen they will be introduced as a person who got it right and we all have to listen to this person because there and tell us what's gonna happen next and as a result the rule with expert predictions so often is heads I win tails you forget we had a bat\nRight well you think about that every time somebody who figured out that President Trump was going to win when much of the media thought that he would not when a when he did win you know there are a few journalists out there like I said at look at my tweet from you know two months ago I said it was going to happen\nYou up and you know look it's a there's an old saying about me a mutual funds you know you start\nFive hundred mutual funds and you to bet on all sorts of different stocks and ... by sheer happenstance one or two of them will hit big and then you hold up your one or two that had big and you say look at this what a brilliant invest right and well forecast very often function like that you can't judge the quality of a forecaster by a single forecast\nThat stand gardener who is author of the book future battle and coauthor of super forecasting the art and science of production Dan thank you so much for joining us\nThank you well let us know what you think of forecast political and otherwise here and now dot org the famous Santa Ana winds blew into Southern California today prompting the national weather service to issue a red alert for fire danger\nIn late July the Carr Fire swept through parts of the city of reading and the surrounding area and today residents are faced with burned hillsides and more than a thousand homes sites contaminated with toxic ash Liam Moriarty from Jefferson public radio reports [noise]\nI'm just off keswick dam road under western edge of renting the Carr Fire blasted through this neighborhood on the evening of July twenty six incentive reading dozens of homes on this date accrue in white hazmat suits and respirators as methodically sifting through the ash and rubble Ivan Rodriguez the California Department of toxic substances control says\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sounds of a free press\n[noise] I'm just off keswick dam road on the western edge of renting the Carr Fire blasted through this neighborhood on the evening of July twenty six incentive rating dozens of homes on this date accrue in white hazmat suits and respirators as methodically sifting through the ash and rubble five\nIn Rodriguez the California Department of toxic substances control says this is phase one of the clean up\nThat entails screening the properties that have been devastated by the fire and looking at household hazardous waste that needs to be removed to allow for the ash and debris to go off in the future time\nRodriguez says the typical American home contains a whole range of products that can cause toxic contamination after a fire\nFor looking for the first got cylinders but looking for batteries looking for any paints any solving many pesticides herbicides\nHazmat workers are marking what they find with spray paint to signal the removal crews white paint for propane tanks and other standard hazardous waste pink first pestis which requires its own special removal techniques\nOnce phase one is complete crews will collect the ash in rubble including the building's foundation and hold it all off to a hazardous waste facility\nThe danger of toxic gas blowing across the landscape gives this job or sense of urgency but there are other post fire threat says well\nOn the back deck of my house Daniel Whitley a standing behind his home in the lake reading his state's neighborhood where many homes were damaged or destroyed Whitley was nearly one of them were looking at the remnants of the Carr Fire that\nCame a pair of sleep close to the back of the house as he points to the burn hillside right out is back door he talks about his plans to head off the erosion that winter rains are likely to\nCause I'll put in some straw bottles those long stalled failed flexible things and then I'm going to plant some a perennial bunch grasses up their Whitley says if he can get the grasses established before winter he thinks he can avoid potential mudslides\nQuarter of locations that were opened in twenty twelve you're listening to hear it now [noise]\n\nW E s a U.S supported by the Westmoreland museum of American art hosting the big ... green on Saturday October twenty of the event celebrating heart and in nature includes performances by hand clinic at the ensemble and Jim Donovan in the sun king warriors the evening supports the museum's exhibition and education programs tickets at Westmoreland dot org\n[noise] this is the sound of a free press free to present the facts feed to pursue the truth from commercial and political influence free because if your support call for one to six nine seven to nine five five or give on line at W. E. S. A. dot F. M.\nW. E. S. A. you supported by chat um university Chatham is hosting a graduate open house edits eating whole campus for programs and sustainability and food studies on Sunday October twenty first the open houses followed by the sustainability and the future of food\nConference open to the public details at Chatham dot edu\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station\nFrom carbon I'd offering secure data protection solutions for growing businesses including automatic back up for services in computers high availability and disaster recovery solutions and automated data migration learn more carbon I dot com\nAnd Geico offering auto insurance coverage for cars trucks or SUVs and providing twenty four seven customer service more information on auto insurance at ... dot com or one eight hundred nine force\nFree to explore free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sounds of a free press\nIs highly availability and disaster recovery solutions an automated data migration learn more carbon I dot com\nAnd Geico offering auto insurance coverage for cars trucks or SUVs and providing twenty four seven customer service more information on auto insurance at ... dot com or one eight hundred nine four seven auto\nIt here and now a quick but important correction in our conversation with the BBC's Jeremy bone on friday he said that Israel shutdown that Russian jet over Syria in September\nNow the Kremlin did initially blamed the incident on Israel but later attributed it to a chain of tragic circumstances and said Syrian forces accidently shot down the Russian plane killing all of the Fifteen Russian service members on board\nSo we regret that error\nAnd now looking ahead election day is twenty two days away and there's a big race for governor in the smallest state in Rhode Island the incumbent Democrat Gina Raimondo is up against the Republican Allen Fung reminder beat songs four years ago\nAnd in this year's rematch the economy is still front and center here now is Peter O'Dowd reports\n[noise]\nLike Salvador tool in finding in Providence are remnants of Rhode Island's ones glittering manufacturing industry\nKimberly Salvador's on the factory floor of a family business the jewelry or workers or there'll be no middle will be sold over\nShe's taken is the [noise] and\nShe just Paris out fast so now\nA chunk of metal sort of in between the demo for flowers are out there and being a big chunk of metal through a ...\nIt'll ... it'll it'll cut the outline and they'll cut all in between\nA few decades ago as much as eighty percent of the costume jewelry sold in the U.S was made here in Providence and a third of the state's workforce had a job and manufacturing where globalization and the great recession nearly wiped out Rhode Island's famed industry\nIt has a reputation\nBeing that costume jewelry capital of the world\nIn the twenty [noise]\nThis area\nWent from a textile industry into\nManufacturing jewelry part and finding and those textile mills became the factory the building that we're in right now was a textile mill and then it was a bakery and now it is\nIt was stage manufacturing a company that we purchase\nThis was the industry in Rhode Island\nHow it is still the industry interested I changed a lot of it has changed a lot\nA lot of people would say then you factoring in the U. at you know has diminished and my response to that is there was a time when we struggled\nAnyone you talk to that knows anything will say it's coming back\nThat people aren't that satisfied with going overseas and they prefer to have something that in the usa\nAre you happy with the direction of the state of going\nI think we could do better um but I think that gets into politics and I'm not going there\nFor the politicians are\nWhen I ran for governor we had one of the highest unemployment rate in the country\nAt a recent debate Gina Raimondo took credit for bringing in Rhode Island out of the recession\nFor most of the year that Iran we had the the highest unemployment rate in the country and in some industries like the building trades unemployment was over\nFree to explore free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nFor the politicians\nAre when I ran for governor we had one of the highest unemployment rate in the country\nAt a recent debate Gina Raimondo took credit for bringing in Rhode Island out of the recession in\nFor most of the year that Iran we had the the highest unemployment rate in the country and in some industries like the building trades unemployment was over twenty percent people who are hurting so I did get to work and I got to hurt changing the way we do economic development\nWhat she means is tax breaks Raimondo lured big companies like Johnson Johnson and a division of G. E. with generous financial incentives her opponent Alan from who was mayor of the city of Cranston is not impressed\nWith cultured the governor's subscribe to a corporate welfare [noise] those millions that have been given for many a development\nProduce only a few construction job no long term jobs that's going to be dramatically reformed and many of those millions are going to be caught\nAnd fun has his own challenges in this blue state he has to tout his conservative credentials without hewing too closely to President Trump and then there's this wild card\nIn denial knowledge and draw from Mr\nI Want to draw votes from the vote for\nJoe shrill oh he's running as an independent and he could get a big chunk of conservative votes at phones expense for low was the chair of President Trump's twenty sixteen campaign in Rhode Island\nAre not in it as a ...\nGreat in their in their eyes into a mutt [laughter] I'm tired of the party politics\nSo how will those three candidates do in the race is more\nTo get some answers to that question I went to this very busy street corner in downtown Providence of course the it's the capital of this tiny little state\nAnd I asked Maureen mostly for some guy that she's a political scientist and she's been following politics in this state for a very long time I've lived in Rhode Island to thirty three years where you know the lay of the land\nIs pretty much yeah why did you bring me right here in this spot in downtown\nProvidence I thought if we were talking about this race this would be a good place to illustrate some of the changes that have gone on in the past um decades say we were in worse shape\nAfter and during the recession we were at the bottom\nWe were the last to come out of the recession no I've heard this a couple of times talking to Rhode islanders you were the first to go in and you were one of the last to come out right and I think that's because we had a a workforce that was relatively uh on train for new technology but up until fairly recently\nThey were able to make a living in manufacturing\nFatah cottages down the shore and things like that\nBut all that changed you know in the eighties and nineties and so when the recession hit we really weren't prepared\nIt it it really hit us Gary Hart how much did that pain affect the political psyche of the people here\nI think they were pretty cynical about politics that had been\nSo long at a disadvantage economically and people people are promised things and not a lot of big changes occurred\nIn addition to that there was a sort of a Hail Mary pass made by the last administration a Republican administration that attempted to a fund which state funds are gaining sort of video games for Curt Schilling that went bust\nScreaming on W E n J imported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nWould change is a curse in addition to that there was a sort of a Hail Mary pass made by the last administration Republican administration said attempted to a fund which said funds are gaining sort of video games will Curt Schilling\nWent costing the Boston Red Sox pitcher for the Boston Red Sox Fisher it cost us like you know over like Ninety million dollars initially we\nThat really gave people like jaded suspected on economic development and what people were doing so added to the you know the the long downturn sort of deep recession we had this was an attempt to pull us out and\nIt failed and it left\nPeople pretty cynical and yet here we are today twenty Eighteen we're about to come up on the mid term elections in a big gubernatorial election here in Rhode Island\nAnd we see construction crews here was harder work on projects right well\nThe thing is we are in a good spot now in other words we have come out of this recession unemployment numbers are above the national average I think that's why you see all the trains in the sky and so forth\nLet's talk about Alan fun he is a Republican and the polls do show ram onto ahead but not by that much is that a surprise to you in a blue state like\nThis is going to be an interesting race it's not going to be a cakewalk for gain a reminder she's going to have to work really hard and she's gonna have to get out of her voters so in that sense I Am not surprised there are people in this day who are concerned about old Rhode Island what it was like ... and Alan songs message resonates with them\nGot a good story he's got a good story he's the son of Chinese immigrants he worked in a um Chinese restaurant they went to the local college where she is yeah Harvard roads are so very very different picture", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Pittsburgh", "day": "15"}