{"month": "10", "state": "NY", "station": "WRUR", "content": "And I just\nVine well\nThe ads on the phone was barely\nKnow a lot of money on my last job\nMoment on line and then on the side\nGave me the money\nAnd he was going to be there and within\nAbout what has gone on\nThere's got to know that we'll see those young ... on\nLine and these little levine on on\nTime so you want to have you on the phone last year\nAnd I just turned out I mean what\nDa da da da da da da da da da da da da da da da da da\nDa\n\n\nDa da da\n\nDa da\nDa da da da da da da da da\nDa da\nDun\nDun dun\nDun\nDun [noise] not\nAll [laughter]\n\n[noise]\n[noise]\n[noise]\nI'm Josh ... and this is the Latin alternative na\n\nI'm Josh ... for the Latin alternative the technical producer is Dave my coach for WBFO the Latin alternative to the production of Josh nor can an exit Ninety\nSeven seven W. E. X. feet after damn York a listener supported service of W. M. H. T.\n\nIt's ... it's got to be like I said I'm here with you with some great music lined up for this next hour we'll hear from Sean Coleman Brett damning\nAnd first lord who is it twenty two year old New Zealand singer songwriter she began performing in her early teens hears lord\nI make the somebody else's God\nWe're already seeing at the same God\nI don't know that no one is going to\nThink he loves the damn\nThose great why they have the the\nYou know what you will always be in the\n... you might know boy did it right now we can let me get like a ball and then I\nI mean there\nKnow\n\nShould get\nBack you know [laughter] just yeah\nAnd the magnet [laughter] sometimes\nDo we do that in that they knew\nI was just like just dating back to you\nShow they buy shoe that you read the and I'm\nI eat and\nKnow\nBut on the on\n\nJump yeah my name is ... [laughter] I Can't\nI Can't [laughter] you don't get time\n... ... pm\n[noise]\n\n\n\n\nCelebrating fifty years and the music business that's candy ... with what's so funny about peace love and understanding and ... song from Nineteen Seventy four\nIn front of that was Sean calls and would give me a little sign and that's one of the songs from my background I loved that San I remember always playing it in the Juke boxes\nThat was written by printing woods and others and released in Nineteen sixty seven\nAnd it was bothered John misty with date night and lord with green light you're listening to undo currents I'm Jason is bailing Cusick all are in the back burners but first from Seattle, Washington here's Ivan and now you\nKnow\n... ... yeah ...\nYeah I'm a mom oh why don't\nYou know to me it was good\nTo say\nThe the\nWell the ... no no no no no no to the dog ... ...\n... yeah the king no Donald\nAs they can do right\nNow I'm a foreigner play a mom\nA way that no\nNo no no I'm not a good day love but you\nKnow the name of\nGod have\nMade the right and you\nKnow the right\nWay and see the thing with\nA sly a ball and you're All right\n... so now that I don't do the job may be a little ... mile long\nYeah king no ...\nAnd they give to write\nEl ... Iowa mom\n... back home Mm\nRange out some of the ... a lot and\n\nI never had the chance to say well now I\nDon't know so that was the power to the dog ... miles long\nYeah yeah yeah the king though um\nMay give do ...\nI'm not by the man while\nI'm a way that well\nYou know\nMom no way that I'm\nDoing ... ... ... [noise]\n[noise]\n\n\n[noise] [noise] for five\nHalf hour\nDrive from\nWhere [noise] mine's right\nThere [noise] early on in on our\n\nYeah\n[noise] well\nFor\n[laughter] hiring here Russia\n\nNa na na\n\nNa\nMany I mean\n...\n\n\nNo no\nWay [laughter]\n[noise]\nUp on\nMaybe if you don't really know where he can be\nShown on yeah\nSure\nStrong\n\nAnd\n[noise]\n\n... na na na\nNa\nNa na\nNa ... calls a day\nAnd\nHer\nGood day\nA\n\n[noise]\n\nI\nAnd [noise]\n\n[noise]\n...\nGames will be doing Lynn will do polls city do\nYou do you know\nNew book is a long\n... the man\nIt was very you\nKnow insurance on the [noise]\nLate in the morning I'm\nOlder than ... ... young daughter\nGoing\nWay ...\nThe\n\nWe\nAlso know\n\nWe were on and\nWe're in\nIn the early on\n\n[noise]\n\nUh this is ... and you're listening to undercurrents\nYou pay the\nBill and then they and they did in\nIraq and ... ... ... ... my mom and on the radio or ... or\n...\n... I'm In\nThe dark Web\n\nBois whoa\n...\n...\n... ... ... ... ... ... oh no it\nOn\nAnd ...\n[noise]\n[noise]\nNah\nMen were run\nRead that mhm and\n...\nShort on my mom or dad or your mom your mom or dad or mom mom or your\nMom\n\n[noise] na na\nNa na na\nOh\nOoh\nWe\nCan't be\nShot in a\nTerms of the\nSome some now become\n\nWe we we\nDog shot\nCan\n\nAll\nWould\nUnder [noise] [laughter]\n[noise]\n[noise]\n[noise] [noise]\n[laughter]\n[noise]\n[noise]\n\nOh [laughter]\n\n[noise]\nThat and start [laughter]\n\n[noise]\n[noise]\n[noise]\n[noise] [laughter] [noise]\n[laughter]\nThat's a Billy and the king bees with bang go from the complete Stax volt singles Nineteen fifty nine to Nineteen sixty eight it was Jim go steam and truth Jones on that occurrence with live with yourself\nNicole hard in any piper brought us Catholics you go and Shannon McNally was at the top of that set with role in the way the stone\nIt's been a pleasure being with you this last hour thanks for sticking around for more details about what you heard check the playlist out at undercurrents radio dot net this issue number forty seven fifty three\nThanks to Greg me quicker Christina on his dad and Joe Yuri I'm kind of do you like us that on\nA new currency is made possible by your support thank you and by the corporation for public broadcasting and and be one stations like K. U. W. J. in Jackson, Wyoming and W. CJ be in Hayward, Wisconsin this is native voice won the\nAmerican radio where\n\n\n\n\n\n\n\nThis is your for your call this a ... that's ... Russia's free\n\nYour hopes for a studio is what the cost for the new one comes from the weakest link that in\n\n\nThe morning at five on where you are you are after the Rochester\n\n\n\n\n\n\n\n\n\n\nThe train [noise]\nGain little [noise]\nAnd there is a [noise]\n\n\nI'm sure the\n[noise]\n\n[noise]\nThat's Canadian native artist gesture night and the wind with this non history he's usually running his catering business called gesture nights panic bistro but when the idol no more protests grew he felt a powerful urge to pick up his guitar again and communicate with these people\nLast Train in front of that from Alaska with hush now\nRegina Carter gave us trapping ... is Bronx brought us love sick and future elevators started that sat with machine maker\nIt's undercurrents I'm ... born in Philadelphia and raised in Georgia here's Frank stay with the new ones from an album produced in Nashville here take it back to Georgia [laughter]\n\n[noise] [noise]\n\n[noise]\nGo about growing you know you go\nAbout me she earned it in the ... where\n\n\n\n\nAre you do your driver during this girl\nThere wouldn't Brittany oh no\nNo\nBut Joe [noise]\nIn construction but then the\n\n\n\n[noise]\nWell started new I ...\nI Believe people staying in the current news\nOn the\nStreet in\nThey want to start\nI've been doing this on\nYou\n\nNot going to get back to your job\nI bought\nOn your back yard\nIn\nNo presents a\nA yawn\n[noise]\n[noise]\n\n\n\n\n\nHello this is Francesca shock an undercurrent\n... ... ... ... ... ... ... ... ... Mm Mm Mm Mm\nMm Mm yeah I just ... ... ... there's been no Mm\nMm Mm Mm Mm Mm Mm Mm Mm Mm\nEnergy and the\nOnly ... yeah\n...\nIt was Mm\nYeah na na\nNa na\nNa na na\n\nNa\nNa na na na na\nThat China and Don how bad it was you know\nThey're not they know the\nI Know that when\nNo way there\n...\n... ... ... ... ...\nI'm just walking know something about it and I don't mean no\nCars no talking to\nDo the same\nThing\nIn his family\nMhm\nLong\nAs much\nAs you know the\nEngine plane\nAnd I'm told to do and\n\nIn the\nNa na\n[noise]\nThey tell me I can choose\nIn the early ...\nNot pay attention\nHe did the\nNa\nNa na na na\nHe did he\nThe nine\n\n\nA you know\nGive me my well\nYou can do you\nFainted being then and then\nThem\n... the\nHave been\nNa na na na\nNa na\nNa\nTown\n[noise]\n[noise]\n\n... oh yeah\nSure we'll see\nYeah their mom cook a smile\n... oh yeah well [noise]\nNa\nNa na\nNa na na na\nNa na or\n[noise] [noise] [laughter]\n\nWell Mm Mm Mm Mm Mm Mm Mm no\nNo no no no no no\nNo no no no no no you know he\n[laughter] [noise]\nNo no no [noise] and uh [noise] uh no\nI'm In\nAge ...\nOr ...\n\n... or um [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] um for a little bit more [noise]\nKnow [noise]\nUm [noise]\n\n...\nAnd then [laughter]\n\n\n[laughter]\n\nOh [laughter] oh\n\n\n[noise]\n\n\n\n\nJimi Hendrix with jungle\nIt was Michele I'm Alone on that occurrence Smith match the door from or two thousand Seventeen release slings and arrows and Willie Nelson in family gave us let's face the music and dance\nAnother hour has come to a close it's been my pleasure to be with you this last hour bringing you some tunes that I picked out if you heard something that you'd like to look up check out the playlist at undercurrents radio dot net does his show number forty seven fifty three\nThanks to Greg Nick vicar Christina on his dad and Joe Yuri I'm going to be like I stayed on\nUndercurrents is made possible by your support and the corporation for public broadcasting and envy one stations like K. R. T. S. in ... Texas and W. M. O. T. in Murfreesboro Nashville, Tennessee\nThis is native voice won the Native American radio network\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise] oh oh oh\n\nMaybe we\nOught to be with them when they needed\nNot only breast visits the mountain stage this week along with you so you're more like red wanting blue and Todd ... Hi this is Natalie Press joined me this week in live performance on mountain\nThis afternoon at two on different radio W are you are and W. I. D. H.\nLegal case found out her house is in line on fire the same day she was in Sweden recording a song called all things bad luck sneaker told her engineer she wasn't sure about this one and he said well maybe that's what a person sounds like when their house Bruce does he go case performed live in an encore edition of the next World Cafe\nTomorrow afternoon at two on W. R. U. R. FM an HD Rochester\nIt's under ... you know like I said I'm here with you with some great music coming up including songs by eyes Lee brothers and Santana\nRodney crowd and Elvis Costello and the and pastors\nLet's start out with a five time Grammy Award winning gospel group that first got together in Nineteen thirty nine they met as children in school for the blind here's the blind boys of Alabama on undercurrents\nYou know no ... by their you know about Adam oh well you know long written a lot of those drone\nJudge oh no no well you know as long as they did not I don't know I'm I'm a\nHundred and four hundred and ... and ... ... ... ... ... ... ... ... ... ... ... ... ... members in terms\nOf you guys were real little winning land just learned to bring in your branch ... do ... in the Bronx river we shouldn't be bombarded with Don Reid is you're willing to run into a little bit more and more broad\n... and\nAdam oh ... you know a lot of those drones you're right you're wrong drop their kids now you know where to draw a\nDon't trigger word is ... ... ... you can do to June ... ... ... ... you know ...\n... ... usually be we're not really were ... years\nOld burn about that Adam oh right\nUm but it was about but there are those jobs go you know there there are all wrong really read it at all they do Brett you heard about the old you know ... ... oh where do they know where to draw the line there are no no\nThat that bothered well read about that oh I don't know what they read about the bailout those girl you're from\nThe judge Joe how good at all or from the rabbit go first or do\nYou remember\nYou know ... if I got out a ball where the rubble Rudy oh\n\nTo draw\nThe line [noise] some of the way around\nTo count down when was the most it to come from the meeting that attack just about to get them to the pre don't be predominantly three o'clock in the shorter than what can I talk with Michael Jordan when I've been in the car when she was trying to lay there and it might\nYou can [noise] in the Rio secretary can we do that because of the which are calling them in the back then but\nThen they had planned for this coverage on to the caller Jay was actually the town everybody wants to buy what you put the harder\nWhen\nOn the shining down [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[laughter]\nMm\nMm\nWhat a great composition that with higher ground from the eyes Lee brothers and Santana two thousand Seventeen release power of peace it was native artist Mickey Free in front of that with greens and barbecue\nHalo circus with oh money and the blind boys of Alabama with Jesus hits like the atom bomb\nIt's undercurrents I'm ... Rodney Crowell is coming up soon but first let's hear from Murray Porter\nA mohawk turtle clan Native American artist who was born and raised on the six nations at the grand river territory in southern Ontario this is what's been said about him he's a rich man singing the black man's blues leaving in a white man's world [noise]\n\n[noise] [noise] ... ...\n... your ... your ...\nYour ...\n...\n... ...\n... you're very welcome ...\nYeah [noise] [noise]\n... ... people\n...\nMan on a\nBeer beer you know the dog was very you know\nAnd again\nA bird drew Carey around them were\nDirty barrier America\nYou and your ... or ...\n\nOr a bird\n\nThere were\nWe're going to go over\n...\nThey're going to be for the dog\nBetween\n... game now ... and you need\n[noise]\nThe\nNew paper\nMan you know\nThey may go on\nI'm not a\nGood game ...\nDirty\nBombs that were very been very\nVery\nHow are you there you\nHave to do now you know\nNa\nNa\n\n\nNa na\nThan\nThan\nThey are\n\nTerrorist ...\nAround\nMe\nAnd my father and the\nShows me\n\nThe day and oh my God it at a\nBanker and we're waiting for\nAnd we're in the under the\nNine ...\nThere are a\nGame of them do the jobs that are around\nAnd\nOr rather do\nAround a quarter\nOf a\nGoing on around\nMinus ...\nMy\nMaybe even better just rather grill thanks for listening to under current\nYou know a lot about it all on it all up you portray like gone\n...\n\n[noise]\n\n[noise]\n[laughter]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[laughter]\n\nMm Mm Mm\nDo you mean bringing him a little money and then on to a yearly bringing or they do I you know what I mean she asked me my daughter to lay down\nThe stairs and we ... all the needles are a very soldier go Rio\nJaneiro in in in ...\nIn in\nJanuary I bullied you guys very bold in and do they do\nDoor when the other day on the night through in Russia and clearly and I went into the middle of the night eternal shining really ... me in the general\nHeroes ... all the little guy very bold and into the hole\nSheen to learn more about him right all imitations engineering label machine Julianne Moore joined up right away and\nThen when\nThey go to Jerry calling Italy I Do that in Rio de\nThe ... really was a very stable ... or ... or\nHear a little leery closer to the radio\nIn the unlikely gotcha remain and very ... and we got a job and we made a very late at night and I got a job that I said I Love to go at a naval aviator a voting needle the very first\nThere's a dark Rio de\n...\nMm\nI Know we lead to the break you know what what do you know we need to the big big deal but what do you\nKnow I mean the middle of the leading me to me I bully do dining area bones if you don't really know\nI'm when we're talking about by again when I'm when he passed by it can be when he married and\nWere made jewelry my only people die very bomb did you do real\n\nUndercurrent according [noise]\nThey choose new\n\n\nI\nRight now isn't it true Albany advantages\nTo the law\nYou lose your\nDad used to be a long way to\nLearn how to delete readers very loud\nDesigned ... local paper but we\nBe nothing then become\nThen now I'm\nNot very good\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[laughter]\nCoastline revival cosmic three the city it was the reference Sean Amos on a decrease which we've got to come together and Alvin ... gave us something smells monkey around here\nWith Alex ... at the top but that said we will keep\nIts currents I've got to be and it's been a pleasure being with you this last hour for more details about anything you heard which are curious about the plane they stopped at a decrease radio dot net just to show numbers forty fifty three\nThings to correct me sicker casino honesty and Jim Carrey I passed it on\nI just made possible by your support the corporation for public broadcasting and it'd be one stations like W insist attend South Dakota and WPN L. P. in Philadelphia, Pennsylvania\nThis is native voice wind the Native American radio\n... ... ... ... ... ... ...\n... ... ... ... ... [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\nYou\nKnow this is the mountains to the urgency system\n[noise] [noise] [noise]\n\nIt's got like ...\nYeah we hear the next hour bringing you some great music that I picked out we've got the war on drugs coming at least the hill jak brown Curtis saddle and more\nLet's get the ball rolling with a six piece band playing primarily Latin hip hop and rock music they were formed in Nineteen Ninety five in Los Angeles here also my money on a degree\n[noise]\nStrange well and the the thing to say and toning depends on the news shows you know there's no way you can do much good luck for you for\nBeat them money to\n\nHe managed to change the children's\nGet to the shortage do\nThey still do sign\nCharges that may\nAnd still don't have\n[noise] enjoy\n...\n... minutes they win or lose the old\nTo move it in attacks on the beach all\nThe money may have changed the paper in the train and they were in your pocket like the letter then you get in on\nMeeting for the money to\nMoney the same\n[noise]\nFor the call in the world is going on but you know we've got to run it will be\nBringing all those people that you won't be able to do when they want a minute because they'll run that go on the open those who do other doubles in your book called New York are you going to be when they want you to do that\nEvery all the people that will not Tom bio gardening do right by the time where\nIt go out on\nThan better and I'm like oh\nWhat's your middle general rather than rather go radical\nDue to a beautiful little\nYou think I'm using one of the Iraq Iran they charge ever read I read and then we'll\nYou want people don't\nTo cut the ribbon labs you wander around now I Will do a lot of you are\nIn the April\n\nJoker oh goodness that tomorrow\nWe're\nGoing to die you know much about how why did I was barred\nBy that I don't know\nAbout that it will be better and I fly ball Milo\nAmerican and we don't want\nThen they do what we think\n\nNow that are bad and my mom said oh I'm a radical guy will\nBe done but rather call better God and not by\nBy like whoa\nThat was sudden rush between Willie Cain with the roots radical birth of Chicago gave us that actual rate Bonneville brought us next card to fall off his new album ... electric released in two thousand Eighteen and also mildly brought us it's only paper\nYou're listening to undo currents I'm ... coming up soon the war on drugs and the free tell us but first here's Carolyn rose this record with hand over four years ago well rose was living in advance traveling the country here's Jeannie becomes a mom\nIn in in\n... in in in in in in\nIn\n\nAnd then and then they didn't\nGet it in the beginning\nThen and then in in a corner of the\nName of\nThe game\nThat I made every\nDay a\n\nWhen we were being late in the name of it\nIn early ... when\nA little bit and then being made in the you\n\n\n\n\n\nSupport for double you argue our digital media comes from our members\nFrom capital ... a small batch come boots your brewery located on railroad straight were fermentation meets labor like ginger beat and more open to the public on Saturdays from tend to growl are available to go on line at cat ... dot com\n\nFor a change in\n\nNa na na na\n\nNa na\nNa na I\nWell I just don't know why is oh\nI just don't know\nWell yeah\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] I\nMean he would be [noise]\nNo not in the day came\nTo the gym\nAnd do this ...\nThis road then yeah you know in the world\nLeaders\nYou\nKnow and what\nNot\nYou know the\nReason for them to maintain the\n\nBaby boom and anything [noise]\n[noise]\n[noise] [noise]\n\n\nHow are you going on [noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\nThe new\n\n\nLiving\nIt within the\nComes on and\nOn a limb and say\n\nAround here\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\nExactly what are\n\nYou looking to the mall or\nAny other way\nThat we cannot coordinate not oh well the cradle\nNa na na na na na na na na na na na na na na na na na na na na na na na na\nNa na na na na na na na na na na na\nNa na na na\nNa na na\nA balanced diet\nIf you go let me [noise]\n\nThat was not a man you know and if you mean when we pull out and do not when my when\nMy [noise]\n[noise]\n\n[noise]\n\n\nAnd then again he Hi John\nLam now how old she guy winning and the guy I talked [noise]\nCan't breathe or when they you know\nWhen my mom and my my\n[noise]\n\n\nUh\n[noise]\n\n\n\nThis Jackson Brown and you're listening to under Kurds\nThat's the job when you go to", "year": "2018", "show_name": "UnderCurrents", "city": "Rochester", "day": "14"}