{"month": "10", "state": "RI", "station": "WPRO", "content": "Yeah it could have just said you're a twenty four as what smart truckers want without the high price and reserve unit loyal truck tires and non Tom today\nRed eye radio in our sponsors are devoted to trucking safety that's why we're proud to bring you the red eye radio million mile club for twenty seven years we've been saluting drivers will surpass the million mile mark with preventable accident free driving\nReaching this milestone you can be a part of an elite club of drivers who share remarkable safety records and demonstrate superior driving skills\nIf you or someone you know it's a truck driver with a million miles or more driving with our preventable accident register online at red eye radio show dot com that's run I radio show dot com\nThe red eye radio million mile club would not be possible without the support of our great sponsors including Petro stopping centers\nHow's Libera cater to ... the family of companies motel six the sink Christopher fund cats scale and cover electronics we applied the individual truckers athletes who drive with care and keep our highways said\nProfessional drivers your favorite magazines are now on stands and ready for you to read cover to cover for truckers connection offers great jobs entertainment industry news each month\nJob opportunities for owner operators is easy to spot with a hot right on the cover and the best career options for truck owners inside\nFlying truckers connection and job opportunities free had Petro Z traveled centers of America will toes and other truck stops nationwide truckers connection and job opportunities for owner operators we're searching for greener grass just got easier\nMom Dan maybe ... maybe you don't need to talk to me I mean you can't control it and maybe I'm really not ready to hear about that in meaning nine\nMaybe ...\nEvery day on TV movie sound in magazines and the and in my face maybe lie in mountain talk if you can't turn thousands of other people who are returning to wait and [noise] you know maybe you're right maybe ...\nMaybe even gotten to the counter now [noise] but just in case you're not right [noise]\nMaybe [noise] I mean the way that that\nBecause even if you can't tell me in here you came from the only time I became a little signing a combination for paying back\n... department of health and Human Services and the station [noise]\nHi this is Kelsey grammar every parent wants their child to reach their full potential that's why I Try and hospitals\nFor children is dedicated to helping kids do what they otherwise couldn't especially pediatric care for orthopedic conditions burns spinal cord injuries cleft lip and palate is provided no charge trainers hospitals innovative research now standing teaching programs\nIn helping hope for even more\nCall one eight hundred to three Seventy five zero five five\nMore information ... hospitals purchase helping kids defy the hot\nLightning y cool\n\nIf your child is sick over and over again it could be pie I have effect in the immune system that affects millions early detection children a chance to dream\nJeffrey Modell foundation [noise] twenty five years of helping children reach for their dreams visit us at ... or ... or call one eight six six improve from\nNOW News talk six thirty and Ninety nine seven FM W. B. R. O. [noise]\n\n\nIt's run I radio he is currently in I'm Gary McNamara quickly let's go to Phil in Alabama Phil welcome you're on TALK Radio Welcome to the show high\nMorning gentle and thanks for taking my call you back in\nUh in regards to the justice Brett Kavanaugh issue and allegations what every American voter niche to do is take that to the polls with them\nAnd ask themselves the question what if that were me I was do a promotion or I was getting another job with another company somebody decided they don't want me to have that all they got to do is make allegations and then I'm dead in the water\nYeah that it ... it is now able a row\nRight if the allegation is the only evidence that is needed and that's what the left and the Democrats have been trying to\nTell the American public that the allegation is enough and if you don't believe the allegation if you ask or evidence that evidence is what how you will come to your to your decision than you are viewed as a rapist enabler\nMhm I mean that that is that that's a message they've been thrown out I don't think I'm exaggerating that at all no gouging that because it and I I think that is if you look at it the the bigger picture where people now are being condemned\nAnd and maybe not don't have anyone literally in their face pointing a finger at them but if you supported Kavanaugh and believe just in the process [noise] just in the process\nAlone [noise] well you were part of again that proof that was a rapists and they've words so they're pointing the finger at [noise] rank and file Americans [noise]\n\n\nThe Sears ... radio on Westwood One\nShop thousands of trucking accessories online and I were eighty dot com or call one eight six six for Iowa eighty where you're free catalog\nThere's never a bad time to get your top back which is why now is a good time to take a look at the western star forty nine hundred widow lasting heritage ... forty nine hundred is built to deliver years a flawless performance with durable components hand bill construction and spaces quiet cap\nWith the availability of the industry's only sixteen leader engine the Detroit Didi sixteen getting your top ... forty nine hundred also means plenty of power and efficiency find your dealer at western star dot com\nTruckers quick question for you how do you say entertained when you're not on the road some truckers watch DVDs on laptops others just bring a book on their ... some people even resorted truck stop TV or spotty lifeline no thank you me I like to one way or the end of the day but live HDTV in my cab\nDrivers portable satellite antennas it's easier than ever mounted to your roof are still until your day is over then just shut them up\nIn your sleep or gas tenders or lightweight shut up and minutes don't require allies like an action blood it gets even better with dish there's no long term TV contract this time as you go programming you pay for only the most you actually use\nCheck it out of this from my truck John John fleet owners want to give your truckers the comfort of home on the road to safety GV is perfect for the fleets to all the TV you love to watch it at home in the comfort of your cab\nAnd you have to put up with trucks GV and over again find out more dish for much drug dot com today restrictions apply\nOwner operators we know everyone has thrived bed for a few days to make the best for your business in Mercer transportation help you take advantage of that phrase with no company frogs Mercer is similar to our owner operators success we have fast pace over forty years experience and offer a dedicated coordinator unhealthy manager at all\nSo you can focus on on in your business if you're looking to make a move considered Mercer transportation rock solid owner operator driven for over forty years visit today at Mercer town dot com or\nIf you're driving right now and you'd like to read the informative and entertaining content found and the currents September October issue of rotating magazine or if you'd like to listen that's right I said listen\nAs a voice easier on the years in mind reads the stories to you well listen up for starters the print edition preferred by Ninety percent of boats your drivers is now available for free as an F. R. E. E. N. N. E. T. H. Petro location nationwide and if you're not feeling at a TA Petra location today while you're in luck\nYou can simply go to wrote king dot com on your tablet or laptop to read a page turning version\nWould you prefer to read wrote king on your smartphone or scroll down version is also available at ... dot com simply click on view digital version or current issue\nTo listen on your smartphone or Bluetooth connected headset or speakers just activate by clicking on the speaker icon for any story and voila just start listening wrote teen dot com\nAnd asked them why they don't pay scale from southern New England is ... on the W. B. R. O. first new featuring accuweather meteorologist Kelly in April of voice of southern New England news talk six or Ninety nine seven found W. B. R. O.\nCumulus station [noise]\nThe and she's been up in the school bus drivers strike number of versus a burn last night and the bus yard here in Providence search and rescue continues along the Florida Panhandle the aftermath of hurricane Michael which by the way is\nBeginning to steam offshore bringing us heavy rains this morning fault rivers Marian says that he's going to beat the rap and will not throw in the town government center ruins making three straight wins they rally past the ... last night at the garden\nSeventy pure lack you rather more heavy rain possible this morning especially to the south and east of us here in Providence will dry up starting later today the turn cooler for the coming that we can let's get back to those forecasts\nDetails coming down pretty good this morning [noise] good morning I'm building ... this is the devil they've hero for news at five o'clock [noise]\nI long a very busy stretch attracts in Germany at least five people are dead after the collapse of a shopping mall after the ... to collapse of the shopping mall or to construction Monterey civil defense office there says two people have been pulled alive from the rebel twelve others listed as missing\nA smear cycling is damaged homes and blue downed trees and power poles in eastern India where nine people have been killed and three hundred thousand forced to higher ground ... butterfly when some Ninety five miles an hour and a came onshore\nAt around it day back a tropical storm warning is in effect for a mid peninsula stretch of Baja California in Mexico with tropical storm surge Tio bearing down schools in the area will be closed in the ... be a ... California ... states government reports forty shelters have been ready with the capacity of\nEight thousand people the port of San Carlos in California is closed\nAnd finally that was quite a scene at the White House on Thursday as President Trump had rapper Kanye West in for lunch and the county and the president your old friends and he went on a stream of consciousness before the White House media\nThat stopped worrying about the future all we really have it today we just have the day over and over and over again the eternal retiring the hero's journey and Trump is on his hero's\nJourney right now and he might not have expected to have a crazy\nLike kind of a west run up at a support but best believe we are going to make America great\nAgain this Kanye West at the White House coming up\nAs the WTO real first continues we have to be pure business news on the way a tough day on Wall street will get a report coming up\nIn his house in ... the weather forecast a deli it's now flood advisory Providence area\nThe full sports rounded up tell you the Bruins made out last night at the garden doubled if you're in these times five Thirteen\nRhode Island medical imaging new breast imaging center in east Greenwich warm and welcoming all night to keep the a new hospital down here instead patients get he wrote to wear and really stands\nA highly skilled positions are specially trained to read breast imaging come see why for over Seventy five years to please their trends in Rhode Island medical imaging for an appointment for one for three to twenty four hundred\nWere visit us online at ... dot com\nNow's the time to start planning your remodeling projects I'm ... hand with quality tile counter tops in West Warwick a new kitchen and that\nIs an investment that last a lifetime their show room has entire kitchens and apps on display with cabinets vanities honorary ...\nSlash options every project that quality Kyle counter tops does is a unique combination of technology and craftsmanship quality tile countertops sixty nine ... west Warwick eight to six Ninety seven hundred or quality tile R. I. dot com\nPeriod he's demonstrated fourteen distant from the national weather service Norton, Massachusetts a flooding advisory\nHas just been issued for most of Rhode Island's Doppler radar indicating heavy rain right now across the states as the ... street flooding in the advisory area\nAnd a slower than normal morning commutes they see some real patients could see how really rainfall rates of around an inch and areas civil experience what is forecast his mind a street bloody will include much Rhode Island and southeastern Massachusetts\nSomebody if you're a business news Wall Street with a slump for a second straight day that continues down and just used down another five hundred and forty five points had the S. and P. which was down to fifty seven NASDAQ was also down Ninety two as well let's bring about CNN Business correspondent Allison ... with the latest on Wall street\nAnd we had to kind of rabid short term interest rates\nFiring more than ... slow down the economy is very thankful for you already happening right now having said and then\nAgain the CNN settled in ... she is reporting this morning from a Wall Street in March the six straight day of losses for the market which has been rattled by those interest rates also signs of a slow down to the global economy and possible trade war between the U.S\nAnd China and overseas markets have rebounded in the night on the news the president Janet ... paying it made it to a group of twenty some and in Argentina late next month the wall Street Journal says the White House's informing Beijing that'll go ahead with the summer meeting in Buenos Aires a newspaper setting unnamed sources from both sides\nComing up is the double the PR real first news continues to local business headlines on the way at five twenty five this morning talk about the forecast for the heating season which is on the way to get an update on those oil prices is a well what does it cost to keep the home that's the top story local business headlines coming up at five twenty\nFive years [noise]\nChristmas Day cold weather center meteorologist ... joined to scan with WNPR row accuweather forecast\nOr they'd be yard with lots of rain this afternoon partly sunny and rather windy large African sixty five mainly clerical choice low forties rain tomorrow son is across a couple of showers hyped fifty for Sunday also saw the hearts associate WPRI Rosa clues about your weather I mean they're all just only they'd rather\nGet warning up on the bay today northwest believes it goes to forty nuts waves two to three feet four to six feet touch the ... century and skinny flooded advisory has been issued for all the Rhode Island this morning again we have heavy rain that is fully across the state\nAs a tropical storm out Michael passes off the coast get heavy rain temperatures are along the coast or in the upper sixties right now with a cooler in interior sections as the rain continues default current temperature here in Providence heavy rain falling is sixty one\nFor updates on these stories and others you can log on six thirty appear that can follow us on Twitter at WNPR real and like us on Facebook your searches ... P. R. O. coming up is the devil BPL\nReal first news continue as we wake up in the rain get round up double the purest sport started the garden as the Bruins take on the Oilers last night's sports is next Seventy cents is five Seventeen\nWant to know the secret to having enough money in retirement tune in every Saturday to WPRI ... from six to eight pm for though Rick Edelman show for more information visit rice dome and drunk I'm\nI'm here with Tom Marshall Marshall building and remodeling Tom congratulations on winning Providence journals readers choice award for best roofing signing a window company for the second year in a row what's Marshall secret\nNo secret met we just try to do the right thing and it's paid off with referrals repeat business in five star reviews\nMarshals is the best company with the best president warranties period\nWe don't accept any payment until our work is complete and right now\nAnyone needing a new roof or new windows can get Eighteen months Seamus cash in other words get a new roof for new windows done this year and pay nothing for a year and a half while talking about having your cake and eating it too that's right met anyone even thinking about a new roof for new windows should get a free estimate without delay\nYou heard of guys don't wait on this off or get your new refer windows now in pay nothing for Eighteen months do what my family and thousands of others have already done\nTrust your home to marshal call for free estimate eight hundred eight six six fourteen Ninety nine eight hundred eight six six fourteen Ninety nine of resume online and Marshall B. R. dot com tell them Tom we'll local roofing shutting and window people's\nJak pumpkins last week jak Hillary she goes speedway Saturday October thirteenth ... crashes matches and drag racing plus crazy figure aids slashing thousand\nPounds above good to gun just for cars and kids see action racket school this fall because speedway bumping last October third G. wells jumped on to be a part of the best family in New England jak out because\nThe way dodge offered to jail time\nAre you putting your retirement savings in a four O. one K. IRA or investment accounts then I have one word of advice stopped experts warn of a stock market crash any day now and you could lose fifty percent or more of your harder and savings\nAgain but you don't have to lose a penny there's a better safer way to save for retirement and you can learn about it in a free report this method continues to grow your money even when the market troubles to get this free reports go to bank on yourself dot com that's\nBank on yourself dot com bank on yourself dot com I'm now a page from a diary of\nScary tiny there's something about protecting people's homes to progress that inspires me because I just had an idea for a book about it was originally and I gave her a movie based on a plane and fire Bangkok but the idea of how you can fool when you bundle home an auto ... might not be the best idea for a book\nIt's even averages Seventy percent on car insurance when you bundle home an auto for progressive\nMedia radio commercials I guess we'll never know\nProgressive casualty insurance company and a feeling it's just not available at all states are situations\nHi I'm Dennis Eckersley ... you know I probably don't over a million pictures in my career being a reliable quality performer has always been important to me when it comes to maintaining our home I look for those same quality that's why it was a no brainer choosing garage headquarters for new doors are\nCurb appeal got a major league upgrade talk about increasing home values festival came with reliable closer see what I did there pretty clever I\nHigh I'm Dennis Eckersley and some things in life are just built to last like by baseball careers lasted twenty four seasons more they do custom designed garage doors by garage headquarters and their quality is life out there whether is this dominant\nAnd their best door price guarantee\nIf I drive through my no hitter\nIf there was a hall of fame for garage doors garage headquarters would get my vote\nFor Twenty years there is no college planning center has provided free college planning advice and financial aid died and he didn't parents from Rhode Island carefree appointment from Rhode Island chimed in college planning or knowledge of planning centered or\nOf course it is suspicious and uh certainly you know the elephant in the room there you know the timing of it also is odd\nMarrow lords of last night's no one was hurt in that incident to the school bus yard again today is day number eleven to the school bus strike the city is that you can find alternatives unless the striking drivers in the school bus operator reach an agreement to also about the same time fire broke out last night in Warwick business right on the city and town lined with these granted supported the fifty five year old man\nTo be airlifted to a hospital in Boston for treatment of his injuries that fire broke out on the post wrote again that was right on the line with east Greenwich reaction this morning to the stunning damage along areas about Florida and the panhandle coast they took a direct hit from hurricane up Michael linked Albrecht is a town councilman in Mexico Beach Florida I\nKeep pretty text without any by Chris care well no I didn't know that I Know there were on the beach in front of me for the call but they felt so I Am on that front line but no I I don't go\nDowntown councilwoman again that is in Mexico beach tiny community near Panama City that took a direct hit from the hurricane or man of the south corresponding Clayton ... nev all he has more in Destin, Florida\nPanama City beach in places across the panhandle aren't strangers to high winds from a hurricane but this Panama City native says wins in excess of one hundred and fifty miles per hour which reported Wednesday with Michael were unlike anything he'd ever seen\nI literally saw shingles pieces of shingles stuck in the side door panels of cars [noise] what type of when we were talking about take an asphalt shingles rash of it in the side of a car\nThe storm came and went quick but much of its damage still being discovered this man and his family left Panama City beach ahead of Michael for destined and are waiting to get that cleared to go home hopefully by Sunday we could go back home Clayton leveled destined\nDoubled appear and he's telling his five or thirty three political storm here at home Fall River married Jay still like Korea says he has no intention of resigning out a government center he insists that he's going to beat the wrath\nFollowing his arrest on Thursdays accused of using invest your money as a personal piggy bank we get more from Boston and double the ... clinic\nAnd following his arrest before dawn and Bridgewater Fall River mayor ... Korea was charged with looting investors in his snow all tech start up\nDiverting more than two hundred thirty one thousand dollars to his own use as us attorney Andy leveling spending thousands of dollars on air fare luxury hotels restaurants casinos dating services and adult entertainment after pleading not guilty Korea called the charges bogus\nThat through an Eighteen month investigation\nAfter an election based on allegations is that a single thing that the U.S attorney's office said and that Nineteen page indictment that I did wrong as mayor of the city of Fall River I'm very proud of that\nHe said he'll return to work as mayor he's due back here in early December at federal court in Boston steep climb can WPRI running with a period of\nTime is five thirty for\nThe money we are almost twenty eighth team that election central governor here in Rhode Island Republican Allen clung\nSays just calling to stay for these do assume control of the training school the aftermath of troubles there over the last year or two about double the purists falls and Gary he has more\nOn the story wasn't there Republican Allen Fung says despite fewer headlines than last year the training school still troubled with a large portion of workers out for injuries suffered at the hands of residents the GOP candidate says the problem is at the top\nLeadership vacuum and put it leadership someone who's going to be on a monthly basis to put the emphasis on security and safety not just for what a resident\nSwung so she'd also partner we're measuring agencies to provide vocational rehab programs for training school residents and step up opioid interdiction governor among those campaign counters the training school was better now than when she took office Paul's and Gary WPRI news of\nCourse stay tuned photo election central the coverage continues Ninety nine seven FM am six thirty WPRI Rowan online at six thirty WPRI rose dot com a new study is estimating about sixty percent of the U.S population with European heritage\nMaybe identical from their DNA by searching consumer websites even if they've never had their own genetic information available they say the numbers expected to grow as more and more people to upload their profiles to websites that use analysis defined relatives worried health officials say a small but growing proportion to the youngest children here in the U.S\nHave not been vaccinated against any disease is an estimated hundred thousand young children have not had\nA vaccination against any of the fourteen diseases for which shots are recommended none of this morning let's get a little bit more on the stream of consciousness uh do I guess from Kanye West you met with reporters there at the White House after lunch with President Trump\nWould I may Saturday Night live to ... the liberals are promoted if he don't\nWe don't look good does he have to be afraid\nFly fly a plane that factory\nOur core pre empowered with\nKanye West is not real stem wind here at the White House he tells the reporters presidents on a hero's journey to make America great now but if you're a new diamonds\nFive thirty [noise]\nFrom the WTO road traffic Center for good in downtown Providence good morning itself went out to start to commute to him but for now it looks pretty good Ninety five\nNorth of downtown right through downtown Providence we're not seeing any major backups to the rain over here on one Ninety five west bound or back over on the six ten connector\nUh two Ninety five but no reported problems up through Johnston so far looks okay if an ... five north a little busy after two Ninety five state sponsored by quality tile\nQuality time counter counter tops gives every project a unique combination of technology and freshman ships\nQuality child countertops sixty nine ... street west Warwick quality tile R. I. dot com and with your region right now traffic convicted works on WNPR oh\nI used to worry about my elderly parents were they eating well taking their medications were they ...\nIt was nice out there and then I called all is well can they help my parents perform their everyday activities they don't need constant just need a little house with all is well I can breathe easier now knowing my parents are in good hands on his route home care nothing seniors live independently in the comfort of their own\nJust seven thirty seven fifty online at all is well ...\nOf these I can handle it up from wedding party is having an aerial rent one place in the dark with section of all I can do anything in terms of the gathering\nTo weddings I've often wondered underneath the gas went through our team here in the room offered him have entering tiny parking and you really have you seen the run\nYour band called for six seven Seventy one years\nIs that for six seven to one or visit\nOur trainers dot com your doctor sends you for lab tests but does your health plan ... can you choose which lab to get your blood work done\nThe next time you made testing avoid the higher cost of hospitals visit each side's clinical laboratory each side\nClinical lab offers the highest quality of the lowest cost they accept all insurance has had with over fifty location there is a location near you why pay more visited lab choice dot org for more info and the list of the venue locations that lab choice dot org\nAnd she writes enter your home or ... is an important decision\nAt length spent they'd been installing fence or over Fifteen Years wetlands ... only the finest materials craftsmanship and reliability and only the most competitive pricing they provide vital would Anna looming in fact thing in a wide variety of thousand colored including chain link for commercial and residential\nThey didn't linked fence the oh dot com or call three five sex for six nine night an aspect Jamie consultation there I'll eat free [noise]\nSome of the journey down to size thirty nine from the ... Christmas decor weather center which many relatives delegate from sue the WTO\nRow accuweather forecasts bill tropical storm Michael is south of us this morning as moving rapidly to the east north east but meanwhile is causing heavy rain at the moment there's lightning just offshore few places you can get a thunderstorm\nFocus all believe in time for it to become part you started with the guts to be cool wind for the afternoon the hijab or to sixty far but we could just past thirty miles per hour for a while\nThen clear in Chile or to go down to forty three tomorrow's on his own car with a couple of showers cooler Hi Tift before Sunday looks like a nice day mostly on the high sixty eight and a fast moving world pressure and grow some rain Monday especially in the afternoon at night the harsh sixty two behind that another cool shot on Tuesday partly Saudi heart fifty seven\nBut they'll be pure ... brother ...\nNorthwest really goes to forty nuts on the beach today waves around two to three feet four to six three to ... have heavy\nRain moving through this morning disability they will be one to three nautical miles we ran into our rainfall total is we had an inch your brain as of midnight and we've had\nMore heavy rain that has been coming down today and we have the remnants of tropical storm Michael just moving to the south and east of us here in southern New England which is bringing heavy rain Senate gusty winds up this morning\nAnd we have a flood advisory that is in place through eight o'clock this morning this is all the Rhode Island are expecting another inch of rain or so expecting this because ... street flooding\nAcross much of the state and southeastern Massachusetts also windy advisory that will go into effect later this morning through this afternoon nor the wind's going against as high as forty five miles an hour of the accuweather radar up and running and you can see the storm again Michael which is uh just moved off the uh New Jersey coast guard it's gonna move nearly a due to the east", "show_name": "no_show", "year": "2018", "city": "Providence", "day": "12"}