{"month": "10", "state": "RI", "station": "WPRO", "content": "So you can focus on on a new business if you're looking to make a move considered Mercer transportation rock solid owner operator driven for over forty years visit today at Mercer town dot com or\nRed eye radio in our sponsors are devoted to trucking safety that's why we're proud to bring you the red eye radio million mile club for twenty seven years we've been saluting drivers will surpass the million mile mark with preventable accident free driving\nBy reaching this milestone you can be a part of an elite club of drivers who share remarkable safety records and demonstrate superior driving skills\nIf you or someone you know it's a truck driver with a million miles or more driving with outer preventable accident register online at red eye radio show dot com that's run I radio show dot com\nThe red eye radio million mile club would not be possible without the support of our great sponsors including Petro stopping centers\nHow's lubricate or the ... family of companies motel six the sink Christopher fund cats scale and cover electronics we applaud the individual truckers athletes who drive with care and keep our highways say\nHigh end in Compton for over Thirty years you know the truckers America's most red trucking news in [noise]\nNow every week and watch me and my co host Jessica Rose as we bring you the only weekly news show creative just joined us for all the breaking news affecting the trucking industry along with an awesome rid of the week profile\nIn front of the dot com is the one from not you're not going to want to have them busy travel down the highway so tune in every week and watch the news channel by going to the front of the dot com [noise]\nHi I'm Dennis ... you know I probably don't over a million pictures in my career being a reliable quality performer has always been important to me when it comes to maintaining our home I look for those same quality that's why it was a no brainer choosing garage headquarters for our new doors are curb appeal got a major league upgrade talking about increasing home values\nFestival came with reliable closer see what I did that pretty clever I go\nHigh I'm Dennis Eckersley ... you know some things in life are just built to last like my baseball careers that lasted twenty four seasons where they do custom designed garage doors by garage headquarters and their quality is life out\nThere whether resistance is dominant and their best door price guarantee\nIf I were I threw my no hitter\nIf there was a hall of fame for garage doors garage headquarters would get my vote goes\nHey Jesse I'm going to vote and you kind of boating doesn't matter why bother are you kidding you were just saying you wish we had better street lights and more recycling and I'm pretty sure you were complaining on line about your student loans so voting our way of holding the government accountable for those things\nI've never thought about it that way let's go to Don I'm All right Don kind of to learn more about voting by November ... don't be left out of the owner to buy the Rhode Island department of state and the Rhode Island broadcasters association\nDid you have your house for sale this last year and it didn't sell then you need Nathan Clark\nNo wage and our team is sold more homes in Rhode Island in the past five years then nascent Clark's team his homes sell fast\nFor more because he had his team are working with over twelve thousand the buyers and Clark guarantees to sell your home you with Nathan agree on a price that time of physicians that is the home doesn't sell he buys it at the agreed price call Nathan four oh one two three to seven six six one serving Rhode Island Massachusetts and Connecticut\nNews talk six thirty and Ninety nine seven FM filling you be our own [noise]\nAnd try and radio and he is currently and I'm Gary McNamara eight six six Ninety right I Do what we have now is the\nCloture vote that meeting will start at ten thirty when they actually will finished with that vote a you know we don't know it could be at around ... ten thirty can be eleven that could be one o'clock after that uh that vote happens or the thirty our clock will start taking\nA a maximum of of uh thirty hours of debate one set thirty hours is over after that point they can have\nA the actual vote on it so the cloture vote you know after the cloture vote that you know which will move it than the general public would probably be sometime late Saturday afternoon any work through Sunday night or who knows early Sunday Morning\nYeah um it'll be interesting to to watch\nThis uh but make some popcorn because the chaos is just\nGoing to be ramped up a certainly start a Thursday they started with the you know it's a bogus uh FBI background check and it's a cover up it is this and it's that and they'll they'll then trans\nA transform into or the you know the or the move into the latest uh whatever claim it's going to be or\nAction it's going to we started off the show by saying that and we'll end this hour by saying that there's not one coherent no critical thinking rational argument coming from the Democrats we haven't had\nOne don't be covering this for over two weeks out we haven't\nFound one and there won't be one [noise]\n\n\nThe ... radio on Westwood One\nDrivers knee jerk service pilot flying J truck has got state in the yard service centers and twenty four seven roadside assistance you want and we got\nVery truckers quick question for you how\nDo you say entertained when you're not on the road some truckers watch DVDs on laptop\nSo there's just bring a book on their whole some people even resorted trucks dub TV or spotty lifeline no thank you me I like to one way to the end of the day with live HDTV in my cab\nWith just horrible satellite antennas it's easier than ever mounted to your roof are still until your day is over\nThen just shut them up in your sleep or gas tenders or lightweight shut up and minutes don't require allies like an action\nBlood it gets even butter would do if there is no longer TV contract disappearing as you go programming you pay for only the most you actually use check it out a dish for my truck done gum beds fleet owners want to give your truckers the comfort of home on the road and do this HDTV is\nPerfect for the police to older TV you love to watch it at home in the comfort of your\nHand you have to put up with trucks GV ever again find out more dish for much drudge dot com today restrictions apply\nFake and you could win ten thousand dollars copyrighted clearance Kevin George ... thirty first each time you sound like the iron skillet or country prime state comes right you'll get a scratch when in free soft drinks Neal discount five hundred dollar diamond guards you know ten\nThousand dollars to get to that piece of pie a coffee five federal stopping said his skill as sweet as\nYou said it's one of these last winter federal got dumped so much as ...\nAs a for driving right now and you'd like to read the informative an entertaining content found in the current September October issue of rotating magazine or if you'd like to listen that's where I said listen\nAs voice easier on the years in mind reads the stories to you well listen up for starters the print edition preferred by Ninety percent of boats your drivers isn't downloadable for free as an F. R. E. E. N. N. E. T. H. Petro location nationwide\nAnd if you're not fueling at a TA Petra location today while you're in luck you can simply go to road king dot com on your tablet or laptop to read a page turning version\nWould you prefer to read wrote king on your smartphone or scroll down version is also available at road king dot com simply click on view digital version or current issue\nTo listen on your smartphone or Bluetooth connected headset or speakers just activate by clicking on the speaker icon for any story and voila just start listening road teen dot com\nHey drivers this is Gary earn a lonesome ruined volume on and now lonesome road volume two is just out and we would love to send your copy give us a call was six one eight three eight three twenty on oh seven log on to our website on some road dot org mentioned that you heard this ad\nOn ... radio and we'll send you a copy of volume two for only ten bucks and if you didn't get one we'll give you a special deal if you order volume one end to\nGet your family feel from the New England is ... on the W. B. R. O. first new featuring accuweather meteorologist Eli in April of voice of southern New England news Tom Six or Ninety nine seven around W. B. R. O.\nCumulus station [noise]\nGood morning I'm Paul's and Gary ... with the w._b. our oh first news five let's try to forecast right now that you want the meteorologist Elliott Abrams in the sea skates lawn care whether center\nFall today is going to be partly sunny breezy less humid then yesterday the high temperature sixty four clear tonight on Chile silo forty four then tomorrow we'll see plenty of sunshine high sixty six\nSunday looks great partly sunny high Seventy six degrees on more clouded is Monday and Tuesday perhaps few somebody breaks high temperature Monday sixty five as for Columbus Day and then for Tuesday going to Seventy three it'll be warm pretty much the rest of the week\nWith W ... list of actually rather I mean they're all just always Abrams\n\n\n\n\n\n\n\n\n\n\nAnd as the W. B. R. O. first news continues well we have a little bit of sports news for you Tom Brady became the third quarter back in NFL history to throw four or five hundred touchdowns\n[noise] just made it official where he found Josh Gordon for us thirty four yard bomb and the fourth quarter of the patch thirty eight to twenty four when over in the last night [noise]\n[noise]\n\n[noise]\nYou know I could listen to that again and maybe we will be for the morning is over it's Bob Societe ... with the call last night right here on WPRI ... I went all ready passed for three hundred and forty one yard and three touchdowns and by the way he is not one of ... exclusive club you joined Peyton Manning and bread far as the only\nNFL Cubans to reach the five hundred a TV milestone Brady also ran for a touchdown and was a thirty four of forty four passing\nFor three hundred and forty one yards and two interceptions also passed receiver Julian Edelman made the decision to do last night after being activated to the fifty three man roster they look good and the wind over the coals you grab seven passes for fifty seven yards\nAt them and of course had been suspended for the first word games in the season because of violating the NFL's policy\nOn T. V. d.s WPRI news time is five Fifteen\nWe have sixty one degrees and the accuweather meteorologist Elliott Abrams says partly sunny breezy less humid today high sixty four clear to partly cloudy tonight breezy court\nWith a lower forty four mostly sunny demar high sixty six Sunday partial sunshine but a nice day Seventy six degrees for a high Monday they'll probably not as warm areas of drizzle and the high of sixty five\nHi I'm Dennis ... you know I probably don't over a million pictures in my career and being a reliable quality performer has always been important to me when it comes to maintaining our home I look for those same quality that's why it was a no brainer choosing garage headquarters for our new doors are\nCurb appeal got a major league upgrade talk about increasing home value festival it came with reliable closer see what I did there pretty clever I go\nHi I'm Dennis ... and you know some things in life are just built to last like my baseball career that lasted twenty four seasons more they do custom designed garage doors by garage headquarters and their quality is life out\nThere whether resentments is dominant and their best door price guarantee\nJust like where I threw my no hitter\nIf there was a hall of fame for garage doors garage headquarters would get my vote go\nIf you're looking for plumbing heating and drainage solutions it's safe to say you need them right now\nWill don't waste any more time she's on supply has you cut through the years she comes supply is beneath trusted source for farmers general contractors and excavated with the knowledge and his staff to prompt delivery she comes to fly gets the job done ... locations and robots\nProminent no federal individual to\nCheck them out at sea ... supply dot com [noise]\nShe got supply never standing still always I'm now but I Know\nIt takes a lot to get excited about him back but most bags cats they be twenty percent parts and accessories that's twenty percent off ... twenty percent off oil filter twenty percent off ritually anything you can fit inside the Ninety nine cent never reusable bags so tell your buddies are bags they just have to check out all\nThe parks couple people snapping participants voted for George Wallace was west minimum ... supply ... thirty one eighty\nSo here's a story you might relate to I used to post their job boards only to end up with hundreds of resumes to sort through\nIt took a week to go through all of this rather than just to find a handful of people who are from my job\nIt was overwhelming that old process was not smart I mean it's not easy to find a network architect financial analyst childcare assistance but then I went to zip recruiter\nThey figured out higher when they get their way forming their powerful mapping technology scant thousands of residents benefit people at the bright yellow education and experience for my job and\nActively invited them to apply so I could hire qualified candidates fast smart\nSee ways ... recruiters rated number one by employers in the U.S trade it for good or now for ... recruiter dot com slash free that zip recruiter dot com slash free once again recruiter dot com slash free ... recruiter the smartest way to hire based on trust pilot rating of hiring sites that were went reviews\nJoined ... for the Ronald McDonald host province woman classic roadways\nSunday October seventh register ATM women's only ardent engineering five K. Myrna walking and car insurance you have three ... started in ten am ... through the beautiful historic east side of Providence finishing it all the big style I'm Brown University tracked\nTo the three kids races woman's wellness fair benefiting the Ronald McDonald how's Providence but details visit ... dot com [noise]\nRhode Island medical imaging new breast imaging center in east Greenwich warm and welcoming Mike boutique feel new hospital gown here instead he shouldn't get he wrote to wear and really stands\nA highly skilled positions are specially trained to read breast imaging come see why for over ... years teaching to please their trends\nIn Rhode Island medical imaging for an appointment for one for three to twenty four hundred were visit us online at ... dot com\nWPRI news time five Eighteen I'm Paul's and Gary in for Bill ... this morning a couple of quick headlines before we checked sports the Senate is expected to take a preliminary vote today on President Trump's Supreme Court nominee the geo piece as an FBI report clears Brett Kavanaugh of sexual assault charges\nDemocrats say that road was rushed and Patricia Morgan is out as Rhode Island's house minority leader house GOP giving her the boot after she endorses Joe trailer will former Republican for governor\n[noise] an hour five Nineteen time for sports here on WB RLS checkout major league\nBaseball ... or ... me to try that one again ... June ... through seven shutout innings and the LA Dodgers over three times they took game one of their National League division series against Atlanta six to nothing\nJak breeders in the lead off the bottom of the first with a home run ... months we added a three run last in the second before I K Hernandez editor solo shot in the ... were you limited the Braves to foreheads while striking out eight\nAnd of course sale waited eight years to make his first postseason start and then another three hundred sixty five days for a chance to put that memory behind them\nThe red Sox left hander is going to be starting game want to be A L division series against the Yankees tonight one year after he was bombarded by the championship bound Houston Astros in his playoff debut sale is going to face ... Yankees left D.\nJ. A. happened by the way you're going to be able to hear that game on our sister station am seven Ninety\nPhil Mickelson revealed up six straight Bernie's and an opening round seven under sixty five is the PGA sees an opening Safeway Open open the forty eight year old Mickelson burning no numbers nines or fourteen enclosed with four straight bars on the north course at Silverado resort and spot\nThe string of birdies leaves him two shots behind step struck a bird to his final three holes for sixty three religion prize winning sports columnist Dave Anderson of the New York times has died he was age eighty nine the newspaper says he died at an assisted living facility in ... New Jersey\nAnderson worked at the times from Nineteen sixty six to two thousand seven you wrote elegant descriptive commentary displaying a wealth of expertise in baseball the NFL boxing and golf\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe guard is always ready to respond to local or national\nEmergencies the Army National guard reacts to domestic operations in each of America's fifty four states them territories including Puerto Rico the Virgin Islands Guam and the\nDistrict of Columbia each state National Guards unique domestic rule is to act is the first line of defense in support of civil authorities in their state the guards emergency responses include search and rescue missions for floods combating wildfires hurricane or tornado recovery and the presidential inauguration the Army National guard we are\nAlways ready we are always there\nAnd in every state in territory we stand guard for our communities to learn more log on to the national guard dot com\nSponsored by the Rhode Island Army National guard feared by the Rhode Island broadcasters association at this station\nWNPR news times five thirty nine and a while it's still dark out there for the most part but\nWe are expecting to see some sunshine today even more tomorrow in a Sunday is going to be for the United states will have the complete accuweather forecast with\nEliot Abrams literally just a few seconds away in sports big big news for a Tom Brady in the patriots win last night he has now joined Brett Farr and Peyton Manning as being the only three NFL quarterbacks\nIn history to have it for five hundred touched down so that is really a big deal now let's head over to the sea scape lawn care whether center and check in with meteorologist Elliott Abrams\nBall today is going to be partly sunny breezy less humid then yesterday the high temperature sixty four\nClear tonight on Julie silo forty four then tomorrow we'll see plenty of sunshine I sixty six somebody looks great partly sunny high Seventy six degrees or more clouds Monday and Tuesday perhaps views on the brakes are temperature Monday sixty five for Columbus Day and then for Tuesday going to Seventy three it'll be warm pretty much the rest of the week\nWith WNPR roses was about your weather I mean they're all just always Abrams\nAnd we do have sixty one degrees right here at the weather station taking a look at the radar there is nothing there so uh either radars busted or we're going to be in pretty decent shape I'm\n... I'm betting on with Eliot ... at any way WB our news time is five forty one coming up we're going to be checking some business news will also have the sports a little bit more news coming up of course after the news at six o'clock gene boundless energy and the W. P. R. O. morning news\nAll right we just checked in with Eliot let's push this button and see what happens\n[noise] if you need a passport photo head over to the place where they say cheese all day long the camera works on hope street abroad but it\nIs a camera work the Joe Biden more personable less than ... to get your passport photos up there for high quality at a portable passports and international photos of all five no appointment necessary it's the little shops that big on surveys the camel", "show_name": "no_show", "year": "2018", "city": "Providence", "day": "05"}