{"month": "10", "state": "AZ", "station": "KUYI", "content": "Oh shoo autumn is the season to hunt preserve food chop wood and plan for your health sign up for health insurance before the cold and flu season comes all one eight hundred three one eight to five nine six or visit healthcare dot Gov message from the Centers for Medicare and Medicaid services which\n\n\nAmerica going on now because\nI Want to broadcast racial native non profit media funding is provided by corporations broadcasting support to the public radio can bring Michael the Native American radio network\nYou are listening to KU I hooked by like eighty eight point one F. M. N. K. U. I. L. P. upper ... eighty nine point when FM projects at the ... foundation seeming online at K. U. L. I. dot net you needed American public radio stations\nAbove people what being on the moon this is it ... and you're listening to the eclectic music mix on to you I bought one\n[noise] [noise] [noise]\nA lot more about what you can ... I can follow\nWhat probably one time I can take them to tell my wife will battling that day you know [noise] I\nWas told to ... [noise]\n...\n[noise]\nHad this hour with my God I ... ... ... ... ... people per hour\nThey called me I don't think I\nCan yeah you can come in all the way to reach out and die off to provide for people\nTo go to shows a manual apple to punish below what am I\nAm [laughter]\n[noise]\nUm I'm not [noise] a bird hunting that doesn't bode [noise] you know the the [noise] whether\nI Would rather ironic whatever I can then [noise] I think for a\nMan August ... mother tongue bottom bottom ... were they probably for about five years ago or\n\n... or\n... he goes mom who we write ...\n\nMurders I'm just too busy ...\nMm on\nFriday the ... the female ...\nSo he can teach you know I don't know your money oh no no no I ...\nEvery time they are my heart and loves their games is\nSaying\nShe's ready for high ... shows me every day\nAnd\nNot have been on a jury right they are bad that right there on a nice Kelly Irish around playing in the lead a man you're saying there are there are less na na na na na\nNa na na na na na\nOr [noise] ...\nAh you should write zero\nDo the show game or to make good that we can go on the lake all your money and then and then when you grow in ...\nAnd ... my\n... reunion turn and you know we live in a guy I Know what I'm saying oh no ... I\n... in the u._k. man\nYou know and there are like Sinai man from a a God son ... or\n... ...\n... then you know ... to ... I was seeing that young man and a ... a review the reason they walk right\n\nThrough the little baby ... ...\n... ... ... email\nI got so much now she's got big red dye number ... ...\nOr ... or ... ... email you know on a new\nWe say man you know\nAnd then on and there are land on and you know a John how are you a lot of that on that in many ways to to\n\n\nYou know what the ...\nI'd never been to a certain line really was no ...\nOn my world\nKnows St George was was ...\n\nLittle little sees mom is ...\n\nWell the treaty little a little bit of the mama ...\n\nAlso known so sorry\nFor them to do more news\nThey ... the\nBernie was hard to do and I know\nThe jury room he throws me ... these low meal in a ...\n... ... these ... men who you are right\nThe\nPhone call ...\n\n... ... ... ... ...\n... a whole ... ... no no I\nKnow you're saying you know\nHow can you do for\nThem and they say no I understand that all the ...\nAnd [noise] ah no shame\nIn to the man he said\nI Know they are right in and right right\nRight right and they just right for me\n[noise] and then\nShe tells me well you know I'm Wondering is a young man I saw that in\nA\nWay to the gym the training is really\nI Know a job right and and\nBut I may jump right here to try and ...\nAnd ... and\n[noise]\nAnd\n[noise] na na na\nNa na\nHam and [noise] na na\nNa na\n\nNa na gaining man\nI Know bang you're right and I had an assignment I sang parents di di\nDi di\nDa na\n\nI Do I\n\nI'm ... I'm\n...\nI'm a ... oh\nOh\nOh\nYeah I'm from [noise]\nEvery time they\nMay\nGet [noise] oh\nGoodness [noise] [noise] oh\nWell no jury not known vacuum dream\nLow man\nOn the no ... have those around me you\nKnow to really you know when it's a way\nFor more\nLow not to show me\nA lot of 'em\nFrom me but no\n[noise] oh\nYeah\nOh I'm\nSure you know oh oh\nOh oh yeah mhm\n\n[noise] mhm\n[noise] [noise]\n[noise]\nOh\nWell no not dream you know and not Ken\nI'm only twenty minutes and then you know ... those around me do you think you\nKnow one little to just go\nAway [noise] farming\nThrough the ... so we don't\nKnow how long do\nWe know\n\nShown me how do you know\nUh [noise] I'm\nOver ... ...\n\n\n\n... ... na na\nNa na\nNa na na\nNa na\nNa na na na\nNa na\nNa na na na na na na na na I'm\n... I'm ...\nAnd ... and\nOh show me how the new we didn't even know na\nNa na na na na na na\nNa\n... [laughter]\nYeah oh oh oh oh oh\nMy God am I wrong they will read it at that age uh oh I see oh\nA whole and I do a dry run by the end and it's nice to know when they die in like a\nNo one knew right new ... will say\nThat yeah yeah yeah yeah and\n... and I I\nThink it's fair and feeding me so much now and then\nBeing that it was only like one of them that he didn't know who they ... they need the local news but you run the\nWriters in [noise]\n\nAnd and and\nThat and I'm like I'm not sure that's the way everything is in the infantry hello from Iran and then\nThe second one and a young man or something like ... and I was\nAll done online and uh [noise]\nThey they have no family\nNa na na na na\nNa na\nNa na na na na na na na na na na na\nNa na na na na and\nWhere we are as I Need to learn the language and the teacher can play a man and I can remember I was trying\nTo remember the one hand and kind of the day maybe they\nDon't know I Know na na\nNa na\nNa na na na na na na na na na na na\nNa\nHey I'm ...\nAnd\nEarly in the name of the ... then or to re enter around and uh they may\nNever know what we're ... and ...\nMaybe ... na na\nNa na na\nNa na na na\nNa na na na na na na na na\nNa na na na na na na na\nNa na and um [noise]\n\n... you\nKnow who\nDid die in the\n... ... ... meets that\nShe'll say oh\nYou can\nCall me a little bit longer\nThan we would do\n... ...\n... ... and ... you're very young you\nKnow from the high and maybe you\nKnow which way do you know I Know that\nThey have no no no\nNo I don't know a\nGoal really can and they know the ... yeah and\nAnd\nMaybe a\n... and the and the ... and you know the iron\nAnd then\nAnd there and\nCheck the day and\nThe boy I'm going to me that oh\nYeah I can call me and she told\nHer anger and yeah and and and\nHow long the call and say\nHey come on keep calm and ready and and you know and they and and I and ... and\nAnd and and and so [noise] [laughter]\n[noise] and ah [laughter] damn", "year": "2018", "show_name": "Forum (KQED)", "city": "Hotevilla", "day": "17"}