{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nYou want to keep up on current affairs and a lot to do is to be NPR News's makes it easy for one source for international national in Minnesota [noise]\nListen to catch up with the world's going to die and discovering what matters\nAnd this is America on the line a news and call in show about the mid term elections from WNYC and public radio stations across the country\nEvery Monday through Thursday evenings where here with the latest political developments analysis and your calls tonight attempted terrors injected into an already red hot political environment with the discovery of pipe bomb sent to seven apparent targets\nRock Obama Hillary Clinton former attorney general Eric Holder\nCongresswoman Maxine Waters Congresswoman Debbie Wasserman Schultz former CIA director John Brennan and CNN this comes after what happened on Monday when democratic donors George Soros was also a target of one of these devices we don't know who is responsible yet\nSo we are going to take a do take a breath tonight talked about what we know how we got here and what it means for the election in our society and we want to hear from you\nHere's our question tonight what do you tell your children about our politics\nHave you talked about today's news give us a call at eight four four seven four or five talk that's eight four four seven four or five\nEight to five five is always you can send us a tweet using the hash tag a O T L we always start off with the latest news and the very latest is that President Trump is campaigning in Wisconsin in Wisconsin this evening\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nCalling out reporters as quote fake news taunting Hillary Clinton and Maxine Waters and well you\nKnow the rest will see in a while but earlier today in the White House the president called for unity\nIn these times we have to unify we have to come together and send one very clear strong unmistakable message that acts or threats of political violence of any kind of no place in the United states of America\nWe have to stress that we don't know who sent these bombs we do know that they were sent to regular targets of some right wing activists in politicians including the president\nSomeone the writer saying it safe a left wing ... perpetrator trying to set up a quote false flag situation\nTo make the right look bad so close to the election and the timing of this does complicate everything\nWhat will be the impact of this attempt to terror will it have a positive effect ratchet the noise level back to maybe a five instead of where it is now or are we so tribal now that we risk making our divisions worse\nLots of questions so let's look for some answers to gather from some people who know the landscape better than most\nJoining us from Milwaukee Charlie Sykes conservative writer podcaster and author of how to write lost its mind\nHere with me in New York shown waltz national affairs correspondent for the nation and CNN contributor and in Washington White House reporter April Ryan of the American urban radio network all welcome to America on the line April I'm welcome your day\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAt last check he had not taken the podium no he he did start speaking a little while ago and he said\nDo we will find those responsible we will bring them to justice hopefully very quickly and then he said political violence as an attack on our democracy itself so he followed up the rhetoric we heard from the White House but obviously a couple of scripted remarks are really don't change the political context of the moment we're in the\nKnow in April of someone who sits in the White House press briefing room whose band that to to rally is like the one that the president is speaking to right now I\nI Would love to get your your um observations your reactions of what that experience is like as a reporter\nSo Jonathan rallies are generally um interesting to watch\nUh the rise and fall of the enthusiasm on the continual wives or what have you it's it's almost like I'm going to church\nWhere you have the person there who feel the crowd cheered when they're supposed to and and fall down with his coach and listen and cheer when they as opposed to these rallies or something totally different and and just to correct the record I have never been to a Trump rally and I am it is not safe for me to attend a Trump rally at this point\nBecause I Am\nConsidered a target um by some of those who follow the president um and I've had my own death threat but what I Will tell you is is that this president in his speech I heard a little bit of the Ford jumped on the line with you he um he had\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nHis staff jumped up right away but it took a while for the rest of the room to follow suit and give a\nStanding ovation and when you talk so vehemently and and and hate fully towards groups people be it the Democrats who a mob beat reporters who are um uh on American or or opposition party or in these are the people\nAnd whatever and talking about you know body slamming a reporter and congratulated met and then\nChanging your speak it has to be persuasive not just today he's got to sustain that because this is so dangerous here now in a dangerous period he's calling for unity he's got to continue now the question is will his supporters believe him you know and right and if he thinks it's something that the change has got to count\n... Jones you um and I apologize April for a mistake that you'd been to Trump rallies with Joan has been to Trump rallies and Joan at also as journalists who um give your observations of what it's like to be a journalist that a Trump rally\nI haven't been since twenty sixteen but that was scary it's scary enough Jonathan I mean you were in a little pen and they're you know all of his supporters were around you and people would chance a CNN sucks I was with MSNBC at the time but I still took it personally uh there was just this\nSense of\nIt I don't want to say violence but you know meals deep men is uh and uh you know it was it was really uncomfortable I mean I did spend some time sort of wandering outside the pen and\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nExpect what blew me away today and I'm Sorry it's still blows me away that he did not mention\nGeorge Soros for Iraq in the shallow bomb a bill and Hillary Clinton Eric Holder Maxine Waters CNN John\nBrennan that he never expressed any condolence I mean ... is too strong because they're all with us but he never expressed any sense of sympathy\nFor them or their families or the or the people who work for them or the secret service people who work for them and protected them\nIt it's just all happening in some other realm for him and another president would have to say at least some of the name of the people who have been threatening it can I just\nI Want to address or an ... an elephant in the room and we've got we have to talk about this when we you know sort of mentioned it in the intro and we've been dancing around it but\nAll of the people we have mentioned all people who have been attacked ... game by the president name and so I Want to I wouldn't I Would I Want to each of you to answer the question can the president should the president be held responsible for what we saw today\nOkay what degree I'll START I mean we've gone through this before or when we you know ... during the Obama administration when we had another surge of right wing violence when you know Bill O'Reilly uh called out uh\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more person\nI Want to thank you for coming on the show tonight Charlie Sykes thank you very much for being on the program John you're staying with us when we return what's it going to take to get our political environment back to something like normal you're listening to America on the line\nProgramming is supported by McKnight foundation driving sustainable solutions to help the mid west to be a leader in advancing a clean energy economy on line at ... dot org\nA mixture MPR news presents the congressional candidates and the second and fifth district's Jason Lewis and Angie Craig debated an almanac Twin Cities bbs NPR's Tom ... hosted Jennifer ... tonight at nine\nAnd right before that I ate a fresh air it's\nActor Paul day no he's making his directing debut at the new film wildlife films based on a Richard Ford novel they don't play the boy preacher and there will be blood of moody teenager who took a vow of silence in Little Miss sunshine and portrayed Brian Wilson in love and mercy\nYou have questions about how to vote to have a frequently answered questions section for you with answers to where he's like do I need to register with a party and Ken I vote early check out the need to know guided MPR news dot org slash election\n\nSee how these guys are on the stage tonight light rain likely\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nGuys mostly cloudy temperatures fifty one\nI'm Jonathan Capehart and you're listening to America on the line of news and call in show about the midterms from WNYC and public radio stations across the country\nWe're asking you tonight what you're telling your kids about our politics have you talked about today's news specifically call us and share your thoughts eat for for seven four or five\nEight to five five uh actually I was going to introduce the next handler next discussion but I I'm going to go in and take a call and take this call from Sarah in union County Ohio Sarah thank you very much for calling into America on the line\nThanks for taking my call\nSo what do you what do you are you what are you telling your kids about politics for kids about politics [noise]\nYeah so um I have four kids between the ages of ... eleven and Nineteen\n[noise] and and I also pastor to rural church it out here in union county and I find myself kinda preaching from the pulpit and two kids kind of a lot the same thing on a lot of levels is first of all we have to learn to listen to one another better we have to learn to ... not\nThe villain I is the other with the problem of a single story because we keep hearing these narrative that this person is this or that person is that ... and everyone's story is so much deeper than that and so when we go to the deaths of\nExperience and we really left in ... in love and deep reflection on one another were able to understand and ... and maybe can act in a way that quite frankly\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAnd quick delivering has never been more important ... let me ask you that mind you just said a moment ago we can't villa knives based on one story what was that again [noise]\nYeah ... that's the danger of the single store it right the director of a single story so we we perceive that someone is\nYou know one of my children has been and she got a liberal arts school has been kind of accused of being just a radical liberal feminist writers that that you know it and write that name calling and that in that particular more conservative conch ... so\nThat's all she is right so then when are we going to wait and hear the story and hear the depths of that and and know that there's so many more than ... years to who someone is that why they believe what they believe in what their experience has been [noise] um\nBecause the people were even really listening to the facts everything gets muddied when rice label people with a single store\nI ... I Want to I Want to thank you for calling in and especially thank you for that single for that single minded as a special resonance for me today because I saw a American Sign on Broadway star and Kerry Washington and that is a central theme\nIn that that Ninety minutes away so thank you very much ... in St Louis thank you for calling into America on the line\n[laughter] thank you for having my call pill yes I'm just\nSitting here listening to your radio station and it gets hit me that this is what we talked about today I'm a high school teacher and we were just talking about the news and I say hey did you guys listened to the Kavanaugh confirmations and none of them knew I was talking about because kids today\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nFast for the rest of his life so they were like how do you get that with your life I'm like well that's what they have what you Supreme Court justice so I'm I\nAm an ethics students if you don't like the way that going maybe should get into politics and try to change that I personally can't sit on a job from the Nineteen fifties to twenty eight teams\n[laughter] you know the world has changed so drastically in the last almost a year right now so go ahead by\n... or at least I I I Do want to thank you thank you for your call and thank you for calling in from from St Louis I Do need to move on to do our panel as the clock ticks down and want to get into the political climate a little more deeply now joining me from Washington is Peter Wehner\nWho is a senior fellow at the ethics and public policy center and former advisor to the last three Republican administrations in here with me in Studio in New York Karen Greenberg who is director of the center for national security along with Joan walls of the nation Peter let me start with you and\nWe had Sarah who um ministers out there in Ohio urine evangelical Christian you often write about religion and politics do you worry about the tribalism that that divides the [noise]\n[noise] oh yeah I think took the tribalism in America that is one of the chief um problems that um that we face some and this has always been to some extent the trouble is the country of polarized country\nThat is true every I'm Free country but it's accelerated and it's deeper than any problem with that I can call up in my lifetime and ah and ah\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAnd the rhetoric is a is really getting out of out of control and at some point oh it's the rhetoric is out of control of them that can lead to um to to uh to ...\nSo we're one of the water column would work who the worst time equals country ... while the civil war like sixty eight other periods but this is a difficult\nMoment and uh things are getting worse not better and so a lot of the salesman\nRight can pick up on that 'cause I was going to ask you it seems like we're in darker times in our politics are we in darker times in in our politics\nYes but I Want to just pick up on something that um he was saying which is that it's easy to say tribalism but one of the things that I think it's really interesting that's happening in the country and that's pushing us into darker times is that\nThere is we keep talking about these young individuals that are prone to violence to go to violence or or your earlier caller that called in about her four children and her daughter being labeled a certain way right\nWhat we see all around us is this profound identity crisis on a very personal level individuals trying to figure out how to identify themselves how to re identify themselves how to question their identity whether it's gender religion whatever it is\nNow we see a country that's having an identity crisis\nAnd so it seems to me this is sort of bubbling up from the personal to the larger fear and now to the to the very highest um offices in the land and so I I think we need to understand it that way which doesn't minimize the the tribalism but adds a layer to what I actually think it is going on we need to grapple with\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nFor or am I just being hyperbolic or why don't you know or you know I don't think we know we're\nAt a tipping point in a moment until we tip right when we look back in history um\nAnd I you know I I basically agree with what Peter said but I guess I Would take a little bit [noise]\nJoan Walsh Peter Winter Karen Greenberg thank you very much for being on America on the line we'll take a break here and when we return we'll turn our attention back to the campaign trail in battleground Arizona\n[noise]\nSupport for this program comes from strategies health a non profit health care quality improvement organization recognizing national healthcare quality weak and the people working to improve health care in advance safety strategy health dot org strata cells we make lives better\nOn the next fresh air Paladino he played a teen preacher in there will be blood moody teenager who took a vow silence and Little Miss sunshine and portrayed Brian Wilson in love and mercy dino directed and co wrote the new film adaptation of Richard forwards novel wildlife\nWhich stars Jake Gyllenhaal and Carey Mulligan during [noise]\nPressure coming up at about twenty minutes here on NPR News [noise]\nAnd right after fresh air\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nSo yesterday's debate between Minnesota the fifth district congressional candidates Republican Jennifer Zielinski and deer feller Ilhan Omar moderated by NPR's all things considered host Tom ... news presents tonight at nine o'clock [noise]\nForty four degrees now in Rochester in Saint cloud forty three and aloof fifty in Fargo Morehead fifty one of the Worthington forty six in the international falls it's mostly cloudy and forty eight degrees and the twin cities\n[noise] I'm Jonathan Capehart and this is America on the line from WNYC and public radio stations across the country and we're going to go across the country to Arizona for another report from the campaign trail this one is a very tight race between two women to replace Republican Senator Jeff flake\nJoining me now for an update on that and the messaging battle over who will protect Arizona's healthcare is Kevin ... political reporter for huff post Kevin welcome back to America on the line\n... and also we'll be taking your calls in the segment to specifically we want to hear from you if health care is your main issue in this election and if so why call us at eight four four seven four or five talk eight four four seven four or five eight to five five\nKevin I'm the Senate race in Arizona is particularly interesting because no matter who wins the Democrat um which is congressman Christine I'm cinema board the Republican congresswoman Martha mix Sally there will be a woman\nGoing to the Senate from Arizona um\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWomen Senate races uh there was one last year in New Hampshire a this is one of two this year the other one is in Wisconsin a there is also I should say one of three and a brass ... Senate race which isn't particularly competitive\nAlso has two female candidates are we're starting to see more and more a woman dressed as women Senate races which are extremely uncommon obviously for 'em much of the twentieth century now\nThe gap in the polls between the two of them has widened recently with five thirty eight giving cinema sixty three percent chance of winning so ... what do you think is cinema pulling away or is this still a tight race\nThis is still a very tight race cinema is probably a slight favorite um she has a lead in some polls are the political environment also favors are slightly a but it's not a huge margin in this race it would not shocked me at all from Sally pulled us out\nHuh and so the other thing the other historic thing here in this race is that if Crist in cinema when she is she's the first openly bisexual she would be the first openly bisexual I'm\nSenator from Arizona from anywhere in the country and she would be only the second openly algae Beatty senator in the country of course after senator Tammy Baldwin from Wisconsin\nHow our next Sally and send them a um framing gender in their in their campaigns as one running towards it and the other one running away from it\nIt's interesting it really doesn't come up that much considering that this is a contest printing two women against each other um there is a gender gap in public polling that favors cinema uh you would expect that typically I'm female votes\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nThe first woman in part because they're both women\nAlthough both candidates do I'm sort of\nEmphasize I'm sort of some of the historic nature of their candidacies are of their lives um Mick Sally we'll talk frequently about how she was the first woman in the U.S military to fly during combat um after the\nProhibition are more and flying in combat was lifted in the early nineties she flew 'em in Desert Storm and after a and sort of the Afghanistan conflict\nFight following the September eleventh attacks cinema I'm also isn't really wants to play up her gender\nUm but she is clearly you know she emphasizes parts of her background as an algae beauty person she played a large role in defeating two propositions that would've banned same sex marriage in Arizona a when she went to a state legislator state legislator\nA and but she doesn't really play up the fact that she would be the first uh openly bisexual senator doesn't really talk about the fact that she would be a\nOne of only to uh open the algae team members of members of the Senate and neither does make Sally it's really a and this may be a former progress it's really not an issue at all\nNow when you were on the show a little while back isn't that the whole segment talking about the importance of of education as an issue there in Arizona but apparently health care is a dominant issue in in Arizona isn't it\nYeah it it's really become the dominant issue in the Senate race I was just at an event cinema was actually holding with a group of teachers that was a a canvas kick off to basically encourage the teachers you know go out and knock on doors for campaigns\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nSally over a Republican attempts to repeal Obamacare and what that would have done if they had been successful to the protections for people with preexisting conditions in the Obamacare law we've also seen mix Sally this morning a came out with an ad where she claims that she would have\nThat she would protect people with preexisting conditions and they've been fighting the insurance companies that's not really backed up by her votes on Obamacare repeal a experts and\nIndustry groups and advocacy groups all agree that\nThe protections for people in pre pre existing conditions in the GOP plan to replace Obamacare would have been much much weaker than the ones that are included in the Obamacare law\nNow it is a congresswoman cinema hammering congresswoman mix Sally over the report where mix Sally was quoted as saying and it gives me at a Republican caucus lunch they report I read said she stood up\nAnd said quote let's get this ... thing done about about the repeal efforts on the part of the Republican Party\nYeah I mean that specifically hasn't come up with that did show you know mix I was all in on these proposals\nA there was not a lot of hesitancy on her part the way that was with some other um Republicans running in swing district ... a lot of Republicans running in spring districts that he's a number of them ended up not voting for the law\nA mix Sally at that time had an yet declared her candidacy for center at the time a Senator Jeff flake we're still expected to run for reelection but she is a she was represented a swing district in Congress or ... a district that narrowly voted for Hillary Clinton and she was still\nProgramming and supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nIn a heated the call Donna as always welcome to America on the line\nThank you for having me so health care is an important issue for you in this election\nYeah for example reasons uh I'd like to say that I have three children and elderly care a pretty good thing condition\nChildren elderly parents and there's a lot of reasons to want\nHealth care I'm from Washington and we used to have state health care plan before the monetary system came in I liked that system very much and um the problem I handled Obamacare\nIs I Am paying a profit\nI end paying someone else's retirement plan someone else's", "show_name": "PRI's The World", "year": "2018", "city": "Rochester", "day": "25"}