{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more [noise]\nI'm Gary Miller are you looking for a good book to read that sign up for the thread newsletter text book to six seven seven six Seventy seven and I send recommendations to your inbox once a week [noise]\nThe radio and Jonathan Capehart and this is America on the line a news and call in show about the mid term elections from WNYC and public radio stations around the country\nWe're here every Monday through Thursday with the latest developments analysis and your calls on the issues that matter the most to you and with the returns less than two weeks away we're gonna feel we're going to get field reports from key battleground states tonight\nThere are these are some of the places that will decide who controls power in the next Congress will get to that in a minute but first the latest news developments law enforcement officials now say they believe a number of the pipe bombs mail to critics of President Trump or sent from southern Florida\nThey believe that all ten bombs including the three found today addressed a former vice president Joe Biden an actor Robert De Niro we're all sent through the mail President Trump this morning put much of the blame on the media and set in a tweet that the quote mainstream media must clean up its act\nFormer CIA director John Brennan the recipient of one of the devices responded via Twitter quote clean up your act tried to act presidential\nThe president today suggested that to dramatically reduce costs Medicare should pay for some prescription drugs based on the same lower prices other countries pay\nThe White House has also announced plans to send eight hundred troops to the Mexican border to help block migrants from entering the United states\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nMontana and Helen Peterson of buzzfeed and in Saint Paul Minnesota we have Brian backs\nAll of you welcome to America on the line\nWho joined us I just I just got to start with you simply because you're the farthest west but you've got to there are two interesting races in California but I Want to start with the race that involves incumbent ... a representative Devin Nunes\nAnd against the his Democratic opponent the attorney Andrew Janz what's this what's the focal point of this race well so it's\nInteresting because that race is obviously become one of national importance because diving ... who is the head of the house intelligence committee which has the committee that\nIt's supposed to be investigating whether or not president Donald Trump's campaign colluded with Russia to kind of took the election and his favor\nDoesn't mean that is in charge of that committee and as the head of that he has done a lot of things to block investigations he is I've been accused of colluding with the White House to block that investigation\nUm but back home in Central Valley California voters either don't really know much about what he's up to with the Russia investigation or they don't believe\nWhat they've read in mainstream media reports and Andrew Janz prosecutor who's running against him he knows that's the case if he's not really campaigning on that he's raised a ton of money off of the outside of the state but within the state he's campaigning on water issues uh Central Valley is a very agricultural they're very dependent on water\nAnd Andrew Janz of kind of trying to make the case that diving in as a so busy cooperating with the White House on Russia and other\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nSignificant competition that the ... Shelley ... chance behind by about ten points right now\nAll right ... Brian in Minnesota Bloomberg News is reporting that Minnesota is looking more and more like a bellwether for the country particularly in the house races at\nTalk about that yeah there are eight congressional districts in Minnesota and four of them are considered true battlegrounds there's a couple that are in open seats were democratic incumbents are leaving those are areas that Donald Trump won two years ago\nAnd one of them is leaving to run for governor the other one to step decide to run for lieutenant governor different ticket didn't make it through Republicans have a really strong shot at capturing this seat in northern Minnesota where\nDonald Trump has been you know his his working class messages really resonated in southern Minnesota the trade tariffs are causing some uh\nTrouble for his party because the ... it's very farm heavy so the Democrats are trying to hold on to that and they might have a shot at that and then there are two suburban seats where Donald Trump is is a focal point a lot of suburban women are cool to Donald Trump Donald Trump actually endorsed one of the Republican incumbents this week in that race\nThat incumbent hadn't been trying to keep his distance from the president's so there's some question as to whether that will really help him or if it will be more of an anchor around his neck or the Democrats who are running in these races are they making Donald Trump a focal point are they trying to do with Andrew Janz is doing in California and talk about ah issues\nThe two Republicans running in these open seats in in kind of more rural areas they're given a big bear hug did the president they both appeared within the president came to town and both of their districts the president's or ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAll the actions of the president's taken and then the other one your pulse and who's kind of more of a moderate Republican who is like I said tried to keep his distance from the president\nAnd he he's running behind right now ... what's going to end Helen Peterson in Montana welcome back to this to the show and\nPresident Trump or be he's been to Minnesota oh a lot in North Dakota are a lot but he's been to Montana a lot ah he's thrown his full weight behind Republican state auditor Matt Rosendale who's running against the incumbent Senator Jon tester why is Montana such a huge priority\nFor the Republican Party [noise]\nYeah you know like you said he's been here three times since the first time he came was July ... and I think you know I honestly think that a lot of it has to do with the facts that tester and his role and with the\nWith veterans services the Veterans' Affairs committee and was one of the\n... the list of complaints against ah the president's doctor who he had nominated to\nA service head of the VA um those complaints were not investigated or or confirmed necessarily but on the doctor did you resent his his application the next day and Trump just sees that as an enormous affront he said afterwards that he thought that test or should resign\nAnd I think you also just doesn't understand how he could win big in Montana you know he won by nearly twenty percent and yet the state elect Democrats like tester and our governor who won the same year that Trump won\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\n... in a profile of tester and the Atlantic were tester said you know like I'm a democratic senator and I've never voted straight ticket and that and to a lot of people I think feels an accent add to\nWhat a Democrat or Republican would be like how could you vote that's going on in your party it's totally old school but there that eat those have person over party really remains here it's it's dwindling but it still remains enough at ... at ... thinking on\nWhy early on in in this shows life we did a ... you know a big focus on Montana and the color the folks who called in they made that very clear up Montanans are very independent has nothing to do with the party that has to do with the person I just let me come back to you in California the other race\nUm that is of interest is the one involving the incumbent congressman Duncan Hunter\nUp against a new a newcomer Democrat twenty nine years old um our company ... hunter is under indictment for misusing campaign funds\nAnd camping notch are as I said is twenty nine years old but he's also a Mexican Palestinian American or in this race in hunter hasn't been shy about using his challengers ancestry against him take a listen to this ad\nA markup of jars working to infiltrate Congress three different leaves to hide his family ... his grandfather masterminded the Olympic messages whose fathers deserved\nMexican millennials immigrant named mark ... doesn't get support from the San Diego\n\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWho happens to be pretty optimistic we'll take your calls here's the question what are you personally optimistic about eight four four seven four or five\nEight to five five you're listening to America on the line [noise]\nProgram he supported by ... rarely whose trial lawyers meet the legal challenges of a wide spectrum of corporate clients here in Minnesota and across the nation bastard rambling a fresh approach to an age old practice more advanced word dot com\n[noise] on the next year NPR News presents a Westminster town hall forum Dr Mona ... research expose the lead in children's blood in Flint, Michigan she talks about the lessons we should learn from the plant water crisis tonight at nine\nAnd right before that on fresh air Michael suck all of a contributing writer for New York times magazine he's written exclusively about sports in the psychology of sports\nHis books include ones about baseball's Pete Rose and Darrell strawberry and Women's Sports injuries his new book is the last temptation of Rick Pitino the story of corruption scandal and the big business of college basketball and I ate a fresh air\nGets the twin cities weather forecast via text every morning send the word whether to six three seven three five and every morning you'll get a heads up from the NPR News the other team on your phone call these guys around the states and I had a chance\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nGuys are cloudy temperatures fifty two\nSays\nI'm trying to pay for it and you're listening to America on the line a news show about the mid term elections from WNYC radio and public radio stations across the country\nThis is Ben what are the most turbulent election cycles we've experienced in a long time but we've been here before some of you listening live through the tunnel of Nineteen sixty eight the assassinations of Martin Luther king and Robert Robert F Kennedy and the massive anti war protests and then there was the political turn of Watergate\nAnd the question is what lessons did we learn and can we get back\nOn less divided ground here now to talk about where we've ban and where where we are and where we're going is James Fallows national correspondent for the Atlantic and co author with his wife debt Fallows of our town a one hundred thousand mile journey into the heart of America\nWelcome James I just want to remind everyone that the question for tonight is what are you personally optimistic that optimistic about call us at eight four four seven four or five eight to five five\nSo James have you ever\nIn all your years of political reporting seen a political climate like this\nUh this you very technically we're down to spend a lot of years of seeing politics in college back in the late Nineteen sixties and so\nI've seen things I haven't seen anything just like this because there's never been anybody just like Donald Trump but there are times in my lifetime when American politics have been I think objectively worse than now\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nShot a you know mainly African American people being shot so this is a bad time and national politics is not the only bad time the U.S has had\nNow James discovering that live bombs were center prominent critics of President Trump including two former presidents would seem like an inflection point that we're we're in not only in this election cycle but in the country but is it and can it be\nWhen the president of the United states blames the press for this moment that were in\n... so let me try to be careful and distinctions here on the one hand\nI yield to nobody and thinking that Donald Trump is an aberration in this job is uniquely irresponsible in the way he's summing up the worst impulses in American culture in spirit so I I Will not make any defense whatsoever for what he says about the press what he says about ... relations among the\nDiverse parts of the American fabric or an eighth I think also that sort of an oddball thing I Will say on this this terrible terrible bomb threat\nIs that um I once worked one go for a president I worked for Jimmy Carter when he was in the White House there was a speechwriter anybody in public office is used to dozens\nOf daily threats one kind or another you know this is not minimizing this at all this is horrible Trump in my view is sort of fanning the flames I Would be weary of thinking that\nAll of America is some in some kind of um [noise] uh you know new civil war because some guy did this you know there have been people doing extreme things before some person did this\nWell let me ask you\nProgramming and supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk for hours on race YWCA end he L. S. dot org\nI think the cable news cable TV news in particular has been caught in a\nIn a cycle that is really a ... that they recognized from a distance is a problem but it's hard for them to get out of the one go back when most of your listeners were children back in the mid nineties I wrote a book called ... breaking the news and that subtitle was held a media undermine American democracy and his argument was\nThat if the news gotten the business of being head to head competition with entertainment that was going to be a sort of destructive cycle because\nEntertainment by definition is always you know more interesting more entertaining and the news is designed to have some kind of bulwark to say we're going to show you what's important\nAnd make it as interesting as we can but not just a speck courtroom spectacle at the moment I think that there's been a combination of ... of cable news in general sort of feeding the spectacle\nAnd over the last twenty plus years there's there has been just objectively a right wing um media empire has has made it easier for people to believe things that aren't true so I think that the media has been part of a divided ecosystem on national politics are but I'm not echoing\nIt'll what Donald Trump says in in making that point mhm\nWell is is any of this a fixable either in the near term or ever\nUm yes and I think as another former president said it depends what the meaning of this year [laughter] so so if we're talking about um the fabric of the United states the argument that that my wife to I've been I've been making for the last four or five years in the Atlantic in the in our\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nTo reconstitute their civic fabric and the last five or six months we've been sort of an open ended book tour in\nRed state America mainly where people say yes run the show you Little Rock Arkansas let a show you Bellingham, Washington Leno's show you Pensacola, Florida let a show you Muncie, Indiana these places where\nPeople can find a way to stop arguing about the sort of fratricide national politics and\nExperiment with their schools and experiment with um with ah with all sorts of things can I tell you a story about dodge city we have time for\nUs so it goes I I I was going to get to dodge city um after asking you about asking you about your book which is called our towns a hundred thousand mile journey into the heart of America in which\nYou you did this a hundred thousand mile journey and despite the ... the seeming freak out that is happening around the country particularly if you're looking at at cable news you came away from that trip and even in your comments in this interview right now optimistic\nAbout about the country and I do ... explain why and and incorporate dodge city into your hands yes\nSo first I'll have a definition of optimism that I came across recently met probably many people know but it was new to me a one poll rumor won the Nobel Prize in economics a week or two ago somebody I've known them like he he distinguished\nWhat he called complacent optimism which was the belief that things will get better from what he called conditional optimism which is the belief that they could get better and that they could get better if you try and if you get engaged and if you're involved et cetera you know for me\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\n... winning Maine to express and I'll give you the dodge city except I think most of your listeners saw the story last day or two of the polling place in dodge city famous from the gun smoke westerns now a majority which you know town the polling place being moved away out of town\nTo a you know apparently just to depressed turn out by the ... Latino electorate there and darts dodge city um when we were in dodge city uh two two years ago at some great length we were impressed that the mainly Anglo\n[noise]\n\nProgramming is supported by Bremmer wealth management offering client centered wealth planning Asset Management and trust services to help clients reached financial goals visit Bremmer dot com to learn more river wealth management for what's ahead on the next fresh air\nCorruption scandal and greed in college basketball which helped with Microsoft love about what he calls the buying and selling of basketball players\nSome as young as eleven it involved in sports apparel companies scouts coaches parents financial ... something years and billions of dollars his new book is the last temptation of written Tina join us [noise]\nAir coming up in about twenty minutes here on NPR News then right after that\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nCrisis resistance and hold it in American city [noise]\nChecking the current conditions around the region Fargo Moorhead reporting some drizzle and fifty degrees international falls forty seven blue light rain and forty five it's also a forty five degrees\nIn Saint cloud Worthington in Rochester both reporting forty eight degrees of this hour in the twin cities guys are cloudy the temperature is fifty two\n\nAnd Jonathan Capehart and this is America on the line from WNYC and public radio stations across the nation\nBack with my panel and we're taking your calls and again our question is what do you personally optimistic about maybe it's related to the election or something more personal give us a call at eight four four seven four or five talk eight four four seven four or five eight to five five\nBefore I even go back to the panel I'm going to put them off to decide because we've got Molly from east blind Connecticut\nOn the line Molly thank you very much for calling into America on the line why are you so optimistic\nAs well um yeah if I if I can get and you know I'm Eighteen and I'm Still in high school and sell my\nCivic involvement I guess you know they started praying recently but he doesn't then it may seem really athletic as even politics I really chaotic I guess even at a local level that especially in a national level\nI notice so much involved in it from people in my generation and people my age being motivated to organize for things they believe and like I had the\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nMy generation is sort of like you know making sure that we're educated and involved about the issues that are going to affect us in the generations that come after us and that gives me helped show over at\nMy let me ask you a question since you are of that generation that we old folks are always talking about the young people young people are not they're not motivated and the young people don't vote in the young people don't care how you feel about that\nWell I feel like sometimes when people say things like that to me I say well did you vote in the primaries are you register or you\nCan have you research the candidates and a lot of times these you know sometimes middle aged people who say things like that to me and my friends they can't say yes to those questions and a lot of us can and so I think that you know I think that people should give us a chance as a demographic and give us a chance and realize that\nA lot of us are willing to educate ourselves regardless of you know what side we fall on\nMolly you are part of that that Parkland generation that makes me optimistic about the future of our country thank you so much for calling in to America on the line\nThank you so much for having me let's go to Matt in white ... New Jersey not thank you for calling into America on the line\nHey how you doing thanks for taking my call\nSure why are you optimistic\nI'm optimistic I'm a therapist by trade and and I I I can tell that America's scene seasons like this before where there's intense optimism and there's a tense disagreement on both sides and like I think that I'm optimistic about both sides getting serious about each other's pain and I'm not saying the pain is you know\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nAnd say well why why are we even doing that ... what's your pain what's my pain let sharing that and let's try to get some understanding and I think my generation I'm\nI'm twenty nine and you know even a caller before me at Eighteen I think our generation is a little bit more emotionally intelligent um if I may say so ourselves that for a little bit more emotionally inclined to kind of go deeper and I I'm I'm really hopeful that we're going to start to get curious about paying again\nMatt I ... I ... I like that I liked that description of your of your generation I'm going to steal it [laughter] Matt thank you [laughter] thank you very much for calling into America on the line I bring the panel bet my panel back and Brian Lehrer host of WNYC use the Brian Lehrer show and buzzfeed correspondent\nAnd Helen Peterson who's calling us in\nMissoula, Montana uh Brian\nWhen or want you to bring us up to speed on the uh the the pipe bombs and what's happening here in New York City and how local leaders are handling the situation and how residents are doing\nFirst of all math for president in the last caller yes maybe he's the one who bring everybody together with Mali as vice president that's right and and hell and Peterson I was reading an article about\nThe Democrat book out in Montana and you know you wrote about people who voted for Trump for president and Democrat Bullock for governor and just thought Hillary Clinton didn't listen to them or care about them so\nIt's one of the sixty four million dollar questions can Democrats appeal to white swing voters instill legitimately represent the base of people of color and progressive white women in the party\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nAnd I think again a lot of the sensationalizing media are getting ahead of the fact we don't know who did it we don't know the motive\nActual right wing terrorists fake right wing terrorists on meet the press Chuck Todd wondered if maybe someone working for Russia Russia trying again just so divisions in American society\nHe wasn't positive that he was just hung up his hands and saying we don't know maybe this is just the mentally ill persons expression of their disease\nAnd soon there will be answers but we don't have them yet\nNow listening to New York city officials that their news conference today\nThey wouldn't even confirm if the devices were actual explosives that could actually explode or look alike devices just intended to cause fear that would still be terrorism right intend to cause terror for political reasons but we don't know if these were actually attempted assassination or big grotesque\nPublicity stunt I'm\nAs a New Yorker and a New Yorker who was here on nine eleven and two thousand one we go on with our lives that's been the message from the mayor of New York and the governor of New York we're not going to be intimidated by this assuming these are real devices were going to go on with our lives\nAnd law enforcement is going to do their job um to figure out what's going on here and I think that's where we are\n... and Helen I'm going to take a a a hard turn here because I Want to have you talked about that the voter suppression efforts that are affecting Native Americans in Montana and a lot of people are focused on those efforts in North Dakota but what's going on in Montana\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit while he WC A. M. P. L. S. dot org to learn more\nYou can have up to like ten twenty people sharing a post office box and but then also just driving distance and that sort of thing\nAnd one thing that I've seen him and I have a big story coming out on this and this weekend is on the reservation and then add a reservation town in Utah you know it's not just the distance that you have to drive it's not just the fact that the vast majority\nOf citizens are currently you'd miss located precinct why is because\nYou know there there were placed decades ago\nBefore their GPS coordinates so like the registration is ten miles north of the chapter house that sort of thing but it's also the fact that you I on the Navajo reservation there is a huge number of people who don't speak English and then tell", "year": "2018", "show_name": "PRI's The World", "city": "Rochester", "day": "26"}