{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the ... family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n[noise]\n\nThis is Northeast Public radio WAMC up an HD Ninety point three Albany\nW are you in a ... point three rooms and Utica W. A. M. K. HD Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WC EL HD Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. N. C. H. D. one oh three point nine tie kind of rogue W. A. M. H. D. one by one great Barrington\nW. W. E. S. H. D. eighty eight point nine mount Kisco W. A. N. G. H. D. Ninety point one Stanford W a an eighty eight point by Brewster and WAMC am fourteen hundred Albany\nThe following as an encore broadcast from the twenty sixteen twenty Seventeen season of the Boston symphony orchestra for information about the current season of the BSO visit us on line at classical WC R B dot org slash BSO [noise]\nFrom simply hall in Boston um runs on the key is welcome to UCR be broadcast above Boston symphony orchestra [noise]\nThe striking qualities of music by Thomas office have made him one of a major musical voices of our time\n[laughter] I Know\nIn a newly expanded artistic partnership artists in the show confront the mysteries of the end of life through free works including his own children as well as Benjamin Britten lose some phony or don't read [noise]\nAnd ... the final word by finished composer guns debate [noise]\nArtistic Thomas artists conductors on music and matter of Britain and some big was coming up on me Boston symphony orchestra broadcast from that what you see are being a part of WB inch Boston [noise]\nThroated history of the Boston sympathies artistic identity has been enhanced and brought in by collaborators other than its music directors\nPrinciple guess conduct is like for instance or call them Davis have added interpreted variety and insight to the core repertoire dozens of composes from Aaron Copeland to Ellen takes we'll\nHave shaped the musical conversations are newly written commissions and hundreds of shows have lived their own infringe on PBS or performances through distinctive interpretations\nBut one collaborator has fulfilled all of those rules with such gradients that the BSO created a brand new title for him\nThis season march the first would Thomas at us as artistic partner\nA multi dimensional collaboration\nAccomplishes performances as both a conductor and pianist as well as a bench in over his voice as a composer I'm Ron ... are joining us from WFCR be broadcast booth symphony hall\nHere in Boston back this broadcast from symphony always supported in part by the Gregory Bolger foundation dedicated to supporting the performing arts in greater Boston\nThe programs Thomas artist has led senses be sold debut five years ago have drawn uncommon lead\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAddict statements that transcend the message of any of the individual works\nFor instance in two thousand twelve music by the biggest in for coffee of combined with one of his own compositions do expressly active creation\nFollowing season the experience of being on a voyage both literally and figuratively ran through works by Mendelssohn lives from can once again his own music\nAnd as this new level of collaboration gets started this week program is no different\nFeaturing to compose whose whose music is central to Thomas Dodd as his own artistic identity and background Benjamin Britten and John ...\nFirst artist leads written sin phony at the ... and that's followed by eating velocity of tone ...\nThe second half of the program features one of his own major works ... times or dance or death with mental super on Christiana still game and baritone mock stone\nAlready two of those titles and pony directly him and dance of death ended one friend that runs through this program\nBut according to Thomas Dodd is the third piece top of yoga has roots in the same emotional landscape\nDisadvantage to the last piece um I mean very unusually he lived for another thirty as most complete ... the lowest paid some that's pretty much it but there's like there's something like a sort of ultimate statement about this stuff you know it's like he really got\nTo the core or something and sort of right into the house of things and how things are one thing that comes from one by the day and it's got the speeding and as\nBeing like the end of the world in a in a in an interesting way like he writes about the forests of Finland and the the whole feeding of it as this is this endless and on people's\nWonderful wilderness on this the great wind up there and the great storm famous storms as one of the great but several cuss for writing and\nThis is it feels like the right thing to put in a program about kind of ultimate destination [laughter]\nAnd it's for the peace it begins as program Britain and phony a de ... Thomas hot as there is that it was both to compose this incredible musical gifts\nAnd the time in which he live\nIt made him an icon in his native country\nBritain's on national composer for ten to ... and\nI mean in a piece like this is by far the most violent piece of music anyone in England said written that time he broke a lot of rules in Britain and conventions back in my\nCountry rich or even in the thirties was was much stuff here more conservative place in a way then it became the second World War and everything and courts change because of this peace day from the heights of\nOn it really feels like he's writing about the ... but you as a whole range of\nOffensive predicts here at the same time from the bay comes into play his scenes of of disturbing pictures\nI think it belongs in the same welfare I mean you know\nSomeone like me and my generation I'm so maybe we wouldn't be where we we are on without Britain\nThat's being so artistic partner Thomas artists and you can hear much more from this conversation on WC arby's podcast the answer the question\nJust subscribe in I tunes\nOr go to classical W C R B dot org slash fear so\nBritain's seemed phony or directly um dates from Nineteen forty\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nNeural composed the roots of the peace we're more personal his mother had died a few years earlier triggering the impulse to explore the passing of life after Britain left England for the United states with his partner Peter Pears he acted on that impulse to create a purely instrumental work\nInspired by three parts of the right way to\nLock remote or full of tears UCLA the day of rats in requiem he turn them for eternal rest\nYou'd likely most of the struggle against that plays out through a continuous harmonic if you have it between the minor key realm of war and the major key\nApplication piece on defense by the fears some tension about relentless slow much attention finally breaks\nInto violence with your rival does it use he had a hate described by the composer is a dance to death with occasional moments of marching with them\nIn the notes for this concept Stephen laid better right to the frenzy movement filled with arresting orchestral color giving an impression of disjointed fragments but in the final movement regularly may turn them a gentle openness takes all the flutes gently ... into a beautiful peaceful place\nA closing at the time Britain\nFrom votes forty was actually at odds with the world around [noise] now coming on stage that is almost ... so we get this Boston office the concert with Benjamin Britten loosened phony directly from WFCR\n[noise]\n\n\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\nSending an appointed fun for like ten of struggle was Benjamin Britten phony or directly for them to a concert here in Cincinnati home by the Boston symphony orchestra and conducted some exotic\nThis work was performed for the first time in Nineteen forty one by the New York for the money is going to be much later whiskey conducted the first Boston symphony performances\nAfter which the Kentucky arrest written why hadn't compose an opera\nThat nobody's asked me to fool me was he replied you write I performed the result was feeding rhymes performed in Nineteen forty five and England and performed the first time in this country a tangle with with the doctor in which people Leonard Bernstein summers on its back to the podium\nVowing to the audience here in city hall for performances reopening worth and there's no grand Benjamin Britten and phone either weekly I'm Rhonda I'd like to use that\nSimply holding the broadcast bringing your weight conscious broadcast at the Boston symphony orchestra in just a few moments this concept will continue would not be a tone poem by John too big us it's the last major work by the composer\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nViola he's inspired beat by beat ... an epic collection of folk tales lyrics of narratives\n[noise]\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\n\n\n\n\n\n\n\nStreaming support for WAMC comes from Albany med now will in the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\n\n\n\n\n\n[noise]\nYou just heard viola by guns in Vegas the woman said you were pretty hard by the boss of the orchestra and conduct a comic artist [noise]\nThe last major work as we mentioned [noise] even though we live in another Thirty years after we did it [noise] we had friends that have sympathy from Santa Cruz risky for the fifth anniversary that never materialized [noise]\n\n\n\n\n\n\n\n\n\n\n\nStreaming support for WAMC comes from Albany bed now will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\n\n\n\nStreaming support for WAMC comes from Albany may now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\n\n\n[noise]\n\n\nEverybody was a baby so there's two aspects to it and so it's really like kind of\nI mean to one so part in so much the whole permitted kind of balance that gets right to this sort of final point about stuff that was the the way what\nThat's come as artists on the peace we're about to hear so intense or dance of death\nLondon one time I saw it as\nOne in London Nineteen Seventy one reporter lift a composer\nAnd some of his compositions includes free offers\nThe most recent the exterminating angel which was premier that these two thousand sixteen Salzburg Festival and will be heard of the royal upper income and gotten\nPowder who face which was presented at the children ham festival in Nineteen Ninety five and The Tempest that was commissioned by ... garden in two thousand four\nWas subsequent productions at the Vienna state opera the Metropolitan Opera and elsewhere many or casual works too including a sign up a table I'm also a polaris that'll be performed a tangle with this summer by the way the violin concerto concentric paths\nAlso in seven days a piano concerto with moving image\nAny chamber works too including a string quartet Arcadia and the four core attached and the piano quintet as well recently appointed the Boston symphony orchestras first ever artistic partner has to be as soon as Deborah and Philip Edmondson artistic partner for three seasons\nAnd here he is coming on stage [noise]\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nStone and how much that is and this Boston symphony orchestra concept will continue with his tone in talks for cancer deaths from WFCR beat\n\n\nOh oh oh oh oh uh\nYeah it's a it's a what's the\nOne\nI Know I it's\nA\nVery good oh my God\nUh\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nUh oh uh\n\nOh oh\n\nOh\n[noise]\n\n\n\nYeah I mean\nWhat do they know oh it's fine yeah it is\n[noise]\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\nGod\nUh [noise]\nMhm but I I I Know I'm Wondering why yeah who is\nMhm\nI Know that you know [noise]\n[noise]\n\n\n\n\n... oh\nMy God it's\nThe [noise]\nYeah\nI'm\n...\nYeah I'm a\nThe families I sent an a ha ha ha ha\n\nYou\nKnow I really really goes from one needs\nTo be you\n\n\n\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nHa ha ha ha ha ha\n\nHa ha ha ha ha ha ha ha ha ha or na\nNa\n\nNa\nI'm I live\n... ... basically\nDreamy support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n[noise]\n[noise]\n\nMm [noise] Mm\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\n[noise]\n[noise]\n\nRight\nNo\n\n\nMm Mm [noise]\n[noise]\n[noise]\n\nStreaming support for WAMC comes from Albany med now will in the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMhm\n\n\n\n\n[noise]\n\n\n\n\nMy momma momma momma [noise]\n[laughter]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\nMm\nMm\n\nOh we\n\n\n\nThey are by\nWhat\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\nStreaming support for WAMC comes from Albany may now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot E. D.\n[noise]\n[noise]\n\n[noise]\nMhm right [noise]\n\n[noise]\n\n\n\nMm\n\n[noise]\nMm [noise]\nMm\nA coal\n\nGot a\nCall [noise]\n\n[noise]\n[noise]\n[noise] ah [noise]\nMhm [noise] wrong on\nBy a ... [noise]", "show_name": "Live At the Linda", "year": "2018", "city": "Albany", "day": "08"}