{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from my dog ... dot com no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com [noise]\nThis is Northeast Public radio WAMC ... Ninety point three Albany W. R. UNH the Ninety points reruns in Utica WAMC ... Ninety point nine Kingston doubled you away sorry gene Ninety One seven Middletown W. U. C. L. A. G. Ninety One nine\nPlanets are WC A. N. H. D. Ninety three three kinda G Harry W. A. N. C. H. D. one oh three nine tie counter Rogan WAMC ... five one great Barrington W W E S H da da na ... Kisco WINZ Eighteen Ninety\nPoint one Stanford W and our eighty eight by Brewster WAMC am fourteen hundred Albany [noise]\nGrieving and welcome to live at the ... I'm Carl blackford manager and program ... and with me is Matthew plumber cylinder is technical director and sound of Matthew and I are sitting in the lenders controlled overlooking the stage\nWill be your hosts tonight as we share with you some of the most upstanding performances from some of the greatest musicians to the free ... performing arts do most of what you'll hear or concerts from over the past year for when an artist is returning to the venue for flavor last concert so you can listen to what's\nComing up at the window and every once in a while we're going to dig back through the vote and pull out of favor concert tonight's broadcast features the big takeover with special guests Dr\n... and the love profits from their February of two thousand Eighteen concert at the window\nWAMC is performing arts studio so prepare yourself for an evening of high energy reggae and soul right after this news update from NPR\nLive from NPR News in Washington I'm jak sphere the FBI is providing new details about what it caused potentially destructive devices center various high profile Democrats and the cable news network NPR's Barbara ... has the latest\nThe FBI describes five suspensions packages that were address two leading Democrats all large manila envelopes with the return address Congresswoman Debbie Wasserman Schultz his office in Florida\nThe targets former president Brock Obama former CIA director John Brennan by way of the CNN office in New York George Soros a frequent contributor to democratic contest Hillary Clinton and former attorney general Eric Holder\nThe FBI says the packages are being sent to the laboratory in Quantico, Virginia for further examination it'd be real often says it's possible that more packages are still out there by ... NPR News in Washington\nState media have published a security camera image of what they say is a vehicle blind to the Saudi consulate purported to be a scouting of forest in the outskirts of Istanbul part of the killing of journalist ...\nImage obtained by state TV and other media today shows a black car with diplomatic plates and an entrance to Belgrade forest Turkish president Recep Tayyip everyone has accused constantly officials are making trips to that forced and another area the day before the show was killed\nSaudi officials have claimed the journalist died after a fight broke out inside the Saudi constantly nuts and bolts\nOf federal judge today is ordering Georgia elections officials to accept absentee ballots and ballot applications with questionable signatures member station WBUR a being Atlanta has been trauma reports\nThan two thousand absentee ballot and Georgia have been rejected so far in some of them because people think that you're on the ballot on blood don't match what's on file civil rights groups filed\nStreaming support for WAMC comes from my dog harness dot com no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nSubjectively determine that there are things are so much even though people signatures can change for a variety of innocent reasons\nUs district court judge lean may ordered elections officials to give voters an opportunity to resolve the issue within three days after the midterm elections for NPR News I'm just named ... in Atlanta\nVolatility on Wall street today all three of the major stock market indices were down two percent or more dying of ... an economist at grant for it in Chicago she says one reason many investors are so rattled the moment is the direction of stocks of stopping predictable\nUnfortunately the complacency Wisconsin Anton markets wasn't the norm the volatility we're seeing today is more than ... and you know the audience never as pretty as what we like it to be with\nToday's major declines blue chip to now down seven percent from their all time highs checking the numbers the Dow dropped six hundred and eight points today that I was\nAbout three hundred and twenty nine points this is NPR Democrats have been aggressively attacking Republicans swept the midterms were trying to repeal Obamacare as election day approaches Republicans are fighting back NPR's Danielle Kurtzleben has more\nMore than half of pro democratic TV ads in the home stretch to election day have mentioned health care compared to around one third of pro Republican ads according to the Wesleyan Media project\nThat's a big change from twenty ten and twenty fourteen when Republican slammed Obamacare and Democrats barely touched the topic\nNow Republicans have ramped up their own messaging in a recent crop of ads GOP candidates promise to protect people with preexisting conditions however experts say the Republican Obamacare repeal do would likely have made insurance prohibitively expensive for some sick Americans Danielle Kurtzleben NPR News guitar maker\nGibson which hopes to emerge from bankruptcy next month plans to do so with a new leadership team news released today the Nashville based company says James Jaycee Curley will become president and CEO of the company really worked for Levi Strauss and companies president of the Levis brand that was a member of its global leadership team\nOr the leadership includes ... who be board chair under the new majority ownership group of the global investment from K. K. R. story brand Gibson has been building musical instruments were a hundred and twenty four years\nCompany will be abandoning efforts moving to the home entertainment and headphone categories that accounted for much of its debt roughly five hundred million dollars\nGo to a futures prices gained ground rebounding slightly from a two month low oil was up thirty nine cents or ... today and the session at sixty six eighty two barrel in\nNew York I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men\nStarring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nSupport for WAMC comes from Troy traumatic concerts present things used donated philharmonic chamber choir and a talented chamber orchestra featuring works by Bach and Estonia and composer paired November eleventh at Troy musical Troy traumatic concerts dot org\nBeach medical services queens Bernie are working to increase access to diabetes care weight management and primary care five ... five six three fifty nine hundred for appointments\nIn ... north Adams best who sits presenting indie pop the powerhouse tune yards with us girls\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills to support for long term success with we've got strict to me and gastric bypass surgery monthly seminars open to the public or went three three nights five Seventy five one zero to register\nLinda featuring the big takeover with special guest Dr John the love profits from their February of two thousand Eighteen concert apple into WAMC is performing arts studio\nFor the last Twenty years Dr John the love profits have been a strong force and the reggae scene of New York's capital region where the repertoire including songs promoting political activism\nAnd tune promoting peace love understanding and fun times Dr John the love profits truly encompass the re gate sound and vibe\nThere live sets are legendary in the local music scene and are bound to get your dancing with a mix of select covers and the originals so enjoy the opening set of the evening from Dr John the love profits featured Dave go Kagan on guitar and vocals P. O. heard on guitar and vocals\nAshton robot Ellis on base and vocals and I met ... drums recorded live at the lender on February ... two thousand Eighteen [noise]\n\n\n\n\nVery very common\n[noise] Florida which is near la\nDa da na na na\nNa na na\nNa\nShowing liberal\nBut there are they\n\n\nRun around and you're the rules agree yeah\nGetting already a drive through bridge or a bureau there\n[noise]\n\nDo we know where we're\nTroy\nAlone we're going to apply the\n\n\nIn the same you\nBy with Dr ... remember\nThe doctor\nTurned out to the\nDoctor for a job this\n[laughter] [noise]\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health system is providing orthopedic services in the Berkshires including may go robotic surgery sports medicine an anterior hip surgery for what three four nine nine six six zero zero [noise]\n[noise]\n[noise]\n\n\nOh from among among bom bom bom bom bom bom ...\nBy the way in terms\nTo do what\nAre the best job the\nTech jobs\nJobs jobs\nThey need\nWill\n\n\n[noise]\n\n\nHe can remember\nMom I'm calmer\nNa na na na money money money I have to learn a\nOne I gave him into the lead man I Wish I knew that\nAli without a father who my ... I wasn't I gave it to about ... I Would\n\nCan I ask\nWhat I\nI\nSaid well why\nYou watch like they now call I'll Try to do you want or\nDon't dig it up maybe we do you hear what I said now\nTo\nThan\nTo actually talk to your wife\nI\nWhat I\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog hornets is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that says that reviews at my dog Curtis dot com part of\nThe\n\n\n\n\nYou gave it to\nAny [noise]\n\nI wouldn't mind getting mature the ball in mind when I\nI wasn't ... about it um\nHollywood I knew that I Will not do a\n... year was I think they know what's going on in the in your dreams are on the call to manage or do you watch the you know I really do you do your adult\nLife ... come on let me get me out to the third call up your wife the jurors debacle gardener\nThe book I stay out\nI go\nThey were both of them you know do they want a good number [noise] I've been wanting\nTo know what you know there wasn't\nAnd she wants to know what I'm interested\nIn or politics they bought my\nThe ball and then they bought mine\nYou are right\n\nWas\nEver Dr Josh been great to be with you we don't learn on the guitar\nSome ear on the drone [noise]\nStreaming support for WAMC come from ... which toward in homes and businesses throughout the northeast today's soap stoking automated would he would boilers dot com\nOh freedom from the heart freedom [laughter]\n\n\n\nWell what do\nYou\nA holiday\n\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke no poll dog ... to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com\n\nThank you run\nA good job and I love his knees\nYou can't\nDo and then a man and gaining some day and age and\n... and do you tell you the truth I don't know who the news and what\nThe ... gonna do in\nNo way I'm paying ... way\nTo get them on the tray and I've got the bill and burned and wherever they be I don't know I'm a big no no way\nAnd how it all goes way back\nAnd then on the tray and how can\nProblem than\nThe black guy football but not\nNot to make sure we do you have to be true when you're\nGonna do once you're done not who I Am proud and pay me\nI'm kind of know Mel landing\nPhone call\nKnow\nUp to date on trade I'm going to come\n\n[laughter]\n\nNot I'm not I'm not you know given no [laughter]\nI'm not I'm not from not only did that in New Hampshire\nEnough in common or not\nStreaming support for WAMC comes from my dog hardest dot com or no joke no poll dog ... to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis Dakota I\nAnd go on and on and try\n\n\n[noise]\nHome\n\n\n\nCan be [noise]\n\nGive it all in one that's got to them they can but it's a little bacon at all it's more about the\nAnd ... and I loved her you end up\nI Will let you go and\nGet a tree and he may\n... just a tree and what\nThey want and and of course you can you show three\nAnd when\nThey know alive\nI'm Glad I was\nAnd I didn't know and\nSaid I Will\nStreaming support for WAMC come from birch are Center for weight loss surgery where the focus on life skills to support for long term success with we've district to me in gastric bypass surgery luckily seminars open to the public or when three three nights five Seventy five one zero to register\n\nAnd to me they\nWant you to pull me a long time bowling the pay\nThat on your shoulder meal and then you\nKnow let me\n\nMe\nThink\nWay that will be a new way\nThat I Will\n\nNot make the\n\nGame and [laughter]\nPoint one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point one Stanford W ANR eighty eight point by Brewster and WAMC I Am fourteen hundred Albany so let's get back to the big takeover on live at the Linda [laughter]\n[laughter]\n[laughter]\nWhen you look\nShe was in may\n\n\n\n\nWhen you look\nAt\n\n\n\nStreaming support for WAMC go from told them bio mass which towards homes and businesses wrote the northeast today's soap stoking automated would eat with boilers dot com\nAnd\nAnd I mean\nDo that\nThere have been the\nShould\nThey\nDay [noise]\n\n\n\n[laughter] [laughter] [laughter] no\nHave done that in mind not diminish what\nI think I Know they have they told me was the name ... or the\nToo much away the Denver\nActing like they're known or they do do me one day she may\nMean in the un\nDidn't want to take me away\nDid you want to thank me\n\nYou know\nNobody knows they miss your way but then the\nI didn't know they know or they don't normally when the baby\nMacho what what\nDid I Know now that I'm\nHe ran\nFor a new one\nMeal\nA brand new one\nA new one [laughter] you\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for what three four nine nine six six zero zero\n\n\nIf\nYou want\n\nUn me I'll\nYou\nWhat\nYou\nTo think\nCheese\n\n\n... [laughter]\n\n\nBe that cannot be paying that much I Wonder why\nNeed to watch [laughter]\nI never could you hold on\nGoing to\nIt'll\nBumper I don't I\nDon't know how to run up to the the are going to have no\nKnow that\nThey know\n[laughter] yeah\n\nNot getting on that because I Know\nI Know I\nMean\nIs not that complicated\n\nNa\nNa na\nNa na na na na na na na na na na na\nVE Day in and day and\nAge maybe [laughter]\n\n[laughter]\n\nSupport for streaming WAMC come from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners in the pioneer belly and beyond Davis financial G. R. P. dot com [laughter]\n[noise]\nWe um we're in a play\nBecause he doesn't sound [laughter]\nI Know I said I Know no one is nothing but this is my favorite hoped I'd go back and forth every day I just can't make up my mind is one of the new law\nThat somebody like that\n[laughter]\nCreate a toilet that she told me that [noise] I think we ought to know what I'm um [noise] what would you go to when my\nBe there [laughter] you could make you feel [laughter]\nI'm not good and the British dry but not for the diameter\nYou know one\nThey try to be the candidate could feel it makes you feel that he ought not to even go\nBird that that's\nPizza makes you\nAnd I'm not pizza makes\nNot here to make your show [laughter]\nI mean if you want\n\n[noise] [laughter]\n[noise]\n[laughter] [noise]\n[laughter]\n\n[noise]\nStreaming support for WAMC comes from a dog ... dot com or no joke no pool dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love to the reviews at my dog Curtis dot com\n[noise] [laughter]\n\nDid you see\nHe meant to be\nTo hang out\nYou\nCan you hear me\nYou see in my home [laughter]\n\n\nBaby [laughter] [laughter]\n\n\nMan\n\n[laughter]\n[laughter]\n\n[noise]\n\nOh\nWe're going to do this this one this is this song is a song that I'm I'm\nOn the set list that we is on our first album that we really um I don't know if you know but we really recently celebrated our ten year anniversary [noise]\n\nWe were a ban for for ...\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills to support for long term success which we've district to me in gastric bypass surgery luckily seminars open to the public for when three three nights five Seventy five one zero to register\nAnd music like in the new book area and people used to love this song and then we like you know legal stuff and then we didn't play it for many many years and then we played that in the university show and then my my niece actually he said to me\nSome way to Rome I actually think like like that's like the only song that she knows the because that's that was when we first started we take over and over ... and I'm so she remembers red robe and she came here tonight and she doesn't come to many shows\nAnd I put it on the lists no one knows that\nWhat that's why I put them on the set list the guys are like what are we play in red robe anyway here it is a red room I Hope that somebody knows it and like that I Know Chris do that [noise]\nHe does not have thought that he does\nStreaming support for WAMC comes from a dog ... dot com or no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with low doses of reviews at my dog Curtis Dr\n... [laughter]\nIn history\nTo be higher and higher than three to go through and they had run by the white\nFor me I didn't have got to be well how do\nNo doubt come\nThat's what my time in the cold outside my window I mean they're in college my trip I took on hold on let me out told on up here\nDo my my main job yes well what if that hot [noise]\nOf the shah\nDa\n\nDa na\n\n\n\n\n\nShe murdered blah blah\n[laughter]\n\n[laughter]\n\n[laughter]\n\n\n[noise] thank you [noise]\nReally ads on TV that's about\nAnd um I like purpose it by saying\nTo people that are listening to it that we put it together to urge people to forget about things that modern them in their mind and in their brain\nAnd to just let it go and the best thing to do that is to move your body it's like um you know it's like a thing that happens when you move your body you got to forget about things you should try it so what are we play the song tonight is applied today that we jump and when it happens it will be automatic\nDon't like to just let it go and jump without you will maybe like it a little\nHit by the ready [laughter]\n\n\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems karate orthopedic services in the Berkshires including may go robotic surgery sports medicine an anterior hip surgery for what three four nine nine six six zero zero\nWe have\n\nThat and and and\nHow we get along\n\nMany many\nMany things\n[laughter]\n\n\nIn well we had to\nAttention\n\nA job\nAnd they may\n\n\nAnd\nAnd and and\nAnd then\n\nDuring the day\n[laughter] and\n[laughter]\n\n\nStreaming support for WAMC go from told them bio mass which towards homes and businesses wrote the northeast today's soap stoking automated would he would boilers dot com\nAnd [laughter]\n[noise]\nI didn't feel like going about their jobs in\nLike you\nGoing to know what it wants to keep your body bubbling\n\nUp and down and I'm\nGoing to do with the young who the other Boleyn much want to\nThough they've been in the end of the old adage all bullshit they end up getting on my own\nWhat they're not being caught up in a while the other little dirt on and on top of that we're at the top didn't grow up\nThe number one new I Know the\nOne knew me up at a time then I\nDon't know\nDressed pitched high\nDown one out of my bowl\n\nAnd I\nSure do went down to jump in dire need to\nWell nice crying and mother Robin ministry dream and I'm not sure any ammo between him and God that\nI'm not\nUntil now see I\nGrew up in its home than non you end up being that can be the\nNew Rio bed time they're not\nAll that and we'll try\nJohn was not otherwise how would I", "year": "2018", "show_name": "Live At the Linda", "city": "Albany", "day": "25"}