{"month": "10", "state": "TX", "station": "KNTH", "content": "And get something for free it only takes a few seconds fun anytime you go to armed and responsible dot com you're going to find something to help you along your journey as it responsibly armed American and that's what it's all about the u._s. DCA the absolute leader when it comes to providing the education\nTraining and financial and legal protection gun owners need plus they just love giving away free stuff and I'm a big fan remember these great free bonuses disappear regularly to you're going to want to head over right now to see what's there today you don't want to miss it head over to arm and responsible dot com right now that's arm and responsible dot com armed and responsible dot com\nThe USCC a Facebook page brings together nearly two million like minded people all of them interested ineffective self defense and the concealed carry lifestyle look for the official USCC eight page on Facebook signed the page clicks the like button and start learning all you can about becoming a responsibly armed American\nAnd remember to share these great tips with all your other Facebook friends the USCC a on Facebook a great source for information on personal safety and so much more [noise]\nAnd now your host mark Walter ... [noise]\nWe go over some of our sponsors stuff I Need that break boy but I'll tell you I'm Still fired up about this stuff will wrap that up\nIn just a moment but it is really really important to remember this again USCC a is giving you an opportunity where the tax so easy to do just don't do it while you're driving please\n... armed A. R. M. E. D. too the number eight seven to two two right now and get entered you could wind up to twenty four chances up to twenty four chances to win a gun every day\nCould be twenty four cameras clocks six whatever a are Fifteen\nOh you have to do is taxed armed the word armed A. R. M. E. D. too the number eight seven to two two that will reveal which gun you could be taking home today remember it's not a lot of time at all and soon plus today's gun will disappear at midnight tonight so don't put this off don't miss out\nBecause you could win a new gun every single day this week and that is very cool if you do I want to hear from you market armed American radio dot O. R. G.\nR. A. R. M. eighty to eighty seven to two two okay back to call in power for just a moment here really interesting let's wrap this up and tied together what does this have to do what you said has everything to do with your gut\nBecause everything I just showed you that Colin Powell recited was left every bit of it was a Democrat talking point and Colin Powell is a Republican\nIn name only rhino\nColin Powell thought nothing he said\nThere's nothing conservative in what he said\n\nBear in mind\nThat after Newtown Colin Powell turned on your right to bear on duty no he didn't he's never believed in your right to bear arms\nHe believes the second amendment\nBut\nThere is no but in the second amendment\nI Would argue to him that all gun control is an infringement\nAnd then I Would go right back to something David coterie is that\nIf you can't be trusted with a firearm you shouldn't be able to be walking around\nWhat else can you be trusted with can you be trusted behind the wheel of a car\nIf you can't be trusted to safely handle firearms you are not be walking around\n\nColin Powell has no problem restricting your right to keep and bear arms\nColin Powell is trying to reassert himself somewhere\nInto some form of relevancy by doing this interview what I'm using this whether he used to access for not really doesn't matter because you understand where I'm going with this and this has to do just again you use Colin Powell as a reminder\nThat these people who claim to be\nDone folks or conservative or anything but\nThey are not\nAnyone who has no problem giving tax dollars away your money away\nTo people who are in this country illegally cannot be trusted to uphold your right to bear arms\nAnybody\nWho claims they support the second amendment but\nDoes not support the second amendment\nAnd they do not\nSupport your right to keep and bear arms they cannot be trusted\nAnyone who spit left wing talking point\nAbout Donald Trump cannot be trusted\nTo protect your right to keep and bear arms I found this article today from Colin Powell fascinating\n\nThe fact that he cannot see\nWhat I just picked apart\nIn his own eyes with his own eyes\nConcerns me\nBecause I don't believe Colin Powell is intellectually dishonest\n\nI Believe what he is he's blind did like idi allergy\n\nIs blinded by idi allergy\nHe's ...\nHe's in lockstep\nWith the goof ball clawing and scratching if the doors of the Supreme Court freaking out the Kavanaugh\nIs now on the court a list of Milan does who actually went on a television program on M. S. D. and see and actually made one of the M. F. DNC acres eyes get big and throw a goofy I Wish I could provide you that visual\nBut she was on a split screen with the two and the DNC desk eggers when she said Donald Trump was exerting some type of cult dish\nYou know thing to everybody\nYou know some some magic powers I even the M. F. D I was the stupidest thing I've ever heard in my life but that's where these people are\nThey are deranged they are so blinded by any allergy\nThat they cannot see the facts before that\nDo you think that Colin Powell a black man\nWouldn't be nearly thrilled\nThat black Americans are experiencing right now their lowest unemployment rate in history if you are black in America and want a job it's out there for you that's what I'm telling you\n\nIf you're not working and your black it's because you're choosing not to\n\nThis should just thrill Colin Powell but he doesn't\n\nMy wife has not been insulted by Donald Trump the only people who feel insulted by Donald Trump have you noticed that are a bunch of left wing lunatics\n\nWho are what\nBlinded by ...\nThey will ignore\nThe unemployment rate they will ignore the new Canadian American Mexican agreement\n\nThey will ignore\nChina caving in\nAnd making a quote unquote new deal with Donald Trump that actually benefits America they will ignore the numbers in their four O. one K. rising they will ignore the job numbers\n\nThey will continue to ignore\nNinety the fact that Ninety seven percent\nOf the media\nIs attacking Donald Trump every single day\nThey will ignore the fact that they out themselves in their own Twitter feed\nAs a bunch of left wing lunatics what does all of this have to do with God it is that ... Ali G those people so blinded by any allergy that are trying to take your guys that are so do rage they are going on national television saying that Donald Trump is using some type of powers\nTo reach me and you\nAny new worrying everything we're talking about\n\nThese are the same people who are OK with sanctuary cities and states\nGiving benefits that you work for\nWith your taxpayer dollars\nTo people who are here criminally\n\nYou have to ask yourself how we got here\nSo let's round third base and go into home\n\nBecause I think enough people\nAre now to use the Urban Dictionary word woke\nAnd I think we saw with Lindsey Graham W. R. Hawkins and I've talked about Lindsey Graham yesterday\n\nAnd I believe this when I tell you this I no longer believe\nThat Lindsey Graham will lay down\nTo the liberal left again\n\nSomething\nWoke him up\nGlory America falls your high Canada [noise]\nSurgeries unplanned [noise]\n\n'cause I hate the Astros [noise] because my friend the Astros [noise] they always when I'm Better [noise]\nTime really better [noise] they'd be quiver boycott Roscoe taping cleave injure [noise] they beat power [noise] that'd be Brad Hand they beat us like the orange stepchild that we were in the series\n[noise] head out semi unmanned [noise] ah my gosh my envious [noise] here still the same [noise] putting in a\nWay part of the way there is that I played that the Indians went down oh it was ugly ugly I was all it's just the ugliest three game series I think I've seen in my adult life\nAnd go back to the game seven of the world series ... not going back and forth way to Jay series over already\nStop stop you just go back in your Cape dart ... da da da da da ... [noise] so I Do a Johnny Manziel that Johnny Manziel gosh it will I Do that for I'm sure you're on Becker Baker touchdown maker I'm Sorry\nI'm back to bigger bigger touchdown maker ah we're all browns all the time here if they do show that we got a lot of news\nSo let's get to it first of all if you are on the Florida Panhandle when you've been asleep or drug for a day you get out my goal is coming to knock on your door tonight maybe maybe tomorrow morning at ... latest it says Katz\nFreight okay I'm I'm thinking if the water was warm enough to take last week's hurricane to foreign about a minute I wouldn't count against that Pensacola, Florida apple at Churchill ... ...\n... and it's big band Pensacola I Know all the fly boys are do you live near a city anywhere near Saturday like what he said get out get out Walton Beach stashed in Panama City I Love best in one of my favorite places to go get out\nGet out get out the storm surge could be pretty nasty and then the water's coming here now I'm not going to be here on friday I Am going to be in Columbus\nI Am going to be in Columbus and I want you to come out in Columbus 'cause we're gonna have a great time as the talkers tore gets going ah I got to go over to Ninety eight nine the answer to find out the details because we are going to have such a great time you know Eric back taxes has come in I don't like him\nNot just not just joking Gallagher you know\nWell sober up will get them out their pastor Jeffress is Kevin Jim Jordan Derek my taxes that I Will get my butt will slouch I'm up in the chair October twelve this Friday Ohio Dominican University come get your tickets over Ninety eight nine ... dot com right now\nNinety eight Ninety after dot com\nWe're going to have a grand old time talking about the elections and talking about Brett Kavanaugh uh before I go forward but I mean do some homework care alliance defending freedom you were very generous yesterday and I need you to be more generous today go to Hugh Hewitt dot com All right\nIt's very easy at the beginning of the show to get this done you're going to see the very top alliance defending freedom act\nNow to preserve freedom for you and your children now for those of you think every day as a exciting at the Supreme Court today is exciting because Brett Kavanaugh's first day an oral argument we'll see if he just throws we're right in any well he'll be at one end Neil Gorsuch will be at the other end\nThat's how they see them but you know what they're hearing day\nI mean it's really exciting stop they have so quaint versus the United states whether it's state robbery offensive includes is an element the common law requirement of or coming victim resistance is categorically a violent felony under the Arabs career criminal act\nWhether burglary a but not permanent are mobile structure that his adopted or use is with us versus slims\nCan qualify as a burglary under the arm career criminal act whether burglary of a permanent or mobile structure that has adapted to use for overnight accommodations qualifies as an arm career a criminal act element then we got air liquid systems\nVersus the breeze whether\nProduct liability dependents can be held liable under maritime law for injuries caused by product they did not sell maker distribute and then finally\nNielsen versus ... whether a criminal alien becomes exam for mandatory detention if after the LA and it was released from criminal custody the department of homeland security does not take him in the immigration custody immediately so that's how exciting\nThe Supreme Court normally as somebody to play for your shortly to try again last night but you just say you know not every day is is a same sex marriage abortion and gun control heading that way if the court and they will settle and then there'll be fine\nYou know we are within four days of the two hundred and forty third birthday\nOf the United States Navy mine isn't maybe family with a lots of family members in the navy I I'm a civilian the pet she missed this year it's maybe family ... all the way back to Eighteen sixty seven when the first several tossing\nGraduated from the United States Naval academy and they have a combined total of three hundred and Thirty years of active an add additional service underway ah three members of the family in the navy right now so we love the navy and other navies were entering core\nNovember tempt as their birthday but the\nNavy's birthdays October the Thirteen and two great company C bags which can buy a cheap X. dot com and short and plow sort AMD plowed dot com\nBoth make bags and the perils they both recycle stuff to make them short and plow recycled military surplus fabric into bags and apparel and see bags and sorting plow\nHave partnered by the limited edition collection in celebration of the U.S maybe two hundred and forty third birthday on October the third to ten percent of the prophet generated from the limited edition collection\nWhich sort and plow is primarily marketing or getting a little help from sea back which is bigger and more\nMore experience if does but sorting plow woman on business goes to the mission continues mission continues dot com and the women veterans leadership summit which will be entering a second decade show support vats support the\nMission accomplished goda short and plow dot com go to the bag dot com and buy some good stuff I did this all out\nAll you need to do is go to Twitter to do it and you'll find links to this is good stopping it supports the navy it supports a woman on veterans business supporting veterans every time\nThat you can't buy that Supreme Court if you're over ... dot com I Want you to support alliance\nDefending freedom so we support veterans and we support the alliance defending freedom the most successful legal advocacy group in the United states and right now\nThat bat better you are going to find a cure for one match Paul this month two for one\nFour hundred dollars becomes eight hundred dollars one hundred dollars become two hundred dollars and that supports ATF four thousand partner litigators and their permanent team to go out and defend jak Philips in Colorado\nCompared I'll start spending Washington state and you\nWhen they come for you you pick up the phone and you call them and they will protect you if you have a case they will protect\nYou no matter what your faith is no matter if you're an atheist if someone is persecuting here against your pre exercise religious liberty they will protect you everybody well we're because they are the best ... hate them so much a lie it's offending freedom need your help 'cause it's very expensive to run the it's the best thing they train younger lawyers\nThey train all their social lawyers they keep lawyers on staff they work across the United states please call them at age six or seven hundred and sixty or go to junior dot com and donate today it's double double now if you're activated they're not going to tell you why you need debate where I'll listen to the president and uh\nWell let's listen to the to the president talk let's listen to Mitch McConnell and as a matter of fact about what's going on and watch them right up putting metro California\nWe were literally under assault\n... I'm pretty sure dom ... sure some of them were Romanian citizens many of them were all visual trying to to get in our pleasures should go to our home job ... ... almost ... ...\nWho they are they are everywhere and they are and and you shouldn't say the ads are thought stop that's being posted ... they are going crazy so we need to be in the game tax cuts work dot com\nIs got it organized for you you don't have to go to marches go online and get to work tax cuts work dot com has put together all of the tools that you need to be an effective citizen right now make calls\nSend emails tax knock on doors check a neighbor to the polls tax cuts work dot com no the tax cuts are on the ballot\nBrett Kavanaugh is on the ballot\nThank you also to Rob Portman sitting right here thank you [noise]\nAnd finally we are indebted to Senator Susan Collins for brave and eloquent speech\nEntered declaration that when passions are most inflame\nFairness is most in jeopardy how true how true true\nShe was how great a senator or she is going to get the Democrats won rather than ride served all day all night long about it on\nYour show portions of the huge ... due in part by the association of mature American citizenship being there\n\n... show the answer news from one of the days when weather job out\nHere in the middle of an nonstop action packed information flush these huge Jewish coming right back [noise]\nI'm Andy Solomon as our everyday lives are becoming more and more mobile many small business owners want to operate in the same way so they aren't required to be behind a desk Lauren my wreck head of square payroll\nSmartphones an incredibly powerful tool as any parent looks to start running out of their business for example companies like squaring legally enable they can turn out to their website market customers and process payments from anywhere so really people have to have an end to end business management solution all on their cell phone\nWhen selecting apps that are right beer business my Rick recommends focusing on solutions that can deliver on two things automation and communication\nThinking that you can actually you pay administrative cast on auto pilot especially those that are more complex take automatic payroll to make sure that you never know meeting or your employees and then the other thing to think about ... you're using and every single day so important to find a client that are designed really lousy so that it's a great experience and enjoy it or not putting that if I press rating\nFor more information visit square dot com or search for a square payroll online or in the stores this just a shoo shoo shoo\nSymbol lo J. D. project junk dealer dumb blonde Jamie you view it might get like Dennis ... Michael ... runs Samuels and Larry Elder those voices am ... to me and\nI just am alone for you ask coins right there on the ... freeway eighty four thirty\nFive I Can't write their number one in Houston for buying and selling broken system thirty plus years you're trying to sell a\nVery very rare corner purchase accommodate Indians in your collection US Coins can assist do they do free estimates check out the beautiful show room with jewelry documents paper money we're college for more log on to their website ...\nDot com that's used in points dot com\nConsistently conservative we do not apologize for that we do not seem to listeners suffer from talk radio fatigue using they're energized every day\nWe are always conservatives we are the um gym to gym in the the answer to be\nWith\nNews I'm rich Thomas in in\nWashington the Florida Panhandle bracing for hurricane Michael expect you to strengthen as it moves across the Gulf of Mexico there'd be a dangerous category three hurricane and it makes landfall tomorrow along the north east Gulf Coast\nIt's the first official day on the job for Supreme Court justice Brett Kavanaugh a newly sworn in Kavanaugh will take his seat at the end of the bench at the Supreme Court\nFollowing what he calls a contentious and emotional confirmation process more than a thousand people turned out last night for a ceremony honoring the memory of the money people who were killed in the limousine press in upstate New York\nThe Trump Administration moving to allow year round sales or gasoline with higher blends of ethanol that would be a boon for Iowa and other farm states a ball street this morning ... futures down one hundred twenty five points matter of fact futures off thirty four more\nDetail so that's alright news dot com\nIs am dens him and the answer that\nMoon again and I've never before endorsed the pain relief product of any kind of listen to him now until ... relief factor and\nMy wife is real because of her neck and shoulder pain let's face it almost everybody were fifty has occasional aches and pains due to aging or exercise and the three week quick dart is now discounted only Nineteen Ninety five pits a hundred per cent drug free and the majority of people who order it's\nGoing to order more let's see if we can get you out of pain to go to release factor dot com\nWhen it comes to your pain many of you might be skeptical was many people are about ordering rowing factor but you don't need to be because relief factor is one hundred per cent drug free supplement designed to help your own body more oil lemonade occasionally should change due to aging\nExercising everyday living those records started now discounting dog Nineteen Ninety five let's see if we can get you on a plane to release factor dot com nature Monday Chuck ... factor dot com ... factor dot com\n[noise] on the ... going to do in my head I hard\nRadio the sea is a um ... the and dug in driving we get the answer [noise]\nWelk every one of their you five thirty two is the true story of rotted a recording of ... and what our three three the answer a safari shrivel emerged pretty wise is Ronald Ronald scored on your ... all\nThat much going on at tribe reduced drug are three ways are jokes they gave me the bill went a little bit I don't see any slowdown throughout the entire eastern metro area object to\nThe cameras everything is looking good this morning oh our astro certainly handled the Indians have three games we buy our power by them why I was nine eleven to bring now it's on the Boston or the gay\nComedies will be used in traffic\nDealing during my year in advance Clementi had arrived twenty eight genes in my\nLap and I don't want to lean on your back ... them and the\nAnswer a little bit of regular for cash about a thirty percent chance of it today ... tonight and tomorrow high both days eighty seven will organize Seventy four ... sixty five Thursday the I Will be eighty three\nAnd Thursday nights Los sixty three\nAs cool weather for a change the way we walk at writer Seventy eight degrees out the best chance Seventy the Asher\n[noise] comeback\nAmerica you're you're in the early factor that calm stay a Red Sox pull up the Yankees fixing the wildlife thank God\nBentsen is probably under a couch somewhere [noise] me neither got caught up to three in a row so we're both by battered baseball fans to run over and thrown out of the ... going to check their email that were done wow terrible what turned a happier news\nBrett Kavanaugh went to the ... but I played for your Donald Trump and his gracious welcome to everyone who helped but I also want to play Donald Trump apologizing to the cabinet family on behalf of the nation will cut number\nI Would like to begin to nights proceeding differently than perhaps any other event of such magnitude\nOn behalf of our nation I Want to apologize\nTo Brett and the entire Kavanaugh family for the terrible pain and suffering you have been forced to endure\nThose who step forward just serve our country deserve a fair and dignified evaluation\nNot a campaign of political and personal destruction based on lies and deception\nWhat happened to the cabinet family violates every notion of fairness decency and due process\nOur country a man or a woman who wants to always be presumed innocent unless and until proven guilty\nThat is absolutely one\nHundred percent true and in non criminal proceedings there must at least be more evidence that not that an accusation true corroborated accusations cannot convict anyone\nOr anything or disqualify anyone from anything justice cabin or then took to the podium I Want to play his remarks cut them or what\nI think the members of the United States Senate Senate majority leader Mitch McConnell\nFor his leadership and steady resolve I think Judiciary Committee chairman Chuck Grassley for his wisdom and fairness\nAnd I give special gratitude dissenters Rob Portman Susan Collins Joe mansion Jon Kyl and Lindsey Graham\nTheir credit to the country in the Senate\nI'll be forever grateful to each of them and to all the senators who carefully considered my nomination presiding over the final vote in the Senate on Saturday was vice president Pence I'm grateful to the vice president for his sound advice and faithful support\nI think town council to the president Don McGahn\nWho was a warrior for fairness and performed is critical duties and the finest traditions of our constitution\nThe right on ... number two\nI'll take my family my mom or certain my dad editor here on their only child [noise]\n[noise] you know a lot of people on that advertise supplements take supplements sailing\nSomething when I take I don't advertise things I don't use that just my habits been my eye but since I got into the business in Nineteen Ninety if you can't say you use it and you don't like it do indoors I use really factor dot com 'cause I Do things like\nWalk six miles yesterday I didn't run yesterday that I'm I'm just getting back into running after taking a little bit of a spell get one of those pratfall sorts occasionally trouble people but you know what role a\nFact that I kind of got me back in the game in a hurry damage rocker is next America and the tendency right go anywhere except the fact that I watch the testimonials get a pack and be back\nWith us just a shoo shoo shoo\nStuck in traffic we got the answer [noise] there we go it's and yeah so slowly Tuesday but short drawn away last right five forty eight it am ten Seventy hassle is find out what's happening the traffic here's the diesel\nGoing into down from ... forty five ... both running justify ... through I'm going into downtown Houston is looking good\nYou're dragging forty five go free why I'm from Galveston soldiers league city and heroin Pasadena everything a voting rights is warning no drama lawmakers eighty freeway really broker a empty everything is running hosted or better this morning on all of our freeways\nBelieves will do to try to\nProtect your world sketch your flu shot today as long greens and receive a coupon to earn that ten dollars reward on your next purchase a thirty dollars or more reward valid on future purchase vaccine restrictions apply turns and restrictions apply to coupon am to ... the answer\nTypical about my friend just about every tiny screening from the government can come in and tell you what to do ... ... and you have to choose between your livelihood and you're saying we don't live in a free America\nThat's Baron Hill Stutzman a grandmother and small business owner who's being sued by the ACLU and her state government\nIf she loses she could be on the hook to pay more than a million dollars to her opponents if this could happen to her if it happened to you that's why alliance defending freedom exists they provide free legal services to those whose freedoms are under attack but they can't do it without your help your gift of one hundred dollars for helping the F defend your freedom\nIt necessary resources to fight these pivotal court\nThanks to a matching grant your gift is doubled when you give now put the alliance defending freedom banner with Dennis Prager dot com for college hundred for six months nine six five six eight hundred for six nine nine six five six\nSix hours on the government is brought to you by the media now here's indicated ... you know them\nIt isn't often I find a reason to praise Republican Senator Susan Collins of Maine she favors abortion and same sex marriage and Obamacare on her reason than substantive speech last friday in which you announced their support for Brett Kavanaugh deserved praise\nAmong other things he decried the smear campaign against Kavanaugh and his judicial record quote we have come to the conclusion of a confirmation process that has become so dysfunctional\nIt looks more like a caricature of the gutter liberal political campaigns and a solemn occasion unquote college chastised left wing activists for distorting the judges record in smearing his character and she might have been died of the major media for helping to feed the frenzy\nBy never once challenging the claims that the left\nAnd then call and said this quote our Supreme Court confirmation process has been a steady decline for more than Thirty years\nOne can only hope that the capital nomination is where the process has finally hit rock bottom well given the nastiness of the left I doubt it read the entire speech cabinet is on the Supreme Court largely because with the exception of Lisa Murkowski of Alaska Republican stuck together I'm Cal Thomas\nOr break up to date them as a visit to step down more than ... through media ... bucks thirty seven thirty three ... three zero three seven that's below by thirty seven thirty three forty key Largo Florida we three zero\nRead them as the by the day and subject that the debt that we'll get to use the media hopes aboard\nListen again next time when the countdown this\nCommentary Hugh Hewitt on AM ten Seventy the answer\n[noise]\nWelcome back to you and then the really factor dot coms thirty are joined by David and director of the Washington Examiner you also see him on CNN David Early voting begins in Tennessee next week next week in Tennessee you justify the story Marsha Blackburn got a big town ... because of the cabinet hearings why\nWell because it's sort of awake and a sleepy Republican well but the more than that\nEspecially in Tennessee with them rather than just kind of a unicorn Democrat ... school of public is really do like in Tennessee and really did have a record of than president is that it it it sort of brought out in the election which is\nIf you're voting for bread is in your voting or possibly a Democratic Senate so Marsha Blackburn had I had a hard time making that case a for all sorts of reasons and the cat an ice sheet has basically make the case for her\nAnd it helps Tennessee revert to its standard partisanship\nThat we would expect to see in a presidential election\nAnd that's what it's been such a big deal in the Senate races which are taking place than Republican states like Trump and that's why it\nHas been such a problem or Senate Democrats and why it has probably take in the Senate off the table for them so they just you know us does that does the atmosphere in about ten days or so\nAvert the fact that a need for what the term cycle has been and I would lose that from happening definitely because\nIt before in twenty eight and the Access Hollywood tape and mid October and three weeks later Trump was elected so [noise] I don't like the blanket protections but right now\nHis wife looking really good for black bird in Tennessee and Republicans in other Senate races\nI think when you were able to make the argument that vote for Brett ... is a vote for Schumer is a vote for Dianne Feinstein is a vote for Cory Booker is a vote for Sheldon Whitehouse and it's ... ... is a vote for Mazie Hirono that it's very easy to remind people that\nFor thirty days it's hard to do that for a year but it's very easy to do that for thirty days and I don't think it's just tendency I think North Dakota is locked up\nI think Donald he's having trouble Holly you had a big surge and now we have a hurricane down in Florida Rick Scott is going to be all over doing the Rick Scott thing he's very good at this I think it's going to help him to am I missing any places where it's helping\nWell look I um it's helping Ted Cruz in Texas it's helping Republican Senate candidates anywhere where the state is inclined to vote for a Republican but where you know for atmosphere reasons and for a candidate believes in\nThe states will flirting with Democrats and I look I I was in Indiana and North Dakota in August that I thought that those two candidates are those two Democratic it's almost Donnelly and hike camp or troubled but Donnelly and hanging around the high camp I think it's been behind this they just really\nIs a duck punch a dollar and hanging around the ... theory should help broaden\nOr create some distance we'll see if it does I'm Jon Tester in Montana as the other one who had managed to\nWhen he's always a very good candidate to sway people underestimate him he had kept distance between him and Rosendale an outlet and Dale is caught him and I think that this has helped so anywhere where the playing field is designed to elect Republicans I'm an elected easily especially I think this is going to help\nIn swing states like Florida I think it's an open question the atmospheric are still generally favor Democrats and this is a state that swings with the wind it's one of the reasons why I think when you look in Ohio and Pennsylvania the Senate races are still off the table\nYou know pain in his eight or a lead allegation a Democrat for using this as a talking point but the mob rule if not I was angry about that before I was I was shocked when they broke through the barricades at the Supreme Court\nThe videos that they had the mob in Portland went viral yesterday I just think people have had it with\nThe intimidation politics of the left they really had just had it and are going to vote Republican as a rebuke to that more than they were going to vote against Donald Trump for his occasional cruelty and his bowling a China shop stuff they're really angry at those politics on the hill am I right am I wrong\nWell I think it depends on where the voters are I I think you're right where the voters are inclined to vote Republican and where the partisanship is designed that way I think you still have a lot of house district and you have some of these swing states where the president still going to dominate\nAnd and I think that you know for for for Democrats that the danger in this thing last day in is that they lose the edge they have had with independence or what the Republicans and President Trump and send you all partisan and we've had enough of you and that's just been the view\nAnd it's replaced by looking at Democrats and saying basically there's no difference between you and them so maybe I vote for the navy I don't maybe I vote for Republicans maybe I stay home and that and that's that's the danger for Democrats I don't think that in a midterm cycle I'm that we've gotten this far along that the the\nThe apple cards that it could be completely reverse and you're just going to have the review switch the other way but I think it's been a ... it could model\nUm the battlefield and it could reduce the number of seats Democrats the tick up possibly enough but they don't win the house majority or they end up winning house majority but by just a few seats and it's definitely going I think\nAmerica to do in fact it comes to inside of the beltway urging you to go play mid term madness that your your dot com [noise] I put\nTogether the twenty five closest races in the United states I think it's ten from the Senate ten from the Congress the house of representatives and five governorships but it might be a little bit mixed I might have put twelve set it in a house races [noise]\nUh and you have to protect the winter and their margin of victory and now we're getting close now people can really get a fix an early voting starts\nGo and play doesn't cost anything you have to\nTell us how to get back to you if you win but that said there's no obligation nothing it's just fun to try and find the news the ...\nThe ... the new Larry Sabato with his crystal ball\nThe God of all political God's Michael Barone who out there actually is an amateur knows how to pick up that all these celebrity player like my gallant playing and Bob Costas gonna play and truck gr and I'll get ... to commit today everyone will play\nThat I'll be able to see how the you did against them up post the final scores everyone can get a maximum of a thousand points and won't really see how good people are\nAll right well we'll find out when it gets down to it how good people are and you should be playing to go and register you hear it that come from mid term madness while you're on line\nPlease go to don't touch my\nMedicare dot com or right now because Medicare is on the ballot in November people are mad about the lap they're mad about\nThe tactics that we saw in the cabinet earrings they are scared of Chuck Schumer is the majority leader they are afraid that Nancy Pelosi is coming back they are checked the markets will collapse if Maxine Waters gets the gab or financial services and Jerry neither will impeach the president and Brett Kavanaugh or try to it'll be a nightmare\nBut for you for your pocketbook\nBernie Sanders is your problem Bernie Sanders wants to make Medicare\nFor everybody the Medicare it'll costs thirty two trillion dollars over ten years we haven't got it it'll end up\nMeeting rationing you've been paying into Medicare your entire life your entire life and it's going to be destroyed overnight Medicare is on the ballot the association mature American citizens a Mac ... us they are fighting it\nEvery day and they need you to get involved so don't\nTouch my Medicare dot com is where you do that don't touch my Medicare dot com the news of the day concerns Michael Michael is headed to the Florida\nHurricane Michael's on a collision course with the Florida's Gulf Coast in his gaining strength quickly three hundred miles of coastline down their Walton Beach test in Panama City\nApple a chuckle why that's the place it's supposed to hit and because of the I was reading the geography is last night the um the long slow slope\nOf that area means a very high storm surge projection perhaps as much as eight to twelve feet\nCould begins tonight you got to get out of there Rick Scott is up there he is going to he's going to do the Rick Scott thing is a terrific governor he knows how to handle this stuff he's done it again and again and again and he's getting people out in their evacuating and that is very good news\nDonald Trump announced yesterday has no plans to fire Rod Rosenstein but the president also spoke on the disappearance of the prominent Saudi Arabian journalists ... been a vocal government critic he was last seen entering the\nSaturday council it in the Turkish city on October the second Turkish authorities have concluded he was likely killed in the consulate\nHis body dismembered carried out in a truck during proof of that that's an allegation\nBut it's a very serious allegation the Saudis are denying it but Turks want in the Saudi Arabian count but I don't think that's going to happen\nBut it might make sense for the Saudis to invite the FBI and you don't want to your church in no way but that is a big story and we will follow it [noise] I Am so convinced that the Supreme Court is going to move rather quickly\nIn their rules for that\nThe importance of this um confirmation he's going to be very very obvious very very soon in one place it's going to help as in markets even though they're afraid markets right now our pricing in are falling\nGenerally because they're afraid of Nancy Pelosi taking over the house and by the way the market would collapse of the Democrats won both the house in the Senate really what\nJust collapsed [noise] ah I don't mean forever it would just be\nA nasty wild ride down whereas there'll be quite a big bump if the Republicans hold the house I I Believe that but now it's time for Andrew and Todd dot com Andrew Todd dot com pretty market report that Andrew del Rey taught to bake in talking to my son last night thinking about buying a house I said don't wait\nAre going to be here your mother and I twelve and a half percent per se we bought ... go to Andrew Todd dot com or call 'em up directly but Andrew Todd dot com you after a couple of questions on line to get right back to you\nRight back to you and they help you buy our first house their second house\nSome of you need to refinance because you're in over your head on that and you have to consolidate that from credit cards and autos and [noise] you know you may have made bad investments you need a second start your house was increased in value do it now when rates are low don't wait another day some veterans coming back\nFrom all military service moving somewhere\nAnd some of your retirees are moving down to the new retirement capitals of the world North Carolina Georgia Tennessee\nAndrew Todd dot com they'll take care of it for you or you got AAA Triplett eleven Seventy two there was here Pacific mortgage but go to him directly they are lenders handwritten toddler lenders I've known him for Twenty years I've done my loans I send my kids there I said everybody there Andrew ... dot com the free market report yesterday that was a\nThirty nine points but then as that goes up fifty two and the the tax got killed yesterday that shouldn't be down on fourteen this morning everything is red ... down to Lebanon that happen as that goes down twenty seven the Dow is down Ninety nine Amazon lost twenty five bucks yesterday than other tenant pre market trading gosh I Wish I had somebody that would be by an Amazon I tell you this is\nThat I'm a big believer that they will own the world soon\nI Wish they would announce H cute too pretty soon but\nWhat you do know is that the ten year rate the ten year bond which is the most important\nRate out there when it comes to setting of mortgage rates it's still a three to two has very low it's not as well as it did get but it's very low and that means all of the mortgage rates are very low out there and you need to go take advantage of them today don't wait around\nSame advice I get my kids I give everyone out there Andrew and Todd dot com\nAlso want to remind everyone that he'll cruises coming up February twenty fifth through march thirteenth February twenty ... this is the trip of a lifetime teach the constitutional court I've never done it before because I haven't had foresee days it's a two week cruise from February twenty fifth on march thirteenth on regent's seventies Mariner\nThe trip of a lifetime you fly into Bangkok week gets you out to the ship you stay on the seven seas region Mariner just the British ship afloat and we go\nDown the coast of Vietnam\nWe end up in Hong Kong where I have never been guy Bentsen was born in all kinds of told me about it for years my daughter's been dog touchy says it's amazing my brother in law loves Bangkok every you know I just haven't been the far east except Japan and so I'm looking forward to this in a way I look forward to any tripping a long time to be twenty fifth the march there to\nBusiness class airfare included in their cost exclusive excursions and every port they have two for one specials as well to people for one price of one in a cabin but you gotta call before they run out of cabins eight hundred nine nine four fifty five thirty eight\nEight hundred nine nine four fifty five thirty eight or remember\nShoe crews for the benefit of the Steelers H U G H to cruise she argue I as the few cruise dot com I Want to go and play for you to pull out she telling you what's coming up of course cut number Seventeen\nDemonized and ... because of backups near my top talent to cut the rap on these smears somebody [noise] Clinton false alerts and all the wrong [noise] and then you ... and ... who wants to put in the past that this this is a mess\nSaid they had that validation of the past been put in that manner and then it's on the rest of the merchandise to passes report on that we may want to tackle\nThat does that sound like what they did the cabinet of you to me she was talking about\nActually the fact that a lot of Republicans are out there pointing to the fact that the Democrats lost their mind over the last one I mean they lost their mind and the media to help them lose their minds and they play tennis with the media back and forth when gang regular apple out allegations in your book distortions\nAnd Michael Avon lady that was the wrap up smear now they'll never live that down everybody thought are you going to believe Nancy Pelosi Earl light eyes and ears\nThis isn't even close got to tell you about one of the story of two thousand year old Roman inscription\nReveals the use of the name Jerusalem in Hebrew for the first time archaeologist hunter two\nThousand year old Hebrew Jerusalem inscription defined as first written evidence of the name Jerusalem down on a column dated from\n... Jesus as time has the Iranian period and it is amazing the words had an eye or something to do all those from Jerusalem etched on a column which is part of a building that stood in the Jewish potter's village near the entrance of Jerusalem some two thousand years ago\nThat right now they have a matching grant and if you go to Hugh Hewitt dot com and quick on the band or that reads I wanted offend religious freedom alliance defending freedom your gift doubles\nTwo hundred dollars becomes four hundred dollars eight hundred and sixty numbered all you gotta do is go to eight per call eight six six seven hundred sixty eight six six seven hundred and sixty or go to your your dot com and click on that alliance defending freedom button and please please please be generous what get the cases the cabinet sector\nWe're right back on the ... [noise]\n... Seventy three three the answer yes Tuesday we've got to get divorced and have your costs us venture forth but these are less\nTraffic jam middle nonstop action packed formation [noise] she was just coming right [noise] [noise]\nHi show mocking here if you find them I work you know the one of the biggest outrageous I reported on was the trial of abortion doctor Kermit time now\nAnd now the woman goes into a clinic comes down and there's no police report and\nI help take both the crime the mainstream media tried to cover up we had instructions directly from governor in his office not goes back to ...\nWhen the producers of the guys numbers he came to me for him I jumped to the chance I personally donated to make sure they still got Maine got no movie opens who've been around the main\nThing Cormac does know is perhaps the most mystic serial killer in American history dean king and the entire cat he was the perfect job bringing the powerful touring of\nGood versus evil people taking queens nothing that man did\nProtect cleaning for children and you don't have to be proactive as you might be worried moving to carry [noise] it's not the mother to atomic you you can and should bring your teenage children bring friends and family and you do not want to have something unique opportunity changes hearts and minds about abortion guts\nThough rated PG Thirteen this just a shoo shoo shoo start your weekday mornings with ... show with Jay ... news along with ...\nIn the morning information and entertainment weekdays from the conservative tame and capital of the world on AM ten Seventy the answer\nBy just to say I'm Alone for you ask coins right there on the ... freeway eighty four thirty five I Can't write their\nNumber one in Houston for buying and selling ... consistent thirty plus years to do trying to sell\nA very very rare corner purchase accommodate Indian sent fear collection US Coins can assist do they do free estimates check out the beautiful showroom with jewelry documents paper money we're coins for more log on to their website ... dot com that's used in calling ... dot com\nTo just simply conservative we do not apologize for that we do not seeing our listeners suffer from talk radio fatigue easy\nThey're energized every day\nWe are always conservative we are the ones in them and the answer in\nNews Tom rich Thomas in in\nEvacuation orders for parts of the Florida Gulf Coast as hurricane Michael continues to intensify as it moves across the Gulf of Mexico Supreme Court justice Brett Kavanaugh will hear his first arguments as a Supreme Court justice this morning after being ceremonial a sworn in last night at the White House\nThey are the governor says the driver of the liberal that crashed over the weekend killing ... people didn't have the necessary commercial license from the vehicle and failed estate safety inspections\nGoogle preparing to showcase his latest products the tech giant expected to unveil to a new picture phones along with other devices on Wall street this warning stock futures and the red Dow futures down about one hundred thirty dollars and points that's actually\nThere was a rough forty one that's in the future is currently down Fifteen points for details ... news dot com\nIs am dense him and the answer is your\nDog to ditch scratched tinker shed like crazy\nCome to die for our quarter and Ninety Days plant dynamite diner fight is Tricia pick up two bottles of liquor chops get the third bottle\nFree meal improvements like a chat with them make it three or making six night I'm an e and now six extra directed microbial even better for the ... and ... try liquor chops lie to get one free dynamite dot com\nAnd I'll be I Can't believe this tractor\nMichael's which is threatening to\nMichael Moore demonstrably become a major hurricane most of the Democratic senator Mazie Hirono\nProtesters shouted harassing\nGung ho goofy comments\nMore when you're on the show\nMy show ... right before ...\nAm damn Seventy\nTwo and a diehard\nRadio there she is a um ... the answer\nIs stuck in traffic we got the answer [noise] good\nMorning there you know six thirty two it's a Big Ten Seventy and the answer church or whether you're the diesel here for like a problem to forty not tell us all about we\nDefinitely have a rag on two forty nine Tom ballpark way it's south bound the inbound past banker your back them\nUp past spring creek now all boats through centennial of\nUnexpected Fifteen to twenty minutes away bears a twenty minute backup\nRunning on the freeway as to ride wines are blocked on the inbound side of heights and just before Eldridge Park while you're slowdown begin to get by the I'm brand parkway and we have a disabled and my wife wind up Ninety eight he's found a V. access road goes out for five minutes from the start with white\nBut they used in traffic drivers\nRisk their lives any time they get out of their vehicles on the freeway whenever possible move off the road after an accident otherwise the only thing simply use some icy the traffic is a sin white line in the seventies the answer\nWe're looking at here a little bit of rain forecast going to go away though how do they eighty seven woman I somebody for twenty percent chance of it's an eye Colonel Charles Krohn ice was going to be down to sixty five\nThursday night Thursday night will will be around sixty three pretty good on us\nBy now Seventy six degrees with a Big Ten Seventy the\n\nWay home you read this book America Hi you're on the fact that I come studio the book is Jesus is reason the author David Limbaugh my friend and best selling author is back with the brand new book Jesus has risen David good morning\nTo you morning huge thanks for having me on\nI'm enjoying the cement ... I have a theory which is lawyers like Paul more than most people\nThink that that's interesting in response to a of the question of why I like all last night and Jeff Parsons show I can see that that it has to have something to do it by fascination for law and and then it center connection with theology\nYeah it it it said that he is a lawyer I mean he just the lawyers lawyer and he argues that Jesus has risen by the way is I Want to say but it's a religious books\nAbout the six missionary episodes of Paul and about the accent but the apostles and it's a wonderful expectation for a layman and for the yellow China they would find some interesting perspective but I Want to set the stage or David when did you start writing about Jesus and the church\nUh about uh probably five years four or five years ago a Jesus on trial was the first book about my journey faith journey from skepticism to bully and then I went to the mayor Scott which is how Jesus Says or or shadow that pointed to an old testing\nAnd then the train Jesus was about the gospel in chronological order with running commentary and this book as you rightly pointed out of Jesus is resin is about the book of acting sick the falls\nA pencil and and the only reason I I'm limited to that was purely space constraints and I'm going to go on after that but it's a continuation in chronological order of\nA New Testament after the gospels I just want to continue to tell the story and get people interested in the Bible explain it like a guy I guess they're kind of like a Sunday school class in writing and you can go as deep as you want to go but I Hope and excessive all\nPublic ... so well written I don't know if you saw the news this morning\nIn Jerusalem they have found the first ever\nUse of the word Jerusalem from my column two thousand years old in Hebrew they've had it near me before but they've never seen Jerusalem in Hebrew on a column just again pointing out we're talking about history here and you're trying to organize history so that it's accessible by following Paul around right that's basically it\nBack then and I and I chose the missionary will stick that everyone believed to be the first written as opposed to the snow ... on a border that in their chronological order in my book\nAnd and I also want to emphasize people they were written before the gospels were written a reduced to writing the gospel yeah that that Eighteen to\nThirty years after Jesus was crucified diner resurrected Paul wrote these letters Eighteen to thirty or so that would be like David Limbaugh and made writing about events from Nineteen Ninety to two thousand about events that happened to us not other not", "show_name": "Hugh Hewitt Show", "year": "2018", "city": "Houston", "day": "09"}