{"month": "10", "state": "CA", "station": "KRLA", "content": "Okay you know it's important telling us are we talking about\nAnd I think he has it but it's it piece by piece it's not trying to get the president to shut down an entire news network that would be extremely dumb and short sighted on the part of Sarah Sanders alright\nLast word for you as we continue here Jennifer morning answer for a Tuesday the mid term elections are one week from today we will have a morning after ... update for you as we roll\nAnd if you are feeling a little tired may be gained a few pounds maybe your joints are a little shaky will let me tell you about college ... college run as a supplement that helps restore your body's ability\nTo produce college in in college and is necessary for you to lose weight for you to sleep well at night and for you to look and feel a whole lot better ... is safe unnatural based in science with over Twenty years of success behind it and the side benefits are completely amazing better sleep\nMore energy less joint pain blowing skin and you'll even lose weight ... doesn't make you jittery it stimulus free one hundred percent safe and it doesn't interfere with any of your regular medications to check it out\nGet more information on ... at ... dot com that she'll P. L. O. S. S. dot com or call eight three three top last eight three three top last for ... when you do use from a code AM eight Seventy you'll save ten percent on your order\nMorning answered eight forty seven\n[noise] insurance morning\nTravel than Hollywood a fender bender and that's on the one on one heading north down at Santa Monica boulevard to this crash in black and the two left lane and you're going to the ... from the time they're also going to see a problem in eagle rock and in fact at the sink alert on the to the south and then Holly dry so another past [noise] and it's been taken away the Harlem planes that things are pretty solid right now from mountain\nStraight taping intimacy Monrovia and after a little hot right now that you can hang my son of Myrtle Avenue now ... come up and not taking away the carpool lanes had pretty solid drive right now from sunflower [noise]\nLA went to find any more than the one hand washing lanes they pushed off to the Senate divider and not off the freeway yet and your died disease from\nAnd the traffic according to sponsor by [noise] paid her brother's laptop cut doors then you can get a ... item to see your brother's membership fee task check out the same quality and hundreds of items and everyday low prices here by the way you always get more dies is alive I'm Jeanie Romero Tammy Seventy to answer [noise]\nCulture warning of this country they're powerful figures of a farm to want to destroy everything this country stands for religious freedom of strong family do you\nJust radio station anxious white culture warn the host decision believe\nIn American exceptional freedom and liberty\nMore states over the news you can trust [noise]\nNow is the perfect time to use your dental benefits before they fire save money and sleep through it all smile magic dentistry eighty nine to nine smile eight eight eight nine to nine smile\nNationally recognized oaks Christian school in Westlake village now offers residential boring for grades nine through twelve domestic and international students live on campus and participate fully in OC student life ...\nProvides flexibility to visit your student when you want to attend their school activities and have them home on weekends as your schedule permit learn more thorough but how Sunday November fourth wonder for via register at oats Christian dot O. R. G.\nOaks Christian a day and boarding school oaks Christian dot O. R. G. [noise]\nDo you feel like you're the only person left in LA with any common sense you're not even classic liberals are noticing that letting criminal ... Adam jail to camp on our street isn't working out so well\nMy name's Roxanne back for health and I'm running for state assembly and you are not alone in your vote matter [noise]\nSome noise find out more right on USA dot org I'm Roxanne\nBack for it how can I approve this message because here in California are worth fighting for\nProfit sixty seconds of sanity for upstream Daesh ideas dot com I Know there's nothing new in this world to the left routine is getting quite old just as a ...\nCrosshairs art over digital congressional maps was responsible for the Gabby Giffords shooting so we're now told President Trump's dismissal of the D.C press corps as fake news and declaration that Don limited the dumbest man on TV is to blame for the bomb delivered CNN words matter declared CNN president Jeff Zucker mattering\nIs not a synonym for causation when the Utah man was indicted earlier this month for\nSending a threatening rice in life letter from I don't recall seeing and featuring any roundtable discussions were accused for Tyrone suggesting the Trump is Hitler crowd was to blame what a Bernie Sanders supporter open fire on congressional Republicans I don't remember any suggestion from the left the comrade Bernie's over heated criticism from as a totalitarian inside of the shooting what's the standard first averaging who's liable\nFor political violence us depends on the target is the answer the D.C press corps offers words do matter inwards offered by human refrigerator\nMagnets or pursing political leaders and the Democratic party calms team masquerading as journalists are precisely what elected Trump and we'll reelect him\n[laughter] this is learned over the region coming up President Trump defending himself after accusations claim he inspired the Pittsburgh synagogue shooting plus the two executive orders President Trump says he plans to sign those doors more in tune into\nThose burgers [laughter] on a I'm a ... the actor [noise]\nWelcome to the morning parents with the stunning Jennifer Horn\nThe man who just loves to sweat who were trying to\nTry and what is your morning\nAnd thanks for joining us on your Tuesday Morning after I sit here every day\nAnd I take up [noise]\nAnd I take a unnecessary [noise]\nAttacks and many of them are false susceptible to make me laugh now this fake news I mean I I don't beat up over drivers that's fake news hopefully it's not true jerk or\nWhat have you can play it is it because we're the one that will how would we even know that you beat up over drivers you weren't bracket ocean let me say something\nAbout oh now did you commit a salt but then you know you're just you know that\nAnd now you're strapped to non English speaking overdrive are now you're now you're never hit someone who's non English speaking out you're a da ... conservative let them let me ask you a question no you just put them in electric chairs\nWhile you're conservative you don't hit people would you put them in electric chair being non English speakers don't don't fake news okay\nActually also fake news I've never physically put anyone in the electric chair also fake news yeah anything you say about me allegedly hitting a new drug but do I ask you were you there your honor my source is Brian ... minute told me himself in front of a\nRoom full of people that he had\nNot touched it's been a we're not\n... it's been a tough week I'll tell you for Southern California Los Angeles Orange County is\nI use the big boy sometimes because they pay me a little extra I like when you do they say women just do that you know big voice thing and we'll throw you a couple of bucks so sometimes I just say you know the morning after Los Angeles\nOrange do you know they started off doing that with maybe third job like this broader didn't work very well so they took away my extra money and I'm getting a day so here's the deal a super and lift\nYou know they were offering because Halloween is tomorrow and of course of the weekend that your spouse hosted many Halloween parties and a lot of people drink and there's a lot of ride sharing over lifting going on as a response very smart yes responsible thing to do my friend drives for left I told you that shorter I talked to him last night\nMy car choice I prefer leftover Hoover for what he says you're in a lead us I and you want to know why because where I live there are more lift car so it's less the wait time that's why\nMost of them are dry for both but my friend just rush for lifting doesn't drive Gruber but he has something happened to first with this Halloween craziness this week and he had to do something that he never did before as a ... what's that had to stop the car and kick the passenger out who dicey right I think I'm going to get the full detail rented a male yes\nOkay I mean not yet sure well I mean I have I have no female and such a dumb thing to say but I mean you don't take a look chic throwing a dude out of a car or how you met me\nAll right okay okay 'cause in the back seat so who is a guy or a girl I Know it was my ... a guy and that was one I have limited details but tomorrow morning after will\nGive you the full though the full four one one on it but it was a guy at a some sort of Halloween party intoxicated uh uh I got that impression we traded messages I shouldn't say we talked about the\nDangers that is when it is dangerous to be a new Berlin driver and we see a lot of female drivers will only drive during the day for that very reason you're exactly\nRight I I met a nice lady who took me to\nVisit my friend who had knee replacement to actually I think that's a lot of\nFriends for like laid up like the doctor I thought OK so people on the DL she told me she ... sun goes down she doesn't drive anymore but my friend who's a duty is like six you know to whatever he can handle themselves ...\nHe grew up in the mean streets of seamy valley oh well he can handle observed show he you know you kick to do it out of the uh out of the car and a gun and by the way in fact I Want if you wanted it to be go time I know my friend was prepared to go really oh yeah and by the way I'm prepared to go do time you mean like a fistfight yes Jennifer\nMan\nAll right everybody has to be with you\nThank you mark guy serving you know the guy who's not only a wonderful broadcaster he is a wonderful man I Know the man many years of animal he is a good good soul or\nI was on my way to Colorado State university yesterday were I spoke to are you ready approximately twelve hundred people most of them students\nTwelve hundred to open up another wing [noise] wow is right it's a wonderful thing that might before in the San Antonio Texas I spoke to five thousand Christian ... at the cornerstone church metal some Jews there as well but\n[laughter] [noise]\nAh there is so much to tell my friends we are living through one of the greatest law you periods of American media in the history of the American media is drenched in law\nIs saturated and why it is swimming in lie it breathes wise it exhale is why the President Trump in some way blood to the murders of Pittsburgh Jews\nAs a Jew as an American as a human who loves truth these people are despicable\nJew and non Jews lying about this using that gets to Jews because they hate Trump they hate Trump more than they love the debt that is my belief\nBecause if they didn't they wouldn't use the deaths of Jews to crap on the president\nBut that is their greatest motivating force of these people the hatred of this man is greater than obviously greater than any love of truth\nTo compromise of the press of the Anti Defamation league of various Jewish agencies of of all of the less the entire left it's lying lying lying place\nI said my whole life the truth is not a left wing value this proceeds Donald Trump this proceeds is it is merely the greatest manifestation of it we are living through another left wing lying hysteria your diluted ally\nThe man hated Donald Trump as it happens\nBecause Donald Trump had to have was surrounded by Jews according to this man and a half course had Jewish or relatives his daughter among others as you this is the man who leads to anti Semitism is\nA I always watch CNN because it's important to ...\nFranklin for F. O. E. R. more on of the day 'cause I Would say more than a year but they use has a lot of competition tomorrow\n\nI think I Want you to think about a ... is there we're quibbling is there is is there any if they were Catholic writing for the for a a a National Journal\nSaying that if you support your Catholic who support the president you shouldn't be allowed to a Catholic Church your money should not be allowed to support a Catholic school is there were Catholic equivalent of the Jewish left\nIs they were Protestant equipment I Wonder and I know I Do ... Christianity really really well I Know there's a ... is a Christian left but I have not seen equivalent to the despicable statements up his Franklin for if you are\nWho was invited out to my show officially and I will not cold in any names when he comes on I Will politely clarify what he what he says\nHe won't come out that they don't come on even though I Do treat them nicely but I don't blame them in this case after what I just said about him I talked to blame but I Would go on\nI go on all the shows where they call me bad things because I'm so convinced that I could show people why that's not true so Franklin for if you want to explain why you will not at least ... person please come on my show\nWhy this is about as close to anti Semitism what this guy wrote we will not we will not allow Jews into synagogues because of their views\n... is it a show it's it's it's it it is so outside of the possibility of Judaism\nI Wonder does he does or does he uh has he ever said that Jews are Jews who support the bbs movement cannot\nGo to synagogue\nThose who want to strangle Israel economically are they allowed her to synagogue Franklin for\nMaybe a what my next column of Franklin for sure you'll be Atlantic won't publish it\nIt's it's mind boggling folks the powder and total destruction of non orthodox Judaism felt most total total they were terrific I'm ... I'm not even worth it to them saying this\nBut this is just another example we shouldn't allow at Trump's supporting Jewish synagogues or take his money to to help charity\nIt's mind blowing yeah he's a nationalist therefore it's a dog whistle to tune\nTo nationals white nationalist [noise]\nThe the first man and the history of the world that I Know a to support those who wish to exterminate Jews who has a Jewish child and Jewish grandchildren\nYou gotta you gotta believe this guy's really really sick and bad but they do believe that\nDennis finger show live from the relief factor pain free studio [noise]\nGet breaking news on AMA Seventy the answer adopt cutting\nTraffic\nProbably had to think of that needle rock on the teen heading south on and how many times they concluded that accident cancelled the thick of African Americans taint\nYou need to have through early on ... avenue that ended up back in ... that first in the chronicle and the last time they come and go from time\nTo make that kind of and down the Catholic fifty five I think and I actually have any they televise Jamie ... Seventy than than [noise]\n\nPresident Trump plans to sign an executive order aimed at ending so called birthright citizenship\nTrump telling Axios on HBO that a person comes in and has a baby and the babies essentially a citizen of the United states president says he can make the change of the stroke of a pen\nAnd you can definitely do it with an act of Congress but now they're saying I can do it just was an executive order\nBirthright citizenship is guaranteed by the fourteenth amendment so the constitutionality of such an order isn't clear police in Anaheim investigating a body that was discovered in the dumpster near Disneyland the person who was looking for recyclables reportedly made the discovery early this morning behind a condo on south Euclid straight police officials\nSaid did discover a body inside of a bag some sort of a bag inside of the dumpster we don't know the condition of the body yet how we don't even know the sex we're waiting for the coroner's office to get here and\nPolice are giving the all clear after a suspicious package was found and the Pasadena you haul facility the discovery made last night attached to a U Haul truck officer said the item was made to look like an explosive south I'm others have low clouds and fog than sunny upper sixties seventies beaches upper seventies mid eighties inland\nEli downtown clear sixty to Windsor calm and publishing mostly cloudy and sixty five I might Marino but then in Springer show continues\nMy friends I'm here with Larry Elder and our good friends Dr Simon to T. M. J. expert you know at a our audience knows you successfully treated my wife and son were suffering from headaches that can shoulder pain and of course you helped Larry with his tonight is\nFact he was hearing me in his ears are rarely applied and we are both ... testimony maybe your skill and expertise thank\nYou but it's really an honor to be here and the more and more I. Q. your lesson as they tell me how blessed they are that you guys introduced them to me\nSo explain to our listeners a connection between our job when it comes to headaches migraines and that can shoulder pain tennis severe ringing in the years like I had\nA very large eyes connected to our head\nAnd neck and shoulders and any alignment of the job may be the source of your pain headaches and ringing in the years many of my patients such as yourself has seen multiple especially such as EMTs neurologist we know relief until their doctors refer them to me\nIs Dr Reddy Simon has devoted Thirty years to the study of successful treatment of T. M. J. which is why doctors chiropractors in dentists refer their patients\nTo Dr Simon think outside the box and get rid of you're paying for all as Larry and my family have called doctor Simon Dr ... the only T. M. J. expert we trust eight hundred Ninety to smile that's eight hundred Ninety to smile\nNationally recognized oaks Christian school in Westlake village now offers residential boring for grades nine to twelve domestic and international students live on campus and participate fully in OC student life\nBoarding provides flexibility to visit your student when you want to attend their school like that and had them home on weekends as your schedule permit learn more they're open house Sunday November fourth one to four pm register\nAnd most Christian dot O. R. G.\nOaks Christian a day and boarding school oaks Christian dot O. R. G.\nNapa auto parts has the expertise in parts you need to help keep your car on the roads no matter how many miles that has already fired tell people that can happen to know how\nAn Larry Elder sent you straight we starting at three PM on AMA seventies the answer [noise]\n\nEverybody [noise] and I every body on DVD and Blu ray today [noise]\n... death of a nation [noise] was only a few days left ... terms of stillness crucial see\nGet your copy today at the back of a nation that dot com that's death of the nation [noise]\nDot com Dennis Prager here [noise]\nAnd ah [noise] I I Am just uh I I\n\nYou know I live in this in a living is a very uh I'm so open with you so I'll tell you this I I live in in in this dichotomy of such a blessing in life\nAnd feeling that I'm doing something good with it and\nThey're traveling around speaking to wonderful in very large audiences are very different backgrounds five thousand Christians in Texas on Sunday night twelve hundred mostly students at Colorado State university yesterday so I feel\nFeel good about this and about my family and up about my my health with all the normal issues that humans\nHave put my love of country that I have to raise it affects me they have to admit it\nDoes\nTo be some drenched in lies pernicious lies to see the the only massacre Jews in American history used by the left purely for left this\nAnd\nThis is one of the most sickening displays of left this violence and the American history what you are seeing now on CNN and MSNBC New York times Washington Post the Atlantic the Jewish left\nIt is it is unprecedented a male I Can't say that because that they they lie so much so I don't know if it's on president but it\nIt's it's quite remarkable\nEverything for the ... ... ... anything that happens the only question is how can we smear the right that is that is the that is the how do we get more power from\nThey're awesome disgusting conservatives but it doesn't come with the territory left his ... makes you disgusting that's the point conservative doesn't make you disgusting there are disgusting conservatives because of conservatism\n\nLoni Burbank, California hello Bonnie\nHi well that's why I'm a nationalist\nAnd I'm also a Jew and actually let my temple because I couldn't take the liberal dogma when I get it when I when I was so\nForgive me forgive me one second all of it you were if you were getting liberal dog but you would have said you were getting left this dog but it's critical to make that distinction\nThat all the time I heard you call a left at the Martin Luther King so how do you explain like even the rabbi was left side and you ...\nYou mean ... what are the same way I explained why the pope is the left is left his name is the most dominant wrote that dynamic religion of the last hundred years it has affected this is my I mean I said this a thousand times and I'm happy to say it another time left his of his influence Judaism and Christianity in the last hundred years for more than Judaism Christianity affected the world\nOr a friend of mine and evangelical Christian was telling me how a leftist I'm is making inroads among young evangelicals that's how powerful it is\nSo you're saying that they put their quote unquote let them religion above ... [noise]\nWell yes of course I Am that's there that was their values Judy Jewish Jewish is their ethnicity their values are left his book but they wouldn't say they wouldn't agree with me they would say Judaism and left his mother saying that's what they say left his image Judaism have the same values that's what they believe\nOkay just like the ... have been left to some have the same values\nSure that's the way it works that's it that's it my friend uh Joe in ... Park California hello Joe Dennis Prager\nJoe I keep up the good fight tree shaded thank you thank you for controlling my own observations that this is spreading Nightline plain language of the biggest threat\nTo the media everywhere you turn it they say oh it's it's a ... percent ... percent right I don't understand\nIt all day don't even if they they they don't even ... they don't even say fifty percent left\nLabels that may have ... percent left when Eric Holder says when they're down kick them when Hillary Clinton I mean we're talking about me that made the major figures of the Democratic party with Hillary Clinton says you know we'll be civil when we when we when the elections until that will be will won't be civil\nMe who were the people did anybody did any prominent together and you have to talk prominent you can't talk about crackpots living in their motives basements put stuff on the Internet and we're talking about a prominent prominent was there a prominent bill right wing comedian who put a shepherd head of rock Obama on the on the Internet\nProminent ... baking prominent conservatives making fun of the of of President Obama's children there's no comparison\nJust out of course the stuff that does go on and simply ignored\nHere's one for you let's see when did it happen I think it happened yesterday\nSo here's a piece from the Orlando Sentinel shots fired into ... county Republican Party at office police say if you know that at least for shops how many how many shops are being fired into what democratic or the offices\nBut I just just this is all this is all examples of off lots of what's going on here let me shut off this thing you know settled on the computer there we go\nAt least for shots in front of the balloons your county Republican parties office in South Daytona\nPolice at the yesterday [noise]\nYou you won't hear about that\nYou're about to make up stuff the made up ... [noise]\nBut the president\nBeing pro Nazi\nYeah you know his daughter and son in law and grandchildren may well have been in the synagogue on Saturday\nAnd the president is is a dog whistling to the people who murder such people\nYou six puppies and said this about the president sick disgusting people\nFactor for you\nMichael method is coming up at noon on AM eight Seventy the answer\nBut first experience the ex chair I was quite impressed not only just the chair proved the look of your office but it actually improves your concentration and productivity due to better posture so imagine my surprise from the makers of extra sent me their newest version and told me if you like your next year you're going to love your new X ray I think it was possible to improve\nBut when my ex re arrived I sat down and I understood what they were talking about\nThe extremes you make a PR fabric makes you feel like you're floating on the air and it's patented split back a lumbar technology provides a crate link customize to feel that must be experience to be believed\nHere's how you can see and feel the next three for yourself go to X chair Dennis\nDot com now don't wait order now at ... chair Dennis dot com or a hundred dollars off recall eight for for for X chair extra comes with a thirty day no questions asked guarantee of complete satisfaction do to X chair Dennis dot com use the ... Dennis\nFor a three foot rests ex chaired Dennis dot com\nThis is a court ordered notice current and former foreign Lincoln and mercury owners are less sees can receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags in their vehicles\nTo see if your vehicle is included and to file a claim to the auto airbags settlement dot com or call one eight eight eight seven three five five five nine six sets auto airbags settlement dot com for one eight eight eight seven three five five five nine six\nThere's a new home loan program for self employed borrowers you need to hear\nThat I'm Tania ... south of St Martin specialist at right twice in my teens half implied myself I now have difficulty to get a home them here we come after the ...\nInstead of using our taxes are trying to get a Prince William ... business bank statements and you have a positive thing can require ... getting bigger and better right Tommy now eight eight eight KTEL nine five three they're\nNot hired many break your neck or even for teachers yeah Ninety fast you're self employed and lime fast\nOut our ... economy now teaches at Ninety five thirty\nNine five three their\nRhetoric mortgages licensed by the ... one nine four three seven three six and also licensed by the end my last one three to five eight three and it's an equal opportunity lander\nCan you know they can call its preferred vendor from us extended warranty companies if you think you have a transmission from car just doesn't feel right for a service flight is on\nTrust your vehicle to the same guys warranty company trust your neighborhood and co guy with the initial transmission jak there's always Frank why not have potentially small problem\nTurn into a big one call your local ... center today that step away\nManziel translations and a whole lot\nMore chaos ... place contests for the rules go to the contests have an elite Seventy the answer dot com [noise]\nReally missed him lines on our website I may be answered\n\n[noise]\nThey did it it it do do do do do do do do dude\nToo I like I Love this one by everybody Dennis Prager here\nAnd you want to fight to the allies or the left and and it never has it been more displays and blaming the presidents of Pittsburgh [noise]\nA Mac is one of the things you can do you got to help the good guys are right [noise]\nA Mac and by the way you get\nBy joining you get far more in benefits any way been moved to the meager nothing a\nJoining the biggest one they want to have a lot of people so that they have more clout for more religious freedom from one person liberty for less government for lower taxes a Mac association to mature American citizens of the conservative alternative to a A R P\nWorking hard to protect government overreach three birth of American patriotism is real and a Mac members are at the forefront a Mac me do you need a Mac go to a Mac dot US not ... I'm not a Mac dot org\n... not a Mac die or\nA Mac dot U. S. is great organization a Mac dot U. S. A. M. A. C. I'm Dennis Prager and this has been one of the most disturbing hours of my broadcast career to see the ... saturating this country saturating it\nFive thousand Christians the night before in Texas cornerstone church in San Antonio pastor ... wonderful were truly one of the wonderful people of our time\nAnd\nUh there's ... there's so much to tell you all about all of them I Will I Want to reflect on some of that because it's relevant to what we're doing but I spent the last hour\nTalking about the the the ... of America and one of the greatest lies it's not the greatest lie that has been widely believed in American history or maybe there's another one I didn't I don't know for a fact that that is the greatest in the sense of most widely believed\nThat permeates the media permeates left wing groups president is responsible for the Pittsburgh murder of the Jews\nAnd the use of the dead Jews for the left and she is one of the most disgusting things in Jewish history certainly American Jewish history but they're proud of themselves because getting rid of Trump is more important to them and honoring the dead that's why it's the fact\nThat is why they were Jewish synagogues that sat shiver when Trump was elected they were proud of it they actual sects ship it means it was a Jewish ritual of morning for an immediate family members who just died\nThe perversion of Judaism into left his ... is is rampant just as the perversion of Catholicism intellect as a matter of Christianity to left is\nMaybe one day you will understand when I say over and over that left ... has been the most dynamic religion to the last one hundred years far more dynamic the Judaism Christianity Islam Mormonism any any religion it has been the most dynamic\nIs conquered break numbers of Jews and Christians\nThat's right but it has that's the way it is university is ... is a left this temple\nIs more dissent in a synagogue up or any any time of the study than there was a at a university\nRight now Michael in San Francisco doesn't agree which is why I Want to stay on I'm Glad he did Michael back to you why\nDo you report it to me that the the a deal said that there's been thirty three percent increase in anti Semitic communication and what else would there was another word to use so\nSo what I wanted her favorite but I don't want to play a word game with the Anti Defamation league ... very very mainstream organization that\nIt's not a main street organized we differ on that it's okay go ahead\n[laughter] well [laughter] okay [laughter]\nI don't ... I don't trust it but go ahead go ahead I'm not arguing with you and my only saving I ... the ... do you think that the New York times is mainstream reporting or left wing reporting\nFor New York times you're liberal organization\nNow okay so do you think the only liberal organization\nI yell exam or an uncle or read about the mainstream of your country can anyone could hardly anyone thought\nOK okay we differ on that go ahead please\nOkay\nRecorded and Trump hurt your ... there were ... or ... percent increase candidate second you're an increase [noise] but again I don't want to get caught up in a word go in and committed ... with the\nActual activity et cetera and more important rewriting from in Pittsburgh the right wants to limit this to nothing more than an anti Semitic however ... very good thing about these you\nBet enraged get we're certainly happy because there were ... ... ... because the favor of the work directly from the ... the president in theater coming up from the board\n[laughter] okay I'm a little I'm a little confused here who said who said that these Jews favored invaders\nThe man with a gun who killed eleven that was\nOkay I thought okay I ... I I Believe you I haven't heard it I Believe you you also know that he says is that he can't stand the president because the president has too many Jews around him [noise] are you aware of that you\nSaid that he said that the one thing he doesn't like about him but he also agree with now and these are his work with the invaders or coming to water and he wasn't talking about you you were talking about migrants which was one of the favorite topic you write in Pittsburgh have a group called\n... or a big part in a group called higher fever immigrant who died more be older and mainstream group in the world they started off helping Jewish refugees refuse any other country this gentleman\nFor lack of better for the moment killer enraged\nAt you for that reason using that\nWord than cook right\nWhy didn't Christian they were All right so lumped arts and let me ask why didn't he killed Jews ... Jews Christians who oppose the uh the caravan and a vast numbers of immigrants coming in illegally\nWell that's great that you're working you're working with her when they were to create the elements that on there but yeah the ... and certainly that was the thing that got killed ghost okay you can write your Carter\nSo if I'm right so if the president also if the ... okay if the president were uh were said I think it's great of caravans of south tens of thousands of people come in ... he would not have killed the Jews in Pittsburgh\nI Am so obviously you're trying to say that there is the correct wander one correlation you\nKnow I'm not I'm I'm just stand on what you think that by lawyers you know the\n... what am I trying to tell me what I'm trying to say because ... ... what are you may know better than I what am I trying to say\nWhy don't we agree with Trump did say and ... and his supporters writer okay\nSo yes so let me ask you a question what would be how would you characterize\nFourteen thousand that's two caravans worth of people a A R B you or would you call them guests would you call them refugee and they would actually be have that right ... yeah okay go on or you are okay okay are you for accepting them into the country\nOr expecting it under the appropriate now with the greening that go through every who think that the American kid right for what they are not they're not what Trump and your reporters you've been on what you were going through media with box and I\nThink they're carrying electric smallpox eradicated almost ... years ago ... years ago that they\nAre like I I think okay I under your right by the way I thought\nWell let me let me see okay so let me say there is there is overheated rhetoric but I Am completely opposed to letting their man\nAnd I believe that the greater threat to America frankly I think it's up to the best of my knowledge anyone who says that they're bringing it smallpox is making a stupid argument okay I agree with you I never heard it but I Believe you that it's being said I'm sure a lot of ... things are being set\nOff rate of smallpox okay\nAll right you're right fine Okay Michael\nI I'm agreeing with you said you don't have to debate me any more if if that is one of the stupidest arguments against is the only arguments against this is not smallpox the only argument against this is just the does America have a border or not that easy to control the less essentially believes in open borders 'cause it finds nationalism to beat the testable\nDecided to test the but when you're asked to go in the United states back\nNationalism and you know and you know\nWait it's a way where nationalism is not having that nationalism is having nationalism is having borders borders as part of being on nationwide\nMart or the net and you know there\nWas a much more that's where we may differ I don't think it's more than that I don't think that\nYou have your height for protection other quarter thing that not only should we protect the border but the people who want to cross that border are ... every other area\nOkay are we going back to that al ... thing go right word I'm okay I'm In front of the credits now okay\nThat's a lecture we talk to you when he called animals who was MS Thirteen image Thirteen our animals if you don't believe the Amish Thirteen could be characterized as animals I don't know who would be\nOkay I think the ... so the debate isn't about the debate is not over verbiage even though verbiage matters I agree the debate is over whether the United states of America like any country can have can have a a a border\nThat can protect its borders the way Michael protects his home in San Francisco and the way I protect my home in Los Angeles\nFor America is our home we have a right to say who can come in that's pretty elementary\nThat's what this debate is about if the president's had only use the most congenial language and by the way I Do I have said a thousand times at least\nI Would do exactly what any of these people from Guatemala or Honduras or Mexico do\nI Would leave the corrupt countries of Latin America and try to come to this wonderful garden of Eden the United states in any way I could find that as\nThis is what I mean by by the lying media\nAnd with regard to violence yes there are individuals there are individuals with so called right wing agendas who committed acts act of violence there there they are outliers work despicable okay mutually sick but nevertheless they are what they are\nBut with regard to the the daily attacks of of screaming at people uh at shutting down ... ... let me let me give you one example which I think ... the entire issue\nUniversities I have a picture\nI'm going to put it up on the I'm going to put it up on a on our\nFacebook page will put it up a trigger you page will put it up a dentist pretty good dot com took a picture last night of the guys do with the guys who guarded me at Colorado State university these these two are policemen are who are in a sexually uh army guard they they look like they're they're going to fight the Taliban\nDoes any left wing speaker in the in the country meet such guards at a at a university wider only conservative speakers meat armed guards at universities why would that be if they just as much violence from the writers from the left why why is that how can the most radical left wing speaker meets no guards at a university\nWhy did what Ben Shapiro went to Berkeley they spent six hundred thousand dollars a for a yarmulke wearing Orthodox Jew to show up at Berkeley\nSo stuck with your lives pleases so comparison there is no comparison yes they were individual despicable act of violence by right wing or ... I Hope they rotten held they burn in hell\nBut they are the outliers\nYou want you want to be shut down you want to be you want to have a ... you want to be screened ... how many ... to to at least two Republican candidates have been punched just the last couple of weeks any democratic candidates punch\n\nSo just just a few facts on this issue\n[noise]\nWhen they Prager seven seven six are we doing on time here\nGo that's I mean what do I think I mean it's such a role\nThey do he's been a very intense day\nWhich fellow Jews get slaughtered and then I watch fellow Jews use their deaths due to the to promote anti Trump hatred\nDisgusting just disgusting\nPlease I beg of you will watch and said watch and send the speech I gave\nThat the largest conservative synagogue and unorthodox conservatives one of the ...\nYou to Venice Prager at the valley Beth shallow fence and watch what I said about the Jewish law\nHere I Am a seven easy answer\nHad a class and lower on the menu and hadn't left on it like I placed it on our side now but the guy just dumping the if I'm coming back from traveling and then went on the hanging on by that the class\nAnd that's blocking Eileen ... west ... thing is I found out found in ... highway and you need to get their money things I'm painting painting my backpack or a different the classic cleared acts but dancing in the Senate and ... and make that again you can find [noise]\nReports say Boston mobster James Whitey Bolger has been found dead at a federal prison in West Virginia destroyed from Pete Williams\nWas found dead shortly after he was moved to this prison in West Virginia\nThere are local reports that Bolger was murdered after prison but the people we've been talking to cannot confirmed that\nHe was eighty nine years old he's just been relocated they'd been moved around several times in recent weeks he was in a penitentiary in Florida he was moved to one in Oklahoma and then within I think the past twenty four hours he was moved to this president now what the circumstances of his death are I don't know\nUm the the they certainly appears to be suspicious whether it was an accident whether it was natural causes or whether he's murdered will probably know in the coming up our series\nWord today the the LA Unified School district is settling with a woman who claims she was sexually abused by a teacher fail anytime soon as the district has agreed to pay the twenty year old victim\nFive million dollars something about this low clouds burning off the sunshine today upper sixties to mid seventies beaches upper seventies mid eighties downtown red flag warning to know the high risk of wildfire will be in effect from tonight to Wednesday LA sixty five\nFoliage than it's sixty eight ... Dennis ... continues\nFolks time with my good friends Larry Elder and Dr Reddy Simon the only T. M. J. expert we recommend 'cause she successfully treated my son's headaches migraines mic and shoulder rake\nSteady also helped me with my tonight is how you had a patient a young mother who was suffering from migraine so bad because she couldn't play with their kids or even pick them up from school she'd seen multiple specialists ... internists and suffered for years until you discovered the source for pain what's her jaw muscles\nThis lady was being treated for depression I finally discovered that the source of the pain was tea and Jay related to her job they successfully treated her and her doctor and I got her off the anti depressive medications she's now pain free enjoying her life her husband and her children\nThat why Dr Simon is the G. M. J. expert we recommend\nSo get rid of your pain once and for all called Dr Eddie Simon and eight hundred Ninety to smile eight hundred Ninety to smile\nHigh for the money guys have applied financial planning I sat down recently with the team to learn more about that Robert my calling their voices so familiar my listeners we hear about annuities and nobody is all over the radio tell us about the annuity trap\nThey knew any trap is that you sign up for a long period of time to get guaranteed income which helps you sleep nice the bad news is you just heard your liquidity you don't have the ability to\nHave you write your need to go to a few thousand dollars on fixing your kneecap you don't have the ability to participate in gross or if you do it's quite muted it's very very limited what you're going to get out of the guaranteed income but the good news is\nThat an insurance companies behind it and a note insurance companies ever defaulted on an annuity paying but she was very limited\nCall eight hundred six six hundred for that shutdown that eight hundred to a six oh six hundred [noise] get you're free to hear what review ... eight hundred to a six six hundred or a book on line that so many guys dot com\nSecurities and advisory services offered to help you out financial registered investment advisor member of ...\nHave your groceries from state or brothers delivered within ... brothers dot com and tap into ... available in most locations excludes incident savings digital deals and when you buy offers\nLike you're just search for a um [noise]\nSince his latest the most important film death of a nation is available on digital age the one film you can't miss before the elections that we can afford to lose your copy\nMail at ... dot com order today at destination movie dotcom\nThere's mass\nEverybody Dennis Prager just little reminder and two thousand and six July twenty eight\n\nSix women were shocked\nThe Seattle Jewish Federation\nOne was murdered [noise]\nOne of the six was fatally shot [noise]\nUh let's see here\n\nSo that would be in the Bush administration I guess was he was he responsible for that\n... ...\nThey didn't say so because they hated Bush but the but\nThey they have and they hate Republicans they hated Romney I mean you know it's just like a joke because Romney or was around me a bad talker too as Rami said terrible things\nThat Romney\nLast night at my speech at Colorado State which we're going to put up with video preview so we're going to put it up I think today I Want you to see it or want your kids to see it I built the first twenty minutes I've dealt with what was said about me or it just made up purely made up stuff in the in the Rocky Mountain and uh\n... what is a college and I think that's what it's called the ah the Colorado State paper\nIt was so it was so important that they were black lives matter people there by the way to all their credit none of them interrupted my speech none of them that 'cause they there was nothing to interrupt because\n'cause nothing about me that was written me at Rocky Mountain college there was nothing that was said about me that was true so when I showed that to be the case there was really it's not much to yell at the demonstrators\nIs fantastic they are the ones who bring to the Supreme Court these cases on behalf of a of of of the the the people who can't afford they can't afford the lawyer so they pay for the lawyers so we pay eight we we pay for the lawyers by contributing to ATF there's an ATF\nBatter and Dennis Prager adopted calm and that is the way to do let me to see me you can I give you a number that yes I can give you a number and the number is\nThe number is [noise]\nNot hear the number is not hear\nHow can the guy had to give me a copy with no number I just so just to go to the uh [noise] go to the it'd be a better on my on my website that is ... and if they show on who centers\nThat\nThere'd be an atheist thing we've known about but it's All right because it's easier ways just click on the better okay then is Prager here and\nEight hundred go on\nFor six nine\nNine six five six but we're on a classy operation or what\n[noise] got to tell him to Buress say All right ah let's see sues in New York City Susan of New York famous Susan Hi\nI just play um [noise] I I haven't heard it by your word tremendously I share your steering exactly I I think he was from I ... I haven't had one second to more than\nWhat had happened to these a wedding hall because even when federal crime school into our bodies which do their thing became criticized politifact I don't know what though clearly by\nAnd I had no wrong as far as I said I Am and he was from a big issue with rabbi especially my rabbi that we have to be like it when it was a free trade and history at\nJews can't unite on the on the biggest if you can't get out on the biggest slaughter of Jews in American history a vet it gives you an idea of a outlook I've noticed my whole life left wing liberal left wing Jews their values are left this not Jewish\nVicious a perfect example that's what you should know my but I just want you to know my heart goes out to you 'cause you're living in New York City as a as a a conservative Jew\nThat is one new the\nExistential crisis but God Bless you but I give you strength by\nShould that's it\nPart of it the the moral broad of the left to its old moral fraud\nThat's right blacks are hated Jews are hated the right wing that chip that Saturday That's what they do that's what they've always done they've nothing positive to contribute nothing whatever they touch the poison especially Judaism and Christianity but not no especially the university especially the arts the book don't get me started\nOh well what about the boy scouts okay let's go to\nAh let's see who else is on here there oh this is nice David Colorado Springs Colorado where\nI just was last night high now I thought I was in Fort Collins so I'm Sorry I are more\nColorado Springs south yeah yeah yeah you're right and experienced you um last night or synagogue or should I say Iraq this temple this guy is a Jewish synagogue um we had five hundred shoes and non Jews\nWere standing room only it was a wonderful show over sport support however speakers except for one who is the chief of police one had to bring politics\nAnd to me it was disgusting some into one point one speaker who am I going to the ... ... you know there were like what happened with crystal knock beginning of the Holocaust and he says\nCan we say it again and I have the uneasy feeling that we are in a similar crossroads they're not country today Germany was eighty years ago Germany\nWill then he's an idiot for staying here I mean ... if he if he if the if it's the beginning of the Holocaust he should get out while he could still sell this house that a good price and moved to Israel there was no Israel for German Jews\nNot always chose he's lying because he's not act on it he doesn't believe what he said that he would never would have said it had to happen in the Obama administration she's a liar liar\nAccent that's what they do to do it but it's so easy they don't they don't sleep all he did it was a miniature sleep because the only good is defeating the right there was nothing else or moral categories are suspended [noise]\nGuy wrote in Atlantic a Jew\nJews who support Trump should not be allowed in synagogue\nAM eight Seventy\nI this is Dennis Prager for best hot grill dot com at that time again time to select presents for your family and corporate gift for your best clients and employees and\nYou want to get them a gift that is fantastic unforgettable and truly hot that would be a solar infrared grill from best hot grill dot com so Larry infrared grills heat up one thousand degrees in just three minutes\nAnd produce juicy tasty food unmatched by conventional grill perfect for today's busy lifestyle the hot and fast\n... infrared grills or the gift that will be used not tossed into the closet every time your loved one's best clients and value employees grill on their ... infrared\nGrill it will think of you and for years to come all silly or infrared grills are made in the u._s._a. and may to last more importantly solar infrared grills deliver the wow that everybody likes to receive a gift step up your gift giving learn more about these amazing ... infrared grills at best hot real dot com that's best hot grill dot com solaris infrared\nAt best hot grill dot com\nFinish Prager here Vicksburg carrion with more carrying real she understands how serious it is to get the most money one selling your home is your largest investment bank will guarantee that he'll sell your home for one hundred percent of the asking price or he will pay you the difference\nDishes effect when it comes time to sell your home the more buyers that know about it the more money you will get developed an exclusive program to take the stress of selling your home and at the same time let's thousands of buyers know about your home through his buyers and waiting acquisition program\nHe currently as over twenty thousand registered buyers\nWho are willing to pay top dollar for your whole\nBig not carrying the so confident that he will guarantee one hundred percent of your asking price or he'll pay you the difference ... more carry a now at eight one eight to four eight eight six six eight one eight to four eight eight six six eight eight one eight to four or eight eight six six eight\nLarry Elder here with my buddy Aaron founder of California deluxe windows\nThank you let it take it from here just wanted to let listeners know that if you purchase planting them serious windows and doors before the end of the year you will get free room free Nazi free and feature that will benefit\nYou for very long time forget about squeezing rags and hiring a window washers you'll get an ... grade to a self cleaning glass\nLets out to them by led to raise them the sun natural moisture in the rain clean your windows for free for the\nBest quality windows and doors to call my buddy Aaron for twenty percent off your entire order and one year interest free financing California deluxe windows in chatsworth Anaheim and Marcus into eight seven seven windows and he will indeed say\nYour house can be covered with the state of chips we wouldn't crack one\nEight seven seven windows take seven seven windows\nSee if they'll be number seven seven four or five ... some restrictions may apply\nOnly Seventy answer at this year will be the last one of your friends to have a Dell is now at the store or Google Play carry us all around\nThe alliance defending freedom has over three thousand local attorneys nationwide fighting for your religious freedom please help support them by calling eight hundred for six nine nine six five six or go to Dennis plague or dot com look on the ATF fan or to join you about\nEverybody here that is eight hundred for six nine Ninety six five six freebie up and that is my fault or as the young people say my bad coffee was here by\nMisled myself\n\n\nGot that those hurt who\nBut I deserved it yes even on occasion I entered the plenty of the punishment rule our belief at the Venice Prager show was if you are a flood you deserve to be punished [noise]\nUh it's really conservative of us but that is what we believe we actually believe you are responsible for your mistakes and I was responsible for mine period ended his shoe\nThat's correct if you don't make excuses you you're all ready part of the conservative movement\nCan't blame it on anti Semitism or anti hiked his ... although I Will tell you that my height at six for when you travel\n\nSecond final answer surveys I\nThink well it was like\nAnd good luck with the\nFlow every holiday I Am\nIs pretty [noise]\nThis is the ultimate issues [noise]\nEvery Tuesday the third our Springer show was devoted to the great issues of life a lot of great issues the reason for this hour is that\nMany people have a map they know exactly where they are but they don't know where to go that is by the way that's the given in life we don't know where to go we have to be guided to where\nIt is best to go morally and in terms of happiness in terms of meaning in terms of many things so this is a big to be cold I guess the map show\nOr the where to go on the map show but it's the ultimate issues hour and I welcome you all again I'm Dennis Prager thank you for being with me so of course anti Semitism is in the news so let's deal with it on the ultimate issues hour\nAnd I will offer you some thoughts I have written a book it's said its third edition it is it never been out of print I began to\nWoo hoo many many years ago and it's been updated and updated enough data but the central thesis is identical to the original after all it's in each subject unfortunately it is the greatest hatred in history\nUp a greater percentage of Jews have been murdered than any other uh look at student group that we can is that we know of and uh it is a\nUnique aspect to this is Katie unique aspect of Jewish hatred whose name is anti Semitism too too bad she can go to a trip up the anti Semitism and meet the seventies and Germany\nAnd the unique aspect is that it is\nAlways ... works determination is people who hate Jews want them all wiped out they don't want them and slaves were persecuted\nThey want the White House that's an amazing thing in every generation that has been the case there's been a group that is one of the twin ... Jewish babies therefore or targeted as they were by the Nazis Jewish adults\nSo explain a little bit about that they put the book is why the Jews the reason for it by Semitism the greatest predictor evil\nAnd I think you'll find it riveting why the Jews wrote it with rabbi Joe ... many many many years ago and again it's been updated enough that he was the third or fourth addition published but I wanted to play three publishers Simon and Schuster Simon and Schuster\nAnd Harper Collins and Rick Murray regularly is published by Bible commentary from a beautiful job I my dad\nSo I have a question for you\nAs I can use them for some so I'd like you to call and we are told repeatedly\nToday that there's this tremendous growth in anti Semitism in the United states uh so I have two questions\nOne do you think that that is true whether you're a Jew or not a Jew I Want you to to tell me what you think do you experience that if you're not Jewish I mean are you a hearing more a Jew hatred in and talk with Jews are about president\nOr if you're a Jew or you're experiencing an anti Semitism at work\nOr on your dry from home or anywhere\nElse I I have not even my mail and ... I'm I'm pretty well known in the United states and\nWhere to touch them in the mail I mean there are others who do I have I I'm not saying that they don't I don't deny for a moment but I get very very little I have I've not seen any increase the people who hate me hate me because I'm a conservative not because I'm a Jew\nSo I uh I'm I'm just curious I really am curious maybe I Am not aware\nOf this increase that is allegedly and maybe factor we taking place I Know it's taking place on college campuses but that but that's all from the left and from Islamic students\nThat is not backed stuff from the right but that is true if one wants to identify\nA anti Semitism and it's increasing you say well that's anti Israel yeah but there there was very little difference okay if the only state on earth you target is the only Jewish state on earth than I'm Sorry but that is anti Semitic okay let's please save me said me the uh\nThe nonsense they're two hundred and something countries but the only one that I work to it destroys the Jewish state but I don't dislike Jews oh okay so you don't dislike Jews does it matter\nIf I submit does does it mean dislike Jews means work work to when I elite that has that\nSo yes there has been I there is an increase in anti Semitism on the American campus but that's not what the people who say visiting present I Semitism talking about they they think there's an it they claim is anti Semitism that his massively increased from the right\nWhereas on the campus it's from the left and from um ... many Muslim students 'cause it's a target specific leader over there were students who were afraid to wear a Jewish star\nTheir uh their students who were afraid to where you know the college campus but other than that do you believe that that this is an increase and what is your take on this uh this whole issue\nWhat eight Prager seven seven six this is the ultimate issues our eight seven seven you know watch on it's been too long I needed I crave it give us the eight seven seven jingle [noise]\nAre either very nice job right out say that's good okay very good show I'm joined by the way of showing you should know sang that composed that and sleep it on every one of the instruments\n[noise] marketable with cheap and okay you didn't\nMark spring Texas hello mark that his Prager\nAuthor mark hot I think there is an ikea\nIncreasing at seven minutes and then Obama almost a hundred percent right now\nI Do it all and the other things in mainstream and actually ended up on my credit card bill is okay in hiring them then I had\nUm we had our mind around at our synagogue taken out by someone who is all over it and we had it ... the playground [noise] um where did that happen\nIn the middle of the Obama years [noise]\n[noise] All right let me react I I I just want to say okay this is an important I thank you for calling I don't agree I don't believe President Obama for an increase in anti Semitism and I don't blame President Trump and I don't think that\nOr if it if she played the core of the left does even though it's tempting I don't think Obama increase the anti Semitism and I don't think that um that the President Trump as I Do think that President Obama increased racial tension in the country\nHe could he could have in the course of his eight years Reid reassured a\nBlack America that this is a really good country\nInstead he said that racism is in our DNA spoke about Ferguson even though it would be the white policemen was acquitted by largely black jury\nBecause he acted completely in self defense with Michael Brown was not an act of racism whatsoever for the president to say for ...\nWas a disgrace to have a Al Sharpton visit him as often as he did El Al Sharpton was one of the instigators of the only ... Rome in American history that word is ... minute is used by Brandeis University historian\nIn describing the events in Brooklyn New York and crown heights when blacks attack Jews\nAre and they they were done by Al Sharpton and so yes but I don't believe that President Obama's responsible for um for I mean crucifixion who's a racial tension yes did he leave the country worse than you found that in every way possible I Believe so\nBut the but not in terms of anti Semitism [noise]\nOkay ah let's go to I'm Dustin in Columbus ohio Hi Dustin Dustin hold on I'm not going to I don't want to interrupt you so I hear the music so we'll take you so I we hear about all this increase in anti Semitism so fewer ... tell me do you think that this is true\nOutside of a college campus I don't I don't I don't believe it is true\nBut hey I don't live everywhere\nIt that we caught the expressions\nYou're right you're explaining it yeah yeah All right I I think your ear explaining it up and I think there is that that is part of it you should all I'll read the Israel test by George Gilbert who is of course not Jewish and or she has five minute video at ... university the Israel test\nAnd he uh he explains that point in his unique eloquence with his unique eloquence\nThat he is he's a ... one of the major thinkers in my in my one of the major ten thinkers living so he uh he he ...\nSentiment if you if you resent\nSuccess not just financial but also financial then that's part of what comprises anti Semitism but anti Semitism of course as I point out has the elimination of element we will lie like that and the guy in Pittsburgh settled Jews must die\nThat is very rare among ethnic big trees there are millions ethic bigger trees in the world this try this try this nation ... religion he just religion cetera et cetera but the notion that every one of them most die that is essentially unique to ... ... with all the Jewish babies\nMust die so it's a it's been a\nIt's a very serious hatred but uh I got my my question is do you think it's increasing in the United states where do you think that that's a exaggerated I I it is increasing I'm a ... but it's increasing to my opinion on the left\nAware or anti Zionism has substitute for anti Semitism anti Semitism is a form of anti Semitism ... folks if if you have any intellectual integrity you'll look knowledge that I'll\nJust say that the only state in the world the only people on earth who have no right to a country all the Jews is anti Semitic okay if you if you think of tally is don't have a right to Italy then you're anti Italian even if you love pizza and you love a Vivaldi and you love a a a battalion opera\nYou know verity unplug Jeannie it's relevant okay even if you if it if you got to a polio vaccine you could still be a as a semi by the way these people to give you an idea of irrationality all Jews ... Jews must I how do you see this guy might have had polio\nIt was a Jew developed that'd be of the polio vaccine and it's so many other medicines\nAll Jews must die but I still like to benefit from all of their medical discoveries [laughter]\nBut a list of it it's not like the these guys think rationally anyway if you read about this guy in\nPittsburgh use total loser ... he he even the New York times which is of course blaming Trump or even they they had a whole profile of the guy he was he was essentially invisible human being zero friends on the face of Iraq and the more\nThan a Springer show live from the relief effort in your brain freeze [noise]\nVicious AM eight Seventy the answer\nFound that I'm not an outline of LA and Daniel kind of content on the five hunting ... account times where it has the right lane shot down thanks ... latest update on that\nPoint now that drive south and go from Colorado chain diamond backs economic Bones Are found to fix the heading less than a fellow fan charge the car for amateur plane sat down for some kind of a hair wet\nAnd overall you're going to the top and go die from vineyard coming out of ... I'm ... Tamimi Seventy fantastic\n[noise] president\nTrump says he's going to sign an executive order ending birthright citizenship for babies born in the U.S two mothers who aren't citizens including illegal immigrants my power reports\nAct just reports Trump made the comment during an interview last night according to actually use on HBO Trump said the U.S is the only country in the world where a person comes in and had the baby and the baby is essentially a citizen in the United states in an excerpt released today Tom said it's ridiculous and it has to add actually says it's full interview with Trump will air Sunday reports\nSay Boston mobster James Whitey Bolger has been found dead in federal prison in West Virginia here's Pete Williams\nSaid was found dead shortly after he was moved to this prison in West Virginia [noise] there are lawful reports that Bolger was murdered after president\nBoston Globe reports that according to sources and intimate with mafia connections is being investigated for the murder\nThe eighty nine year old was serving a life sentence after being convicted in twenty Thirteen for his role in eleven murders south on one of those little towns in fog in the morning the sunny heights upper sixties timid seventies beaches upper seventies mid eighties inland red flag advisory going into effect gusty winds in a region\nTonight Claire than lows fifties and sixties sixty five downtown mostly sunny and forging it's cloudy and sixty eight I lie Marino Dennis breaker continues\nThis is an process sixty seconds sanity for\nUpstream dash ideas dot com I Know there's nothing new in this world that electric Tina's getting quite old ... crosshairs art over digital congressional maps was responsible for\nThe Gabby Giffords shooting so now tell President Trump's dismissal of the D.C press corps as\nFake news and declaration that dial eminent the dumbest thing on TV is to blame for the bomb delivered CNN words matter declare TNN president Jeff Zucker mattering is not a synonym for causation when Utah man was indicted earlier this month for sending a threatening ... letter from I don't recall seeing and featuring any roundtable discussions are historic Hi\nRon suggesting the Trump is Hitler crowd was to blame but every Sanders supporter opened fire on congressional Republicans I don't remember any suggestion from the left\nThat comment Bernie's over heated criticism from as a totalitarian inside of the shooting what's the standard\nFirst averaging who's liable for political violence you ask depends on the target is the answer to DC press corps offers words do matter and the wars offered by human refrigerator magnet ... political leaders and the Democrat Party calms team masquerading as journalists precisely what elected Trump and we'll reelect him\nIf you plan on selling a home listen to this important message from rex there is no longer any reason to have a six percent to sell your home introducing rex rex sells homes for the lowest the in the industry to ... percent\nTotal saving consumers thousands of dollars per transaction with rex you get a full service team back by technology they don't market homes the weight traditional agents do rex uses a data driven process to attract hundreds of qualified buyers directly to your home the moment it goes on the market\nAnd rex charges only two percent total not the six percent commission your local broker expects to get started call to one three nine eight eight six raps for unlimited time new salaries receive an additional\nFive hundred dollar home improvement gift card for signing up with rex sign up to date awkward expires ten thirty one to get started call to one three Ninety eight eight six raps that still won three Ninety eight eight six seven three nine C. A. L. D. or a license zero one nine seven six zero one zero five hundred dollars will be the single market and they require it doesn't need to\nStart the um eight Seventy ... everywhere on the air and so I Am a Santa Fe I made some of the march on the advantage of modern technology now on Amazon and Google have speakers just ask for a um a Seventy and you're listening to [noise]\n\n\nWell all my friends the ultimate issues our on Springer show was the third our on Tuesday and given all the talk about anti Semitism since the ... horrible horrible horrible\nMassacre of Jews it into the Pittsburgh synagogue by the way I just want to add it to my column today Tuesdays with today my column I hope you read\nAbout this whole thing about blaming Trump at about anti Semitism one of the things that I didn't mention 'cause you can't write everything and the space of a column is\nI Am I'm hurt as an American I Am hurt as a Jew and I am hurt on behalf of Pittsburgh Pittsburgh last week and I and I told you spoke Pittsburgh last week I might but I told you how much I adored the people of Pittsburgh I had such a sense of decency\nSort of like I I feel and a few places Tampa is one that I mentioned very often or just a friendly wonderful Americans and I I felt that in Pittsburgh so you know all the places to have its name associated with the massacre Jews so sad and so someone sitting\nHere it is what it is if it's what what happened but it should not be the board Pittsburgh she transcend\nThis event but it's still painful because it's the one country of the large Jewish population that never had a massacre myths and that's in Seventeen Seventy six\nAnd is a drag of humanity you did it\nUnder the word loser would mismanaged picture would appear perhaps is one of the top ten\nIs a he was he was ... he uh he he was a ghost he was both the ... ghost\nIf you read a biography of the guy\nNobody knew him\nAnyway every time when whenever there's a massacre at the Ninety nine percent of the time it's male maybe about ... percent of the time it's among married may or may be ... percent of time\nIt's a male who lives alone [noise]", "show_name": "Dennis Prager Show", "year": "2018", "city": "Glendale", "day": "30"}