{"month": "10", "state": "GA", "station": "WUWG", "content": "\n[noise]\nIs listener supported gp radio station surface of Georgia Public broadcasting news from NPR's next minute G. P. B. J. morning hours on GB [noise]\nMm when a life hangs in the balance what goes beyond a reasonable doubt really mean\nTroy Anthony Davis and on John ...\nG. P. B. presents to the radio boy beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis will\nJoin us at ten am on Sunday October twenty first on gp the radio\n[noise] from the University of west Georgia is Ninety point seven FM Wu WG pained Wu\nWG HD Gerald Ford of Georgia Public broadcasting radio network\nYou or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across south west Georgia a full list is available at ... Ga dot Gov\nDisaster recovery centers are open this weekend and Dorothy early Miller and seminal counties representatives from the state FEMA and the U.S small business administration will be at the centers to help residents through the disaster assistance process and answer any questions\nFor times in locations visit ... G. A. dot Gov the quickest way to apply for federal assistance is on line a disaster assistance dot Gov or by calling eight hundred six to one thirty three sixty two survivors and Baker Decatur Doherty early Miller seminal Chris ... Lee Mitchell\nTerrell Thomas and worth counties are eligible for disaster assistance through FEMA\nThose survivorship file claims with their insurance companies burst then visit disaster assistance dot Gov if you need help with debris cleanup contact crisis clean up that eight hundred four or five one Nineteen\nLive from NPR News in Washington I'm Jim ...\nHas the world reacts with skepticism to the Saudi explanation of the death of writer Jamal to show ... during an alleged fistfight inside the Saudi consulate in Istanbul President Trump is vowing to hear directly from Saudi Arabia's crown prince Mohammed bin Salman\nAl ... says there's\nA lot of fraud versus being made\nI'm going to hear directly from Saudi Arabia's crown prince Mohammed bin Salman\nIs making sure there's\nA lot of progress is being made that will have an answer by probably goes there's\nGermany's foreign minister is the latest to say that it's time to rethink the sale of arms to Saudi Arabia something that President Trump wants to avoid\nHundreds of thousands of protesters poured into London Saturday demanding a final say on the terms under which Britain leaves the European Union as NPR's Frank Langfitt reports from London many Britain's are deeply unhappy with Brexit negotiations which are at a stalemate and running out of time\nBut the marchers say the ... that was promised which included pledges of extra money for health care is turning into a disaster for the United kingdom the European Union's rejected prime minister Theresa May's plans for leaving the u._s. have many in her own party and the u._k. is now at risk of crashing out of the European Union with no deal for a future relationship [noise]\nSome protesters want to stay in the new mothers hope there will be a deal but want to see the details before signing off by Mr may however has rejected holding another public vote which direction to tear say would be anti democratic\nFrank Langfitt NPR News London\nAfghan officials say voting will extend into a second day in parliamentary elections after delays in some districts on Saturday Jennifer glass reports from Kabul on the chaotic start to the long awaited elections\nMany polling stations in Afghanistan like this cobble middle school and technical logistical problems that delayed voting or prevented altogether polling centers that couldn't operate today are set to open Sunday the latest complication in a parliamentary election that was supposed to take place three years ago\nIn Kabul there've been a number of the explosion had the Taliban and Islamic State's threatened voters to stay away but despite problems that included flawed voter list and long lines many Afghans appeared determined to cast their ballots thing they'll wait as long as it takes for NPR News I'm Jennifer glass in Kabul\nThe Milwaukee Brewers ran out of luck and the deciding game seven of the national league championship series Saturday Night\nThe Los Angeles Dodgers pulled away and the sixth inning beating Milwaukee five to one of the Dodgers seal the deal and the ninth inning sending their star pitcher quake in ... the pitch in relief and complete the final three outs\nBoston which earlier one the American league championship series will host the Dodgers in game one of the world series on Tuesday night at Fenway\nThe final three outs Boston which earlier one the American league championship series will host the Dodgers in game one of the world series on Tuesday night at Fenway Park game to stays in Boston Wednesday night and moved to LA for game three on friday this is NPR News\nThe Trump Administration is trying to speed and environmental review of western projects that deliver federally subsidized water to farmers NPR's Kirk Siegler reports a new memorandum from the president's aims to loosen environmental restrictions in western stays\nRepublicans going back to the George W. Bush administration have tried to increase water deliveries to farmers in California's massive Central Valley project or water from snow fed reservoirs gets pumped south to arid farmland but those deliveries are perennially cut back due to attempt to protect endangered fish and throughout\nThe president's order would speed up the current review of this as well as to other projects in Oregon and Washington\nIs environmental restrictions are loose and there will likely be a pro long legal battle and one of the biggest champions of this latest plan is deputy interior secretary David Bernhardt used to lobby for the Fresno based west ones water district one of the largest and most influential water agencies and the west Kirk Siegler NPR News\nTo tropical storms are swirling and the Pacific ocean off Mexico and one is forecast to become a hurricane and approach the country's west coast in the coming week tropical storm willow is the twenty first name storm of the Eastern Pacific hurricane season\nThe national Hurricane Center so that it was likely to remain well off the coast through Wednesday when it could approach Mexico's west central mainland as a hurricane tropical storm ... foreign friday off the coast of the southern state of key out as it could produce three to six inches of rain along Mexico's southern Pacific coast and parts of\nGuatemala [noise] I'm Jim ... NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online they'd Kaufman dot org\nI'm Dee Alexander you are listening to ... on Georgia Public broadcasting\n...\n\n\n[noise] [noise]\n[noise]\n[noise]\nAnd\n\nBe\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\nThe Oliver Lake big band from cloth that was Dan six eight and before that Mr Aaron Goldberg crime at the age of the world would point CNN\n[noise] here's this Damone from Spain so\n... or\nCrime Herbie Hancock possibilities are really nice cranky version of things to mow and you've heard it right here on jazz with the Alexander and\n\n\n\n\n\n\n\nPeel full or from diamond cut that was the coming with ... and Jack the Jeannette on drums and percussion along with Dave Holland base Adam Rogers guitar and Samuel hell on Oregon\nBefore that basis Amanda ... this is what happened a mental note Charles all\nMixed up music from a vocalist by the name of I made Allen her on her album is entitled wings on caged and let's take a listen to a democracy how harmony and descendants\nTo bring\n\n\nOh\nNo I didn't\nThat is no longer\n\n\nFrom the University of west Georgia Ninety point seven F. L. W. W. W. W. G. H. G. Carroll good order but Georgia Public broadcasting radio network\nYour loved ones were affected by hurricane Michael food and water are available at multiple distribution points across south west Georgia a full list is available at ... dot G. A. dot Gov\nDisaster recovery centers are open this weekend and Dorothy early Miller and Seminole counties representatives from the state FEMA and the U.S small business administration will be at the centers to help residents through the disaster assistance process and answer any questions\nFor times and locations visit ... G. A. dot Gov the quickest way to apply for federal assistance is on line a disaster assistance dot Gov or by calling eight hundred six to one\nThirty three sixty two survivors and Baker Decatur Doherty early Miller seminal Chris ... lead Michel ... Thomas and worth counties are eligible for disaster assistance through FEMA\nThose survivors should file claims with their insurance companies first then visit disaster assistance dot Gov if you need help with debris cleanup contact crisis clean up that eight hundred four or five one Nineteen fifty four\nLive from NPR News in Washington I'm Jim ...\nWorld leaders are skeptical of Saudi Arabia's explanation involving the death of writer ... the Saudis claim a diet after a fist fight Anthony Cordesman of the center for Strategic and International Studies so is this is an opportunity for the United states to make a stand for human rights\nLike Maine breaking relations ending economic card ignoring our security on trips\nUnited States to make a stand for human rights\nMain breaking relations ending economic card\nIgnoring our security trip but I think it does mean that goes for the media and laws on government in the United states and was ruining need to go on this incident and make it clear to everyone in the area\nThat this kind of operation is going to get government out of the shows in all into very deep international criminal\nCourt has mental those as turkey has actually arrested more people and made more disappeared and Saudi Arabia has in the past few years\nThe presidents of Honduras in Guatemala met Saturday trying to come up with an emergency plan for dealing with a thousands of migrants from their countries no on uh Guatemala Mexico border Maria Martin reports\nUnder President Clinton ... and what the mother and head of state Jimmy Morales\nMid at an air force base in what am I the city after conferring by phone with Mexico's president they announced what they called ... that don't ... the safe passage plan whereby the migrants would be transferred back to Honduras some by bus and others with health issues by plane\nBy them urgency shelters have been set up along the way according to some reports up to five thousand migrants entered what a mother from Honduras with hopes of reaching the U.S\nMany have already been returned to their country others are still trying to cross the porous border into Mexico any way they can for NPR News I'm ... and\nThe U.S Supreme Court has blocked the mass of climate change lawsuit brought by young environmentalist plaintiffs in the case who range in age from ten to Twenty one argue the government has failed to protect natural resources is a public trust for future generations\nDespite knowing for decades that fossil fuels we're causing climate change NPR Shannon Vance and reporters\nKeep Justice John Roberts signed the order marking a victory for the U.S government which has tried for years and are both the Obama and Trump administrations\nTo get the case dismissed the lawsuit was filed in twenty Fifteen and it's sponsored by an Oregon based nonprofit called our children's trust it seeks to phase out fossil fuels that caused climate change\nIn court filings the federal government has said the lawsuit is unconstitutional and that these issues should be left to the political branches of government to resolve not the courts\nThe high court's block his temporary and it will freeze the trial for ten days in federal court until lawyers for the activists provider response\nNot the courts the high court's block is temporary and it will freeze the trial for ten days in federal court until lawyers for the activists provider response Kennedy and sent NPR needed Washington\nThis is NPR News\nA drug that harnesses the immune system to fight cancer can help women live longer as they fight a particularly bad form of breast cancer NPR's Rob Stein says that's according to new research released on Saturday\nThere is a type of breast cancer called triple negative breast cancer that's notoriously deadly it's especially common among African American women\nResearchers tried combining a drug that on leashes the immune system with the standard chemotherapy drugs in a study involving four hundred and fifty on women which triple negative breast cancer they found that to drug combination significantly prolong the women's chances of survival\nThe results were presented a scientific meeting in Germany and published online by the New England Journal of medicine Rob Stein NPR News\nLos Angeles Dodgers reached the world series for the second straight year beating the Milwaukee Brewers five to one Saturday Saturday Night in game seven of the national league championship series\nIt's off to Fenway Park for a showdown against the Boston Red Sox in game one of the world series on Tuesday Los Angeles has won the world series since Nineteen eighty eight [noise]\nThe mega millions lottery may see a streak of twenty five jackpot rollovers end as it heads toward her record one point six billion dollar drawing on Tuesday based on sales projections Seventy five percent of the three hundred and two million possible combinations will be chosen for Tuesday's drawn\nUp from just over fifty nine percent in friday's dry\nThe mega millions jackpot has been growing since July when a group of California office workers won five hundred forty three million I'm Jim ...\nNPR News in Washington\nSupport for NPR comes from the ... foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children or information is available at ... dot org and lift him as like you who donate to this NPR station\nWelcome to G. P. B. jackass and the Alexander thanks so much for joining me\nUm [noise]\nNews [noise]\nSunday he'll come on\nMan and you\nHe'll be big and strong\nWhen he comes my way [noise]\nDo my best to try\n[noise]\n...\n... and\nIn a little one\nThough it seems so [noise]\nLive and learn they\nHave been a\nWill bizarre little hope\nMen too far\nFrom you know I'm never\nGoing to [noise]\nArabs so that's a ...\n\n\n\nNo brand new one\nAble to\nTo\nAnd\nBring all the\nWho may\nDue to\nThe ...\nThe people being her\nBe double\nTriple a bad\n...\nDa\n\nDay to\n[noise]\n\n\n\n\n\n\n[noise]\n\nWhole [noise]\n[noise]\n\n\n\n\n\nThe time with his tribute to Bobby ... than that one can mailing and he's the company by\nAdam Coker on\n... with his tribute to Bobby ... then that was Milly and he's the company by\nAdam Coker on tenor bill O'Connell piano Peter Washington based John Reilly on drums with Steve hops on vine and before that\nAll about that they see the Count Basie orchestra directed by Scott Barnhart with don't worry about me featuring curtailing\nHere's Dinah Washington and put Benton you've got what it takes baby [noise]\n\nYou just don't know\nGo to the to\n\n[noise] ... [noise] ... ... ... ... ... [noise]\n... who who ... who\n[noise] and [noise] genes and [noise]\nDo [noise]\n\n[noise]\n[noise]\nAnd\n\nOn gay or\n\n[noise] from the University of west Georgia business Ninety point seven FM Wu WG aimed at W. W. A. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\nYou know selling a car can be a hassle but ... is a whole different stories split I was taking off your hands or off your driveway and turn it into public radio and maybe even a tax deductions time to read all the host of marketplace in here is how to do\nEight seven seven GP be one car or donate securely on line at gp dot org slash cars ten thanks [noise]\nSaudi Arabia is struggling to strike a breakfast time running out and the creator a hit show transparent on allegations against the star I really wish I would have immediately\nJumped to supporting them and telling their stories rather than going into production about all that and the countdown to election day Sunday on weekend edition NPR News I'm doing this for weekend edition this morning from a cat here on the TV and on line ... news dot org\nLive from NPR News in Washington I'm Jim hawkish in Guatemala around Fifteen hundred mostly Honduran migrants are sleeping on a bridge that separates the country from Mexico and similarly green reports they were part of the caravan of Central American migrants trying to reach the United states\nAround four thousand migrants reach the Guatemalan city of Dakota aligned this past week with the goal of crossing over into Mexico but the Mexican government refused to let the vast majority passed now around Fifteen hundred migrants from that\nThis week with the goal of crossing over into Mexico\nBut the Mexican government refused to let the vast majority pass\nNow around Fifteen hundred migrants from the caravan remain camped out on the bridge hoping Mexico will change its position that conditions on the bridge are bad and there's no bathrooms and heaps of trash are everywhere the other kids are sleeping on the sidewalk alongside their parents\nMany of the migrants have no timeline for leaving and say they will keep trying to reach the U.S for NPR News I'm Emily Green and to Qunu on Guatemala\nVersion of leaders in the United states and leaders across the world are reacting with skepticism to Saudi Arabia has claimed concerning the circumstances of the death of journalists ... NPR's murder reports\nAccording to the Saudi Government could show she died in a brawl on the Saudi conflict in assemble but officials initially claimed that the journalists walked out of the consulate alive democratic representative Adam Schiff of California I told the New York times he's received a classified briefing about the circumstances and the Saudi version doesn't match up\nRepublican Senator Lindsey Graham tweeted last night quote to say that I'm skeptical of the new Saudi narrative about Mr ... G is an understatement unquote\nGerman Chancellor uncle and Merkel called the Saudi explanation quote inadequate in a statement world leaders have chimed in throughout the day with their own statements demanding further investigation Clarence embargo NPR News\nMore than a week after hurricane Michael hit the Florida Panhandle tens of thousands of people are still without power NPR's shouldn't have been sent reporters\nMost of the outages are in Bay county and northern Florida near the border of Alabama and Georgia residents say they are using candles flashlights after dark and generators to power air conditioners most of Florida's electricity sources are outside the area's most impacted by the storm and remain intact\nBut the hurricane destroy the transmission lines substations and utility poles connecting those sources to customers who have power says it has more than a thousand employees working on restoration and in the meantime authorities are warning residents to stay away from downed power lines Shannon then sent NPR News\n... people took to the streets and two dozen cities across Brazil on Saturday protesting the candidacy of far right presidential candidate ... shouting not him large crowds spilled avenues and squares a week before the ... votes but polls suggest also is likely to win on that\nShouting not him large crowds filled avenues and squares a week before the second round vote the polls suggest also now is likely to win this is NPR News\nThe tiny Balkan country of Macedonia is one step closer to entering NATO and the European Union after its parliament approved changing the country's name Joanna Kakissis reports from Athens that the prime minister of neighboring Greece so is the name change will end along dispute between the two Balkan countries\nGreece has blocked Macedonia is entry into NATO and the EU for nearly Thirty years because Greek nationalist since it's been a Macedonia is Greek\nThe foreign minister of Greece Macedonia settled on the name north Macedonia this summer two thirds of the Macedonia in parliament voted for the new name last night but it must be approved by the Greek parliament it will be a tough sell their\nPoliticians in Greece have long used the name issue is a way to whip up popular support to win votes those politicians include the defense minister and national it's too early this week forced out in the course of course he asked the foreign minister who negotiated the name change deal for NPR News I'm Joanna Kakissis in Athens\n[laughter] the Milwaukee Brewers ran out of luck and the the sighting game seven of the national league championship series Saturday Night\nLos Angeles Dodgers pulled away on the sixth inning beating Milwaukee five to one the Dodgers sealed the deal and the ninth inning sending their star pitcher quake Kirsch other pitch in relief and complete the final ...\nBoston which earlier one the American league championship series will host the Dodgers in game one of the world series on Tuesday night at Fenway Park game to stays in Boston Wednesday to mark NPR News in Washington support\nFor NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent thought whether that's on line over the air or in a bottle more at Sierra Nevada dot com\nWelcome to G. P. B. jazz I'm the Alexander thanks so much for joining me [noise]\n\nAre a bunch of\nHave you can hang with us feeling\nWhile there ain't no you argue that far downtown\nThey're crazy then the only way not to not have\nAnd joy and now\nIn the new\n\n\nThere ain't no winner bombshell getting loud\nAviation maintenance than they do a\nNight and day and the ... the only way to the night\n...\n...\n[laughter] water from the from\nOn\n[noise]\nKnow some people\n...\nThem\n\n\n... ... ...\n... ... ...\n\n...\n\n\n\n\nWho\nOwn a pet and\nA daddy down on\nShow they\nLive on much bringing\nThey view the\nShedding the\nThe daddy down all\n\nHe\n\nYou\n\n\nDaddy down\n\nOh what a wonderful memory so my mom playing her music on Harris Dario or high fives they called it back then\nThe wonderful voice of Esther Phillips from and I love him with his on them and before that the latest from Marcus Miller laid black and that was\nSome ... bunnies dream featuring the voice of Jonathan Butler up next the music of Mr Jared Gold on Hammond beef read from his latest reemerge and this is nomad [noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\nEasy to\nBeen married\nNo money\n\n\nShe\n\n[noise]\n[noise]\n\nA\nFish and\n\nJohn mulder from decades memoirs\nThat was introduction to about ...\nAnd you've heard this great music right here with me the Alexander on jackass\n\n[noise] from the University of west Georgia between Ninety point seven FM Wu WG aim to W. W. G. H. G. Carroll of Georgia Public broadcasting radio network [noise]\nHey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that keeps reminding\nYou to support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station all you have to do is call and you might even receive a tax deductions\nTo G. P. B. dot org slash cars or called eight seven seven GP deep one car can banks [noise]\nNext time on the New Yorker radio our interview with Sally ate was acting attorney general she said no to the so called Muslim travel ban\nAnd then what happened\nUm I was fine [laughter]\nYou were fired by Donald Trump before it was fashionable\nSally Yates talks with Jeffrey tube and next time on the New Yorker radio hour and you\nCan hear the New Yorker radio hour this morning at seven here on G bb radio\nLive from NPR News in Washington I'm Jim how President Trump said Saturday he will pull the United states from the Nineteen eighty seven intermediate range nuclear forces treaty because Russia has violated the agreement\nWe're not going to let them violate a nuclear agreement\nI go out and weapons\nSaid in the agreement we bonded agreement for Russia is not really hot and the agreement so we're going to terminate I mean we're going to pull out\nU.S officials are previously they allege that Russia violated the treaty by deliberately deploying a land based cruise missile in order to pose a threat to NATO and Russia has\nU.S officials are previously they allege that Russia violated the treaty by deliberately deploying a land based cruise missile in order to pose a threat to NATO and Russia has claimed the U.S missile defense systems violate the pact\nAfghanistan is holding us first parliamentary elections in eight years and years do you need reports there were dozens of attacks on election day across the country including a suicide bomber in Kabul\nBomber struck a school that was used as a polling station with kept open to accommodate voters hadn't been able to count that dial it's only because of the total stuff hadn't turned up in the morning sharing attacks\nBut as I did turn up in defiance of the Taliban and ISIS he struck campaign rallies in the lead up to these elections militants also tried to attend voting and scattered deadly attacks around the country\nAnd it was all the confusion about how to use the new biometric systems and some days didn't have ballot because of the chaos surrounding the elections fighting will now be extended to Sunday in some areas they had Dade NPR News Islamabad\nHundreds of thousands of people marched in London Saturday asking for A People's vote on brings up the nickname for Britain leaving the European Union as Laura Miller reports the demonstrators demands are unlikely to be met\n[noise] those demonstrating seek a second in a referendum book this is unlikely more than two years after a slim majority of British\nVoted to leave the ... you know dealership and struck and it appears that brags it's deadline may be extended\nOrganizers are calling for people's vote in which the public would have final approval of any deal one organizer says a fresh photos necessary because ... is a mess and there's no faith the government can deliver on its promises\nThey can tend to divorce from the ... will be far more costly and complex than anticipated\nHowever prime minister Theresa May and says there'll be no second vote and brings its supporters say it would trigger a major constitutional crisis for NPR News I'm Larry Miller in London\nTwo new tropical storms are swirling on the Pacific ocean of Mexico and one is forecast to become a hurricane and approach the country's west coast in the coming week\nTropical storm willow is the twenty first name storm of the Eastern Pacific hurricane season the national Hurricane Center said it was likely to remain off the coast through Wednesday men could approach Mexico's west central mainland as a hurricane this is NPR News\nIt'll be the Los Angeles Dodgers\nAnd then could approach Mexico's west central mainland as a hurricane this is NPR News\n[laughter] it'll be the Los Angeles Dodgers against the Boston Red Sox and baseball's World Series beginning Tuesday the Dodgers won the national league championship series Saturday Night with a five to one victory over the Milwaukee Brewers Chuck Quirmbach of member station Wu WMD in Milwaukee reports\nHomeruns by ... Cody Ballenger and among saving catch by outfielder Chris Taylor sparked the Dodgers winning game seven of the NFL Championship series and the second year in a row the Dodgers will play in the world series\nLast year they lost to the Houston Astros Dodgers manager Dave Roberts says he's looking forward to this year's contest against the American league champion red Sox\nIt's great for baseball a two story franchises going head to head so it's going to be aggressors\nRoberts was part of the two thousand four Boston team that ended the franchises eighty six year run without a World Series championship for NPR News I'm Chuck Quirmbach in Milwaukee a European\nJapanese space craft is on its way to mercury after being adopted into orbit late friday the ... Colombo mission is only the third time mercury has been attempted\nThe two probes will have to follow in elliptical passed to the innermost planet utilizing a flyby of earth to Venus and six of mercury itself arriving in December of twenty twenty five\nThe aim is to build on the insides gain by NASA's messenger probe which ended its mission and twenty Fifteen after a for your orbit of mercury all providing new evidence of ice and the shadows of some of the planets craters I'm Jim ...\nNPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include their doors do charitable foundation whos clinical scientists development awards support promising early career physician scientists and their research efforts to improve human health and Americans for the arts you are listening\nTo a gp jak on Georgia Public broadcasting anti Alexander\nOh [noise]\n\n\n\n\n\nHouston Person from calm rain or shine was haunting song that's one of my favorites everything\nHouston Person from come rain or shine was haunting song that's one of my favorites\nEverything must change Houston Person on tenor was warned by Shay on core net Lafayette Harrison piano Rodney Jones on guitar Matthew perished on base\nAnd Vincent act door on drums and before that drummer drone Jennings with his project caught the beast with the corps the Freddie Hubbard composition drone Jennings on John John Jones on trumpet\nHoward Wiley on tenor Dionne Tucker on trombone Christian fans on piano Christian McBride on base\nBecause the Alexander more music coming up from the coal Mitchell's ice crystals with Aquarius\nNo no no there's\n... one\n\nWho\nReally didn't do they may they may have didn't do anything we need didn't they didn't they didn't do do\nDo\nDo do they just have\n... ... email\nWe need to name any ... ne ne ne ne ne ne ne ne ne ne navy blue he didn't need any any any human need\n... ne ne ne ne ne ne ne ... the way\nThey come in\nWho do do do do di di di di di di di di do do do do\n\n[laughter] he sees\nDay as we know\nNow my\n\n\n", "show_name": "GPB Jazz", "year": "2018", "city": "Carrollton", "day": "21"}