{"month": "10", "state": "PA", "station": "WVYA", "content": "No\nThis is W. B. I. F. M. eighty nine point nine and W. B. R. A. F. M. H. D. one Scranton Wilkes Barre he's written WTY eight eighty nine point seven ... Williamsport W T I O eighty eight point three of him ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township in like one would pop pack\nWith translators in ... point three and pots bill at Ninety four point nine and on the Web at W. V. I. A. dot org\n[noise]\nFrom eight PM American public media this is performance today I'm Fred Child\nComposer Robert Schumann suffered from all kinds of internal demons he battled debilitating anxiety and fatigue and self doubt and while he was writing this music he even had physical symptoms\nEvery day he felt itching and ... all over his body and mentally he often had hallucinations and heard voice\nBut in the middle of all those difficulties and distractions Robert sure mine was capable of writing music of pure joy and sunshine coming up Robert ... symphony number two from a concert by the Los Angeles philharmonic [noise]\nLive from NPR News in Washington and Oregon President Trump is accusing reporters of trying to use the sinister actions of one individual to score political points I fifty six year old Florida Man is in custody charge with sending bombs\nTo use the sinister actions one individual to score political points uh fifty six year old Florida Man is in custody charge with sending bombs two prominent Democrats this week\nThe president was campaigning for Republican candidates in North Carolina hours after Caesar say ox arrest yesterday before he left Trump said that it's not his fault that one of his supporters as allegedly behind the threats he wants to focus on the upcoming mid term I think that they\nWere running a great campaign of\nWill be talking about was that had rightfully so it was a big thing rightfully so but now we have to start at the moment\nThe president also said he doesn't plan to contact former President Obama or anyone else targeted by the pipe bombs Obama campaigned for democratic candidates in Michigan and Wisconsin yesterday when Kleinfeld are of member station WBHM ... reports\nObama told a crowd of thousands of Detroit's Cass technical high school the Republicans are following a familiar play book he says a GOP wants to scare people into voting for them by stoking fears over the Honduran migrants caravan heading towards the U. S. and Obama says President Trump is continuing a pattern of making false promises\nThat he was going\nElection functioned before the alike [noise] just made for\nDemocrats hope Obama will energize voters especially in urban areas that failed to turn out during the past presidential election for NPR News I'm Quinn Klinefelter in Detroit\nSeveral thousand Central American migrants continue to walk nor through Mexico saying they intend to seek asylum in the U.S many of them have rejected Mexico's offer to apply for refugee status in Mexico's southern most states\nSince early October federal authorities had been releasing hundreds of asylum seekers and families who crossed the border illegally in Arizona\nFrom member station ... in Phoenix Matthew Casey reports\nCiting volume in a court settlement that limits how long children can be detained federal immigration authorities started releasing families to churches and activists in Arizona\nNow the releases are also happening in Texas and California pastor bell Jenkins founded a San Diego based coalition that can provide about one hundred shelter beds he says the group may need five times that number\nIf we could turn over the ... you know every three nights we probably could handle it we're we're going to happen if people are going to get stuck in the system so to speak\nJenkins says families stay at the shelter longer when sponsors back out his coalition is trying to find more beds for NPR News I'm Matthew Casey in Phoenix and this is NPR News from Washington\nNew Jersey health officials say it may take a week for a deadly virus outbreak to end at a pediatric rehabilitation center\nThe facility in Haskell New Jersey served medically fragile young people and reports there had been twenty three cases and I'd know virus eight people have died the outbreak isn't considered over until four weeks ago by with no newly infected patients\nThat disease frequently causes mild illness with cold like symptoms can be severe especially in young children with compromised immune systems this week stock markets roller coaster ride and it was another downward slope yesterday Steve Beck and reports\nOctober continues to live up to its reputation as a turbulent month for Wall Street despite mostly strong economic and corporate news investors flood into safer haven like treasury securities their anxiety was fueled by rising interest rates trade tensions and slowing world groups\nIt split into safer haven like treasury securities their anxiety was fueled by rising interest rates\nTrade tensions and slowing world growth there is also been plain old profit taking after a short run up to the down near twenty seven thousand a few weeks ago the selling built its own momentum with bank oil in tech chairs taking turns leading the plunge despite Thursday's rally the Dow fell three percent for the week\nThe S P is down almost four percent the NASDAQ lost three and three quarters percent\nFor NPR News I'm Steve back into\nThe Dodgers beat the red Sox three ... three in the world series was the longest gaming theories his dream more than seven hours Boston still leads that series two games to one game for its tonight in Los Angeles I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributed include the corporation for public broadcasting and the state of John crock who's ... serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. dot org\n\nA little foreshadowing in the instrument ... there from a PM American public media this is performance today I'm Fred Child taking you to concerts around the world\nWill go to Walt Disney hall in Los Angeles to hear the LA philharmonic plans symphony by Robert ... in a few minutes but right now it's music by Argentine composer asked\nEuropean so a lot he wrote the piece that we're about to hear for a friend of his who played the double bass it's a piece called the contract that he's you know\nOh Jeff Scott did the arrangement that we're about to hear for ... yeah money when\nThere are when quintet there's no string bass in when quintet so when this version it becomes a showcase for the the soon Monica Alice ... soon here alongside her colleagues and the money when they gave this concert in Jacksonville, Florida contract that he used to buy ...\nWell well well well\nOh\nA ...\n\nA ... or [noise]\n\nOr or a a a a you\nKnow [noise]\n\nSo what part of the things that are on the news [noise]\n[noise]\nOh a\nGirl or\n\n\nNo no no no no no no no no no no no no no no no no\nNo [noise]\n[noise]\nWe're a\n... for ... for the for the for the for the um [noise]\nYou're listening to a PM performance today\n\nWB I got them in in the are are like nothing else you've got about ... back to base journalism your programs the nursery remind\nForward to the next driveway moment that keeps you in your car when you just can't miss even one second of that great story independent journalism an intelligent entertainment that's why you listen there's nothing else like it listeners support makes it possible your contribution pays for programs you care about that keep you informed\nSo there's nothing else like it listeners support makes it possible your contribution pays for programs you care about that keep you informed and feed your curiosity\nMORNING EDITION all things considered the Ted radio hour your gift supports unforgettable classical music jazz and musical discovery on mic bagging homegrown music\nCommunity events like kids in the classroom and the great American ... nothing comes close to public radio so support W. B. I. with your important gift to our on 'em ... visit W. B. A. dot\nOrg or call one eight seven seven seven hundred Ninety four to\nWere about to hear from a concert at Walt Disney hall in Los Angeles music by Robert ... [noise]\nEighteen forty four was a rough year for show he was suffering from\nAll kinds of problems both physical and mental\nJust functioning and getting to a day was a challenge not to mention trying to compose\nSchumann had debilitating vertigo terrible dizziness\nHe had phantom pain you describe like knives hoping all over his body [noise] his wife Clara would wake up in the morning and I'm Robert\nSoaked in here and in a letter to Felix Mendelssohn Robert Schumann wrote\nI itch and twitch every day in a hundred different places [noise]\nSchumann was desperate so she tried changing some of his everyday\nHabits he began drinking mineral water he stopped smoking and she even change the way he can poke\nInstead of sitting back and waiting for inspiration she became methodical would sit down at the piano and forced himself to right at least some music every single day and in the middle of all that anxiety pain and difficulty\nHe wrote a symphony from the lights on the life and [noise]\nThe symphony number two by Robert ... on a chair Gustavo Dudamel conducting the Los Angeles philharmonic will pick it up at the beginning of the second movement and go from there to the end of the peace\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n...\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\nSure sure and sunshine in so much of that music by Robert your mind we heard the second third and fourth movement the final free movements from his symphony number two that concert was at Walt Disney hall in downtown Los Angeles conductor ... due to melt lead to Los Angeles philharmonic [noise]\nThe LA philharmonic at celebrating its one hundredth anniversary this year and to mark the occasion they've unveiled a new project it's a new building for the youth orchestra of Los Angeles you'll love for short\nThe big new building designed by Frank Gehry same architect to design that iconic stainless steel structure Walt Disney hall\n... the youth orchestra has aid ensembles for musicians from age five to ... age Eighteen ... told the LA Times close it's very important to me that the children in LA have this base where they can develop their own dreams\nConstruction for that new building for the youth orchestra of Los Angeles is set to begin this coming spray\n[noise] coming up and just a moment or former P. T. young artist delivers a jaw dropping perform [noise] you're listening to a piano performance today\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\nOr\n\nBroadcast of our show is supported by exact science is offering Colo guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home available by prescription only information at Colo guarded test dot com\nWe'll rent leaders in Allentown at Ninety nine point three and in Bethlehem at one of my point seven listener supported public radio W. V. I. S.\nAmong the fallout from package bombs tend to prominent Democrats or national discourse how is the rhetoric in politics and media shaping the way we talk to one another\nAnd it's been Twenty years the Harry Potter for the which readers looking at the literary legacy of the ... the news from Washington and around the world and Sunday on weekend edition NPR [noise]\nSunday Morning eight to ten on W. V. on a ...\n[noise]\nFrom eight PM American public media this is performance today I'm Fred Child [noise] recently we've been sharing stories about when music makes us feel better and here's one from peachy listener Rebecca Cochran her mother died\nRecently we've been sharing stories about when music makes us feel better and here's one from ... Rebecca Cochran her mother died before she was a year old one day Rebecca was rummaging around in an old cupboard and found her mother's classical music collection\nTo grab the first lp she found and threw it on the record player and what she heard stuck with her\nAnytime I hear that comes to this day I think that the mother that I never truly new but that sort of linked me to her\nThe pre CIO Espanol did help Rebecca feel better and more feel better music on the way during this hour of beauty [noise]\n\nLive from NPR News in Washington I'm neuron defense secretary James Mattis told a major international security meeting and bell rang the murder of Saudi journalist ... must be a priest than certain to arm he said the U.S cannot tolerate such a ruthless actions\nDue to the gravity of the situation I Will continue consulting with our president and secretary of state we will ... train our twin imperatives protecting America in our interests and holding accountable vote responsible for this murder\nThe Saudi foreign minister ... said that a historic hysterical media has assigned blame the Saudi Arabia before investigations are complete he added his country's relationship with the U.S is ironclad\nNews very much at stake we have huge trade and investment we have huge energy issues we have similar world view in terms of the need for about an incident would root in our world we have\nA huge sci fi income stream of some terrorists who than to those in just continue the old saying this has friends come and go what interests remain\nHe says Saudi Arabia knows a mistake has been made and those responsible will be held accountable federal authorities say DNA and a fingerprint led them to the fifty six year old Florida Man accused of sending explosive devices to prominent Democrats W ELL orange ... reports\nIn his latest string of tweets over the past several weeks he's or sap posted pictures of negative campaign ads against Florida democratic candidate for governor Andrew gallon many and the same screen shots over and over it's not even so much at the tweets are pro Republican as much as they are anti Galen\n... watched say Iraq Iraq from across the street and size they uncovered and anti liberal stickers\nHe actually had a look on his face from what I saw um of him more of like just a okay they got me\nThat is in federal custody facing five charges for NPR News I'm ... in plantation Florida\nFormer President Obama's stump for Democrats in the Midwest yesterday Quinn Klinefelter of member station WFDD report Republican\nCandidates are touting the strong US Economy as a selling point for the GOP ahead of the midterm elections but Obama told a rock is crowded Detroit's Cass technical high school that it was his administration which pulled the nation out of the great recession and set the foundation for the current financial growth [laughter]\n[noise] [noise] Democrats\nHope Obama's swing through Michigan and Wisconsin will boost turnout in urban areas the state's flipped from blue to red and the last presidential election for NPR News I'm Quinn Klinefelter in Detroit\nAnd this is NPR News in Afghanistan and voting is underway in parliamentary elections\nFilter in Detroit and this is NPR News\nIn Afghanistan and voting is underway in parliamentary elections in the southern district of Kandahar this is a week after most of the other provinces went to the polls that delay was prompted by Taliban attacks including the assassination of a powerful police chief\nThese other first parliamentary elections since twenty ten despite the violence millions of Afghans have cast ballots\nGas continues to be in very short supply in Zimbabwe end its price continues to rise each month find declare reports from Harare and how people are managing\nZimbabwe imports or it's a fuel\nGovernment overspending is let the shortage of foreign currency to buy the fuel CBO begins a spending hours in line and ... and the decision of fuel deliveries driver joined ... had been waiting in line for seven hours before you leave it to the gut station\nIt's probably good been other three hours before I get fuel so that's probably a total of ten hours drivers\nHave resorted to forming what's up groups to lead to each other when and with fewer of these available some has created ups to show which stations that gas for NPR News I'm ... ...\nAnd baseball's World Series max monthly you hit a home run in the Eighteenth inning to give the Dodgers are free to to win over the Boston Red Sox the game lasted more than seven hours the world series record ending after midnight the two teams meet again tonight in Los Angeles for a game for the red Sox leave the best of seven series two games to one\nI'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the state of Joe ... who's request serves as an enduring investment in the future of public radio and seek help NPR produce programming that means the highest standards of public service in journalism and cultural expression\n\n\nFrom eight PM American public media this is performance today I'm Fred Child taking you to concerts around the world\nViolinist Paul song plays a lot of concerts over the course of the year and that means he spends a lot of time practicing as well or polls long recently told me that when he practices he starts off playing just the open strings of the violin\nWell I had to ask what was he listening for with that kind of practice why play just the open strings\nFirst thing is to hear the vibrations of the woods in the south and second thing is not only just for my own benefits of warming up but also warming up the violin as well so you want it to warm up slowly nicely as well so I think open string is to most neutral and\nMost um easiest way and in the in the way I find that to be very cleansing and it's very healthy I think for the instrument as well\nI Love that we usually think about musicians warming up working out the kinks stretching out muscled physically and mentally getting primed to play we don't usually think about the instrument needing to warm up too but it needs to ease into playing as well [noise]\nWell let's hear Paul wrong and his violin after they've both warmed up he's joined by fellow violent at Danbury ... and pianist Orion wise in concert in New York City they're playing Navarro a Spanish dance by Pablo this SARS hot day\nFar a Spanish debt by Pablo this SARS talked to\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\nWell\n\n\n\n\n\n\nWell\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] Mm\n\n\n\nMm\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]", "show_name": "Performance Today", "year": "2018", "city": "Williamsport", "day": "27"}