{"month": "10", "state": "GA", "station": "WNGH", "content": "Ninety seven point seven FM WG P. B. and ... GBH room portable Georgia Public\n[noise]\nNinety seven point seven FM W. J. P. B. S. W. GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nSupport for G. P. B. programs comes from our listeners\nAnd connect savannah so then is alternative weekly source for news music movies theater arts restaurant and events\nAvailable in print at locations throughout savannah and on the Web at connect savannah dot com and the ... school in Jacksonville, Florida a place to live and study with students from all over the world and still go home on the weekends information about five and seven day boarding is available at bowls dot org bowls all things possible\nTime of the six o'clock that means marketplaces next that also means we have a one hour left in this fall fund drive come in on your white horse make a contribution at the last minute and the last hour G. P. B. dot org or eight hundred to two two forty seven eighty eight and thanks\nSupported micro knows HR payroll talent in timekeeping and one unified system learn more from is Tom tom pronouns workforce innovation that\nThe September on employment report came out very we will talk about that also an unexpected and long boil\nFrom American public media [noise]\nMarketplaces supported by the financial services firm of Raymond James offering personalized wealth management advice and capital markets expertise with a commitment to putting clients financial needs first Laurent Raymond James dot com\nTen by western hotels and resorts dedicated to empowering your wellbeing well on the road with signature wellness programs designed to help you stay in control while traveling\nQuestion much trying to learn more western dot com [noise] and by western digital everywhere data lives from personal devices to global organizations western digital feels the innovation for a smarter future learn more data makes possible not [noise]\nIn Los Angeles I'm Carl result is friday the fifth day of October to does Newt Gingrich is always to have your long\nYes lots of news today we get it but we are going to keep our eye on the economic bowl and the ball on this Friday was the September unemployment report it was a good hundred and thirty four thousand new jobs and nearly fifty year low on the unemployment rate down to\nAnd I'm a ball and the ball on this Friday was the September unemployment report it was a good no hundred thirty four thousand new jobs in nearly fifty year low on the unemployment rate down to three point seven percent [noise] so we will start there than merger further or boats farther afield I'd ever get 'em right driving rebel writes for the Washington both Neal Richardson is with Edward Jones ...\n... ... jobs ... you're on that means we're going to talk about wages uh uh I Want to point out that ah the Drudge Report was actually doing a little bit of a missile and a number of jobs but but people should be happy with the wages however are another thing entirely still an again\nYou know what it really didn't matter what the job's number was going to be marked his first let's see we have that right at wages wages where the focal point\nAnd what we saw is that there was some sustained growth in wages as a little bit lower than\nThan last month that but some growth at two point eight percent it was enough to spark some concern in the market that this would spill over to consumer and prices and and and prompt inflation and cause the fed to tightened more aggressively than previously anticipated so even that small pickup and growth was enough\nTo concern the markets about inflation and rising rates and we saw that play out in the stock market\nDoesn't let me let me pivot a little bit uh to uh well I guess a lot to trade and ah the president and where we stand is somehow amazing to me that it was only five days ago\nThat we reached agreement or on the named after a China is still out there uh we have a still a president or who's not enamored with a multilateral institutions\nYet we have a dynamic and strong and a growing economy in the United states where do we stand on on on how things might play out\nI think it's pretty striking that we've basically spent the last year and a half alienating our friends punishing farmers and manufacturers with tariffs and counter terrorists\nBreaking apart the hard won alliance that we had built um [laughter]\nTo try to isolate China and we ended up in more or less the same position that we were in before which is NAFTA is still more or less in place a plus elements of of the Trans Pacific partnership which Trump had broken up or had had pulled us out um last year\nSo you know uh I think the best thing you can say about this deal is that it could have been a lot worse and markets clearly a breathed a sigh of relief\nThat the existing structure I is kind of ... there are that that Trump did not break globalization\nThat the existing structure I is kind of build their ah that that Trump did not break globalization despite his rhetoric suggesting that he had hoped to do so\nThat that's a good long the debris globalization meal put on your your actual certified economists at which I should point out you are a ... and a poet bag for me to a you know thirty five thousand foot level and talk about what Catherine we're talking about this idea that\nWe're now distinctly trying to go it alone in this global economy uh with um a politics you're being um tenuous at best in terms of being able to get things done\nAnd where things play out now for the remaining two years of the president's term and perhaps for\nIt's a bumpy road ahead um what this negotiation process taught us is that even something that should have been a sure thing\nWhich is to continue on with NAFTA which is essentially what happened took a long way longer with much more drama than probably necessary and that's with the north American trade agreement right now let's look at something much more complicated that really speaks to the future of China\nAnd the development of the emerging world\nUm where we are in a negotiation in which we do have some solid um reasons for pushing forward but a China also has some solid reasons for pushing back\nAnd so as much as markets chaired\nThe continuation of NAFTA or some kind of knew named as rose that smells a sweet [laughter] um it's hard to translate a U.S flow when\nIn North America with a long process with the rest of the world where China is an emerging leader and has a growing power in terms of their economic strength and the supply chains in which they are they sit right in the middle of\nTo have some great launched a slow when that's a great line I'm okay look let me let me turn to the news the day because we have to acknowledge it Susan Collins declaring that she is in fact senator from Maine that she was in fact and vote to confirm Brett Kavanaugh\nUh Joe Manchin doing the same thing he will likely be on the Supreme Court ah come you know Monday or Tuesday I Want to talk for a second Catherine about a broken the politics are on Washington in Washington and what that will mean for anybody's economic agenda because there are things that have to get done right there are budget that I have to get down there are\nSocial programs and and a foreign bills and all of that stuff still has to be done [noise] thirty seconds to you and then to Mueller where does\nThat have to get done there are social programs and and a foreign bills and all of that stuff still has to be done ... thirty seconds to you and then to Mueller where does things were the things that\nI I think the status quo is very troubling it's not only the regular the regularly scheduled types of tasks that you mentioned like getting budgets through for example that Congress has to manage our and and the presidency is well the executive branch as well\nUh at some point there will be a crisis and the fact that we have so much political dysfunction suggests that we're in store for a lot of policy dysfunction and when I have talked with people who are around for the last crisis uh\nTen years ago that that's the number one thing that they said that they that keeps them up at night that basically what's gonna happen when we actually need everyone to work together and come to policy conclusions that may not be a popular ones\nNewer to you quickly please sure and I just want to add on to like cats and I think just said which was you know this is occurring the ... the political dysfunction if you want to call it that it's occurring at a time where we have really strong economic health\nUh a lot of wealth being created in the economy and investors are are benefiting we're seeing some wage growth\nUh what happens when the economy naturally turns as part of a natural business cycle that's when the government plays a role and what we need at that point as a government that functions together for the betterment of the economy and hopefully by then we'll get it\nNeal Richardson at the Jones dressing room filled the Washington Post thanks you too\nThank you have a nice weekend one more quick thing about the state of economic play right now especially in light of the jobs numbers this morning which\nAs you've heard but unemployment in this economy at a level not seen since Nineteen sixty nine year old Adan with what's been going in this week in the bond markets and I talked about that yesterday good economic numbers pushing yields that his interest rates higher\nAnd it gives me to this comment from Chris Lowe he's the chief economist at fifty on financial he's also a fraud or regular on the marketplace morning report which in most markets was preempted this morning for shall we say other news anyway Cruz pointed out to David Brancaccio this morning\nThat Cruz works on a bond trading floor and the people in the bond markets\nThey've got a long long memories\nReally nervous there until you're six you know there's remembered as the beginning of the big ... the the blood to Nineteen seventies inflation and particularly the older guys out there they don't like to sit all the moves and but you know what it would I like to remind them\nInflation and particularly the older guys out there they don't like the shoes at all and moves and but you know what what I like to remind them is the other thing that happened in the seventies who said oil\nIncrease in price from three dollars to forty you know it would be the equivalent of ah oil costing four hundred dollars a barrel in ten years that might be a little inflationary to\nDay the final minutes we have forty two minutes remaining in this fund drive looking to hear from you at ... or so many of you doing that in that green donate button at the top of the page or\nCall an eight hundred to two to four seven eight eight to ... time runs out we're looking for about two holes or clicked per minute to get us to the finish line by seven o'clock tonight we can do it with your help started with listeners we're hearing from all across Georgia and\nAround the country where her from Maryland so we heard from Utah we've heard from Florida and Tennessee in South Carolina Thank you so much to lose out of wall up Atlanta Jan elders the type the island and Nina Tucker of they still\nHave we heard from you have we heard from Yorktown happy represented your community have you support and you're listening most importantly\nThat's what we're asking you to do now in the final moments if you're one of those people that puts it off to the final minutes of the drug well we are here and we are waiting to hear from you CPB dot org or eight hundred to two to four seven eight\nEight time is running out on this fund drive about forty minutes to go every gift of support before seven o'clock really does make a difference so we are relying on you to make your contribution right now at G. P. B. dot org or eight hundred to two two forty seven eighty eight\nBest selling author and humorist David ... is coming to Georgia for one night only and we have special tickets available to you when you make a contribution at two hundred and fifty dollars on your credit card on the phone\nHe'll be at the Lucas theater in Savannah Wednesday April twenty four twenty Nineteen at seven thirty PM when you support CPB with a credit card contribution of two hundred and fifty dollars\nYou lose his theater in Savannah Wednesday April twenty four twenty Nineteen at seven thirty PM when you support CPB with a credit card contribution of two hundred and fifty dollars you will receive a pair of tickets to see David Sterritt live before these tickets go on sale those the public and you can join us ... show reception\nCall eight hundred to two two forty seven eighty eight now these tickets are not available on our website [noise]\nThat's right you can call eight hundred to two to four seven eight eight go to G. P. B. dot org get in on the drawing that we have\nAn incredible last day drawing for a smart TV and sound system it's a fifty inch than Samsung smart TV and the sound system is a has a three point one channel sub woofer system a digital amplifier was six speakers for immersive sound\nUh it's going to really make some space in your house really nice call eight hundred to two to four seven eight eight or go to G. P. B. dot org\n... all those the marketplace you know it seems like every time you turn around somebody asking you to pay a little extra for something and\nSometimes you're left feeling like it's not really worth it takes flying extra money if you want to see you want to eat it's going to cost you to marketplaces Rico going on of tapped into that feeling when he imagined what else airlines could charges for if they had the chance\nGood afternoon everybody this is your captain speaking we reached are cruising altitude just want to give you a quick rundown of him and that is available for purchase on this flights\nIn a few minutes we'll be cutting off the supply of oxygen in the economy Kevin additional oxygen can't be purchased for a nickel permitted just slip you're going into the slot in the armrest exec changes required if you need change our attendance well provided to you for an additional fee of one dollar per nickel\nAnd about an hour will be flying over the Grand Canyon and you can take a look by inserting a five dollar bill in the slot beside your window [laughter] the window shade will pop up for exactly twenty three seconds\nThirty dollars to use the restroom ten dollars the flush and when you get back to your seat our attendance will be happy to replant it for you for fifty seven dollars or for five dollars they'll punch in the head so hard you blackout said whoa\nThat's about it now just sit back relax and enjoy the next two hours at that point passengers who refuse to pay our two hundred dollar completion feet will be thrown off the plane thirty six thousand feet above Wichita while the rest of us continue on to New York thanks again for traveling with us when do you have a lot of choices went fine and they're all bad\nBlame thirty six thousand feet above Wichita while the rest of us continue on to New York thanks again for traveling with us when do you have a lot of choices when sly and they're all bad so shut up [noise]\n\n\nAll seriousness we know you have a lot of choices when it comes to where you get your news and we feel that nobody gives you more and does it better than public radio but to continue bringing you the news information and entertainment you've come to enjoy\nWe need your help you or the wind beneath our wings so please make a contribution to keep public radio flying on there's all you have to do in fact for flying with public radio\nAnd thank you for contributing to public radio at ... dot org or eight hundred to two two forty seven eighty eight this marketplace a listener supported CPB in the last\nThirty six minutes of this fund drive for the entire fall fund drive the final thirty six minutes right now we're counting on your support as we raised to the finish line so make sure we hear from you before time runs out\nIf we have not heard from you get please do not put it off any longer take just a couple of minutes right now check it out of your list at ... dot org\nOr eight hundred to two two forty seven eighty eight and of course if we've already heard for me thank you so much you can join us for the first time you can renew your support or you can even chip on in something extra\nTo make sure that this is a successful fund drive thank you so much for your support I'm Ricky ... here with pat markets and Bert Wesley Hoffman\nAnd on the very last day of our fall fund drive we're relying on you to do your part and encourage your friends neighbors and colleagues to join you in supporting G. P. B. were counting on you to support you're listening right now let G. P. B. continue to be your window to the world on this the very last day of this fall fund drive\nA thanks to Milo from Atlanta joined them he says I only recently started listening to your station after I accidentally tuned in my radio and ever since I haven't changed the station I Love the interesting and funny segments you guys do and I'm always more than happy to pay for something that has true value that is a beautiful statement\nBecause if you find value in everything that you get from G. P. B. Y. not pay for it why not put in that five ten Fifteen dollars a month whatever works within your budget were just asking for participation and the more of you who call or click\nThen the better off we're going to be and the more we can bring\nTen dollars a month whatever works within your budget were just asking for participation and the more of you who call or click then the better off we're going to be and the more we can bring you news and information that enriches your life in hand says your day and helps you learn something a little bit new maybe look at the world a little differently\nCall eight hundred to two to four seven eight or go to ... dot org\nRight now are looking right now for about Seventy calls are clicks\nTwo calls or click submit at eight hundred to two to four seven eight eight or ... or\nTo get us to the finish line of this membership campaign now Rickey mentioned earlier about the successful conclusion of the drive the drive ins at thirty four men at what does it mean to have a successful Dr Chou you listening right now wherever you are in your car and your living room and your kitchen cooking dinner running errands\nWhat is it simply means is that we have the critical funds on hand to convene were bringing new marketplace to continue bringing you all things considered\nEverything you come to a gp before\nThey used to be with us for weekend edition and wait wait don't tell me in the morning if you make that call or click right now you can feel so good tomorrow morning or on Monday when you listen to the beat and you'll know\nThat you're part of the family and when you come in with your support right now something great will happen besides and uh going ahead and making that contribution you will automatically enter are drawing our last stage trying for a smart TV and sound system this is a spectacular give away\nWorth more than one thousand dollars you could be the lucky winner but you can't win if you don't call her click and he can't support CPB and your own listening for yourself and for your community and for your family if you do color clicks so the number again is eight hundred\nTo two to four seven eight eight or give on line at gp beat out for\nThe strong as an incredible drawing it has it not only fifty inch Samsung smart TV but it also has a sound system with it or that it's going to be able to you can set it up in your home this whole system is valued at more than a thousand dollars that could be yours you could be that lucky listener\nWho wins that simply by calling it a hundred to two to four seven eight going online to G. P. B. dot org\nPlacing that value on something that you love you care about that you want to hear day after day or maybe that you just rely on don't you rely on gp be don't you want to hear from GB to find out anything from what's happening in the world to what's happening down the street from you too\nAnd you're just rely on don't you rely on GB don't you want to hear from ... to find out anything from what's happening in the world to what's happening down the street from you to your weather for the day or maybe what the latest news entity on Georgia elections as we move through a very crucial year\nAh what an incredible resource GB as to your community you believe in that supported put your money where your heart is called eight hundred to two to four seven eight eight or go to ... dot org\nAnd a popular giving level is Fifteen dollars a month as a gp ... painter at this level we we'd be delighted to send you as our thanks to the window of the window to the world combo this includes two all new thank you gifts these ceramic twenty ounce light blue GB mega mug\nAnd the matching CPB long sleeved T shirt in your choice of size beautiful color blue you can take a look online at ... dot org that's also where you could make your contribution for Fifteen dollars a month as a gp sustain or this is the window to the world\nCombo with a long sleeved T shirt and the twenty out light blue mega mug also available with the contribution a one time donation of one hundred eighty dollars", "year": "2018", "show_name": "Marketplace", "city": "Chatsworth", "day": "05"}