{"month": "10", "state": "GA", "station": "WNGH", "content": "\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting\n[noise]\nI'd be seven forty seven FM W. J. P. B. S. W. A. G. P. H. D. room for the Georgia Public broadcasting radio network [noise]\nHang\nThanks for spending part of your Halloween evening with CPB savannah public radio for the coast marketplace well began and just a moment followed by more all things considered and then this American Life at seven\nSupport for ... comes from generous listeners like you and Georgia State university G. P. B. Atlanta is license to Georgia State university ranked among the top universities in the nation and commitment to undergraduate teaching more information is available at G. S. U. dot edu\nDoes your busy life keep you from staying informed TPP has you covered you can listen live a gp be news dot org and on your smart home device follow us on Facebook and Twitter at gp being news\n[noise]\nSupported by Amazon Web services over a million customers use ... W s as cloud tools functionality and experience to dream big and build fast\nLearn more at age ... is how dot com\nPhrase of the day to day is pricey elasticity of demand and consumer goods in real estate also in a sense\nFrom American public media [noise]\nThis is marketplace [noise]\nSupported by personal Capitol you can download the personal capital apt to help you plan for retirement and see all your financial a towns in one place\nBy ... o'clock based phone service working to help businesses run efficiently Lula the smartphone for your business more at O. M. A. dot com\nAnd by figure providing a streamlined digital platform for home equity loans you can learn how to use the equity in your home for home improvement major purchases or debt consolidation at figure dot com [noise]\nTo Los Angeles on trial resulted Wednesday today the thirty first day of October is always to have your long everybody\nLook I'll get it we do a lot of trade on this program I get it I really do maybe too much depending on who you ask but you know what well first of all trades matters I think for a second about how much we buy and sell from end to overseas in this economy but also trade is news\nBut you know what well first of all trades matters think for a second about how much we buy and sell from into overseas in this economy but also trade is news yes terms in the trade war but it's news even without the United states exhibit a today\nThe Trans Pacific partnership say what you say well the Trans Pacific partnership or TPP the big trade deal with a lemon other countries the President Trump pulled this country out of just about as soon as he got into office\nThing is the TPP lives on as of this morning six of those eleven countries have ratified the thing and it's going to take effect just before New Year's without the United states not as marketplaces Tracey Samuelson reports how you feel about that depends on how you feel about the deal\nThe U.S is missing out on a hundred and thirty three billion dollars a year by not being in the TPP\nSays Peter petri at Brandeis University\nOr a combination all going to gain that it could be an outlaw who's got the result of trade being diverted from the United states\nA hundred and thirty three billion dollars is a Pete pebble in ... when you consider how Jang norm as the U.S economy is but ... says that number could be significant if and when other big countries trying to pack\nThe TPP cuts terrorists yes but also unified regulations among its members which can give us competitors and TBB countries have the advantage to see is an ... and she's a professor at George Washington university\nBusiness people and workers and consumers only shared rules whether they're on privacy or they're on safety belts or drunk regulation\nBut none of these are good enough reason with state and the deal says why wall like head of Public Citizen global trade watch\nI think a lot of people here and a lot of members of Congress feel like we avoid damage a cheap easy here but at the same time given why do you agree man very badly that people in those other countries are going to suffer the consequences\nWell exist the deal gave too much power to corporations labor the environment too little she's watching this deal move forward and is glad the assistant on board I'm Tracey Samuelson for marketplace\nGoing to do a story on prices now and how they are going up because for most of the past ten years in this economy consumer goods companies didn't really have what's known as pricing power consumers just weren't having now though with rising interest rates interest a hint of inflation\nWas here we go Proctor and gamble is raising prices on Pampers by around four percent on bounty Sherman ... by about five percent Unilever and that's all you're doing the same not quite as big a percentage increases\nIt was on Pampers by around four percent on bounty Sherman in puffs by about five percent Unilever Nestle are doing the same not quite as bigger percentage increases some marketplaces Mariel severe as consumers whether they've been noticing the rising prices and how much of a price hike might be too much\nOlivia's prowl recently got an early lesson in budgeting she's two years old her parents by her diapers on line and this summer her mom Kelsey notice that the monthly cost jumped from Seventy to eighty five bucks I just thought these things are way too [laughter]\nSo Kelsey who's thirty three and lives in Iowa City sat Olivia down and broke the news it's time to start potty training\nWe're going to get rid of the diapers and you're going to feel better and worried and I feel better everybody will be proud of you [laughter]\nEverybody has a limit to what they're willing to pay for a particular product we heard from a lot of you today you won't pay more than four bucks for a twelve pack of soda or five for a bar chocolate\nBut some consumers can't walk away from higher prices Kelly ... is fifty six he lives in Columbus ohio and he has sensitive teeth and he is the price of toothpaste for his condition has crept up and lifted dollar in the past few months\nIf I didn't need it I Would I Would buy the cheapest possible tube of toothpaste anywhere\nWe realize these are all anecdotes in other words things that you noticed Gustavo Shay is chief economist at PNC\nIt could be that you notice the prices of items to go up but you don't notice the prices of items to either stay steady you're down\nProctor and gamble is still rolling out its price hikes Nestle is considering another round and it can take months for those to show up in federal inflation numbers ... Guerra for marketplace\nThere was a pretty good set of things in my Twitter mentions about things people would or would not give up check it out I'm at Cairo's ... on Twitter ... by the way we're the order of the day on Wall street will have the details when we do the numbers [noise]\nThere are going to the Census Bureau by the Pew Research center more than twenty nine million Latinos eligible to vote this coming Tuesday that's almost Thirteen percent of the entire electorate political spending and campaign decision making or some peculiar mix of demographics and instinct and black magic yes so there hasn't been a whole lot of investment in ads targeting\nPolitical spending and campaign decision making or some peculiar mix of demographics and instinct and black magic yes so there hasn't been a whole lot of investment in ads targeting Latino voters but as much as in you'll reports from K. U. T. Austin what voters do here in Spanish language ads can be quite different from what they hear in English\nIn Texas you can see ads for Republican U.S Senate candidate Ted Cruz in English I'm Ted Cruz and I approve this message is he is booming and in Spanish like this ad featuring the standards dad who came to us from Cuba in the late Nineteen fifty\nRomance other you've got to go on and I see a lot of them would I\nOnce a case that has seen both ads that thirty three year old off than I Do is a computer scientist and bilingual he says the Spanish head seems to take a different tack with the elder Cruz talking about the opportunities America gave him as a refugee and the American dream\nYeah you can definitely see the complete difference right so there is no talk about here's this policy here is is a position is being taken eighties completely emotional\nTalking at the heart strings has been the playbook for most political ads in Spanish says ... she teaches political science at the University of California San Diego\nA lot of the Spanish language ads are really focused on culture on these emotional messages talking about the American dream and my teen are caring about family values shared values\nShe worries that Spanish only voters will be left in the dark if these ads only play on emotion and talk less about economic growth taxes or health care\nIf you designed Spanish language ads that are meant much more policy content an English language ad then Spanish speaking voters are not getting the same kind of information that monolingual English language for\nAlmost a third of all eligible voters in Texas and California are Hispanic and their numbers are growing in many states across the country many of those households big predominantly Spanish the Democratic party did spend some cash this week to galvanize the Spanish speaking vote but overall is spending on Spanish language ads going through the roof\nAnswer that question is not really\nThat's Armando ... he runs in LA marketing for use to help craft TV ads in Spanish for Republican candidates he says we won't have a clear picture of exactly how much has been spent on Spanish ads until after the midterms we do know that spending during the twenty sixteen presidential campaign was less than three million dollars down from twenty million ten years before\nAs a loser thinks eventually there's going to be a tipping point\nWhere a large part of the electorate every single year but we're still political party\nTwenty million ten years before other lives I think ... there's going to be a tipping point\nWhere a large part of the electorate every single year but we're still political party still under invested that outrage\nIn Texas Beto O'Rourke Ted Cruz's democratic challenger also has ads in English and Spanish he's fluent in Spanish so recording one more and just requires another take not really a heavy investment\nIt's a thirty year mortgage I paid off I'm ordered it was a thirty year I have three more years actually stay off duty you smoke which is why Thirty years a bit of a industrial band no but I have no idea\nThe thirty year term did not come down on a tablet engraved you know that says Thirty years is the right number\nWell so much for the biblical explanation that voice of reason was Edward pinto with the American Enterprise Institute he says the thirty year mortgage actually came about because of a housing crisis yet not that housing crisis one in the last century\n\nBack in the Nineteen twenties typical mortgage was for three to five years with a variable interest rates and payments only covered the interest\nWhich means that at the end of the time you owed all the money and so the big balloon payment came do at the end\nHistorian Lewis Hyman at Cornell University says at that point most people just borrowed the money again for another three to five years that work time and says as long as banks had money to lend\nBut when the great depression hits people began to pull their money and there was a financing crisis in Nineteen thirty two for mortgages\nHundreds of thousands of people suddenly face foreclosure entered the country's new president Franklin Delano Roosevelt\nWe leave for a moment in danger of losing\nIn Nineteen thirty three he launched the new deal and set off a wholesale rethinking of the way we buy homes Congress created the home owners' loan corporation to by failing mortgages and convert them into longer term loans with payments that included interest in principle then came the federal housing\nHerb ration to by failing mortgages and convert them into longer term loans with payments that included interest in principle then came the federal Housing Administration which insured mortgages against default and set new standards for those loans hello Fifteen year mortgage\nAndroid get teachers real estate finance at the University of Wisconsin Madison\nAnd then basically the F ha kind of keeps pushing it to Twenty years and then twenty five and then thirty\nFor buyers predictable payments over a long period of time made homeownership more affordable but for banks a thirty year mortgage with a fixed interest rate didn't make a lot of sense\nThe interest they had to pay to depositors and to borrow money wasn't fixed so in the Nineteen seventies Congress took care of that problem it authorized Fannie Mae and Freddie Mac to buy mortgages from lenders taking the risk off their books\nSo again we have some government intervention that okay I have no problem making a thirty year alone because I Know Fannie and Freddie you're gonna buy it\nAnd that in a nutshell is how the thirty year mortgage became king but maybe it shouldn't be don't forget\nThe thirty year term did not come down on a tablet engraved here that says Thirty years is the right number\n... Edward pinto says for starters the thirty year mortgage pushes up home prices by making it easier for buyers to manage a bigger loan they end up paying a lot more interest over the life of the loan and\nThe amount of principle relatives interest is very small and it takes a very long time to build up equity\nOkay but at this point the thirty year is so ingrained in the home buying system that last month according to the mortgage Bankers Association eighty eight percent of applications were for yeah that one I'm Amy Scott for marketplace [noise]\nAre going to be eleven state wide propositions on the California ballot next Tuesday hound number tend that turns out is going to be closely watched by landlords and tenants all I could but rent control it would expand the power to the local governments mostly cities\nHave to make more apartments and rental houses subject to limits on rent increases it's a hot button issue here to stay where housing prices are really really I\nThought it would prompt and those kind of reflect the shortage of affordable housing across the country from K. PCC in Los Angeles meant to no go as more recent\nI but the fight over ... does kind of reflect the shortage of affordable housing across the country from Cape PCC in Los Angeles meant to no go has more\nOn a recent day in LA's expedition park neighborhood Steve Baldwin within forty is helping his friend Jay Jay move out of the room just rented for the past seven years in a group home [noise]\nI wouldn't get do stuff just little stuff like you just don't want this to store she paid seven hundred dollars a month before they have to leave because his landlord is rehabbing to building to rent to students who go to the nearby University of Southern California [noise]\nProbably for more money the landlord wouldn't say that everything can give to look at France to manage okay you got to go [noise]\nBut he and roughly ... other can of looting his two sons were effected from six other buildings on the same block\nAlso being rehabbed for student rental so it's hard it was our he's currently sleeping in his car and his sons are staying with family while he tried to track down a new place to live\nA tall order in LA intimacy expensive rental market push referred for all from LA for\nAn unnamed parks or this or justify some\nBaldwin and it fell attendance couldn't appeal their addiction because their buildings aren't covered under LA's rent stabilization ordinance\nCats renting trees just to three percent a year and also limit is ...\nWhat those rules only applied to unit built the Fort Nineteen Seventy eight\nBalls with the other building\nState law called ... how can prevent LA from expanding its rent control\nIt also limits other cities from applying rent control rule condos single family homes and apartments bill since Nineteen Ninety five\nProposition ten would repeal Costa Hawkins and let cities regulate the rental markets as they choose\nBaldwin on board we got to vote who is a ... it's one of the hottest issues in California this election cycle a state where housing costs of spiraled up as has homelessness more than\nNinety million dollars has been spent to sway voters nearly three quarters of that by landlords Kennedy's rights groups say proper ten would tamped down rising rents and slow displacement for low income people but opponents like San Diego property management consultant Robert McGuire say it could make California's housing prices even worse\nThe big thing is we've got to build our way out of this\nState officials say housing costs are so high because California is short about two million hope McGuire says rent regulations would dissuade developers from building new units if their return on investment could be limited rent control rules are rare in the u._s.\nMcGuire says rent regulations would dissuade developers from building new units if their return on investment could be limited rent control rules are rare in the U.S just Fifteen California cities have them along with some jurisdictions in New Jersey Maryland New York and then also the seat\nIn Massachusetts they ended their rent control\nThat's finance the Carter USC researcher who co authored a recent report into the effects of rent regulations\nEconomic theory suggests that there would be units taken off the market folks would stop building that it would create a market distortion but the research on the actual impacts rent stabilization don't show that\nCarter's research found that rent control tend not to affects new construction the local rules she studied exempted new buildings from rent limits Carter did find that rent regulations helps people stay in their homes\nWhen we look at housing stability um it's quite clear that rent stabilization does create more stability\nBut that's been eclipsed in much discussion surrounding proposition ten prompting quarter to ask\nWho has the power to change our policy framework that tends to be landlords in the U.S\nA recent poll by us the and the Los Angeles times found the vote on proposition ten is likely to be very close in Los Angeles I met you know go for marketplace [noise]\nWas one of the note on the way out today which goes out to ... should not komodo whoever and wherever you are ten years ago today she or he because nobody really knows who the creator of bitcoin actually is released a white paper entitled\nBitcoin a peer to peer electronic cash system Amy or nine pages long including references it launched the crypto currency craze I suppose you could say the BTC USD exchange rate today that's been going to the dollar\nIt's about sixty three hundred and forty dollars to one bitcoin that's down from a highly last year as you might remember almost twenty thousand dollars per [noise]\nSupported by intercom on business messaging platform who's chat bond automate manuals sales and marketing tasks like qualifying leads and scheduling demos\nLearn more intercom dot com and by foreign X. dot com for X. dot com is committed to empowering and helping traders these opportunities and the foreign exchange markets learn boring for X. dot com or X. dot com it's your World Trade it for X\nIt was committed to empowering and helping traders these opportunities in the foreign exchange markets learn boring for X. dot com for X. dot com it's your world training foreign trading involve significant risk of law ... exact science is\nOffering color guard for average risk adults over fifty aren't as a non invasive colon cancer screening tests that can be used at home available my prescription only information at ... dot com\nOr we got to go down to Israel's up two hundred and forty one day no insurance present as deck of one forty four to present as five hundred and twenty nine points higher one percent October though lousy ... drew just edge of Peters Dan ... engineers broadcast worse\n... result we'll shoot 'em are but [noise]\nThis is a PIN\nAnd this is G. P. V. live from the G ... Cindy hill said Georgia business news", "show_name": "Marketplace", "year": "2018", "city": "Chatsworth", "day": "31"}