{"month": "10", "state": "GA", "station": "WSBB", "content": "If he wants to talk now you got to see the ...\nThe omega three fatty I think the digestive enzymes that are cooked out of regular dog food\nDiner fight is Tricia dying to fight for life\nDon't let your dog itch scratch stink or shed like crazy come to China for help\nEight five nine four to eight thousand eight five nine four one K. I. N. O. V. I. T. I.\nB. M. doorbell er Cox media group station [noise]\nTwenty four hour news weather and\nVolleyball and am\n\nKnow hug and Jennifer ... live in the deli let's be twenty four hour news center would tell us be tapped dory that's our\nHurricane Michael now with strong category three hurricane headed straight for the Florida Panhandle\nWins now a hundred twenty miles an hour ABC News chief meteorologist ginger Z in Appalachia cola Florida where the storm click make landfall since those wins maybe even stronger by the time it\nDoes it wait it will have major impacts even for places like Raleigh with flash flood watches him placed Biloxi to Tampa but the heart of the impact will the wind and storm surge that's part of Florida in the panhandle has only seen one hundred and twenty five mile power landfall twice in recorded history that's make the third\nThe state's governor Rick Scott agreeing that the worst threat from Michael could be the storm surge forecasters announcing that could be up to Thirteen feet but he says it isn't the only threat is slow moving\nTen feet but he says it isn't the only threat is slow moving storm is a fast moving storm the rains come quick we're gonna have flooding watches and warnings now stretch all the way from Florida to North Carolina [noise] Dario holding or ABC News\nSeventy two degrees in Atlanta cloudy tonight with a chance of showers low Seventy a thirty percent chance of showers tomorrow increasing dramatically by the evening\nI high Seventy Seventy eighty Atlanta's most accurate and dependable forecast is coming up president Donald Trump says he narrowed down a short list of five people to replace UN ambassador Nikki Haley at the un meantime Donald\nTrump [noise] Georgia where al candidate Brian ... grants for about a hundred protesters raised their fists\nAnd walked out of the of that that was met by others in the crowd reacting with chants of usa\nFirst first this is double you asked me twenty four hour continuing longtime\nUGA announcer Laurence Smith is in the hospital after an accident at at Georgia football practice\nVince was hit by two football players or feeling apart during practice on Monday the eighty year old suffered a broken hip and elbow he underwent surgery Tuesday to repair that hip and\nIs expected to be released from the hospital and the next day or so but there's been on the Georgia broadcast crew since Nineteen Seventy four UGA goes to LSU Saturday at three thirty year old all the dogs Jay Black I Will do was make\nW F ... too\nSo they're actually dozens of on caged rabbits just running around the house yeah just like they were ... in the woods I bet they frogs in every room in the house [laughter] those\nBuddies did their business all over the carpet stains everywhere\nErich von ... here with Patrick from zero rez and zero Raz was able to get the coverage clean\nSparkling that's the power powered water air\nAmazes me is just how insane we clean my carpets are after zero Reza has been out to our house no self means no residue\nRight so was there as you get soft carpet at stake cleaner longer fluffy\nKind of like a rabbit still sure I just can't get it out of my mind rabbit pellets everywhere not after we got through with a place called today and get free rooms for a hundred and twenty nine dollars plus a hallway free when you mentioned me Erich von hustler insanely clean carpets zero ... dot com\nSpell it backwards or forwards zero Raz It's the right way to clean don't forget we clean air ducts to\nHey Monica gods and fears inherent can deal you can deal with coal mornings coal cars but a cold shower no way that is why October the best month to replace or upgrade that mold corroded water heater with Kathy Steele\nYour water heater get to work out every day this you know all that water leaves behind sediment lines scale and other build up that Roger\nHome hot water and ... energy bill\nLed Kathy Steele expert team and solve a new efficient water heater today\nCalled before for him and if you don't have hot water today you don't pay cash sales highly trained plumbing team is ready to take on that run things how David water heater and deliver an upgrade that will keep you comfortable all winter long ws be less years looking out over and\nCash deal will raise your forty gallon water heater to fifty gallon but\nYou have to ... now locking the element of gets at you when you call seven seven zero cast feels visit Catskill\nAir dot com [noise]\n\nThey say you become more you hang out with hanging out with that image has gotten me Steve chipper each week Sunday the six PM right here in W. S. B. and get your market knowledge [noise]\nThe wind blowing and they let the twenty four hour traffic center\nThat over to the northern suburbs we'd go construction zones causing delays including I eighty five north bound at Hamilton middle road I did one twenty northern county heading toward Barrow catty you have a love playing block to they're also\nWatch for laying restrictions going up into Forsyth County Georgia four hundred north to pass the bald rich marina ... Fifteen heading up toward browse ... restrictions overnight for work\nAnd northwest expressway Seventy five north and south do work in Barker county around red top model road currently north down has to write Lance block heading up toward highway twenty exit two Ninety Steve Winslow ws be\nPolish within Muslim sacrifice forecast tonight cloudy with a shower and a few spots lows around Seventy tomorrow thirty percent chance for morning shower\nThen showers and thunder showers sixty percent likely afternoon Ninety percent of the night highs Seventy seven eighty low Seventy one Thursday morning showers eighty percent likely and breezy rain diminishing or thirty percent chance by evening Hi Seventy nine lows fifty to fifty five\nFriday mostly sunny ... Seventy three lows forty eight fifty three\nSeventy two degrees on peach tree street at news Ninety five and I am seven fifty devil us be depend on it\n[noise]\n[noise]\n\nOh my pleasure to welcome you to the Clark Howard show where it's all about you and that ... to yours\nI Want you to learn ideas to me so you can keep more of what you may [noise]\nComing up in a few minutes in today's car courageous moment time shares or Clark rage all by themselves [noise]\n'cause you can buy them which can't oversell why if somebody tells you you can get rid of it anyway\n... rage comes in and also yeah [noise] later yet I Want to talk to you about\nSome moves that are going on with banks to try to protect you and the banks in the event a foreign power tries to destroy the computer records of a bank you do business with there are some things you need to do\nAnd I'll tell you your assignments once you hear about what the problem is\nTalk right now about the guy I met with his young son recently and the guy's name is John\nAnd John said I hate to disturb you but I Need to tell you a story and if it would be something of interest to your listeners I Want you to share my story with them\nAnd he said the story starts in two thousand seven\nAnd one day at work I got a call from my mortgage company saying was I going to make my mortgage payment 'cause I was a month late with the mortgage\nAnd I was like what are you talking about I never like with any payment\nAnd so he calls his wife and says hey honey do you know what could be going on the mortgage company says andme unpaid\nAnd she started crying and said well I Need to tell you we're broke and so he left work and went home and his wife laid it out to him he traveled a lot worked a lot\nAnd his wife was responsible for saying you're trying to make sure all the bills got paid and all the rest and things got tight for them\nAnd she was taking out those credit card offers they were zero percent balance transfer\nAnd so every time there wasn't enough money to pay something she would take out another credit card and then when that one started charging into her she transfer it to zero percent offer and was really doing magical work\nKeeping everything afloat until it all came crashing down in two thousand seven and there's not a story about\nA couple where things fell apart because somebody lost their job or anything like that he said he was fortunate through the great recession to keep\nHis employment and to keep a good paycheck but when they sat down and really figured out what they were facing they had a hundred and Seventy thousand dollars in credit card debt\nAnd with you on a trend line of such an inexpensive mortgage there's no priority for you to rush on that three point six\nBut the ...\nSo continued success to you and again thank\nYou for your service which branch are you with\nUS Army reserves\nAll right well I appreciate what you do for us thank you so much you're listening to the Clark Howard show [noise]\nTen twenty and the goal ray carrier WSBIU twenty four hour traffic center slows on forming a little outside ... west power to left lanes walk between Ashford done what he wrote and riverside drive\nAt your twenty four so interested in the far right lanes when you're reaching Georgia four hundred to avoid added delays also getting more jerky authorities dealing with a ... a liquid spill believed to be paying along highway one forty at the crossing the river\nStone parkway causing land restrictions this report you by the Georgia campus Philadelphia College of osteopathic medicine where the Georgia capital P. C. O. M. is more than an exceptional medical school find out how to open house October nineties you can register a G. A. dot P. C. O. L. dot edu Steve ones low ws be\nOrange the little dog maintain that number to spot in the nation Saturday is a huge game on the road against LSU regained coverage began Saturday eleven thirty three thirty\nGame is here on the home of dogs\nDo you ask me this is ... a few years ago I realized that many of the happiest\nRetirees that I work with several common habits and traits and I decided to explore those similarities after\nConducting survey verified by George attack I was able to distill down the money secrets of the happiest retirees and then wrote the book you can retire sooner than you think is now helped many people get their happy retirement plan in place if you like to learn the secrets of the happy\nYou get there happy retirement plan in place if you like to learn the secrets of the happiest retirees please visit retire sooner book dot com that's retire sooner book dot com\nWhat would it take for you to get a tattoo you didn't want a million dollars\nHow about a million sucks I'm Randy from Bob when me and my business partner Dave how's it going critter jobs to start a stock company Bob as we wanted to make the best socks and the history of the no more knowing team no more falling down your leg added our support the idea\nAnd what's better than creating the best stocks in the history of sharing them\nThis is what we do one pair purchased equals one pair donated to those in need our dream was always to donate ... million pairs we thought it would take ten years that's what they've said when we donate ... million pairs of stock I'll get a tattoo to celebrate but then something happened people loved our socks and instead of ten years and only took two and a half\nA million pairs and one ...\nThe most comfortable stock in the history of beat by going to bomb is dot com slash am seven fifty and get twenty percent off your birth order that's B. L. M. B. A. dot com slash am seven fifty\n[noise] so why should the news reporter you trust his own W as the radio\nAnd now ... just free back from the radio judges do three to four year old he is a magical voice since the ... the same old Jamie ... with a little different voice changed feel free to point on New Year's Ninety five and I am seven fifty ... at the hands on his hands on ...\nUs fees Jimmy do free NBC damage a ... man and\nWatches the there's a new way for you to get Jamie do breeze behind the scenes dance ice on politics and re day subscribe to the brain don't you ask me to do for a Washington insider emailed no strings attached to just get information from Jamie every weekday mornings sign up and\nThen when you asked me radio dot com\nRemodel every room in your home with one simple solution hey Ted and Jonathan here owners of Georgia replacement windows your entire home will get a beautiful make over with the city from Marvin fiber glass window sits at the look at your own like traditional wood windows ... detail Michelle keep the ... and he said big on your energy bills year round infinity\nFor Martin fiber glass windows by north Georgia replacement was a huge savings would this must limited time offer at energy windows dot com\nIs age men when\nLast year the Dow Jones industrial average was up just over twenty five percent everything was so good even the self help experts were giving out investment advice but you also saw a lot of fear fear of missing out in fear of crash\nBut here's the thing here is an emotion not an investment strategy if you're making your own investment decisions emotion plays a role whether or not you realize\nSo make twenty Eighteen the year that you kick fear out of your portfolio make an appointment with a financial engines advisor today and get a solid logical financial plan for your future one that helps take some of the fear out of the equation because self help us for ... not your financial security and retirement\nGet your financial engines dot com today [noise]\nHi I'm Bruce solved with financial engines here in the Atlanta area I'm ready to work with you to help make your financial goals are reality go to financial engines dot com or call for oh four six zero two fifty two hundred today\nMine number ... does not look like a number two I don't know what to call it is there a number three [noise]\nPeople for for police\nAnything close to the restaurant\nMiddle seat with ... stomach problem\nMy fear of flying [noise]\nSound like you if it does you could be one of the many people with the digestive condition called ... pancreatic insufficient see or a pie I even if you don't know when he ... he is you might know the symptoms frequent diarrhea gas\nBloated stomach pain if you have even just one of these symptoms you could still have the piano because not everybody experiences E. pi on the same way which is why it's so important to open up to your doctor about all your symptoms and the good news is\n... manageable so don't keep a lid on it good why Denis ... P. I. dot com complete the symptom checker and use it to have a conversation with your doctor don't keep a lid on it does it identify the piano dot com Bronx you buy a be\nBlind to wake up to Atlanta as wanting News Tomorrow ... coverage and powerful hurricane Michael plans\nAll the Florida Panhandle when the songs\nQuestions ever asked and it's been true since I went on the air in the mid eighties\nThat's last century Nineteen eighty is\nWhat do you do with a time share you're stuck with it it's today's Clark rages moment [noise]\n\nMarquee just a moment [noise]\nThis moment [noise]\nTime shares or defective product whenever you have anything that you can buy but you can't sell\nIt to defect to the product it is not a normal function of capitalism time shares don't work at a time share Israeli were okay\nThe companies that push so hard to sell them would be willing to buy them back from you they're not because they know they're selling you something uh basically no value\nI hear from people all the time desperate to unload a timeshare and over the last four years I've had an increasing number of questions from people who are being ... by lawyers that the warriors are going to get them out of it in return for paying a big retainer up front to the lawyer\nOften the rotator will be five or so thousand dollars\nWell now\nAround the country according to the Orlando Sentinel a number of lawyers are facing fraud complaints including one of the biggest operators of this guy had questions about in the past name drugs and Philips\nWho has now been disbarred for a\nCommitting fraud against people telling them they were going to be relieved of their obligation for time shares\nThat easily go actually was going on against the lawyers around the country are all being spurred by the big time share developers so let's bring this full circle timeshare developers if you're so busy trying to get people\nTaken away from their profession or get people charged with actions of fraud because they're trying to help people get a sham shares don't you think the real thing here\nIs that you need to come up with a system where when people want to dump a timeshare\nYou're there for them to dump it too [noise]\nBecause obviously of products that people buy they cannot wait herself is something people shouldn't buy from Hugh in the first place [noise] you're listening to the park how show [noise]\nResults made very not a solicitation for legal services if you owe the IRS back taxes payroll taxes have not found your returns the IRS will get you they can take your property take you to court even put you in jail with one called to wall you'll never need to talk to the IRS again our average\nClients settles for about ten percent of what is owed we offer free face to face consultations in your local area called eight hundred Seventy seven zero for three three that's eight hundred Seventy seven zero for three three\nOut of ... my name's Nigel ... an educated album I notice the difference between what's wise an unwise suffering needlessly without uh due symptoms on wives getting a free tend they sampled ... quite wise\nGuy told me is the average medicine the jump to defective an hour twenty four hour one which make getting a free ten day sampled one of the wisest things you can do so don't be unwise be wise old ... old ... column for your free samples today uses directed by\nCompanion bank a competitor that has a database backup\nThat's never more than twenty four hours old from their competitor and in the event that something happens where foreign actors able to completely disable the computer operations at a bank or credit union\nPeople will still be able to use their accounts with the other financial institution acting is host\nAnd for you and me\nAfter a cut over it should be somewhat pretty much business as usual I guess records would be there'd be like a twenty four hour window of a missing data potentially\nSo which again is not normally the end of the world but two things come to mind with us if we were to receive a serious attack from the Russians the Chinese another foreign actor\nIran look at our list of potential enemies that would do this\nCould be North Korea and we got a lot of such potential suspects\nWind a lot of people never have any cash anymore cash for a very short window would become valuable\nHaving a small amount of cash available stored in a place in your home small I mean for a lot of people just for walking around money under a hundred dollars let's say\nHaving that available particularly if you're somebody you've never carries any cash at all you should have it when I travel you I travel a roughly thirty weeks a year\nI carry even though I never use it\nI have a supply of cash with me not a huge amount but I have some cash that if ever I had a serious problem where I could not access accounts they still have some cash to function with\nThe second thing is and this is all Boy Scouts stuff right\nIs and this is all Boy Scouts stuff right be prepared and let's go on the assumption that nothing terrible is going to happen even if it does everything will be okay after a while\nBecause the redundant systems have been put into place\nSo the other thing is if you have turned off paper statements from a banker brokerage\nAnd you are receiving electronic ones\nYou need to print those out or store them\nIn your own backup hard drive or in the cloud although that wouldn't be as good as in your own hard drive you need to have some kind of record that if a bank database ever got wiped clean you don't have documentation at least going back to the last statement\nShowing what you had\nAgain that's doomsday kind of stuff\nBut I Want you to be prepared for me everybody I Do business with wants me to go to electronic statements\nAnd I know this sounds so antiquated in so dated but I'm thinking analog if everything goes wrong I still have my paper statements\nRobert's with us on the Clark Howard show Robert I'm really proud of you you're really thinking something through to make sure nobody takes advantage of you hit me with it\n\nI'm selling a car I don't need another one of out of this is one of my daughter used in college so uh it's a two thousand for pain model and I checked\nIt out on on on some of the size of the price range a list it online and\nA and I got a call from a broker and I took his number is offer and uh and just as you just collect data on and on I ... a local dealership said they wanted a foot or\nA ... so I I did go by there after a while and give the price of oil is lower than a allow a father with the [noise] and I got called when I got a call from another company\nAnd I don't know if I should say the name of the broker or or or what but uh they've given me a price on offer that is acceptable close to my number I was thinking of\nAnd they would they we have a range of for them to pick it up and they want to give me a Wells Fargo a certified cashiers Chet\nHow do you know these are that these people are the real people in our legitimate deal or why they contacted you you didn't contact them tell me what procedure you've been through after they contacted you\nWent to their website I I've lived in a child they go to\nOther websites to see it as an alias has seen or advertising I Believe that a lower paid attention to all [noise] sorry\nOh now I Am in tree name who you were talking about then please call van a car vinyl oh ... yeah I've talked about car buying a layer of 'em are increasingly popular way that people are buying used cars\nSo this is something that is still hard for me to wrap my arms around but people by a car from ... on their phone sight unseen\nAnd just buy a vehicle and then they have time if they don't like it take it back and get a refund ... like ... loves to buy cars um direct from a private sellers selling them\nBecause it cuts out some mark ups in the process if they can buy from your directly\nNow what did they have you do once he registered at their website\nI have a\nI live in the Vin number early on and we talked about some of the details and after they made at all for a load is my ... says and tidal Charlotte's in back and ... or\nSo left off ladies they want to have ... of the car up loaded\nSeveral among the sights Mariel several of any of it they should I guess is might not be the clause dealership\nAlready said they sight unseen they're going to buy your car and they gave you the pricing and they give you this Wells Fargo cashier's check\nYes hey when you have ... Brian\n... Wells Fargo and they say well they can be a cashier say that means they've already got the money for that check\nIn in the account or whatever and\nIn in the town or whatever and ah but I think they're going to write a check on site now so I just questioning ethics has said\nThat so now I mean if they're gonna if ... going to write your check it's like what ... what they write you a a bank check on site that's not a cashier's check well that's a\nCashier's check has issued by the bank itself so have you called car vaunted just out of the blue\nAnd said hey how do you buy cars from people and how does it work and how do you do it and if you looked at the process on car mounted dot com just make sure everything you're doing matches up with al ... really does business and this is no imposter who's trying to buy from you\nKnow I have is all\nRight I Would do that just as much as you can reach a level of comfort that you're really dealing with them not just some tow truck is going to show up and you want to say I can go off with your car\nI Know as you get a picture of the guys driver's life as an egg and run is that a meeting last fall is that there are others as it was a mess I didn't know what else\nYou're meeting I'm Adam Wells Fargo branch\nI said let me tell me what I'd like to do you know I I'm very familiar with ... I just wanted to make sure before you turn over your car and you've gotta cashier's check that everything you've told us really is there a method of operation and so we're going to put on a call them and we'll let you know okay\nThat'd be great to hang on just seconds so we can reach you later wow that is quite a puzzle David's with us on the Clark Howard show Hi David\nOh my gosh the king of savings hey how's it going\nGreat thank you let's see if I really prove myself to be that\nYeah thanks to cheap skate university ever all about you and I am so happy to talk yeah [laughter]\nWell thank you how can IBM service and show that I deserve their where the crown of king of cheap\n[laughter] well my wife and I want to take the trip the Mardi Gras we've never been to New Orleans\nUm she's never been a east of Utah and um we're ... we're trying to go there during that time during the this parade and all that we don't need to be there for a whole week says the advanced just at least may be the end of it because I hear that Tuesday the big day or something\nSo I don't you you you're the man when it comes to the flights hotels where you know it you know it's not getting a Roach Motel but at the same time you know travel spots there a need help\nTalking about how you look try at risk free\nOne eight hundred six seven eight nine ... nine six night that's one eight hundred six seven eight nine ... nine six nine\nDiabetes high blood pressure anxiety meds everyone's on them if you want to fifty year old male maybe it would be for you or even with type two diabetes a million dollars of term insurance my only cost you about two hundred bucks a month of for double term life insurance is out there called term provider and speak with big Lu at eight hundred for a one\nFourteen fifty eight eight hundred for a one fourteen fifty eight or is it big lewd dot com\nRemember big lose IQ he's on meds to\nDouble us Mimi ... er Cox media group station [noise]\nTwenty four hour news weather man from five AM's\nAsked me\nNow [noise] I don't live in a clock\nOn ten it for granted fly and they tell us the twenty four hour news center with us be top story this hour [noise]\nWell you know can\nWarnings from these officials to strong and kill you then from Florida governor Rick Scott as hurricane Michael closes in with up to Thirteen foot storm surge and a hundred twenty mile an hour with water will come miles ensure an easy\nRide over the role of houses so you're not going to survive storm surge if you're in the in the middle of a storm surge you're not going to survive\nThe rapidly developing storm now category three is set to make landfall near Panama City sometime tomorrow ABC's news meteorologist and peck says the state's panhandle in Big Bend area it's however will be getting the worst of it in the coming out warning\nWe start to see more significant impact as the eye wall or the more intense part of this storm approaches the Florida Panhandle that means those higher wins the very heavy rain and that life threatening storm surge is going to ramp up very quickly\nThe watches and warnings that are now in effect range from Florida to the north Carolina area ... ABC News\nI never ... governor Nathan Deal declares the state of emergency for Ninety two counties all half of Metra Atlanta he says the status for hair for Michael you're hoping\nThat it will be fast moving is the phrase the recent history of this particular guy so maybe it'll move through our state quickly not too much damage that's our host\nHas restrictions on moving fuel and produce had been lifted nonprofits\nThe restrictions on moving fuel and produce had been lifted I'm ... and state parks are being open to that could we say capital Harris several us they can\nBe sharing the stage deli let the drought the night and on Atlanta's morning news for updates right now Seventy two degrees in Atlanta cloudy with a chance of showers tonight low Seventy a thirty percent chance of showers tomorrow increasing though by tomorrow night at last most accurate and dependable forecast is coming up\nFirst first this is double you asked me twenty four hour continuing County Coroner's\nReleased a final report on the recent death of a high school football player\nA traumatic brain injury the trigger cardiac arrest what the white County Coroner's report says about the death of Dylan Thomas a linebacker he fell in the second half of a game against each county held off the field and eventually airlifted to Grady hospital sixteen years old and in great physical shape writes the corner\nThere were no preexisting medical conditions that would indicate Dylan would be more or less susceptible to this kind of injury than any other ballplayer first camp nobody wants to be\nAnd from the bulldog nation at key Georgia Bulldogs has been sidelined this week at least Laurence Smith suffered a broken hip and a fractured elbow\nAnd had to undergo surgery today at Piedmont Athens regional hospital Smith who turned eighty and may is ebony resting comfortably deli you watch the news China's eleven over three that these brought to you by Korean bright box\nAre you scared of the the one just before your lights go out who knows how long it would be sitting there and the dark automatic backup generator kicks in as soon as your power crashes but you need a ... a design your system generators are not one size fits all\nSo get your free system designing has meant when you called bright box electrical I'm Dave bigger new might experts who never leave me in the dark right box electrical get up to one thousand dollars off and two years maintenance for a limited time called black box electrical and don't fear\nThere are a lot of companies out there but only\nOne in Atlanta that has been in business for over sixty years and that heath tree service whether you need tree removal or tree pruning work done our certified or births are experts in all aspects of tree care\nIf you're looking for quality professional tree care call he's tree service or find this on line and he tree service dot\nCom [noise] last year the Dow Jones industrial average was up just over twenty five\nPercent everything was so good even the self help experts were giving out investment advice but you also saw a lot of fear fear of missing out in fear of crashing\nBut here's the thing here is an emotion not an investment strategy if you're making your own investment decisions emotion plays a role whether or not you realize\nSo make twenty Eighteen the year that you can figure out of your portfolio make an appointment with a financial engines advisor today and get a solid logical financial plan for your future one that helps take some of the fear out of the equation because self help is for ... not your financial security and retirement\nTo financial engines dot com today [noise]\nHi I'm resolved with financial engines here in the Atlanta area I'm ready to work with you to help make your financial goals are reality go to financial engines dot com or call for oh four six zero two fifty two hundred today\nHere side of joined the renewable energy generation will not putting a bigger rooftop solar system on your home for as little as twenty four Ninety nine a month Georgia Power residential customers are joined the new committee solar program find out more Georgia Power dot com slash community solar\nThe wind blows and they don't like the twenty four hour training center\nIn her right now north side rubber to eighty five west boundary outer loop ride through Sandy Springs impaired what plans do block going overpass\nPeach tree done what he wrote it you're twenty nine heading over toward riverside drives us to the far right then does pass that you have the left lane block away by somebody five globally been Cobb County heading toward cob parkway also continued working on eighty five north\nOut going up to enter barrel county at Hamilton middle road ... report it to be blocked heading toward highway two eleven Steve Winslow ws be\nSomebody else's her college\nWith Muslims jak written for gas to my cloudy with a shower and a few spots slows around Seventy tomorrow at thirty percent chance for morning shower then showers and thunder showers sixty percent likely afternoon\nPercent of the night highs Seventy seven eighty low Seventy one Thursday morning showers eighty percent likely and breezy rained diminishing or thirty percent chance by evening Hi Seventy nine lows fifty to fifty five friday mostly sunny ... Seventy three lows forty eight fifty three\nSeventy two degrees on peach tree street at news Ninety five five and seven fifty deadly you at the depend on it\n[noise] [noise]\n\nI'm so glad you're with us here on the Clark Howard show about us ... yours I Want you to learn I recently have more than ... [noise]\nIf somebody say ... laugh [noise]\nAnd don't let anyone ever with you off [noise] coming up later this hour\nThe new hot business for you to be involved in marijuana [noise] so is that opportunity or is it rip off\nI have some guidance for you [noise] right now though I Want to talk about a national scandal [noise] we have\nIn the United states and have had now for eleven years\nA program that if somebody chooses to go into a public service profession where they are deciding they want to do things to serve others that will pay them less working for a nonprofit social work a certain types of government work that\nStudent loans federal student loans\nWill be forgiven after ten years in order to encourage people to do jobs that don't pay as much\nAnd so society subsidizes education will the student loan forgiveness program has been in place now for more than a decade\nAnd the first people eligible had been filing for their loan forgiveness and the U.S department of education\nIn a move of intense meeting is nothing else other than meanness\nIs rejecting over Ninety nine percent of the applicants who the law promised loan forgiveness and return for one hundred and twenty consecutive on time payments but instead\nThe reviewers at the department of education hostile to the loan forgiveness are looking for\nAnything at all any wind miss thing\nIn paperwork or whatever to reject the borrowers application for what was promised to them\nThis is reprehensible and inexcusable\nSo\nOne of the things you should know is the forums that the borrowers who are supposed to follow weren't even issued until five years after the program started\nSo people as best as they could in good faith\nIs that the later you take Social Security for most people the better it will be but I don't plan but as far as where you are today in your early fifties it's way too soon for you to start trying to figure out how to maximize that benefit for you and your bride\nWhom called like watch\nAll right have a great day and the other thing I Would ask you before you run away how're you doing saving for retirement away from what you were anticipating getting from Social Security\nTo keep the white boy from T. J. max I think I'd be doing better\nOh oh All right so a question about her is she working\nUm you know we've got a mother I got a mother in law's living with us with kidney failure so\nOh I'm Sorry to dial up says oh I think that many doctors\nOkay so for her the shopping\nIs where the money might vanish so [noise]\nYeah probably stress relief\nOkay and is she doing anything like are you all doing a spousal Ross where there's even though she's not working there's money going into a raw for her\nPlan on starting it like um you know I got a four one K. that I'm a failing and my own a fly off and I are a and\nI don't think I think it's everything I think\nThis spousal Ross is really valuable and she has that she sees the statements and all the rest she may seem more relevance in it versus the shopping that is a going on\nAnd once she has that state and she sees her account and she sees the balance in it and realizes that hundred dollars there will have much more impact than a hundred dollars that she spends in some retail store\nMaybe that would have some benefit\nFucking wild will probably be better than the regular\nDefinitely ... the spouse or raw because she's in her forties she's got so much time for that money to grow tax free and be spent tax free spousal Ross would be the ticket you're listening to the Clark Howard show [noise]\nEleven Twenty one cool right carrier WSBIU twenty four hour traffic center at the top of the brakes continuing on the north side perimeter to any five west bound by the area or riverside drive where two planes in a block from work overnight starting at Peachtree done what he rode also watch for the left lane we're continuing twenty five western south down going to cost kind of passed I Seventy\nFive over toward cob parkway and continue\nIt's kind of passed I Seventy five over toward cob parkway and continued construction work on four hundred north going by the bald ridge marina ... plan affected heading up toward Brown's ferry drove Steve Winslow ws be centered on ...\nYou know me I'm not even a new house every day right here on W. S. B. I'm here to say look out Alfa reta we are coming your way the doctor and hours and I will be doing the show live from ... to be changed the Rio and Mars and read a bar on friday it's free and open to everyone get more details or W S P radio dot com\nGuys are bedroom troubles killing your sex life I Bradley I with health gains solutions regain your sex life with gains wave a revolutionary medical treatment for reptile dysfunction it's painless requires no shots and new pills you can be spontaneous again gains wave as a scientifically validated therapy\nThat restores the poor blood flow causing you read e for more information as it gains way bucket dot com\nThat gains way bucket dot com or call for oh four four hundred forty eight hundred\nThis is David Baker every plumber Mr Palmer says your home is only license with thousands of hours of training and only Mr plumbers making this offer on your new water heater by your next forty or fifty a gallon gas or electric water heater from Mr plumber\nAnd upgrade due to their best tenure tank ... for the price of a six year warranty saves about three hundred dollars\nMr plumber includes a new ... new ball Valdez super strong gas lines\nYeah special plumbers of my own show my water heater here Mr plumber\nWhat would it take for you to get a tattoo you didn't want a million dollars how about a million sucks I'm Randy from Bombay when me and my business partner Dave how's it going critter jobs to start a stock company Bob as we want them to make the best socks and the history of feet no more knowing theme no more falling down your leg added arch support the idea\nAnd what's better than creating the best socks and the history of the sharing them\nThis is what we do one pair purchased equals one pair donated to those in need our dream was always to donate a million pairs we thought it would take ten years but that's what Dave said when we do need a million pairs of soccer I'll get a tattoo to celebrate but then something happened people loved our socks and instead of ten years and only took two and a half\nA million pairs and one ...\nThe most comfortable stock in the history of beat by going to have bonded dot com slash am seven fifty and get twenty percent off your birth order that's B. and B. A. S. dot com slash am seven fifty\nGreat news everybody thanks to advances in medicine you may live longer than you think you should plan on living in the nineties for women maybe even longer but that could mean bad news for your retirement your savings come up short when you need that money to most\nConventional wisdom says that as you get older and closer to retirement you're supposed to move more into bonds\nBonds have limited growth potential and again if you live longer that can be a problem when you retire your money shouldn't stop working when you do you need a plan not just for inflation but income financial engines advisors have been doing that for more than Twenty years for everyday Americans and they can do it for you to\nGo to financial engines dot com schedule your appointment today [noise]\nHi I'm Andrew going in with financial engines here in the Atlanta area I'm ready to work with you to help make your financial goals are reality better financial engines dot com or call for oh four six though to five to zero zero today [noise]\nMine number tears does not look like and number two I don't know what to call it is there a number three [noise]\nPeople for for police\nAnd close to the restaurant\nMiddle seat Whitney stomach problem\nMy dear flying [noise]\nSound like you if it does you could be one of the many people with a digestive condition called ... pancreatic insufficient ... or ... even if you don't know when he ... he is you might know the symptoms frequent diarrhea gas\nBloated stomach pain if you have even just one of these symptoms you could still heavy PI because not everybody experiences E. pi on the same way which is why it's so important to open up to your doctor about oh your symptoms and the good news is\n... manageable some don't keep a lid on it good why Denis ... P. I. dot com complete the symptom checker and use it to have a conversation with your doctor don't keep a lid on it is in identifying the piano dot com brought to buy on the\nPlane to wake up to Atlanta I Want to use tomorrow and ... team coverage and powerful hurricane Michael landfall Florida handle winter storms in Atlanta and it'd be pulled out of the five day forecast\nI think we have time to sneak in and ask for your call Kimberly wrote and she says I'm looking for good affordable laptop for college can you recommend a good one to me [noise]\nSo laptops part the cheapest\n... bay of ever been for a full featured\nPowerful laptop you can buy an entry level laptop that is more powerful\nThe street level laptop that is more powerful than like any windows laptop of just three years ago and you can buy those at right around two hundred dollars\nAnd they go on sale all through the year there are certain times the laptops are cheaper than others the usually the lowest cost time\nTo buy a laptop we'll be either in August\nOr it will be\nOr in the month of November approaching the Thanksgiving holiday the whole Black Friday the old time so it's really inexpensive\nFor you to buy a laptop that works fine for school except for Apple apple laptops continue to be extremely expensive I'm looking at one of the sites you can get a sense of how cheap laptops are and how capable they are\nMicro center dot com which is a high volume seller of laptops and I'm working one Ninety nine two forty nine two Ninety nine but even the two Seventy nine even the one Ninety nine laptop\nIs a very powerful Fifteen point six inch laptop but with the Mac book stuff still ... billion dollars you're listening to the Clark Howard show [noise]\n\nDiabetes high blood pressure anxiety med everyone's on them if you're a fifty year old male maybe it'd be for you and you may even have type ... diabetes\nA million dollars of term insurance may only cost you about two hundred bucks a month\nCalled term provider speak with big Lou wet eight hundred five nine oh Seventy five sixteen ... will find a term my policy for you even if you have type two diabetes are overweight or have high blood pressure to providers help thousands of people like you who think they can afford term life insurance\nTo buy a million dollars of affordable term life for you all you need to do is called big Lu at eight hundred five nine oh Seventy five sixteen ... will make sure the scales are tipped in your favor goal eight hundred and five nine oh Seventy five sixteen\nKeith is with us on the Clark Howard show hello Kate\nHi Claire area\nGreat thank you you got a question for me about boosting your credit score\nCorrect I'm looking to find my first home this year\nAnd basically through my credit union [noise] my rates are determined by my credit score so I have maybe about ten K. saved up right now and you know growing it every paycheck\nAnd I have some days in collections that negatively affected my scared and I'm just wondering you know well it helped my score to pay them off\nAnd and take that on my savings and pay the collection debt off or am I better keeping that cash on hand for my down payment on my house I've read on line that even if you pay off things that are already in collections it has a zero impact on your credit score\nSo if you have a collection on your report that is the main factor and what happens with your credit so if you pay off\nAn old item it will raise your score potentially some but it depends on the scoring model being used how much effect it has so the newest scoring models like the newest psycho model\nGives you a good bump in your credit score if you take an active collection and satellite pay it and it's now report is a zero balance but the lender has to be using the\nNewest model of the fight goes scoring which just completely depends on the credit grander\nYeah so it's not whether\nOne of the three credit bureaus are usually the latest model it's based on the credit union and what they're even\nExactly so as an example the one that takes into account how you handled past what excuse the term what they would call bad behavior and you've turned it or you've turned it around and you've taken care of something the model known this fight go nine\nIs the one that the credit union would have to be using as I understand it for there to be a meaningful impact on your score paying off an old item I mean generally once an old item hit seven years it vanishes anyway\nMy follow up on that is a one of the items and collections is from twenty eleven but it looks like when I'm On my credit report and now shows twenty Fifteen like maybe there was some way that the gate got refreshed or is that\nIs the term that I use for it and that isn't illegal activity on the part of whoever is reporting that debt\nOn the part of whoever is reporting that debt unless you took some kind of action on it in twenty fifteenth so what you do is you challenge the date was known as the date of last activity for it got it\nAnd generally they don't want to fight with somebody who knows that's how the rules work that's how the law works so you would challenge that item not being on your report but the date\nThat that item is on your report because the aging of it is so important and you contact both whoever the collection agency is reporting it as twenty Fifteen instead of twenty eleven you challenge with them and the credit bureau\nGot it okay so ...\nHow many I was there that are these old items and collection\nIt depends on which bureau I have as little as two one zero and as many as four and another one\nIn or they generally in the age back like early this decade or some of the more recent\nThe most recent one I Would say is four to five years ago\nOkay so that one's got a little clock time to run but the thing is is that the whole idea of credits scoring is that you're not in a credit purgatory forever\nThe ones that period of time passes even if you don't pay on the debt they disappear and you have a fresh start\nSo you're getting this or that but settling the ones in particular that are more recent would be to your advantage if you're trying to get credit right now\nExactly so the first thing for me it was just talking to a credit union and just ask them if they're using the\nFire line and the person you talked to a loan officer that will know if it's somebody at the credit union they're not going to know\nAnd you ask them how did they make a determination on making alone\nIn the event that you have zero balances on these old items will that change the loan approval process for them there is a great explanation about what happens with older items on credit reports and a website you may have heard me mentioned from time to time\nCredit sesame dot com go read their briefing on what happens with a collection items in the different scenarios that apply\nJim joins us on the Clark Howard shown Jim you have an idea you want to share with your fellow listener about emergency savings fun is that true\nThat's true so clerk I ah I already max out my retirement or through law than I have four one K. and\nI've got a [noise] a money sitting in the emergency fund obviously for learning seats [noise] but uh it's a pretty good chunk of money and I was toying with the idea of taking maybe I don't know half of it\nAnd putting it into a target retirement fund that either recently passed\nKnowing that the you know that they're trying to keep someone who is retired or about two or tired or try to keep their money you know from from going down obviously I Know there's no guarantee that I was wondering what your thoughts were doing something like that in order to maybe for a little bit of money\nOn that I think that that is a very low risk strategy to try to goose or return on your rainy day money right and so going into a post retiree portfolio which is what you're doing I think that's a very viable strategy\nObviously a someone who's already in retirement they've they've lived more towards bondsmen stock I notice the interest rates go up on a won't be looking so hot\nThat is true but you know the whole idea about how they do one of those portfolios is where I mean you could even go into a balance fun that's fifty percent stocks fifty percent fixed income or bonds and the idea is that the risk counteract each other you'd have to have a perfect storm\nFor you to lose a substantial amount of money with either scenario and even though you're a hundred percent correct his interest rates rise the value of bonds\nWill go down if you're concerned about that you could build your own portfolio\nUsing a short or ultra short bond fund and using a lower risk stock portfolio stock fund portfolio and eliminate a lot of the bond interest rate risk\nBut the idea of as somebody who's a Mac saver like U. of taking a lot of your rainy day money and investing it at a low risk kind of point of the scale I think is great\nChris is with us on the Clark Howard show hello Chris how can I serve you today\nI'll tell you what for years I've been thinking about lasik surgery surgery and I keep upgrading my glasses every year year and a half and he got the point now where I got it\nEvery year year and a half and got the point now where I got a blurry vision [laughter] I cannot lazy and not seeing so many price ranges\nOr something like a dollar and then there's some ... ... ... dollars are not just want to know all the way to go\nSo this is this is a tough one because this is where the wallet meets medicine and science so there are high volume chains are used to be a lot more through the shakeout phase with lasik\nBut there are the volume chains that charge like two fifty three hundred three fifty and I\nYeah and then there are the boutique places that do lasik they charge several thousand dollars a night\nExactly\nAnd this one is one of those things that does not have\nA right answer when you go to the high volume chains you have the benefit that the ophthalmologist doing the procedure dies a ton of them and there's an advantage\nWith medical procedures when someone has a great deal of experience\nBut also you are in a basically a factory an assembly line and if you have issues or problems later\nThe difficulty you might have with one of the high volume discounters is there any follow through is extra any what they call the euphemism enhancements\nEnhancements means and lasik surgery as folk eight and a lot of people may not be aware that after you have an id done you may need a follow up surgery that it that it may not have gone exactly as they planned\nAnd with a high volume discounters you will usually pay every time they do any kind of follow up\nWith the with the boutique practices where you pay a much higher price up front it tends to be a more personalized experience and more time will typically be spent with you", "year": "2018", "show_name": "The Clark Howard Show", "city": "Doraville", "day": "10"}