{"month": "10", "state": "CO", "station": "KRCC", "content": "That story this afternoon on all things considered from NPR News have\nConsidered today at three thirty pm on maybe one point five to your cc\nThis critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five K. R. C. C. newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality cost money as a nonprofit media organization we look directly to you to help pay the costs of our services become a part of the\nAnd he's considered today at three thirty pm on Ninety One point five to your cc\nIn this critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five ... newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality cost money as a nonprofit media organization we looked directly to you to help pay the costs of our services become a part of the team contribute at K. R. C. C. dot org today thank you\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado College where lifelong learners foster relationships with students and professors working side by side to attain a liberal arts education more about lifelong learning at Colorado College dot edu\nThis southern Colorado's NPR solution to your cc ... Colorado Springs ISI see law hunter tc of ... and the W. CCF them woodland park\n\nFrom WHYY in Philadelphia I'm Terry Gross with fresh air today we talk about Leonard Cohen a song writer and poet\nAnd Leonard Cohen the father I guess will be his son Adam Cohen Adam produce the final album his father released before he died now Adams written the forward to a book of his father's unpublished writing\nAdam remembers when his father was composing his best known song hallelujah\nTook um twelve years started when I was very very young versus three eighty four verses to that so I remember coming down to the kitchen table and he was there was another one string guitar and his underwear\nAlways be versus sold hundreds of versions have been recorded there was a moratorium on that song you know in my family is that right is that for me it would be transcripts reframe please refrain from Plano [noise]\nWell see [noise] that's coming up on fresh air [noise]\nFirst news live from NPR News in Washington I'm Windsor Johnston President Trump will crisscross the country this week in an effort to build support for Republicans a head of November's midterms NPR Shannon ban sand reports tropical whole campaign rallies in four states Trump will travel to\nAt Pennsylvania Ohio and Kentucky is expected to help the economy and urge voters to head to the polls in November over the weekend\nWell see that's coming up on fresh air [noise]\nFirst news live from NPR News in Washington I'm Windsor Johnston President Trump will crisscross the country this week in an effort to build support for Republicans a head of November's midterms NPR Shannon ban sand reports tropical whole campaign rallies in four states\nTrump will traveled to Iowa at Pennsylvania Ohio and Kentucky he's expected to help the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump's celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nDuring our son is doing a left wing [noise]\nOff four hundred and thirty five members at the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nA un report is calling on countries around the world to do more to combat global warming as Larry Miller reports scientists are warning of severe environmental changes including heat waves devastating storms droughts and the loss of species\n... says even keeping the earth's temperature rise to the two degrees centigrade targeted greed of the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe IPC she says only by dropping to one point five degrees can the worst effects of climate change be avoided\nIts report says manmade zero to emissions need to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent no one I BCC board member warns\nThere is only the slimmest chance of avoiding unthinkable damage to the climate system that supports life as we know it\nFor NPR News I'm Larry Miller in London\nPakistan's Supreme Court has heard the final appeal other Christian Woman who's been sentenced to death for blasphemy NPR's ... reports it emerged as one of the most important cases in years to reach the Supreme Court there\nCourt reserved it's judgment on the appeal and didn't say when it would be announced over the years the case against us your baby has led to the assassination of two senior officials one of them was noted by his buddy God who is now revered as a near St by the religious right the case or\nWe know it for NPR News I'm Larry Miller in London\nPakistan's Supreme Court has heard the final appeal of the Christian Woman who's been sentenced to death for blasphemy NPR's ... date reports it's emerged as one of the most important cases in years to reach the Supreme Court they're\nCaught with a judgment on the appeal and didn't say when it would be announced over the years the case against all the baby has led to the assassination of two senior officials one of them was noted by his buddy God who is now revered as a near St by the religious right\nThe case also released a powerful extremist movement and their leaders wound of terrible consequences if BP was granted leniency\nNPR's Dan ... reporting from Islamic bought\nThe death toll from a powerful earthquake and tsunami that struck central Indonesia nearly two weeks ago is nearing two thousand search and rescue crews continue to come through mud and debris on silhouette the island searching for survivors thousands of people are unaccounted for\nDr trading lower on Wall street at this hour the Dow is down forty two points the NASDAQ down eighty three B. S. and P. down nine this is NPR\nI'm Ryan ... and this is a day in a life for October age level you\nKnow and ... hall all\nDay today and I was in eighty five Peters even Hernandez was born in Honolulu, Hawaii Puerto Rican part central European Jew and half Filipino he received his nickname Bruno at the age of two Fifteen Years later if you were to choose his last name in favor of Mars [noise]\nPrior to becoming known to the world is Burnham ours he was known as little Elvis his talents and reputation as a pint sized Elvis impersonator garnered an appearance in the show honeymoon in Vegas in Nineteen Ninety two [noise]\nAnd may have inspired a Saturday Night live skit starring Nicolas Cage that very same here\nMars moved to Los Angeles following his high school graduation initially making ends meet as a musical journey man of sorts you work as a DJ performed a cover band British recordings Andrew songs including a coauthor credits a sealer greens two dollars and in turn hit forget you\nThat same year Mars released his first solo album with Atlantic Records titled do\nStarring Nicolas Cage that very same here\nMars moved to Los Angeles following his high school graduation initially making ends meet as a musical journey man of sorts you worked as a DJ performed a cover band British recordings Andrew songs including a coauthor credit fuel greens two dollars and in turn here to forget you\nThat same year Mars released his first solo album with electric records titled do walks and hooligans Richard Reid single just the way you are [noise]\nIn two thousand intro Bruno Mars reviews just struck at full length album titled an Orthodox Jew box featuring his biggest shifted age locked out of heaven and the rest of the fishery\nDamn alive to draw too by ranch be direct building community through sustainable local food real food for local farms available at the ranch who the direct retail store on east ... street in Colorado Springs and on line at a ranch food to direct dot com [noise]\nYes [noise] you can have great music seven nights a week from seven to midnight on Ninety One point five K. R. C. C. [noise]\n\n\nIs fresh air I'm Terry Gross when Leonard Cohen died two years ago at the age of eighty two he left behind many unpublished poems and lyrics some of his final palms lyrics notebook injuries in drawings are collected in the new book the flame his son my guest Adam Cohen wrote the forward\nAnd I'm also produce the album is bother recorded shortly before his death called you want a darker\nAnd him as a singer and songwriter who's album like men when gold and Canada and twenty twelve he was born in Montreal in Nineteen Seventy two animals going to talk with us about Leonard Cohen as a writer performer and father and tell us about working closely with his father in the final year of his life\nAnd then at Cohen's lyrics have adept few songwriters have achieved reflecting reverence and despair and attraction to beauty and his knowledge of broken ness\nProduce the album his father recorded shortly before his death called you want a darker\nAnd him as a singer and songwriter who's album like a man when gold in Canada and twenty twelve he was born in Montreal in Nineteen Seventy two enemy is going to talk with us about Leonard Cohen as a writer performer and father and tell us about working closely with his father in the final year of his life\nLeonard Cohen is lyrics have adept few songwriters have achieved reflecting reverence and despair and the traction to beauty and his knowledge of broken is lyrics informed by his Judaism his practice of Zen Buddhism and has dealt with\nSome of his many well known songs include Suzanne so long Marianne famously raincoat Chelsea hotel number two everybody knows power of song I'm your man and of course his best known most frequently recorded and performed song hallelujah\nAdam Cohen welcome to fresh air I just want to start by saying I Love your father's music I left his writing\nAnd I feel privileged to have had the chance to hear him in concert and to talk with him on her show and I'm grateful for the chance to talk with you today and thank you for being here when I interviewed her father and two thousand six after the publication of a book of his poems and songs\nHe asked to read a poem that he just written that hadn't yet been published but it's now published in his new book the flame so I thought it would be a perfect way to start with your father's reading of that home a street or from our two thousand six interview\nOr used to be your favorite drunk good for one more or less\nThan we both wrote a look and look what does all the way\nYou put on a uniform to fight the civil war\nOr tried to join but no one like the side I'm fighting for so let's drink too when it's over and the strength to when we moved all be waiting on this corner where they are used to be stretched\nIt is because of my sons loving encouragement and skilled administration that the sun's exist in their presence form I cannot think of enough\nWhat were you able to do for him physically to make it possible for him to record the album he mentions you put him in the medical ... can you describe to set up that that you helped create for him\nThink maybe the more interesting things certainly to me would be to to just say that we were writing some kind of mysterious wind and the grace of the occasion there was an urgency to the entire mission and of course it had to do with a serious health issues\nThe administration that the sun's exist in their present farm I cannot think enough what were you able to do for him physically to make it possible for him to record the album he mentions you put him in a medical ... can you describe the sad about that that you helped create for him\nI think maybe the more interesting things certainly to me would be to to just say that\nWe were writing some kind of mysterious wind and the grace of the occasion there was an urgency to the entire\nMission and of course that had to do with a serious health issues he was a mobilized you had a multiple compression fractures of his spine and it involves an incredible monastic effort on his part to [noise]\nTo be present and to deliver the way he did but\nThere's something about his work in general not just on the last help them but in this book and in general he he invites you into your own inner life because he takes the inner life seriously\nHe's not like one of these contemporaries I won't mention any names but there are many wonderful contemporaries of his who have in my estimation become ... style jacks ... because there's somehow they succumb to the temptation of going back into their older catalog\nAnd their regurgitate in things whereas this man was speaking from the very wrong that he found himself at in life\nLet me re introduce you if you're just joining us my guest is Adam Cohen and he's the son of Leonard Cohen and now there's a new collection of Leonard cons\nFinal lyrics homes notebook injuries and drawings and these are all collected in the new book the flame and Adam Cohen wrote the introduction that we're going to take a short break and then we'll be right back this is fresh air\nHi this is how big black host of looking up the nerd showing astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM an additional shows are are tied to care C. C. dot org and available and I don't remember keep looking up the Japan American society of southern\nColorado will hold their annual cultural festivals are\nOn the easiest campus October twenty of more information on this and other public service announcements can be found and there's a link to see that or gee\n\nThis is fresh air and if you're just joining us my guest is Adam ... he's the son of this\nShowing astronomy here on Ninety One point five K. R. C. C. we're every Monday at nine AM and nine PM and additional shows are are tied to care C. C. dot org and available and I tunes remember keep looking up with Japan American society of southern\nColorado will hold their annual cultural vegetables are\nOn the easiest campus October twenty of more information on this and other public service announcements going to be linked to care so you see that are watching\n\nThis is fresh air and if you're just joining us my guest is Adam ... he's the son of the late Leonard Cohen and there's a new collection of Leonard Cohen final homes lyrics and drawings and notebook entries previously unpublished and it's called the flame and Adam wrote the introduction to it\nI'm going to ask you to read a poem that's published in the new collection in the past ... collection of Leonard ... works I'm so is there something that you could choose that would be relevant to what we're talking about now\nYou know what I don't want to read this bones I think that I think in some way or another if we could urge people to\nUm to consult to work with smaller samples [noise] otherwise it takes a kind of ... stone that I think he would have been very very reticent to uh to accept it\n[noise] um\nI'm Wondering if you think that's because like when your father sang his songs or read his homes there was this really dark quality but there was this like kind of\nExistential distance from it at the same time and it transcend than quality as well that made for a really complicated mix of emotion\nUm is that what is troubling you by the idea of you you reading the palms yourself that he brought this kind of just you know even through his voice this complicated quality of whatever painter anguish and spirituality who is expressing at the same time and that you don't feel like you could\nI think it's simpler than that you know I'm reminded of I'm reminded of so so many lines in which he talked about the solitude of the experience of the of reading and there's so many poems in which he alludes to the idea that uh that this is\nThis is a private matter and so there's something contradictory feels like a transgression for me to read them\nAppreciate you saying that as a son but as\nAnd spirituality who is expressing at the same time and that you don't feel like you could\nI think it's simpler than that you know I'm reminded of I'm reminded of so so many lines in which he talked about the solitude of the experience of the of reading and there's so many poems in which he alludes to the idea that ah that this is\nThis is a private matter and so there's something contradictory feels like a transgression for me to read them\nI appreciate you saying that has a son but as a fan of your father's work I Will say that he performed his work in concert to large crowd of people and there are so many performers who have performed his songs so they haven't met that have his work as a life outside of his mouth\nAnd him and his work has a life outside of the solitary experience of a reader sitting alone in his room\nQuietly reading his poems\nSo I go and they want to get on their record essay what I Know and I'll go one step further with what you're saying just because I don't believe that they're contradictory in a sense I mean this is a man who's put the word hallelujah on many millions of people's lips you know so that that's the sound of a preacher men\nOr that of course when it's attached to song uh it's supposed to lift and uh and exist away songs have always existed I just mean that there's something about\nReading the poetry that I'm feels instructional or a has a kind of rigor to it I'm of a ... quality that I don't believe was intended there's something more beautiful about the notion of\nPeople quietly thumbing through this book and observing and as I say really taking the time with the jewels that are embedded in every line taking their own time\nNot with my meter now with my voice\nWell since you've declined to read more pounds that your father I'm going to fight not being ... can tankers are in transit you\nKnow it just it's a it's I'd I'd be lying if I didn't say it was a little disappointing\nBut I I can I can live with that so I thought I'd play your father reading another another problem with his from the interview that we recorded in two thousand six\nIs a poem called titles and it was published in a book that he did in two thousand six of 'em homes and their ex so this is Leonard Cohen recorded in two thousand six on fresh air\nI find that I'm going to find not being ... contain Chris or intransigent\nNow it's just it's a it's I'd I'd be lying if I didn't say it was a little disappointing but I I can I can live with that so I thought I'd play your father reading another another problem with us\nFrom the interview that we recorded in two thousand six and this is a problem called titles and it was published in a book that he did in two thousand six of 'em homes in there and so this is Leonard Cohen recorded in two thousand six on fresh air\nI had the title poet and maybe I was one for a while also the title singer was kindly accorded me even though I could barely cardio tune\nFor many years I was known as a month I shaved my head in war robes and got up very early I hated to everyone but I acted generously and no one found me out\nMy reputation as a ladies' man was a joke it caused me to laugh bitterly through the ten thousand nights I spent a loan\nFrom a third storey window above the puck deport you gal I've watched the snow come down all day as usual there is no one here they're never is\nMercifully the inter conversation is canceled by the white noise of winter I Am neither the mind the intellect nor the silent voice within that's also castles\nAnd now gentle reader in what name in whose name do you come to Idaho with me in these luggage she already has had twins realms of aimless privacy\nI think that palm Adam gets a little ... where you were talking about the connection of your father writing in solitude and demeanor re reading alone in as entering his [laughter] entering his solitude yeah as\nYou noted also a kind of humor you know I mean they have that I remember I Love one of his lines where he says uh feel so good not to love you like I did\nThe idol with me in these luxurious and twin ... realms of aimless privacy\nI think that home and um get so little about what you were talking about the connection of your father writing in solitude and the reader ... reading alone and has entering his entering his solitude yeah\nAs you noted also kind of humor you know ... ... ... one of his lines where he says a few so good to love you like I did it's like the tour away my blindfolded and said we're going to let this prisoner live close to those hilarious\nMy guest is Adam Cohen he's written a forward to a new collection of previously unpublished writings and drawings by his father Leonard Cohen\nAfter a break and we'll talk about how after his parents divorced when he was a child his father managed to stay in his life even though at him and his mother had moved to the south of France\nI'm Terry Gross and this is fresh air\n[noise]\nIf if the euro [noise]\nMm vastly\nNo Mm\nMm\nMm [noise]\n... our family foundation supports WHYY fresh air and its commitment to sharing ideas and encouraging meaningful conversation support for NPR comes from this station and from math named him committed to changing lives through math by building math achievement problem solving and critical thinking skills\nFor thousands of students every day in nine hundred franchise locations math ... dot com slash NPR's and from logged me and makers have go to meeting the collaboration meeting platform that\nSense of like ... ... the devotion of its fans to him and his devotion to the music and see the same as the larger\nAnd he ended it with what struck me as a benediction and I forget exactly what he said but you know to those of you who are going home to your family's enjoy your family's in to those of you who live alone\nEnjoying their solitude and I thought like people don't say that that's such a beautiful thing to say such a lovely way of sending people home and sending home people who are going home alone in July your solitaire\nYeah maybe songs find you and your solitude and so I mean the blood ... actually the the exact quote has made the blessings find you\nAnd he ended up with what struck me as a benediction and I forget exactly what he said but you know to those of you who are going home you know to your family's enjoy your family's in to those of you who live alone\nEnjoy your solitude and I thought like people don't say that that's such a beautiful thing to say such a lovely way of sending people home and sending home people who are going home alone enjoy your solitaire\nYeah maybe songs find you and your solitude yeah that's right and there's a ... actually be the exact quote as many blessings find you and your so I thought that was just beautiful\nWell this is a man who has he says and you've you've just played it well you know although we had a reputation as a ladies' man you know use of degrees to use it to ten thousand nights he spent alone you understood something about so to\nLet me re introduce you if you're just joining us my guest is Adam ... he's the son of the late Leonard Cohen and there's a new collection of Leonard ... owns a final homes lyrics and drawings and notebook entries previously unpublished and it's called the flame and Adam wrote the introduction to it\nI'm going to take a short break and then we'll be right back this fresh air\nSupport for Ninety One point five K. R. D. C. comes from our listeners and from local organizations who want to reach a discerning audience that values quality [noise]\nMarketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop in their business as support their nonprofit and buy tickets to their shows [noise] to learn more about corporate support and called genetic seven one nine four seven or eight year old ...\n...\nSupport for NPR comes from this station and from a law firm yellow meeting with also\nLives in the U.S Europe and China\nCooley advisors entrepreneur investor financial institution and established companies around the world where innovation meets belong\nAnd from PBS with circuit American Experience explores the rise and fall of the big dominant edits influence on entertainment in the U.S the circus\nTonight event premieres tonight at nine eight central on PBS\nIs fresh air and if you're just joining us my guest is Adam Cohen and he's the son of Leonard Cohen and now there's a new collection of Leonard cones final lyrics homes notebook injuries\nInnovation means belong\nAnd from PBS with surrogate American Experience explores the rise and fall of the big town and its influence on entertainment in the U.S the circus tonight event premieres tonight at nine eight central on PBS\nThis is fresh air and if you're just joining us my guest is Adam Cohen and he's the son of Leonard Cohen and now there's a new collection of Leonard cones\nFinal lyrics homes notebook injuries and drawings and these are all collected in the new book the flame and Adam Cohen wrote the introduction to it\nSo you were born in Nineteen Seventy to some of your father's most famous songs are already written in recorded by the time you were born Suzanne selling Marion here that's in a way to say goodbye burn on a wire Chelsea hotel who by fire I'm so did you hear him or he didn't he didn't meet me [laughter]\nDid you hear a lot when you were growing up I mean it's like when I was growing up I thought about songs and singers\nBut I didn't think about songwriters you know I just thought about like\nWhat's the sun and who's singing at ... um but but you were you at your father was a song writer she must have had an awareness that song writing craft at something people actually did and you must have been like grown up with these songs I don't know if he played them around the house I don't know if even heard them when you were you\nKnow of course I heard them you know I I I was a five year old on the side of stages watching them being performed a foreign looking out into the looking at it the faces of of audiences or you know in in different times and places\nAnd um I was a deep deep admirer of the melodies of at first you know as a child just the melodies the generosity of the melodies and then as I grew older [noise] there was the complexities and the beautiful marshalling of language and um\nAnd you grow older than you than you sort of see I remember um I remember I myself was making a record at the time and it's scripted and I asked my father for council is a dead you know maybe maybe I really got to talk to you I got to pick your brain\nWhen we were sitting on the corner Wilshire and ...\nAnd I confess to him that I was going to scrap this entire record and was expecting him to put his hand on my shoulder and say like that's my boy you know how true is tucked values don't never stop continue refining but instead he turned to me and said\nUm I remember\nI myself I was making a record at the time and I grabbed it and I asked my father for counsel I said dad you know meet me me me I really got to talk to you I got to pick your brain and we were sitting on the corner Wilshire and ... and I confess to him that I was going to scrap this entire record\nAnd was expecting him to put his hand on my shoulder and say like that's my boy you know altruistic values don't never stop continue refining but instead he turned to me and said man you scrap your record that's an amateur move\nSaid amateur move he said yeah it's not about how you feel about the record it's how the songs make them feel\nAnd\nAt that moment I realized that um\nThe love I had always had for his material wasn't just about their construction but I was also about their intention out he was holding up this baton that\nHe had been given\nBy the love he had for the people who came before him and he was holding it up and [noise] and something about the canon of his work that has always maintained that uh that baton off the ground [noise] do you and your parents separated\nUm five six and ... the don't remember how much did you get to see a father after that\nI'm In a relationship now and the imperfection of\nA union between two people ... has been demonstrated to me in vivid colors and dimensions and the fact that my father was able to stay in his children's life despite those complications and then some a was a remarkable is remarkable to me\nUm I my mother moved\nSister and I ... to across the world many occasions and not just to get away from him in fact not to get away from him at all but just to follow our own whims and uh my father would often even\nPark a caravan I'm at the end of a dirt road just to be near us um he he's always been part of our lives\nVeto he's he always maintained a role um in in our life despite my parents' separation\n... like a mobile home [noise]\nOh yeah the liquid he called it was like a like a jets\nMany occasions and not just to get away from him in fact not to get away from him at all but just to follow her own whims and my father would often even park a caravan I'm at the end of a dirt road just to be near us um he's always been part of our lives\nYou know he's he always maintained a role um in in our life despite my parents' separation\n... like a mobile home [noise]\nOh yeah the look what do you call those like a like a jet stream kind of thing mhm\nOkay yeah I remember my mother moved my sister and I all the way to south of France where we lived\nIn the long dirt road and he bought one of these sort of care of and jet stream type things are put at the at the tea where the road and met the dirt road and you just lived there my mother didn't want him on the property so uh you know every day after school bus would drop us off we'd see dead\nIn his care of and\nHow is it that far\nWell he did that and variations of that through my own entire life and and you know as I say the the the intent to be part of his children's live um the deliberate this with which he\nContorted his own life and schedule to to make sure that he was present in our lives was ... feet\nThere's something really terrible that happened to you and then it in its own way as maybe responsible\nFor the revival of his career and for for um his reconnection to people um I ... around the world and that's that um he had an accountant or a business manager who like drain\nYour father savings and sold the publishing rights to your father son that's kinda like stealing his soul to sell all the publishing rights to his songs I mean that just seems like such a transgression um and like I think your sister who discovered that had happened like if I didn't even know\n[noise] [noise] yeah you know\nHe often joked it is hilarious that he thought he could resolve his economic woes with song and poetry um in incredible that [laughter]\nThat with the canon of his work with his devotion to blanketing pages and melody that that he built the life he built for himself and um when you experience\nAnd like I think your sister who discovered that had happened like if I didn't even know\n[noise] [noise] yeah you know\nAs he often joked it is hilarious that he thought he could resolve his economic woes with a song and poetry um been incredible the [laughter]\nThe to the canon of his work with his devotion to blanketing pages and melody that that he built the life he built for himself and um when you experience this uh this episode that you're referring to it actually did compel him back\nOut of retirement back onto the road and that is where it was part of what I refer to as the most sort of joy is an unexpected um episode of his life which was to to discover that all this time ... made the heart grow fonder who knew\nHe'd always benefited from this kind of iconic status you know people that Kurt Cobain and and others you know would quote him and um but it didn't result in the kind of mass appeal\nAnd lo and behold from this economic crisis a rose this most unexpected in\nFestive of periods in his life I Want to say festive I mean it was incredible to see the um\nThe amount of universities that suddenly started teaching is works uh studying as works or even read the whole rabbinical clan adopting his lyrics says liturgy um\nMadison Square garden in the ... to you know twenty thousand cedars suddenly being feel they have never sold more than six thousand tickets", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Colorado Springs", "day": "08"}