{"month": "10", "state": "CO", "station": "KRCC", "content": "Marketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop in their businesses support their nonprofit and buy tickets there shows to learn more about corporate support and called genetic seven one nine four seven or eight zero wow\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado State university global campus in online State University offering career development through bachelor's degrees master's degrees an certificates of completion more it's cs you global dot edu\nThis was southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs ... you see see law hunter PCC of structural M. T. W. CCF them woodland park\n\nFrom WHYY in Philadelphia and Terry Gross with\nW CCF them would import\n\nFrom WHYY in Philadelphia and Terry Gross with fresh air today how terrorists governments political campaigns even street gangs are using social media to push propaganda and disinformation and fear\nWith real world consequences which helped with the W. singer and Emerson working authors of like war the weaponization of social media\nDo explain how fake social media accounts and boss masquerading as humans hijacked social networks algorithms push messages into news feeds and make them go viral\nAbout one third of the online conversation related to ... or these artificial voices even just a couple of months ago the Mexican election same percentage and of course they played a huge impact on the American twenty sixteen to watch and many people think it's going to do the same in the upcoming vote\nAnd John Powers reviews the new movie based on the story of the ... eleven terrorist attack on a summer camp in Norway [noise]\nFirst news\nLive from NPR News in Washington I'm Laurie London one of the top us diplomats is stepping down NPR's Scott Horsley reports UN ambassador Nikki Haley has announced she'll be leaving her post by years and\nHe was announcement coffee international community by surprise although President Trump says it's been the works for months say we offered no specific explanation for the move except to say she needs a break after six years as governor of South Carolina and nearly to represent us before the United nations\nI'm a believer in term limits I think you have to be self was enough to know when you step aside and someone else to do the job\nTrump praised Haley's work at the un and said he hope she'll return to the administration in some other capacity you said there are many good candidates to fill the un position and suggested he might name a successor for Haley in as little as two weeks Scott Horsley NPR News the White House\nThe national Hurricane Center says hurricane Michael has top sustained winds of one hundred and ten miles per hour and continues to get stronger as it moves toward Florida's Gulf Coast NPR's Windsor Johnston reports the storm is expected to make landfall tomorrow\nResidents in the path of the storm are boarding their homes and preparing to evacuate federal emergency management agency spokesperson jet fired says Michael bring a life threatening storm surges and all warnings should be taken seriously\nThe main thing that we asked you to do is to evacuated fast\nThreatening storm surges and all warnings should be taken seriously\nThe main thing that we asked you to do is to evacuated asked to do so that is the most important role you can play a to protect yourself but also to protect the lives of our first responders we asked if you do not put the our first responders in harm's way of if they have to come and try to rescue and you've been asked to evacuate\nForecasters say Michael is expected to make landfall on Wednesday states of emergency had been declared in thirty five Florida counties Windsor Johnston NPR News\nJournalists are protesting across Pakistan to demand an end to harassment and censorship\nProtests come after a prominent columnist was forced to attend court hearings and a case involving treason allegations against him\nNPR's ... reports from Islam about the protests follow growing concerns that journalists are engaging in self censorship\nBecause they all their media outlets have received threats to ... reporting critical of Pakistan's security forces most recently a lawyer demanded investigation against a prominent Pakistani columnist he's seeking to have in charge this edition activists say the case of sending a message to other reporters to behave\nIt also comes at a time when journalists across the globe face increasing danger and censorship from dictatorships unhappy with their reporting\nOn Wall street stocks are wavering as investors absorbed the shakeout from rising interest rates the Dow is down thirty four points the S. and P. five hundred off one this is NPR\n\nI'm Ryan ... and this is an ... rock to overnight [noise]\nToday in Nineteen Seventy six Walter Murphy's album a fifth of Beethoven number one Nineteen weeks after it was first released by this New York city native in Manhattan school of graduate at the time Murphy to separate your career primarily as a jingle writer\nAnd working for film and television shows like the show was Johnny Carson and the show was for\nVery keen Seventy four [noise]\nThe clever title they punch in which Beethoven's fifth symphony is reframe as a measure of alcohol\nCertainly contributed to success but so to to the fact that it landed in the right place at the right time beer after hit number one for the Beethoven appeared in the Nineteen Seventy seven blockbuster film Saturday Night fever\nThat landed in the right place at the right time beer after hit number one for the Beethoven appeared in the Nineteen Seventy seven blockbuster film Saturday Night fever during John Travolta as a working class Brooklyn I can find solace and success in his local dance clubs\nAnd all I work on my hair long time and you hit it\nIs just my head the Saturday Night fever soundtrack stayed on the billboard charts for a hundred and twenty weeks and we're starting um Fifteen times [noise] eventually this album including a fifth of Beethoven was placed on the national recording registry in the library of Congress\n[noise]\nAlthough Murphy would release other disco arrangements for classical works nothing else hit quite like the fifth of each other [noise] and the rest as they say is history [noise]\n\nIn\nMy life has brought you buy wrench food to direct emphasizing the importance of knowing where food comes from how it is produced and how far the travel locally produced food available at the ranch direct to store the twelve twenty eight piecemeal more an online at a ranch rude to direct dot com\nNinety One point five K. R. C. C. and Dr Laura ... have created the legacy find to help thoughtful generous listeners to fill their philanthropic goals of ensuring public radio for future generations please consider the K. R. C. C. legacy find when thinking about your state planning\nYour legacy gift will help Ninety One point five K. R. C. C. provide programming that informs educates entertains entered riches southern Colorado for years to come\nMore at K. R. C. C. dot org\nThis is fresh air and Terry Gross\nThe New York times just reported that in twenty sixteen Rick Gates then deputy campaign manager for Donald Trump\nRequested proposals from an Israeli company to create fake online identities and use social media manipulation helped defeat Trump's rivals for the Republican nomination in the primary and Hillary Clinton and the general election\nThe proposals were apparently never acted on\nBut we know that Russian operatives made effective use of Facebook and Twitter and seeking to influence the twenty sixteen presidential campaign\nOur country is hardly the only one in which political opinions have been manipulated by millions of fake social media accounts promoting messages that are slanted or even made up our guest today\nKenyans had been manipulated by millions of fake social media accounts promoting messages that are slanted or even made up I guess today pi Wu singer and Emerson working say that social media has also been weaponized in ways that most of us remain unaware of\nLike feeling popular uprisings and affecting the course of military campaigns\nFor instance when the Israeli Army moved into Gaza and twenty twelve the operation was supported by a viral marketing campaign\nVW saying there as a strategist at New America a consultant for the U.S military and intelligence community\nThe author of several books Emerson T booking writes about conflict and social media and was recently a research fellow at the council on Foreign Relations ... Dave Davies spoke to them about their new book like war the weaponization of social media\nWill pi Wu sooner and Emerson broken welcome to fresh air you know we we all know that social media have become a big tool in politics but you write in this book that it can affect not just opinions and reputations but the course of war and you cite a fascinating example a new rapid communications medium\nTransforming a military offensive is was the German invasion of France whatever\nSo you had this new technology that are connected everything from tanks to airplanes or to the broader population is wireless communication and\nRadio proved to be the secret sauce so to speak for everything from the political changes or the rise of Nazi ism goals uh said that it wouldn't have been possible what they did without the radio but it also Hodge strategic tactical military impact\nOr when the Germans invades France and invasion that most people didn't at the time I didn't think would work\nIt not only allows them to connect all their military units in a new manner allow him to coordinate and move faster than ever before but it also connected back into the enemy population and it spread a contagion of fear\nI Believe it's tens of millions this is a gradually escalating process with a couple of different companies that are doing this piecemeal but it's the stated intent of the Chinese\nThere's a gradually escalating process with a couple of different companies that are doing this piecemeal but it's the stated intent of the Chinese Communist party that this will be a unitary score in place for every Chinese internet user of which there about eight hundred million by the year twenty twenty\nWell the other fascinating story you tell about China is they realize how commentary on social media can affect opinion and so they have ... and a large army people whose job it is to comment favorably on the government policies right\nThat's right and it is a very large army I started out in the tens of thousands moved to the hundreds of thousands and now one estimate has it as high as three million of these are folks who are known as part of the the fifty cent army\nAnd their job uh and it it has its own training programs in a credit station systems their job is to monitor and infiltrate political conversations on we chat another Chinese platforms and basically cede positive things about the Chinese government\nEmerson Brooklyn writes about conflict in social media he was recently a research fellow at the council on Foreign Relations ... W singer is a strategist at New America at a consultant to the U.S military and intelligence community their new book is called like war the weaponization of social media\nWill continue our conversation in just a moment this is fresh air\nIf you're a new day area or just a little forgetful and you'd like to know when your favorite program airs Ninety One point I Can't see it at our website you'll find daily and we have an guys that are that\nThe community partnership for child development invites you to meet the tooth fairy and learn about the importance of good early moral health habits that event coming up October twentieth in\nColorado Springs more information on our community counter link to receive that orange ...\nThis is fresh air and we're speaking with the W. singer a strategist at New America and a consultant to the U.S military and intelligence community also with Emmerson broken he writes about conflict and social media their new book is called like war the weaponization of social media\nYou look at the Israeli incursions into the Gaza Strip and its battles with Hamas and you write that the Israeli military efforts were accompanied by a viral online marketing campaign and they were hip to the importance of this what do they do so\nTerry efforts were accompanied by a viral online\nMarketing campaign and they were hip to the importance of this what did they do so it was actually a the twenty twelve pillar of defense operation a eight days of Israeli airstrikes that drew Peter myself to this subject originally and got us researching it ever since [noise]\nUh this military campaign was accompanied by a remarkable online viral marketing campaign the campaign in twenty twelve opens with the assassination of a high level Amoss militant\nThat's not particularly unusual but is it what is unusual is that the drone strike video was up within a few hours and the official Twitter account of the Israeli defense forces was broadcasting it out again and again\nIn time a Hamas Twitter proxies respond threatening war and how far\nAnd is the operation commenced as Israel would strike particular targets it would\nPut out information about what had been done about the the weapons caches that have been recovered then Hamas would respond in a similarly taunting manner\nAnd what's important is that this wasn't just the social media operatives of these two sides but also millions and millions of Twitter messages exchanged back and forth by the the ... of one side or another ten million and all and the first twenty twelve conflict Ninety percent of which were outside the region\nAnd this was an example of a limited military campaign that nonetheless was a global war for public opinion and this set a model that we're starting to see a in all future conflicts\nAnd two things stand out about it the first is that we could all participate it was people outside the region or deciding whose message went viral who's a side of the story was winning out\nBut importantly it was not just winning out on line when it was also affecting the real battlefield decisions when you go back and map out\nThe ah targeting by Israeli airstrikes and the pace of them\nEssentially they changed by almost half dependent on which side was winning out on line so it was happening is that the politicians and the generals were making battlefield decisions while watching what was playing out on their smartphones reflecting what you and I were clicking on\nYou know you make the point again that scale matters\nWhile watching what was playing out on their smartphones reflecting what you and I were clicking on\nYou know you make the point again that scale matters if you put put up a an effective post on Twitter or Facebook or Instagram that's one thing\nIf you have an army of people organized to re tweeted and magnify its effect that's all the more important ... did the Israelis anticipate this and have their own Qadri of social media users ready to to give their their message more residents\nSo originally the Israeli military is not ready for this whole space and they're quite taken aback by a\nHow they're losing this bottle of narrative but with very real physical and political effects\nAnd like any other military they learn they reorganized and they reorganized and everything from uh creating new military units\nAre in fact one of the fund a images that you can see a line is how they've changed their recruiting to let young Israelis know that you can do your military service by serving in one of these new units that tries to affect the online battle a instead of you know carrying a gun you can be using Internet means and the like\nBut it's also woven into the broader population for example they create a organizations within a Israeli universities where not only Israeli students but students from around the world\nCan participate in this battle a narrative to they have created apps that allow you and I to download them and serve at the cost and you know gain badges and the like\nAnd in many ways what Israel is done has created a model for other militaries around the world that are looking at this and saying maybe we need to engage in this kind of reorganization too and you see it everywhere from ah Europe to some discussion within the U.S military\nSo so you can in enlist in an online army and get you know what badges promotions\nSame way that you can enlist in\nTaylor Swift or army of swift ease you can enlist in the Israeli defense forces on line army the uh cause may not be the same\nBut the tactics are and by contrast with the Israeli approach which is fairly centralized you know giving you a mission giving a set of messages to push\nThe Amoss one poll from the world at at crowd sources so to speak and one of the other tools of the trade what are the tricks that used in these but also in political campaigns to marketing is basically to find out what's trending elsewhere and try and try and ...\nWhat are the tricks that used in these but also in political campaigns to marketing is basically to find out what's trending elsewhere and try and try and later on to it so for example or you had the ice bucket challenge a couple of years ago where we were all you know drawing attention to ourselves as a way to fundraise\nFor a disease research this was woven into the battlefield where people were doing the ice bucket challenge but using rubble after Israeli airstrikes\nYou would put rubble on your head you would port rubble on your head and then the image would go viral and it was a way of kind of hijacking one discussion\nTo drive it through your own ends the same way that ISIS for example would hijacked discussion about a hash tag World Cup and jumped into it to the same way that Trump's online army would try and hijacked discussion that was trending for Hillary or the like\nWe're listening to the interview fresh air is Dave Davies recorded with the W. singer and Emerson working authors of the new book like war the weaponization of social media\nDoes talk about social media in political campaigns after a break and John Powers will review the new film twenty two July based on the story of a terrorist attack on a summer camp in Norway in two thousand eleven\nI'm Terry Gross and this is fresh air\n\n\nThan you've our family foundation supports WHYY fresh air and its commitment to sharing ideas and encouraging meaningful conversation\nSupport for NPR comes from the station and from love me in makers of go to meeting the collaboration meeting platform that comes equipped with the church to help people stay focused to get work done\nAnd learn more it go to meeting dot com\nAnd from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs major\nRemodeled homeowners can read reviews of local pros and book appointments on line at home at visor dot com\nSouthern Colorado's NPR station Ninety One point five two years\nPoints on line at home advisor dot com\nSouthern Colorado's NPR station Ninety One point five to ... you can be with you wherever you go all you need is your smartphone download the free Ninety One point five two years cc mobile apps like Google Flu or the tunes app store\nEmmerson broken writes about conflict and social media ... W singer is a strategist at the New America their new book is called like war the weaponization of social media will continue our conversation after a short break this is fresh air\nMore and more people are getting their news on mobile devices in through social media in Ninety One point five he ... he doesn't have to be any different missed this morning and you can find it on our website getting out of your car but went to keep listening to all things considered download the mobile apps need info on a local story impacting your community\nFollowers on Twitter feel like passing along that NPR story Mike is on faith on the news never stop neither do I knew when we find pay our\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one inning\nAnd from cancer treatment centers of America a comprehensive cancer\nCare network offering patience personalized treatment plans including integrative therapies for maintaining quality of life during treatment more at Cancer Center dot com\nThis is fresh air when we're speaking with Emmerson broken he writes about conflict and social media was recently a research fellow at the council on Foreign Relations also with us ... W singer strategist at New America at a consultant to the U.S military and intelligence community their new book is called like war the weaponization of social media\n[noise] you know I'm interested in your sense of how um social media wars affected opinions about the um cabinet confirmation controversy I mean this was a case where there were facts in dispute a lot of strongly held opinions do you have any sense of\nHim they must have been social media campaigns what kind of impact they had on how this was perceived and you know the enduring impact it'll have\nAnd they must have been social media campaigns what kind of impact they had on how this was perceived and you know the enduring impact it'll have on our discourse\nIf you were watching your social media feeds during the comment on hearing in many ways that felt like a war going back and forth and\nUh it was in a certain way you had both sides using the exact same tactics of you know what we call like war that military were using all around the world you could see everything from\nOpen source intelligence gathering campaigns where ah they were enlisting the online crowd to find bits of information to bring it together\nAnd they wouldn't have previously been possible or so for example on one side you had a crowd sourced hunt using images from Washington National baseball games to try and figure out who sat next to Kavanaugh to a unpack this strange story of his two hundred thousand dollars in a baseball ticket that\nThen you got the other side this combination of a Google Earth images and Zillow real estate data to basically push this narrative uh the ... or narratives that a doctor for a the claim was well she's not a liar but she's confused about who it was\nNow that narrative that was pushed on line points to a second thing that played out\nThe spread of disinformation\nThe spread of alternative theories the idea of bearing the truth underneath a sea of lies it's something that for example Russia's specialized and\nAnd again you saw both sides engaging in this in the cabinet debate Bush you know all sorts of different false stories false persona as in the like and the battle to have their own narrative went out and the other side's narrative be buried underneath as you even saw attempts to change not just your point of view\nBut history itself or at least the online place that we go to a stylish and learn about history we compete ya so for example in the book where the story of how after the Russian shoot down an airliner over Ukraine Russian actors go under what competed very quickly to change the story to make it seemed like they weren't involved\nThe same thing played out during the ... hearing where ah he used the term I'm In is a high school yearbook that was sexual term and during his hearing he says no no no no it's not a sexual term it's about a drinking game the problem for him is that there's literally no\nIt was sexual term and during his hearing he says no no no it's not a sexual term it's about drinking game the problem for him is that there's literally no evidence on the entire Internet of that being a drinking game\nUntil someone within the house of representatives again everything is out in the open so we can geo located to that\nDuring the middle of the hearing someone in the house of representatives goes to create the evidence on week at the DEA to make it seem as if he is telling the truth so you have this back and forth back and forth\nAnd it's our contention that every single political debate moving forward is going to see these kind of tactics utilized again because both sides not only use them but believe that they were the key to their effort including in winning\n[noise] you're right that the social media platforms\nAre private companies are and they're now coming to terms with the fact that they play like it or not a very powerful role in elections and the national discourse and have to take some responsibility for dealing with this content which is a huge challenge just because of the sheer volume\nBillions of posts a day and you know the subtle task of of figuring out what is acceptable and what is not um\nAnd that there is a developing tool called neural networks explain what they are what they can do\nNeural networks is part of this larger ah area of research that people talk about is essentially artificial intelligence\nOr using machines to not just mimic but maybe in some ways surpass I'm human intelligence and thinking and so neural networks can be used or like any other technology for both good and bad or so for example they can um\nCreate a wonderful imagery in scenes or images of a volcano that doesn't exist in the real world\nUm and it's very powerful and use of ... for example or the future of marketing a it's going to move into areas ah like customer service um the company see this also as a way to save money or for example if you're interacting with a machine rather than someone behind a help desk\nBut like everything else it's also going to be weaponized and so those very same I chat box for example that might be trying to persuade you to buy a product might be trying to persuade you to vote in a certain way or I'm a convince someone to take a certain position\nIt might be trying to persuade you to vote in a certain way or I'm a convince someone to take a certain position on a war a certain way\nTo challenge also moved into visual imagery there was an area known as deep fakes these are hyper realistic images um videos for example of speeches that politicians never made it seems that never happened and so\nWith humans finding it harder and harder to figure out what is real or not the companies and turn are looking to artificial intelligence to help find it to help police their networks and so you get this strange but yet I'm kind of a wonderfully appropriate outcome\nThe origin of social networks are online where a bunch of scientists talking about science fiction that's where this all came from\nAnd now we have the science fiction like outcome emerging where you have to say I battling back and forth with us humans caught in the middle\nRight so so so these neural networks ... could be good at subtly detecting water robotic Twitter account might be in a way that would be hard for humans but they can also produce the picture of you know name somebody Joe Biden honoring some you know profane of committed something\nTo get real world examples of this there have already been creations of speeches that a rock Obama never gave\nOr there's other ones where you can lay are real and fake imagery together where for example it can be your facial expressions but you're controlling an online image of everything from an example Arnold Schwarzenegger\nTo ah George W. Bush basically anyone that you have enough data points on what their face looks like\nWhich by the way you can get off of Facebook\nYou can take that and meld together to allow you to a in essence create a fake seen of them saying or doing something and so just like everything else in this space it's going to be used for good for jokes for laughs it's gonna be monetize for for profit\nAnd it's also going to be weaponized\nEmerson broken ... W singer thanks so much for speaking with us\nWho should have thank you thank you\nThat'd be a senior and Emerson working are the authors of like war the weaponization of social media they spoke with fresh air is Dave Davies who is also WHYY senior reporter after a break John Powers will review the new film twenty two July based on this\nDavies who is also WHYY senior reporter after a break John Powers will review the new film twenty two July based on the story of a terrorist attack on a summer camp in Norway and two thousand eleven this is fresh air\nOn racket ball has the b._b._c. news out coming out today the far right candidate in Brazil's presidential election blames polling irregularities to stay here to kill an outright win in the first round of the news out team brings us the latest from Rio\nToday at one PM on one point five to your cc southern Colorado's NPR station [noise]\nEverybody this is the first this is Krista hello this is Michael Fried from spirit listened in Ninety One point five K. R. C. C. music seven pm to midnight seven nights a week", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Colorado Springs", "day": "09"}