{"month": "10", "state": "AZ", "station": "KAWC", "content": "Broadcasting from the Robert Hardy radio studio complex on the campus of Arizona western college were more than forty five years this is Katie WC Uma ... there'll be people are gr idi point nine of them and K. E. W. seed ...\nSunny skies and the forecast for humans Saturday but the high near eighty nine some south south west when the five to ten miles per hour mostly clear tonight but the low around sixty seven in Parker's sunny sky today yeah on your Ninety One light variable breeze with the fifty percent chance of showers in the evening mainly after eleven PM when gets up to twenty five miles per hour\n\nThis week says you take a look back over the years\nIngestion I'd like that and I think they did call in on the original sin\nReassemble the original panel to revisit our very first episode piloting spelled P. I. L. O. T. I'm Sorry I Can't give you points for that but\nWe've discovered that in twenty plus years some things have changed at all\nI'm not he wouldn't know that when\nWe weren't even tried to deconstruct out\nDon't know why and then there's the question\nIt's a retrospective it says you coming right up\n\nLive from NPR News in Washington on Barbara fine with less than two hours before the Senate roll call vote to confirm Supreme Court nominee Brett Kavanaugh opponents are not giving up\nWith less than two hours before the Senate roll call vote to confirm Supreme Court nominee Brett Kavanaugh opponents are not giving up [noise]\nProtesters outside the U.S Capitol building even though Kavanaugh is all but certain to win confirmation NPR's Scott Detrow notes that became evident yesterday\nWe had been tracking for key undecided senators all along and yesterday three of them said they would in the end vote for Kavanaugh that's Jeff Flake Susan Collins and Joe Manchin who's the only Democrat supporting him Lisa Murkowski ended up being the lone Republican opposing Kavanaugh's nomination\nThe final vote is scheduled for around three thirty that's after noon eastern time secretary of state Mike Pompeo is preparing for his fourth trip to pee on young to meet with North Korean leader Kim Jong on NPR's Anthony Kuhn reports from pale stopped in Japan Today along the way\nPalm pale met with his counterpart tomorrow kono and prime minister Shinzo Abe's in order to coordinate their positions on North Korea\nIn killing young Pompeo will try to arrange your time and place for a second summit between Kim Jong un and president Donald Trump the two sides remain deadlocked over the sequencing of steps leading to Pyongyang's nuclear disarmament\nNorth Korea has rejected us demands that it provided full inventory of its nuclear weapons programs\nSouth Korea meanwhile suggested the U.S signed a treaty formally ending the Korean War in exchange for North Korea closing its main nuclear plant Pompeo will stop and Beijing and so on his way back home to brief leaders in those capitals Anthony Kuhn NPR News Beijing\nFrench officials tell NPR China is detaining the head of the international police organization Interpol on suspicion of financial fraud and other charges manning hung way is where it was reported missing since late last month NPR's Eleanor Beardsley reports\nThe south China Morning post reported friday that sixty four year old ... home way was picked up by Chinese authorities when he arrived in Hong Kong in September\nAnd actually ... send them matter concerns French and Chinese authorities but in a later statement Interpol secretary general you're gonna stop\nSaid he wants an official response from Chinese authorities to address concerns ... wellbeing the French interior ministry has said it's free occupied by the situation and by the threats ... wife has received via social network than by telephone before\nBeing elected to Interpol in two thousand sixteen ... Hong way was vice minister of public security in China Eleanor Beardsley NPR News Paris\nRomanians are voting on a constitutional amendment that defines marriage as a union between a man and a woman it will prevent legislative attempts to legalize same sex marriage this is NPR\nPope Francis is ordering a thorough study of Vatican archives regarding former U.S arch bishop and cardinal Theodore ... who resigned amid sex abuse allegations\nThe probe is aimed at determining how my character advance through church ranks despite the long known accusations\nA Kansas painting bike unconventional artist Banksy sold for more than one point three million dollars that are supposed to be auction house in London last night and then suddenly and intentionally self destruct at the BBC Charlotte Gallagher has the story\nWith a balloon is one of the banks these past nine pizzas walk in the office recognizable graffiti style shows a young girl reaching towards a rat heart shaped balloon but moments after the ... hammer went down and alone founded and the ... she began dropping down\nReaching towards a rat heart shaped the leading the nine months after the ... kind of went down and unknown foundation and the ... she began dropping down the phrase into a hit and tried to ... buy gas thing as the peace is caught into tiny strip\nIs not he bought the picture and what did they weigh in on banks he's prank Banksy he's known cases that save on politically charged three taught pasted to maintenance on social media with the caption going going going\nThe b._b._c. Charlotte Gallagher first lady Melania Trump is wrapping up her for country African too or in Egypt she met today with Egyptian President Abdel Fattah el Sissi and his wife before heading to use it to visit the pyramids and the things in order to highlight us that preservation efforts there\nI'm Barbara Klein NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the logging meat is Brewing Company proud supporters of the tiny desk contest and working to help bans reach more ears through beers more at ... dot com and the corporation for public broadcasting\n\nAt eleven oh six you're listening to K. A. W. you'd see a eighty eight point nine of\nThe families library is celebrating pi read week with a ... contest and the viewing of a film adaptation it'll take place between Monday October he used to be Saturday October Thirteen at the family's library which is located at Seventy five north sixth avenue in families for more information you can contact us at ... ... six nine zero\nMm\nWelcome to says you a game of bluff and bluster words and when they do\nNow joined our panelists and your host this week they've so\nMartha's Vineyard Hebrew center in vineyard haven Massachusetts Welcome to says you a simple game with words played by two team the first of which sits stereo left the first thing you ever heard her say on says you in season one episode one round one was\nA this Carolyn Faye Fox [noise]\nIn season one episode one round one he can be heard saying first of all your questions wrong\nThen you don't believe in one\nEpisode one round one she can't be heard saying anything because her husband keeps interrupting her alliance [noise]\nToday by how 'bout Arnie damage regrets there during ... why do you want to know how long\nDo the right team to in season one episode one round one he can be heard and using there's an enormous number of holding hair Mr Tony ...\nSeason one episode one round one is the first time we ever hear her say no more sports questions from the neck bar and in season one episode one round one he's heard making the on refusal offer Francine I took the last one I think this is yours Mr Barry no luggage [noise]\nLeaders provided by ...\nWe had stayed in character I must\nAnd leadership provided by ...\nWe had stayed in character I must say up Barry is going to need our\nTeam Barry will be the captain and all of that really is true guys are game is played in five rounds correct answers are worth ten points or any fraction narrowed deemed inappropriate we always advise new listeners to grab a pen and paper that we've always done it\nBefore we begin it's worth noting as soon as you landmark today this is the first time in over four years but all six of our original panelists subset together nice to have you back in the old [noise]\nA frame\nEmail now ... a ... ram John\nJohn sometime Ryan [noise]\nDon't do it for that they can all take a vowel is a pretty fix Barry\nToni T. O. N. G. U. E. finger I don't know\nYou can all take a vowel is a pretty fix Barry\nToni T. O. N. G. U. E. finger\nI don't know rock to a very bad Delhi had [laughter]\n\n[laughter] is it fresh who knuckle\nHam ha I'm ... and tomato oh of course sandwich [noise] that that I\nStand with finger than when I get one of his voice\nSaying which handles damage tomato sandwich\nWith a scar thirty twenty nine\nArnie steamed just barely in the lead we go on to round to the contribution of WC a listener ed foster of ... in Massachusetts it's the first of the EU bluffing rounds played with the little musical help from our friends Zoe and John Zemin Arnie each person on your team will receive a card [noise]\nOne of those cards gives the actual definition of a real but unfamiliar word the poor souls who received the other two cards will have a few seconds to make up a definition on the spot good enough to fool berries team ten points are up for grabs to bury if he can spot the truth teller or do you Arnie if he kept\nA few moments musical enhanced to come up with a definition for the word mocks bunker M. O. S. S. B. U. N. K. E. R. mosques bunker so we in John [noise]\nNew season begins for all of us here at says you and this November as the mice that are migrating and the bears are hibernating\nSaddle up for Bozeman in village and he has to live shows tickets from Montana will be released this week you get yours before the snow begins to fall check on line for tickets and all the grisly details has always had says you dot net that's essay while yes Y. O. U. dot net\nFit you pause it for a few interest ...\nAs a woman named Jean and you're listening to says you you're on a WC we'd like to thank you for listening JD point non epidemic K. A. W. cheetah or\nIn observance of Hispanic heritage month to San Luis library will host or fifth annual our mission featuring the art work of local art is it continues through October Fifteen that's assemblies branch libraries and Seventy five north sixth avenue you can find further details you my library dot org\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and repaired publications in the world doing K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org this event made possible in part by a grant from Arizona humanities\nDo you blame it on base John's even on guitar Samara Oregon keyboards and rubbing salt on percussion and drums thank you so much guys for giving us a few moments with the word ... bunker MOSSAD B. U. N. K. E. R. let's go first to Carolyn months longer\nIt is maintenance man slang for stalled elevator filled with cubicle workers end an awkward silence\n[laughter] arches brother\nGot to go fix [noise]\n... and it gets pretty right than their [noise]\nAll right it's a stalled elevator or Arnie\nIt's like it's like if you're given a lemons make lemonade it's it's a it's a a fish in North America that I really couldn't sell because it really stinks to high heaven so it's been used for many years to make fertilizer and\nThen sometimes more oil's\nWhat oil had mile long oil you know make them away when I was I got it [laughter]\nI think the fish I sticky fish\nOr all the way you have what is the word leftover from the early days of ... you know cave exploration meaning a shoe caked with algae from exploring in the dark and damp\nMm algae cake [laughter]\n[laughter]\nWell there you have a very it's either a shoe caked with algae a stinky fish or a stalled elevator\nWhich one is it they all smell to me\nA for instance when you've been often a installed elevators do you have any idea\nTony and I are inclined to the stinking fish we are indeed\nYou're inclined to think that a mosque bunker is a fish that smells and could be used for fertilizer\nH H also more that is the only one which seems to have\nKind of relationship to the real world if you know what I mean it's all the others are so specifically attuned to a problem that I don't think\nYou'd find them in the dictionary I mean imagine one going along let's back the elevator that when we're not by her and the algae coverage you again I just think certain certain objects never get words because they're just not as significant\nEnough you know they don't get to make it as a book just dumping book she didn't address your up All right yeah\nWe will go with the army's definition that mosque bunker is a fish that smells bad but makes good fertilizer\nArnie ... they think that most bunkers a stinky fish wondering of thought that I just reporting what\nIs your guard say it is a North American fish [laughter] they're not very tasty kind of shed like mostly use for oil and fertilizer there's an interesting footnote on my car\nSays its origin is Dutch most likely this was the fish the Native Americans taught the pilgrims to plant with their crops not too far from here\nAre score now is thirty nine to thirty with berries team surging into the lead and please help me thank our hardworking scorekeeper today that's Terry's oh bell Williams\nAnd our score now is thirty nine to thirty with berries team surging into the lead and please help me thank our hardworking scorekeeper today that's Terry's oh bell Williams [noise]\nBut let's continue our around by round reconstruction of the very first episode of says you with a reprise of its third round which was a round up says who are ten points simply named the author of each of the following lesser known lines\nAnd fear not you should be able to work out the authorship from the style and substance\nCarolyn who wrote this your wig fits very well the ... armored looking at her with an expression of admiration it's the shape of your head as does it\nWell well right that sounds a British it's the shape of your head as does its assets awash that yes there is this Alice in wonderland who wrote it is the question Lewis Carol Carol [noise] you know\nThat is from through the looking glass and actually it's from a chapter there wasn't deleted nobody wanted to read about a wasp in a way to get it [laughter]\nTony who said this your vote your ... vote your ignorant vote your wasted vote put in an administration in Washington DC that has seen fit to pass every kind of legislation imaginable saving you until last then filibustering on top of that\nCould be Sinclair Lewis [noise] uh no it's not clear Lewis good guess is is is it from Mr Smith goes to Washington no is this a novel it's not a novel it's a speech\nIt was set in Nineteen\nSixty four is that how are you are oh well then it would be a a Goldwater perhaps\nNow would you like a hint of yes yeah\nIn that same speech he also said we want freedom now but we're not going to get it saying we shall overcome\nWe've got to fight all hung over there and I'm for it\nThere do you think the man\nSure sure I like that line up and I'm not sure you should use it no it is either a term of abuse for an uneducated or unsophisticated hasn't\nA short beak to South American bird or the offspring of a llama ended alpaca Arnie it's definitely one of those three up to you to choose you know this is ... this is now one of those situations where\nAs we've been doing the show for years and years and years and then Tony gives a definition and we all go what the ...\nEditor to give ... through right now\nI'm In you know to be here a lot of talk a lot of my pocket it could be you know a an aunt merging with 'em up where I don't know [laughter] you know if you get when you're\nMarried to a lion and a lamb ... Becker a lion\n[laughter]\nUm\nSo I agree with you I I really think all of us are likely to be huh animal of mixed heritage Karen ...\nWe're going to go with them I Want to\nTony they say that worry so is the offspring of a male and female alpaca\nShortly they ingest [laughter] what's your card say he says the offspring are male or female\n'cause it Tony is that in fact to ... where it is a catch ... and it's the only catch her word I can claim to know\nEach week our listeners write in hoping to hear nearly last but not gotten rounds from our earlier shows\nAccommodate the spotlight brown\nDenver on the chance to spend a little time would you create your writer and a long time hoped\nFor seven points pleased to find the following theatrical idioms an additional three points if by some miracle you can divine the derivation Carolyn\n... ... ... easy as a stripper yes well it comes from a I think it's the Greek for that shedding of skin by a snake\nWell ten or ... [noise]\nFor a for an additional point you know came up with it\nTen or ... [noise]\nFor a for an additional point you know came up with it do I know you have your own yeah she was the instigator but who actually coined the word ...\nNature that's exactly right in the Asia omega\nJuly Tony break a leg\nThey wish a that is bestowed upon every person before performance meaning hope you have a great show it's exactly um break a leg\nI think comes from a performance of mud bath every weird thing in the theaters seems to come from some bad performance of Macbeth or things went wrong including whistling not whistling before performance\nAnd uh I think it probably um it was a way of certainly away warding off a danger by you know\nNo that's the superstition that it ... it's like anything to do with the curtains no it isn't\nOriginally thought to have come from the concept of being so successful that one would come out for a curtain call and take such a low bending bell that the leg would literally break honey that's our any locally\nOkay she was a sharp Jupiter and the Buffalo Bills ... and the judge me to hit you target hit your mark yeah uh\nNo that's not in any any of the audience\nIt's a free ticket and uh resembling a ... which is punched resembling that the resembling any or police marksman ship trick of throwing a card in the air and having a ... call shot through it\nA little more Richard top banana well the top banana is\nThe star of the show is it not\nYou know the head of the second and he was laughing at was the funniest ... the main line comedian yesterday in a Mondale that's seven points and how we get and the derivation uh this is in dispute so you'll get points for almost any\n[laughter]\nWho is in dispute with the scholars a\nDollars and it's very simple studies this route scholars\nUh [laughter] the vaudeville players bananas because they were inexpensive backstage and the guy that was the funniest was able to take the first one a giver appoint for that show us I I have\nNever heard of that but it's worth it for us for that he was doled out the highest price that's another\nPoint for that 'cause that may represent corporate funding [noise]\nAny other guests ah before I had great appeal to influence yeah [noise]\n\nIt's origin is disputed but some sources say it comes from the old slip on the banana peel routine which always got the biggest laugh Paula Markey\nMarkey is is the ah is delighted sign outside of the reason that that that isn't letting the players and then\nThere was a mortgage him so [laughter]\nThat democracy referred to that and it's darn cats or the new kid on the block Markey mark [laughter]\nWell there's going to be some boys in the market means Maria where a well now you're on the ...\nHour ride it was considered noble to have your name in life yeah right oh give them their ten points as they\nYes actually it's a large tent or canopy in front of a theater with advertising lights indoor billing but it was originally a large field ten used by an officer of high rank or noble\nOr with advertising lights indoor billing but it was originally a large field ten used by an officer of high rank or noble stature such as say more questions\nAnd finally burying deus ex mocking\nGod from a machine\nIs the desert back now that means a sort of unexpected and somewhat mechanical resolution to the problems facing the characters in the play\nAnd it comes from and the ancient Greek practice up sometimes what they would do is they would actually lower ed God like figures from a crane like the bite onto the state that's exactly right\nNow back to the game at hand let's close our celebration of the says you origin story by revisiting the same game that closed our very first episode what's the difference contributions come from John sorrow Seattle and the hall of famer bill Spencer of copies bill Maryland\nCarolyn ... what's the difference between unexplainable an inexplicable\nAn unexplainable means that there is no explanation for it and it's like a bull means gosh that's amazing and complicated and complicated\nYou are split ... backward back were the other way around I don't know [laughter]\nWe believe we'd be zero one that route right [laughter] they both\nImply difficult to explain but unexplainable implies that the difficulty lies in the explaining not necessarily in the understanding inexplicable implies not likely ever to admit of any explanation\nFor example the thought processes of politicians are generally unexplainable those of the voters in ... Tony yes what's the difference between rules and regulations\nRules are the basics I you can call it back bone uh the structure of an organization regulations are the individual a specific um strictures on some specific kind of activity\nThat is what I thought as well and it turns out to have nothing whatsoever to\nDelegate rules are can be stated in just general or regulations require numbers [noise]\nThink like Roberts rules of orders and versus regulations about how you have to a foot in of a\nFire extinguisher stuff okay\nI'll think about it very long way there so I think also a a rule can be a an agreement about how something will\nProceed or how as something will be like the rules of the game like the rules of baseball robbers rules of order something that this is what we all play by\nA regulation is a set of requirements to impose on people\nThat are doing some activity or for instance in ... installing sprinklers to suppress fires you have to you have to play these regulations and meet these standards ... measurements maybe regulation wanna measurements one is an agreement the other is an imposition\nBy home the government thank you [noise]\nBoth sets of instructions but only regulations are legally binding regulations are authorized by legislatures set by governments and enforceable by law rules are just rules that's all right ten points for that Ernie and what's the difference between whatever and what so ever [noise]", "show_name": "Says You", "year": "2018", "city": "Yuma", "day": "06"}