{"month": "10", "state": "PA", "station": "WVYA", "content": "We'll translate ... point three and in east Strasburg in Ninety four point three you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nEvolved the road ... five hundred concerto but he poured his talent interject one for the cello mandolin on an ex Chicago Symphony orchestra programs mandolin Avi Avi town performed in\nClass heightened drum roll impending next time with the CFL I miss any I\nDid not attend on WB I Am [noise]\nMusic from St Stevens is made possible by donations from parishioners contributors in ... like you in addition music from St Stevens pretense lot year round concert at St Stevens Episcopal Church in downtown Wilkes Barre learn more at S. T. S. T. E. P. H. E. N. S. W. B. dot org\nToday on music from St Stevens we features selections from an October twenty Seventeen ... coral even song\nMass W. B. dot org today on music from St Stevens we features selections from an Tobar twenty Seventeen ... coral even saw\n... church in ... I Know a funky on the program music because I'm from Georgia and Karen I'm bored but first\nMusic I'm leaving the island was born in ... in October Eighteen Seventy he was nearly blind due to the general cataracts bought was nonetheless discovered to have a gift or music at an early age\nLater you would serve his teacher to them like ... ... ... and I both stumped I began to name a few\nIn Nineteen thirty one the governments of France made him without the legion of honor\nHe passed away at the Oregon oh giving his one thousand seven hundred fiftieth organ recital\n... no ... on June second Nineteen thirty snapping ... organist and choir master I think Steven performs the go round movement from symphony number two four or ... twenty oh see I'm now I'm W. B. I.\n[noise] Mm\nMm\n[noise]\n[noise]\nWhat\n\nMm\n\nWhat [noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\nNa\nToday on all the laws\nOf a law that was\nI'm a\n\nA\nWas the only thing or or\n\nOf\nA\nA man\nOr or on on on\nThe on off of the day and they're all\nAll of 'em yeah you're right you're on the line and\n\n\n\nNa na na\n\nDa\nDa da da da da\nNa na na\nI'm In ah\nOn um uh you\n...\n\n\n... [noise]\n\n\nNo I'm ... I'm going to come on I'm On the line\n...\n\n\nOn a\nA\nA\nA I'm\nA house\nSo [laughter] [noise]\nMm\n\nHim rejoice eat pure in heart on WB I ate before that an Anglican chat after Martin Luther ... to some forty six and an Anglican chat said Tucson twenty nine by George and ...\nWe also heard the him the day that gave this lord is ended a coral in Troy by Antoine Brooke near before that and we opened the program with the Koran movement from symphony number two for organ opus plenty of levy yeah\nWe've been listening to selections from an October twenty Seventeen festival coral even so I think Steven ... church in Wilkes Barre we hope you enjoy today's program but nobody would be I Am I'm Erika funky thank you for listening\n\nMusic from St Stevens is made possible by donations from parishioners contributors and listening to like you in addition music from St Stevens presents lied year round concerts at St Stevens Episcopal Church in downtown Wilkes Barre learn more an S. T. S. T. E. P. H. E. N. S. W. B. dot org\nThis was W ... not FM W. V. I. H. D. one scratching Wilkes Barre hateful to W. B. Y. eighty nine points that whatever Williamsport WTO eighty eight points ... Mansfield at like one of the ... W ... Ninety One point five FM ... township\nAnd translators W to walk to a G ... summit W to eight nine ... sundry W. twos zero seven eight Williamsport end up to Seventy eight wells borough listener supported public radio\n[noise]\n[noise] this is right below thank you for listening I Hope you'll join us for the next broadcast cuts or by the San Francisco [noise] this broadcast to the San Francisco symphony is made possible with the general support of friends\nIn the van and nasty Livingston of this ... foundation in memory of Ben and a Jess Shen said\n[noise]\nBut this is your arts and information station W. B. I. eighty nine point nine of them WB I aged ... Scranton Wilkes Barre Hazelden WTY gate eighty nine point seven F. M. W. B. Y. HD what Williamsport\nWTO eighty eight points out that ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live at W. V. I. A. dot org we're in Wales borrow at what a three point five listener supported public radio W. V. I. F.\nMusic from St Stevens who's made possible by donations from parishioners contributors in ... like you in addition music from St Stevens presents light year round concerts at St Stevens Episcopal Church in downtown ... learn more at S. T. S. T. E. P. H. E. N. S. W. B. dot\nOrg today on music from St Stevens we features selections from an October twenty Seventeen ... coral even saw him at St Stevens Episcopal Church in Brooks Perry I'm Erika funky on the program music because I'm from Georgia and Karen I'm more\nBut first music of Louisiana the animal was born in ... in October Eighteen Seventy he was nearly blind to congenital cataracts bought was nonetheless discovered to have a gift for music at an early age\nLater he would serve his teacher to the likes of Knoxville do play ... and I go down to the gate to name a few\nIn Nineteen thirty one the governments of France made him out of the legion of honor\nHe passed away at the Oregon giving his one thousand seven hundred fiftieth organ recital\n... no ... on June second Nineteen thirty seven ... organist and choir master a saint Stevens performs the go round movement from symphony number two for organ open twenty oh see I'm now I'm W the I\n...\nNo ...\n\n\nOoh\n...\n\n\n\n\nMm\n\n\n\n\nMm\nMm\n[noise]\n\n...\n\nMm Mm\n\n\n\n\n...\nNa na\nToday on some of them on the on\nOff a or the other day was\nI'm a\n\nOn a\nA friday or the\nOr the or\nThe or\nGoing on\nOf a\n\nOr or you know\nOff the ...\nAll of 'em ... na\n\n\nDa da da da\n\n\nDa da\nDa da\nDa da\nDa da da na na na ah\n\nMm\n\n... [noise]\n\n\nNo I'm ... I'm On the phone I'm On the line\n...\n\nI'm a\nUh\nUh\n[noise]\n\n\n[noise]\nMm\n\nThe him rejoice eat pure in heart on WB I ate before that and I think we can chat after Martin Luther ... to some forty six and an Anglican chat set to some twenty nine like Georgia and ...\nWe also heard the him the day that gave the lord is ended a coral in Troy by ... Brooke near before that and we opened the program with the ... movement from symphony number two for organ open twenty oh ...\nWe've been listening to selections from an October twenty Seventeen festival coral even so I think Steven ... church in Wilkes Barre we hope you enjoy today's program but nobody would be I I I'm Erika funky thank you for listening\n\nMusic from St Stevens is made possible by donations for parishioners contributors in the states like you in addition music from St Stevens presents light year round concerts at St Stevens Episcopal Church in downtown Wilkes Barre learn more an S. T. N. D. E. P. H. E. N. S. W. B. dot org\nThis is W. B. ... W. B. I. H. D. one scrap Wilkes Barre hateful to W. B. Y. eighty dollars point seven to Williamsport WTO eighty eight points ... Mansfield and W. P. or you know the one point five FM ... township streaming live at W. B. I. I. dot org\n... point three an east Strasburg ...\nAnd now the one point five FM Palmyra township streaming live at W. B. I. I. dot org we you're translating clocks dominant Ninety point three an east Strasburg in Ninety four point three you're arts and information station listener supported public radio W. V. I. S.\nProgramming on WB I have made possible by our members and by the box choir Bethlehem welcoming distinguished American peanuts Peter circuit to their annual concert gala his program includes box Goldberg Variations and Mozart sonata in B flat major Kate five Seventy ... be minor Kate five forty", "show_name": "Music from St. Stephen's", "year": "2018", "city": "Williamsport", "day": "21"}