{"month": "10", "state": "CA", "station": "KPCC", "content": "Source reporting project on surprise building it's called the bill of the month club you can learn more about that on ties are Health News is ... H. N. dot org\nRead I Wonder if you can answer a question from Bobby on Facebook who writes on the ballot measure in Massachusetts on the nurse to patient ratio\nThere's a direct correlation of patient nurse ratio and patient safety and outcomes this would reduce the patient stay with in the hospital because the nurses would be able to focus on recovery and education for them\nThere is a ballot measure in Massachusetts that kind of divided the health community in terms of whether hospitals should limit the number of patients that nurses can help\nCalifornia's the only other states passed a law like this can you just summer I've kind of what the core argument is here\nRight when this actually may be a a a discussion better left turn for next week on labor issues because this is all about a labor issue right the nurses unions in both California and ah and Massachusetts are\nVery powerful politically and by limiting the number of patients that any one nurse can handle a they are also expanding the number of nurses who need to be in hospitals and therefore\nA growing the pool I'm ... and therefore growing their union membership at at on the on the back end as well um this is the Massachusetts initiative and a separate initiative in California that has to do with\nThe amount of money that a kidney dialysis firms can ah can charge their patients are both part of a new\nA sort of avenue that a lot of public at a special interest groups including labor unions are taking\nWhich is to qualify something for the ballot in hopes of coming up with some sort of legislative compromise their central using the ballot measure as leverage to get what they want through the state legislature instead of on the ballot so the legislature will say All right we don't want to take all of these steps that you're proposing but we'll meet you're halfway and give you pretty much everything you want it in in the beginning\nBecause if you don't then we can arrange the votes to do it without\nExactly and and the measure in California was sponsored by the measure on on the kidney dialysis front was sponsored by state nurses' union which wants a leverage in this different fight about a\nRatios of nurses to a patient so fascinating power politics if you will in states where especially nurses unions play a huge role in state ...\nScott I Wonder if we should also be clear often with ballot initiatives you\nKnow uh sometimes there to write items law sometimes there are many states constitutions and if a ballot initiative gets to the constitution lawmakers catches pass a law through the legislative process to do it you kind of have to meet a constitutional amendment with an amendment so I guess we should be clear that depending on the item mistakes can vary\nYeah that's right but uh it it is interesting we're seeing a lot in recent years legislatures are fighting back against\nA voter approved ballot initiatives so we mentioned a governor ... in Maine earlier and er here in DC in fact um there was a paid leave measure that are that the voters approve that the council decided was unworkable so um [noise]\nUh it's not always the case that uh what the voters approve a ends up being the final word\nWe should note by the way the Massachusetts Governor Charlie Baker announced last week that he would vote no on this patient er nurse ratio item in Massachusetts noticed question one here's part of what governor Baker said\nI'm going to vote no because the health policy for a raise three issues that I was I'm frankly\nAre not aware of the first was the Massachusetts of higher earners division staffing ratio already in the state of California does the second was this woman and a nine hundred million dollars or\nIn the third was something I had heard from many of my colleagues in the community health care space that a mini community hospitals and nursing homes and even some rehab or whatever operational future wouldn't jeopardy lower\nMassachusetts Governor Charlie Baker let me get a few more frequent comments before we go ... razor tweeted as someone who is moot state to state multiple times in the last ten years I'm a huge advocate for Medicare for all moving is a pain and insurance makes it even worse\nJane tweeted ask your guests about the results of Medicaid expansion from the early states do states have had great results Julie I Wonder if you could respond Jane Wright quick\nUh yes most I mean it particularly hospitals are in states that have that we're serving a lot of uninsured patients and losing a lot of money now that his patients have Medicaid they're getting paid for 'em to it is most of the states that expanded Medicare Medicaid have seen a boost to their economy from doing it\nBefore we go Scott I Wonder what you think is around the corner like we're talking about these trends in care is there anything you think that's already actually any of the three of anything has flown under the radar that seems like it's heating up to be the next big fight in health care in states or are these kind of the core issues\nI think we've had a lot of the core issues um\nBut uh as we've as we've talked about I mean a politically speaking in the end with the midterms coming up everyone's focused on\nOn the politics of this health care has a proven to be a very potent issue again I mean certainly when you're Ford will CARE Act was passed a or that became law in two thousand nine I think many of us I certainly did figured oh well we're done with healthcare years of age uh we never seem to be done with the healthcare\nDebate ... the biggest thing I'm going to be watching in any legislature next year is the fight over single payer Medicare for all in California the state Senate passed it last year without a pay for it would have been hundreds of billions of dollars now it's going to go to the assembly it's just fascinating talking pull between sort of establishment Democrats and the liberal left\nAh it it's going to be the biggest fight in any state\nLegislature next year ... Wilson of the hill Julie Rovner of Kaiser Health news and Scott Greenberg state line thank you all for making time for us this hour was produced by Danielle nights and edited by ailing Humphrey to learn more about them and the rest of our staff visit the one eight dot org slash staff\nThis program comes to you from W. A. M. you part of American University in Washington distributed by NPR until we meet again I'm Joshua Johnson thanks for listening this is one egg [noise]\nSupport for NPR comes from this station and from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is available online at Carnegie dot org\nFrom the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller is working food health power jobs and resilience cities at rock found dot org and from the listeners support this NPR station\n[noise] good evening they fifty nine and you're listening to eighty nine point three K. P. C. C. K. P. C. sees\nThe frame is up next and then the daily from the New York times at ten o'clock fresh air with Terry Gross [noise]\n\nAnd it's a real ... sitting in for Tom powered Janet fears slaps on that level right out of Shakespeare's play and has dropped him into today's highland she'll tell me how we mixing of classic can add to the conversation about race in America that's coming up on cue\nFrom PR I public radio international tonight at eleven here on eighty nine point three K. P. C. C. [noise]\nBCC supporters include dignity health Southern California hospitals including Glendale memorial saint Mary in Long Beach Northridge hospital California hospital in downtown LA St bernadine and community hospital in San Bernardino their\nDoctors and nurses look for the healing effects of human kindness every day\nTo learn about emergency services hard care and healthy babies you can visit dignity health dot org slash so Cal dignity health\nHow low human kindness [noise]\nThis is eighty nine point three K BCC Pasadena Los Angeles and community service that Pasadena the comics offering lifelong learning with other fifty free nonprofit courses hoping to learn more at Pasadena dot\nYou ...\nFrom the moon broadcast center at gay PCC does the frame I'm John horn on today's show New York\nTimes columnist Jim route and bird unpacked the complicated relationship between Saudi Arabia and us media company then comedian ... draws from his experiences during the world as a Muslim American\nI find myself ever shows people from all different backgrounds young well how do you have to leave their celebrating it almost really excited to be a part of something new and fresh\nAnd some kids dream of playing music in a band Dieter rural dreamed of playing in Dodger Stadium all that coming up on the frame [noise]\nKatie cc supporters include ... studios presenting beautiful boy based on father and son in law was beautiful boy chronicles her family's\nExperience of survival relapse in recovery during Steve corral Timothy shallow made more in the army and Danny Ryan now playing\nLive from NPR News in Washington I'm neuron\nSecretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia he's expected to meet with the king to discuss the disappearance of Saudi writer ... who hasn't been seen in public since he entered the Saudi consulate in Istanbul, Turkey nearly two weeks ago\nIt verify the truck you know so basically all the positive things we've seen a early young what I call later budding authoritarian a new generation next generation leaders in the middle east\nWho promise are going to make change you just have to make sure the proof ends up being in the putting you can't get ahead of the rhetoric and in some cases some real action again you know the crown prince\nDid indeed Institute some change but what's beneath the surface what else is going on you know for instance\nHe allowed women to to drive that's a big deal yet feminine activists including some who are fighting for the right to drive or ... out at the same time because they kind of got out of that they they went a little too far or the regimes comfort so\nI think we all have to watch it you can't blame people for wanting to have hope uh by journalistically I think you just have to always stay grounded in what are the facts and and just look at the whole picture\nI think it's fair to say that the moral compass of Hollywood and media companies tends to swing away for morality and back toward money pretty quickly and even if a lot of companies not just media companies are pulling out of day both in the desert the big\nEvent in Riyadh coming up do you think this is going to last or is what's gonna happen what's happened in the past that everybody stops you know pauses and then ends up going back to be in business with people when countries like this\nI mean call me a cynic but I think if there's any fig leaf of a reason to get back involved and again what could be calm for Hollywood and I'm a top ten\nGlobal entertainment market I think they will find a way back in ... and the point in my column was that you didn't need\n... to disappear to have plenty of reasons to be very wary there are other things going on but will this be without being offered wanted from Russia [noise]\nGym route and bird as the media columnist for the New York times and the story keeps evolving taping that conversation William Morris endeavor announced that its canceling its\nPlans for a hundred million dollar deal the Saudi Government coming up comedian boa ... on the perils of being a Muslim comics in the deep south [noise]\n[noise] have you ever wanted to watch Larry mantle whose ... live foresee the studios will take you in the famous producer then join us on October twenty first for the Cape you see the community open house you can meet some of your feet Vicki PC the personalities and mingled with other public radio is it's fun for the whole family\nOr a C. P. A. K. C. C. C. dot org slash open house to receive a free\nKBC the swag bag when you were vice that KP sci fi though to slash open [noise]\nA record number of algae to Q. candidates are on the ballot this November we'll talk with three spanning different parties generations and parts of the country on the next all things considered from NPR News we dated for on eighty nine point three key PCC\nWho'd have recently I Need to have to live in restaurants in the arts district customized packages of hand costing him the smoking section wind suits and\nBe available for any patients Morehead E R B ...\nWelcome back to the frame I'm John horn thanks for joining us comedian mo armored didn't have what you would call a typical American childhood\nHis family fled to wait during the first Gulf War and settled in Houston as a refugee kid growing up in Texas and where the named Mohammad he learned early on that being funny could be a useful skill\nIn two thousand and five armored joined the Muslim American comedy group all made me funny founded by Brian preacher moss and author who's mon Amr later toured with Dave Chappelle who we should say converted to Islam in Nineteen Ninety eight\nAnd since ... didn't get US citizenship until two thousand nine much of his globe trotting was done with just a refugee travel document coincidentally and two thousand and sixteen right after Donald Trump was elected armor had a chance encounter with Eric Trump that went viral\nAll of these experiences show up in ... new Netflix special the vagabond when we talked about this special I asked ... how he transforms difficult moments from his life into comedy\nThe best stand up to me always comes from those types of situations so you know I started stamp of fourteen years old so for me it was always finding a way to to you know take something was very sad and and that has some very upsetting rarely used to it and make it funny and also that ah humanizes\nThe situation as I Do so so the ... I wasn't like necessarily intentional I mean it is but it was it and you know my intention is obviously to uh make people laugh but it's also as a form of a therapy for myself\nYou know it's not easy to endure such a\nHurdles in life and flee war and the end up in Houston and then towards the end up in the south the obviously nine eleven happened to two years and to me doing professional stand up and next thing you know I'm\nStill during the south and it's you know it's very very difficult but people are very very receptive to it uh they love it actually and and although that uh I go by Moscow and um I find myself after shows\nUh people from all different backgrounds young mom it from across the street like on a regular basis like my mom had leave they're celebrating it almost really excited to be a part of something new and fresh\nIn the Netflix special the vagabond you imitate a lot of regional and foreign accent I Want to play one from the special\nIt was like I said what do you walk by you every day you don't say nothing don't do nothing [noise]\nYou would change your view on people's [noise]\nI'm a liberal you're going to give birth to name what's your name wrong ... what's your name was like oh man my name is Mohammed he's like [noise]\n\n[noise] [laughter]\n\nAnd they were after the games are over um [noise] a play or for a few minutes posting to last night we lost and I played the way it is on the [noise] and sometimes they'll play under the Milky Way tonight by the church and I always ended with closing time [noise] [noise]\n\n[noise] definitely\nShow which there's pre planned elements like well no we're doing a ... Kevin descending break but that being said it is alive [noise] sporting event so there are things that you don't expect you to be ready for changes or [noise] delays or you know video reviews\nPush the game itself you know [noise]\nPrevious Oregon is here Nancy behalf where she told me that watch as a bit of advice she goes just whatever you do don't think\nThat's so true because I'll catch myself and if I Do if I hit a wrong key here there it's like it because I'm thinking but if I just let it go if I just go with what I feel that it just comes out the way it should I think\n[noise]\nI'm\nKind of a star wars nurse and you know there's a whole [noise] I'll be ... to Luke you know trust your feelings Luke it's so true\nYeah for the frame continue reading [noise]\n\nAnd that it's a frame on a Monday you can always get the show as a podcast available wherever you like to listen including spot by I tuned in the NPR One out we'll be back here on tape PCC tomorrow I'm John horn thanks for listening we'll see you there [noise]\n\nIs being a democratic senator in a red state becoming nearly impossible it really could be almost every one of them is a really skilled politician and they have mostly made the choices you would want a registered Democrat to make it Claire McCaskill can't get reelected in Missouri it's fair to ask\nWho can't I'm Michael Moore that's coming up on the dean from the New York times\nAnd the real ... sitting in for Tom powered Janet tears flooded out delo right out of Shakespeare's play and has dropped him into the day's highlights she'll tell me how we makes me a classic can after the conversation about race in America that's coming up on cue from P. R. I. public radio international tonight at eleven\nHere on eighty nine point three K BCC [noise]\nWe are it's a brand new season for live from here\nIt'd be Buckingham show [noise] [noise]\nYeah a\n\nNew season to live from here with Chris steely Saturday nights at seven eighty nine point three ...\nFrom the New York times I'm Michael Barbaro today [noise]\n\nWith the Democrats biting to reclaim control of both the house and that the house seems to be headed in one direction\nIt in the other three week out from election [noise] the state of the twenty Eighteen [noise]\n\nThe daily uh support it back of my when you shop a bank string video one line that's after my for\nTwenty years after my has been dedicated to helping the world's top brand delivered fast reliable and secure digital experience as to their customers on all devices I got my eight K. A. N. A. I. dot com\nAnd by ... bourbon handcrafted small that just for a full flavor tripping experience forty seven percent alcohol by volume he lied to crack Kentucky straight bourbon whiskey bar town Kentucky they wisely drink wisely\nHouse burn let's start with the house of representatives how many seats with Democrats need to win to take back the house\nSo majority in the house is two hundred and Eighteen seats Democrats are twenty three seats short of back older under a couple of vacant seats in the house right now they're just not occupied but if you assume that those seats go to the party that they always go to ... than Democrats need to pick up on top of that twenty three seats the Republicans currently hold\nAnd how many ... are actually in play\nIn the ... in the big picture you're looking at between sixty and Seventy seats which might not sound like a lot given that there were a hundred and thirty five or eight members of Congress but it's way more seats than I've actually been contested since two thousand town\nSo sixty Seventy congressional races are actively competitive in the ... Democrats need to win just twenty three of those\nIt means that they need to win about a third of the Republican held seat bitter contested\nAt this point but it's probably not as easy as it sounds Republicans have a lot of advantages in some of these states most of those sixty to Seventy ... or ... seats that didn't vote for Hillary Clinton and twenty sixteen their seats that voted at least a little bit for President Trump some of them a lot for President Trump\nAnd so you're talking about Democrats need to win pretty tough seats\nSo how many of these sixty or associates than are really in play rather than theoretically him play for Democrats\nThey're all employees to some degree or another but if we can do a little sort of back of the cocktail napkin math major I think we could say that Fifteen of them are probably going to lean solidly to the Democrats right now you bet on Democrats taking them over\nAnd maybe Fifteen of them are real reaches for the Democrats these are conservative seeds were Democrats or maybe put up an interesting candidate but\nAt the end of the day it's just really talked for them I Would look at sort of the middle thirty seats these are the seats that are going to determine whether Democrats take the majority and whether they take the majority by one seat or tendencies so what's the story of these dirty ...\nDo they all have something in common that makes them most in play this year sort of the most part you're looking at seats that are somewhat to the center right you're not looking at places where the president is hated you're looking at places where the president is sort of ... that there are voters who like him a lot of voters rents\nFriend people kind of roll their eyes their suburbs sort of melting into rural areas to think about places that are not a Fifteen minute drive from the downtown of the major city\nBut there may be a forty five minute drive so literally whether they're read on the map and the blue begin to bleed into which that's exactly right and some of them are a little bit writers some of them are a little bit bluer but you're looking at places in sort of the outer\nSuburbs of cities like Chicago or Charlotte North Carolina Raleigh North Carolina Richmond, Virginia\nPlaces that we don't really think of as liberal or conservative but there are to the conservative side of moderate ... I Would look especially at a couple of clusters of house races around some of the biggest cities in the country so you have\nA whole bunch of races ride around Los Angeles a whole bunch of races ride around Philadelphia these are places where Republicans are playing defense in areas that\nYou sort of think of as you're Romney Republican district and where the president is not popular but neither are the Democrats are and they're not liberal areas so what Republicans are trying to do in these areas is figure out their half a dozen seats around Los Angeles that they're defending can they saved three or four\nMhm and what's significant Alex about these geographical clusters what's happening there that puts them so at risk for Republicans the things\nThat are really the knife edge seeds that we're talking about the ones that will determine whether Democrats gained twenty two seats are twenty four seats in the majority\nYou're mostly talking about districts full of affluent college educated white professionals and why are these the voters who may be decisive in these midterms rather than Latino voters or African American voters\nWhile I don't want to say that any group of voters did not have the potential to be decisive but if you look at twenty sixteen\nAnd you look at today the group that has moved the most is white women and especially white women with college degrees and if you're looking at the suburbs of Chicago or the suburbs of Philadelphia\nThose are the people who voted Republican in the past maybe voted for Trump in twenty sixteen and have voted for Democrats pretty strongly sensed that out how are Republicans trying to protect these dirty it's\nThey're trying to do a couple of things at once and sometimes it's sort of an internally contradictory strategy the main thing they're trying to do is just disqualify Democrats that they're trying to go into these suburban communities talked to white women talk to white men as well\nAnd say if you don't like the president you know fine but here's some things to be scared about about the Democrats", "year": "2018", "show_name": "New Yorker Radio Hour", "city": "Pasadena", "day": "16"}