{"month": "10", "state": "MA", "station": "WNNZ", "content": "Streaming of New England public radio is funded by you and small ones farm certified naturally grown fruit farm in Amherst with a farm standard for sixteen Bayh road open six days a week through Thanksgiving small ones farm dot com\nThis form did you ever than sit down with are having a phone interview with with an FBI agent following up on it\nUh last I did not I was never called back I we're by my phone by my computer ah hoping to get an email ... nothing happened\nTo be clear your your statement boils down to that you saw him drunk back in college which of course does not prove or disprove allegations of sexual assault which is the central question that the FBI was was looking into why is your account relevant to the FBI why do they need to question you\nWell I think it's relevant because first of all I don't think one should lie in front of the Senate Judiciary committee or when it's taken an oath and one is also trying out in this case a it's a job interview become a Supreme Court justice\nAnd when you're saying you thought he lied and testimony this was in regard to the extent of his drinking\nYes there is the basic law was that he said he knew unequivocally that there was absolutely no way he ever drink to the point of being unaware of the phrases blacking out I think Brittany to confuse that was passing out but the black and you know phrase means doing things that you don't know you have done\nAnd what I'm saying is there's no way that he given the state of who's intoxication on a frequent basis can say that he knows for certain that he never got to the condition how can one new\nLet me let me ask you this a central question today in Washington now that the FBI has delivered this additional supplemental report is does that represent a complete thorough investigation\nYou get the great news and information programs you get the\nClassical and jazz and well music programs all made possible through the contributions of you our listeners go to an E. P. R. dot net I'll call one eight hundred six three nine eight eight five zero be part of the most dependable and greatest source of funding\nTo New England public radio that is you are listening one eight hundred six three nine eight eight five zero or an E. P. R. dot net\nHelp us finished this fund drive thirty thousand two hundred dollars to go and you might have a chance\nTo see Bob Dylan a pair of tickets are going to be given away at the finish of the full fund drive we're stopping tomorrow at ten am we're asking you to help us reach this goal right now by doing your part\nYou're helping provide news and information not only for yourself but for the entire community please give now eight hundred six three nine eight eight five zero or go to NPR dot net thank you\nThings considered on any PR is funded by you and current and Keegan financial Northampton based independent financial services firm guiding clients through personally tailored investing in financial planning current Kagan dot com buy T egg no construction incorporated general contractors employee\nStreaming of New England public radio is funded by you and say path university graduate schools an ass and applied laboratory science at operations and rolling now for August twenty seventh applications at bay paths\nDot edu egg no construction dot com and by e M A dental providing personalized family cosmetic and specialty care for over thirty five years generations of healthy smiles and nice long metal in Northampton EM a dental dot com [noise]\nThis is the medical and public radio WFCR in Amherst W. N. N. Z. Westfield W and then the FM Deerfield W and then I Adams W and then you great Barrington W. A. I. C. Springfield\nAnd W. A. M. H. Amherst in partnership with UMass Amherst and that any P. R. dot net it's five o'clock\n\nLive from NPR News in Washington I'm jak sphere senators have big gun they review of the FBI's report into sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh\nRepublican Senator Bob Corker says he's satisfied with the results of the probe and confident cabinet will be confirmed Senator Corker also said he's not upset by the fact that another judge Kavanaugh or doctor lazy forward will question the latest investigation\nI think they were playing I have no issue with that I Know the other side of the house trying to make that an issue I think the American people feel like they were\nPretty well energy one Democrat who had been undecided North Dakota Heidi Heitkamp now say she will vote no on the cabinet nominations [noise]\nMeanwhile demonstrations for and against the confirmation were taking place on Capitol Hill today police report about three hundred harass NPR's Windsor Johnston reports the protests comments at the Senate prepares to vote on Kavanaugh's nomination which has been marred by allegations of sexual misconduct [noise]\nHealth care late night shows on ... tend to have an hour to the Supreme Court's not wrong message to young white man\n[noise] I hate it when they went\nCan easily [noise]\nHabit nearby counter demonstration Francis Rogers has cabin always treated unfairly and served to get on the court\nMight say just hit the gas Kevin [noise] are similar to how there was a hit you with us from the same thought at\nFirst the journal Valentine Kavanaugh's nomination is scheduled for friday when Johnson NPR News Washington\nThe child had been is ration is accusing China of meddling in America's political process NPR's Scott Horsley reports vice president Pence delivered a sharply worded indictment of China's activities today\nVice president Mike Pence still Dodson Institute China wants to undermine President Trump has accused the Chinese government of using covert actors and propaganda to sway us public opinion before the November midterm elections as well as the presidential contests two years from now\nThere's a senior career member of our intelligence community told me just this week what the Russians are doing pales in comparison to what China is doing across this country\nFences charge of election interference was part of a broader critique Beijing's growing power and assertiveness fences even is ration has responded with terrorists investment limits and the build up of the U.S military Scott Horsley NPR News the White House member\nOf people filing weekly claims for unemployment benefits at a nearly forty nine year low last week when what has been a relatively strong jobs market Labor Department says initial claims for state jobless benefits fell by eight thousand to a seasonally adjusted two hundred and seven thousand the weekend in September twenty nights [noise]\nA major sell off on Wall street today the Dow dropped two hundred points the NASDAQ was down a hundred and forty five points today you're listening to NPR\nAnd this is New England public radio News I'm out in front of your good afternoon Connecticut US Senator Richard Blumenthal pants FBI reports on judicial nominee as a sham and whitewash the Democrats essays said the renewed background check a Supreme Court nominee Brett Kavanaugh doesn't include interviews with numerous but\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit from an ... with a farm standard for sixteen bay road open six days a week through Thanksgiving small ones farm dot com\nOr the state is chipping in two point five million dollars to renovate the paramount theatre in ... building in Springfield a forty one million dollar plan would restore the Eighteen hundreds seat theater\nAnd develop an eighty five room hotel Herbie Flora's is CEO of the New England farmworkers council a nonprofit that owns the largely vacant property\nSo people dream and other people say this is a nightmare [noise] so which side you're why but I Believe that this hideous going forward\nThe federal government has pledged a nearly four million dollar loan guarantee for the project governor Charlie Baker announced state funding yesterday\nWe are really looking forward to seeing this project below or to see it'd be a success and to see if become\nYet one more great example of what the city of Springfield looking forward is all about\nThe project has had several starts in stops since the farm workers council bought the property in ... eleven a casino proposal fell short in several redevelopment plants have been delayed authorities say at least Fifteen buildings in communities north of Boston number damaged and gas explosions last month our uninhabitable\nThe eagle Tribune reports the Massachusetts emergency management agency says Nineteen other buildings and Lawrence end over end north Andover or a suitable for restricted use which means they need repairs\nAccording to the agency an additional wanted her to building sustain minor damage an agency spokesman says many of the damaged buildings are multi unit structures used by more than one family\nMostly cloudy tell you what the chance of showers lows forty five to fifty sunny for friday with ties sixty two sixty five you're listening to to England Public radio it's six minutes staff five\nSupport for NPR comes from NPR stations or their contributors include exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription normally information at color guard tested dot com\nIn your hometown to Capitol Hill budgets are part of our everyday lives I Know the change in Paris train between did you make Vince Neal hamburger connect all of them\nWhen you give every month as a member and helping covered the economic and political means ... years down the road you're trying to deport them means you'll meet tomorrow [noise]\nCall one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net\nAnd this is all things considered on New England public radio and I'm ... with Martin ... is more news coming up news that you trust to bringing the total picture and you know that we apologize by you our listeners Ninety percent of the funding for the programs you listen to\nComes from you our community of support we're asking you to vote for the news that you depend on by supporting it financially right now and go to an E. P. R. dot net I'll call one eight hundred\nSix three nine eight eight five zero contribute to be part of this public radio station and keep all things considered on the air for yet another year and Martin about thirty seven thousand two hundred dollars remains to be contributed we're asking you to give them now and help end the fund drive right now this afternoon during all things considered\nWell things are going well and I think you're being inspired by Melissa Dane and dumber Wilcox of Springfield who want us to finish this fund drive on track\nAnd get you to support all things considered on any PR they're contributing dollar for dollar for everything that you contribute please give now at any PR dot net or call us at eight hundred six three nine eight eight five zero with your contribution of ten dollars or seven dollars or thirty dollars a month\nIt's critical that we remain standing so we can continue to deliver this reporting that you hear to you your financial support right now will ensure the continuation of this source of responsible journalism and analysis for our community\nRight now we need to hear from you because you've not ...\nStreaming of New England public radio is funded by you at all energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com to that goal of\nThirty seven thousand two hundred dollars again ten dollars twenty dollars forty dollars a month at any PR dot net or eight hundred six three nine eight eight five zero dollar for dollar match\nOh was I heard you're innocent until proven guilty I've heard this for so long and it's such a beautiful for is\nIn this case you're guilty until proven innocent\nI think that is a very very dangerous standard for our country\nBut she hasn't always defended due process take for example the case of the Central Park five\nIn Nineteen eighty nine five black and Latino teenagers were arrested for the brutal rape of a woman jogging and Central Park Trump took out full page ad calling for the reinstatement of the death penalty long before the five were convicted of the crime\nThey were exonerated years later and reached a multi million dollar settlement with New York Trump called the settlement a disgrace one of the Central Park five usa salaam toll MSNBC and twenty six teams that truck should apologize for his actions\nNorth of like we will ever get it I think about how my bra and waiting for him to give us an apology I Would probably pass out in turmoil in the face\nJonathan Turley law professor at George Washington university says however inappropriate it was one thing for Trump to issue these sorts of judgments as a private citizen but now he's president\nWhen he speaks that way as president he is the one person who heads the executive branch vastly different situation from Central Park for\nCharlie says it's troubling that President Trump has continued to assign guilt to people who have not been tried for a crime [laughter]\n[noise]\n\nYou know let alone over but try presides over rowdy rallies where crowds cough or Hillary Clinton to be jail\nAnd Clinton isn't the only one Trump has also accused former FBI Director James Comey and other current and former officials of committing crimes related to the Russia investigation and they're probably still seems to view himself as an outsider Turley says\nHe doesn't view himself as an active player in the investigation so I think the way that he justifies this in his mind is that he's really not influencing the investigation that he can speak about like anyone else\nWhen it comes to due process Trump seem sympathetic to his supporters but harder on those he views as opponents Clark nearly a criminal justice expert with the ... Institute\nSeries blown in\nIntro to win tickets to see Bob Dylan in Springfield inter right now it ... on the net or eight hundred six three nine ... sub zero [noise]\nIs in the service of people or objectives that he personally you know a cares about as far as\nThe White House ... only supports due process for certain people White House press secretary Sarah Sanders rejected that idea he simply\nStating the fact that we are a country of law and order we are a country that still believes that you're innocent until proven guilty and we want to see that process I go through in its entirety\nUltimately whether Kavanaugh is on the Supreme Court is a political question not a legal one so the road due process plays will be up to the senator's Ayesha Rascoe NPR News\nA little over fifty years ago Senator Robert F Kennedy gave a victory speech in the ballroom of the Ambassador Hotel in Los Angeles he had just won the state's democratic presidential primary as Kennedy left the hotel through its kitchen shots rang out\n[laughter]\nThere's a hunting black and white photo from that night it's of the mortally wounded Robert Kennedy lying on the floor squatting next to him as a Seventeen year old ... cradling the fallen senators had a bus boy was one Romero he died this week at the age of sixty eight\nRomero had met Kennedy the night before as he delivered room service to the senator Romero talked about that meeting with story court earlier this year\nYou can do when you're looking at you that he's not looking through his digging you into account and I remember walking out of there like I was ... feet tall\nAnd the next night Romero was there as Kennedy walked through the kitchen\nI remember standing in my hand as far as that good and then I remember him chicken my hand and she let go somebody's shirt and\n[noise] I kneeled on to him and put my hand between a coal conquered and he said I used to make them comfortable I could ... shall I put my ear and mixers live and I say is that everybody okay ... okay\n[noise] I prefer the steady stream of blood going through my fingers\nOr had a real tree and my ... and it took it out thinking that he needed a lot more than me I wrapped around his right hand and then they wheeled him away\nFor decades he lived with the guilt that he didn't do enough to save Senator Kennedy\nHas been a long for a few years and I still get their emotional\nOr tears come out but er which loses his grave and two dozen ten\nOr ... or ... gonna do forgive me for not being able to stop those moons from harming\nYou and I feel like you know would it be a senator respect to buy a suit I never on Russians in my life and so when are warned issued an a student in front of his grave\nLed felt a little bit like\nThe first thing that I met him\nFeel important\nFor all Americans and I felt\nWine Romero he died earlier this week from a heart attack in Modesto, California [noise]\n\nYou're listening to the New England public radio good afternoon I'm ... I'm joined by mark Miller and there's more of all things considered just ahead here on New England public radio news at is that both the joy will as well as sad and rather interesting to\nUh to hear the passing of this one little metal who was a witness to one of the more horrific scenes and on of American history will history I remember perhaps you remember what you might have been when you heard that and Robert Kennedy was shot\nAnd you saw that picture that I conduct picture of a cradling a Robert Kennedy's head so sad to hear but his posse of this all made possible through the contributions\nStreaming of New England public radio is funded by you and they passed university graduate schools MSA and creative non fiction writing enrolling now for August twenty seventh applications at bay pest dot edu\nThat was just feet should all made possible on public radio made possible by you are contributing listeners\nWe've thanking you for making sure that your public radio station can bring you this a kind of perspective and would love to say thank you for your contribution your financial contribution\nFor honest reporting thoughtful and uh and considered reporting\nMore news again just ahead here on you England Public radio right now we're asking you to go to the phone and call one eight hundred six three nine eight eight five zero or contribute on line at an E. P. R. dot net to to raise the final thirty six thousand six hundred dollars so that we can end the fund drive right now\nEight hundred six three nine eighty five zero or online at any P. R. dot net to have your sustaining membership contribution match dollar for dollar whether it's ten dollars a month\nThirty dollars fifty dollars a month you decide and then quality radio can keep coming your way we do these fund drives to find those of you who have yet to make your contribution of support\nAnd you know ... listen to that story just reminds me that you really don't hear or see interviews like that in most other places you hear a lot of yelling and blather on cable news where they call cable news\nUm you know but you you wouldn't really hear anything like this and this is what you're helping to pay for and I'm asking you to do it right now we're just thirty six thousand four hundred dollars to go eight hundred six three nine eight eight five zero or any P. R. dot net\nBy on Cairo's though the host the marketplace here with a multiple choice quizzes the best way to show your local public radio station that you value the programming they provide is to have become as a standing member and you've set amount monthly\nBeat becomes a standing member and encourage friends and family to do the same [noise] see become a sustained member today [noise] be all of the above\nHere somebody to tell you more in fact [noise] call one\nEight hundred six three nine eight eight five zero contribute online at an E. pi on dot net mocked and just to study six thousand four hundred dollars remaining to contributed we can do that this afternoon and everybody of course that goes to the phone goes on line will be entered to win a pair of tickets to see\nThe great Bob Dylan in concert next month in Springfield one eight hundred six three nine eight eight five zero you also get a night of the tower square hotel after the concept [noise]\nGo to an A. P. R. dot and that right now but to do it soon doing right now actually before you get to other stuff that you have to do today make sure that your public radio station is funded so that we can continue bringing you the kind of a reporting that you count on him on an ... a\nBob Dylan probably the only Nobel laureate who wears a wreck harmonica\nYou could see him perhaps it's a symphony hall in Springfield but only when you go to any P. R. dot net or call us at eight hundred six three nine eight eight five zero as Mary target from Wilmington Connecticut did\nThere are also problems in terms of whether or not judge Kavanaugh would have to recuse himself from myriad number of cases that are in nature to them\nHer courses cases involving congressional redistricting campaign finance and others Brakkton Booker NPR News Washington\nSarah Stewart likes to think about what happens when planets collide she uses to actual\nCannons to simulate those massive impact here's one firing in her lab at UC Davis\nHer work earned her a spot in this year's class of MacArthur fellows many of us call it the genius grant for years experts of thought the earth's moon formed after large collusion knocked off a bunch of rock Stewart told me her research suggests a different story\nDuring planet formation when two bodies collide there's so much energy released that most of these bodies are vaporized that means that a rocky planet earth is mostly rock vapor\nWhat his rocket vapor and and what does that have to do with our moon\nRock paper is taking the rocks that we stand on end heating it up to the point where it becomes a gas\nAnd when that occurs the earth becomes much larger because vapor is much less dense ... and it extends out into this enormous object hundreds of times larger than the earth today and we proposed that are men grows within the rock vapor of the earth after a giant impact\nSo the moon actually came from the earth\nThe moon grows within the rock vapor of the earth and that gives them in the same chemistry as the earth\nHow much of a revelation was that I mean how different was that from what scientists used to think about where the moon came from\nIt was hard to imagine that things could be so different and it was a mental roadblock to realize that\nGiant impacts transformed the planet into an entirely new type of object and that could explain one of the biggest mysteries in the solar system\nDid you have to overcome some mental road blocks of your own given what you've been taught coming through academia\nAbsolutely and this is when we had a bona fide eureka moment to my graduate student and I are sitting in front of a computer looking at the calculations that we had done and realizing that all the assumptions are actually violated by what we're looking at I think\nIn any field there's a degree to which people have to be taught to trust to themselves and maybe women even more than men are taught not to trust themselves was it difficult for you to have confidence that yeah well I've demonstrated here actually\nIs real scientists are terrified of being wrong [laughter] of course I didn't want to put something out there that was really a crazy idea and so we did have to convince ourselves first\nHow long did that take you to convince yourself\nWell [laughter] from the eureka moment to the published paper was four years so I think we had a lot of internal debates a amongst the co authors and a lot of debates at conferences on the origin of the men\nSo do you expect if ten years from now I pick up a high school textbook it's going to have the results of your research there in the chapter on how earth's moon was formed\n[noise] I certainly hope so I Am very excited about this idea and I hope that it leads to test where we can prove whether or not the moon actually formed in the earth vapor\nWhy are these kinds of questions relevant to ordinary people who are not scientists why does it matter where the moon came from for example\nThe creation of the man was the last major event and the creation of the earth and it was\nStreaming of New England public radio is funded by you and they pass university graduate schools MS and applied laboratories outside operations enrolling now for August twenty seventh applications at bay paths\nDot edu understanding how earth became in the habitable planet that it is is directly linked to this final event and its creation\nAre saying it's part of our story absolutely how did you get interested in planetary collisions\nI wanted to study planet formation\nIn the process I learned that collisions were the major physical process to grow planets and I had the opportunity to study them in the lab and I've been doing it ever since\nWe've kind of kid who was always going in the backyard staring at the stars [noise]\nI had my nose in books imagining space travel I very much enjoyed science fiction\nFor you is studying planets a fallback to actually traveling through space ...\nI might be too terrified to actually go up in space [laughter] exploration and our imagination and through the laws of physics has been exciting enough for me\n[noise] Sarah Stewart is a planetary scientist at the University of California Davis and to day she was named to the new class of MacArthur fellows congratulations and thanks for talking with us\nThank you\nMy name's Douglas cos I'm originally from ... in Scotland but being in the middle for Twenty one years not such an oasis when I arrived here at first I was used to the BBC ITN ... sort of\nGood independent news stations so having a news station where I can hear literally ... top of the world's agenda any PR as a community and we're ... we hear about what's happening locally\nAs well as internationally and it's not good mix giving you the broad range that it's important I'm a contributor to any PR it's important for me listen to it all the time and get great value for the contribution I make\nAnd we do appreciate each and every contribution that ah that you make including thanks to Douglas\nOf for the uh of course the mix of news and information and music that you get on you England Public radio all made possible by contributions from day ... Douglas and others\nWho have called one eight hundred six three nine eight eight five zero all who've contributed on line at N. E. P. R. dot net\nGood afternoon I'm ... Jerry I'm joined by ... and there's more of all things considered just ahead\nAll made possible by you are contributing listeners Ninety percent Ninety percent of the funding for what you hear on an E. P. R. comes from community support whether It's NPR oh the b._b._c. it's all made possible three you're generous contributions or asking you if you haven't yet\nMade a contribution to New England public radio this fall fund drive make sure the compensation can continue by taking action right now to keep all things considered on the air call one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net\nAnd right now we're in the final forty five minutes of all things considered\nThe last time during his full fund drive will be here during all things considered\nAnd we're asking you to help raise twenty five hundred dollars before the end of all things considered because we can match that dollar for dollar thanks too generous friends of the station from Amherst in east long men don't don't miss this opportunity to have your contribution doubles\nWith your a sustaining contribution of twenty dollars a month or ten dollars a month or seven dollars a month whenever you can do to become a sustaining partner\nThat figure will be matched dollar for dollar and the news and music that you want on the air to listen to will continue to be here it's very easy and very important as we wind down on this fund drive\nShow your support for New England public radio at any P. R. dot net or cause that eight hundred six three nine eight eight five zero\nAny or has one more grief either way to show for a full blown draws interested when tickets to see Bob villa in Springfield she could win brief cease to sit for the whole for his house in November he'll also get a combination of the towers\nStreaming of New England public radio is funded by un Franklin Community co-op offering organic produce baked goods groceries and prepared foods in Greenfield an Schober involves community grown and community own since Nineteen Seventy seven\nShows on the way to someone else's interest you know it doesn't it hundred six three million zero [noise] until\nHe was Twenty one he was known as Robert Zimmerman but uh I guess Bob Dylan is more sellable as a\nAs an artist but anyway a Bob Dylan that pair of tickets could be yours if you go to and if you are done nets are closed at eight hundred six three nine eight eight five zero you'll be entered and at the same time\nGet in on this dollar for dollar match um the final for like three quarters of an hour before we end all things considered\nAnd that match will be over eight hundred six three nine eighty five zero or any P. R. dot net\nYou know democracy is all about choosing each vote him except pays or her mind and costs a ballot well when you listen to New England public radio we helping you make an informed choice we covered the issues the ... the events the speeches and the debates\nYou choose to listen to New England public radio joined this campaign season in right now we're asking you to choose to support it with a contribution\nIt doesn't matter whether it's seven dollars a month or a hundred dollars a month to New England public radio you decide what fits you budget and then call one eight hundred six three nine eight eight five zero all go to and eat pee on dot net\nWith more on the latest updates from Capitol Hill as well as a preview of the upcoming\nUp American League division series between the red Sox Yankees Adam ... has a has an interview with one of the writers\nWho is covering the series coming up and just a moment one eight hundred six three nine eight eight five zero or an E. P. R. dot net\nFor a New England public radio News I'm out in front of your the red Sox open the playoffs tomorrow night at Fenway Park against the New York Yankees and the best of five game American League division series\n\n\n\n\nStreaming of New England public radio is funded by you and the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot\nCom contributions and having that match dollar for dollar at any P. R. dot net or by calling us at eight hundred six three nine eight eight five zero and don't forget you'll be entered into enter contests you might be going to see Bob Dylan in Springfield\nPlease call now and thank you for your support\nAll things considered on any PR is funded by un pivot media film print an artwork scanning photo restoration and fine art printing celebrating Twenty years with an open house on October nineteenth\nDetails at pivot media dot com by Springfield College hosting an evening on challenging the stigma of mental illness with Jesse close sister of Glenn Close on Thursday October eleventh at seven thirty\nSpringfield that edu and by Ken's I wear a locally owned and operated full service optical company in Springfield Northampton Westfield a nice long metal for over thirty five years Ken's I wearing dot com this is doing well and public radio WFCR in Amherst W and then the Westfield\nW. N. N. Z. FM Deerfield W. N. N. I. Adams W and then you great Barrington\nW. A. C. Springfield and W.\nAm age immersed in partnership with the UMass Amherst and that any P. R. dot net it's six oh one\nLive from NPR News in Washington I'm jak sphere\nThat top ... public and on the Senate Judiciary committee says the FBI has turned up nothing to cooperate allegations that Supreme Court nominee Brett Kavanaugh committed sexual assaults decades ago\nNPR's Brian Naylor says the FBI report is being held behind closed doors and being viewed individually by senators Republican Senator Chuck Grassley says in his words there is nothing in it that we didn't already know and that neither the Judiciary Committee nor the FBI could locate any third parties who can attest to any of the allegations\nHave it all has been accused of sexual misconduct by several women including Christine Blasey Ford testify under oath last week that Kavanaugh assaulted her well both were in high school the FBI was ordered to investigate that accusation and others\nThe bureau interviewed nine individuals the White House source tells NPR the Senate couldn't begin voting on the Kavanaugh nomination as soon as friday Brian Naylor NPR News Washington Democrats on the other side of the cabinet confirmation issue are taking the opposite tack\nDemocrat Cory Booker a member of the Senate Judiciary committee says contrary to the chairman's assessment he thinks the FBI's report is plenty of gaps\nVery frustrated with a thorough\nInvestigation of anything more relevant to the more central I interviewed\nAll the cooperating with I'm I'm actually shot\nAnd even as the FBI wrapped up its background check much of what it did remain shrouded in mystery including decisions about who was interviewed among those apparently not interviewed in the latest probe judge Kavanaugh and Christine Blasey Ford the woman who accused the nominee of sexually assaulting her while the two were in high school\nA Trump Administration did they unveiled a new strategic plan for combating terrorism NPR's Scott Horsley reports is the first major rewrite of the planet seven years\nOf land calls for beef up border security a culture of preparedness and international cooperation to fight with the White House says is an increasingly complex and diffused terrorist threat\nNational security adviser John Bolton who oversaw the planning process says one big change from the previous blueprint as the focus on what he calls a radical Islam is the ideology\nGets a long banned the president's view that without recognizing that we're in an ideological struggle that we can't properly addressed the terrorist threat\nSupplant also addresses homegrown terrorism and the process by which people already living in the U.S can become dangerously radicalized Scott Horsley NPR News the White House\nSurvey of teens and young adults finds many believe cyber bullying to be a major problem though most also don't think they will be the ones targeted for digital abuse\nThe Associated Press north Center for public affairs researching MTV survey also finds around half of all young people and their parents use social media is having a mostly negative effect on the younger generation\nStreaming of New England public radio is funded by you and the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com\nListening to NPR\nAnd this is New England public radio News I'm out in front of your good evening\nA decision from a federal judge in California could affect an estimated twelve thousand immigrants living in New England with a temporary immigration status\nThe judge issued a preliminary injunction blocking the Trump Administration from ending temporary protected status for immigrants from El Salvador Haiti Nicaragua and Sudan W. B. U. ours Shannon dueling has more\nThe ruling says ending TPS would cause irreparable harm and hardship for recipients friend the four countries I mean these immigrants are safe from deportation while the case played out in court\nTo lawyers committee for civil rights and economic cast as Canada similar ... in Boston federal court on behalf of TPS recipients from El Salvador Haiti and hunger is even if the nurse and magic a heads up the layers committee\nWe will proceed to ensure that immigrants somebody can receive the type of protection federal court in San Francisco has granted to other countries\nAnd department of justice spokesman Devin manly sat in a statement the administration will continue to fight for the integrity of our immigration laws and our national security for the New England news collaborative I'm Shannon doing in Boston\nThe national weather service says to tornados touched down in Connecticut earlier this week as a series of severe thunderstorms made their way across the state and the F. one tornado was maximum wind speeds of a hundred miles an hour touched down in New Canaan at about five thirty Tuesday and lasted about twelve minutes cutting a nearly four mile path to Norwalk\nIt was about a hundred yards wide then enough zero tornado touchdown shortly thereafter in Mansfield at maximum winds of about Seventy miles an hour or with the thirty yards and the path lengths\nOf just under a half mile\nAnd political action committees are focusing their efforts on Vermont house and Senate races ahead of the November election Vermont Public radio reports ten packs of donated Seventy eight thousand dollars to local candidates in the past month pack organizers say the legislature presents opportunities to mold policy\nPartly cloudy tonight with a chance of showers lows forty five fifty sunny for friday with eyes sixty two sixty five this is New England public radio at six o sex\nSupport for NPR comes from NPR stations other contributors include the artists foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at our cars foundation dot org and the corporation for public broadcasting\nOne thing we know about people who listen to NPR is they're more likely to do things like voter called the representative I'm David Folkenflik being informed is essential to our democracy to support the news that keeps you in the no [noise]\n\nCall one eight hundred six three nine eight eight five zero they'll go to an e P on dot net [noise]\nGood evening I'm ... and all things considered on un gum public radio more which is just ahead here on an e P uh we're working to bring you the facts each and every day and those\nFacts come to you with listener contributions Ninety percent of the expenses of the programs you listen to a paid for by the local community of listeners\nNow is the time to make sure this type of a responsible reporting can continue\nNew England public radio is gathering the funds needed to sustain this station so stay informed sustain this service that keeps you in the no call one eight hundred six three nine eight eight five zero or go to an E. P. R. dot net I'm\nJoined by marching Miller good evening\nEvening Kyrie and getting to thank you for listening and thank you for contributing right now this is the final after noon to support all things considered during our full fund drive\nDon't miss your chance to get your dollars doubles or we can match another fourteen hundred dollars but we only have well the twenty three minutes left in this program to do that and we want to hear from you because we know you love all things considered and you want\nStreaming of New England public radio is funded by you at all energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com\nSupport the programming for you and your community going into the future so make a big difference right now with your sustaining gift of just ten dollars a month or thirty dollars or twenty dollars a month at any P. R. dot net or by calling us at eight hundred six three nine eight eight five zero\nComing up on New England public radio and all things considered we'll have the latest\nOn the FBI report to the supplemental report on the justice nominee Brett Kavanaugh that as the senators review that report that's coming up and just to the law also a report on a microchip that that could be perhaps in one of our smartphones\nYou're raising pilot ... let me and then they put on that and the moments we have left because distracted when William ... absolutely they agreed that says about politics that says Republicans trying to get your guy confirmed before the midterm election\nOh I think there's a lot of truth to that we've said number one we would do it in a normal ordered a we were up to I Believe in Ninety One days now and the average is about sixty were about three weeks past the normal for the last five United States Supreme Court justices\nSenator rounds thanks so much you bet Mike Rounds of South Dakota and we'll be speaking with a democratic senator elsewhere in the program\n[noise]\nBloomberg has a big story out today about eight tiny microchip not much bigger than a grain of rice\nThat ship has been found in the type of computer servers used by at least thirty major American companies including apple and major banks also servers used by the Pentagon and the CIA Bloomberg describes this chip as quote\nA stealth doorway into any network that included the altered machines and historically Bloomberg reports was built in China Michael ... is one of the reporters who broke this story today Welcome thank you very much tell me a little bit more about this microchip and what kind of damage\nPotentially it's capable of doing\nSo it's a basically a chip that was built in to a mother board out it's made by a U.S company called super micro super micro even that most people have never heard of ... of the company is incredibly important in the business of making servers\nAnd several of the neurons of the cloud of the basically the Internet these big data centers with tens of thousands of service on them and these particular service for being assembled in China the actual mother boards will be built in China\nChina basically makes the vast majority of all technology in the world today it's all been off shored and most\nStreaming of New England public radio is funded by you advocate that university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nIf the country allows its spies to mess with that process it's a major threat but companies have always assumed that that's too valuable to try to to mess with the what the story tells us is in fact at least when the targets are valuable enough for specific enough they're going to be willing to do that\nTo the critical question of who did this you quote sources you point to a Chinese military unit has her at China denies that they have done this that they have anything to do with it how confident are you based on your reporting that this was trying to\n[noise] well that's certainly what the US government has assessed it to be and they as I said well U.S intelligence U.S intelligence what's right and they started with very high confidence\nAnd it's interesting when we asked China's foreign ministry for ... a lot of times they'll say things like you're crazy we know nothing about this their response with a little more nuanced and potential and environment we're in now basically said\nWe are a victim of these kinds of attacks to and you know they're right with the U.S government it's very very good at these kinds of hardware attacks and on a subtle way that the message that they were his elaborate was don't pick on just on us if you guys want to talk about very sophisticated hardware taxi if they're talking about what you do as well here\nCiting sources and U.S intelligence on I Want to push you on the street because some of the company's caught up in your reporting a ... which include Amazon which include apple which include super microbes they dispute summaries of your report and you've got their full statements on your website\nSorry they said they respond they basically said nothing like this ever happened when you give me a sense of how many officials you talked to who were informing your reporting I'll give you some sense of the cluster of ah sources 'cause that's really important so we had\nSeveral sources inside the U.S intelligence community we had several sources inside lawn fortunately had sources inside the the other parts of the U.S government but we also more importantly had sources inside the companies who where these chips were found the interesting thing about apple and Amazon is they\nAre two very big very viable companies but they also have pretty good security of the fact that they found these chips was amazing in itself\nNow companies are gonna be responsible for and what they what they want to say but based on our sourcing and the way it was layer for so many different places including inside of the companies were really confident that we have the story down so what are the implications of this\nWell they're more they're they're they're really large economic and national security that's right in part because\nThe global economy is built on sort of global outsourcing trade model\nAnd again especially when it comes to technology China is a huge player and that\nAnd the implications of this or of companies now have to think well do I have to worry about what's being put in the technology that's being manufactured how do I try and counter that is it should I go someplace else and make things\nI mean it's a it's a really big hard issue to solve a for a lot of companies a lot of companies the reason they operate and as cheaply and can sell products that she believes they can is because many of those ... products are made in China they have to rethink the entire model you get a sort of a tidal wave of decisions that could impact the the global economy [noise]\nYour reporting continues it sounds like\nThat is Bloomberg reporter Michael Riley who along with his colleague Jordan Robertson wrote the big hack how China used tiny chip to infiltrate U.S companies Michael Riley thank you fix [noise]\n\nYou're listening to the New England public radio I'm ... and I'm joined by Martin ... and\nWe hope that you've enjoyed this edition of all things considered we're looking to raise the money needed to continue bringing all things considered each and every day here on an e P uh with just a few minutes left before six thirty when we go to market place for the news of the business world\nAs well as fresh air and jazz ... later this evening all made possible through your contributions we're asking you to to help fund the service that brings you all things considered each and every day as well as the new other news and information services from NPR and\nAnd P. R. I. as one of the music that you hear on New England public radio one eight hundred six three nine eight eight five zero you can also contribute on line at N. E. P. R. dot net\nStreaming of New England public radio is funded by you add all energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com\nI was at a ball game last night in New York [noise]\nAh so but here's the important thing that you need to know right now we only have about twelve hundred dollars that can be matched with your contribution dollar for dollar this is the final\nOpportunity during all things considered dome is your chance to get your dollars doubled um we're not going to be here tomorrow during all things considered our fault fund drive is going to come to close tomorrow morning\nSo for the election coverage the music and culture all the things that car I just mentioned you tune here to any PR now I'm asking you to join your fellow listeners and paying for what you want on the radio give ten dollars a month Fifteen dollars a month twenty dollars a month and you'll be an important part of what makes the station work\nAn important part of reaching our goal\nThirty three thousand three hundred dollars left to raise and we are asking you to take advantage of this dollar for dollar match thanks to Melissa Dane and dumber Wilcox of Springfield and friends from Amherst in east long meadow any P. R. dot net or call us at eight hundred six three nine eight eight five zero\nSeries\nAny viewer has one more great give away to finish off for a full fund drive to win tickets to see Bob Dylan in Springfield you could win ... seats for the whole for his concert in November you also get a combination of the towers were hotel after the concert\nThe Bob Dylan shows on the weight of selling out so into right now it ... on the net or eight hundred six three nine sub zero [noise]\nAnd when you call one eight hundred six three nine eight eight five zero\nYou not only be doing yourself and your family a service but your friends and neighbors throughout western New England that is supporting New England public radio that brings you news and information that ah\nThat gives you the answer whether it's blowing in the window and not one eight hundred six three nine eight eight five zero you count Johnny hearing\nThe news and information to keep you informed well we count on you to help pay for this coverage supported at N. E. P. R. dot net or call one eight hundred six three nine eight eight five zero with your contribution of ten Fifteen or twenty or a hundred dollars a month it's never been more important\nThan right now to support New England public radio\nTwo minutes left in our challenge before we go to the marketplace thank you to Caleb Spiegel from Conway a Caleb you're in the contest of for the Bob Dylan tickets in overnight say a tower square hotel\nAnd you can be in that contest too and your caller said eight hundred six three nine eighty five zero go on line to any P. R. dot net\nAnd while you're there make your contribution of support because every contribution until we go to marketplaces going to be doubled dollar for dollar of this is the final opportunity don't miss your chance to get your dollars doubles\nOr Victoria's slate from Grande we thank you\nAnd in advance I Want to thank you for making your contribution right now any P. R. dot net or eight hundred six three nine eight eight five zero\nYou know way your money is being spent when you contribute to New England public radio every time you turn on your radio\nBut you know there's all of the things that include that the microphones that might send our newscasters are that that used to speak to your cost us more than fourteen thousand dollars\nWe spend over half a million dollars to NPR this year to pay for the news ... programs that they produce and that you rely on one eight hundred six three nine eight eight five zero your contribution makes it possible for us", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Westfield", "day": "04"}