{"month": "10", "state": "MA", "station": "WBUR", "content": "... and I cut you off there are really fast but wherever you get your podcasts you can get endless thread you can get\nLast seen Lenny ... regarding museum art heist modern love there's so much here at W. B. U. R. that is worthy of your support\nAnd we pull out all the stops with things like this unless the clerks kitchen cookbook and the trip to China the same way that we pull out all the stops for you and covering the news every single day give back right now show is that that means something to you one eight hundred nine zero nine nine to eight seven\nThe truth is all of these things come at a cost and we cannot bring them to you on air on the Web if we don't have your support so we have your listenership we hope that we have your donation as well one eight hundred nine zero nine nine to age seven thanks [noise]\n[noise]\n\nFrom Boston University and you're listening to Ninety nine WVU are FM lost and lost his largest radio news now do you do point seven WVU ages breathing eighty nine point one W. B. wage rooster\nAnd streaming and W. B. U. R. dot org WVU are Boston's NPR News station [noise]\nLive from NPR News in Washington I'm Laurie London President Trump is expressing confidence today that his Supreme Court nominee will be confirmed by the end of the week but as NPR's Scott Horsley reports Trump also says he's willing to wait and see what the FBI uncovers\nTrump says as he campaigns around the country he's urine strong support for nominee Brett Kavanaugh from fellow Republicans driving up his vehemently denied allegations that he sexually assaulted women decades ago Trump's hug where it normally is fighting hard to protect his reputation and whose family\nFibers your favorite jokes but now you're guilty until proven that is a very very difficult\nSome former acquaintances ... misrepresented how much you've drunk when he testified last week before a congressional committee drunk so long to Congress is not acceptable Scott Horsley NPR News the White House\nFour days after a devastating earthquake and tsunami on the Indonesian island of ...\nThe situation remains dire the official death toll is over twelve hundred and climbing NPR's Julie McCarthy is traveling with an army aid and security convoy to the heavily hit city of ... near the epicenter\nWith videos I see what you're going to be\nA judge of this earthquake the devastation goes on as far as the eye can see it's just a mess of sand on that a Barry building houses it's very difficult to believe that there are many people buried under all that but now lately\nThat's NPR's Julie McCarthy more than a million people have been affected there's no food or water and the powerful earth are aftershocks continue aid groups are urging people to stay outdoors\nFrance says the government of Iran is behind a ... bomb plot last June outside Paris NPR's Eleanor Beardsley reports that in retribution Francis frozen some Iranian assets\nFrench authorities say the planned attack was on a gathering that's organized every year by an Iranian group in exile the national council of resistance of Iran there were several European and Arab ministers in attendance\nAs well as former New York city Mayor Rudy Giuliani in a joint statement the French interior foreign and economic ministry said an incident of such gravity on French national territory could not do an punished\nFrance has also warned that citizens against traveling to Iran the deterioration of relations with France could have wider implications for Iran France has been one of the strongest supporters of the two thousand Fifteen nuclear deal even after the U.S pulled out Eleanor Beardsley NPR News Paris\nThe down rallied again today closing up a hundred and twenty two points\nIs NPR this is Ninety nine WB you are in Boston I'm Lisa Mullen's Columbia gas company has performed about one third of the in home inspections it needs in the ... valley in order to resist restore gas service today the utility said to check more than ... Eighteen hundred homes\nTo look for damage to gas lines and appliances after last month's natural gas explosions and fires\nIs also installed five miles of new pipe out of nearly fifty miles of plans to replace\nThe Boston VA says a patient to diagnose would legionnaires disease last month likely contracted it and it's west rock spree facility the VA says all water fixtures there have since been removed from service and the city of Salem is limiting the number of visitors to its charter street cemetery to one hundred at a time\nIn October on all weekend and on Halloween\nAs a popular tourist spot with ties to the Salem witch trials city officials say that the restrictions\nChanging diapers on gravestones\nFifty nine degrees now in the Boston area showers and thunderstorms off and on this afternoon and tonight lose holding to pretty much where they are now worried about sixty degrees than tomorrow should've adapt starts but sunshine for the bulk of the day warming to about Seventy Thursday should be partly sunny up in the mid seventies friday a lot cooler but plenty of sunshine\nGet fifty nine degrees now in Boston at five passed for were funded\nBy you our listeners by DC you digital federal credit union where you can switch your credit card for a lower rate DC you credit card what can DC you save U. D. C. dot org\nAnd the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health you less students and researchers are working to solve challenges at next dot U. F. L. dot edu\nGoing to all things considered with a and lots of stories including a profile of Senator Lindsey Graham coming up and just a couple of minutes first though we're leaving a little bit of time to hear from you as we embark on an ambitious goal for just this hour we want to raise twelve thousand dollars for W. B. or between now and five o'clock we can do it\nBecause we have so many people listening right now we know\nThat uh that you know many people tune in perhaps you do to specifically for all things considered so coal and before we go to the program ... support for it right now one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org ... in the studio ...\nLow and I have good news because outside the weather is pretty grossed right now and the good news about that is you're not missing anything if you take one minute right now and call us and make your contribution or go to W. B. U. R. dot org it's not a beautiful day you're not missing a walk along the Aspen out or anything like that\nUh this is the moment to just get in on this fund drive get in on this\nChance of winning a trip for two to China with National Geographic expeditions\nA that is only today so you've got to make the call now make the contribution now W. B. U. R. dot org and you will be entered in to win and most importantly you will be supporting the news that you rely on every single day one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org\nNinety five and a half percent of the support for everything on WB you are comes from our community as part of that community we're asking you to\nDo your part maybe five or ten dollars a month is a comfortable amount for your budget if ten dollars a month works for you we will thank you with our protect journalism T shirt\nThis brand new it's very cool it says pro journalism from a distance but when you get a closer\nYou can see that it says protect journalism and that's exactly what you're doing when you support WB you are you can get one of those right now is our thanks for your ten dollar a month contribution that will go to work all day long throughout the year to bring you all the programs that you listen to\nSupport them now at W. B. U. R. dot O. R. G. or one eight hundred nine zero nine nine to eight seven\nAnd I believe Jay that it's too um WB or employees who design that T shirt yes yes and that's fantastic looking I can check it out and please get yours but really what we want you to do is support W. B. U. R. nine zero nine nine to eight seven one eight hundred Ninety point nine\nWVU Oregon that's another way to look at the phone number or WVU aren't dot org and when you call or you will be automatically entered into when a trip for two to China with national grid geographic expeditions\nYou the chance for you to get in on this ends at seven o'clock tonight so we're counting down right now and this is going to be the last trip that we have on offer\nFor this a fund drive so there was the Galapagos there was Tuscany just yesterday and this one this trip to China takes you to Shanghai she on Beijing\nJust really fantastic offerings and it'll cost you nothing to uh to go on this trip to the just the cost of a pledge if you decide to make a pledge once again one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org\nAnd you're a listener it's W. B. you are you're listening to NPR you care about what's going on in the world there really is no more important place to go right now to really get an up close view of what is changing on earth than China or I was just there earlier this year and it is fascinating to see these\nEnormous cities Beijing and Shanghai which you will see on this trip if you win at\nA so called right now one eight hundred nine zero nine nine to eight seven or make your contribution at W. B. U. R. dot org it can be any amount hundred dollars to fifty five hundred whatever you can do go there now W. B. U. R. dot org thanks [noise]\nAnd it never gets closer to the sun than six billion miles about twice as far as Pluto is from the sun\nObjects this far out with really elongated orbits are just weird the current models of solar system formation don't predict these objects Juliet Becker is an astronomer at the University of Michigan now it's possible that these models are wrong but Becker says a better ...\nPlanet some astronomers think is out there\nIn easier solution is the existence of planet nine because it naturally creates these objects in the solar system\nThe gravity of big planet like Jupiter Neptune Ken sling smaller objects into weird orbits if they happened to wander by but the goblet doesn't get anywhere near Jupiter Neptune so some astronomers think planet nine might be out there doing the swinging\nBecker says right now only a handful of objects points to the existence of planet nine so there's plenty of skepticism that it really exists\nI guess I have kind of a picture in my mind is how many new objects do we need right now we obviously don't have enough but this particular object is such a unique orbit and it's so useful that like I the kicker in my mind just jumped up like where a lot closer to having enough objects\nCertainly the goblet gives new confidence to several teams already searching for planet nine but so far no luck Joe Palca NPR News [noise]\n\nYou're listening to all things considered from NPR News were funded by you our listeners and by always health partners and new choice and health insurance with benefits in programs that put you first learned more it always health partners dot org a member of partners healthcare and Fox hill village of Westwood\nFor over twenty five years helping those in their sixties and seventies seek an active lifestyle at every stage of retirement Fox hill village dot com\nThis is Ninety nine W. B. U. R. Boston Celtics have a preseason game tonight at the garden with the Cleveland Cavaliers Bruins open their season tomorrow let's get the forecast now with meteorologists have up steam\nSome drizzle around this evening showers and thunderstorms developing later on after the evening commute some of those could produce heavy rain even some street flooding down toward sixty\nOn Wednesday clouds give way to sunshine temperature up near Seventy Thursday look for partly sunny skies Seventy five to eighty it's cool on friday only near sixty with sunshine Saturday mid to upper sixties back to the upper seventies on Sunday with sunshine\nAnd right now in the Boston area fifty fifty nine degrees at four twenty to\nSupport for NPR comes from WVU are in from transfer wise a service that helps people send money internationally three million people and businesses used transfer a wise to send receive and convert currencies and more than Seventy countries more transfer was dot com or from their app\nAnd constant contact with hundreds of customized ... emailed tablets for small businesses to reach customers where they are every day there in bucks learn more it's constant contact dot com\nSome WVU our senior political reporter Anthony Brooks when you contribute to W. B. you are you're making sure WVU are has the money to foster important conversations with our\nGovernment interfering federal tax dollars cover only four and a half percent of our fund the rest of it comes from our community WVU are is not for profit commercial free news in the public interest protect independent journalism become a sustaining member right now here's how like calling\nOne eight hundred nine zero nine nine to a seven going online and pledging WVU are dot org if you prefer and call before we go back to the news headlines from National Public radio\nAnd the rest of all things considered Elissa Mullins in the studio now with a Jeremy Hobson and Jay Clayton inviting you to call before we go back to the news because we are in the uh the the waning days of this fund drive\nAnd we're looking for your phone called the four seven o'clock tonight in fact I'm making a call right now and making a donation and getting your name entered into a um a raffle for a trip for two to China a fantastic trip and we hope to get your name and right now and we hope you'll played you support the w._b. you are\nOne eight hundred nine zero nine nine to eight seven is the number to call you can also give at W. B. U. R. dot org and you want to do that by seven o'clock because that'll be your last chance\nTo get a contribution in and be eligible to win that trip for two to China is the last one we're giving away it's for National Geographic expeditions and you could win it if you contribute right now and when you do you'll be providing some of the essential support\nThat brings you all things considered and all the other programs that you listen to here on WB you are the way to support them on the phone is by calling one eight hundred nine zero nine nine to eight seven and on the Web it's W. B. U. R. dot O. R. G.\nThink about how important over the last week or so it has been to have the access to the analysis of Nina Totenberg NPR legal affairs correspondent as we watch everything that's been going on with judge Kavanaugh and Christine Blasey Ford\nYou've got Nina Totenberg because you're listening to NPR that's the place where you can find her\nArt analysis of what's going on with the context of everything that she's covered over decades\nOf watching the Supreme Court that's the kind of quality that you expect from WB you are and that's what we're giving you what we're asking you to do right now as we wrap this fundraiser up by the way there are two days left in this fundraiser we will be done on Thursday\nSo we need to hear from you right now with your contribution you could do it at W. B. U. R. dot org or call one eight hundred nine zero nine nine to eight seven\nAnd when you do that you'll be supporting the news that you hear on all things considered every day the headlines that you'll be hearing and just a couple of minutes\nAnd you'll have a chance to win this trip for two to China this is a she on this is the genius in Shanghai and um it'll be sponsored by National Geographic expeditions for Cochran works for National Geographic expeditions and and tells us that uh if you go on this trip you're going to see a part of Chinese history the few people even know about\nWhen they go to Shawn they're going to go and see the Harry Potter warriors and I'm proud to say the geographic was sort of a part of the story and bringing this incredible army ... more than eight thousand figures created and buried\nTo basically celebrating protecting the afterlife China's first ... you know more than two thousand years ago\nWhen these were on earth in the seventies and eighties when the African nations were happening the Chinese government at a time when it was still somewhat close country place that was their up fairly exotic not so many people knew invited National Geographic in so we'll bring people there and tell the story of that army\nAnd it's a fantastic sight to see if you haven't seen it as he had life size warriors individual character is the characteristics of their faces because they are modeled after actual war is in ancient times in China your trip to win it or your chance to win a trip for two to China\nIs a right now in fact call before seven o'clock because that's when this offer end one eight hundred nine zero nine nine to eight seven W. B. Y. dot org pledge whatever you would like to to W. B. you are\nYou know when you hear about these opportunities like be a chance to go to China you really have to act quickly so that you do not miss out and if you can contribute ten dollars a month\nTo help us bring WB you argue everyday will thank you with our protect journalism T shirt says pro journalism when you look at it from a distance of course we're all in favor of that\nAnd then up closer you look at it and it actually says protect journalism we're all in favor of that too and that's what you're doing when you support WB you are and why we're asking for your contribution right now the number is one eight hundred nine zero nine nine to eight seven and the website where you can give is W. B. U. R. dot O. R. G.\nOne but you know I was just going to say that that learning more about China and this is such a great opportunity if you'd call right now this is only today that you can get in on this trip to China for ten days you go to Beijing and Shanghai and trying to do and other places\nAre this is such a great opportunity to learn about this country right now that by the way there was a math that came out not too long ago that showed each neighborhood of Boston and what the dominant\nEthnicity in that neighborhood was we have a number of neighborhoods in the city where China\nIs the number one ethnicity in that neighborhood people coming from there there are a lot of people from China with Chinese heritage living in this area uh this is such a great opportunity to go to China and see it for yourself if you haven't already ah and of course most importantly you're contributing to pay for the news on WB you are\nIt's W. B. R. dot org you can make your contribution maybe it's two hundred dollars five hundred dollars a thousand dollars if you can do that or call one eight hundred nine zero nine nine to eight seven\nThat's right and it really doesn't matter if you give a little are a lot of the fact is if you contribute you're supporting independent journalism\nOur listeners are the ones that keep us afloat because we're commercial free and because we're commercial free it means not only do you not have to listen to commercials but it means that we are editorial independence from commercial or political interests and that is huge when it comes to journalism\nYou know that that's why you listen to us so please support us right now one eight hundred nine zero nine nine to eight seven W. B. U. R. dot org\nThe ... Center for addiction at Boston medical center led by Michael bought a chilly in recovery for twenty nine years and helping others to do the same B. M. C. recovery dyed orange\nAnd applied ... supplying mechanistic mathematic modeling simulation and analysis to accelerate and do you risk drug R and D more it applied ... dot com\n[noise] I'm W. B. U. R. reporters Quincy Walters freedom of the press is protected in the first amendment above the constitution says nothing about paying for the federal government provides only four and a half percent double your funding the rest of it comes from unity so it falls on each of us to support WB you are\nAnd NPR protect independent journalism become a sustaining member right now here's how\nTo become a sustaining member don't leave the EU are is number one by deciding that this is a station that's worth listening to all you've already decided that and it's worth supporting one eight hundred nine zero nine nine to age seven certainly we appreciate at one time pledge but if you decide you want to automatically have\nMoney withheld from an account or you want to make a some kind of contribution on a monthly basis whatever it is\nThat's really helpful to us because we can plan our budget so call now before we go back to all things considered one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org ... and the city with Jeremy Hobson and Jake late\nAnd I just want to pick up on something that Quincy Walters set a minute ago when he said that the constitution doesn't say anything about paying for\nThe free press but the public broadcasting act that Lyndon Johnson signed when he was president back in Nineteen sixty seven says there ought to be some space in the media landscape\nWhere there can be radio stations and television stations that are uncovered by commercial pressures and interests practically a direct quote J I think so yeah that that is weird W. B. U. R. fits in the media landscape we have a fundraiser right now that ends on Thursday\nWe've got about five hundred and fifty seven thousand dollars to raise between now and then and this is why we're taking just a little bit of time to ask you for your financial support be ten dollars a month or a hundred dollars or a thousand dollars whatever you can do to protect this space in this kind of journalism on WB you are\nOne eight hundred nine zero nine nine to eight seven is the number to call the website is W. B. U. R. dot org and you're going to want to do that by seven o'clock to get a chance to win a trip to China\nAnd when you say protect this space Jay space for independent journalists were you thinking about the other\nSources of news that are out there right now in twenty Eighteen you have your cable news networks commercial or you know commercials or what support those cable news networks you have\nYour major newspapers many of which are owned by billionaires now people like Jeff Bezos we don't have a billionaire owner we have you know our model actually I think is the best one that there could be but we are are reliant on you\nTo pay for the news that we bring you every single day with reporters all over the world I was talking today on here and now to a reporter who is in Palo in Indonesia bringing us the latest after the tsunami there\nReporters in Washington reporters in New York reporters across this country and of course WB you are is able to bring because of your support that level of quality journalism\nFrom the region from all over this area with the largest radio news room in New England that's supported by you so now's the moment to get in on the possible trip to China which is our way of saying please support us right now at W. B. U. R. dot org or one eight hundred nine zero nine nine to eight seven\nTimes a wasted two hours Fifteen minutes left before the uh the door to that trip closes\nUm does the trip for two to China with National Geographic expeditions that includes round trip airfare force also meals accommodations\nTransportation for ten days and nine nights he\nWill automatically be and be entered into when that trip if you call right now again it's one eight hundred nine zero nine nine to eight seven conveniently that's Ninety nine W. B. U. R. or play online at W. B. U. R. dot org once again the offers good until seven o'clock tonight\nEight hundred nine zero nine nine to eight seven or W. B. U. R. dot org if you go to the website and contribute\nCheck out our protect journalism T shirt that you can have is our thanks for your ten dollar a month contribution that will protect independent journalism here on WB you are nice way to do your part eight hundred nine zero nine nine to eight seven or W. B. U. R. dot O. R. G.\nThat's a nice shirt by the way this protecting his arms that one yeah I think it looks great great colors W. B. R. dot org is where you can go to make your contribution for one eight hundred nine zero nine nine to eight seven just a couple of hours left to get in on that trip to China do it now W. B. R. dot org\nIf you've already called thank you so much for doing that if you haven't now's the time one eight hundred nine zero nine nine to age seven thinks he can\nProtect independent journalism no and get entered into all of the remaining prize drawings in our fault fundraiser including today's prize that our grand prize your choice of a twenty Nineteen super cross ... of that provided by city side Subaru a villa give no WVU our daughter one\nMore call one eight hundred nine zero nine nine to eight seven\nWVU our supporters in east meets west catering and sneak west and the exchange catering for all life's occasions fired value\nHe meets west catering dot com and innuendo with the hunter Douglas season of style event in their window fashions gallery hunter Douglas that innuendo and needed and innuendo dot com [noise]\nPeople are learning that their drinking water is polluted with a potentially harmful group of chemicals they're called pee fast P. F. A. S. and they're linked to a number of illnesses including cancer the Trump Administration is working on a plane to regulate them some in Congress are pressing for it to move faster NPR's Jeff Brady has been looking into this and joins us now Jeff\nHi Ari first of all what are these chemicals\nOf several thousand manmade chemicals in some of them had been around for decades these chemicals are good at Republican oil and water and that makes them really useful for all sorts of products like nonstop cookware holdings on fast food rappers pizza boxes\nAnd the places where pie fast says are used in manufacturing those are generally the places that are the most polluted or there's some sites in New York North Carolina Michigan just to name a few places ...\nAlso are in firefighting phone used at airports and military bases in some cases around the country the chemicals have migrated into local drinking water and the estimates on exactly how many people are affected very but it's safe to say that the numbers and the million\nHow harmful to people can these chemicals be what kinds of problems that cause the\nResearch is limited so it's hard to pin down exactly how harmful these chemicals are a scientist will say the pastors are linked to certain illnesses here's Laurel said her she's a research scientist with an advocacy group called the Silent Spring Institute piece\nChemicals have been linked to a wide range of health effects including cancer\nLow birth weight thyroid disease elevated cholesterol and effects on the immune system\nManufacturers have agreed to stop using two forms of pee fast in the U. S. but these chemicals take a long time to break down on the environment and that's why they are still a problem now and\nHow regulators responding to this especially given the uncertainty\nThe EPA requires most water utilities to test for a list of ... passes in in twenty sixteen agency lowered a non binding health advisory limit for some ... chemicals it's now Seventy parts per trillion I'm told that it's about Seventy grains of sand and an Olympic size swimming pool\nAnd some environmental advocates argue level should be even lower than that\nBut all this uncertainty it creates confusion especially for water companies like ... America it's based in suburban Philadelphia Christopher Crockett is the chief environmental officer there and he says companies like his need clearer direction from the EPA and from policymakers\nTo be able to explain to the public and my above or below sea level here and do we need to put treatment on in this community and how soon and that still needs to be determined and that needs to be determined as soon as possible\nNow the EPA is working on a plan to manage the fast chemicals the agency just wrapped up a series of public meetings around the country the plan is expected by the end of the year\nThe Trump Administration has been so staunchly anti regulation especially rolling back protections meant to keep people safe from environmental contaminants why are they responding differently today is\nAn issue like this it really fits in with the way the Trump Administration has tried to narrow the focus of the EPA away from things like climate change and toward issues such as clean air and clean water also we should keep in mind that the EPA still working on his plan to manage be fast chemicals\nAnd we don't know what that plan is going to look like and tell us out sometime in the next few months\nSo what could people do to protect themselves today\nWith the water utility aqua that we heard from just a minute ago they've installed these big carbon filters to bring the levels down and that works the utility says the water is safe to drink\nIf you're still worried about it those filters that you get in a refrigerator or water pitchers those will bring the levels down too but I've talked to people here who still just don't trust their water that it's safe and they're continuing to drink bottled water\nThat's NPR's Jeff Brady thanks thank you are and tomorrow we'll visit a New Hampshire town where there's concern that these chemicals are leaking from landfill into drinking water [noise]\nOr W. B. U. R. dot org\nAdditional incentive of winning possibly a trip for two to China with National Geographic expeditions two hours to go to get your name and once again the phone number one eight hundred nine zero nine nine to eight seven you can also do it on line to leave the U. R. dot org it's quick and easy and means so much to us\nThank you very much\nFunding for WVU our weather reports comes from Charles River apparel home of the original new Englander rain jacket since Nineteen eighty three a wind and waterproof footed rain jacket for all around youth available and twenty color combinations including blue and white striped gray on was reading navy\nLearn more and located Charles River up heroin retailer and Charles River apparel dot com [noise]\nFrom Boston University you are listening to Ninety point nine W. B. U. R. S. them Boston whom of Boston's largest radio news from Ninety two point seven W. B. ... eighty nine point one W. B. U. H. Brewster\nAnd streaming at W. B. U. R. dot org W. B. U. R. Boston's NPR News station\nLive from NPR News in Washington I'm ... beer Senate majority leader Mitch McConnell says the Senate will vote on President Trump's pick for the Supreme Court later this week NPR's Kelsey Snell reports what kind of expects the FBI will soon complete a supplemental background check on nominee Brett Kavanaugh\nMcConnell said the FBI is working quickly to investigate claims of sexual misconduct by cabin on the bureau has until friday to complete that work but McConnell expects the report quote soon\nIt will be made available to each senator and only senators will be allowed\nThere are always handled McConnell says it will be his decision when to schedule it confirmation vote some Republican senators and many Democrats say they would prefer for the public to have access to that report they say it could avoid confusion or controversy over the findings Kelsey Snell NPR News the Capitol\nThe drug ministry Asians family separation policy at the southwest border was played from the beginning by a lack of preparation and communications failures NPR's Joel Rose has more on a new report released today\nThe review by the department of homeland security's inspector general is the first official audit of President Trump's family separation policy administration officials said the policy was needed to discourage illegal immigration but Trump abandoned it amid widespread outrage after more than twenty six hundred children were separated from their parents\nThe audit found that hundreds of migrant children were detained at border patrol facilities for longer than the three day limit one for more than three weeks the inspector general's review also found serious problems with record keeping and communication that made reunification more difficult\n... spokeswoman says the report illustrates the difficulties of enforcing immigration laws that are quote broken and poorly written Joel Rose NPR News\nSubtle authorities in Virginia have charged for suspects in connection with last year's violence in Charlottesville men are all from California and allegedly members of the ... and white supremacist group rise above movement a news conference day in Charlottesville us attorney Thomas Collins said the men traveled across the country we intend to commit violence\nAmong other victims on second street these men assaulted an African American man to ... to females in a minister wearing a clerical\nCall if convicted of all the charges of men could face up to ten years in prison\nThe American dream appears alive and well among the nation's young people do perhaps a bit reined in given the current economic realities new poll by the Associated Press ... Center for public affairs research an MTV network\nMinds about half of Fifteen to twenty six year olds think they will eventually better off than their parents in terms of household finances only about ... percent of those surveyed said they feel their children might do worse\nOn Wall street today the Dow was up a hundred and twenty two points to a new record closed the NASDAQ fell thirty seven points today you're listening to NPR\nThis is not the way nine WB you are in Boston I'm Lisa Mullen's Columbia gas companies reporting some progress in its efforts to restore gas service in Lawrence north Andover in Andover\nThese agility said today it has put in five miles of the roughly fifty miles of new pipeline it plans to install by mid November the replacement is happening because of the natural gas explosions and fires in the ... valley last month\nSpeaking in Boston today Federal Reserve chair Jerome Powell said he expects the central bank to keep gradually raising interest rates\nPaul said the low unemployment rate combined with low inflation represents a quote extraordinary times he told a meeting of business economists the fed is trying to raise rates at just the right piece to avoid recession or higher inflation\nThe interim superintendent of Boston Public schools has obtained the required license to hold the job state records show Laura ... obtained a provisional license to be a superintendent last week the former CEO of an education nonprofit has never worked as a teacher principal or superintendent\nCeltic seven preseason game tonight at the garden with the Cleveland Cavaliers the Bruins open their season tomorrow and in the forecast weather continues tonight not much of a change in temperatures now from where they are right now sixty degrees\nThen tomorrow damp early Sunday for the majority of the day the engine to Seventy bearing amounts of sunshine through the rest of the week and likely over the weekend as well in Boston sixty degrees now at five past five\nWere funded by you our listeners and by NBC ten Boston presenting the day's news every evening with Shannon malaria and Philippe off on NBC ten Boston news at six and eleven\nAnd exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard test dot com\nIs Ninety nine W. B. you are coming up on all things considered in just a couple of minutes the debate over Brett Kavanaugh Senate testimony has shifted from questions of sexual assault to whether he lied about his drinking\nThat story and much more coming up in the next hour of all things considered coming up right now we hope your phone call it one eight hundred nine zero nine nine to eight seven\nOr W. B. U. R. dot or you can pledge on line of it's easier for you were asking you to pledge right now because we're counting down on this fundraiser right now we're in the last few days of the fund raiser end\nThe last few hours of your chance to get in on that a sweepstakes for a trip for two to China with National Geographic expeditions ... in the studio with Jeremy Hobson and Jay Clayton\nAnd that chance to win that trip to China ends again it's seven o'clock tonight less than two hours away from now so make sure you find a couple of minutes before than to go to W. B. U. R. dot org\nAt the independent journalism that you rely on from WB you are you can also do it on the phone one eight hundred nine zero nine nine to eight seven and all we ask you given amount that is comfortable for your budget whether it's ten dollars a month a hundred dollars a hundred dollars a month\nOr whatever it is that is comfortable for you is the right amount to give just know that we are counting on that support because it is how you're able to hear this program and all the others you listen to end it because we needed by seven o'clock if you want to get a chance to win that trip to China\nAnd by the way or if you've never been to China if you've ever been to the great wall of China what a magnificent experience that is a just a hike that great wall for just even a portion of it you see how big it is\nHow long it goes on and by the way how deep it is I was much deeper than I expected that is part of this trip uh that we can put you in the sweepstakes for if you call and make your contribution and again you're only up against the other people who are calling in\nTo WVU are making their contribution online at W. B. U. R. dot org again\nThe phone number one eight hundred nine zero nine nine to eight seven and you know we try to keep these fundraisers the shortest possible at this point if you've been listening you're probably like okay enough you know is it over yet we're almost there we are reaching the end but we still have\nA little more than five hundred thousand dollars left to go we've made almost a million dollars a from you so thank you if you've already made a contribution but if you haven't please do it right now and help us get to the finish line at one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot\nOrg another thing about this a trip to China this is the last trip we're going to be offering during this fun drive so\nA China Today yesterday it was Tuscany prior to that it was the Galapagos Islands one of the things that we know is that you crave information you crave at a vacation and that's what we provide for you I Will we understand the trip to China is not nothing I mean this is something they really want to have to do and be prepared for\nIt's the same thing is when you listen to the radio we know that you want and knowledge you want to understand things knowledge is valuable and we know it's worth paying for you know that as well the thing about this is that you decide what it's worth the art contributing listeners that means each one of you\nMake it possible for you to hear all the programs that keep you so well informed from all things considered to the show Jeremy works on here and now to MORNING EDITION and all the other programs that we provide\nOn and off the air including pod cast by the way so this is what we're asking you to pay for right now special incentive is that you get your name entered into when this trip for two to China with National Geographic expeditions here's the number again and they'll say it's slowly because so many people that we see it too fast and one\nEight hundred nine zero nine nine to eight seven\nThe irony is they call us to tell us that but anyway one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org an hour and Fifteen minutes to go to win the trip to China if you get your name in with your contribution right now [laughter]\nSurely started one allegation was low but you know a ... home there's nothing for you choose to look at a bar and you just nothing\nNow it's important to say that supporters of Christine Blasey Ford say she does remember several key details about that night in Nineteen eighty two and then another accuser Deborah Ramirez has come forward with concerns about Kavanaugh at Yale\nBrett Kavanaugh he has made it clear that he has already been through six separate background checks for government jobs over the years do we know of any of his background checks revealed allegations for anything that's been mentioned so far what were they caught in any of\nThose reports those background check reports are secrets on the White House and the Senate Judiciary committee led by Republicans have said they did not capture a whiff of sexual impropriety when it came to\nBrett Kavanaugh and we do know that there are some clues that Kavanaugh was asked about his finances maybe some other allegations in a private hearing with the Senate Judiciary committee this year but that hearing\nHas remained mostly private I reached out to Ron Klain who helped President Bill Clinton that judges claimed says there could be another issue the White House counsel's office under Donald Trump is under staffed and they've been pushing through judges at a record pace\nI Wonder if the bakery is just too many cakes and maybe they're not getting the attention they deserve\nBy contrast round cleans as President Clinton stopped all the other judges while he pushed through Ruth Bader Ginsburg on the Supreme Court but judges are central to Donald Trump's legacy and his mainly pleasing his political base so I don't expect to see a lead up there in this case All right That's NPR's Carrie Johnson thanks carry my pleasure [noise]\nYou're listening to all things considered from NPR News\nWere funded by you our listeners and by the icy a final weeks to see the watershed the museums new space for art in east Boston open through October eighth reserved tickets at I see a Boston dot org\nAnd artists for humanity's greatest party on earth October thirteenth celebrating creative teens at the expanded epicenters grand opening more at greatest party owners dot com\nThis is Ninety nine WVU are on Wall street the Dell rallied for a second day and rose to an all time high to start off the fourth quarter it getting nearly a half percent a closer twenty six thousand seven hundred Seventy four\nTwenty three and ... lost about a half percent to finish the day at nearly eight thousand details coming up on marketplace\nAt six thirty it's now five twenty two\nFunding for ... business report comes from for tax\nField by the needs of patients' families on health care providers for tax invest in science to develop new medicines and strike at the core of serious diseases learn more about the people behind it science at V. R. T. X. dot com get the forecast now with meteorologist ...\nWill get by the evening commute without much in the way of precipitation but later tonight will be some showers even the rumble of thunder could be some heavy rain watch for street flooding if you are traveling late at night temperatures near sixty\nTomorrow starts murky but it becomes sunny temperature gets towards Seventy in the afternoon a very nice afternoon on Thursday a blend of clubs in some warm Seventy five to eighty\nFriday only near sixty but it's bright and sunny Saturday mid to upper sixties and then on Sunday it feels like summer Seventy five to eighty once again\nIn Boston sixty degrees this is Ninety nine WVU our\nSupport for NPR comes from W. B. U. R. and from T. I. A.\nT. I. A. as committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more at T. I. A. dot org and the main office of tourism offering travelers an opportunity to explore and discover their very own main thing\nTo be inspired the original that'd be yourself and visit main dot com does\nIt bother WVU are his build a community around information you trust the federal government covers only four and a half percent of our costs our humidity covers the rest you value what you hear me\nNow is the time to protect protect independent journalism become a sustaining member of right now here's how [noise]\nBecome a sustaining number by saying that you would like to pledge to WVU are\nOn the basis of automatic payments once a month it could be five dollars ten dollars Fifteen dollars fifty and you can change that I'm Out call and tell the volunteer right now that you would like to be as to stay there or if you'd rather than just make a one time\nUm payment of whatever one time donation we would love that as well here's the number one eight hundred nine zero nine nine to eight seven if you prefer to do it on line where it W. B. U. R. dot org I'm Lisa ... for just a very short time with Jeremy Hobson and Jay Clayton\nAnd you could make your contribution tomorrow but here's why that wouldn't be the best thing to do because tonight at seven o'clock we stopped taking donations that include a chance to win a trip for two to China ten days and nine nights traveling through China with National Geographic expeditions\nSome lucky listener is going to win that trip and the last chance for you to possibly be that person is coming up in just over Ninety minutes from now so make sure you find a couple of minutes this evening before seven o'clock to make your contribution protect independent journalism by supporting WB you are\nThe number to call his one eight hundred nine zero nine nine to eight seven and the website where you can give is W. B. U. R. dot\nOrg by the way that trip to China has a Thirteen thousand dollar value so that is just it would be an incredible trip through Beijing and Shanghai and chunk do are so many places in China this is from National Geographic this is a trip for two people\nAre and that this would just be an amazing opportunity and you can only get in on that today so make your contribution to WB you are right now or W. B. U. R. dot org or one eight hundred nine zero nine nine to eight seven and\nAs you're doing so or as you're thinking about whether to do so think about all of the news that you have relied on WB you are for over the last week just last week and everything that's been going on\nWith Brett Kavanaugh you been able to rely on people like me the Totenberg and Mara Liasson and others to bring you that news and bring you really smart analysis of what is going on\nThat something you rely on us for we're relying on you to help pay for it and by the way again that is just the last week we are talking about an entire year's worth of coverage or that you're supporting in this very important fall fundraiser\nAnd added incentive right now we just have about a an hour and a half for you to call in to make a a and to have a chance to win the trip for two to China with National Geographic expeditions for Cochran works for National Geographic expeditions and we ask them to tell us what a anybody who goes that are going to be it's going to be seen on this trip\nThe people to come on this trip are going to get a private guided visit all through the city and they're going to see some of the highlights of course we're going to make sure they see the Forbidden City were to make sure they get to Tiananmen Square\nBut we're also going to take them to old neighborhoods in the city and they're going to get this intimate private home visit where they're going to meet people and learn about what their lives are like\nAnd this trip is ah Jerry what did you say Thirteen thousand Darlene\nThousand dollar value\nBeing single cent we certainly hope you will when you call in and decide what you want a pledge WB you are here say number again one eight hundred nine zero nine nine to eight seven or W. B. Y. dot org\nThat trip includes roundtrip airfare meals accommodations and again transportation by National Geographic expeditions ten days and nine\nNights you know you never uh may be able to put together a trip like this to go to China on your own so do take a chance at winning it\nEspecially if you know you're going to support WB you are at some point why not do it right now just about an hour and a half left to get in on the possibility of winning that trip to China with your support of WB you are\nAnd know that we really do count on it WB you are able to be commercial free and free of commercial influence in political influence\nBecause we are listener supported bats how critical your support is whether it's a five or ten dollar a month contribution or a hundred dollars a month or five or ten thousand dollars whatever amount as comfortable for your budget is what we're asking you to give but know that we are counting on it to protect this independent journalism\nThere is no more important time of the year and of of any year to protect independent journalism then right before an election and we're just weeks out from the mid term elections\nYou rely on us so that you can know about what you're voting on who you're voting on here in Massachusetts of course everybody's going to be voting on a few ballot questions including one that's kind of confusing about the nurses ballot question number one WB or has been reporting on that you can go to our website even if you missed the story on there you can go to our website and you can look it up and you can hear about\nWhat the two sides are saying about this and and and have some context about what's going on that's the kind of service that we're providing we're asking you to support it right now\nAt one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot\nOrg call before we go back to the news headlines from National Public radio and by the way one of the things that you read them you don't get\nFrom ... the you are on any of the valley questions any story that we cover\nWe don't give you our opinion and tell you how you should vote we don't sway you one way or another we gave you the straight fact we give you a context analysis to help you make up your own mind and we hope that one of the things you appreciate and that's why Oklahoma right now to support has one eight hundred nine zero nine nine she waits Seth thanks [noise]\nThat is NPR's Julie McCarthy she's traveling in Indonesia central ... province thank you very much Julie thank you\nWere funded by you our listeners and by white snake project with video game up are permitted us cyber God's battle at Emerson Cutler majestic theater this weekend more at white snake projects dot org\nAnd Dana Farber Brigham and women's Cancer Center were all patients are cared for by a team specializing in their exact type of cancer patients can schedule and next day appointment learn more you have US DOT org\nI'm WB war reporter Simone Rios when you contributed WB you are you're making sure WB or has the money to foster important conversations without government interference federal tax dollars cover only four and a half percent of our funding the rest of it comes from our community WB you are is not for\nProfit commercials for use in the public can\nProtect independent journalism become a sustaining member of right now here's how [noise] before\nWe go back to all things considered you can call one eight hundred nine zero nine nine to eight seven or go to W. B. U. R. dot org we hope you will becoming a sustaining member means that you a pledge automatically once a month that happened to automatically complex or whatever you like to W. B. U. R. five dollars a month ten dollars a month\nIt could be one hundred dollars a month whatever you can afford and if your budget changes you can change that amount so please make the phone call now we have about an hour and twenty minutes left to go for you to get your name entered into when a fantastic trip for two to China\n[noise] we are asking for your support because Ninety five and a half percent of the funding for WB you are for everything that you get out of his radio station comes from the money listeners put into this radio station so that's why it's important\nTo give that ten dollars a month or whatever it is that you can comfortably put into your budget for WB you are one eight hundred nine zero nine nine to eight seven is the number to call you can also give W. B. U. R. dot org\nWhile you're there to check out the eternal radios we've got these as our thanks for your ten dollar a month contribution\nBut you will want to be quick because we only have a hundred and fifty radios and there are many thousands of people listening right now so before everybody else gets them and you miss out skip the W. B. U. R. dot org or call one eight hundred nine zero nine nine to eight seven\nAnd for a contribution of ten dollars a month to protect independent journalism you'll have a great radio to listen to\nAnd what about this T shirt Jay how much do you have to pledge to get one of these T shirt also ten dollars a month ten dollars a month so just ten dollars a month thinking about that how much does it costs for you to get a cup of coffee\nEvery day or a you know whatever you might be buying in the course of your day you're probably spending ten dollars a month on that easily maybe ten dollars a day on some of the things that you rely on and if you spend Fifteen minutes or thirty minutes everyday listen to the w._b. you are\nBut now as you're driving home because you want to get informed instead of just sitting in traffic and getting bored we're bringing you high quality news and information you know you can count on us for that and we know because it's happened for many years now that we can count on you the thing is sometimes it's hard to make that step and just\nMake that phone call or go to the website and just spend a minute making the contribution but it is so important that you do it right now and as an added incentive as we've been saying you can get in on a trip for to to try to a private expedition basically lease the right one eight hundred nine zero nine nine to eight seven or W. B. R. dot org\nThat's right it'll just be you and uh someone that you want to travel with going there and you can say I'd like to see more geography I'd like to see more archaeology at a guy that you have like died that comes with you and will tailor this to your interest one eight hundred nine zero nine nine to eight ...\nGive us a call or go to W. B. U. R. dot org now just about an hour and Fifteen minutes left to get your name in when you contribute\nTo get a chance to win that trip for two to China valued at about Thirteen thousand dollars so you may never do this for yourself so this is your chance to do it when you support WB you are and protect independent journalism\nEight hundred nine zero nine nine to eight seven is the number to call and the website is W. B. U. R. dot org\nSmall stuff around four and a half percent of all we\nThis is Houston did you see four and a half percent [noise]\nFound strangers are fan\nYeah for most things four and a half percent just isn't enough but did you know that only four and a half\nPercent of WBRC funding comes from the federal government the raft comes from our community do your part right here on earth giant leap for mankind\nOkay yeah that's what we're going to protect independent journalism become a sustaining member right now Here's House\nJust go one eight hundred nine zero nine nine to eight seven or go to W. B. U. R. dot org to make your contribution again we've been saying\nTen dollars a month is a good place to start but if you want you can make a onetime contribution if if two hundred and fifty dollars or something you can do right now the tax deductible contribution you can make a five hundred dollar contribution if you're listening and you've got a little bit of extra money\nMaybe a thousand dollar or two thousand dollar contribution a lot of people do that if that's something they can afford any amount works for us whatever works for you one eight hundred\nNine zero nine nine to a seven or W. B. U. R. dot org thanks so much\nIndependent journalism now and get entered into all of the remaining price drawings in our fall fundraiser including today's price and our grand prize your choice of a twenty Nineteen civil process track or outback provided by city said Subaru Belmont\nGives now at W. B. U. R. died or walk home one eight hundred nine zero nine nine to wait seven\nWere funded by you our listeners about every source in partnership with us saved\nOctober is national energy awareness month energy consultants help homes and businesses find solutions to save energy information about energy assessments rebates custom recommendations and energy saving products that every source dot com\nAnd east meets west catering an e Smeets west at the exchange catering for all life's occasions\nInspired by you peace meets west catering dot com [noise]\nNow to the Supreme Court where today the justices grappled with a difficult death penalty question\nDoes it violates the Constitution's ban on cruel and unusual punishment to execute a convicted murderer who has such severe dementia that he doesn't remember the crime he committed NPR legal affairs correspondent Nina Totenberg reports\nBurned in Madison committed a terrible crime in Nineteen eighty five after leaving his girlfriend's house he returned and shot and killed a police officer who had remained outside in his car to provide protection twice Madison was sentenced to death but the convictions were overturned because a prosecutorial misconduct\nThe third time he was convicted the jury recommended life in prison but Alabama has a unique law that allows a trial judge to override a jury's recommendation and the judge did just that\nMadison has been on death row in solitary confinement in Alabama now for more than Thirty years in that time he suffered multiple severe strokes an MRI shows part of his brain is dead and there is no dispute that he suffers from severe vascular dementia and\nHis lawyer Bryan Stevenson says that Madison is so disoriented that he doesn't know what day a month or a year it is he's legally blind has difficulty walking and slurs his speech\nBut most critically has no memory of the circumstances of this crime the things that the state six to execute inform\nInside the Supreme Court today lawyer Stevenson told the justices that executing them and so incompetent we'd be unconstitutionally cruel and unusual punishment in the past two decades in cases\nAnd then all of a sudden the mentally challenged the justice who provided the fifth and deciding vote was Anthony Kennedy and he has just retired\nInside the courtroom today the justices appeared closely divided chief justice John Roberts asked whether for the purposes of the death penalty dementia is the same as someone who becomes psychotic while in prison\nLawyer Stevenson there would have to be a memory loss plus something else Justice Ginsburg what would the plus B answer brain damage that is the results of an injury so that the brain is incapable of producing memories are creating the kind of rational understanding that this court has required in the past Justice Sotomayor\nSo you're not talking about just amnesia answer no Mr Madison's dementia is so comprehensive that he can explain to you that he has a toilet in itself or his use\nBut he can't hold that memory and he routinely urinate on himself and asked the guards to take him to the toilet\nThe problem in this case Stephenson said is that the lower courts have said that since Madison is not delusional or a psychotic it's All right to execute him the eighth amendment he said is not like the constitutions other amendments it's a mirror of our norms and our values\nAnd what we have argued in this case is that Mr Madison's dementia renders him so frail but we'll dirt and vulnerable\nThat executing cannot be reconciled with the Constitution's ban on cruel and unusual punishment\nArguing for executing Madison was Alabama deputy attorney general Thomas ... junior justice prior a frequent critic of the death penalty asked this question I think if a person in the advanced stages of Alzheimer's what's the purpose of executing that person if you wouldn't executed person who's gets a friend or a delusional\nWait one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org to support independent journalism on WB you are [noise]\nFunding for WVU our weather reports comes from a guy called offering the guy called mobile apps\nWhich stores ID cards and the naval bill paying claim reports directly from your cell phone learn more at ... dot com other supporters include for tax fueled by the needs of patients families and healthcare providers for tax invest in science to strike at the core of serious diseases are T. X. dot com\nFrom Boston University you're listening to Ninety point nine W. B. U. R. FM Boston Boston's largest radio newsroom meditation point seven WVU ate his brief eighty nine point one W ... Brewster\nAnd streaming at W. B. U. R. dot org W. B. U. R. Boston's NPR News station\nLive from NPR News in Washington I'm ... beer President Trump holds a campaign rally in Mississippi tonight his second political event in as many days NPR's Scott Horsley reports Trump says he's seeing strong support among fellow Republicans for Supreme Court nominee Brett Kavanaugh\nTrump's as Kevin O's nomination has become a rallying cry for the GOP and expressed confidence of the closely divided Senate will confirm his nominee by the end of this week\nKevin up has strongly denied allegations that he sexually assaulted women decades ago Trump says he's not concerned by stories of Kevin O's drinking during that period even though the president himself does not drink\nI remember my college days everybody was thinking it was like normal I was abnormal it was totally normal everybody was very good\nTrump defended Kevin O's performance during a congressional hearing which some critics have called overly partisan but the president caution lying to Congress would not be acceptable Scott Horsley NPR News the White House\nSecretary of state Mike Pompeo is heading back to North Korea this weekend to try and push ahead talks on denuclearization NPR's Michele Kelemen reports he'll also visit Japan South Korea and China\nThis would be ... fourth trip to North Korea in less than a year and State Department spokesperson Heather Nauert says he hopes to meet the north Korean leader Kim Jong un who has exchange letters with President Trump\nI haven't been privy to all the letters and the communications are that have gone back and forth but obviously these conversations are going in the right direction and we felt confident enough to hop on a plane or to had there to continue the conversation\nNow where it says the U.S wants to other countries to maintain sanctions and pressure on North Korea in the meantime though China and Russia are calling for an easing of sanctions do support diplomacy Michele ... NPR News the state department\nTime is running out for authorities to find any more survivors from the massive earthquake and resolving she nominee waves that struck Indonesia five days ago the official death toll from the earthquake that struck the western part of the country friday now tops twelve hundred and it's still climbing your Julie McCarthy made her way to a devastated area with an army eight and security convoy\nThere is a high that hug the cold as we move to follow the roads are decent condition it started to rain would sort of added to the misery here there's not a lot of traffic coming out\nWhich you would've expected because a lot of people are trying to leave however there is no gasoline to do that\nJulie McCarthy online retail giant Amazon is taking a major step today now it's going to raise the minimum wage for all us workers to Fifteen dollars an hour starting next month company says that move could ultimately benefit more than three hundred and fifty thousand workers\nMix clothes on Wall street today the Dallas up a hundred and twenty two points the NASDAQ fell thirty seven points this is NPR\nIn Ninety nine WB you are in Boston I'm Lisa Mullen's Columbia gas company has performed about one third of the in home inspections that needs to in the ... valley in order to restore all gas service today the utility said it's checked more than Eighteen hundred homes to look for damage to gas lines and appliances\nFollowing last month natural gas explosions and fires it's also installed five miles of new pipeline out of nearly\nFifty miles it plans to replace the company says it will gradually restore service over the next six weeks you can see the detailed timeline of that plan at W. B. U. R. dot org\nMassachusetts is one step closer to allowing shops to open to sell recreational marijuana for adults use\nState can of us regulators said today they may vote as early as Thursday to approve final licenses to retail shops in Leicester and Northampton\nBefore the shops can open however the state must license an independent lab to test marijuana before it sold and the Boston VA says a patient diagnosed with the legionnaires disease last month likely contracted it from its west rock spray facility the VA says all water fixtures there have since been removed from service\nIn sports Celtics have the preseason game tonight at the garden with the Cleveland Cavaliers Bruins open their season tomorrow\nShould be pretty west overnight tonight under storms possible late tonight temperatures right about where they are now sixty degrees\nAnd then for tomorrow damp early but lots of sunshine for where the bulk of the day in Seventy degrees tomorrow and varying amounts of sunshine through the rest of the week and likely over the weekend as well in Boston now sixty degrees at six past six\nWere funded by you our listeners and by the holiday pops joined Keith Lockhart and the pops for holiday music the traditional thing along and visit from Santa December six to thirty first tickets at Boston Pops dot org\nAnd the John D and Catherine the MacArthur Foundation supporting creative people and effective institutions committed to building more just verdant and peaceful world more information isn't Mac found dot org\nThis is Ninety point nine W. B. U. R. I. Lisa Mullen's going to all things considered and just ... minutes talking about the impartiality of the Supreme Court and whether\nSupreme Court nominee Brett Kavanaugh can be seen as objective when the next little comes around for the U.S Senate We're hoping that this is the kind of news all the news in fact that you've heard today and that you'll hear tomorrow is a kind of thing that you will you support for right now especially right now because we're counting down just about fifty five minutes\nLeft for you to get your name entered into when a trip for two to China\nAnd with me right now to explain more it's like\nWe have a Thirteen thousand dollar trip for two to China provided by National Geographic expeditions the kind of trip maybe you've always dreamed about going on because it will be customized trip for you and the person who goes with you and the guy that takes you through China\nAnd they'll really customize this so that you will see exactly what you want to see ten days and nine nights the kind of thing you might do once in your lifetime the kind of thing because it is value to Thirteen thousand dollars you may never otherwise get to do in your lifetime\nBut here's your chance you could win this trip simply by contributing to WB you are in the Next Fifty four minutes because it's seven o'clock we stopped taking contributions\nThat also include eligibility to win so get your contribution in right now so you don't miss out the number is one eight hundred nine zero nine nine to eight seven one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot O. R. G.\nAnd think about the journalism that you're supporting as you decide whether to call whether to go on line how much to give right now the the reporting from NPR from people who are in war zones all over the world bringing you the news people who are in Washington like Nina Totenberg who's been bringing us such excellent reporting\nA around Brett Kavanaugh in in recent weeks or from people who are covering Congress covering the White House people who are covering what's happening with brags that\nUh who are in China where we're talking about a trip to China NPR has multiple reporters in China based in China bringing the news from that very important country every single day and we're asking for you to support that right now with your contribution only one hour left to get in on this trip to China one hour left\nSo go to the website right now W. B. U. R. dot org and make a contribution you'll be automatically entered in or you can call one of our great volunteers who are in the event room just down the hall from us one eight hundred nine zero nine nine to eight seven\nFifty two minutes to go so please make the phone call right now you don't want to miss out on the chance to win this trip for two to China and by the way it's\nWell then you will automatically be entered into each of the troops that we have to offer so please make the call right now you decide what W. B. or is worth to you one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org\nJay Clayton I just wanted to mention also you know we offered these T shirts that are really great this this uh protect journalism T shirt that was designed by two women who work right here at W. B. you are but did you know they're also address or did not know that they can be because there's a great volunteer out there right now who is has turned to her\nExtra large T shirt into a medium sized dress and it looks absolutely\nWell there you go do something else you may want to choose the thanks for your contribution and and yet again also the tone radios were offering up three of our most popular each on radios you can see them at W. B. U. R. dot org choose one of those is our thanks for your ten dollar a month contribution\nPrince made demos to capture the basic outlines of this on the military court sequences but he didn't stop there he left the clues about how he wanted the songs to\nLoosen water\nDown its you\nWe hear him ad living at the piano and emulating small finishing touched details like echo in other studio affects in testing out all kinds of vocal persona [noise]\nSometimes leaving seeing the drum group piece here [noise]\nThese are intangible they don't show up on the sheet music early on prince understood that these elements were central to sound part of the songs themselves he approached everything even unfinished idea\nAs a performance this gorgeous little cheaper too was recorded for purple rain but trim from the final album\n\nThis is the first full offering a previously on released material from princes storied fault and it sure to upset some diehard fans in part because much of the set has been available in bootleg form for years\nHey the prince who stayed had to start somewhere in these intimate demos blueprints did the vast sonic world you would develop in the studio later offer a window into his process when he started working on the phone prince look beyond the building blocks he treats move\nDeeper and more conflicted better turns out he didn't have to have a fiancee studio or even his trustee guitar for that\nWhole you needed was a piano in a microphone [noise]\nI don't live or where to [noise]\nSee\n\nThat's been the newly released Prince Albert ... and a microphone in Nineteen eighty three are reviewer in common [noise]\n\nJob may oh\nYes [laughter] [noise]\nYou're listening to all things considered from NPR News\nW. B. U. R. supporters include the Boston book festival in partnership with W. B. U. R. October thirteenth ... square two hundred fifty authors kids events workshops music all free Boston book fest dot org and Avi FX advanced audio video and lighting services\nFor meetings matter events that inspired and exhibits would engage Avi FX dot com or passion shows\nThis is Ninety nine WVU on Wall street the down rallied for a second day and rose to an all time high to start off the fourth quarter it gained nearly ... percent today to close at twenty six thousand seven hundred Seventy four\nAs it would be lost a small fraction it ended the session at twenty three twenty make that twenty nine twenty three and ... lost about a half percent a closed at nearly eight thousand all the details on marketplace at six thirty it's now six twenty four\nFunding for WVU ours business report comes from Comcast Business providing Internet service for businesses that depend on that information at Comcast Business dot com Comcast Business Internet voice and TV built for business\nThe forecast now with meteorologist ate up steam\nWe won't have much precipitation as you're heading home this evening but later tonight watch for showers and thunderstorms could be\nAlso a little bit of fog on Wednesday it's cloudy foggy to start then we become partly to mostly sunny during the latter half of the morning and afternoon temperature near Seventy on Thursday a blend of clouds and son quite warm Seventy five to eighty\nFriday sunshine a cooler breeze only near sixty Saturday mostly sunny skies mid sixties Sunday mostly sunny Seventy five to eighty\nBoston Celtics have a preseason game tonight at the garden with the Cleveland Cavaliers right now it is sixty degrees this is Ninety nine W. B. U. R.\nWere funded by you our listeners invite Geico protecting people and their vehicles for over Seventy five years Geico is proud to offer car insurance and more to Massachusetts drivers to additional information at Geico dot com or one eight hundred nine four seven auto that's one eight hundred nine four seven a huge T. O.\nAnd Stan help frame or back bay in Union Square Somerville over forty years and the artist find picture framing museum great costume frames made in their workshop Stan ... dot\nCom if you were wondering why you should play do support to tell you but you are I think on that last story that you just heard was great music from the voltage friends\nThink of the stories that you heard earlier today with uh the debate over Brett Kavanaugh why women are still so radically underrepresented in physics and astronomy and then of course an interview with Donna Strickland herself the woman who won the Nobel Prize for physics today the first woman to do so since Nineteen sixty three\nAnd think of the stories that you're going to hear tonight on marketplace and then later on on point\nAnd a radio Boston later this is what we're asking you to pay for right now and we haven't even gotten into what we have on line and our podcasts so call right now one eight hundred nine zero nine nine to eight seven or go to W. B. or a dot org because in about thirty three minutes\nJay Clayton aside from you going home what else happens\nWell you go home and Germany goes on but even more importantly than that ... a trip to China\nComes off the table a trip for two valued Thirteen thousand dollars somebody who's going to win that and if you'd like that somebody to be you if you want that chance we need to hear from you will help with the contribution to W. B. you are to pay for more of the kinds of stories lease it was just talking about because this is how we are funded\nWith listener contributions we're asking you to\nDo a little bit to protect independent journalism and perhaps get a very big deal in return they Thirteen thousand dollar trip to China\nBut again your chance ends and about half an hour at seven o'clock\nSo find a couple of minutes right now to call one eight hundred nine zero nine nine to eight seven one eight hundred nine zero nine nine to eight seven or go to W. B. U. R. dot org\nJust thirty three minutes left to get in on this trip to China I was just there earlier this year and was in Beijing and everybody said you've got to get\nA became duck or when you're in Beijing you've got to go to this place and get a ... so that everybody has their different recommendations about where to go and finally we decided to go to one of them I Can't remember the name of it now but uh we went to one of those fantastic and then came back and interviewed for here and now David Chang the famous chef\nA and asked him as he had done this this series on Netflix where he traveled all over the world to try to find the best food and all these different places and uh I said in all of your reporting on this what was the best thing that you ate and he said oh it had to be the picking ducking Beijing I said where did you go from turned out he got\nThe same for the women are not only restaurant you do that to recognize so a one eight hundred nine zero nine nine to\nEight seven or W. B. U. R. dot org you're supporting independent journalism on WB or we're coming up on marketplace you're supporting that reporting on everything from the trade deal to the stock market to uh unemployment to minimum wage all the stories that you're brought every single day make your contribution right now\nThirty two minutes to go to get on that trip to China you can go to the same place in half peeking\nDuck I'm going to find the name of it for a million dollars is only like thirty million for to conquer\nIn the U.S as the national geographic expeditions sponsoring this event will take you to a part of the great wall of China that most people never get to see\nWe're going to take them to the great wall of course because you can visit Beijing and not see this extraordinary extraordinary master piece of\nThe product of the human spirit the great while but they're not going to go to the place where so many people do that is right next to a Beijing it's close and it's overrun with folks were going to take them if you are out of town to a place far fewer people get to in a place where the mall is at its best preserved\nAnd they're going to have some real time there to soak it in to appreciate the experience\nDirty one minutes to go to get your name entered in one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot or\nAre lots of goodies available to you including of course the biggest one the possibility of winning that trend or that trip to China but also ah the double\nOn radios three of our most popular ones but there are almost gone we started with a hundred and fifty of them about a half an hour ago we're down to less than eighty of them right now so if you'd like to get one of those ... radios as our thanks for your ten dollar a month contribution\nThat will go a long way over the course of time to protect independent journalism make that contribution before those radios are gone and before your chance to win the trip to China is gone one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot orgy of", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Boston", "day": "02"}