{"month": "10", "state": "MA", "station": "WNNZ", "content": "Here's too many years offering a special pre\nSylvia long term courage as baby ... joined us for an evening advancing ... taught sex and sipping some bubbly are aside car in speaking to your hotel north happened on Saturday December first few clients were bed early bird discount before Wednesday are Seventeen\nGrab your tickets no any PR dot net [noise]\nSo you is next this was the PR news network WINZ am six forty Westfield WINZ FM Ninety One seven Deerfield WFCR eighty eight five HD three Amherst W on a new eighty nine five great Barrington W and a nine Ninety nine Adams W. A. I. C. Ninety One non Springfield\nAnd W. A. M. H. eighty nine three immersed\nIn partnership with Amherst College and UMass Amherst streaming an on demand on NPR dot net it's one o'clock\n\nThis week long says you build your comes to effect too close we explore a bit of scientific speculations a proposition bet based upon\nOther proposition yet proven like man involved in them\nAnd delve into some deep dark space [noise]\nInstill in my town in the Catholic\n[laughter] don't lick the wrong [laughter]\nFinally we take advantage of our visit to beautiful Concord, Massachusetts to review some American history\nAnd you know that was just every bit as exciting as when it first happened [noise]\nCount on says you for a year in the entertainment coming writer [noise]\n\nLive from NPR News in Culver City California I'm Barbara ...\nFour days after hurricane Michael slammed into the Florida Panhandle crews are delivering badly needed food and water the storm left at least Fifteen people dead but authorities fear that number will rise NPRs Amy held reports Michael is claims victims in Florida where it made landfall at its most powerful\nAs well as in Virginia and Georgia\nCadaver dogs and drones have been assisting search and rescue teams here's Florida State fire marshal Jimmy patrolling is\nEighteen hundred men and women since nine o'clock the night of Wednesday the storm as hits have inspected over twenty five thousand dwellings and they're literally physically going door to door and verifying whether or not there's anybody in there that they can help or said\nOver the weekend Reuters reports cruise responding to cries for help in Panama City crow bar to a mobile home freeing a mother and daughter trapped inside emergency officials say they feel that thousands of calls about missing people but with power down and cell service still spotty many may be simply unable to get in touch\nPresident Trump is expected to visit the storm damaged region this week anyhow NPR News\nArabia stock exchange fell by as much at seven percent during the first day of the trading week there as\nA rhetorical tensions with the U.S rise Riyadh says it will respond to any threats after President Trump warned he's severely punished Saudi Arabia over the disappearance and suspected murder of journalists Jamal ... if it's approved the Saudi regime was behind it\nThe Saudis are under additional pressure today as Germany France and Britain issue a joint statement\nCalling for a credible investigation to establish what happened to show me and the complete and detailed south\nStreaming of New England public radio was founded by you in the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com\nForming a new coalition is giving up leaving the country without a government as Teri Schultz reports it's been more than a month since elections left the traditional parties on the right and the left evenly split and a far right nationalist party as kingmaker in Sweden\nSweden's moderate party leader of Christian ... says he done everything he can to try to put together a center right government but his failed\nLast month's elections made coalition building extremely tricky sixty two to three hundred and fifty nine parliamentary seats went to the far right anti immigrant Sweden Democrats party two of the opposition parties partnered with Christ or send the center and liberal parties refused to work with the Sweden Democrats\nThe Christians moderates reject teaming up with the former ruling Social Democrats so the process is stuck\nThe speaker of parliament will now offer another politician the chance to try that's likely to be outgoing social democratic prime minister step and listen who stayed on his caretaker prime minister for NPR News I'm Teri Schultz\nThis is NPR News from Culver City California\nRussian opposition leader Alexei Navalny has walked out of Moscow jail after serving fifty days for the organizing to illegal protest the demonstrations were aimed at opposing a government plan\nTo raise the eligibility age for state pensions and have all the left today vowing to continue the protest baseball's national\nLeague championship series is tied at one game of peace after the Los Angeles Dodgers four to three victory over Milwaukee last night Chuck Quirmbach of member station Wu WM reports Dodgers slugger Justin Turner was one of the heroes\nTurner headed to run home run the top of the eighth inning to Los Angeles to lead a feat came after he struck out four times in game one of the series friday night Turner says he just tried to move on from what he says was probably his worst performance on all fronts\n[noise]\nThe Dodgers victory broke the brewers ... game winning streak the best of seven series resumes Monday in Los Angeles with her first of three contests the national league champion will play either Boston or Houston and the world series for NPR News I'm Chuck Quirmbach in Milwaukee\nIn net Paul rescuers have retrieve nine bodies five climbers and for guides who were killed in the Himalayan Mountains when a powerful storms sweat through their Base Camp this weekend weather conditions kept helicopters from reaching them sooner\nI'm Barbara Klein NPR News\nSupport for NPR comes from the NPR stations\nOther contributors include the law firm Cooley L P with officers in the U.S Europe and China ... advisors entrepreneur as investors financial institutions and established companies around the world where innovation meets the law\nThe anti PR news network is made possible by the corporation for public broadcasting and our sustaining partners listeners who sign up to give a small gift once a month to pay for what they enjoy on the radio become a sustained her at any P. R. dot net [noise]\nThis is an easy our news network from New England Public radio\nWe go and says you we hope to be your curiosity with this show deeply held in Congress about the Jews were right now the leaves and even some of our employers reached their\nI Do think from\nThe performing arts center at fifty one Walden in Concord, Massachusetts welcome to says you a simple game with words played by two teams the first of which sits stereo left columnist critic\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping household live carbon free and the four one three valleys solar dot solar Fox\nRenaissance man former corporate suit he kept a cow and the addict until he had to sell or Mr Murray Horwitz\nAnd filmmaker producer why he no longer goes by James Coleman is a question his uncle's aren't allowed to ask but his answer ... [noise]\n\nWho's going to take on the captain responsibility than I Am buying into the role of captain Carolyn will be the captain thank you to the right team to director producer he plays golf like a pro and he's sitting in for Tony\nCon Mr Sam Weitzman psychotherapist actress she always taught her dog was sweet\nUntil the day he bitter\nMs Constance ... cash and [noise]\nAnd prophet of politics prognosticators burn Jews yeah just never gets old and he knew we were going to say that Mr Barry Nolan [noise]\n\nLed to night by I'll be captain just for the ... it's a\nVery ... captain tonight are game is played in five rounds correct answers are rich ten points or any fraction there are deemed appropriate we always advise our new listeners grab a pen and paper that's how we do it here let's start things off by peeking ahead to the end of the year that is what\nThey call it a medley of odd man out bill comes from W GBH listener Jonathan Young of Boston, Massachusetts five points for finding the odd man out another five for telling me why Carolyn Rudolf [laughter]\n[laughter]\nYep free Murray was in it's a wonderful [laughter] I Need to do is be Sam's absolute because they promised me a picture of ... [laughter]\nA tiny pitcher Martin my we have a very tight score twenty six to twenty five with Carolyn team in the lead as we move on to round it to this is the contribution of W GBH listener David Kaplan of West seems very Connecticut\nThis is the first of the says you bluffing rounds played with a little musical help from our friends series Smith big and the fly by night trio Carolyn each person on your team is receiving a card one of those cards defines a real but unfamiliar word the other two are blank\nThose poor souls must make up a definition on the spot good enough\nTo fool varies team ten points are up for grabs to bury if you can spot the truth teller or to Carolyn if they can't a few moments musically enhanced to come up with it\nStreaming of New England public radio is funded by you and they passed university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot E. D. U.\nI. S. M. U. S. I. ...\nBooks\nBegins for all of us here at says you\nAnd this November has the bystander migrating and the players are hibernating saddle up most women ... to live shows tickets for Montana will be released this week [noise] got yours before the snow the check on line for tickets them all the good Lee details as always says you document\nThat at the Y. Y. O. U.\nThen you pause for a few interested shall announcements\nKeeping up with the news these days can be like drinking water out of a fire hose it's all coming at you all day long on the line with the air\nIf you're on the street I'm Michelle Martin weekend host of all things considered we're here to help you figure it out what matters most\nJoin us every Saturday and Sunday for all things considered from NPR News\nThat supposed to be five o'clock [noise]\n[noise]\n\nPart of Syria Smith\nBegin to fly by night trio violinist series Smith big an east coast guns with Tara chambers cello thank you so much [noise]\nThey have given us a little time with the word ... must ACC I. S. M. U. S. ... and for a definition we first go to Carolyn\nExcess miss academia is full of some odd archaic sounding terms and access miss is this phase during which usually competent graduate student is barely adequate access miss is the Mendoza Line of higher education\nTo grad students baton to thirty nine it's you know basically\nOr Ninety seven could be Ninety seven so it's the kind of slipping competency of a graduate student you sit there and prairie phase temporary phase or pay them enough says that might be it or it might be Murray's definition\nWell I I Wish I could tell you more about this but the comes carols right it does come from academia comes from the field of philosophy and so I guess what Trump is demolish ... or perhaps symbolic logic but if you have a proposition that\n... that's not proven but that relies on other propositions which have yet to be proved then you've got an accent ... so it's a it's a proposition that relies on other yet unproven propositions\nTo delete key promises right it was your name is ... [noise]\nA proposition that is based upon other propositions yet to be proven it's like man evolved from Sam [laughter]\n\nStudy of philosophy was limited to James Brown lyrics so I really don't you know I'm not\nStreaming of New England public radio is funded by you and small ones from a certified naturally grown fruit farm in Amherst offering berries pairs implies that their farms down small ones farm dot com\n[noise] well the card gave this weird thing here this example which I think I get it\nKept the Reno in Costa Blanco since we're very film literate audience it's seen ... quote I'm shocked shocked to find that gambling is going on in here\nAnd that is ... ...\n... sour grapes the faint refusal of something keenly desired\nI can only read the cards so you said that already\nRight [laughter] it doesn't make any sense\nBut I Love the line that follows that which is here you're winning or [laughter]\nAny blood range shoots him a little dirty look white yes so it could be\nSour grapes it could be a proposition that is based upon other propositions to be proven or the temporary state of a graduate student bury your team gets to play with those so team well I saw breweries left\nEyebrows [laughter] which is always tell what he's lying [laughter]\nNever know [laughter] I Know exactly where I had a left I proud [laughter]\nI thought somebody grabbed his injured finger or something but I'm I'm Glad that you admire my\nHealing you know the lady death protest too much how many times he tell us when he was really quite six times seven deadly told us alive even twenty\nI didn't understand Carolyn I I didn't understand her down and it's all basically\nShe was trying to save that into a temporary bad pitch that graduate students have which would basically cover the entire already my graduate [laughter]\nActually think ... is it something like the um\nWe're Caesar a declines the offered the crown three times okay and\nSo uh I don't think it's the best example where Reno\nUh says that line and then gets his winnings but I think it it I I Would believe if he'd use Caesar instead of right now I I Would believe that in a heartbeat yeah so ...\nSo you're you're going for the the triple the triple statement of something that the three main refusal of something keenly desire but as it does it have to come in threes that's no no\nNo no All right you know what I'm going to go for that to\nOkay yep\nWill go because it it's sort of sound snooty will go with [laughter]\nAll right ... they have chosen to go with your definition because it sounds snooty what does your card say\nSnooty great no sour grapes the famed refusal something keenly desired [noise]\n\nI agree with Barry that then Murray you got to work on that eyebrow worry about that I've written for coming up\nWith these are you [laughter] I have come to bury Caesar not ... to ... [laughter]\nThat's where I thought you were going comes from the Greek to affect indifference ten points to berries team for that our score it now stands at twenty six to thirty five with the lead having moved over to berries side of the room let's take just a moment to introduce our scorekeeper for this evening the wonderful Terry's Nobel Williams\n[noise]\nScary if he would for a moment just moved to either the microphones closest to you and let\nUs know what is your age I Am fourteen\nYou had to think about that for a minute\nYeah did you just wait for that [laughter]\nWhat grader in eighth grade cool do you have anything that really excites you in school these days going home\n[laughter] [noise] you will fit in well in the work world [noise]\nWhat do you go home to that excites you\nI think that's enough [laughter]\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping households live carbon free and the four one three valleys solar dot solar [noise]\nLet's move on out around the three ... skin can be just about time to put up a new calendar but before we toss out the old one let's take a moment to ponder some of the wonders things that can happen and have happened as one year ends at another begins\nCarolyn mhm after you make the eighty mile plane or fairy trip from ... to pogo pogo on New Year's\nA sneak peek out our upcoming season says you is hitting\nLive performances in Bozeman and ... where the buffalo world more the by whatever the answer is we are sure to like bring your definitions generalizations coming laugh but learn to live for tickets and the good Lee details hit on over the strategy dot net that essay why why do you\nDid you return after this from home\nThe any PR news network is funded by you and by the PTA providing public transportation to twenty four communities seven days a week all buses accessible for the mobility impaired P. V. T. A. dot com [noise]\nMaking a century [laughter]\nI'm ... and inviting you to join me on an island hopping adventure as New England public radio is planning a trip to Greece next to me will enjoy twelve days with a special group of any the outlets news as we walk ancient archaeological sites and ... and the island wind them take advantage of an early bird discounts before December\nFirst see tenet very and all the details that an E. P. R. dot net [noise]\nFor twenty four seven news stay with the NPR News network at six forty Ninety eight nine and northern birch are county at eighty nine five in southern ... county and online at any P. R. dot net [noise]\nStreaming of New England public radio was founded by you and the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com [noise]\n\nSerious may begin to fly by night trio giving us a little bit of time with the word ... T. O. X. O. P. H. I. L. I. T. E. talks awful like Sam what have you got for us\nIn a time of ancient Greece around the time of the first Olympics you might encounter I'm somebody who pursued sporting endeavors\nAnd um they might call themselves a tux awful like a because\nYou know I'm getting to that [laughter] because\nThey might view themselves as an archery enthusiast\nA tux off the light and gay\nAnd remain show Greek get out of the way my bow and arrow\nI'm a ... D [laughter]\nAn ancient Greek archery fan enthusiast enthusiast thank you that might be it or it may be what constant test for us\nTo ... um or those smaller versions of this still are tied to collect tides and still like my son and the cabins in New Mexico they give off a poisonous\nAir but because they're such remote areas of these caverns they don't pose a threat to the tourists to show up at these places to see these things I've never seen him but anyway I'm certain that caverns\nYeah [laughter] I don't want to encourage people to go there you don't like it don't lick the rocks\n[laughter]\nOr take them home [laughter] oh my God you learn so much here poisonous\nSmall still lag whites and start\nTo lag might teach us little still like the lead ... yeah yeah that could be it or it could be what Barry has for us\n... is a plant that has been manipulated to make it appear to be a miniature of itself you may recall talks awful like is in the uh cherished\nChildren's palm dad put up a Christmas tree so proud for all the world to see the world to him all things seem them when there's children solved the tree was too tall but he's no fool he took a tool and took to himself the kitchen stool talks awfully\n[noise]\nSo that's moving women [laughter]\nWe have a miniature plans we have miniature rock formations and we have ancient Greek archery enthusiasts and Carolyn you get to have fun with those or has been such fun [laughter]\nThank thank you very that was delightful um\nWell we did think it's just sort of had a rock light sound to it yes yes oh well what do you what you had a guy who was a beer that was quite fatal but also low in calories\n[laughter] that's\nI have great less killing [laughter]\nYou know this is my first [laughter]\nThere's a whole new meaning to the very happy hour [laughter]\nUm I\nI don't archery doesn't do it for me I wrote and poison gym\nStreaming of New England public radio was funded by you had all the energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com satellite\nMight be her toys and lash out are offering food is that a travel you know it's interesting that both constants and Barry had miniature\nMm yes so because of the light that they just both happen chance so they looked at each other's cards so it's probably Sam\n[laughter] what do you think I my gut reaction is Constance with the only thing the constants she said New Mexico caverns All right what do you think very\nI knew instantly said look you know poisonous raw right ... ... and I and I don't see a lot of people in um you know luring caverns or anywhere else you know sucking on a slack tide I think that [laughter]\nI Love to either Constance there's channel I don't know if sandwich just trying to for us\nTo ah [laughter] living there\nI haven't bought any one since Nineteen fifty eight [laughter] I I I could go with archery and I could go up you know oh gosh I what what do you think why do you think it's archery 'cause it's Greek sounding and no ...\nNo I think we should go with the constants then what do you watch any of the rock will go with the rock Constance the actor\nThe wrong with constant when Iraq they're going with your definition Twain\nWould you be so kind is to read your card um bluff [noise]\nVery nice that was the boss from Constance that was a buffer blah blah blah blah blah blah blah blah blah so um which one of you has the correct as a nation\n[noise] a ... for like one who was fond of archery\nFive to fifty four we've got berries team in the lead\nWas close to night with a fond farewell to those no\nLonger with us words that is the ones that various major dictionaries have decided to drop\nAnd all because they have fallen into this huge pleased people use your words\nThey belong to all of us [laughter] for ten point beach panelists see whether you can suss out the meanings of the following\nDictionary just cards Carolyn ...\nF. R. I. G. O. R. I. F. I. C. for ...\n... ... cold really cold and delicious [laughter]\nFor a further apart [laughter] can you get the topic what that means it's an unreliable freezer [laughter]\nSign up note I met my down time caller you things the science of ice cream\nYou know what I'm going to give you an eight point sport it's technically producing are causing cold if it is to make something so her eight points for reducing or causing cold okay\nSam your word is ... how do you spell that C. A. S. S. I. N. G. L. E. ... single are you married for ...", "year": "2018", "show_name": "Says You", "city": "Westfield", "day": "14"}