{"month": "10", "state": "GA", "station": "WABE", "content": "As you mentioned that the region is viewing it or at least in Saudi Arabia they're viewing and his possibly will kill us we heard the president pick up on that theme today NPR's international affairs correspondent Jackie Northam thanks as always thank you thank you very much it's here now [noise]\nThis is the boy won W ABE Atlanta and you are listening to hear now thank you for joining us today for the program we are coming up to the end of the program but we wanted to let you know that if you make a contribution to WABC right now we are giving you\nA thank you a gift this is different from something that you would choose as you you know you're in the checkout process but we're going to give you a Fifteen dollar gift card to the restaurant nonstop it's when you make your contribution at a basic membership level or at least five dollars a month as a sustained her\nOr with the one time donation at sixty dollars but the key is you have to make\nYour contribution before the end of here and now we've got about three minutes to do so\nBut since you are listening now why not make your contribution right now and if you joined at even at the basic level of of five dollars a month\nOr you know this we're going to essentially pay for you know your your first quarter of your membership of W. A. B. E.\nSo we like to think that membership is worth it no matter what we're giving away but we hope that you'll take advantage of this was just a few minutes to go please make your pledge again at the basic level of five dollars a month\nAs a ... or sixty dollars a year and when you do so you'll receive a Fifteen dollar gift card to the restaurant nonstop please do it now and thank you six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nWith a new sustaining donation of forty dollars per month you're going to guess will be invited to a behind the sounds lunch in here at the station\nYou'll meet some of the W eighty host producers and reporters to her the station\nLearn how we make great radio and lunches on us\nYour donation to W. ab ... the programs you listen to every day so please join us behind the sounds as a sustained her at forty dollars a month or with a single gift of four hundred and eighty dollars donations to Ninety point want our tax deductible so make your online uh WABC dot org or was it called the six Seventy five five three Ninety Ninety thank you\nWhen you're thinking about contributing to station you've got an angel on one shoulder and the devil on the other\nShows like MORNING EDITION and all things considered to keep me informed [noise]\nYou could do without them really yeah you can get your news from Steve ... down at the coffee shop did you know that the U.S is sending troops to ... it's a big deal\nAnd did you hear someone invented a car that can run on old VHS tapes I don't think Steve altogether reliable well you can read the blogs then do you know the twelve shocking facial expressions that are secretly killing our pets you won't believe number seven I think you hit to public radio you're making the number seven phase right now [laughter]\nListen to the angel on your shoulder quick or call and become a new member of the station today\nYou can do so by calling six seven eight five five three Ninety Ninety or W. A. B. E. dot org okay so we are one minute away from the start of closer look which means we are one minute away from withdrawing the offer that is currently on the table and that is if you make your contribution right now\nYou are automatically going to receive a Fifteen dollar gift card to the restaurant known as\nNonstop you'll get this gift card with your pledge of at least five dollars a month as a sustained her or with a one time donation at sixty dollars are in the in the year so make your contribution now and you could still as you're checking out you can still get any of the other thank you gifts\nThat we have out there uh for example you for ten dollars a month you can still get the great\nAnd that brand new designed for the WABC seventieth anniversary T shirt\nSo there's a lot of reasons to listen and that means there's also a lot of reasons to give please make your gift right now it's six seven eight five five three Ninety Ninety or you can pledge at W. A. B. E. dot org this is not the point one W. A. B. E. at length\n[noise]\nFrom W. H. B. E. in Atlanta which has closer look for Monday October fifteenth I'm Rose Scott\nEarly voting gets underway for the upcoming midterm elections\nI guess one of the main issues is like urban development and transportation but also like not leaving people behind in that process\nAnd there are other concerns from voter suppression to balance security was one of the largest voting regions in Georgia preparing\nI'll ask Richard Baron director registration elections for Fulton County and a conversation with Spelman College professor Dr nine of links and she talks about her research focusing on academic achievement and African American elementary schoolchildren edgy dissect the reason to look across socio economic level that's all on today's show but first this new\nStatements by Atlanta public schools have reflected their unwillingness to reasonably partner with to see the Atlanta on the Gulch\nAnd that process during early voting goes on every day an evening where they are sealed re sealed the seals are broken they verify everything to make sure it's balanced all through early voting\nLet's talk about those poll workers they are they got their training process correct correct you ever find yourself in need of more poll workers had been an issue for you all\nDuring early voting we use a temporary staffing agency so that we're we're fine in that regard on election day we have um what do you all train them or the staffing service no we train that okay yes we train them they recruit them I'm On election day\nWe've we've always had more poll workers available than than slots so\nWe're one of those lucky counties that doesn't have the staffing problem that that certain counties can have\nWhat are they trained how far is in so they turn to the day\nFor election day we start almost a month out because you're talking about Eighteen hundred workers the online training will start actually I'm In early September and then they also do in person training\nDo they have to live within the county what you prefer that they live within the\nCounty yeah they're supposed to live within Fulton County and be citizens\nUm and but we you can't have a\nThey aren't necessarily registered voters because some of them aren't or they can be six of down to sixteen years old really so yes\nAs you know with electric security of great concern in state you know for now uses the electronic system but no actually officially do you work on the change of the system of paper or a hybrid system which were in the state is in looking at in terms of changing you know the system\nI Would like to see some sort of at least a hybrid system um [noise]\nYou know adding uh getting some sort of system where we can still use the Ariz during early voting and just um have ... with a V. pat a verified voter paper audit trail\nUm I have a lot of experience with that ah from two thousand four and five in Nevada and those those work\nGreat uh what early voting you have to have all the ballots styles available during early voting that every location\nThe Ariz make early voting for our listeners ... it's direct recording electronic those are the touch screens screens yeah or yeah so it and if we go to paper\nOn election day that's fine we just need to have a system that allows for high speed scanners if we need to do that or better ... optical scanners than we have right now\nI Want to get your thoughts on this because this pass legislative session ethical Senate build a three sixty three and there were concerns about changing\nOur ... and and changing early voting on Sunday and you you are speaking on behalf of that they only saw a lot of physician what were you in favor of that bill which would have changed some voting times I think it would it be even limited early voting on Sunday\n[noise] well I think there was probably a\nPortion of that yeah I I don't remember the specifics of that bill [laughter] I'm not\nIn favor of limiting early voting time I mean I I think we should be open on both Sundays um that's you know so it works out of the bill you or not and savory others Nineteen there's Nineteen days you can you can be\nWhere we're able to stay open um I think it should be up to the county I mean there are some rural places where you ... on Saturdays and Sundays you you may not have\nUm people that are going to come to vote because it's a it's a large area and they're going to know their voters well in Fulton County we have such a dense urban population\nThat we we need to have um a lot more opportunities Seventy five miles from one end to the other and there's there are a million people in this county so we we definitely need to have more flexible\nHours here we say more flexible hours you may be expanding ours are well\nWe're we're open eight thirty seven Monday through Saturday noon to five on both Sunday and then the last week were open seven to seven the whole week and\nYou think that's enough to like more time would you like to shorten it\nWhat we could ... the ... the state doesn't restrict us in that I mean we could stay open later if we wanted I think my staff might kill me if I if I did that but yeah I think eight thirty seven is fine for the first couple of weeks\nDuring the presidential we did seven to seven the entire time and and that worked out great we ended up having about sixty percent of the people vote early\nAnd I just want to be clear ... so you are not oppose to\nChanging the early voting on Sunday which would have limited pills ours because that was you know sometimes you can't oh everything you read but I Want to be fair and give you an opportunity for you in favor of limit limiting the Sunday voting\nNo no I I think there was something else\nI'd have to go back and read that bill but did you did ... did you did ... I Know what you're talking to what you're talking about is whether city of ... during the city of Atlanta elections\nEvery four years when the city of Atlanta has an election the election day hours or seven AM to eight PM ... none of the other county now the other cities in Fulton County\nAre subject to that there should be the same time for all every the entire county ... part of the mainland is unfolding obviously writer you want Jeb\nWe had to have a full for that municipal election it ended up being a countywide election we ended up having to go get a court order to so that the other\nThirteen municipalities could stay open until eight because Atlanta has to be open seven to eight or the other cities where seven to seven\nIs that an operating dollars issue for you that one extra hour for those are there is\nNo I think it's more like you know if if we can vote seven AM to seven pm for the president\nWhy do we need to be open seven AM to you know the traffic in this city yeah but you know we have we back when that when that law was passed ...\nWe didn't have twenty early voting locations an absentee by mail and all these other I mean we have more voting now than we've more opportunities to vote now than we've ever had so\nThat one hour every four years it's it just seemed to me it was it was a\nThere is a lot of ... that went into going to go into court to get a court order because we had to make we had to get that election we had to make that election streamlined across the county\nThose other cities then had to wait longer to get their results because of the city of Atlanta we couldn't we couldn't have them all stay open till seven and Atlanta stay open tell a otherwise we would have the the procedures we would've had to undergo\nBut you can understand if you look if you look through the lens of someone else saying well this ensures that everyone gets an opportunity to vote\nCan you understand that point and then there's not no one is compromised\nI think back when before early voting um and it it I could if I could see it but when you have when you have Nineteen days devote a head of election day and\nYou you have um absentee by mail I think that that laws probably\nYou know it's out outgrown it's usefulness list has its wants only ever ... it's one hour every four years\nAnd it it's not and it's not an issue as much if it's not a countywide election mhm but if it if it's a countywide election then we have a lot of problem sure\nSo [laughter] so that I I mean that's why that's why I was against maintaining the the the ... the extra hour\nLet's talk about the voter in Fulton County when someone comes to vote what should they bring what should they have\nWell if you want to get through the line\nUm the\nQuickest it would be to have your driver's license because the port or some sand that some form of identification ... well yeah the the driver's license allow supporters to scan it they can't\nThere are other um acceptable forms of identification such as the passport a tribal id military ID or any government id ...\nAs long as it has a photograph on it but if you have your driver's license they can scan that and it and it populate the the software program instantly if the system is work [laughter]\nAnd then let me ask you this the address on that onset identification does it do you need to be able to verify their address right there and they may this may sound like simplistic questions but you know there are folks that don't know\nWell ... ... if the the\nThe address in which the voters registered at is determines which ballot the voter surely get\nSupport for WABC comes from ... Atlanta brew at the zoo fun family Halloween festival October twenty twenty first twenty seventh and twenty eight treats costume contests characters and more for all ages\nMore information on July laughter dot org and from the center for civil and human rights in downtown Atlanta exploring the question of what our human rights uh Seventy days of beauty HR provides the answer through programming content ... tickets and schedule at civil and human rights dot org\nAnd it's a closer look if you missed any of today's conversation catch up on our website at W. A. B. A. dot org slash closer again W. A. B. E. dot org slash ... also wants to hear from you send our health throws\nGot an email at Rhodes at W. A. B. E. that or this is Ninety point why W. A. B. E. Atlanta choice for NPR\nBoom\n\nAnd close will continue zero Ninety point on WB Atlanta choice for NPR's always I'm Rose Scott in right off that conversation and we have some news here to address forced closures of election office in clay Grady Randolph and Turner counties\nDue to hurricane Michael I'm going to do is issued an executive order allowing citizens of those counties\nTo submit voter registration applications through October sixteenth now because some of those officers had to close to the hurricane Michael conversation like we just hedging about voting Jay and Barry joins me now is part of our twenty Eighteenth all membership Dr\nConversations that's what you get your own closer look conversations at the community that that they only need to ... they want to hear\nHad brothers first thank you for having me on 'em and it it's such a critical conversation and I feel like they're such heightened awareness and even more interest thankfully now than maybe in past shares for people to understand the process\nAnd as I was sitting here listening to you guys talked I learned so much whether it was about what is it is and connected to the Internet how poll workers are trained things like that that really help you process the information and understand what's going on and that's what we aim to do and if you value\nThat because that's our commitment if you value that and we asked you to make a commitment to us six seven eight five five three Ninety Ninety or online at W. ab eat out orbits are twenty eight farming should drive\nCloser look this is all about the community and people always say if Canada shows road shows Jacob show it's great showed the meal you show no no it's the community's program\nIt really is these are issues that we know are important you tell us what issues you want to hear you tell us when you don't want to hear something but will you know we'll have an anyway that's what we do we want there's something for everybody\nRight and and giving giving the listener information to form their own opinion and like what you just said it may be an issue that you don't think you're interested in that you don't know that much about but having conversations like that helped open our eyes and help the community understand each other better\nAnd if you if that's something you value six seven eight five three Ninety Ninety or online at WABC dot org and I think that you know for the listener I Try to ask questions that I think the listener Bob and Bruce caving ... losing Sandy Springs there were questions that I had\nSo [laughter] I I I learned something I'm sure there's a Susie in Santa Rosa talking to me there for the um you know so listening to the conversation and I want to tell you about something that happened in my house this weekend signed a six year old daughter ... she has a very perceptive so we're watching gains and she sees a lot of political ads and she's picking up on the tone and she's asking\nMe did they really do that that he did is he really bad and she really bad\nAnd like I said she asked a lot of class and so then she asked saying\nWell well how do you know if they did that or not how do you know who to vote for\nInquisitive liberty you look how do you find out what issues they stand for what they don't as I'm trying to explain her what an issue is and it really made me think of W eighty and specifically of your show you know when you can go to a trusted source that you know what's going to have the conversation that is going to have the multiple viewpoint\nDon inside and have those discussions so for yourself for future generations and you value those kinds of things supporting the station and supporting the show is a perfect thing to do right now you can call six seven eight five five three Ninety Ninety or go to W. H. B. E. dot org\nOn her forget when my little nephew said to me than a rose I was listening to you have a question I said sure like wasn't opinion I don't get one [laughter] it will you opinion you can voice your opinion and he's like I Want to come on the show I'm like what are you a little young but you know maybe\nYou know conversations you never know who's listening and you know the community you all are so important to this mission here at the station your contribution is about what's important to you it really is you know whether it's closer look or city lights\nOr H Johnson you know in our WB newsroom I Can't you know there's so many a column unions um that I watch come up through the newsroom and I've got some colleagues are old like mange embarrassing Martha Dalton ... [laughter]\nYou know we we we're we remember a time when it was only a few folks in the newsroom and our newsroom as grown and I think that's also a commitment to to the mission of this station and the summit disseminating information and also making sure we're in those areas where you may not get to what's happening down at city hall wasn't happening now\nAt the state capital what's happening in a rural part of the state because that's important\nAnd if you value that which I Know you do then your contribution really really matters six seven eight\nFive three Ninety Ninety or online at W. H. B. E. dot org and as always thank you and do\nYou think are cool socks\nCool socks and she really start to but yeah I thought the ... like the file of his skin a little cooler outside it was hard times and I catch all of us thought we have tumblers and all kinds of Fox or are really really cool\nLots of great thanks to show your support and to reflect the reflect what you value valuing W. A. B. E. N. as roses just talking about uh the the newsroom growing and our commitment growing and when we say we're a part of the community we mean that through and through\nRose on your show you guys are constantly out in the community talking to people hearing what they think about where they live what questions they have a you know being on the streets and being a part of the community not just talking about places but going to them I have\nThree community events this week I Will try to get through all I've I've thought about you know you know where's Waldo kind of in my head there's aware is rose this week ... ... it gave me my interest I Will be the south with art center this week\nAlso be at Emory University participating in a panel discussion I'll be at the Hammond house on friday and you know I'm a mountain about you know my cats they miss me but you know what I Do this for a reason one I like being out in the community because that's how you find out what issues are important to people and that's all the feedback I Love the feedback\nYou know it helps us as a team and helping us as a team helps us come up with better segment our paycheck to paycheck series the Affordable housing ongoing series or a T o sixty eight\nInitiative hanging out with T I hearing his story about his initiatives six seven eight five five three Ninety Ninety or on line to WIP eat out or make your contribution because we do all of that for you all we really do\nYeah if we reflect the community and I can say working here that people who are in this building your neighbors they are friends we reflect the community and we appreciate your support so much WABC dot org or six Seventy five five three Ninety Ninety [noise]\nPolitics ... presents a really fair [noise] picture of the news [noise] both how it's covered and what stories are chosen [noise] my name is bill ... [noise] where I live in park hill [noise]\nSince I've lived in Atlanta I've had a hard time getting really good information on public issues here what I get on broadcast TV for instance is just not deep enough and with a closer look\nI really find that I get an in depth analysis [noise]\nWhat's going on locally and it's so important I just don't know where to find that anywhere else [noise]\nMy name is Jill head and I live in the pine hills area of Atlanta\n[noise]\nCommunity issues or what drives the conversations here on closer look I'm Rose Scott tell me what's happening where you live send an email to rose at WABC dot org again that's rose at W. H. B. E. dot org this of member support it Ninety point one W. H. B. E. Atlanta [noise]\n\n[noise]", "year": "2018", "show_name": "Closer Look with Rose Scott", "city": "Atlanta", "day": "15"}