{"month": "10", "state": "GA", "station": "WUWG", "content": "You're listening to your point five tribute Atlanta and GPA removed dot org I'm drew dos and it's a minute before eleven o'clock on point do on the way but first national mood for NPR and Georgia news from the G. P. B. newsroom\nSupport for G. P. D. programs\nWalk on point is on the way but first national news from NPR and George reduce from a gp newsroom\nSupport for G. P. B. programs comes from our listeners\nAnd Georgia State university G. P. B. Atlanta is license to Georgia State university a major contributor to the economic and cultural vitality of downtown Atlanta and the metro Atlanta area more information is available at G. su dot edu\nAnd the savannah food and wine festival November this through a ... a legendary week of food and drink for murder street and throughout the historic district celebrity chefs wind experts and more savannah food and wine festival dot com [noise]\nFrom the University of west Georgia mind be point seven FM Wu WG and W. W. H. do Gerald Ford of Georgia Public broadcasting radio network\n\nMajor funding from the point is provided by Geico offering car insurance as well as services for homeowners and ranchers insurance through the Geico insurance agency additional information can be found at Geico dot com or one eight hundred nine four seven auto [noise]\nFrom the levy or Boston and NPR mignon Fogarty this is on point\nElsewhere [laughter]\nThose immortal words uttered by Neil Armstrong on the lunar surface July twenty Nineteen sixty nine but who was the man who took that giant leap a new movie explores Armstrong's quiet yet enormous life we'll talk with his biographer\nAbout what made him the right man for the job is to termination fortitude steady nice and calm and and the face of professional and personal challenges\nAn excellent point Neal Armstrong\nLive from NPR News in Washington I'm corporate Coleman in Afghanistan the police chief of Kandahar Province has been killed by his own bodyguard the provincial intelligence she was also killed in the local governor was wounded\nThe attack in Kandahar came as they attended a meeting with senior U.S military officials the BBC's signature ... has more\nGeneral of the dog was chief of police in Kandahar Province and puff it opponent to the ... according to local media reports he was killed in a shooting targeting a meeting at the governor's house in Kandahar city a number of other senior Afghan officials to being injured the come onto the NATO forces in Afghanistan\nThe meeting at the governor's house in Kandahar city of other senior Afghan officials had to be an injured the ... NATO forces in Afghanistan they need to be a meeting on harmed than out of on the same responsibility for the attack comes amid escalating violence had to today's elections\nThe BBC's ... the first of some three thousand Honduran migrants traveling north to pass through Guatemala and reached the Mexican border angering President Trump re emerging report ... and U.S authorities are trying to discourage them from traveling farther\nThe leader of the migrants march former Honduran lawmaker ... this was arrested in what the ... as President Trump threatened to cut off us aid to any Central American country that didn't stop the march\nTo hundreds of migrants have made their way to the Mexican border the U.S ambassador to what the other side of yoga issued a statement in Spanish urging the migrants to return\nFrom their it'll ...\nSays the U.S border has never been so protect those who tried to enter legally will be arrested and deported he added he understood people sleep due to lack of opportunities and that the U.S is investing millions of dollars to change that for NPR News I'm ... and\nPresident Trump heads back to Montana today for another campaign rally it's his third visit to the states in July has Montana Public Radio's Eric Whitney reports Trump is supporting the Republican who was hoping to take a Senate seat away from Democrats\nThe president will appear in Missoula a famously liberal enclave in a state President Trump won by twenty points\nA counter rallies being held seven miles away while Republicans are popular in Montana democratic Senator Jon tester won't be easy to beat he's raised more than four times as much money as his Republican opponent Matt Rosendale\nRosendale TV ads feature clips of the president's earlier Montana campaign stops\nJon Tester vote for Chuck Schumer Nancy Pelosi [laughter]\nThe nonpartisan cook Political Report recently shifted its forecast of Montana's Senate race from leans democratic to toss up for NPR News I'm Eric Whitney in Missoula\nOn Wall street the Dow was down Ninety points the NASDAQ is down more than fifty five you're listening to NPR live\nFrom the gp newsroom good morning Andre Dawson just ahead on on point\nAnd stack is down more than fifty five you're listening to NPR\nLive from the gp newsroom good morning I'm drew Dawson just ahead on on point as the new movie about a puddle Evans trip to the moon hits the big screen will take a look at Neil Armstrong the man who made that first\nGiant step but first and she'd be be news the southern environmental law center is suing the Federal Aviation administration for documents related to the proposed Camden county space port GBDs Cindy hill has more\nCenter submitted to freedom of Information Act request in March asking the FAA to publicly release document about environmental impact and possible hazard that space port on Georgia's cast their attorney Brian guest sat the documents describe what will happen if a rocket fails\nDamage to property\nSo far the FAA has not responded in a written statement Camden county commission chair and proponents Kenny star line says it takes time to process complicated and voluminous request but he believes the FAA able complied ... and Cindy hill in Savannah\nSouthern environmental law center is an underwriter of CPB Georgia labor labor secretary mark butler announced this morning that Georgia's unemployment rate to three point seven percent in September matching the national average\nThe last time Georgia's unemployment rate was this low was in May of two thousand one butler says the number of jobs in employed residents is also at record levels largest gains were in construction trade transportation utilities and education slash health services firm or Georgia News Go to G. P. B. news dot org\nSupport for NPR comes from NPR stations or their contributors include progressive insurance what the name your price tool offering a range of coverage and price options to choose from now bats progressive more at progressive dot com or one eight hundred progressive and the corporation for public broadcasting\nDirty point five TPP Atlanta weather forecast partly sunny add to the upper sixties today partly cloudy and in the upper forties overnight friday a mix of sending clouds with new Seventy [noise]\n[noise]\nLast season at NPR I'm making to talk her body and this is on point\n[noise]\n[noise] and or whatever [noise]\nFrom the thunderous lift off the top of the Saturn ... rocket to the lunar lending to the moment on July twenty eighth Nineteen sixty nine when Neil Armstrong took that first step on the moon he carried humanities hopes inhibitions with him\nAs we approach the fifth anniversary of that landing a new film based on uh the only authorized biography of Armstrong is shining a new light on who he was as a person\nCalm measured brilliant and complicated is that we're on point Neal Armstrong hero and humid and and you can join us on air or on line\nWhat do you remember about the moon landing and those first steps that a human being ever took on the moon\nTo that moment did that did the fact that it was Neil Armstrong who did that did it inspire you and what questions do you have about the famous astronaut where at one eight hundred for two three eight to five five that eight hundred for two three talk you can also join us anytime it on ... radio dot org or on Twitter and Facebook and on point radio [laughter]\nWell we're going to start today with a brief look at this new movie it's called the first man directed by Damien ... and here's a clip of it it's where a moment in the film or Neil Armstrong played by Ryan Gosling talks about the value of space exploration\nSpace exploration will uncovered but I don't think it'll be ... exploration just for the sake of exploration [noise]\nI think it'll be more of the fact that it\nAllows us to the things\nMaybe we should have seen a long time ago [noise]\nA scene from the movie first man well joining us now from New York is Alyssa Wilkins Wilkinson film critic for vox illicit welcome back to a point things haven't they you know I think this movie because it's a depicting such a momentous [noise] uh\nWe'll come back to a point thanks for having me\nYou know I think this movie because it's a depicting such a momentous momentous period in American and human history people are reading all sorts of things into it so I mean what's your take on it it is it a good movie\nSupport for ... comes from our monthly sustain years\nAnd the Atlanta Opera presenting west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and eleven at the Cobb energy center tickets at Atlanta Opera dot O. R. G.\nAnd Atlanta Airport district presenting the spin the district Union City grand fun do bike ride this Sunday cyclists can ride from ten to one hundred mile options and stay after for live music for more info visits spin the district dot com oh\nWhat a life changing the bell and what does beyond a reasonable don't really mean\nToy and they don't charge them more on this on their\nG. P. B. present the radio boy beyond reasonable doubt the Troy Davis project by Atlanta way right we know the story follows the death penalty case of Troy Davis joined us attorney among Sunday October twenty first started gp the radio\nReport for on point comes from Sen gauge working to make higher education more affordable\nWith us engage on limited subscription students can access over twenty two thousand the text books online homework access codes and study guides gauge unlimited C. E. N. G. A. G. E.\nDot com and Geico offering auto insurance coverage for cars trucks are SUVs and providing twenty four seven customer service more information on auto insurance Geico dot com horse one eight hundred nine four seven auto [noise]\n\nSome point I'm making a trucker Bertie we're talking this hour about Neil Armstrong the first human being on the moon he made that famous men walk on July twenty Nineteen sixty nine and now there's a new movie out of that largely focused on Neil Armstrong and it's based on the book first men the life of Neil Armstrong [laughter]\nOn July twenty eighth Nineteen sixty nine and now there's a new movie out of that largely focused on Neil Armstrong and it's based on the book first man the life of Neil Armstrong which has been written by James Hansen he's a former NASA historian and professor emeritus of history at Auburn\nUniversity a professor hands and I just want to hear a little bit from Neil Armstrong himself here because it back in two thousand five\nHe gave an interview to sixty minutes I spoke with reporter at Bradley and Bradley had asked Armstrong at one point of this interview about the confidence that Armstrong portrayed when he gave a big thumbs up to ... assigned to the media shortly before um the Saturn five and the Apollo eleven mission took off\nYeah but it's a little bit of a sham either that or you know the reality is a lot of times you get up in the cockpit if something goes wrong somewhere to go back down actually asked you to lift off to truly replace [laughter]\nNeil Armstrong in two thousand and five a game hands and you eat and you write in your book in the movie explores again who Neil Armstrong was as a man his character his demeanor and there's a moment in the book where\nYou write about why Armstrong was picked to be the first man to step on the moon and and not ... and and if I got to have to ask if I had this right Chris craft to is the chief of flight operations in Houston said\nUh that Neal was Neal calm quiet and absolute confidence we all knew he was the Lindbergh type he had no ego meaning what\nWill they knew that [noise] but the the person who are not just commanded the Apollo mission but more importantly in the sense of who was going to become this cold like on the one who stepped out and representing demanded to use the first step onto another heavenly body\nBut this was going to be a big deal to him they imagined that up correctly and uh there was a private meeting between Chris craft ... corps and George Low who was a one of the big officials and the manned space program in ... who was the director down in Houston\nThere was a very private conversation in fact it's this is me don't find this in any records only an oral history coming from Kraft\nUm and and that was that they were having a discussion they they knew that this was going to be a big deal and uh you know to the public what they said was that the person going out first asked Ron going off first would be based on really the interior way out of the ... the way that opened the way the two astronauts were position\nThe person going out for the aspirin going out first would be based on really the interior lay out of the limb to weigh the hatch opened the way the two astronauts were position inside the ...\nAnd that always was what NASA told the public and even told the astronauts as to the reason why they had an eight and a Neal go out first 'cause the way that had to open to be difficult for us to be the first one out\nBut in truth this you know this meeting was really what the decision was based on and that was\nA they knew that Neal is the type of personality that they felt would actually um you know because it could serve as this icon I mean there was a lot of public public relations in a sense too what are you know NASA was doing with the Apollo program and they wanted the right kind of representative for\nFor this and so it was not just a statement about Armstrong or\nBut it was also a kind of a comment on buses I mean they knew Buzz Aldrin quite well and they knew he was a very very professional astronaut but they also knew that personality wise you know bus was quite a bit different than you know he was very extroverted he was\nYou know if he were there was an element of narcissism and buzz honestly uh and they are some commanders in fact when I interviewed Frank Borman who was the commander of Apollo aid form and made it very clear to me that he had told 'em they lightened that he would not accept buzz on his crew\nAnd it wasn't because he wasn't again on a profession astronaut they were just elements of buzz personality which were a little difficult\nAnd Neal could handle them I mean in in ... and he worked together quite well but they just felt that if you know between these two men there was no question in their mind that Armstrong ... would be the perfect next ... a loon bird and buzz would be much more problematic\nAnd think well let's step back in time considerably if we could tell us about a new Armstrong's younger years they hear that maybe first start flying at the age of six\nAnd he took his first airplane ride and lay right okay was sick I ain't got his pilot's license on his sixteenth birthday before he even\nTried to drive an automobile he had little interest in automobiles [laughter]\nWhich is kind of surprising for a boy back in that era but he had become very passionate about airplanes as a small boy he bought he had his mommy saved every penny for from everything he did to buy a model airplanes and he built in in flight magazines of various kinds and uh\nAnd so it was really the passion for airplanes and flying you know in later after he becomes the first man and becomes this iconic figure um some biographers\nYou know in later after he becomes first man and becomes this iconic figure\nUm some biographers or you can read this and a lot of the children's books that have been written about him suggested Neal was\nLooked at the stars and big into telescopes and read science fiction and all that really none of that's true I mean you don't need to get interested in that until much later he was really all about airplanes and what happened was his career\nYou know he may as a pilot going to Purdue University just to become an aircraft designer um you know becoming a naval aviator the flu in Korea than becoming a test pilot he really led him to space was really not any you know terminal passion on his part as a as a boy but really just sort of the\nThe wave of technology at in in flight as was progressing from jets to rockets right out of the atmosphere and he just went with it\nWell in your book you write about how um he loved flying so much I think he told you that when he was a young boy he would dream about it at night that he had this recurring dream of holding his breath and hovering over the ground that he was either and they're flying a or didn't fall but he was just hovering in history\nHe did have that story and what was really a interesting about it was it was very reluctant to tell it to me because he didn't you know he was not the sort of person who really you know um [noise] I mean there was a spiritual side to him but he wasn't the sort of person who\nWho would emphasize you know the element of dreams for example in who he was or what he became\nAnd so he had this recurring dream and so he admitted to it but it was it was almost embarrassed to do it because he you know I think he ended the story to me by saying well I I don't think you want to make too much of that you know\nUh so he was a very practical minded guy and then even as a boy was type of those type of proto engineer looked at things\nThat he was saying like profoundly go a goal oriented very ambitious because he right about how you were saying they said a minute ago but it wasn't necessarily some sort of a passion for space and space exploration necessarily that drove him but that all the great aviation accomplishments had already been done any kind of resented that and it was space that was the next step\nYeah that was a you know he'd growing up in the thirties and there were so lots of first that were happening in terms of violating an aviation and of course reading all those um flight magazines as a boy and and building all those models he was aware of the great pioneering flights of that area of the post of the pre World War two\nI mean all those models he was aware of the great pioneering flights that ear of the post the pre World War two era any kind of thought as a boy well everybody's got those done and and now what's next [laughter] course he didn't realize that there are all sorts of things yet to come\nAnd fill campaigns and I want to talk with you in some detail about an area of Neil Armstrong's life at the movie focuses on quite a bit and that's the death of\nHis two year old daughter Karen I'm so first of all let's let's just pray scene here from the movie the first man and you'll hear Ryan Gosling who plays Neil Armstrong in in his ... he asked about caring staff\nYou know sorry to hear about your daughter [noise]\nThe as we learn more about each other and what matters each morning from five to nine here on a point by GDP Atlanta\nSupport for ... comes from generous listeners like you and out of the blue and historic downtown Blue Ridge for an extensive selection of specialty wines craft beers and wide selection of cheeses from the world over information that out of the deep blue dot com\nAnd room CB and the rooms symphony orchestra presenting master ... featuring music fiber speedy as she makes her state debut in Georgia's Rome ticket information at Rome's symphony dot org\nI'm Robyn Young two time Oscar winning actress Kelly Field dining new best selling memoir revealed that as a child she was repeatedly sexually abused\nAs I started my early career\nDue to today on eighty four five GPA Atlanta and she could be news dot org\n\nSupport for on point comes from Charles River apparel making the new Englander rain jacket since Nineteen eighty three committed to designing apparel to prepare folks for whatever the day has been stored the new fall collection is on view\nMaking the new Englander rain jacket since Nineteen eighty three committed to designing apparel to prepare folks for whatever the day has in store for the new phone collection is on view at the Charles river apparel dot com and\nThen gauge working to make higher education more affordable with an gauge unlimited\nSubscription students can access over twenty two thousand each text books online homework access codes and study guides gauge unlimited C. E. N. G. A. G. E. dot com [noise]\n\nOn point I'm making a chocolate party we're talking today with James Hansen he's a former NASA historian and author of the ... the first man the life of Neil Armstrong\nIt's the book upon which the new movie starring Ryan Gosling is based that movies also called first man and just before the break Jim Hansen was reminding us of of course those immortal words one small step for man one giant leap for mankind it that Neil Armstrong said when he first step foot on the moon\nIn two thousand five ah to sixty minutes Armstrong explained what was going through his mind at the moment\nHe said that those words\nI thought well when I step off are just going to be a little step soon to be there they're down to their what then I thought about all those four hundred thousand people that are given me the opportunity to make that staff thought [noise]\nGoing to be something big something for all those folks and indeed a lot of others that even were involved in the projects so therefore it's kind of a simple correlation sauce\nNeil Armstrong in two thousand five and how remarkably understated is he James Hansen saying yeah I kinda thought it was going to be something big for people who weren't even involved in that kind of a credible correlation saving is he really like their edible\nYou love that phrase simple correlation I mean that that that comes from an engineer I think it is\nBut uh yeah I mean as I said and one thing that I I get let this question a lot you know we did he come up with that phrase long before they landed meals answer always was that he you know there was some dance they weren't going to land I mean there were lots of things that had to go right before they actually could\nLand in why think about what you're going to say when you step out and if you're not even going to do it so he's you know he told me and he's told everyone told everyone is whenever he was asked if he didn't really come up with the phrase until after they had landed and they had a few you know there were a few hours before the to get ready ensued up and and that that he composed\nSo I asked if he didn't really come up with the phrase until after they had landed and they had a few you know there were a few hours before they to get ready ensued up and then if that he composed it in his head while you know after the landing there was very close\nTo say I mean it was supposed to say one small step for man\nWell that's what he thought he did say into you know to his dying day that's what he thought and there's actually been a lot of the crews to call in mouse assistant been done by different experts to see and I I was actually at a Smithsonian demonstration were NASA officials are and they knew back in two thousand four I think it was\nAnd and there was an Australian acoustics a guy who played uh and and he had evidence he thought\nThat in the electronic register of the the sound waves that you could you saw something there that\nWas apparently an attempt to make the aid but it was an audible so I don't know I mean there's no way really I don't think to resolve this completely Neal Neal in the middle way told me said well just put the AM parentheses\nWell Jim Hansen hold on here for just a second because I have to say this and this moment\nA for those people who witnessed the launching of the Saturn ... rocket who saw those grainy TV images of Neil Armstrong and Buzz Aldrin walking on the moon and also by the way we should note Michael collins as well\nAre orbiting around the moon alone has Armstrong and older and we're on the lunar surface it really left a as just a lasting impact on the millions of people\nWho remember it because something totally delightful happened to us this morning we got an email out of the blue from Maria lane she's in Watertown, Massachusetts because she had heard one of our our little promos that we were going to talk to you today about Neil Armstrong said Maria send us email out of the blue\nAnd along with some pictures that she took in Hawaii when um\nWhen the Apollo eleven crew returned to earth and it's just such a wonderful story at that we've invited Murray to be on the show with us as she joins us now real welcome to on point\nI'm making a thank you so much it it's my great pleasure it'd be with you\nIs wonderful to have you and I want everyone to go to on point radio dot org and check out these photographs that Maria sent us because there are these beautiful black and white pictures\nOf the ... the air stream of a light a vehicle that uh Armstrong an older than Collins we're in after they came back to earth what were you doing in Hawaii first of all what happened on that day\nThe vehicle that Armstrong an older than college were in after they came back to earth what were you doing in in Hawaii first of all what happened on that day\nWell I was visiting my uncle Frank uh who and his family we were very close and um I was Thirteen and he was on heck um air force base is commander of a large see one twenty four cargo plane and that was during Vietnam of course\nThe Vietnam War yeah uh so um we were we got word that the NASA mobile quarantine facility a streamlined trailer a would be traveling behind my uncle's house with the astronauts after they touched down in the ocean men were picked up by a ship\nUh-huh I see the pictures that you sent us a if there's one in particular we we see you and your uncle standing there with with the uh the streamlined trailer going by and there's another photograph were Buzz Aldrin isn't that we don't kind of waving a yes\nYes\nAnd the feeling was you know that he would just overjoyed to be home I mean yeah it was a giant step for mankind and they actually returned from the moon\nYeah well so all these years later I'm Maria ... why is it to that you still feel such like a powerful residents to to that moment [laughter]\nWell uh you know I'm Still astonished at the courage of the astronaut their families the ingenuity of the enormous team that made it all happened\nA and there was some discussion about the movie and uh the book um and that they went up in the space capsule that looks like you know maybe a little bit rickety\nCompared to today's sophisticated spaceships it looked like a tin can to be perfectly honest [laughter]\nExactly exactly yeah so it's still so so moving and I'm so astonishing\nWell Maria lean from Watertown, Massachusetts a thank you so much for getting on the phone with us and thank you for sending us those remarkable photographs were going to share them with everyone who wants to see them on point radio dot org\nAgain it's images that Maria took in Hawaii of the mass NASA mobile quarantine unit the streamlined trailer with Buzz Aldrin we from the window after he returned from the moon Maria thank you so much\nOh thank you I'm so thrilled well let's go now to Margot who's calling from Portland Maine Margot you're on the air I ... I wanted to call in and thank you\nSo I'm so thrilled well let's go now to Margot who's calling from Portland Maine Margot you're on the air\nI ... I wanted to call in and thank you for covering this new movie um I'm the mother of three children and a teacher and um when my children were young I always enjoy sharing with them um people who\nUm had her away um tendencies who went beyond kind of the human to sacrifice and can do something for others and\nI ... I came upon them a musician Jonathan Sprout who things a wonderful song about male Armstrong as the first ban on the moon and it was so powerful because Jonathan music is\nEducational but it's also very enjoyable sometimes [laughter] mothers and fathers listening to children's music and they just\nYou know they have to grin and bear at you know but Jonathan's music is\nUm it's beautiful music and the lyrics are educational then you don't feel like you're being force fed 'em and inspire you and he's thinking about\nI'm not only Neil Armstrong buddy things about Samantha Smith who was from Maine and went to the Soviet Union to reach out at a similar time that we're in you know Samantha reached out to the um to to the leader of the Soviet Union and said why is it that we cannot you know we're all human why can we not\nGet along and come to know each other and she traveled there with his dad and um I just think that it's so important in this day and very challenging times politically that can we", "show_name": "On Point (NPR)", "year": "2018", "city": "Carrollton", "day": "18"}