{"month": "10", "state": "GA", "station": "WUWG", "content": "It permitted before eleven o'clock I'm drew Dawson good to have you on here today on the porch five GPA Atlanta and gee we'd be news dot org news from NPR and the G. P. B. newsroom next but it's on point of view point five gp Atlanta\nSupport for D. P. B. comes from our monthly sixteen years\nAre and the G. P. B. newsroom next but its own point of view point five GPS laughter\nSupport for G. P. B. comes from our monthly sustain hers\nAnd Georgia State university gp Atlanta is license to Georgia State university ranked among the top universities in the nation and commitment to undergraduate teaching more information is available at G. S. U. dot\nEdu TBB has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for specialized reporting best anchor and best newscast CPB news stand with the facts\nFrom the University of Georgia with his mind be points when that failed W. W. W. W. A. G. H. G. Carroll of the Georgia Public broadcasting radio network\n\nMajor funding for on point is provided by Geico offering car insurance as well as services for homeowners and rent or his insurance through the Geico insurance agency additional information can be found it Geico dot com or one eight hundred nine four seven auto [noise]\nFrom do you view or Boston and NPR I'm making a chapter of already this is on point\nLarge a young former father in law loves God so young thought learning to love guns to would be a good way to connect with him he got good at shooting really good he became an NRA certified shooting instructor but as a black man gun ownership and gun culture came with complication\nYoung explores those complications in a new memoir and gives voice to the stories of gun owners we don't often hear minority Americans who may carry a weapon for protection but often seen as a threat simply by virtue of the color of their skin and up next on point RJ young on being a black\nMan and a gun owner in America for the news [noise]\n[noise] blind from NPR News in Washington on corporate Coleman us stock markets have fallen this morning the Dow Jones industrial average down one and three quarters present at twenty four thousand eight hundred Seventy four this comes on the heels of volatile trading in Asian markets overnight as NPR's Yuki Noguchi reports\nConcern over a slowdown in Chinese economic growth as well as increase global tensions between the U.S in Saudi Arabia over the death of journalist Jamal ... G are making for dinner and markets\nChinese stock markets reverse some of their sharp gained the recent days and other Asian indices closed down two percent or more that sell off continued among European markets\nReverse some of their sharp gained in recent days and I'm an Asian indices closed down two percent or more that sell off continued among European markets\nIn a U.S weak quarterly earnings from three yeah and and panic pillar concerned that the global economy could be slowing down there was also a sell off and technology stocks as Tobar continues to pave especially volatile Gucci NPR News Washington Turkish\nPresident Recep Tayyip Erdogan told Turkish lawmakers today there are significant evidence to murder a Saudi Arabian journalist ... was planned NPR's Peter Kenyon says everyone is calling on Saudi Arabia to disclose who was behind the plot based on Turkey's evidence\nPart of the evidence that they have is that the Saudi team that showed up in advance of the killing scout it out some areas possibly for disposal of a body including a forest in northeast is ... ah and then he also ah in his remarks called on Riyadh\nTo allow the Eighteen people they've arrested in connection with the show ... death to be prosecuted in Turkey\nAfter a couple of weeks of shifting explanations Saudi Arabia says that ... was killed in a fist fight in the Saudi consulate\nFormer Supreme Court Justice Sandra Day O'Connor has announced she is withdrawing from public life in a statement she says she has dementia O'Connor was the first woman to serve on the U.S Supreme Court [noise]\nTonight is drawing for the record mega millions lottery NPR's Giles Snyder reports the chances of winning are astronomical\nThe mega millions grand prize rolled over when there was no winter for Friday nights drawing the jackpot is now at an estimated at one point six billion dollars winters can choose to repay that about over twenty nine years what most out for the cash option which totals more than nine hundred million dollars\nThat Powerball jackpot may not be as I popping but it's six hundred twenty million dollars for Wednesday nights drawing instilled attention grabber\nAnd attention as what lottery officials are looking for they reduce the odds of winning a jackpot to drive up top prizes that attract more players\nMega millions officials say they expect three quarters of all winning number combination soup and sold by the time the numbers are drawn trials Snyder NPR News\nOn Wall street the Dow is down one in three quarters percent or four hundred and fifty points the NASDAQ is down more than two and a half [noise] this is NPR News [noise]\nShe'd be newsroom good morning I'm drew Dawson just ahead on on point is uh\nAnd this is NPR News [noise]\nCPB newsroom good morning I'm drew Dawson just ahead on on point\nIs America and an arms race ramped up by racial fear we'll explore that this hour but first and she'd be be news governor Nathan Deal announced today that he's calling lawmakers back to Atlanta for a special session to cover the cost so hurricane Michael clean up the\nSession will be goal to order on November thirteenth the AJC reports the session will last about five days\nThe cleanup is expected to cost roughly one hundred million dollars federal disaster aid will likely reimbursed state and local governments for much of that some Republican candidate for governor Brian Kemp picked up another out of state endorsement yesterday this time from Marco Rubio GBDs Ross to rail has more\nBefore the Senate or a campaign of camp at a local restaurant in North land out he used the opportunity to praise the candidate for supporting small businesses and read it right at the need for people to get out and vote\nAlex how you do not wake up on a Wednesday morning to find out that we did not win in a post election\nYou and your circle of friends that are made a difference\nRubio told Kemp supporters to take advantage of early voting and not wait until election day which is in two weeks the latest polls show Brian Kemp and his opponent Stacey Abrams in a dead heat for deep you'd be News I'm Ross corral in\nAtlanta in sports is Lana United manager here about do much to you know has decided not to renew his contract and we'll leave between following the playoffs what team do who's a native of Argentina that he made the decision because he wants to a new challenge and for family reasons\nThe Georgia News Go to GB news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR station other contributors include Subaru featuring the all new three row ascent with seating for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a super will learn more at super ... dot com [noise]\nYou're eighty eight point five GPA at length of weather forecast for this Tuesday partly sunny today a hundred Seventy partly cloudy ended the mid forties overnight Wednesday a mix of sending class with a high here seven [noise]\n[noise]\nFrom WVU are Boston and NPR I'm ... and this is on point growing up the only thing RJ young new about guns was that he was black so guns were dangerous but he fell in love with a white woman and her family loved gun\nSo young feature father in law even brought a bought him a glock a welcoming gesture young went on to become an NRA certified shooting instructor but he says that being black meant that being a gun on earth came with complication\nThis hour on point a young black man's reluctance odyssey into guns\nAnd you can join us or you know a black American who owns a gun and did you purchase it recently\nTell us why and what are the issues that come along not just with gun ownership but as a minority gun order that you feel that you have to be sensitive to think about in America today where at one eight hundred for two three eight to five five that's eight hundred for two three talk you can also join us anytime that on point radio dot org\nOr Twitter and Facebook and on point radio\nAnd joining us now from Oklahoma City Oklahoma is RJ young he's author of the new memoir let it bang a young black man's reluctant odyssey into guns and we have an excerpt of it at some point radio dot org RJ young welcome to the program\nNPR nerd so this is awesome [laughter] that is not the hello than I expected but you just made my day or J. [laughter] thanks so much well you tell a truly interesting and and and and terrific story in your memoir and I just would love it if you could\nUh tell us a little bit about it and I first so first of all what is the first time that you ever held a gun\nOh I guess my passionate review ... gonna have to wait I'm the first time I hold a gun a my ex father in law handed it to me\nI really didn't have an interest in guns I knew them from TB watch one movie a listen to what a rap music but there where they weren't really a part of my childhood and they weren't really are part of my adult life either but this was the first gun that I'd help\nBut there where they weren't really a part of my childhood and they weren't really a part of my adult life either but this was the first gun that I held because it was presented to me\nSupport for ... comes from generous listeners like you and every Schwartz Center for performing arts presenting violinist Daniel Hope exploring unique composers and virtuoso violinist with air a baroque journey on Wednesday October thirty first tickets at art stuff Emory dot edu\nAnd Georgia State parks as things get shorter and temperature start dropping there's no better time to huddle around a campfire at Georgia State parks information and rates available at visit gee a state parks dot org [noise]\nGeorgia governor's race is one of the closest imagination\nFuture of the state is on the line education infrastructure and healthcare\nJoin us for the Atlanta press clubs gubernatorial debate Democrats Stacey Abrams Republican Brian Kemp and libertarian Ted match will answer questions from a panel of journalists the debate is tonight at seven and she'd be the radio and TV [noise]\n\n[noise] more from point comes from the listeners have W. B. U. R. Boston what a program is produced and your NPR station\nCollege mine were consultants work with high school students to identify can achieve their goals in highschool complete the college admissions process going to go shoot merit scholarship award\nCollege wine dot com\nAnd oddly traveled costume troops around the globe designed by countries specialist Taylor declines interest\nOrange formation is available on a huge T. L. E. Y. traveled dot com [noise]\n\nThis is the point I'm making the Chuck ... we're talking this hour with RJ young he's author of the new memoir titled led bang a young black man's reluctant odyssey into guns and we have a a excerpt of that book at our website on point radio dot org and\nBlack man's reluctant odyssey\nInto guns and we have a a excerpt of that book at our website on point radio dot org and energy and just just before the break you were telling us about your your first experience at this massive gun show\nIn in Tulsa, Oklahoma a but a ... there's so much detail that you write about the justice one experience we could spend the whole hour talking about it um but I but I Want to just kind of fast forward to the key moment here is that\nA is that Charles your your uh you are one time father in law are uh he ended up actually buying you know at the un chosen that right\nYeah and I think what people don't take from that is that where I'm from Oklahoma\nGuns or a way of life\nAnd not always for the reasons that we might think were the reasons that we might read about they are integral to the way that fathers get to know their son yeah and\nIn some instances when you're much younger that father might buy you a twenty two rifles so you can go on the Web it's or or you know squirrels or what have you and this was him doing something fatherly for me\nWhich was I mean my first gun\n... what kind of gun was it like twenty six colored maybe like Fifteen part well why did you choose that one because I was interested\nIn self defense as much as any other part a marketing ship came later but at that moment you know we're talking about carrying we're talking about firing weapon we're talking about understanding what lethal force is we're talking about um\nThe mechanics of self defense shooting up since the shooting a and we're talking about why some people\nDead but gun buying firearms in a even as far back is twenty seven twenty twelve and what that meant and it was where many of the conversations that I was having I was not having conversations about shooting better than any ugly out was having conversations about staying alive\nOkay so what was so what was these are conversations you're having with Charles yeah yeah so what was he telling you about why what was his his thoughts about why some people were buying firearms and twenty ten twenty eleven\nPeople want to protect what's there's people\nFeel that that is their right and and\nEleven people want to protect what's there's\nPeople feel that that is their right and and it is I mean we have laws that say this and people are very very interested and letting everyone else no if you come over here\nYou might not walk away and that for many is a deterrent [laughter] [noise]\nI I mean I guess one thing I was wondering is ... ... just before a un after President Obama was first elected we saw a a surgeon gun sales to that ever enter the conversations with you and Charles\nOh yeah and also when I approached this topic with other folks uh it was always a question of how much ammunition might cost right and this is the state where you can buy ammunition sporting goods store you know like we have what are called um\n[noise] at the time or academy sports and you can walk in there and then by any\nReal caliber of handgun ammunition and how much of it people would buy a relates to who's president so for instance now there's there's kind of a surplus in people can't really firearms is as much as they could win a President Obama was\nIn office because a lot of people still harbor to fear\nThat somehow the president was going to round up your guns and tried to take them from you or limit the kind of firearm that you might be able to buy so you should buy this kind of salt right for this kind of handgun a and does while you know\nWere also real fears I've always said this and I I Wish people would really take it to heart because I Do it does not matter\nIf what you believe isn't what someone else believes it matters that you believe that they believe it so if someone tells you they're afraid take them at their word\nDon't tell them to their face that they're wrong irritate them and make them mad\nNow make their fear your fear and then walk through it you know walk walk that out and that's where I was trying to take this conversation or even before you know I I even thought that I might entertained becoming that good with a pistol and I we get stymied mostly for the reasons that we've already spoken about\n[laughter] you know uh I was wondering if you might be\nBecoming that good with a pistol and I we get stymied mostly for the reasons that we've already spoken about\nYeah [laughter] you know uh I was wondering if you might be able to read to us the section of the memoir\nWhere you talk about uh the day that you got home or or ... or or what what you did after you got home with that new clock that Charles your father in law had had purchased for it you could you read that part of the demand more to us\n[noise] yes ma'am Scott lotta Oxford comma is not um\n[noise] that day I got back home with my new gun still in its box I set it on my bed and looked at it for some time I had an open did at the gun show I knew the gun inside the box and never been fired and I knew it was mine I didn't feel proud\nWhat I felt was something more like fear like the fear I was taught to have for the God of the Old Testament the bean who was so much trouble he drowned the planet cast out a favorite son and told her father to murder his son to prove his love\nFear the way I was taught to feel it as a black man trying to earn an education navigate among the police stay out of jail and stay alive\nI knew that the first time I lost respect for that pistol no larger than life just it could kill me or get me killed I open the box and picked up the clock\nI was amazed at how intrude if it was the process of removing the empty magazine putting it back and recognize slide was it really that easy\nA person with a gun tends to feel a lot like Superman with X ray vision laser site and hope smash strength which is why telling that person to use those super powers will generally result in the person looking at you like your the lunatic\nAppointed a gun at the blank white bedroom wall in my second storey apartment and squeezed feeling the hard click of a trigger the soft tap the hammer and an empty chamber\nI put the gun back and it's a case knowing that next week the chamber wouldn't no longer be empty and that this bit of polymer plastic and metal would no longer be inexpensive paper wait for the weapons so lethal I Wish we could invent it [noise] that's RJ\nYoung reading an excerpt of his new memoir led bang a young black man's reluctance odyssey into guns\nInvented [noise] that's RJ\nYoung reading an excerpt of his new memoir led bang a young black man's reluctance odyssey into guns\nAre gay I Wonder if you could explain to folks who are listening to that that X or do you do you showed this deep respect for the power of the weapon in your hands uh some\nUh definitely conflicted feelings about having it at all so how is it that you got from that to being a certified NRA shooting instructor\nI got to a point in my journey that I wanted to answer one fundamental question that was present it to me over and over and over again as a truism the ... was\nA good guy with a gun is better than a bad guy with a gun and I put a question mark at the end of that statement and wanted to find out for myself if that was true\nHere on a point by ... Atlanta\nSupport for G. P. B. programs comes from our listeners and uncle ... University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available at ... dot E. D. U.\nCheckout GB music on our website we feature videos at performances from touring artists and emerging musicians and you can see short documentaries about people who make Georgia music it's at gp news dot org\nOh I'm Peter O'Dowd even among Republican candidates who want to repeal Obamacare they're using appetite to protect coverage for those with preexisting condition which the truth about what repeal means for those people\nThat was the issue plane in the run up to the twenty Eighteen mentor that's next on here in our [noise]\nDue to your point five TPP Atlanta and she'd be be new start\n\nFor on point comes from the listeners of WB you are Boston and your NPR station\n\nSupport for on point comes from the listeners of WB you are and Boston and your NPR station from home advisor matching homeowners with home improvement professional for a variety of home projects for minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd Charles River apparel making the New England to rain jackets since Nineteen eighty three committed to designing apparel to prepare folks for whatever the day has in store for the new fall collection is on view had Charles River apparel dot com [noise]\n\nThis is on point I'm making a trucker ... speaking this hour with RJ young he's author of the new memoir let it bang a young black man's reluctance odyssey\nInto guns or an arcane just before the break we heard Douglas Jefferson their vice president of the national African American gun association [noise] uh I I'm just what you thought of what he had to say that ... that there is a multi ... there were a bunch of reasons why the association was formed a protection to the the desire for self protection amongst\nAfrican Americans and he was also talking about trying to get the word out about\nA African Americans and gun history in America\nYeah and I got to profile dug for the book uh so that was cool and heard his voice in quite some time spin on tape\nBut that's that's the message the message is there is a responsible way to use this there are folks like myself\nWho believe that they should be armed for self defense and there is the historical aspect of guns were taken from people who look like you and that is not something that you get to dismiss out of hand and I take that part a straight to the heart\nSo I'm just wondering I [noise] I I hear Douglas Jeffrey ... saying that a lot of African Americans maybe there is increasing interest in gun ownership because of the concern about self protection and perhaps ... especially in recent years [noise] but\nA A R D did you ever feel like you were actually potentially making yourself less safe by carrying a weapon especially open carry because of the fact of\nImplicit bias or racism in America and I mean I'm dancing around the question but I cannot help but to think of what happened to Philando Castile who was a legal gun owner in America and disclose to an officer that he had a weapon and was shot dead\nAnd help but to think of what happened to Philando Castile who was a legal gun owner in America and disclose to an officer that he had a weapon and was shot dead\nAnd in that incident speaks more to watch the n._r._a. should have done and an opportunity for them to stand up for folks like ... and like Doug Jefferson and the people for which that organization represents but in regard to me\nYou're going to help me man a magnet let me\nLet me let me break it down a I walked into studio right where I'm a member to you as you shut up and I have on a Black Panther sure Scott ... on it because that's what the movie's really about having a Black Panther at\nWhat kind of stand up I wear jumper genes I wear Jordan's I have locks that are rated up if I have a nine millimeter Gluck Seventeen on my hip\nThat ain't going to be the kind of thing that makes people at home and at ease and that has a lot to do with the way that I'm dressed and also has a lot to do with my skin color believe it or not um I Know people don't necessarily want to believe that but I still encounter rooms where I Am not welcome [noise]\nSo I don't get to go all round is is that doesn't matter but I also don't get to go around as if a gun in a room\nIs not bigger than any elephant you can walk in there\nYou're not going to have an open and honest conversation with someone if you know that they have a firearm because that is the threat of hurting you because they don't like what you have to say and that's not correct and that's not right but it is true it is a fear\nSo in the course of getting really good with a firearm I'm also a journalist than I Am asking questions and I'm looking at data and I'm looking at statistics and I'm taking account of my own experience\nAnd what I come to find out is not only am I not safer I'm In more danger if I have a gun on my person if I have a gun within reach\nHey I'm thinking about your former father in law Charles now I mean did did you ever have the did you ever tell them this that that the the very same desire for self protection that made it made him such a firearms enthusiast or even if he shared that desire you\nActually felt less safe a ... because of the fact of race in America when you had the weapon than before you didn't is that something that he he he understood\nLater later as we continue to go through this endless\nPeace in America when you had the weapon then before you didn't is that something that he he he understood\nLater later as we continue to go through this and later as I had my credentials as I had a standing firm which do you have to continue this discussion like we had spoken about I hadn't fired a gun but I also was able to outline this in the book with a use of force attorney here in Oklahoma\nAnd he had a similar discussion with a friend of his uh this attorney was white his friend is black and his friend who he was\nReally respect for for a job and was reading about said hey man when I get pulled over and you get pulled over it's just different and I don't need you to tell me that it's not I don't need you to tell me that people should not judge me by the color of my skin I Need you to recognize that it does happen and to support me\nIn a way you can support me is to speak up for me and the rooms that I'm not in\nThat I'm not allowed in that I might not ever walk into\nAnd I thought that was where I got to with Charles I could see that toward the end\nYeah [noise] well RG hang on here for just a second so many interesting people about this conversation uh or or about this issue I should say I want to bring in one more voice Tiffany where joins us now she is joining us from Cincinnati, Ohio and she's founder of the brown girls project a group that offers\nMakeup workshops and other activities for building self esteem and African American women and girls and she also organizes firearms training classes for African American women Tiffany where welcome to appoint\nHello hello hello thank you for me\nSo so how long have you been a gun owner and and teaching the organizing firearms classes\nI'm organizing the firearm classes side I'm twenty six so a couple of years I'm owning one for about a year\nOkay and so and before that ... guns and your family\n[noise] I'm not really a I have a grandfather from ... Georgia though he was a hunter um so you know he uh old shot gun that he kept out of the daughter that drew granddaughters and we knew what that was but that was our training are interacting with it\nI see so what what uh what was the reason that took you to buy a gun\n[noise] um actually it it it was the [noise] no I don't know if they knew about this heightened racial climate and the area that I live in um that made me say I need to be able to\nThis heightened worry so\nTense climate and the area that I live in um that made me say I need to be able to protect myself and as a single mother or be able to protect my children um during the Trump campaign and you know\nMy children were very very um tuned into what was happening with how the new uh politics and\nI were able to feel the tension arise as well um and they were very concerned and when a Trump gotten off as my son who was Fifteen at the time was very emotional about it and he he was concerned\nYou know what was going to happen to us people were being I'm feeling okay to be more aggressive\nTo say things that they didn't say before\nWho are either they invade your your personal space and he'd heard all these stories what if somebody does something to us and him being you know I have a son and daughter and then it myself I have to protect you guys and I'm like no way kid that's my job and then I thought about it like how would I really protect us\nDo do you ... Hannah I'm ... I'm Sorry I didn't I didn't mean to interrupt there but do you really do you feel now that having a gun has made you and your families safer\n[noise] um [noise] I feel protected I feel that if someone crosses my threshold I have something other than my fist and iron to throw\n'em I feel that at night when my kids were coming home for extra curricular activities and the seasons change and it's gotten darker um if someone were to approach it I definitely feel like I'm I can handle myself and and make my kids have", "show_name": "On Point (NPR)", "year": "2018", "city": "Carrollton", "day": "23"}