{"month": "10", "state": "MS", "station": "WMPN", "content": "The stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson W. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O.\nGreenwood check out what's happening on MTV music radio and listen online at him Bebe on line or gee\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\nEverybody's a comedian well not the greatest in the world if everybody wants it can be I I could live in that kind of world capitalize skis music the San Diego chamber orchestra played it on ...\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\nThink of it in Central Park to third power\nIt's how important the begin woods\nSingular a word was\nTo the beginning it was a place where you could\nGet out in nature in the city\nTo Beethoven famously would walk through the woods and\nThe girls through his Warren yet a man of nature must be a\nThis is your Strauss juniors tribute to the great green ward\nIn Vienna tales from the other was just had\nFive minutes away from the ...\n\nA Chinese composer named ... Shaw here this is shepherds song\nPlayed by the shank like we're ...\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nSomething very little bit but somehow you know I think seems to be all about this either that there is such a personality\nOr the ended at the beginning of tales from the Vienna which Johann Strauss\nJunior\nHere's a symphony by ... heightened remarkable and they usually we're you know in the\nHigh two digits in his symphonies you know sixty seventies eighties I'm beyond a this is the symphony number three by heightened when he was in his own thirties I Don future leading the astro Hungarian heightened orchestra\n[noise]\n[noise]\n\nUm [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\nBats early ... you'll see something the number three in gene major like by the Austria Hungarian heightened orchestra\nThey should know the material a laid back out and be sure coming up a Danish composer named Edward helps\nWho's kind of well you say notable for if you look him up on Wikipedia there's absolutely nothing there except birth and death and where you know\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise] and word hopes dead I'm a contemporary of all those famous ingenious and short lived soak in the nineteenth century ... show pen Mendelssohn\nHe on the other hand live to the ripe old age of eighty four in Denmark this is from his flowers festival in ... John Edwards hopes that music\n\n\n\n\n[noise]", "show_name": "Wait Wait... Don't Tell Me! (Rebroadcast)", "year": "2018", "city": "Jackson", "day": "06"}