{"month": "10", "state": "FL", "station": "WJCT", "content": "[noise]\n...\nSo I can like Johnny dollars are doing\nWell get another caller\nAnd in just about Fifteen minutes the guy who made it one and conspired on the other two killings are going to walk right into your arms through the station outdoor I\nAlways make a lot in your private life and\nHe just shot his partner in this thing money Montgomery craze what about this one guy that was their fondest hope dodging depended on her\nThey bought a gun fire to slugs from it into some costs waste and took the slugs and stuck them in a shotgun show one shot just like both ladies said they heard the shotgun kind of mock would was looking at when he died was really the ... murder weapon\nWow I'll be waiting for a\nWalking him here on power\nTo tell you one early morning bedtime story just before you go off duty he'll give you a picture about a self defense covering\nIts ally the victim was carrying a gun and they had been you would have you did on me but he didn't use the fact\n[noise]\n... item two three four five six seven eight and\nSix hundred and twenty four dollar entertainment\nAmazing the rich widow reached\nExpense account items one through Thirteen inclusive\nA hundred and sixty dollars entertainment\nOr insurance investigators within driving to\nRent the gun item fourteen\nSeven dollars and eighty cents mileage New York to harm\nYou may disagree with that item claiming that I finished the case in Fairfield county\nExpense account totals\nEight hundred and twenty three dollars\nSigned yours\nYour throat late Johnny dollars bars that been though Brian and the title role letters written by Paul Devlin guild out with music composed and conducted by leaps even\nEdmund O'Brian concurrently be seen starring the Harry I'm Popkin United Artists production the old a\nFeatured in our past where Irene federal Walter Burke that'd decor CEO John ... gene base and ed Begley yours truly Johnny Dollar is produce and directed by ... by it\nJoining us again next week when Edmund O'Brian returns and another adventure I'm yours truly\nJohnny Allen\n[noise]\n\nBut isn't gentleman CBS bind to the Here's Senator Bryan McMahon among the capital of coke room over most of the same Columbia stations tomorrow night\nMcMahon is chairman of the joint congressional committee on Atomic Energy\nAnd when he was interviewed by CBS News meant Eric several ride bill should the hell I'm guessing ...\nThis will be the first detailed discussion of a hydrogen bomb and its implications\nRemember the first discussion ... high government official since President Truman historic announcement earlier this week\nRemembered that CBS as capital coke room tomorrow night at ten thirty PM over most of these same CBS station\nIs the beer wearing suddenly Arthur ... that just the whipping humor is also heard every Saturday Night\nThe Columbia broadcasting system\n... magazine focusing on the arts business in culture to enhanced the quality of life and our community September October issue is arby's has twenty fifth anniversary and features the any will fall our calendar or this magazine in depth in touch our biz dot com\nFloor to cancer specialists is dedicated to providing comprehensive oncology services such as national clinical trials at nearly one hundred locations throughout Florida more information can be found online into cancer dot com\nIn HD from palm coast to the golden ... this is eighty nine nine W. J. C. T. F. M. Jacksonville listen to anywhere on your computer or mobile device had W. J. C. T. ...\nNo no this is one patient revival is next right here in eighty nine nine W. J. C. J. so don't you dare shots that dial you all know the laws do also what\nYou mean by that [noise]\nAnd do\nA a on a on that so we do each and every week right here on the job revival good evening I'm Len Fisher the king of the new offers you for writing my time machines\nA little extra so nothing much that great street corner harmony no\nGame by a\nBe in harmony\nPlay Sweeney oh it's\nBeen said many times the greatest music and the good lord gave us is the human born\nWe hear that perfect style in the white here in eighty nine nine the memories continue each and every week\nTo provide a\nNa\n\nNa na I found it on\nThe way\nThis is John ... from a low level that was said goodbye when they're listening to the ... the Bible would lend Fisher in the kingdom you while others on any nine nine ... where we are people in the music a lot\nOh he down down down down down down\nDown down down\n\nDown down down down\n\nDown down down down down I mean\nI don't\n\n[noise] all\nThe\nSame\nJob and I\nDon't know\n\n[noise]\nThat's one will June of January from Nineteen fifty nine and a profile record like a lot of Chicago with oh my law in the middle where you have the charade which some west coast to walk on the aim of record label would please be my love tonight and lady shop out of Philadelphia on a masterpiece record label\nThe Rockefeller's from Nineteen sixty two when deer someone\nYou're in a cameo holds on to do a revival danger in that Goldman or your brothers ... well\nOh God\n... living in la la\nI Do in the theater here who will not good\nAt it re Lee ... is\n\nA law\nNa na na\nNa\n\nNa na na na na\nNa ... you know there\nAre new bigger bigger ...\nMartin number two and they're going to do that and you did in ... new new there ... you would need to hear the news and then ... we should have it\nOn your name\nWill still be among\nPeople who\n\nNa na na ve\nOne then do you do your mom on love a re\nShe oh\nMan ... ... well\nMy knees oh\nOh\n\nOh\nLove you love you knew\nIn a new you know la\nMay be might need a lot\nTheir mom and\nMy well no no oh da da da\nDa da na huh\n\nWell you know I saw a la la\nLa la la la la\nLa la la the a lot to\nMe\nA\nLittle bit on the la la\n... huge whoa\nWhoa whoa whoa\nWhoa whoa whoa a mom Lonnie\nWow wow oh wow wow\nLounge around our our our final\nAnything\n\nA half\n\nWould you are pretty scratchy rough\nCopy but that's the best I could find it was unreal east\nOf course the turtles did Bible whose wedding day and when he gets off the earth angel during a covered the ... song my\nIsland in the ... I'd like to walk in the latest subscribers to the newsletter doo wop rambling Marshall burgers and bill McKay egg every falter in markets ... thank you all for your support if you'd like to get a copy just send me your email\nSend it to me here in eighty nine nine W. J. C. J. Meyer directs the doo wop dot revival Yahoo dot com in this week's edition we'll have a feature on classic sounds one of the great occupy groups in the business day in ... one of the late ... that's a Sunday\nAnd do a rambling and you don't have to wait to hear from classic sound here they are with that's my desire shoes\nBen I'm a\nI'm\nA\nRe a\n\nMy me\n... who\nDo you use the\nEuro\n...\nA\nA\nDiesel\n\nNa na na\nNa na na\nNa na\nNa na Brent gene\nI'm a\n... do\n\nWell on a\nRe a in a\n...\nRow who\nJeeze uh whoa ...\nJeez I'm a\n[noise]\nNo no no\nNo\nNo\nI mean he\n\nWe have um [noise] do\nA lot\nOf a man you know a\nLittle [noise]\nLimit oh\nNo no\n\nA\n\nLot of money you know but a\nReal game\nI'll\nRow [noise]\n[noise]\n\n[noise]\nI Know I\nAh the\nLike\nI\n\n[noise] [noise]\n\nMy I I I\nAh [laughter] [noise]\n\nGod\nOh I like that song has been done by many different groups but that Donnie and the shops do a great job of it from Nineteen fifty eight on the when record label we three and the ... brothers out of Los Angeles would dream a little dream for terrorists and the New York has also did that song\nAnd when he gets off plastic sounds up their brand new heart and soul CD that my desire\nWe're going to bars for the cause but on the other side was slow it down when he was it the five we don't we just have to please don't you dare cut dial\n[noise] I keep up with your favorite local teams which goers highlights an expert analysis to do first coast connect for a weekly segment with veteran sportscaster colpepper first coast connect sports wrap up\nMondays are nine forty five on eighty nine nine W. J. C. T. F. perhaps [noise]\n\nNext time on the world doing a few stretches because it's a hard call I remember they caught the tourists it's warming up to climb ... you might know it as Australia's errors rock the landmark is sacred to aboriginal people\nThey're about to ban climbers from the rock out of respect or do get that but I respect the the rough because all of them to what\n... means in Australia it's on the world weekday afternoon is it three on eighty nine nine W. J. C. T. ...\nMe a", "show_name": "Radio Theatre", "year": "2018", "city": "Jacksonville", "day": "08"}