{"month": "10", "state": "FL", "station": "WJCT", "content": "You've lived up to him and he said why lord God why why did you take this boy did you take when our team needs a wide receiver stand up above the\nCrowd is [noise] and I have some chance of holding on to the bar [laughter] [noise]\nThat wasn't the excitement in itself you understand because we know the weight lose we might not have predicted that will that will turn into some kind of monster from beyond the stars but\nNobody wants surprised that it it was um [noise] now the next day is a professor ... down to Harvard and brought for professors from them that came up and had breakfast in the hot box cafe and then on top of central mountain where they banished York's with off to the office of darkness\nAnd of course that created a star in town we don't get business from Boston [noise]\n\nOne of those professors was was young and and the hot box when they were having breakfast valley noticed he was not wearing the wedding band\nSo after the breakfast Russian kind of died down she went to work and kept up on a famous Boston cream pie you know they say in our town that was just so good that if you served a mammoth little slice of one and he died and cut another ... she would come back to life and ask for a second hoping most towns that hot\n[noise]\nBut you never can tell a knock them just on the off chance that they come back she made that pie and sure enough about to study in the afternoon that young youngest professor did come back by himself the kind of green round the gills and ask for a cup of coffee and she said refills a free you know\n[noise]\nWhat should cut him a slice of pie and said yeah this is on the house too I think you could use it\nBut [noise]\nI don't know there's something about dealing with a great ones that kind of touchy appetite away I guess he took wants to put that costs and looked at the time just pushed it away\nThey got up and left some money on the count and well now twenty dollar bill\nDollar picked it up a pie in the cooler\nStarted to cry she put the twenty dollar bill register\nThing what's wrong with me was from my dad ugly she wanted to\nLive in this town now for Thirty years no man's ever given me a second look what is wrong with me and she felt this terrible ally okay middle the laughter that he looked pretty rundown to solve that she'd been trying she said he said what's the matter\nShe said oh I'm just thinking how terrible it was about that Wilbur lately boy and he started to cry too and says oh certainly watch so she bought him a cup of coffee\n[noise] so do you think you could use this and she gave him that piece of\nPie and he took a little ...\nAfter a while he finished the whole slice and finished his coffee looked up at her and he said that was wonderful\nAnd he said thank you [noise] when she felt better\nShe'd been thinking about Wilbur weight lose mother with any of that was an ugly woman when she was an albino Santa's radio\nAre faced with just all knows that too little red eyes like a rat sauce on the other side of it no Jim\nUgly ugly woman\nBut then we'll but wait Lee was living proof that lived any that's all just off the fella [noise]\nYou might be an Eldridge being from dimensions of Dr men mad\nShe found herself a fella and it's live then he could do that dominates all\nBy there is hope orders all now I guess that's the way I feel to one of these days the rain will end\nAnd the sun will come out and there's hope for the song unless the news from Massachusetts all the men are Eldridge\nAll the women are uncanny and all the children are from beyond the bounds of time [noise]\nA A R T dot org\nDiscover new music at the electro ... Monday through Saturday Night the night only an eighty nine nine of them\nWe've got your show tune in an indirect pressure music from\n\nNews and information all day music at night and intelligence funds for your weekend and this is eighty nine nine W. J. C. T. up in Jacksonville your community your world\n\nBut uh no this is one patient but they weren't revival is next right here in eighty nine nine W. J. J. date so don't you dare jak that dial\nYou all know Cory ... what you\nAbout why the hell out of [noise]\n\nUh online uh that's what we do each and every week right here on the job revival good evening I'm Len Fisher the king of the new operas you for writing my time machine\nA little extra so nothing much that great street corner harming\nGang bar and have a\nBe in harmony\nMan Sweeney although it's\nBeen said many times the greatest using up the good lord gave us is the human born\nWe hear that perfect style in the white here in eighty nine nine with a memory continue each and every week\nTo provide a\nBut I don't know what I mean I had three o'clock rolls around you're buying a a bird and don't\nDown home and then they offer the corner in Rome a band right never joined a boy\nGirl going right into the top you gotta get up and the\nAll day long you been more\nThe you know um\n\n[noise]\n\nGoing right into the lock\nYour patterns of dumping the really hot [noise]\nAll day long you been on the Internet did you know when to\nRock the\nBoat did have a big problem but they\nDon't rock and roll\nThe wrong about his old\nMan can't bear body so\nThat's the late great Chuck Berry from Nineteen fifty seven with school days are working on a documentary on the lake Chuck Berry who passed away last year\nI'll keep you posted is the one that's coming out hopefully in the very near future in the middle of the Camelot from Nineteen sixty five day Nicolas on lead would change a broken hearts and leading us off we had in the hearts or Nineteen fifty four with the bells and St Mary's I'd like to walk in the latest subscribers chore newsletter do our rambling jak for sick\nSuzie Hoover I wing Klein\nRick Jacobson and Paul Michael thank you so much for your support\nIf you'd like to get on board and get a copy every Sunday Morning all you need to do is send me your email send it to me here in eighty nine nine W. J. C. G. my email address is ... ... we Bible at Yahoo dot com era that shepherds Mario ... lead would never felt like this before\n\n\n\n\nWhoa\n\n\nLow yeah maybe\nLove\nA long\nOh\nOh\n\nNo no no no\nNo that's a\n\n\nA new you know he traveled\nBells are ringing every Sunday night on the ...\nThe only black market\nYou've got the new one with Len Fisher thing to do a big nine of them in Jacksonville\nMarried a man\nWell no matter how well you know oh\nMy gosh I don't really\n\n\nKnow\nWhat\nI mean we\nKnow that you\nKnow now that\nWell one of them well my main\nOne on me you know I Try to do oh la\nLa la la la la la\nLa la la la la la la [noise] I Can't remember what I mean you know\nWe're we're all my ma and now we're\nGetting you know how to handle well you're really\nReally\n\nI\nI\nDon't know\nRisk ... D J\n... na ...\nSomething\nThings and [noise]\nMaybe shoo\nThen there's the G ...\nIf she hears you can have been made in any\nI'm sure my mom\nSaying shot [noise]\n[noise]\nDeeds [noise]\nAnything\nThat changed\nMy dream\nDeeds ...\nNa\nBall ball ball ball for you to be made obey bomb bomb bomb bomb bomb bomb you know there were many bomb bomb bomb\nWhile while well ...\nWell you know when\nI'm like oh we ...\nWe really as well you know we do they know a bomb bomb bomb\nYou know when to borrow oh you know we ...\nWe do they do\nThey buy bonds oh wow wow well ...\nWho while while while while wow wow well\nYou know wherever\nThey go oh yeah we do\nKnow bomb bomb or read a little bit by\nA while while well ...\nA little bit so do you do hear that a new ...\nNew la la la land\nWell who are you doing when\nThey bombed oh ... oh man I read a little\nBit by a wild wild well ... ...\nNew bomb bomb bomb bomb bomb bomb bomb bomb bomb\nWhile while while you\nGo to James Dean do it by saying\nOh we're ... the great\nJ. C. A.\nJ. C. A. J. C. there were a little\nWhile revive show or\nOh God to na na\nNa na\n\nNa na na is done you\n\nKnow a lot of non well\nWhen I was a\nMan named oh my ... in\nA while I was thinking about a latte or on\nThe\nLine you know\nWe\nKnow from a bad and\nHe has\nA lot of wind right\nWhen\nOh my God oh no no no no not a\nDone in\nMy family my God oh my\n\nKnow there is\n\nA lot of money\n\nOn my right\nNow you\nKnow I had a damn about I'm trying to have been married to\nA\nNew\nThat's really Wilson and the two masters from Nineteen fifty eight would send you this letter\nIn the matter with Kenny Vance office occupied CD from back in two thousand uh Thirteen when ... and living a saw band McCoy from Nineteen sixty three with Mr DJ that man can do it all he was a producer say go out of Washington DC band McCoy in Mr DJ\nI'm going to write a little bit of raunchy by Dwayne Eddie ended a break on the other side when a slowing down with the correct\nA gale stones the carousel and once again the air's or don't you dare just sat down\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\nOn the next for cars connect a look at the November ballot and how you're the voter can have a say on the future of Jay I'm a list arrived get plugged in with her ... connect sponsored by Baptist Health and north Florida GPL Monday at nine AM on eighty nine nine to B. J. P. T.\n[noise]\n\nOn the next fresh air Jonah Hill because Superbad money ball and the wolf of Wall Street he wrote and directed the new film mid nineties about a group a skate boarders in the mid nineties that's the period when Jonah Hill with skateboarding but he was never great\nBecause to be great skateboarding you have to be willing to swim on your face down the stairs on concrete over and over and over and joined us\nWeekdays at noon on eighty nine nine W. J. C. your community your world oh", "show_name": "Radio Theatre", "year": "2018", "city": "Jacksonville", "day": "29"}