{"month": "10", "state": "GA", "station": "WNGH", "content": "To four seven eight eight or G. P. B. dot org\n[noise]\nSeven forty seven FM WG and believes you be age do you root for the Georgia Public broadcasting radio network [noise]\n\nLive from the G ... Mellon Reinhardt education secretary Betsy the boss visited Georgia Tech today to kick off her rethink school tour\nThe boss heard from Georgia Tech president but Peterson and other officials about several student programs\nAs part of the tour she in the federal student aid chief strategy and transformation officer also demonstrated the new my student aid mobile app earlier this week the education department released the app which allows students to fill out their free application for federal student aid on their cell phones\nSome state corrections employees are getting thousands of dollars in back pay following a federal investigation GB Cindy hill reports\nThe U.S department of labor found Georgia's department of corrections violated federal labor laws for tracking\nAnd paying overtime Michael ... with the U.S department of labor he says employees at forty three facilities receive money\nHas been going on down and back\nGoing forward the state will change how it reports and pays overtime for ... the News I'm Cindy hill in Savannah\nAtlanta based Delta Airlines says Hurricane Florence costs the company thirty million dollars the September Storm caused at least thirty five hundred flight cancellations mostly in the Carolinas delta stock dropped three point four percent yesterday after the announcement\nPartly cloudy this afternoon extreme north east Georgia I could see some isolated thunderstorms the rest of the state will stay dry partly cloudy skies statewide tonight with fog creeping across much of Georgia loose will be in the upper sixties to low seventies\nThen on Thursday partly cloudy skies a new threat of rain tomorrow highs and the upper eighties too low nineties for more news ... news dot org\n\nOr Johnston President Trump's derisive remarks about the woman who accuses Supreme Court nominee Brett Kavanaugh of sexual assault risk alienating key Republican senators\nTrump mock Christine Blasey Ford at a campaign rally last night NPR's Tim Mak reports Kavanaugh's confirmation almost certainly hinges on boats from Senator Susan Collins Lisa Murkowski and Jeff Flake\nNight NPR's Tim Mak reports Kavanaugh's confirmation almost certainly hinges on boats from Senator Susan Collins Lisa Murkowski and Jeff Flake\nTrump mocked Ford's Senate testimony at a political rally in Mississippi his attack on Capitol is accuser was greeted with cheers are winters so I don't remember how\nMany [noise] not so much on Capitol Hill Republicans have a slim majority in the Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nEye and taking everything into a\nThe president yesterday\nCan Dr Ford were totally inappropriate and in my view unacceptable\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nA un tribunal has ordered the U.S to ensure that sanctions against Iran do not impact humanitarian aid or aviation safety\nAs NPR's Michele Kelemen reports Iran is welcoming the decision while secretary of state Mike Pompeo is blasting Iran for abusing the court secretary ... says Iran brought what he calls a merit list case at the international court of justice based on a treaty that he says Iran has been ignoring\nI'm announcing the United states terminating the Nineteen fifty four archery everybody with the wrong this is a decision frankly there's thirty nine years overdue ...\nSays while the U.S is re imposing sanctions on Iran having pulled out of the Iran nuclear deal the Treasury Department is making sure that humanitarian transactions can continue\nBut the secretary ads Iran could be helping its own people rather than arming proxy militias in Iraq Syria and Lebanon\nMichele ... NPR News Washington at journalists group and turkey is calling on the government to look into the apparent disappearance of a prominent Saudi journalist and critic of Saudi policies\nNPR's Peter Kenyon says journalist ... reportedly entered the Saudi consulate in Istanbul on Tuesday and to not come out\nThe Turkish Arab journalist association edits voice to those if the show these Turkish fiance and a friend who said they waited in vain for him to come out of the Saudi consulate the association said in a statement it fears for her she'll be security he left Saudi Arabia last year the ring retribution for his critical writings about the king to\nNPR's Peter Kenyon reporting\nTo show these security he left Saudi Arabia last year the ring retribution for his critical writings about the came to\nNPR's Peter Kenyon reporting on Wall street that Dallas city for ... twenty finds the S. and P. I. Q. this is NPR\nSupport for NPR comes from NPR stations other contributors include exact science is offering color guard for average risk or does over fifty a non invasive colon cancer screening tests that can be used at home by prescription normally information at color guard tested dot com\nIt's all things considered on listener supported it G. P. B. public radio works because of listeners who value programs like all things considered do their part to keep them on the air\nTime is running out on our fault fund drive and we're working on a goal of wrapping up this Dr successfully with your support we love to hear from you before the next three coming up which is a new NPR PBS NewsHour Marist Poll finds that amid the Brett Kavanaugh Supreme Court confirmation battle\nThe share of Republicans saying the twenty Eighteen midterms are quote very important has spiked\nBut first take two minutes right now to make a big difference in the program to expect and enjoy help us get that much closer to the end of this drive with program costs on the rise support right now is especially important please go to a G. P. B. dot org and click donate or call us at eight hundred\nTo two two forty seven eighty eight thank you I'm Ricky diving in here with her it was like that\nAnd this drive a scheduled to end in just a couple of days so please don't put off putting your uh don't put off doing your part until the last day maybe to the last minute make sure that we hear from you right now we're counting on a strong showing of support from you and from all things considered listeners with us this afternoon\nAnd we have a great drawing we have a really cool opportunity to win a one thousand dollar visa gift card\nAll you have to do is call eight hundred to two to four seven eight eight or go online to G. P. B. dot org right now make your gift in support of this fall fund drive\nAnd we'll throw your name in the hat for a one thousand dollar visa gift card that you can use how ever you want one lucky list at the end of all things considered today eight hundred to two to four seven eight eight or gp that word\nListener every contribution makes a difference so be the next important and generous listener we hear from right now\nDon't put it off until the last day do your part right now while you're thinking about it check it off the list for your Wednesday evening gets too busy you're trying to wrap up work or get dinner on the table now is the time take this opportunity at gp beat out or\nGet off the list for your Wednesday evening gets too busy you're trying to wrap up work or get dinner on the table now is the time take this opportunity at gp dot org or eight hundred to two two forty seven eighty eight\nThanks to Elizabeth sellers in Atlanta Dorothy cars ... island and Donald Amos of Augusta for doing their part to support all things considered\nThis is all things considered from NPR News I'm Ari Shapiro and I'd also Chang in the weeks since Christine Blasey Ford accused Supreme Court nominee Brett Kavanaugh of sexual assault\nPresident Trump's response has been relatively restraint that changed completely last night when president from mocked Ford at a rally in Mississippi\nHow did you get home I don't remember how did you get or don't remember where is the place I don't remember how many and today in the\nWhite House briefing room press secretary Sarah Sanders defended the president's comments NPR's Danielle Kurtzleben has been following the president's response to all of this controversy and she joins us now Hey Daniel hello\nSo as we noted the president's tone it shifted dramatically last night and I just want to start out by talking about how his comments last night compared to how he's been talking about Ford up until last night\nSure so late last week after Christine Blasey Ford and Brett Kavanaugh testified before the Senate Judiciary committee Trump had taken a much softer tone towards Christine Blasey Ford\nBy boat or just a motor used very compelling whatever's\nNow he seemed to be sort of ... to the line that congressional Republicans seemed to be hearing to which was something to the effect of Christine Blasey Ford seems credible but you know maybe she's mistaken or I Wish we had more corroborating evidence but a lot of them use that key word credible\nThen last night he got up in front of the crowd and he he was mimicking her and the fact that you know she can't remember every single thing that happened that night so he was really the verging from that line and he was playing it to laugh and cheers from that audience yeah you can hear the tape and so that has people really upset today some\nHow the response has been in the Senate because to get Kavanaugh through Senate Republicans are focusing on two key senators Lisa Murkowski of Alaska and Susan Collins of Maine how either of those two women responded to Trump's comments from last night\nWell they're not happy or Lisa Murkowski has said her words were that it's inappropriate and unacceptable and that Trump's comments could sway her vote now Susan Collins likewise she told CNN that it was quote just\nIt's a inappropriate and unacceptable and that Trump's comments could sway her vote now Susan Collins likewise she told CNN that it was quote just plain wrong what Trump said and she wouldn't say if it would affect her vote you know one thing that has\nBeen swirling in the middle of all of this is the fact that Trump has talked about how he actually emphasizes with Kavanaugh because he himself has been accused of sexual assault of sexual misconduct absolutely\nDo your part right now called eight hundred to two to four seven eight or go to ... dot org\nI'm Audie Cornish from NPR News and if you've been thinking about making a financial contribution to gee please don't put it off any longer donating is easy and it takes just a few minutes of your time [noise]\nAnd think of all the time you spend with and she just listening to NPR favorites MORNING EDITION all things considered fresh air and wait wait don't tell me\nThan there are G. P. D. favorites like on second thought and political rewind [noise]\nWhen you join us for the first time or continue your support you help ensure that the programs that matters you continue to be there for you for your community [noise] the end of the drive is almost here called eight hundred to two to four seven eight eight now or give on line at ... dot org and thank you\nThank you for supporting CPB and thank you for automatically entering or drawing when we hear from you you could be winning one thousand dollar visa gift card\nA pre paid a visit gift card good anywhere visa is accepted even on line it gives you the freedom to buy whatever you want everyone we hear from during all things considered will automatically be entered we're now looking for twelve calls or click buy for thirty that's ten minutes away\nA little more than two minutes\nHere at ... dot org or eight hundred to two two forty seven eighty eight\nAnd we have a great drawing to a thousand dollar visa gift card that we're giving away to one lucky listened and when you call eight hundred to two to four seven eight eight or go to ... or\nIf you've said on the sidelines cheering on air campaigns like this in the past make this the moment that you join our public radio family with your contribution we could be sending you a one thousand dollars\nCampaigns like this in the past make this the moment that you join our public radio family with your contribution we could be sending you a one thousand dollar\nVisa gift card and you can take that thousand dollars in spending however you want the most reliable and important funding for the programs that inform you and enrich your life connect you with the world it comes directly from you have you made your contribution yet\nIf not call us at a hundred to two to four seven eight eight or go to ... dot org [noise]\nHi I'm Scott Simon wonder if this ever happened to you you're on a road trip may be a move to Newtown and you start looking for a familiar shop so your scan up and down the dial\nLet's get to this week's phones gas [noise]\nCall coup be another patch that it [noise] [noise]\n[noise]\nNo no not that\nLike radio you hear the difference every time you're listening\nRight now your contribution to G. P. B. will make coal\nStation runs on financial support from listeners like you to give what they can to help ensure the future of GPA me and then we are\nIn our church or please give on line with the dot org or call eight hundred to two to four seven eighty and thank you\nThank you so much for supporting CPB we'd like to say thanks to Mary who lives in Lawrenceville she says I just moved to the area and I want to support my local station\nI have been a long time supporter of public radio in South Carolina whether you've just moved to Georgia where you're just visiting Georgia\nWe a lot of us have that experience of looking for the public radio station and now you can make that contribution help I stay on track now during the final minutes or final days of our fall fund drive at ... dot org or a hundred to two two forty seven eighty eight\nBest selling author and humorist David ... is coming to Georgia and he's only going to be here for one night she is going to be at the Lucas theater and savannah on Wednesday April twenty four two thousand Nineteen\nAt seven thirty pm now when you support G. P. B. at eight hundred to two to four Seventy date with a credit card contribution of two hundred and fifty dollars we're going to send you something very special to tickets to the David ... live in Savannah in April before they go on sale to the public\nYou're also going to get to join us for a ... a show reception just for ...\nThe David ... live in Savannah in April before they go on sale to the public you're also going to get to join us for a ... a show reception\nJust for GDP donors so called eight hundred to two to four seven eight eight right now the tickets are not available on our website because we have limited quantities and we want to be able to control the inventory so called eight hundred to two to four seven eight eight that gift is two hundred and fifty dollars\nWe have a lot of ground to cover in the final hours of this fund drive we're looking to hear from you right now if you'd like these David Sedaris tickets we'd be delighted to send them to you or they two hundred and fifty dollar credit card contribution on the phone the tickets are not available at our website\nThe number is eight hundred to two two forty seven eighty eight to ... will be reading from his latest works including calypso collection of\nHilarious personal essays many of his fans know that he's very funny and seeing him life really is an unforgettable experience we would send you to tickets these are not yet available to the public when we hear from you on the phone\nWith a two hundred and fifty dollar credit card contribution at eight hundred to two two forty seven eighty eight\nMy name is called ... I live in Fayetteville, Georgia I Am an avid listener of public radio I listen to hardly anything else\nAll things considered would absolutely be one of my favorites for sure [laughter] the title says it all it truly does help you sort of wrap things up and then also kind of bizarre things and and I loved that idea that there's this individuality this unique Mr human life and I think all things considered sometimes highlights that which I really appreciate it [noise]\nWhen I gave my contribution I decided to become a sustaining member mainly because it was just the easiest way and into my budget instead of a one time during the ... there was much easier to give monthly and also there's the opportunity to do a little more\nYou can do a little more at whatever level is right for you at ... dot org or eight hundred\nTo two two forty seven eighty eight your support makes Georgia Public broadcasting a stronger more vital part of your life\nAnd our communities across George and beyond but time is running out half we heard from you yet we're looking for seven calls are clicks and the next five minutes why for thirty be the next caller we receive to keep us on track before for thirty at eight hundred\nTo two two forty seven eighty eight or ... dot org about\nAnother four and a half minutes to get those seven calls are cliques that eight hundred to two to four seven eight or online at G. P. B. dot org and\nB. dot org about another four and a half minutes to get those seven calls are cliques that eight hundred to two to four seven eight or online at G. P. B. dot org and as an added bonus we're gonna throw you in on this drawing for a thousand dollar visa gift card\nOr this one thousand dollar visa gift card is easy to use and its welcome at any of the millions literally millions of locations where visas accepted even online called eight hundred to two to four seven eight eight go to G. P. B. dot org this drive is scheduled to end in just a couple of days so do your part right now\nWe're working together to wrap up this fund drives successfully by for friday\nYour support will help to get us there at eight hundred to two two forty seven eighty eight there are so many ways to participate in your community maybe you volunteer your time or support the organizations who believe in\nWell G. P. B. is part of your community we keep you connected to what's happening with exceptional reporting and we entertain you with shows like wait wait don't tell me and asked me another well right now we're asking you\nTo join the G. P. D. community become a supporter now in the final days of this fund ride you've been meaning to do it now is the time please make your contribution that G. P. B. dot org or call us at eight hundred to two two forty seven eighty eight every\nListener every contribution makes a difference to be the next important and generous listener that we hear from right now joined Jennifer my car and from savannah\nAnd grant Wallace from Atlanta Gregory ... from ... calls and clicks coming in from listeners across the state of Georgia who want to keep all things considered a as a constant companion for them and their car in their home while they're fixing dinner whatever it is that your doing right now\nAll things considered is coming to you because of people just like you who gave that support or to help us continue to bring it out so well we want to do that we want you to help us at eight hundred to two to four seven eight eight or online at gp beat out\nTime is running out on this fund drive every gift to support makes a difference we rely on you to make your contribution now we have an update we're looking for five calls or clicks by four thirty five calls or clicks eight hundred\nTo two two forty seven eighty eight or G. P. B. dot org\nListeners support the funding that comes from people like you build a strong foundation that helps CPB more independent and less reliant on more vulnerable funding sources so if you weren't CPB to keep providing the services and programs you rely on then help strengthen our\nThat's reliant on more vulnerable funding sources so if you weren't G. P. B. to keep providing the services and programs you rely on\nThen help strengthen our base with your financial support do not put it off until the last day do your part right now because they're thinking about it and you're going to get busy you know you are you're listening right now so just take a couple of minutes and do the right thing the amount\nIs up to you what ever is right for you a dollar a day five ten Fifteen dollars a month donate on line at gp beat out or just click the donate button at the top of the page or we would love to take your call\nAt eight hundred to two two forty seven eighty eight thank you so much for supporting ...\nSupport for TB comes from you\nOur listeners and Ogle Thorpe University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available at ... dot edu\nAnd Atlanta parents' fifteenth annual family festivals Saturday October sixth featuring fifty plus fun activities performers story telling and exhibits for more information visit Atlanta parent dot com slash family festival\nI'm an outlier in two ways I mean I was a lawyer for signing the weather in the first place so it was only twenty three out of a\nHundred and sixty some members of the class who signed it in the first place so that may be an outlier in certainly an outlier on with my Proctor and withdrawing from the letter [noise] um so it's it's really only the two of us are amongst that whole group who who did both things do you still consider him a friend\n[noise] yes I I I Hope that we can have a friendship I'm I suspect you might be screened and my calls right now but uh I Hope not\nMark all sorts of Yale Law school classmate of Supreme Court nominee Brett Kavanaugh thank you very much thank you and professor officer now teaches law at the University of St Thomas and St Paul Minnesota\nThe federal government wise so I'm prepared to carry out the Trump administration's policy of separating migrant families earlier this year\nThat it wasn't even ready to has the children nor did he even had a plan to reunite them with their parents that is from a scathing report from the homeland security department internal watched on this week you trace in hand\nIf their parents that is from a scathing report from the homeland security department's internal watchdog this week\nThe administration has abandoned its policy of separating families to deter illegal immigration but only after widespread outrage and after more than twenty six hundred children were already separated from their parents\nTo talk more about the d._a. chess inspector general's findings were joined by NPR's Joel Rose angel hey also so you know we've been hearing all year about the problems with this policy of separating families but what is new in this report that contradicts what we've been hearing from the administration\nWill it contradicts some early assurances that we got from federal officials as this policy was being rolled out here's da chest secretary cures to Nielsen\nIt is important that these miners are very well taken care of I don't believe that ... they are very well taken care of it\nBut this report paints and much less rosy picture the inspector general found that the age as held hundreds of migrant children in border patrol facilities well beyond the legal limit of Seventy two hours in fact federal officials held more than eight hundred migrant children for longer than that including one child who was held for twenty five days\nAnd many of these children were held in metal cages and border patrol facilities near the border until the government was able to find space in shelters that are equipped to has children\nAnd as we mentioned many parents and children had trouble finding each other in the system after they were separated\nWell again at the time officials denied that that was a problem remember here's Alex aides are the secretary of health and Human Services speaking it back in June before Congress\nThere's no reason why any parent would not know where their child is located I could with with just basic keystrokes within seconds could find any child and our care for any parent\nH H s by the way cared for children after they were separated wild da chess had custody of their parents and at the time just said there was a central database of the locations of parents and their children\nAs central database did the inspector general find that central database\nThe inspector general found no evidence that there was such a central database the two agencies actually had computer systems that could not communicate with each other and the inspector general found that when distraught parents tried to track down their children\nThe government sometimes gave them inconsistent or just wrong information in some cases parents couldn't communicate with their kids at all and then what happened to those families\nThe government was ordered to reunify them by a federal judge and it has reconnected more than two thousand children with their parents but the answer\nThen what happened to those families\nThe government was ordered to reunify them by a federal judge and it has reconnected more than two thousand children with their parents but the inspector general's report says that this lack of communication made that reunification process slower\nAnd the process was especially hard for children who are so young that they couldn't speak immigration authorities according to this report made no effort to identify those young children in any way no wristbands and no photographs of them were taken so it was only through communication with the parents that the authorities were able to find these children and reunite them\nStill have federal officials responded to the inspector general's report in any way\nWell as the administration often does it is blaming quote immigration laws that are broken and poorly written unquote\nPh as does say that it deserves some credit for working quote exhaustively to reunite these families although again they were ordered to do so by a judge but the H. S. also acknowledge that the government's computer system still do not communicate across these agencies\nAre there any children who still haven't been reunited with their parents [noise]\nOh yeah more than a hundred and thirty remain in us custody apart from their parents mostly because those parents have already been deported without them back to\nCentral America All right That's NPR's Joel Rose thanks very much Jill\nYou're listening to all things considered from NPR News [noise]\nMontana has become a popular campaign stop for President Trump and vice president Pence so popular that each of them has been there twice in recent months that's because Republicans are trying to unseat to turn democratic Senator Jon tester\nDuring Pence's second visit there yesterday he fired up a rally talking about Brett Kavanaugh's nomination to the Supreme Court Montana Public Radio's Eric Whitney reports\nRunning in a state that President Trump won by more than twenty points tester emphasizes that he can work with Trump he's run an ad listing Nineteen bills you supported that Trump is signed so when vice president Pence spoke in Bozeman yesterday he painted test or as a reliable and reflexes member of the Democratic resistance\n\nWell and reflects of member of the Democratic resistance\nThe or the latest allegations of fully investigated\nSaturn does is already a now voting no on your show off just like even though we're ...\nDidn't take a position on Kavanaugh's confirmation until after last week's hearings were over and then came out against Kavanaugh citing first his record on privacy issues and support for the Patriot act\nFor those reasons and all of the reasons that were brought up last week um I made a decision to vote no on judge Kavanaugh I don't think he has the merits nor the background to uh meet the needs of Supreme Court\nRepublican challenger Matt Rosendale says he'd be a more reliable ally for President Trump and sided the Supreme Court vote as an example\nMyself and a lot of the people are ... are very disturbed with the way this entire process was handled there is a man who has a commendable record and\nHe used to be serving on the bench an absolutely I Would vote for him\nOn paper standing firmly with President Trump would appear to be a winning strategy in Montana the population here skews older whiter than the U.S in general Montana also has the second highest population of veterans per capita of any state guys\nLike Jim hunting film [noise]\nTired after Twenty years in the navy ending felt now volunteers at the airport in Missoula helping arriving tourists he voted for President Trump\nGonna mess around with this country we're going to do something there's no crosses the line a red line to\nWhile heading failed says the hell no didn't vote for President Obama like many Montana voters he isn't easy to pigeon hole\nHe says he's voted for tester before and for Democratic governors Steve bullock in twenty sixteen and he says a candidate support for the president or testers vote on Kavanaugh's nomination won't sway his choice\nNo because I don't use it as a platform to make my decision\nStill plenty of voters do see their vote as a sign of support for President Trump Bozeman retirees Suzie Burton was at a senior community center yesterday near where vice president Pence was holding a campaign rally\nWell I think a precedent marvelously actually\nKeeps his promise [noise]\nI'm not many of them do\nWell President Trump is front and center in the Senate race here\nKeeps his promise to [noise]\nAnd not and many of them do\nWell President Trump is front and center in the Senate race here identity and local issues also matter for example tester has put Rosendale on the defensive about whether national forest in Montana could be privatized Rosendale initially opposed federal land ownership but says he's now convinced that that's not what people want\nAnd test her leans hard on his image as a third generation farmer Rosendale moved to the state in two thousand two after a career as a Maryland real estate developer\nVoters will be watching closely Saturday as the to debate one last time before early voting starts later this month for NPR News I'm Eric Whitney in Missoula, Montana [noise]\nThis is all things considered from NPR News\nThank you for tuning into all things considered on listener supported CPB a family of listener supported public radio stations across the state now including eighty eight point five gp the Atlanta I'm Ricky ... and all things considered as a place where you expect to hear stories like we just heard reported by Eric Whitney from\nMontana about a tight Senate race we hear a lot about the Republicans holding on to the house and Senate well the mid term elections are really a big deal in Georgia and nationwide and that's just a great example of for a minute long in depth look at a very serious race out of Montana\nJust because it isn't happening in Georgia doesn't mean it isn't really important to us here\nWell time is running short on our fall fund drive this is your opportunity to invest in this kind of journalism right now we're asking you to join in this critical effort to keep this kind of news coverage\nThing to be inspired be original and be yourself and visit main dot com [noise]\nNinety seven point seven FM WG Bebe and ... GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nH room for to Georgia Public broadcasting radio network [noise]\n[noise]\nWhy from the TPP newsroom I'm Ellen Reinhardt members of several civil rights groups in the state or joining a federal lawsuit set to be filed against Georgia secretary of state\nThe suit initiated by a journalist researching an article for Rolling Stone magazine accuses Brian Kemp of using racially biased methodology to purchase many as seven hundred thousand legitimate voters from the states rolls over the last two years\nAccording to W. N. A. Z. T. V. the suit asserts that are purge list was generated by across check software program supplied by the Kansas secretary of state and later used by other states Kemp denies the allegations saying zero voters had been removed from Georgia's roles based on cross check data\nKept these as Democrats Stacey Abrams in the November sixth gubernatorial elections\nThe Augusta Chronicle reports American Airlines will offer direct flights from Augusta to Dallas Fort Worth international airport beginning in March Augusta regional airport officials say there will be one departure in a rival each afternoon beginning march third currently American only flies to Charlotte hub from Augusta\nDelta also service says Augusta regional airport with flights to Atlanta\nThe government says thirty eight people in seven states have gotten sick from eggs produced by an Atlanta ... an Alabama poultry farm\nThe food and Drug Administration says the illnesses are linked to salmonella tainted eggs from grave ridge farms the FDA says ten people were hospitalized after coming in contact with cage free eggs from the farm but no one has died the government says recalled eggs were sold to several grocery stores in Georgia Tennessee and Alabama\nAnd the forecast partly cloudy skies statewide tonight with foreign creeping in across much of Georgia by morning those will be in the upper sixties and low seventies it's Michael one\nLive from NPR News in Washington I'm ... beer the White House is defending President Trump's comments about Christine Blasey Ford who's accused Supreme Court nominee Brett Kavanaugh sexual misconduct ... more\nWhite House press secretary Sarah Sanders says Trump was not making fun of for during his remark that Mississippi campaign rally during the event the audience laughed in a plot as Trump question for the count of the alleged sexual assault\nSeemed to me that he was stating facts that Dr Ford herself a laid out in her testimony once again a every single word that judge Kavanaugh has said has been ...\nIn fact that Dr Ford herself a laid out in her testimony once again a every single word that judge Kavanaugh has said has been looked at ... and take apart by most of you in this room\nCanonized categorically denied allegations of sexual misconduct some Republican senators have complained that Trump's remarks were inappropriate ... NPR News the White House\nThe murder trial of Chicago police officer Jason Van Dyke will soon be in the hands of a jury as Patrick Smith from member station WB easy reports Van Dyke so attorneys ramped up their defense today\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut dash cam video showing Van Dyke shooting Seventeen year old the quantum Donald sixteen times\nThat video at the centerpiece of the prosecution's case and she was McDonald walking away from police and Van Dyke keep shooting until his gun is empty even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday then I took a stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot closing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nSecretary of state Mike Pompeo says he is cancelling a treaty with Iran that dates back all the way they're Nineteen fifty five establishing economic relations and consular writes between the two nations\nThe move comes on the heels of a ruling by the United nation's highest court ordered us to lift sanctions against Iran in fact imports of humanitarian goods store does not enforceable Pompeo telling reporters day the ruling is disappointing but also a loss for Ron this is a decision frankly that his thirty nine years overdue\nAround alleges sanctions imposed by the Trump Administration after the U.S withdrawal from twenty Fifteen nuclear deal violate the Nineteen fifty five treaty\nPrivate sector jobs report out ahead of friday's broader base government data on hiring show solid gains last month payroll processing from a deep pie says private sector companies out of two hundred and thirty thousand jobs in September the most in seven months there were games in construction professional in business services and education\nOn Wall street today stocks close broadly hired the Dow Jones industrial average up fifty four points to twenty six thousand eight twenty eight that's a record high but as that goes up twenty five points the U.S and the five hundred closed up two points today you're listening to NPR support for NPR comes from an be used by over three million business\nThe five hundred closed up two points today you're listening to NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring more employers can post jobs and use greener questions to build their short list are preferred candidates learn more and indeed dot com slash higher hand the corporation for public broadcasting\nIs all things considered on listener supported G. P. B. good Wednesday and ... and the wake of sexual assault allegations against his Supreme Court nominee president Donald Trump has been talking about how men feel in such situations\nCould that help his party and the twenty eight in elections that story ahead of the next ten minutes but first public radio works because listeners who value programs like all things considered\nDo their part to keep them on the air that means we're looking for you to do your part right now\nTime is running out on our fall fund drive we're working on a goal of wrapping up this Dr successfully with your support in just two minutes two minutes you make a big difference in the program to expect and enjoy and you help us get that much closer to the end of this Dr\nProgram costs are on the rise so your support right now is especially important while you're thinking about it before you're night gets too busy please go now to gp that Oregon click donate or call us at eight hundred to two two forty seven eighty eight thank you for your support I'm here with Bert Wesley\nHalf the and we have set a new goal as we move into the second tower of all things considered for the next thirty minutes until uh\nFive thirty were looking for twenty eight twenty eight calls are cliques that you and twenty seven others calling eight hundred to two to four seven eight eight going online to G. P. B. dot Ford\nWere working together we need your help to wrap up this fund drives successfully by friday it's your support that's going to get us there you're going to push us over that line so called eight hundred to two to four seven eight or go to G. P. B. dot org be one of twenty eight and the next thirty minutes or so [noise]\nSupport for ... comes from generous listeners like you and eagle eye books located indicator an independent bookstore for readers of all ages featuring new and used titles and knowledgeable staff to guide any search online or in person more an eagle eye books dot com a great guy for good books\nAnd Georgia State university G. P. B. Atlanta is license to Georgia State university nationally recognized as a leader and innovative programs that help students are in their degrees more information is available at G. S. U. dot EDU\nNationally recognized as a leader and innovative programs that help students earned their degrees more information is available at G. S. U. dot edu\nThis is all things considered from NPR News I'm Ari Shapiro and I know said Chang a vote on Brett Kavanaugh's nomination to the Supreme Court could come as early as friday Senate majority leader Mitch McConnell wants it to happen this week though he hasn't scheduled and yet he\nAnd the rest of the Senate or waiting on the FBI to finish its investigation of sexual assault allegations against Kavanaugh\nThree Republicans who could determine the judges fate say they need to see that FBI report first before they make up their minds with this now to talk about the latest is NPR's Scott Detrow who joined us from Capitol Hill Hey Scott how are you also\nAre saying the FBI could complete this report and send it to them as soon as today which would be early because the FBI was given a full week to do this\nDoes this speed give us any clues about the scope of the report\nWell we got one clue in the ... just just a while earlier today we know now that the FBI has not yet talked to one key witness and that's Christine Blasey Ford\nHer lawyers say as of today she has not been contacted by the FBI a lot of top Republicans are fine with that I asked John Cornyn the number two Republican as he got into an elevator earlier today\nWhen we heard from ever says\nOf course referring to last week public testimony a Judiciary Committee chairman Chuck Grassley has said something similar Democrats say this makes no sense of the whole point of following up was to confirm or dispel what Ford and Kavanaugh said so the FBI should follow up here's Democrat Richard Blumenthal who's a former attorney general\nBelieves are follows\nThe interviews creates additional questions [noise]\nSometimes they're re interviews [laughter] very common\nAnd that's an investigation it's got to be more than just check the box okay\nWe have their account OK so clearly there is a big split between Republicans and Democrats are talking about this that split was even more parent last night President Trump spoke at a rally and he mocked Christine Blasey Ford's testimony against Kavanaugh let's let's take a listen to a bit of that\nI did you get home I don't remember how did you get there don't remember where is the place I don't remember how many years ago when [noise]\nWhen we had been saying all along Scott that Kavanaugh's confirmation comes down to a few key Republicans in the Senate how are they responding to what the president said last night\nNot well Arizona Senator Jeff flake\nComes down to a few key Republicans in the Senate how are they responding to what the president said last night\nReally not well Arizona Senator Jeff flake said that what Trump said was kind of appalling\nTo pay for it lifted our dollars go directly into paying for the programs that you rely on the mountains up to you it might be a dollar a week a dollar a day ten dollars a month\nNo matter the amount we're looking for you to not put it off any longer do your part while you're thinking about it because public radio is stronger and better with your support don't let another hour another day or another fund drive go by without doing her part please go now to TPP that work for eight hundred\nTo two two forty seven eighty eight is the number to call thank you for doing your part here with me is that what happened\nAnd we have a lot of ground to cover in these final days of this fund driver looking to hear from you right now and we're looking for a night team by five thirty just a little gal update for you there were down to nine team by five thirty that's human nature you know there is calling eight hundred to two to four seven eight eight for going online to gp that or what\nWould you do if all of a sudden you had a thousand dollars to spend any way you choose now is your chance for that to happen\nBecause when we hear from you now you'll automatically be included and are trying to win a one thousand dollar visa gift card eight hundred\nTo two two forty seven eighty eight that's the number to call to enter or go online to G. P. B. dot org and when we hear from you we hope that you will also make a contribution to G. P. B. or listening right now that means you value this service\nThink about putting some financial backing to keep this service strong don't put it off until the last day do your part right now and entered to win a one thousand dollar visa gift card at eight hundred to two two forty seven eighty eight or G. P. dot org\n[noise] Hi I'm Cindy hill statewide host of all things considered on G. P. B. I'm based at ... news bureau in Savannah and my reporting takes me out into waters along Georgia's coast from the grilling oyster industry\nYou really are sending your or you moved\nThere is a lawn Georges ... from the grilling at least your industry\nYou really are sending your or you moved to guard\nThe effects of warming ocean water on Georgia shrimp too when it gets cold day just starts slowing down slowing down if it gets too cold well they never start up again I talked with scientists wildlife experts and fisherman bringing you stories of what's happening in Georgia's waters males who followed George and sea turtles onshore\nWe're still seeing an increasing trend\nIn things so that really good news for longer population to Georgia\nAnd introduce you to close to burn like Cumberland Island snowy eatery now minted on us quarters\nAt the native bird it is absolutely beautiful bird that draws a lot of attention due to its size and its beauty\nCovering the coast bringing you the story each day on the air and online you make all of that and more possible thanks for listening to the baby and thanks for your support [noise]\nWe're looking for your support itchy P. B. dot org or eight hundred at two to two forty seven eighty eight your support makes Georgia Public broadcasting a stronger more vital part of your life in your community is across the state and beyond\nYour support helps pay for coverage of Georgia's coast that are wonderful natural ah environment so many great stories that CPB reporters bring you every single day and this is your opportunity before our time runs out have we heard from you get ... dot org or eight hundred to two two forty seven eighty eight\nAnd there are lots of ways that we can say thank you during this drive one of them I think is especially cool is our window to the world's combo when you make your gift to Fifteen dollars a month as a gp be sustained or we can send you to think you gifts one is the brand new window to the world\nA long sleeve blue T shirt has this great looking graphic on the front or that his brand new for this campaign\nAnd the matching mega Moby goes along with another shirt comes in size is\nFrom small through double excel it is a hundred percent cotton and that ... that Meg I'm August porcelain and holds twenty full ounces of your favorite beverage you cannot you know you have that at work for a day's worth of coffee or at least certainly soup I think once we said there was a Super Bowl with a handle\nCall you a hundred to two to four seven eight eight go to G. P. B. dot org make that give to Fifteen dollars a month as a gp be sustained and we'll say thank you with the window to the world combo [noise]\nHi my name's Brent [noise] I live in ... park\nI like to Georgia wide\nHi my name is Brenda I live in ... [noise]\nI like to Georgia wide focus of the station as opposed to being Atlanta sent for\nThe local content and contacts that I get from listening to [noise] to CPB [noise]\nIt's my save the state I was born in\nAnd it really is important to know what's going on in Georgia\nFor people that don't contribute because they think you know I couldn't afford much and and so you know it's not worth it that it's really the people that are contributing big\nBucks for that matter and it's just not true I mean the station survive\nOn the small continuous donations of listening audience so whatever your reason as it it feels really good to give and not the living off of other people's donations and [noise]\nI can speak from experience once we started contributing that changes the dynamics dramatically you are you're at a different place in your life you're supporting public radio and here to start a fire will continue [noise]\nI Can't imagine life without a [noise]\nYou have a needing to support CPB because you can't imagine life without TPP so now at the time to support it cheap eat out or or eight hundred to two two forty seven eighty eight as we just heard the PBS special\nThat only because we bring you a great program so because we bring you state wide coverage of Georgia and no matter where you live in our state we're able to connect you with stories\nThat only from your community but from communities across Georgia's so you're fully aware and engaged with all of the issues voices stories coming out of Georgia the impact all of us this is worth your investment at whatever level is right for you at ... dot org or eight hundred to two two forty seven eighty eight\nThe most important and reliable funding for all those programs that enrich you ah connect you with the world it all comes from you have you made your contribution yet we count on you to help us cover the cost of the programs you here and when you do that you're going to help us in this campaign successfully by friday only just a couple of days away\nA Richard from Alpharetta, Georgia called in and said I Love political rewind such a fan of the local\nCoverage that we bring you hear an G. P. B. and also in from savannah I said I Love GB I feel educated every day but the quality of the shows and information I especially love fresh air and the political shows that you offer wheel of hearing your comments when you call that eight hundred to two to ...\nKate it every day but the quality of the shows and information I especially love fresh air and the political shows that you offer wheel of hearing your comments when you call that eight hundred to two to four seven eight eight or click on line to G. P. B. dot org\nAnd joined in those eight that we're looking for gold we're down to eight by five thirty or seven un seven others calls are clicks at eight hundred to two to four seven eight eight or online at ... dot org and\nWhen we hear from you you'll automatically enter are drawing to in a one thousand dollar visa gift card a prepaid gift card good anywhere V. is is accepted\nWe have a lot of ground to cover in the final hours of this fund ride we're looking to hear from you right now before your evening it's too busy\nIt just takes a couple of minutes and you'll have done your part to support your own public radio habit and enter to win a one thousand dollar visa gift cards what a great opportunity for you to make an impact on the TV and possibly walk away with a thousand dollars in your pocket\nCPB dot org or eight hundred to two two forty seven eighty eight\nJoined Jeff dinner from saint Simon's island pat task from Marietta Robbie Walton from Jonesboro calls and clicks coming in from around the state of Georgia that is\nProof positive that G. P. B. is such a resource to this entire state we're sitting in Atlanta Georgia right now but we are connected to so many other parts of the state of Georgia\nBecause of the news bureaus that GB has in Savannah and and making in Columbus that's the power of a public broadcasting system that his state wide\nYou want to you want to have that news and information coming to you from all over the state so supported Colleen hundred to two to four seven eight eight or go to G. P. V.\nWe're looking for five calls in clicks and the next three and a two and a half minutes\nFive five thirty five calls and click that eight hundred to two two forty seven eighty eight or G. P. B. dot org we're working together to wrap up this fund drives successfully by friday\nYour support will help get us there it's thanks to listeners before you who have already done their part the GDP is here for you every time you want and need us we're so grateful to everyone that we have already heard from\nBut if we have not heard from unique get right now we're asking you to do your part this is a group effort it feels so good to join the community of GDP listeners who are also supporters and the amazing thing is that the amount is up to use\nWhatever you choose to give is a great it's a great place to start what counts most right now is that you participate by going online to cheat\nWhat ever you choose to give\nIs a great it's a great place to start what counts most right now is that you participate by going online to G. T. V. dot org or by calling us that eight hundred to two two forty seven eighty eight and remember when we hear from you\nYou will automatically enter are drawing toward a one thousand dollar visa gift card but time is running out on this driving time is running out on this drawing today to one one thousand dollar visa gift card eight hundred to two two forty seven eighty\nEight or G. P. B. dot org and thanks\nSupport for CPB comes from you our listeners\nAnd Ogle Thorpe University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available at ... dot edu\nAnd Peachtree orthopedics helping Atlanta heels for over sixty five years with specialist for every body part from regenerative medicine to outpatient join and spine surgery their goal is to help people feel better faster peach tree orthopedics dot com [noise]\nBut there was one time the father pushed back against his son Donald Trump was beginning to suffer from dementia\nDonald Trump tried to change his father's well what happened\nWas right in Nineteen Ninety at Donald Trump's darkest financial moment he was facing being forced into bankruptcy by his creditors and he had some lawyers right up a ... a change to his father's will that would give him much more control over all those assets\nHe didn't tell his father or his siblings who was doing this he just had the lawyers show up at his father's house I believe it was and put the piece of paper in front of him\nHis father or somebody in the room realized right away this is not where we want to go with this and he pushed back and ultimately called Donald Trump sister who was then a federal judge in a lawyer obviously and ask her to intervene and to make sure that\nDonald's creditors couldn't come in and pillage Fred Trump's empire and Donald wouldn't have any more control\nTo make sure that Donald's creditors couldn't come in and pillage Fred Trump's empire and Donald we wouldn't have any more\nControl or influence over the state than any of those other siblings would\nThe White House has responded to your reporting by attacking the New York times and saying that the IRS looked at these arrangements as they were happening and found nothing improper how do you respond to that\n[noise] well we think that's not true um we know there are cases where there was no audit done like all county building that we spoke about the transaction Trump Palace\nAnd then the cases where there were audits there's evidence that the Trump didn't give the IRS all the pertinent information about those buildings and that the appraiser grossly undervalued some of the properties\nRuss ... is an investigative reporter for the New York times thanks for joining\nUs today Thanks for having me or the New York times story you just heard it now says that Trump's were able to get away with tax dodging for decades and there's no evidence that state or federal officials ever did much about it\nAnd NPR's Jim Zarroli reports regulators were either unwilling to take the trumps on or is simply lacked the resources to do sell\nReal estate companies such as the Trump families are famous for finding ways to pare down their tax bills and some of them skirt the law they can understate the value of a property they've acquired for instance\nBut NYU law school professor Daniel ... says the sheer scope of the Trump family's tax avoidance puts it in a whole other realm\nI don't think this is just like oh this is tax planning as usual is one thing to have kind of self serving valuations that are on the global side but it seems to go beyond it\nYet much of what the Trump did apparently went under the radar for years\nThat doesn't surprise pace law school professor Bridget Crawford she says the Internal Revenue service for decades to simply lack the resources to police tax fraud effectively and years of political attacks may have made it reluctant to take on hard cases\nWhere there's a will there's a way and there has been no with\nOnly one in a hundred tax returns has now audited and Crawford says it's especially easy to do what Fred Trump is alleged to have done pass on assets to your children without them paying much in taxes\nThe fact is that gift tax doesn't raise a lot of revenue also to the extent the IRS has resources that are not going to be allocating at tort gift tax enforcement\nThe same is true at the state and local level although New York state officials are now investigating the Trump families taxes\nNot going to be allocating in court gift tax enforcement\nThe same is true at the state and local level although New York state officials are now investigating the Trump families taxes Crawford says it's taken them far too long to do so\nHere's to me that the state department of finance has been utterly asleep at the wheel for decades\nWhen it comes to a transaction some on the Trump family\nCrawford notes that questions have been raised about the Trump families taxes for years ProPublica has reported that President Trump sold to Manhattan condos to his son Eric for much less than they were worth twenty sixteen\nBut because Trump hasn't released his tax returns it's impossible to say whether Eric Trump paid federal gift taxes as he was required to do\nBut the extent of the activity alleged in yesterday's times story is harder to ignore\nThe question is what regulators can do about it and why use Dan Shapiro says if fraud was committed it's probably too late for the government to pursue a criminal case because of the statute of limitations but severe us as the IRS can always decided to take another look at the Trump returns\nOn her return means that it's never too late to revisit it\nIf the IRS finds evidence of wrongdoing severe a says it can retroactively force Fred Trump's heirs to pay back taxes and they may have to pay civil fines as well Jim Zarroli NPR News New York [noise]\nAnd you're listening to all things considered from NPR News\n[noise] there's a new mandate for corporations in California by the end of next year publicly traded companies headquartered there must have at least one woman on their board and I'll have to phase in more by the year twenty Twenty one diversity advocates I've spent years pushing for this and not just in California\nMen hold about eighty percent of the board seats fasten P. five hundred companies but there are lots of reasons why other states might not follow California's lead cake you read these Lolita Molly reports from San Francisco\nThe idea that companies must now make room for women on their boards might sound good but California's new mandate isn't that have many would've chosen carrying can only speak standing at the communications consultant for the biotech industry\nI got one class because any movement towards gender equality is a great thing but on the other hand you want to cry because I Can't believe they'll pay twenty eight pain we need a bill and\nBut he is a great thing but on the other hand you want to cry because I Can't believe they'll pay twenty eight pain we need a bill a mandate gender equality\nWhen California Governor Jerry Brown signed the bill into law he had knowledge it contains flaws that could quote proved fatal to enacting it\nThe main one it may be unconstitutional Duke law professor Kim ... says opponents could challenge the law on the grounds that it violates equal protection guarantees by discriminating against men and failing to address marginalized groups besides women\nAfrican Americans a Latino and Latino candidate Asian American candidates are all under represented there is a similar law is addressing them\nBut corporate America is watching Serena phone is an executive with catalyst a nonprofit that advocates for the inclusion of women in the workplace she says studies show companies with women on boards perform better\nI was actually very surprised that the bill got passed and signed into law because the minute that you started talking about gender diversity in the boardroom people ... to oh they're talking about what we do not like what I Do what she does not talk about it at all\nNow California could lead the way for others to follow Kelly ... is the director of the center for equity gender and leadership at UC Berkeley business school she cites what happened when Massachusetts barred companies from asking\nFor salary histories\nNew York city followed on the previous salary as to San Francisco so you do see states and cities are mirroring one another on these sorts of pieces of legislation\nAnd there's national movement to representative Carolyn Maloney of New York has twice front legislation requiring companies to disclose the gender of directors before Congress she pointed to this grim projection even if half of all new board seats went to women it would take for decades before they\nHold an equal number of seats in boardrooms across America for NPR News I'm willing to Mali in San Francisco\nAll things considered as a production of NPR News which is solely responsible for content\nLike a story you heard on this or another NPR program\nShare it with a friend at NPR dot org while there you can also hear stories you miss enjoy ...\nLike a story you heard on this or another NPR program\nShare it with a friend that NPR dot org while there you could also hear stories you miss enjoy expanded content or connect here say for member station wherever you are at the NPR app for your mobile device\nYou can also lean back and enjoy NPR dot org optimized for the AIPAC and this is NPR\n\nThis is all things considered on listener supported Georgia Public broadcasting good Wednesday I ... and\nMarketplace starts in just ten minutes but before we get to a marketplace at six o'clock\nI'm here to remind you that it is your financial support that keeps all things considered marketplace MORNING EDITION fresh air this American Life all of the ... listen to here for you and she ... the amount of support is up to you it might be five or ten dollars a month for all of the list so then you do\nWe're coming up on the end of this fund drive so right now we're counting on you to help keep gp be strong for you and for your community before time runs out don't put it off until the last day do your part right now whether you're listening in Atlanta or Athens savannah make in\nAugusta Columbus Albany please support CPB right now with a phone call to eight hundred to two two\nForty seven eighty eight or you can give securely online at ... dot org thank you so much for your contribution I'm Harrisburg Leslie Hoffman\nAnd you may remember we took about a day and a half off of the drive last week to bring you some breaking news coverage from chief up from NPR and that was very important that we do that because that's the mission of G. P. B. to bring you that news and information that enriches your life that connects you with the world\nI'm an outlier in two ways I mean there was a lawyer for signing the letter in the first place was only twenty three out of a hundred and sixty some members of the class scientists and the first place so that may be an outlier andme certainly an outlier one was by Proctor and withdrawing from the letter [laughter] um so it's it's really only the two of us\nAre among settled group who who did both thanks do you still consider him a friend\n[noise] yes I I I Hope that we can have a friendship I'm I suspect he might be screened in my calls right now but uh I Hope not\nMark all sorts of Yale Law school classmate of Supreme Court nominee Brett Kavanaugh thank you very much thank you and professor author now teaches law at the University of St Thomas and St Paul Minnesota\nThe federal government was so I'm prepared to carry out the Trump administration's policy of separating migrant families earlier this year\nThat it wasn't even ready to has the children and where did it even had a plan to reunite them with their parents that is from a scathing report from the homeland security department's internal watchdog this week\nThe administration has abandoned its policy of separating families to deter illegal immigration but only after widespread outrage and after more than twenty six hundred children were already separated from their parents to talk more about the d._a. jak inspector general's finding we're joined by NPR\nAfter more than twenty six hundred children were already separated from their parents\nTo talk more about the d._a. chess inspector general's findings were joined by NPR's Joel Rose angel hey also said you know we've been hearing all year about the problems with this policy of separating families but what is new in this report that contradicts what we've been hearing from the administration\nWill it contradicts some early assurances that we got from federal officials as this policy was being rolled out here's da chest secretary cures to Nielsen\nIt is important in it that these miners are very well taken care I don't believe that ... they are very well taken care\nBut this report paints and much less rosy picture the inspector general found that da chess held hundreds of migrant children in border patrol facilities well beyond the legal limit of Seventy two hours in fact federal officials held more than eight hundred migrant children for longer than that including one child who was held for twenty five days\nAnd many of these children were held in metal cages and border patrol facilities near the border until the government was able to find space in shelters that are equipped to has children\nAnd as we mentioned many parents and children had trouble finding each other and assistant after they were separated\nWell again at the time officials denied that that was a problem remember here's Alex aides are the secretary of health and Human Services speaking it back in June before Congress\nThere's no reason why any parent would not know where their child is located I could with with just basic keystrokes within seconds could find any child in our care for any parent\nH H s by the way cared for children after they were separated while da chess had custody of their parents and at the time da just said there was a central database of the locations of parents and their children\nAt Central database did the inspector general find that central database\nThe inspector general found no evidence that there was such a central database the two agencies actually had computer systems that could not communicate with each other and the inspector general found that when distraught parents tried to track down their children\nThe government sometimes gave them inconsistent or just wrong information in some cases parents couldn't communicate with their kids at all then what happened to those families\nThe government was ordered to reunify them by a federal judge and it has reconnected more than two thousand children with their parents but the inspector general's report says that this lack of communication made that reunification process slower\nAnd the process was especially hard for children who are so young that they couldn't speak immigration authorities according to this report made no effort to identify those young children in any way no risk bans\nWho are so young that they couldn't speak immigration authorities according to this report made no effort to identify those young children it anyway no wristbands and no photographs of them were taken so it was only through communication with the parents that that authorities were able to find these children and reunite them\nStill have federal officials responded to the inspector general's report in any way\nWell as the administration often does is blaming quote immigration laws that are broken and poorly written unquote\nDa chest does say that it deserves some credit for working quote exhaustively to reunite these families although again they were ordered to do so by a judge but the H. S. also acknowledge that the government's computer system still do not communicate across these agencies\nAre there any children still haven't been reunited with their parents [noise]\nOh yeah more than a hundred and thirty remain in us custody apart from their parents mostly because those parents have already been deported without them back to\nCentral America All right That's NPR's Joel Rose thanks very much Jill\nYou're listening to all things considered from NPR News\nMontana has become a popular campaign stop for President Trump and vice president pets so popular that each of them has been there twice in recent months that's because Republicans are trying to unseat two term democratic Senator Jon tester\nDuring Pence's second visit there yesterday he fired up a rally talking about Brett Kavanaugh's nomination to the Supreme Court Montana Public Radio's Eric Whitney reports\nRunning in a state that President Trump won by more than twenty points tester emphasizes that you can work with Trump he's run an ad listing Nineteen bills you supported that Trump is sign so when vice president Pence spoke in Bozeman yesterday he painted tester as a reliable and reflects of member of the Democratic resistance\nThe all the layers\nSaturday all ready now voting no on just just like you know we're ...\nTester didn't take a position on Kavanaugh's confirmation until after last week's hearings were over and then came out against Kavanaugh\nOh no I was tested in and take\nA position on Kavanaugh's confirmation until after last week's hearings were over and then came out against Kavanaugh citing first his record on privacy issues and support for the Patriot act\nFor those reasons and all of the reasons that were brought up last week um I made a decision to vote no on judge Kaplan I don't think he has the merits nor the background to\nUh meet the needs of Supreme Court\nRepublican challenger Matt Rosendale says he'd be a more reliable ally for President Trump and sided the Supreme Court vote as an example\nMyself and a lot of the people are ... are very disturbed with the way this entire process was handled there is a man who has a commendable record and\nHe used to be serving on the bench an absolutely I Would vote for him\nOn paper standing firmly with President Trump would appear to be a winning strategy in Montana the population here skews older and wider than the U.S in general Montana also has the second highest population of veterans per capita of any state guys like Jim heading film [noise]\nTired after Twenty years in the navy ending felt now volunteers at the airport\nIn Missoula helping arriving tourists he voted for President Trump\nGonna mess around with this country we're going to do something there's no crosses the line a red line fair to\nWhile heading failed says the hell no didn't vote for President Obama like many Montana voters he isn't easy to pigeon hole\nHe says he's voted for tester before and for Democratic governors Steve bullock in twenty sixteen and he says a candidate support for the president or testers vote on Kavanaugh's nomination won't sway his choice\nNo because I don't use it as a platform to make my decision\nStill plenty of voters do see their vote as a sign of support for President Trump\nBozeman retirees Suzie Burton was at a senior community center yesterday near where vice president Pence was holding his campaign rally well\nI think a precedent marvelously actually\nKeeps his promise [noise]\nAnd not many of them do\nWell President Trump is front and center in the Senate race here identity and local issues also matter for example tester has put Rosendale on the defensive about whether national forest in Montana could be privatized Rosendale initially opposed federal land ownership but says he's now\nIt was put Rosendale on the defensive about whether a national forest in Montana could be privatized Rosendale initially opposed federal land ownership but says he's now convinced that that's not what people want\nAnd tester leans hard on his image as a third generation farmer Rosendale moved to the state in two thousand two after a career as a Maryland real estate developer\nVoters will be watching closely Saturday as the to debate one last time before early voting starts later this month for NPR News I'm Eric Whitney in Missoula, Montana [noise]\nThis is all things considered from NPR News\n... you're listening on listener supported G. P. B. that means your support keeps all things considered and all of the programs you enjoy on the air here support also keep stories like we just heard\nAbout a very tight Senate race in Montana were able to bring you the voice of Eric Whitney and other reporters who were covering state politics around the nation because a listener dollars help pay for the programs\nThat they appear on like all things considered we're almost there this is the final stretch of our fault fund drive we're looking for support from our entire community of listeners\nTo help us reached that famous line with time running out on this campaign we hope that that includes you\nShow your support it cheap ... dot org or call us at eight hundred to two two forty seven eighty eight I'm Ricky ... here with Bert Wesley Huffman\nAnd your support makes Georgia Public broadcasting stronger and makes us a more vital part of your life and makes us a more vital part of the community that we serve all across the state that your community to", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Chatsworth", "day": "03"}