{"month": "10", "state": "GA", "station": "WNGH", "content": "The ... eight hundred to two to four seven eight or go to a G. P. B. dot org and thanks\nFor important revenue WG and ... GBH room for the Georgia Public broadcasting network [noise]\n[noise]\nMine from the G ... Reinhart the U.S Supreme Court declined to hear an appeal brought by two defendants convicted in the Atlanta public schools test score cheating case\nCamera cotton and Angela Williams some were found guilty in two thousand Fifteen is part of the district wide conspiracy educators corrected students' answers on standardized tests in order to earn bonus pay and raises\nCotton and Williamson took their cases to the Georgia court of appeals and the Georgia Supreme Court both of which upheld their convictions prior to today's U.S Supreme court decision\nTwenty one educators pleaded guilty to lesser charges a little bit of the twelve who went to trial were found guilty\nSavannah schools are partnering with the university system of Georgia to help more students applying for financial aid for college she ... Jones reports\nFilling out the free application for federal student aid or FAFSA is a key step for students and families trying to figure out how to pay for college the state university system says nine out of ten students who finished the process end up enrolling in college it's about an arts academy senior was Shay Williams says the fat's a is daunting but exciting\nIt really helps us to know that we've got people behind that that are willing to help us and willing to give us the financial aid that we need\nUs she and the savannah Chatham county public school system are holding outreach events and offering help to get more families to apply the project is being funded by a grant for G. P. V. News I'm Emily Jones in Savannah\nIsolated the scattered thunderstorms are expected over portions of north and central Georgia this afternoon into tonight some storms could be strong southern Georgia and the coast could also see rain loose in the upper sixties in North Georgia the rest of the state lose in the seventies it's four oh one\nLive from NPR News in Washington I'm Laurie London President Trump says the FBI should do a comprehensive investigation into the allegations surrounding Supreme Court nominee Brett Kavanaugh and\nThat he's keeping in his words an open mind but as NPR's Mara Liasson reports he also says that Senate Republicans should determine the scope of that investigation President Trump said he wants the investigation to end quickly\nSend reports he also says that Senate Republicans should determine the scope of that investigation\nPresident Trump said he wants the investigation to end quickly and that the FBI should look into whatever the Republican Senate wants it to he said he believes Kavanaugh was truthful in his testimony and that his family has been treated horribly but he also said he has no backup plan if Kavanaugh should withdraw or be rejected by the Senate\nI Hope that he gets approved I Hope that the report comes out\nLike a ... like I really think it should I think it will I Hope\nI Hope what look I'm waiting just like you the president said he was surprised how vocal Kavanaugh was about his drinking problems in high school President Trump doesn't drink which he joked today was one of his only good traits Mara Liasson NPR News Washington\nTrump is also touting a newly reached trade agreement with Canada and Mexico Canada is chief trade negotiate eight or in negotiator agrees NPR's Windsor Johnston reports the U.S Mexico Canada agreements would replace the north American free trade agreement or NAFTA\nTrump says the new trade deal is based on their principles of fairness and reciprocity\nOnce approved by Congress this new deal will be the most modern\nUp to date and balance trade agreement and the history of our country where the most advanced protections for workers ever developed\nTrump says the agreement will create jobs across the manufacturing agriculture and technology sectors\nIt would also protect to Canada from any future automobile terrorists imposed by the United states but for now leaves him place he was imposes duties on steel and aluminum imports and retaliatory tariffs that Canada and Mexico implemented in response Windsor Johnston NPR News\nPolice in Germany are questioning six suspects believed to be planning terror attacks as may Nicholson reports\nA source he's carried out rates Adidas moaning and has arrested six men age between twenty and just touchy acceptance man believed to be the ringleader was arrested last month\nThe suspects German citizens from the eastern states have ... on the western states if those area and police believe they were planning attacks in order to this region these democratic or to\nThe men are accused of forming a far right terror group called revolution cabinet named after the eastern city where anti immigrant protests took place last month when the announcement of us\nA group called revolution cabinet named after the eastern city where anti immigrant protests took place last month when the announcement to us and Canada trade agreement with Mexico sent stocks higher today the Dow closed a hundred and Ninety nine this is NPR\nSupport for NPR comes from NPR stations other contributors include exact science is offering color guard for average risk or does over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information at color guard tested dot com\nYou are listening to all things considered on G. P. B. good Monday I'm Ricky ... just ahead we sit down with Oklahoma Republican senator James Lankford talking about what is next for Supreme Court nominee judge Brett Kavanaugh as the FBI begins its investigation\nWe're able to bring you stories from Oklahoma from around the world and from right here in Georgia because of you provide the financial support we're headed into the final stretch of our fall fund drive\nSo right now we're counting on you to join the community that keeps the news and information that you need going strong NPR has had spectacular coverage of the entire having a\nA hearings and process what a great thing to invest in right now you're better understanding of our democracy our doors are open we welcome your contribution at whatever level is right for you please go now to G. P. B. dot org and click donate or call us at eight hundred\nTo two two forty seven eighty eight thank you for your support here with me as Bert Wesley Hoffman\nAnd thanks to the general supportive our leadership circle donors we have an all things considered match that's in effect right now so when we hear from you a hundred to two to four seven eight or online at gp dot org your contribution will be matched dollar for dollar it's your opportunity to double the impact of your support right now\nYou make a hundred and fifty dollar gift it becomes three hundred and five hundred dollar gift is worth a thousand dollars\nGo to G. P. B. dot org and click donate before time runs out on this match offered by generous members of chief ... leadership circle call eight hundred to two to four seven eight eight or go to ... dot org\nAnd it really is your opportunity to double the impact of your support right now that means you're making twice the a benefit effort to improve G. P. B. to keep it going strong and of course to pay for the programs that you love\nHere on G. P. V. whenever you turn to ... you know that we're going to be here with the programs that you expect and enjoy well the reason we're able to do this\nIran's that you love here on CPB whenever you turned to ... you know that we're going to be here with the programs that you expect and enjoy\nWell the reason we're able to do this is because of that sort of support and right now it is a dollar for dollar a match in effect when we hear from you know at ... dot org or eight hundred to two two forty seven eighty eight your contribution will be doubled\nAnd thanks from NPR News this is all things considered ... Chang\nAnd I'm Ari Shapiro Senate majority leader Mitch McConnell promises that the Senate will vote this week on Brett Kavanaugh's confirmation to the Supreme Court\nIt's not clear which day that depends on when the FBI concludes its investigation into claims the Kavanaugh sexually assaulted Christine Blasey Ford decades ago when they were both teenagers Kevin ... denies the claims\nThe scope of the investigation is unclear and has been the subject of political haggling ever since the inquiry was announced on friday NPR congressional correspondent Scott Detrow is here in the studio to walk us through the late ... got a good afternoon let's start at the White House President Trump held another one of those extended unfiltered press conferences today what did he say about having on where this investigation stands he\nSaid a lot about cabinet but let's just focus for this moment on what he said about the investigation and Kavanaugh we've been hearing a lot of reports that the White House had been ordering the FBI to keep the focus very narrow President Trump today insisted that is not the case\nI Want them to do a very comprehensive\nInvestigation whatever\nMeans according to\nThe senators and the Republicans and the Republican majority I Want them to do that\nAnd we do know there's been a lot of conversation between the White House and Senate Republicans about this Jeff Flake is the Arizona senator who forced this week long investigation on friday he said today he has been having a lot of talks with the White House app had the other key Republican holdouts here\nThe Judiciary Committee asked the White House to have the FBI investigate current and credible allegations President Trump seems to be referring to Senate Republicans on this so what's our best understanding of how the Senate Republicans define current incredible\nLindsey Graham gave a definition of this over the weekend to ABC News he said that would involve all the witnesses that Christine Blasey Ford said we're at the party\nAnd it also includes Deborah Ramirez who made that second claim that Kavanaugh exposed himself to her at a college party here's the thing that's unclear whether the FBI could or would brought in and talk to college classmate\nForward saying that cabinet wasn't telling the truth when he testified about his drinking habits and other things like that a flake was in Boston\nThe college classmate forward saying that cabinet wasn't telling the truth when he testified about his drinking habits and other things like that a flake was in Boston today here's what he said about what he wants the scope to be\nThat does no good to have an investigation that just gives us more cover for example we actually need to find out where we can find out\nThank you for listening and most importantly thank you for doing your part to keep this program all things considered coming to you on gp day we're now in the final days of our fault fund drive and as we head toward the end of this drive it takes all of us together including you\nTo keep public radio in Georgia strong so whether you're listening in Athens or savannah making Augusta Columbus points in between or you recently started tuning in on eighty eight point five ... please be the next listener who joins or public radio community weren't great crowd you're going to want to be a part of us\nPick a level that is right for you and make that contribution in G. P. B. dot org click the green donate button at the top of the page\nOr call us at eight hundred to two two forty seven eighty eight thank you for your support here with me as Bert with we have\nTo remember right now we have a dollar for dollar matching the fact when we hear from you at ... dot org or eight hundred to two to four seven eight\nYour contribution to G. P. B. is going to be doubled that straight up double you give us Seventy five dollar gift it's worth a hundred and fifty dollar investment in the news on G. P. B. hundred and fifty dollars that's three hundred a leadership circle gift to Fifteen hundred for a limited time only has an impact of three\nThousand dollars for us here at gp so now's the time to do it if you've been thinking about making my gift maybe you've never done it before and you thought you know my twenty dollars isn't gonna\nFirst of all you're twenty dollars will make a difference but guess what today that twenty dollars is forty dollars such a great opportunity to get that first gift and called eight hundred to two to four Seventy to go to ... or a great big thank you to members of our leadership circle he made this a match possible for you and\nYou know we all like to feel like we're making a difference in the world and so the dollar for dollar match is such a simple way to feel like wow I Am improving or growing my own impact so you get behind\nMaking a difference in the world and so the dollar for dollar match is such a simple way to feel like wow I'm improving or growing my own impacts you give a hundred dollars today right now it automatically becomes two hundred dollars or as Bert said Fifteen hundred dollar just become thirty three thousand dollars without you having to do anything extra you\nKnow what else makes an impact on the world public radio you are listening right now because you value the programs that we bring you a day in and day out here on CPB it could be the news programs\nAll things considered MORNING EDITION here and now it could be entertainment programs like how I built this this American Life wait wait don't tell me freakonomics\nSo much good in to the world because the public radio and the programs that were able to bring you to enlighten our community\nTo challenge our community to make us more creative civic uh in more civic leaders in our community all of this thanks to listeners who helped to pay for it\nThank you for making the contribution at whatever level is right for you at ... dot org or eight hundred to two two forty seven eighty eight\nHey it's you're friendly news quiz host Peter say go here to tell you about something you really need to have in your audio collection it's wait wait don't tell means twentieth anniversary best of album we went through two decades of wait wait shows and pulled out our favorite interviews and bluffs\nAnd the best times of Paula Poundstone took control of the show and drove it right off the rails will tell you in a minute how you can get your own copy but first here's an excerpt from an not my job interview we did back in two thousand five\nThat year we spoke to a newly elected young senator about how all struck he was just to be in the Senate chamber [noise]\nAlthough as I said the main reason that I'm On here is because I remember Hugo making fun of my main during the campaign [noise]\nIf I recall correctly you have some political consultant to giving advice in terms of how I should change my maimed or ... or [noise]\nBob Garfield you know the host of a show called on the media and a frankly I think you should have taken his advice and maybe you would have done a little better but that's [noise]\nYou would have gotten up to like Ninety Ninety five percent\nJust been willing to listen to somebody else [noise]\nWe won't we we're proud of the fact that of all the millions of people who've now made comments about your name we were among the for your work\nWe will we we're proud of the fact that of all the millions of people who've now made some comments about your name we were among the for the work [noise]\n... it has been an amazing shall we say Eighteen months for you\nOr in which you rose from relative obscurity as a state senator human Illinois too shall we say the Elvis of the political world\nI thought you were going to say to Ninety nine in seniority in the United states [noise]\nWhich is which is where rank really yeah when I walked in the first day they handed me a bunch of pencils sharpened\nWell that was one of my first questions which is because uh I I'm just wondering what the Senate is like\nThere is a sense of all and grandeur when you walk into the Senate building a each of us have these little desks\nYou can't write anything on it 'cause they're too tired they're like the best you have an elementary school and parents when you go to a you know a parent teacher day and you're sitting there swatting that's how I feel [noise]\nBut uh but when you pull the doors open a there are the names carved inside of all the previous occupants of the desk and so in mind you know you'll see names like lodging\nIn but you also see names like Bobby kennedy and Paul Wellstone and it really gives you a sense of sort of the sweep of history but you're part of not supposed to do that [noise]\nI suspect the first couple of guys weren't yeah\nNow now so [laughter] I don't\nThink people realize the far reaches graffiti [laughter]\nAre there are a little I was thinking about taking a spray camp\nWell that's how we do have a heavy only African American read about it [noise]\nBy the way later in that interview when we asked him if he was ever planning to run for president and so we finally on wait wait don't tell me could actually break the news\nHe told us the only thing he was planning to do was go home and do the dishes\nThanks Obama that interview and not my job game within Senator Obama is just one of the many highlights you'll hear on our twentieth anniversary best to wait wait collection lots to hear from Tom Brady Steven called their Bill Clinton and George Clinton\nTo get your download code and get a copy end up bonus collection we put together just in case you want even more all you have to do is support this station right now the ... here's how\nCode and get a copy and the bonus collection we put together just in case you want even more all you have to do support the station right now yeah that's it here's how\nCall us at eight hundred to two two forty seven eighty eight or go online to G. P. B. dot org this is a wonderful opportunity for you to celebrate Twenty years of one of the funniest shows on radio or television in America today\nAvailable to you at eight dollars a month as a gp sustain her this is the wait wait don't tell me digital download a double CD linked downloadable album it's not CDs it's downloadable\nIncluding highlights of the first Twenty years of the show featuring Peter Segal Carl Kasell bill Curtis Paula Poundstone mo Rocca and the rest of the shows talented panelists it's a special collectors edition and also includes bonus features that you can't get anywhere else including\nParts that had to be edited out because they weren't appropriate for the radio this and Twenty years of highlights for wait wait don't tell me available to you at eight dollars a month as a G. P. B. sustain her one time gift of one hundred dollars eight hundred to two two forty seven eighty eight or G. P. beat out of work now that one\nHundred dollar investment and gp because of the match that we have an effect right now is actually a two hundred dollar impact\nSo you can make your gift of a hundred dollars will send you the digital download from wait wait don't tell me as our way of saying thank you and thanks to the match from very generous members of our leadership circle were able to double that one hundred dollar gift to two hundred\nHolly hundred to two to four Seventy they go to ... dot org click donate your contribution any amount is going to be matched dollar for dollar\nOur thanks to ... leadership circle for offering up as much\nIncluding Dennis hug lower and has to be more to merge Jane Hyatt thank you so much for your ah incredible gifted G. P. B. and the gift that keeps on giving which is the gift of encouragement to your fellow listeners to say it's time for you to step up now I've done my part let's through your soul eight hundred to two to four seven a day to go to ... and we have\nAnother way for you to laugh the best selling author and humorist David ... is coming to Georgia for one night only his only appearance in Georgia in the coming year he'll be at the ... theater in Savannah Wednesday April twenty fourth next year\nIt's seven thirty PM when you support CPB with a credit card contribution of two hundred and fifty dollars right now you will receive a pair of tickets to see David said there is a live before they go on sale to the public\nAnd join us for ... show reception two hundred and fifty dollars a credit card only to see Dave\nBefore they go on sale to the public and join us for ... show reception two hundred and fifty dollars a credit card only to see David Sedaris live in Savannah gp dot org or eight hundred to two two forty seven eighty eight\nNow that's going to be a great show because it's going to be in April a beautiful time to be down and the beautiful city of savannah and that show ah those and more importantly those tickets are not on the public yet so what you're getting in a ad is a very special opportunity to get your seat before anyone else can buy them and certainly this is one of those shows that it's going to sell out\nSo calls it a hundred to two to four seven eight eight or go on line to G. P. B. dot org right now we would love to send you those two tickets remember you got to use your credit card and you have to do it on by the phone thanks so much for your supportive gp be\nSupport for G. P. B. comes from our monthly sustain hers and Georgia trend magazine for more than Thirty years covering Georgia business politics and economic development\nSubscription information and more are available at Georgia trend dot com and southern environmental law center protecting Georgia's environments and the people who depend on it during these challenging times through the power of the law\nBlum says rent control is just a band aid and at the root of the problem is the fact that there's just not enough housing\nThe real solution to our affordable housing crisis is more construction of housing across the whole spectrum\nThe state estimates that needs to build well over a million new units right now\nLand is in short supply and a lot of what is being built is high end and that's fueling a lot of the anger and momentum behind the push for rent control like in a lot of booming American cities LA residents are watching his whole blocks are demolished to make way for luxury homes\nAnd big fancy apartment complexes pools and jams\n\nProp ... supporters and neighbors of eighty two year old Robert Rodriguez protesting on the street in front of his old building on the building's owners say the rent increases were needed to cover maintenance costs and our ...\nTwo year old Robert Rodriguez protesting on the street in front of his old building on the building's owners say the rent increases were needed to cover maintenance costs and\nOur market rates for now Robert says he and his wife will stay with his sister while they desperately look for a new place of his own\nAll you've got left as Skid Row Rodriguez hopes that doesn't come to that\nKirk Siegler NPR News Los Angeles\nTo scientists simply curious about understanding how our immune systems work and he got making discoveries that rocked the world of cancer treatment and Nobel assembly and fleeting today announced the two men will share this year's Nobel Prize for physiology or medicine NPR science correspondent Richard Harris has our story\nJim Allison says he's always had a personal interest in cancer his mother died of lymphoma when he was ten and an uncle died of lung cancer but when I was in went into science he did so because he was curious about how the world works that curiosity led him to an honor many around him had been expecting him to get the Nobel Prize\nThe regime that I'm really thrilled about this I'm a basic scientist I did not get in your studies to charter ... where I got into it because I Want to know how the cells were\nT cells are vital component of the human immune system but when I started out he says people simply didn't understand what they did in the Nineteen nineties Alison was working at UC Berkeley when he discovered a vital element of T cells they had what's essentially a brake pedal to keep them from going too crazy\nSo it was just disabled the brakes spheres that rollout immune system to attack transfer from\nThis braking system it's called the checkpoint and once that wasn't discovered this mechanism drug developers set to work creating drugs to block checkpoints drugs called checkpoint inhibitors meanwhile at Kyoto University in Japan Dr ... independently at work on the same biological puzzle\nHe discovered another set of T cell breaks so he shares the Nobel Prize\nFrom this sciences emerged a multibillion dollar effort to develop market and improve checkpoint inhibitors\nI was told by the Nobel Committee when I was called this morning there was the first prize that ever given for cancer therapy suffer catch the costs are gesture before it was the first time for casual therapy\nAll this morning there was the first prize that ever given for cancer therapy\nSuffer cats because her cancer before it was the first time for casual therapy these checkpoint inhibitors have led to some remarkable successes for example former President Jimmy Carter was diagnosed with advanced melanoma which had spread to his brain\nBut a checkpoint inhibitor vanquished has cancer doctor Monica ... newly president of the American society for Clinical Oncology says\nCheckpoint inhibitors have generated tremendous excitement because of remarkable stories like this\nUnfortunately that is still a small percentage of patients\nThe races now on to figure out how to make these drugs effective in a lot more people with a lot more types of cancer\nJim Alison now would empty Anderson Cancer center in Houston says now that they understand the basic rules they can set to work on improvements and have for one is optimistic that this new branch of cancer treatment will end up saving many more five [noise] Richard Harris NPR News [noise]\nTomorrow on MORNING edition when Christine Blasey Ford testify last week before the U.S Senate she kept cool she did not get angry author Rebecca Traister his new book offers a look at how women through us history have used anger to both political benefit and Harold\nShe'll talk about it on MORNING edition listen by asking your smart speaker to play NPR or your local station by name [noise]\nYou're listening to all things considered from NPR News\nCalifornia's governor Jerry Brown signed a law last night barring Internet service providers from blocking or slowing down traffic weren't astro loaded the law basically restores the net neutrality rules created under the Obama administration and repealed under President Trump\nThese are seen as the strongest net neutrality protections in the country\nAnd within hours the Justice Department sued to block the California law NPR's Alina Selyukh is here to walk us through what this means for Internet users like us Hayley not high remind us what net neutrality is and what impact this California law if implemented would have on ordinary people going online\nThe over arching question of net neutrality is how much power your Internet providers should have\nLaw if implemented would have on ordinary people going on\nRight the over arching question of net neutrality is how much power your Internet providers who'd have over your Internet experience\nSo typically when people talk about and neutrality they mean regulations like\nNo blocking of whatever what say you went to visit that Internet providers should not be able to slow down an apt to you're visiting other elements some toxins include things like zero rating which has a deal\nWherever I might give you streaming of Hulu that doesn't count toward your or a data restrictions but then count Netflix store data just restrictions and these are all rules that California put into place they they banned all these things\nBefore the Trump Administration repealed neutrality rules there was a really vocal campaign by activists trying to get the FCC not to take this step now the California has gone through what has the reaction but\nWell California was indeed sort of reacting to the massive liberal wave of activism and online activism that prompted\nUm the the writing of these rules um you know the battle lines have been drawn for a while on the net neutrality debate and then there's still the same on the one hand you've got Internet companies especially the smaller ones like at sea or video streaming video saying that these rules are critical for them to be able to compete against the bigger companies\nOn the other side you've got the telecom providers you're Eighteen to your ... your Comcast that have been pushing California to not put not neutrality rules into place and are expected to sue California as well\nAnd the Justice Department has already sued California explain why there during the\nOn so many things actually so it's on a political level California is an interesting state it is the largest economy in the United states\nUm it has the power to sort of set the bar for a lot of regulations and they have used that power and they're currently in legal disputes with the department of justice over a variety of policies\nIncluding immigration admission standards and often when California sets a standard many companies look around and and think for themselves that it is a lot easier to just\nAbide by the California standard and sort of\nHow goes California so goes the rest of the nation\nOr all the Texas play during the Obama administration economic powerhouse the counters the politics of who's in the oval office and\nThe department of justice in this case did respond you know attorney general Jeff Sessions said exactly that essentially accusing California legislature of of ah attempting to frustrate federal policy as he put it\nSo what does this mean for consumers and companies will this fight plays out\nIt's accusing California legislature of of ah attempting to frustrate federal policy as he put it so what does this mean for consumers and companies will just fight plays out or not much yet the rules were not isolated to go into effect until January at this point the Justice Department is seeking an injunction to not have those rules go into effect at all\nIn the meantime on a federal level\nOr the tech companies and the consumer groups and twenty attorneys general including in California attorney general are suing the Federal Communications commission trying to\nOn rules the repeal of the Obama era rules so all of this is kind of in the hands of the\nCourts are and we're waiting to see how that plays out and say\nThank you for listening to your public radio station Georgia Public broadcasting where your support makes technology reporters work like Alina Selyukh happen because she's able to report from California and explain that only how net neutrality works something I'm Still trying to get my head around but\nCalifornia throwing its weight around actually influencing public policy and the way businesses make decisions because it's such a populous and wealthy state that has great impact on us here in Georgia and we understand that a lot better things to the time that all things considered takes four or five minutes\nTo explain it to us I Ricky ... here in the final stretch of our fault fund drive if we have not heard from you yet during this drive to invest in this kind of journalism and this programming\nPlease take this opportunity right now to support CPB think about what this service is worth to you a dollar a day Fifteen dollars a month\nSo level of support is up to you the most important thing is that you contribute thank you for doing your part at eight hundred to two two forty seven eighty eight or give generously on line that G. P. B. dot org here with me as Bert Wesley Hoffman\nNinety seven point seven FM W. A. G. P. B. and W. GBH leave room for to Georgia\n[laughter]\nI'd be seven forty seven FM WG BP and believe GBH room for the Georgia Public broadcasting radio network [noise]\nUm\nLife from the GB news remind melon Reinhardt former president for rock Obama has endorsed Democrats trying to knock off Republican incumbents into of Georgia's most competitive congressional races\nToday Obama released a second wave of nationwide endorsements for the upcoming midterm elections the endorsements include Lucy McBath running against representative Karen handled in Georgia sixth district and Carolyn Bourdeaux taking on representative Rob Woodall in Georgia seventh district\nBoth districts includes suburban areas north of Atlanta that have become more urban and more racially diverse in recent decades leading Democrats to believe there may be an opening for them [noise]\nNearly six hundred students that in Augusta area K. through eight school received a two in one laptop and tablet device from the school system last week it's part for programs aimed to put devices in the hands of most of the systems nearly thirty two thousand students\nThe school now includes cyber safety coating on line research techniques and anti bullying modules in the curriculum administrators told the Augusta chronicled the school is moving toward doing away with textbooks and becoming a paperless campus\nThe Atlanta Falcons lost their third game of the season yesterday falling to the Cincinnati Bengals by a score thirty seven to thirty six the falcons held the lead with less than a minute left in the game before the Bengals scored in the final seconds to get the win that quarterback Matt Ryan\nWhere we don't have to go a long road in front of it was a difficult thing and you learn from these experiences hopefully next time we're in and be there for\nThe falcons now sit at the bottom of the NFC South division with a one in three record Atlanta travels to Pittsburgh to play the Steelers this coming Sunday for more news you can check out our website gp be news dot org it's Bible one\nLive from NPR News in Washington I'm ... beer President Trump is announcing the completion of a new trade agreement with Canada and Mexico more from NPR's Mara Liasson\nIn a Rose Garden ceremony at the White House President Trump said he successfully negotiated determination and replacement of NAFTA the north American free trade agreement he says he has a new pact that he's named the U.S Mexico Canada agreement\nThrows a campaign promise to renegotiate NAFTA and today we have kept\nAs a new pact that he's named the U.S Mexico Canada agreement\nThroughout the campaign I promise to renegotiate NAFTA and today we have kept that promise\nSome of the terms of the new agreement are significant others are minor but President Trump says once the deal is ratified by Congress hundreds of thousands of new jobs will begin pouring into the country Mara Liasson NPR News Washington\nDump Republicans say even as the FBI continues to investigate allegations of sexual misconduct against Supreme Court nominee Brett Kavanaugh the\nNominee will be confirmed later this week South Carolina Senator Lindsey Graham a member of the Senate Judiciary committee says he's disgusted that Democrats continue to attack Kavanaugh with the allegation still being investigated\nThey do this [noise] call him every bad vowel name in the\nAnd get up that could be pushing back\nMe well President Trump says the FBI agent should interview anyone they deem relevant to the cabin on ... General Electric says it is hired its chief executive after a little more than a year on the job were fired by their chief executive after a little more than a year on the job and your Jim Zarroli reports the move comes amid declining profits for the company\nGE chief executive John slant already had been on the job just Fifteen months he\nWill be replaced by H. Lawrence called the former chief executive of the conglomerate Ghana her who's now board member a G. E. the company also said it's cash flow in earnings would be less than previously thought because of problems that it's G. E. power division\nOnce considered the essence of a modern cutting edge conglomerate GE has seen its fortunes and its share price fall dramatically and it's been forced to sell off divisions and lay off employees and assemble of the company's declined GE was removed from the Dow Jones industrial average in June\nJim Zarroli NPR News New York\nBuilders are boosting their spending in August with at least some of the resources apparently targeted towards government construction rather than residential building\nCommerce Department says the one tenth of ... percent rise in construction spending an August comes on the heels of a to tens of percent rise to the previous month residential building continues to fall with homebuilders facing a number of headwinds this year including higher lumber cost to the tariffs in rising mortgage interest rates [laughter]\nRelatively strong start for blue trips in the fourth quarter the Dow was up a hundred and Ninety two points today\nPutting higher lumber costs due to tariffs on rising mortgage interest rates strong start for blue trips in the fourth quarter the dollars up a hundred and Ninety two points today you're listening to NPR support\nFor NPR comes from NPR stations other contributors include the University of Florida we're solving for next is powered by its way into grants heritage from renewable energy to global health us students and researchers are working to solve challenges at ... dot UFO dot edu [noise]\nThis is all things considered on listener supported G. P. B. a family of public radio stations across Georgia\nIncluding eighty eight point five ... after a surge of last minute negotiations Canada has joined the U.S and Mexico and an updated trade agreement to replace NAFTA we will explain what is in this new trade agreement coming\nUp in just a couple of minutes every listener plays a vital role in ensuring the future of public radio that is what our fall fund drive is all about your financial support makes everything you hear on G. P. D. possible international and national news from NPR\nGeorgia news from the previous award winning news team\nThe amount of support is up to you what's most important is your participation right now in the final days of this campaign please don't put it off any longer go now to G. P. B. dot org while you're thinking about it or give us a call at eight hundred\nTo two two forty seven eighty eight thank you for your support for being generous ... here with Bert Wesley Hoffman\nAnd here's a great way that we can reward your generosity when you make your gift right now we have a leadership circle match in effect which means some very generous folks have come forward and given us money so that we can match your donation to G. P. V. during this very special\nUh all things considered so when you call eight hundred to two to four seven eight eight or go to ... dot org\nWe're going to be able to match your gift dollar for dollar that's such an incredible opportunity for you never give them before now might be the time to go ahead and step up at a hundred to two to four seven eight eight or on line that G. P. B. dot org\nSupport for G. P. B. programs comes from our listeners\nAnd the George alliance lighthouse foundation committed to filling the gaps that still exist for under insured Georgians by providing access to low cost vision and hearing services as it lions lighthouse subtle worked for details and making magazines seeking sharing and celebrating the good life and the good\nAnd hearing services is it binds lighthouse dot org for details and making magazines seeking sharing and celebrating the good life and the good stories in making middle Georgia since Nineteen eighty six more information plus how to subscribe and advertise at making magazine dot com\nFrom NPR News this is all things considered I Know the Chang and I'm Ari Shapiro it looks like North America will remain a free trade zone after all late last night Canada agreed to joined the U.S and Mexico in an updated version of the north American free trade agreement\nIt will no longer be called NAFTA but rather the U. S. M. C. A. NPR's Scott Horsley reports\nPresident Trump has long railed against NAFTA calling at one of the worst trade deals ever negotiate it but in the White House Rose Garden this morning Trump celebrated what was billed as a new and improved trade deal Trump called it a positive step for both the country and the world\nOnce approved by Congress this new deal will be the most modern up to date and balance trade agreement and the history of our country with the most advanced protections for workers ever developed\nIn signing on to the deal candidate agreed to open up bits long protected dairy market at least a little bit Trump says that means new opportunity for American dairy producers to sell their products north of the border including milk butter\nCheese yogurt and ice cream to name a few I Want to be very specific\nBut Canada is still expected by more than Ninety percent of its dairy products from Canadian suppliers former U.S agriculture Secretary Tom Vilsack who now heads the dairy export council says the new deal is an improvement for American dairy farmers but not by much\nWe're looking at an incremental increase in excess were not certainly looking at a an opening why do the market but we are seeing an increase\nMore importantly perhaps the agreement is designed to prevent Canadian dairy farmers from dumping surplus skim milk powder on the world market at what the us views as artificially low prices\nExchange for these concessions the U.S agreed not to scrap NAFTA Arab process for resolving trade disputes even though Trump want it to preserving that arbitration process was a top priority for Canadian Prime minister Justin Trudeau\nWhen you're trading partners ten times your size\nSee any rules\nYou ... if a level playing field the U.S and Mexico had reached a tentative trade deal more than a month ago but Canada didn't agree to sign on until late last night just hours before a White House deadline Walter\nUs and Mexico have reached a tentative trade deal more than a month ago but Canada didn't agree to sign on until late last night just hours before a White House deadline Walter do cautions there are still hoops to jump through before the deal is finalized the threat of a trade agreement that left Canada on the sidelines has been averted\nThank you for tuning into all things considered very good Monday to you I ... and the Supreme Court's new term began today with just eight justices as the fight over a judge Brett Kavanaugh's nomination continues to take a look at what is on the docket of the nation's highest court with only eight justices\nThat's coming up but first remember we are able to bring you stories from Washington DC\nFrom Zimbabwe from China and from right here in Georgia because you provide the financial support we're headed into the final stretch of are false on dry so right now while you're thinking about it before you're Monday evening gets too busy right now we're counting on you to join the community\nThat keeps the news and information that you need going strong our doors are open we welcome your contribution at whatever level is right for you\nPlease give generously and were so grateful for your support it G. P. B. dot org just click donate at the top of the page or give us a call ... eight hundred\nTo two forty seven eighty eight\nIt only takes a couple of minutes and your support is a direct investment into the programs that you love your I. G. P. D. thank you I'm here with her it was half measures\nHave your major gift during this fund drive yet if you have a guess what you picked a great night to be considering that and listening to all things considered because thanks very generous leadership donors like Carla Hanson and pat knocks hubs and Britain huffing my gardener\nWe are going to be able to double your get that's right you make a fifty dollar gift when you call eight hundred to two to four seven eight that's a hundred dollars you make a hundred dollar gift when you go to ... dot org it's two hundred dollars for an incredible opportunity\nWhen you call eight hundred to two to four seven eight eight that's a hundred dollars you make a hundred dollar gift when you go to ... dot org it's two hundred dollars what an incredible opportunity\nFor you to make your first gift or an additional gift maybe it's been awhile since you made your last last gift this is a great way to come back and make your gift we're going to double it things to be generous donors call us at eight hundred to two to four seven eight eight of good a G. P. B. dot org [noise]\nThis is Ira Glass this American Life and hearing the sound of my voice chances are you afraid these pledge drives calm and you've heard them go\nYear after year\nAnd you have never quiet [noise]\nThat's a ... if you're hearing my voice right now you probably have never pledged yourself\nAnd I think they know why\nI think that you have noticed\nThat even though you do not pledge personally [noise]\nThis radio station stays on the air [noise] right [noise]\nI mean come on you hear a say you've got a call you got a call and then you don't call and the next week the national programs ... every day and you have not given and Scott Simon and Nina Totenberg somehow did not end up homeless on the street right and you have drawn to the only possible logical conclusion which is [noise]\nIt doesn't matter if you call\nLetter frankly I don't think that is the whole picture [noise]\nAlthough reason tells you they were going to be fine if you don't call and reason has dictated your actions during every pledge drive to this point you've been utterly reasonable you follow the logic perfectly right [noise]\nI'm here to tell you [noise] you gotta walk past reason [noise]\nYou ... the reason standing there in the corner and looking all smog and you're going to walk right past week you're going to walk past what his logical and what his reasonable to what is actually a bigger truth\nThat you want to do what's right\nAnd you know okay you know that you listen to this radio station all the time you're hearing me right now it's not even a program right now this isn't a pledge break okay that's just how much you listen to this radio station he was in during the pledge breaks and what is right\nIn the simplest way that we teach a five year old you know here's what's right and here's what's wrong\nWhat is right is that if you use something\nFor depend on something or share something like you say this radio station with all the other people who listen to those radio station [noise]\nIt is only write to help out and keep it going\nIf you were to explain this to a five year old right now you would say that's what's right and it does not\nOnly write to help out and keep it going [noise]\nI mean you were to explain this to a five year old right now you would say that's what's right and it is not right\nIt is not right to it other people shoulder the burden\nSo yes you did not have to pledge we're going to stay on the air if you don't play and that's why it's such a statement when you walk by the logic of that\nThe undeniable logical that\nAnd actually contribute\nThat everybody who contributes the first time that's why they always say it's felt so good it felt so good you know because it's such an act of of faith and community and you know we're all in this together\nBecause the truth is we are on this together you and me and all of us and that's when you refer me [noise] when you call that number\nEight hundred to two two forty seven eighty eight or go to our secure website G. P. B. dot org and as a active aspiration\nIt is an act of inspiration to invest in public radio as Ira Glass just said sure we're going to be on the air next week Nina Totenberg and Scott Simon and ... and Emily Jones we're going to be here on the air\nBut you are making an investment in something that's so valuable to you this is the final stretch of our fall fund drive so if we have not yet heard from you during this drive\nPlease take this opportunity now to support G. P. B. think about all the time you spent with cheap TV over the last few weeks months maybe even years well your support ensures that CPB will continue to be here for you\nAnd for the next listener to discover think of it as a gift to yourself into your community cheap ... dot org is where you can make your secure investment or call us at eight hundred\nTo two two forty seven eighty eight joining me in the studios for it was like I said\nYou know in that spot with Ira Glass we had a chance to sort of get a glimpse of the sincerity of Ira Glass and what has really been a hallmark personality here on NPR but you know there's also this kind of moment to think about the depth and the breast of what you get every time you turn into G. P. B.\nYou might get all things considered with news information that's vital to your day or MORNING EDITION to get you started off right but you also might come here on the weekends and get something like wait wait don't tell me you're a beautiful story telling like\nThis American Life snap judgment the moth radio hour regardless of what drags you hear what brings you to this place what was your sort of gateway or entry point\nThis American Life snap judgment the moth radio hour regardless of what drags you hear what brings you to this place what was your sort of gateway or entry point\nAll of it means something and in some ways people like Ricky and I we're custodians of the public good I mean you put money into this thing because you believe in it and you believe in what it brings you every day\nThat's worth supporting if you're doing it thank you so much if you haven't done it yet I Want to implore you I'm compelling you pick up your phone call eight hundred to two to four seven eight ... he beat out or get in while we've got this great a member match right now because when you become a donor at any level we're going to double your gift\nThat's an incredible opportunity now's the time to do at eight hundred to two to four seven eight eight or ... dot org\nAnd bestselling author and humorist David Sedaris as coming to Georgia for one night only and we would love to send you to that show when we hear from you\nAt two hundred and fifty dollars on the phone at eight hundred to two two forty seven eighty eight with your credit card contribution of two hundred and fifty dollars we would love to send you a pair of tickets to the David ... live before these tickets go on sale to the public\nThis is it the Lucas theater in Savannah\nAnd you can also join us for GBDs pre show reception when we hear from you at eight hundred to two two forty seven eighty eight with a credit card contribution of two hundred and fifty dollars these tickets are not available on our website because we've got to monitor the inventory these are really really popular\nWe know you love David ... it's hard for you not to love David severe as you get to go see 'em live he's fantastic he loves the live audience if you've never seen them before it really is a great night spend the weekend in Savannah April twenty fourth is the date for David Sarah tickets at gp beat no you've got a call us at eight hundred to two two forty seven eighty eighth\nAnd recuse right we do have to monitor those number of those tickets because they're limited and we're also we have the tickets before they're on sale to the public so you're actually getting ended a really good time you're going to get great seats\nYou're going to be able to enjoy a great night with David Sedaris right there at the look of theater in Savannah\nWhat a great time of year to be in Savannah first of all secondly getting these tickets now before they go on sale to the public\nIs a great opportunity because they are going to sell out quick if you haven't seen David said there are a lot of fun in person and that she can be pretty show reception that we're going to give you a free entry too as well that's going to be a lot of fun to have a drink with us have a bite to eat meat other people just like you who have supported Georgia Public broadcasting in order to be there to see\nThe entry to as well that's going to be a lot of fun you get to have a drink with us have a bite to eat to meet other people just like you who have supported Georgia Public broadcasting in order to be there to see David said there is that night I Know he'll be super proud of you because he's such a fan of NPR and public radio\nThat he's giving us this opportunity to get these tickets to you before they go on sale to the public\nSo call us at eight hundred to two to four seven eight eight go on line to or don't go on you can go online to gp read about those tickets two hundred and fifty dollars on your credit card at a hundred to two to four seven eight and\nRemember right now we have a dollar for dollar match in effect no matter what amount you come in with right now will be matched dollar for dollar when we hear from your contribution will be doubled\nSeventy five dollars become a one hundred and fifty dollar investment in the news on ... three hundred dollars right now automatically become six hundred dollars [noise]\nBe cheddar is now is the time to get your dollar for dollar matching double your investment an impact on gp at eight hundred to two two forty seven eighty eight or you can go online to G. P. B. dot org thank you so much for your support\nDo you think the FBI has a responsibility to ask for additional time if additional information comes up about issues that weren't at the forefront at the beginning\nI think the FBI could request additional time if they found new evidence new information about why the background is being conducted I think the FBI could requested however President Trump must approve the quest\nJak Owens is a former FBI agent thank you very much\nOh You're welcome Elsa thank you\nEven as the fight over Kavanaugh's nomination to the Supreme Court continues the court began a new term today and it did so with only eight justices Republicans had hoped to see judge Kavanaugh in time for the new term of course that did not happen NPR legal affairs correspondent Nina Totenberg was that the court today and has this report\nThey played out like a Hollywood movie with the action moving\nOf course I did not happen NPR legal affairs correspondent Nina Totenberg was that the court today and has this report\nThat they played out like a Hollywood movie with the action moving back and forth between the three branches of government\nAt the White House today the president held a Sunday apple press conference to talk about his new trade deals but inevitably he faced Kavanaugh questions\nAmong them given how part or send Kavanaugh's performance was last week could the president a sure the American people if Kavanaugh would deliver impartial decisions if he's confirmed to the court\nThe president never really answered the question was you'll have to ask him that question but I can tell you who's been treated horribly meanwhile behind the scenes at the capital of the Republican leadership was trying to limit the FBI investigation\nThat was forced upon them last week when three key Republicans said they would not support cabinet unless the FBI background investigation was reopened\nBut what that investigation entails remains an open question with a Republican Senate majority leader Mitch McConnell stressing the limited nature of the investigation and President Trump saying he wants a comprehensive but short investigation\nWell all these machinations were taking place the Supreme Court opened a new term and began hearing arguments once again as in twenty sixteen the court has only eight justices back then Senate Republican leader McConnell blocked any hearing for President Obama's nominee to the court for almost\nBut back then Justice Anthony Kennedy a conservative who sometimes sided with the court's liberals was still on the court\nNow he has retired so today for the first time in well over Thirty years there was no justice like Kennedy or Sandra Day O'Connor both appointed by President Reagan who sits\nAt ... at the center of the court and today the liberal conservative split was a parent in the first case to be argued a challenge to a regulation under the endangered species act the central player in the case is the ... go for a frog which sounds a bit like this [noise]\n\nThis species lives in only one place in Mississippi and is in danger of becoming extinct when the ephemeral pond that it lives and breathes in is gone a federal ponds dry out periodically and have no fish so the frogs legs don't get eaten\nAt issue in the frogs cases whether the fish and Wildlife Service can designate an area in Louisiana where the frogs once lived as a critical habitat so that at some point in the future the frogs maybe move back to this\nDesignated area in Louisiana where the frogs once lived as a critical habitat so that at some point in the future the frogs maybe move back to this area where there are more rural ponds\nWarehouse or the timber company which leases land his challenge the designation as a potential threat to any future development plant after the documents on the steps of the court Noah Greenwald the endangered species director at the center for biological diversity\nExplained why Congress enacted the endangered species act in the first place\nThe Web of life that we ourselves depend on is built of species you know you go systems are made of species we all depend on speed or food for medicines for clean air for clean water\nWarehouses lawyer did not come to the microphones\nBut inside the court the four liberal justices appointed to language in the endangered species act that allows reasonable actions like this one and the courts for conservatives complained that the fish and Wildlife Service doesn't say what reasonable is\nA four to four time would mean the lower court ruling stays in place meaning warehouse or loses\nHow fast the court gets a ninth justice depends on how quickly the Senate can hop along\n[noise] Nina Totenberg NPR News Washington\n\n\n\nYou're listening to all things considered from NPR News\nA drug commonly used to treat the bone thinning disease osteoporosis could protect them more older women against bone fractures that's according to a big new study published today by the New England Journal of medicine NPR health correspondent Rob Stein has the details\nAs we age our bones tend to get dinner and dinner and dined read at the University of Auckland says millions of older people break a hip spine or some other bones and it's often the beginning of the end\nAnd it should be used for them to move to strip and the problems just getting\nFor his time as we are living longer population there shouldn't be a tree\nSome into an institution and the problems just getting worse what's\nHappening at the present time is we are living longer population is progressively aging\nSo she was an older people is becoming a very major issue\nPeople diagnosed with the bone thinning disease osteoporosis can take drugs to prevent factor but there's been a big debate about people with less frail bones\nIn fact most of the factors that occur in older people in the much larger number of people who have lost so Reed\nAnd his colleagues tested a drug long used to treat osteoporosis on two thousand women sixty five an older with just the early stages bone loss a condition known as ... for six years half infusions of the drug half got a placebo\nSore about a one food production into torn up so fractious fifty percent reduction in spine fractures\nAnd no sign of any serious side effects in fact the women getting the drug were less likely to suffer a heart attack get cancer maybe even die\nSo I think what this means is that we can grow in a group of people we can offer these medications for we can reduce the number ... across the trainer see more effectively\nOther experts agree this is an extremely important paper that's Apple's Cyrus at Columbia the reason this is so important is that we have been uncertain what to do\nWith the great number of people primarily women over the age of sixty sixty five who have on the opinion you know you have a drug that you can use that has been shown to work in such patients it's a big deal\nA lot of doctors and patients that scared away from these drugs because reports they could actually cause hip fractures and unusual draw problems but Michael ... of the American society for bone in mineral research says the new results should make people rethink that\nWe are overly worried about exceedingly rare side effects and ... are worried about common things like fractures I think you have to start looking at where the big ... but others are more cautious\nThis one study is helpful and it just to buy one study in of itself does not necessarily the truth\nThat's Robert ... from Yale he's president elect of the American College of physicians\nWe're not going to reconvene and immediately changed the guidelines\nBut everyone agrees that older people should talk with their doctors about the new study to see if taking a drug to cut the risk of breaking a bone\nReconvene and immediately changed the guidelines\nBut everyone agrees that older people should talk with their doctors about the new study to see if taking a drug to cut the risk of breaking a bone makes sense for them or not [noise]\nRob Stein NPR News [noise]\nThis is G. P. B. where generous listeners like you make all things considered and all of the programs you listened to possible ... starts at about ten minutes at six o'clock stick around for the latest business and economics news from Kyra stolen his team\nThank you for listening to the evening happy Monday and most importantly thank you for doing your part to keep all things considered coming to you on ... we're in the final days of our fault fund drive as\nWe head toward the end of this drive all it takes is all of us banding together including you\nTo keep public radio in Georgia strong so whether you're listening in Athens maybe savannah make in\nAugusta Albany Roma points in between or you recently started tuning in an eighty eight point five GB Atlanta please be the next listener who joins our public radio community or doors are open it's a great way to wrap up the first day of your work week\nPlease give generously a cheap ... or click the green donate button at the top of the page or give us a call eight hundred to two two forty seven eighty eight thank\nYou for your support I'm joined by Burt what's happening and we do have that added incentive we have a special uh to Amazon Echo dot smart speakers that we are going to be giving away at the end of all things considered tonight at seven o'clock\nSo many ... eight hundred to two to four seven eight eight or click on G. P. B. dot org and make your give to support\nBlum says rent control is just a band aid and at the root of the problem is the fact that there's just not enough housing\nThe real solution to our affordable housing crisis is more construction of housing across the whole spectrum\nThe state estimates it needs to build well over a million new units right now land is in short supply and a lot of what is being built\nIs high end and that's fueling a lot of the anger and momentum behind the push for rent control like in a lot of booming American cities LA residents are watching his whole blocks are demolished to make way for luxury homes and big fancy apartment complexes pools and gyms [noise]\n\nProp ... supporters and neighbors of eighty two year old Robert Rodriguez protesting on the street in front of his old building on the building's owners say the rent increases were needed to cover maintenance costs and are still below market rates\nFor now Robert says he and his wife will stay with his sister while they desperately look for a new place\nFor now Robert says he and his wife will stay with his sister while they desperately look for a new place if you don't know\nAll you've got left as Skid Row\nRodriguez hopes that doesn't come to that\nKirk Siegler NPR Los Angeles\nTo scientists simply curious about understanding how our immune system works and he got making discoveries that rocked the world of cancer treatment and Nobel assembly and fleeting today announced the two men will share this year's Nobel Prize for physiology or medicine NPR science correspondent Richard Harris had\nJim Allison says he's always had a personal interest in cancer his mother died of lymphoma when he was ten and an uncle died of lung cancer but when I was in went into science he did so because he was curious about how the world works that curiosity led him to an honor many around him had been expecting him to get the Nobel ...\nThe reason I'm really thrilled about this I'm a basic science is I did not get in to these studies to try to cure cancer I got a job because I Want to know how T cells were\nT cells are vital component of the human immune system but when I started out he says people simply didn't understand what they did in the Nineteen nineties Alison was working at UC Berkeley when he discovered a vital element of T cells they had what's essentially a brake pedal to keep them from going too crazy\nSo well as just disabled the brakes sphere that rollout immune system to attack transfer\nThis braking system it's called the checkpoint and what was that wasn't discovered this mechanism drug developers set to work creating drugs to block checkpoints drugs called checkpoint inhibitors meanwhile at Kyoto University in Japan Dr ... independently at work on the same biological puzzle\nHe discovered another set of T cell breaks so he shares the Nobel Prize from the sciences emerged a multibillion dollar effort to develop market and improve checkpoint inhibitors\nLord I was told by other Nobel Committee when I was called this morning there was the first prize I've ever given for cancer therapy suffer cats because her catcher before but this is the first time for cash or therapy\nThese checkpoint inhibitors have led to some remarkable successes for example former President Jimmy Carter was diagnosed with advanced melanoma which had spread to his brain but a checkpoint inhibitor\nA remarkable successes for example former President Jimmy Carter was diagnosed with advanced melanoma which had spread to his brain but a checkpoint inhibitor vanquished has cancer doctor Monica ... newly president of the American society for Clinical Oncology says\nCheckpoint inhibitors have generated tremendous excitement because of remarkable stories like this unfortunately\nThat is still a small percentage of patients\nThe races now on to figure out how to make these drugs effective in a lot more people with a lot more types of cancer\nJim Allison now would empty Anderson Cancer center in Houston says now that they understand the basic rules they can set to work on improvements and have for one is optimistic that this new branch of cancer treatment will end up saving many more lives Richard Harris NPR News\nTomorrow on MORNING edition when Christine Blasey Ford testify last week before the U.S Senate she kept cool she did not get angry author Rebecca Traister his new book offers a look at how women through us history have used anger to both political benefit and peril\nShe'll talk about it on MORNING edition listened by asking your smart speaker to play NPR or your local station by name [noise]\nYou're listening to all things considered from NPR News\nCalifornia's governor Jerry Brown signed a law last night barring Internet service providers from blocking or slowing down traffic or charging for faster loaded below basically restores the net neutrality rules created under the Obama administration and repealed under President Trump\nThese are seen as the strongest net neutrality protections in the country and within hours the Justice Department sued to block the California law NPR's Alina Selyukh is here to walk us through what this means for Internet users like us hailing uh-huh\nRemind us what net neutrality is and what impact this California law if implemented would have on ordinary people going online\nRight the over arching question of net neutrality is how much power your Internet providers who'd have over your Internet experience so typically when people talk about and neutrality they mean regulations like no blocking of whatever let's say you went to visit that Internet providers should not be\nSo typically when people talk about and neutrality they mean regulations like\nNo blocking of whatever website you want to visit that Internet providers should not be able to slow down an app that you're visiting other elements sometimes include things like zero rating which has a deal\nWhere rising might give you streaming of Hulu that doesn't count toward your a data restrictions but then count Netflix store data just restrictions and these are all rules that California put into place they they banned all these things\nBefore the Trump Administration repealed neutrality rules there was a ... vote or campaign by activists trying to get the FCC not to take this step now that California has gone through what has the reaction but\nWell California was in the sort of reacting to the massive liberal wave of activism and online activism that prompted\nUm the the writing of these rules um you know the battle lines have been drawn for a while on the net neutrality debate and then there's still the same on the one hand you've got Internet companies especially the smaller ones like at sea or video streaming company ... saying that these rules are critical for them to be able to compete against the bigger companies\nOn the other side you've got the telecom providers you're Eighteen to your ... your Comcast that have been pushing California to not put not neutrality rules into place and are expected to sue California as well\nAnd the Justice Department has already sued California explain why the ...\nOn so many things actually so it's on a political level California\nIs an interesting state it is the largest economy in the United states um it has the power to sort of set the bar for a lot of regulations and they have used that power and they're currently in legal disputes with the department of justice over a variety of policies\nUm including immigration admission standards and often when California sets a standard many companies look around and and think to themselves that it is a lot easier to just abide by the California standard and sort of how goes California so goes the rest of the nation now they're\nAll the Texas play during the Obama administration economic powerhouse the counters the politics of who's in the oval office and\nThe department of justice in this case did respond you know attorney general Jeff Sessions said exactly that essentially he's accusing California legislature of of ah attempting to frustrate federal policy as he put it\nSo what does this mean for consumers and companies will fight plays out\nUh not much yet the rules were not isolated to go into effect until January at this point the Justice Department is seeking an injunction to not have those rules go into effect at all in the meantime on a federal level\nThat's a leader to go into effect until January at this point the Justice Department is seeking an injunction to not have those rules go into effect at all in the meantime on a federal level uh the tech companies and the consumer groups and twenty attorneys general including in California attorney general are suing the Federal Communications commission trying to\nOn rules the repeal of the Obama era rules so all of this is kind of in the hands of the\nCourts are and we're waiting to see how that plays out in ...\nThank you for tuning into all things considered on your public radio station Georgia Public broadcasting where your support and makes conversations and interviews with journalists [noise]\nWho are experts in their field so that we can better understand the issues\nJust like we heard on all things considered you make it possible ... this is the final stretch of our fault fund drive if we have not heard from you yet during this drive please take this opportunity now to support G. P. B. call now eight hundred\nTo two two forty seven eighty eight or give on line to G. P. B. dot org thank you for your generous support here with me as Bert Wesley Hoffman\nAnd this is your last chance to uh get in on your support for a for G. P. B. and all things considered and take advantage of the match that we have going on thanks very generous members of our leadership circle a your gift dollar for dollar is going to be matched when you called eight hundred to two to four seven eight eight or go to ... dot org\nThis is your opportunity to double the impact of your support right now\nAnd again thanks to those generous members of our leadership circle a just about twelve more minutes to get in for this match so don't put it off until friday do it now while you're thinking about it eight hundred to two to four seven eight eight or ... or don't", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Chatsworth", "day": "01"}