{"month": "10", "state": "AZ", "station": "KOFA", "content": "\nBroadcasting from the campus of Arizona western college does its border radio Thirteen twenty am Kayla the you might end born and radio dot org\nWe also broadcasts an Arizona community radio network at eighty nine point five FM cagey C H ... Williams Ninety One FM cage ACP prince get Ninety point seven FM cagey seeking men in Ninety One point three at them like staff\nMostly sunny in Kingman today hind you're sixty eight bit windy out there was some northeast winds up seven to search him up for our\nPartly cloudy in the evening with a lower I'm forty eight there's a slight chance of showers throughout the day in Prescott today it was sunny skies and hide your fifty eight partly cloudy in the evening with a low rent thirty nine thirty percent chance of showers before noon in Flagstaff a partly sunny skies hind you're forty six the chance of showers slightly decrease in the evening with partly cloudy skies in the low rent thirty two\nIn the sunny skies were behind your eighty one partly cloudy with a low rent sixty two\n\nIt's ... like I said I'm here with you with some great music lined up for this next hour we'll hear from Madison dream Paul McCartney has a new album that started out with a favorite one from arcade fire\n[noise]\nSome\nPeople be the\nSort of a\n\nCame from a man [noise]\nThe no no the\nKids taking the man is\nThe Shia gray with ... ... is the you\nAnd they came and gray\nRandy in this shack whose views\nAnd\nA\n...\nShip and on\n\n[noise]\n... I Know why ...\nWhy mole\nNo jail while he\nAround the any team in in New\nIn in ...\n\nMe and said it would to me to\nSaying we'll be me me\n\n\nIt is he has said it would to me\nAm the main street and then\n... ... ... ...\n...\nBreach the bottom of the\n...\nAnd you just can buy a new way\nTo jam a\n... ... ...\n...\n... to know the last ...\n... by\nDoing well you know put on which to\nA barrel\nDa\nNo\nA\n\nUm\n\nAh in\nYou know oh no not enough\n\n[noise] oh my God\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa [noise]\nBut above all day but I Do\nThat ...\nThat the judge in the well the two\nMain\nFriends up in\nThe bill\nUm and a half broach new\n...\nThat the judge in the book the\nMan to man\nRandom in\nThe middle\n[noise]\n\nThen\nAnd you get down\nJohn McCain\nMy dad and my\n\nBoat in\nBed\nA good job with the bone in terms of the barrel while the real man go bad law I'm sure the guy to a hell of a star with his grandpa Bernie in that dark but you want to do it but there is a big hot ...\nThink it'd be you know it\nGoes I don't believe that not many then and now the goal but we're going to be on the bad lamb\nOr you leave the ... like the Georgia in the dark on a board of ... in the bar is the man and a little bit on the law does not like you know\nBut you\nLot of liquor here about a lot\nJob I had um\nOr you get to see the ... like Georgia and the dog gone and still do particularly you pay a little bit by some of the market you know you remember\nLiquor here that he got a lot\nCapitol Hill is trying to buy had I'm a I'm going to\n\nWin in ...\nIn their good O. J. lo\nWas overjoyed to\nTry\nAnd jump on\nThe ... the the two things are the\nFrom\nThe\nWhy stay on the other way or the man leading the\nWay you did have\nWas bad\nIt um do we like to\nGo with\nCoral job to do\nTo protect the\n[noise]\nChance to catch a game that he did he go again in the world that can can then they\nBuilding the ... the Federal Reserve left\nAnd then to go\nIn San Diego\nAmy lived there with him cats down it was punch brothers with jumbo and Paul McCartney gave us a new song off his new album each station despite repeated warning it's undercurrents I'm Kathy\nLohr rain and the Caesar around the corner but first years hating Sayers with with the foster\n\nNo sense and they don't ...\nYour ... when\nLive down you were raised\n... and ... live down you were raised and a\nJust send the gay marriage than the teachers are paid laid down you read\nAnd\nTrying to calm\nYou know my turn to the ...\nDown you were\nBreaking the law\nLay down you were\n\nIt and you\nO lo\nLo o lay down your own were raised\nLike Jerry in law\nLay down you were rich\n\n\nFood and still be a\nOoh\n[noise]\n\nThis is border radio care what they do much Thirteen twenty am and voter radio easy dot org ... western college we also broadcast on the Arizona community radio network at eighty nine point five FM kj the age ... Williams\nNinety point one FM Jay Jay Z the Prescott Ninety point seven FM Jay Jay's UK Kingman Ninety One point three of them in Flagstaff\nMostly sunny in Kingman today hind you're sixty eight a bit windy up there with the north east winds up seven to search him out\nI pay ... Thirteen twenty am and voter radio ... dot org ... western college we also broadcast on the Arizona community radio network at eighty nine point five FM kj the age ... Williams\nNinety point one F. M. J. J. D. V. Prescott Ninety point seven ... kj decay Kingman Ninety One point three a famine Flagstaff\nMostly sunny in Kingman today a high and you're sixty eight a bit windy out there with the north east winds up seven to Thirteen miles per hour\nPartly cloudy in the evening with the Loeb around forty eight there's a slight chance of showers throughout the day in Prescott today was sunny skies and hide your fifty eight partly cloudy in the evening with a lower I'm thirty nine thirty percent chance of showers before noon in ... partly sunny skies behind your forty six the chance of showers slightly decrease in the evening with partly cloudy skies in the lower I'm thirty two\nIn your state sunny skies were behind your eighty one partly cloudy with a low rent sixty two\n\nIt sounded ... got to be like after nine here with you but you need some great music for the next hour that I picked out we'll hear from Robert Allen to smithereens and steep for Bert let's start out with an indie rock group from Duluth, Minnesota here it's low on under current [noise]\n\nYeah that is you know\nDon't know\nMan\n\nNa na na na\nNa na\nMan 'cause\nI'm at the end of my row\nNa\nJohn I came out for\nNo\nI'm not one to me in\nOn the line I'm\nI'm\n\nDon't know ah they\n\nNa na na\nNa\nUh\nA\n... since ...\nSee nothing but a ...\n\nThe ... for\nThem to live in a way to get wherever I\nGo and they get just a\nA\nOn a\nNo\nNo\nWhen I was younger\nSo much for them to the\nLiving room and then by then and\nNow these things are not so sure\nNow I'm fond of change my mind\n\nA will know when I'm watching\nA really around doing some damage long mine they\nWere but\nWould not need to be in my view is marine move to be here\nOr ... when you're walking along\nA really do some damage in long ... ...\n\nWar may man did\nYou very much for me either read the ball\nNeed\nCrazy\n\n...\n\n...\n\n\nNa\n\nNa and\nAnd ...\nNa\nAnd he [noise] [noise]\n[noise]\nYour [noise]\n\n\n\n\n\n\n[noise]\n[noise] Hi this is Joanne Shenandoah and you're listening to undercurrents American music with a passport\nTo\nGo to\nJoe you may be the way in which you had in\nWater [noise] do glue\nAnd legs you\nKnow run a dog or the mom used to be you know ...\n... and John withdraw um [noise]\nWell ...\n\nYeah no no oh no\nYou know God\nOh no\nI was ... a ...\nA\n... you know I'm a\nI'm a\nYou do you do the we would have been\nAnd they [noise]\nThey do\nEasy no on\nUm\nDid you do your thing to do the wheat in Japan\nAnd they\nThe gate to want\nHear that the law\nWhich you're on the\nI'm Glad I\nOh God you know\nA a a\nOh a\nA lot I uh uh uh\nAh [noise]\n\n\nDid you do you believe in what you had\nNear the ...\nAnd lay\nEight to walk the ...\nYear to beat up on her\n\nOh yeah oh\nKnow I'm a I'm\nA I'm a\nLie is a dollar\n[noise]\nOh\nKnow I'm a I'm a I'm going\nOh\nNo oh no\nYou mean when they were oh ... I live in a\nLong you know [noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\nThat's wax Taylor featuring leaf feels on this song road is rough Nico case gave us last line of Albion\nBrigitte ... formerly of lake street dive gave us serenity and it was the smithereens with it don't come easy you're listening to undo currents and if you're just joining us welcome\nHere's a new one from Steve for bird he grew up in Mississippi and then moved to the big city to pursue his music he just published his memoir in which he reflects on the specific circumstances that brought him into the public guy here's Steve for Bert on undercurrents [noise]\n... that is the\nThis is\nThe\nAnd the guy here's Steve for Bert on under current [noise]\nMinisters are the things\nThis has been rat\nRace because it is\nRemember that Susan my name is too\nI mean\n\nAnd buddy Miller you're listening to undercurrents American music with a passport ...\nStill right\nZone right\n\nA ...\n\nMe they\nLive a ...\nThings were listening to pay at ... Thirteen twenty or Yemen and border radio easy dot org service of Arizona west in college we also broadcast on the Arizona community radio network at eighty nine point five at them K. J. D. A. Drake Williams Ninety ... cage easy you Prescott\nAny point seven F. M. K. Jay Z cake Kingman and Ninety One point three of them like a\nSlight chance of showers in Prescott throughout the day was sunny skies behind you're fifty eight partly cloudy in the evening a low rent thirty nine in Kingman mostly sunny a high and you're sixty eight some northeast winds up seven to Thirteen miles per hour partly cloudy in the evening with the low rent forty eight that when will die down just a bit\nThirty percent chance of showers in Flagstaff today partly sunny a high near forty six partly cloudy in the evening with the low rent thirty two and a slightly less chance of showers\nIn you must sunny skies with behind your eighty one partly cloudy in the evening with the low up around sixty two degrees\n\nIt's either ... got to be like I said I'm here with you with some great music lined up for you Courtney Barnett encouraged by al lean down I knew one from rape Bonneville and more that start out with optical na\nMan man\n\n\nIt is to me a\n\n\nI Do like\nOh this is Joe craven and you're listening under current\n\n\nBeep\nYou think's occurred\nHe takes you make\nIn the end they may have to take you know they can they can they do and\nYou know they need\nTo make you know it takes more than maybe the way they can they can ... di di di\nDi\nDi\nDi do do they can do\nTo make the um\nMade you were ... they said that there was a guy\nDi di\nDi di di\nDi di di\nDi di di ... yards\nTake them all the main goal that you know\nThe the\nBig ball to\nSee whether\nThey take those to make sure they did the on the\nNews in the book and I don't\nNeed to\n\n\nDo\n\nYou know\n\nIt takes to make\nThe thanks so what do they can go and make you make\nGood night for\nDid\n\nDid and [noise]\n\n\nDuring the\n\nSay three years is the\n... in\nAnswer\n\n\n[noise]\n[noise]\n\nOkay oh\n\nSay can you know in the car and they just made\nMe so he will\n[noise]\n\n[noise]\nThe same thing in\nThe ... he\nShe may [noise] [noise]\nThings in\nThe means to\n\n\n\n\n\n\nAnd\nKnow [noise]\n... ... ... ... [laughter] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\nDo you wish\nFrom green [noise]\nOkay [noise]\nYou know [noise]\n\n\n\nTo do much [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\nSo the law ...\nLaw for a\n\nNa\n... ...\n\nMindy misinterpret the Beatles the word Tom Petty give us keep a little soul from here\n[noise] no\n\nMindy Smith interprets the Beatles the word Tom Petty gave us keep a little soul from his and American treasure box set from two thousand Eighteen\nAnd re Bonneville has a new album out at king electric and we heard until such a day from that album and we heard legally danced with ... which means it's important\nYou're listening to a new currency and if you're just joining us welcome here's a new one from Mike Ferris\nAnd then the\nWe you\n[noise]\n\nBut we'll let you go in and\n\n\n\nBroadcasting from the campus of Arizona western college has its border radio Thirteen twenty am Kayla the you my ... radio easy dot org\nWe also broadcasts an Arizona community radio network at eighty nine point five FM K. J. C. H. ... Williams Ninety One FM cage ACP Prescott Ninety point seven F. M. K. Jaycee kicking men in Ninety One point three ethane Flagstaff\nSlight chance of showers in Prescott throughout the day was sunny skies behind you're fifty eight partly cloudy in the evening all around thirty nine in Kingman mostly sunny a hind you're sixty eight some northeast winds up seven to Thirteen miles per hour partly cloudy in the evening with the low around forty eight that when will die down just a bit thirty\nPercent chance of showers in Flagstaff today partly sunny a high and you're forty six partly cloudy in the evening with the low around thirty two and a slightly less chance of showers you must sunny skies were behind your eighty one partly cloudy in the evening with the low up around sixty two degrees\n\nIt sounded kind it's got to be like I said I'm here with you got some great music lined up for this next hour including me to spend big red machine Amos Lee and father John misty\nLet's start out with a band from Provo, Utah here the national parks with this on the creeps up on\n\n[noise]\n\nWhat would your perfect day\nLet's find out there was a hot air balloon\nBoy reasonably [noise]\nMess we filed a way by how do you agree\n'cause to me that\nSaw [noise]\nWhat can I say\nI mean you might be who we're forced me to play there\nWill be fine I Know how they're going\n\nContinue or read\n\n[noise]\n\nHe\n[noise]\nSome people\nThe street and\nSee Tennessee can now I'm\nFan them clean the planet in season ...\nThis ... this ...\nRight now no\nThe same man from\nThe ashes camp stove\nPlanets dinner scene you can say that's ...\n\n\n\nJust saying I don't\nSmall band\n\nHey this is real wolf child and you're listening to undercurrent\nIt's me one kid speech was like you\n\n... like in the\n\n...\nGame losing\nDid June no\nRead in the big man\nNa\nWe weren't\n\nHey this is Mark Matney ... also known as Nadia one on under current American music with a passport [laughter]\n[noise] [noise]\nHey this is mark ... also known as Nadia one on under current American music with a passport\n\n\nKnees ah\nIt a little deny deny deny deny deny deny well\nOh my God I'm no\nAccount they still this is on money go\nWinning goal\nI Know that how can they grow\nThere don't\nDrive could really say you must\nDo than nine oh two than I\nDo then I was in a way\nThrough the night do then I\nMisspoke so fast\n\n[laughter]\nHey is Trombone Shorty thanks will listen to on the current American music what a passport\n\n[noise]\n\n\n\n\nAnd um\n[noise]\nWhen we can learn\n\nKnow did you\nYou're kidding me [noise]\nWhen we can\nNo\nPromise to\nI\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\nTo\nWhat a great one from Trombone Shorty that's long weekend in front of that is easy ward gave us a domino it with a new one from father John misty date night and Peter ... and ... meant give us meditation song\nIt's undercurrents I'm going to be a lot and if you're just just\n\n\nWhat a great one from Trombone Shorty that's long weekend in front of that the the war give us a domino he's with the new one from father John misty date night and Peter ... and ... meant give us meditation song\nIt's undercurrents I'm guilty of that and if you're just joining us welcome here's Kerry rose ... and the Sacred Heart on under current\nIt'll then breath again and they never did\nNow tell well mama took me to do I get that get a\n... bad or when you're older you learn\nLater ... my hand don't ask me what like like\nMom then went\nWell let alone\nMeet with the world\n\nBroadcasting from the campus of Arizona western college this is border radio at Thirteen twenty am ... and border radio easy dot org\nWe also broadcast in Arizona community radio network at eighty nine point five FM K Jay Z a drink Williams Ninety point one F. M. K. J. C. P. press get maybe point seven app M. K. J. C. K. Kingman and Ninety One point three FM in Flagstaff\nIn Yuma sunny today in a high in eighty degrees north northeast when ten miles per hour tonight clear those around sixty four Kingman mostly sunny ice near sixty nine today mostly clear tonight with the low of forty six that's going to have sunny skies in a high a fifty nine today\nAnd tonight mostly clear those around thirty eight in Flagstaff the chance of rain and high at forty six today it's a night in Flagstaff partly cloudy those around thirty one\n\nYou tend to ... here we ... we can create music lined up for the next hour well here from Madison dream Paul McCartney has a new album let's start out with a ... arcade fire\n[noise]\nSo we have\nPeople be telling me they can't\nSo\n[noise]\nMonthly\nBe people be easily me they can't\nFrom a man to nudge people\nThe\nCage mate is\nWith job they hate him and he you\nWas making gray\nSunday during the ship Louis XIV you'd\n\nAnd\nWhen he\n[noise]\nOld were you\n\nTo a\n\n[noise]\nWell I Know there was no ...\nNo ...\nNo one knew me\nAround the any team in\nIn in the same way\nBe entertained and had\n\nAt me and said it would to me ...\nLet me ask you and me I mean\nThat the\n\nAs you said it would be\nAm the main\nStreet and then\n... ... ...\n...\nWhen you reach the bottom of the\n...\nTo jam a\nOn our Web ...\nTo ...\n... to know the last ...\nTo buy and\nMe to walk in a song which too\nA year now\nA\nUh\n\nI'm\n\nAh in\nWord you know oh my God oh my\n\nGod\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa [noise]\nA bottle thing but John ... due to\n...\nThat the judge in the ... the\nBill but the main\nRent some in\nThe bill\n[noise]\n[noise]\n\nThen\n\n... bumping\nKnow\nIn\nTrue\nTo me the radio network that eighty nine point five ... Ben ... Williams Ninety point one FM Jay Jay Z pie Prescott Ninety point seven FM kj ... Ninety One point three of them in Flagstaff\nAnd you love sunny today in a high eighty degrees north northeast when ten miles per hour tonight clear those around sixty four he mostly Saudi ... near sixty nine today mostly clear tonight with the lowest forty six that's going to have sunny skies in Ohio fifty nine today\nAnd tonight mostly clear lows around thirty eight in Flagstaff a chance of rain and high at forty six today it's a night in Flagstaff partly cloudy those around thirty one\n\nIt's ... ... do you like us to nine here with you with concrete music lined up for you Courtney Barnett incurred by all lead let down a new one from ray Bonneville and more that start out with a cool [laughter]\nNa man\n...\n\n\nOh this is Joe craving and you're listening under current\n\n\n\nShakes occurred to me and she takes it to make\nThe change in Baghdad may guy has to take and then they can they didn't know where do you\nTake stock you can\nGet an admission it takes more demand you said some good and they found that there is di\nDi di do do you\nHave to make it do\nThey tell you make your\nLong to make a big\nThing in the\nBig people in\nThe news was that\nIt takes to make sure they can take all the\nTime you do that and I don't\nNeed to do\n\n\nAnd\n\nYou know\n\nIt takes to make\nIt takes just so fast\n\nIt takes\nTakes well did\nThey make you may go down\nIt did but the night you know\nHe did but\n\nI don't know [noise]\n[noise] well\n[noise] Mm\nMm\nDuring the\nWe didn't\n\n\n\n\n\n[noise]\n\n\nLow pay and\nSay you know I'm thinking maybe he will\nA\nWhile and\nWe [noise]\nThe the\n\n\n\n\nYou\n\nAnd\nKnow [noise]\n[noise] [noise] ... [laughter] [noise]\n[noise] [noise] [noise]\n\n\nA you know we\nDo you wish\nFrom green [noise]\nChanged oh can you\nTo be you know [noise]\n\n\n\nJust to watch [noise]\nMuch of the day\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\nFrom your dreams\n\nDidn't we [noise]\nFrom your [noise]\n\n\nWe're in the\nCar on\nNa na\nThe\n\nMindy Smith interprets the Beatles the word Tom Petty give us keep a little salt from his and American treasure box set from two thousand Eighteen\nAnd re Bonneville has a new album out at king electric and we heard until such a date from that album and we heard Leila downs with okay which means it's important\nYou're listening to under current and if you're just joining us welcome here's a new one from Mike Ferris [noise]\nYou\nSo we used to clean\n\n\nWill miss the golden ball and\n[noise]\n\n\n\nNinety point seven ... men in Ninety One point three at them like staff\nIn Kingman mostly sunny today with the highest sixty nine east north east wind eleven miles per hour but I mostly clear those around forty six\nPrescott sunny hiking you're fifty nine today it's a night mostly clear laws around thirty eight in Flagstaff a chance of rain and high uh forty six today partly cloudy tonight lows around thirty one Yuma sunny ice near eighty degrees\nAnd tonight clear with the low around sixty four\n\nIt sounded kind it's got to be like a lot here with you got some great music lined up for this next hour including me to spend big red machine Amos Lee and father John misty\nLet's start out with a band from Provo, Utah here at the national parks with his son they create [noise]\n\n[noise]\nOh it's perfect day\n\nLet's find out there on the hot air balloon\nBoy ... [noise]\n... ... ... ... do you agree\n'cause you can read or heard\nSaw the [noise]\nWhat can I say\nI mean you might be we're forced me to play there are really the [noise]\nWe'll be fine Hi no hot air balloon\n\nYou are from Sweet Honey [noise]\nPhony [noise]\n...\n\n[noise]\nSome people\nThe street as\nSee tennis see can now I'm\nAdams fan and increase the printed in the season none of us from\nThe ... ...\nRight now not\nBusy man I don't find\nAs his campaign stove\nPlanets then they'll see you can say that\n\n\nJust said [noise]\nStraw\n\n[noise] hey this is the real world of child and you're listening to undercurrent\nIt's to me one kids which was ... like you\nDa ding\nDid you know\nRead in a big man\n[noise] [noise]\nHey this is mark ... also known as Nadia one on under current American music with a passport [laughter]\n\n\nThe ah\nAccount the field is somebody go\nWinning goal\nI Know that I can only role\nThere and\nSay you must\nDo then nine oh two didn't know he\nDoes then I was in a day\nTo day night oh Dylan my\nBaseball so fast\n\n\nHey is Trombone Shorty thanks will listen to on the Korean American music with a passport\n\n\nThank\n\n\n\nAnd um\nYour hobby\n[noise]\nWe can start you\n\nKnow just go\nThink\nStand up\nI don't\n[noise]\n\nOoh\n\n\n\n\n\n[noise]\n\n\nWhat a great one from Trombone Shorty that's long weekend in front of that is easy ward gave us a domino he'd with a new one from father John misty date night and Peter ... and ... meant give us meditation song\nIt's under current I'm guilty of that and if you're just joining us welcome here's Kerry rose ... and the Sacred Heart on under current\nIt'll then bread again it mattered and\nMen honky tonk well led mama mia though I gave it a\nBad\nYou're older you learn\nYour land my hand don't ask me what my\nMom went to the doctor or you\nWell let alone\nMe there was", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "17"}