{"month": "10", "state": "AZ", "station": "KOFA", "content": "\nThanks for listening to you what the you might in Thirteen twenty am and boarded radio ac dot org and service of Arizona was in college we also broadcast an Arizona community radio network at eighty nine point five FM K. J. C. H. drink Williams Ninety point one F. M. K. J. C. P. press get\nNinety point seven F. M. K. Jaycee taking any one point three ...\nSunny and windy today in your mind you're Seventy eight with someone gets up to thirty miles per hour most like there in the evening with the low around fifty nine there's a twenty percent chance of showers throughout the day in Kingman today with partly sunny skies and hype sixty four part of the cloud in the evening with the long run forty eight and ... gets scattered showers throughout the day with most of these guys and hide your fifty\nPartly cloudy with a low rent thirty six in the evening rain and snow showers throughout the day in Flagstaff it's mostly quiet guys behind your forty\nMost equality in the evening with the ... around thirty one degrees\n\nAlright it's under current it's a great record welcome how you doing good and hope and we're doing well hey I've got some great music coming away from dirty projectors who ... de Los ... balls and this from five [noise]\n\n\n\nSo\nI could not see that too [noise]\n[noise]\n\n\nAnd they do they do to speed the economy just shown that indeed so\nNot going\nThe prime\n[noise] Nineteen thirty six breed the\nGarment shown no just needed to show\n\nThere is an\nAnd a half away in the south Georgia NATO's I Believe\n[noise]\n[noise] [noise] [noise] you\n[noise]\nTime\n[noise] they\nSame time\nWhole\n\nReal tall\n\n\nBe\nI didn't make the move somebody else's God\nWe owe it gets securing at the same but [noise]\nI don't know about what she did not want to screen the true\nShe thinks you love the beach that keep them alive\nI didn't make the Thin Man somebody else's God\nWe owe it gets the drinks at the same but\nI don't know about what she did not want to scream to chew\nShe thinks you love the beach the damn ... [noise]\nThose great why they have the key\nThey buy shoes that that you did you leave the other thing is\nNo more than if I knew I Would just let me ... and then I don't know\nI'm In my\nSometimes do we do that is that they do\n... things just dating back to you\n\n\n\n... [noise]\nYou know the goal is you do [noise]\n\nCould just do a lot\nI Love your your the green ... see\nBeyond [noise] to me [noise]\nThat they've become too [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nShe\n\nShe knew she may\nIn the\nAh\n[laughter] [noise] [noise] [noise] ... ...\nWho was Bob wisdom oh let's see\nYou know by the way\nUp ...\nPants were up the nuclear ...\nGoal for\nPants rub the on New Britain\nGoing to\nWell not judging\nNo one no one ...\nBall you know\n\n\nThe\nDirty projectors that is a lifestyle from well lit pros beetles re mastered I'm only sleeping and it was kind of power between ... woman that's from any rubble wonder\nIf you just turn each welcoming to under current some ... wrecker willy Nelson on the way it keeps the coal in the wild Indians and right now is remember John ... [noise]\nWoman that's for the new album wonder if you're just joining us welcome to under current So Greg my record willy Nelson on the way it keeps the coal in the wild and Indians and right now is remember John ...\nSomeone from me a long time\nHe doesn't get out much about when he does\nAnd all that he thinks\nAnd I started to many room\nAll those things I started\nSome respect the man\nAll over time and be on\nThe intensity is the ...\nEverything else this job you know\nWhatever it is we created\nIn the end all that he thinks he thinks to me mhm\nIn my addiction you\nThere might be pleading for energy giant\nMaybe create is needed\nI used to think it was about knowing what I Do\nSometimes just because I Know\nWho doesn't understand\nSometimes parts of my life and\nSometimes just because I Know\nWho doesn't understand\nSometimes the My Lai\nEvery halo by overcharging\nThe imbalances I made me on to me\nEven when I don't get a ...\nAnd Mm\nWhen things start falling apart\nAnd all I can do is let us know\nI Can't have it that way\nWhen I get ...\nOnly the pieces I Need to\nSee the thing that has been tracing the pack\nAre right into a share two branches brown ... any time that it probably doesn't get out and drink but when he ...\nHe is already like me and all that he said oh\n[noise]\nYour church a K O let fate Yuma warrior radio there twenty am and border radio easy dot org you also broadcast on the Arizona community radio network at eighty nine point five FM cage easy a drink Williams Ninety playing one F. M. K. daisy press get\nNettie point seven FM cage easy cake king that in Ninety One point three FM Flagstaff\nSunny and windy today in your mind you're Seventy eight with someone gets up to thirty miles per hour mostly clear in the evening with the low around fifty nine\nThere is a twenty percent chance of showers throughout the day in Kingman today was partly sunny skies and hype sixty four partly cloudy in the evening with the lower I'm forty eight and ... get scattered showers throughout the day with mostly cloudy skies and hide your fifty partly cloudy with a lower on thirty six in the evening\nRain and snow showers throughout the day in Flagstaff it's mostly clubs you guys in the high near forty most equality in the evening with the low around thirty one degrees\n\nOriented concurrence I'm Craig McVeigh Kerry welcome news it from the cooks coming up got the latest Paul McCartney yeah from Egypt Station some my little green from their latest right now it's back a few years and about Thirteen Years in fact two bunny rates souls alike album is God was in the water\n\n\nGod all of that day [noise]\n...\nYou just station shut my little green from their latest right now let's get back a few years yeah about Thirteen Years in fact two bunny rates souls or like this is God was in the water\n[noise]\n\nGod when they are bad day [noise]\nBegin do man [noise]\nForget but over\nThe way they can\n... by the\nI think the blue normal [noise]\nWith the knowledge that\nYou know\nReal\n\nYou then I started to read [noise]\nDone at the mega\nOh\nThey're not allowed to read [noise]\nRun the mega or\n\nNa\nI'm not sure whether\nThe ground with the\nWhether they go back to the ... in it [laughter]\nHi this is Inara George and you're listening to under current\nOr a\nBall or was it not the ... the head to head no no I didn't\nMake it ... I mean they're they're calling and America and a\nFor\nWhile I was\nA girl in New York say let's take stories I complain then money then again\nCan look\n\nA\nThe\n\n\nSee\n\n\nBut rather that magazine named for\nGetting hit something young man shot without why do they need and ... and I'm going to happen I Will never change anything I don't\n\n\n\nMay\nNa\n...\nBlair all new wars\nFragile are protected ...\nSeeing your your I mean you know the larger and researchers slow\nIndian names you\nKnow was water lord\nNo doorway you talk to you know\nYour question is what do ... do\nKnowing that there's no ...\nI Wanna have just been ...\nMaybe we'll get forty years to get\nA little one or the or the go\nAnd then a a new low was water law\nIs not the way you talk to your\nYour question is what actions\nKnowing that there's ... no ...\nWe want to have just ... days alone\nMaybe we'll get forty years together\nTo go in and day or the go ...\n... you know\nWe will and fires in their lives you know\nWe'd go out on the sidewalk and snow\nKnow I wouldn't feel the need to you and\nTo run again yeah\nOur car to the man she is just to give you that every second ...\nNews ...\nKnowing that there's no need for it\nLike being on a hapless man some days although maybe we'll get forty years to get\nOne day out the gone in a blind date we'll be doing those\n\nKnowing that there's ... no ...\nLikely to want to\nJust been some days ago maybe we'll get forty years together\nAnd willing to pay out they don't\nWhat I'm saying the go\n[noise]\n[noise]\n[noise] [noise] [noise]\n\nBrother Joe Millionaire\n\nHello this is Richard storms and you're listening to on the current American music across\n\n\nHello this is Richard talks and you're listening to on the current American music with the costs\n\nCory ...\nOh that's a new one for Richard Thompson\nWell we got the whole album were picking different tracks often playing but different times just 'cause ... you know Thirteen rivers name of the album Richard Thompson with oh Cinderella was from the cooks also from the u._k. chicken bill from let's go sunshine\n... been around for a long time so the two back doing it\nAnd I'm misty ... before that were slippery people from misty are we talking trash it's undercurrents I'm Greg and if you just joined us welcome re Bonneville has anyone else will spin some of their\nFirst let's go to the list that listed country songs Johnny Cash geared to his daughter to learn is part of her country music legacy here she Israel is still doing or at least by the numbers\nA little hard to know Wendy's and\n\nThey knew he was young\nMan de\nNo\nPart do you blend you be\nShe is garbage\nNa ...\n\nParties know drinking when he\nShe is kind of business\nOnly really\nHe\nKnow God\n[laughter]\n\nWe bring the ball ball well then my yeah think well I'm I'm not out in the ground zero\nYou and me\nDown on the\nGround zero\nTwo main rather than you may\nYou\nMay get angry at\nThe Capitol and\nMe walking called\nAt eighty nine point five Aftab Jay Jay Z age ... Williams Ninety One FM kj deep deep press get Ninety point seven as than Jay Jay Z cake Keenan and Ninety One point three ... ...\nScattered showers in Prescott today mostly Claudia hind you're fifty degrees in the evening partly cloudy a lower I'm thirty six in ... when there's a twenty percent chance of showers throughout the day partly sunny skies a hype sixty four\nPartly cloudy in the evening with a lower I'm forty eight in Flagstaff rain and snow showers throughout the day mostly Claudia Hi near forty mostly clarity in the evening with Logar I'm thirty one\nSunny skies and humid today hind you're Seventy eight gets his highest thirty miles per hour throughout the day mostly clear in the evening with a lower around fifty nine degrees\nAll right it's under current in second grade we bicker while ... coming up get to ... Eric Clapton making movies and they went from candy state Keith Richards and right now\nNice along one from the new album bottle it in from Kurt why this is Ashley how courts [noise]\nWas far away\nI was on the ground\nTo look into these are\nProbably because there wasn't no\nBurning feeling in my chest to build a Bowling Alone or watch class who will listen\nUntil when will the sun's rebar\nVery deep within the psyche of life so\nOn the radio talk now with a friend of mine\nA new format because well we left relax\nWay out of mind\nI was on the radio talk now with a friend of mine\nWas a new format because well we like to lack that\nWay out of mind\nWas far away\n\n\nSo our Sheila now Bush with\nSo I was on the ground service planet earth\nYou know I hate to still see we're down\nYou know I hate to still be down\nWent bad were signing\n\n\nOwn home alone\nRead and\nOh man\nDa da da\n\nHow we talk about\n\nWhat she was doing one\nOne\nOf them and a judge a them\nUp from the\nOn\n\n... you see\nAnd we moved to the school ...\n... ... back in the shadow of\n\n... ...\nDollars you know back in the\nThe ... ... ...\nNo\nMore than [noise]\n\n\n\nI'm going to\nGo down in your home and then\nThat an\n\n\n\n\n\n\n\n\nNa\n\n\nNa\n\n\n\nThat's the one you might have heard on you know top forty radio orange juice box or something like that everything down without along instrumental in the middle of a\nCrazy here again the doors from what about fifty one years ago the monitors single version of\nLike march where you're from Boston ... down in Virginia it's a great people on that album Charlie Sexton door grandma or we sort of live just recently\nGot fantastic band for that it will be weeks on base I mean just top notch\nPlus musicians all around him and he just killed the dog scare\nFrom out of the blue ridge new album max crossed would grow and it was struck bridge wants to become an artist Bill Miller with hurricane which are undercurrents I'm great\nThe one that album Charlie Sexton during Bram ... and we saw them live just recently in ... fantastic bad for that gig it will be weeks on base I mean just top notch a plus musicians all around them and he just killed it thought Skaggs\nFrom out of the blues and new album max crossed with global lie and it was Stockbridge once he well he can artist Bill Miller with hurricane\nIt's undercurrents I'm Greg Keith Richards on the way Frank they now from his new album back in business which has chicken back to Georgia\n\n[noise]\n\nOh my gosh who\nWere not guys to call\nMe stranded the term goal when\nI'm going to turn your back your lovin'\nMan\n[noise]\nI used to be a driver [noise] take 'em to you this girl\nThere wouldn't bring me you know\nSo I don't\n\n[noise]\nStructure your city [noise]\n\n\n\nStart a new show\nI Believe on the bones staying in my mind courteous\nYou\n[noise] [noise]\nGone to John John\n\n\nNot going to go to Joe Joe\nOne stations like WD Archie and very quiet Wisconsin and key ex WTC in Odessa, Texas and this is native voice won the Native American radio network\n\nYou weren't you did to my daughter Thirteen twenty A. N. N. border radio easy dot org we also broadcasts an IRS Comey radio network in eighty nine point five FM cagey C H ... n Ninety playing one at the same cage ACP prince get\nNinety seven F. M. K. U. D. C. kicking meant in Ninety One point three ethane staff\nScattered showers in Prescott today mostly Claudia Hi and you're fifty degrees in the evening partly cloudy alone round thirty six in Kingman there's a twenty percent chance of showers throughout the day partly sunny skies a higher sixty four\nPartly cloudy in the evening with a low rent forty eight in Flagstaff rain and snow showers throughout the day mostly Claudia Hi near forty mostly clarity in the evenings to load around thirty one sunny skies and humid today hind you're Seventy eight got the highest thirty mile per hour throughout the day most of the clear in the evening with a low of around fifty nine degrees\n\nAlready just under current some great my vicar welcome kind of mixing\nGumbo of delicious music here for you this hour and we have to hang around and joins along with is good news from Last Train I'm with her we see either see I knew a master of like Led Zeppelin for let's get started with the punch brothers sisters jump [noise]\nWhen it comes on but with the phone and it's been it's been awhile since you've seen a real may ... than last in the free sure the guy to hand out the star witness grandpa money and his dad is ... that you want to do it but there is a pretty high I\nThink they'd be [noise] you know we've been [noise]\nWhoa guns don't believe they're not saying that Dan and Dan Lipinski is if I Am going to be on the lam\nOr you can see the ... like a door in the dark on I'm going to go through the early ... you get a little bit during the ... and the sound and stuff like that you know I'm\nA member\nGoing with their\nBy the um\nUm um [noise]\nWhen they um\nIt\nWas on the John [noise]\n\nOn a jumbo [noise]\n[noise]\n[noise]\n\nIt was ...\n\nWhen a jumble\nCould\n\nUp\nStand up to the little man 'cause you\nSo you were there\n\nThe dogs so we all like ...\n... ...\n... ... ...\n\n...\nUm Mm\nI mean we had\nD C span\nThe name of\n...\nWe\nTo ah to\nNa\n\nFor the love\n\n\nCheese\nHe\nYou know ... ... ... ... ... ... ... ... ...\n... you brought it down to the news and a ... ...\nTank and I don't know the bad tax day you and all that and they had\nDoing the dotted line you added didn't ask God not not only that\nThe dotted line Miami begin doing why not measuring that\nYou know I was breaking the dream\nBelieve that for my mother do\nThe all the new to me it's just not\nDone by a special night that\nA story line where\nIt's connected to your mind\n... ...\nWhat is right and I finally come all the trouble to do\nAnd all that\nGood at it as well\nSo low that in\nMiddle ... God\nLine no need to thank God\nDoing dotted line where it begins a winning by this special that\nNow does lie I think you know that's really that\nShame\nSoda and then get a gym in ... and and\nMay gain new look\nThe middle there not be able to do that\nDid their villages di\nDi\nYoga it's dead and\n[noise] did did it better than\nThe other day\n[noise] so\nJust do and they eat the\nFood is not\n[noise]\nMentioned\nAnd you know\nMentioned the game\nFor me the new book is really the\nLead\nLead them to be\n[laughter]\n\n\nAh the\nAh\nBall really\nShow me\nA\nAh\nAh see\nA good dog\nIt does go to the dog\n\nA\nA\nA\nWell\n[noise]\n[laughter]\nWell the the ... the distraction and the the the ... to ... reaction do you know we\nAll know the way to live the movie young brains if you've been ... with the\nGoal\nWe're too too\nFood production\n... no\nNo\nWho directs\nWindow down\n... miles of lay\n\n\n\n\nChapter sure in in\n\n\nOut of the bay area this low some sort of laser the American river that Iran or the curtains remembering the grade\n[noise]\n\n\n\n\n[noise]\n\nPotentially some Arizona\nWestern college has its border radio Thirteen twenty am Kayla the you might and border radio easy dot org\nWe also broadcasts an Arizona community radio network at eighty nine point five FM cagey the age ... Williams Ninety One F. M. K. J. C. P. press get Ninety point seven F. M. K. J. C. K. Kingman in Ninety One point three ...\nIn Yuma sunny hides near Seventy eight north northeast when ten to Fifteen miles per hour today\nMostly clear tonight lows around fifty nine England had the chance of showers and sixty five today partly cloudy tonight lows around forty six for us to get a chance of showers near forty seven\nAnd tonight the chance of showers and a low around thirty seven in Flagstaff there is a winter weather advisory in till noon today snow showers likely at a high up thirty seven degree\n\nAlright it's on the currents I'm Greg my quicker welcome I'm doing good oh yeah we're doing will create music coming away from dirty projectors ... dino ... balls and this is from Fox\n\n\n\n\n[noise] Mm [noise]\nMhm you\n\n[noise]\n[noise]\n\nYou draw\n[noise]\nDuring the\n\n\nI can make your then somebody else's God as\nWe all get securing at the same but [noise]\nI don't know about what she did not want a screen to chew\nShe thinks you love the beach the damn\n... [noise]\nThose great why they have the the\nBuy shoes that you did you leave the area\nNo boy that if I knew I Would just let me get a like a little\nI'm In my\nSome times do we do that in the butt to\nI was just like just dating back to you\n\nTired I\n\n\n\nSchool just dig more [noise]\nGroup in the school as you do [noise]\nGlued to the ...\nI Love Georgia being green ...\nSee beyond [noise] to me [noise]\nThat they come to [noise]\n\n[noise]\n[noise]\n[noise]\n\n\nNah nah\nNah nah\n[noise]\n[noise]\n\n\n\n\nShe\n...\nShe knew she\nDo you\n[laughter] [noise] [noise] [noise] [noise] [noise] [noise] Mm Mm\nWho was thought boy is to ... to\nNo no but when\n... let's see\nYou know and then we\nIs for the New Britain\nDidn't buy\nNew\nWhen the President George ...\nWhen no one most changes in the ...\nYou\nEverything else just jumping you know\nTo whatever it is we free\nAnd and all that he thinks he thinks to me mhm\nIn my addiction\nMIT pleading or enter Johnny\nMay be crazy is needed\nThan they thought I was someone else and\nAre used to think it was about knowing what I'm doing ...\nSometimes just because I Know\nWhen does it need to understand\nSometimes parts of my life and\nEvery halo I ever touching\nThe imbalances I may be wrong to me\nWhen things start falling apart\nAnd all I can do is let us know\nWhen I get the ...\nThe pieces I Need to\nSee the thing that I think there have been tracing the path\nRight into a champagne to branch is brown ... all the time that it doesn't get out but when he ...\n[noise]\nThanks listening to us the human and Thirteen twenty am I'm bored or radio ... daughter or your service of Arizona western college\nWe also broadcast on the other is on a community radio network that eighty nine point five FM cage Jay Z a drink Williams Ninety One one that same cage AGP Prescott Ninety point seven there than Kay Jay Z take Kingman and Ninety One point three FM blacks\nPrescott a chance of showers in a high a forty seven today each northeast when nine eleven miles per hour tomorrow chance of showers in a high a fifty eight Flagstaff winter weather advisory until noon today no showers likely ... near thirty seven tomorrow the chance of showers in Ohio\nWe're at eighty nine point five as than Kay Jay Z a drink Williams Ninety One that same cage AGP Prescott Ninety point several ... K. J. D. J. Kingman in Ninety One point three FM blacks\nIn Prescott the chance of showers in a high a forty seven today each northeast when nine eleven miles per hour\nTomorrow chance of showers in a high a fifty eight Flagstaff winter weather advisory until noon today no showers likely ... near thirty seven to borrow a chance of showers in Ohio forty six\nIn ... chance of showers in the highest sixty five today tomorrow mostly sunny icy or sixty eight Yuma sunny I near Seventy eight today tomorrow I near eighty one\n\nOriented concurrence I'm Greg with Richard welcome music from the cooks coming up get the latest Paul McCartney yeah from Egypt Station ... my little green tomato latest right now it's back a few years yeah about Thirteen Years in fact two bunny rates souls or like Allen this is God was in the water\n[noise]\n\n\nGod over the line that day [noise]\nThey didn't do man\n[noise]\nJay Leno because\n... know that day [noise]\nBut when it in the capital\nBy the [noise]\nYeah\nSo na na na\nNa na na na\n\n\n\nDa da na ...\nRun the mega\nWere married\nNa na\nRather than\nGround with the ... the ...\nWhether they ... they have been\nThis is Inara George and you're listening to under current\nWell ... ... ... ... ...\nNo no not the ... the head with no no I didn't make it ... I mean there is a\nIn America and uh\nHi this is Inara George and you're listening to under current\n\nOr was it not fly so was it ... no no I didn't know\nMan making America that night there is a calling and good and a\nWho\nWas\nThe girl in New York say let things stories I company then money then hang in\nIn the\n\n\nThink\n\n\n\nRather that magazine may feel like getting\nHit with something young man shot though why did they gain and Jim dirty habit I really never changes I think there's\n\n\n\nMet a\n\nNo long flowing dress she ...\nBall mirrors yeah\nThe fragile are protected first so you know being\nThe mercy in New York Times where I Know not your hand surgeon slow you know\nAnd then a a new low was water law\nIs not the way you talk to your\nYour question is what direction is nearly\nKnowing that there's ... no ...\nWe wanna have just been so they don't know\nMaybe we'll get forty years together\nAnd have it on your way or the go\n... you know\nWe will and fires in their lives you know\nWe'd go out on the sidewalk and snow\nKnow I wouldn't feel the need to you and\nRunning yeah\nOur car\nTo the end she is give you the second you know\nMe a\nKnowing that there's no drug is\nLike being on a hapless man some days although maybe we'll get forty years you\nKnow one day I'll be gone in one day all the no no\n\nNew knowing that there's no ...\nLikely to want to\nJust been some of the day is a long time and maybe we'll get forty years together\nAnd willing to pay out they don't\nWhat they did they go\n[noise]\nNo he\nIs likely you want to\nJust been some days ago maybe we'll get forty years to get\nThe money may yeah they do\nThey do the do ...\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n\nBrother Joe Millionaire\n\nHello this is Richard ... and you're listening to under current American music as possible\n\nThe re\nOh that's a new one for Richard Thompson\nWell we have the whole album were picking different tracks often playing with different times just 'cause ... you know Thirteen rivers name of the album Richard Thompson with oh Cinderella\nWas from the cooks also from the u._k. chicken bones from let's go sunshine they've been around for a long time so it just seemed to back doing it\nAnd I'm Mr go before that were slippery people ... are we talking trash it's undercurrents I'm Greg and if you just joined just welcome re Bonneville has anyone else who's been some of their\nFirst let's go to the list that listen country songs Johnny Cash geared to his daughter to learn as part of her country music legacy here she Israel is still doing her to expand the number and\nLindy in\n\nThey knew he\nMan the\nNo\nTo know do you think he's being\nShe is a business but\nOnly really ill\nHe\nKnow gone\n[laughter]\n\nWe bring the ball well then my\nBig well I'm ... how old is he was ground zero\nYou may\nCome down on the\nGround zero\nTwo main rather than you may\nYou\nGet a real\nCat toys\nReview me fairly on your car\nScary\nTime\nFor public broadcasting the fringe of under current and from envy one stations like ... New Mexico in ... easy see in Dixon Oklahoma and this is native voice why the need of a\nBusiness border radio at work ... LSAT Yuma searching twenty am and where do we do is eat that Oregon a service of Arizona was in college you also broadcast on the Arizona community radio network at Eighteen ... K daisy a drink Williams Ninety plan one FM ...\nNinety point seven F. M. K. C. C. K. king then in Ninety One point three FM Flagstaff\nAnd you must sunny eyes near Seventy eight north northeast when ten to Fifteen miles per hour today\nMostly clear tonight lows around fifty nine England had the chance of showers and the highest sixty five today partly cloudy tonight lows around forty six press get a chance of showers I near forty seven\nAnd tonight the chance of showers and a low around thirty seven in Flagstaff there is a winter weather advisory in till noon today snow showers likely in a high of thirty seven degrees\n\nAll right it's under current in second grade McVeigh care welcome coming up get some ... Eric Clapton making movies and they went from candy Steve Keith Richards and right now [noise]\nNice along one from the new album bottle it in from Kurt Vonnegut uses past the high court's\nFar away\nLooking into the sun\nBro because it wasn't no\nThe people of all of a long night on ...\nTo when will this sounds we bomb or\nVery deep within the psyche of last oh oh\nBuried deep within the ... so\nI was on the radio talk to you know with the friend of mine [noise]\nNo format because well we like to laugh\nWay out of mind\nWas far away\nIn\nOr\nAnd\nHours on the moon\nSo our Sheila now Bush with\nSo I was on the ground so good planet earth but out here so the\nThe ... I mean\nWent bad was sounding\nOn\n\n\nThe way the world's\nRead\nDay\nOh in may\nNumber on our\nNumber\n\nDo we know\nShe was doing\n... no no no no\n... just ...\nUp to them\nOn\n\n\nSaid ... you see\nThe ... ... ...\n... back in\nThe ... ... ... ...\n...\n\n\n\nDa da da da da da da\nDa da da\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nNa\nAnd [noise]\n\n\n\nAnd [noise]\n\n\nThat's when you might've heard on you know top forty radio orange juice box or something like that as it down without a long instrumental in the middle are so great to hear again the doors from what about the people ... years ago the Manu single version of\nLike my father knew from Bob Skaggs down in Virginia it's a great people on that album Charlie Sexton huh\nThat's the one you might have heard on you know top forty radio or ... box or something like that edited down without along instrumental is in the middle part time\nCould you hear again the doors from what about fifty one years ago the minute single version of\nLight my fire knew from buck Skaggs down in Virginia it's a great people on that album Charlie Sexton a joy Bram ... and we saw him live just recently and\nKept fantastic bad for that gig it will be weeks on base I mean just top notch\nA plus musicians all around him and he just killed by Skaggs\nFrom out of the blues the new album max frost with global law and it was struck bridge wants the money can artist Bill Miller with hurricane\nIt's undercurrents I'm Greg Keith Richards on the way Frank they now from his new album back in business this is chicken back to Georgia\n[noise]\n\n\n[noise]\nSo I'm a guy who\nNot guys to call\nMe stranded in the cargo hold\nBack to John John\n[noise]\n\nAre you a student driver bigger than those girls\nThey wouldn't even bring me you know\nSo I don't\n\n[noise]\nIn the [noise]\n[noise]\n\n\nWhere else started a new show\nOctober ... bones thing in my mind is\nI Will be staying in but he was\nIran\n\nWD Archie in ... Wisconsin and key ex WTC in Odessa, Texas\nAnd this is native voice won the Native American radio network\nYou are to chew K O F a humor border radio Thirteen twenty am and order radio ...\nWe also broadcast on the Arizona community radio network at eighty nine point five FM cage Jay Z a drink while in Ninety point one FM cage ACP Prescott Ninety point seven FM kj the cake Kingman and Ninety One point three FM Flagstaff\nIn Prescott the chance of showers in a high a forty seven today east north east when nine eleven miles per hour tomorrow chance of showers in a high a fifty eight Flagstaff all winter weather advisory until noon today no showers likely highs and you're thirty seven tomorrow chance of showers in a high of forty six\nIn Kingman a chance of showers and the highest sixty five today tomorrow mostly sunny eyes near sixty eight Yuma sunny I near Seventy eight today tomorrow I near eighty one\n\nAll right just under current some Greg my vicar welcome to mix up a\nGumbo of delicious music here for you this hour and we have to hang around the joy along with us get news from Last Train I'm with her but it's either see a new re master of live Led Zeppelin first get started with the punch brothers ... jumbo [noise]\nWhen it comes on the phone in Danville has been allowed to reveal may bones strong on the fan of Latin does he feel sure the guy to ahead of time with his grandpa money in a daddy taught that you are the new ... ha\nThing to be you know in the new\nWorld guns don't believe the not in tune in and out of the day of boys ban Roman bay on the lam\n[noise] to the dilemma that lack of Georgia and the dog ... through the city blog than the man he was doing the bomb zone in on the line they never\nAgain a lot of going with their\nWhoa you got a job with the ... to do is just going to be on the bad at the lamb\nOr you can see the ... like a Georgia in the dark on a board of skills part is the mayor you know in a bar zone or something\nLike that you know but you\nScam going liquor\nCapitol police chased by a young thing to\n\nWinning\nBig good on June who\nWas overjoyed to\nTry\nAnd jump on\n\nPhone from\nThe book\nWhy spend the rest of the matter is saying that you\nSo they do with\nBomb was\nThe dog comes so we all like to\nDo with coral job to\nDo with the ... the ... ...\nYou know me as a\nKnow ...\nUm\nHe saying we had\nD C span\nThe lane\n\nUm Mm\nThe thing we have\nD C stay\nAway from the mainland\n\nE.\nSaw a\nFor the love\nI'm\nAt the\nBig you\n\n... ... ... ... ... ... ... ... ... ... ...\n... you know the name of your\nMan ... ... ...\nI don't quite know what that tax day you know all that and they had\nDotted line you added a God not not\nThe dotted line Miami begin doing and why not really that\nYou and I was thinking that dream\nBelieve that for my mother\nThe I'm about to be it's like not\nDone by a special that\nA story that night where\nConnect\nNa na ... ... ... ...\nWhat is right and I finally come all the trouble to do\nAll that\nName my\n[noise] ... ... ...\nWhat is bad enough to go do the job lose it you know they probably ... ... ... ...\nWell that would be\nLittle we\nNo neither God\nGot joy dotted line begins a window right now especially that\nShame\nSee though now and then get a gym in ... and and no\nDo and banks he knew he was\nDid last\nThen maybe\nDi di di di\nDi do we know it\nMay be the bad news about the other day and [noise] so\nThese big ...\nYeah they do ... dead then\nGain it back so stay with it and not be so\nSo big ... and the\nSchool is not equal\nAnd you know\nThen in the game\nBelieve me when they did that you really need to be\nWill be\nWill be the\n[laughter]\n\nAh the\nAh they\nRow\nAh for\nAh the\nA really been\nOne show me\nAh they\nAh the\nHas a has a dog\nThe dog the dog\nUh\nUh\nUh\nUh\nNo well well\n\n\nWell the the ... be distraction and the the the ... to ... to\nDo and you know could you know the way ... grams ... moved below ... who you can use a ... with the goal\n\nThere's nothing but the distraction and the thing that\nI Do see more on a ... reaction do you know the same you know when a man who beyond the brain if you listen to you can do you have with ...\nCol\nWe're trying to\nTo the ...\nA lot of lay\nDa da\nDa da da da da da da da da da da da\nYeah no no no no but I Would get a new a\n\nNah\nNah [noise]\n\n\n\n\nOut of the bay area this low some sort of laser the American rules that Iran under current\nRemembering the green lawyer instrument lost and songwriter Holly Tucker to re\nCanoe not from the river and we heard from Joanne Shannon dougher joined by Lawrence laughing here down from the soundtrack for some ... was trying to say that if you don't ... ... ...\nOr moving on we've got Tracy we know so now from the oil band swing you Indians who should leave our people ... and\nNa\n\nAnd when\nWere\nNa\nCheers\nOwn their own\nThree\n\nUm [noise]\nA brand but on\nOn\n\nA\n... green\n... during\n...\n\n\n\n\n\n[noise]", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "16"}