{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the Arizona community radio network eighty nine point five as than kj easy a drink Williams Ninety ... than Jay Jay Z peep press get Ninety point seven Afghan Jay Jay Z cake Kingman in Ninety One point three FM ...\nMostly sunny in humans this Sunday Morning highs reaching up to Ninety five degrees today partly cloudy in the evening with the low around sixty eight\nIn Kingman sunny skies today highest reaching up to eighty three some calm southeast when throughout the day was partly cloudy skies and a local around fifty eight in the evening in Prescott mostly sunny today high switching up to Seventy five\nPartly cloudy in the evening love about forty eight in Flagstaff sunny skies highest near sixty nine some common southwest breezes partly cloudy and the evening all over around forty\n\n... like after nine here with you we can quite tens coming up we'll hear from Jason is about the suitcase jak get the big takeover and just you know the start out with Charlie muscle light [noise]\n\n[noise] [noise]\n\nMoved to [noise] play and then\nWe got good blues than that [noise]\nUm I don't know this\nDo you know don't do something [noise]\nI Know John too so [noise] [noise] well I don't play\nUntil you know [noise]\nWay to\n\n[noise]\n\nTo me just all the all new\nTo me you know the\nWorld would be good to\nRead all the way he does run in the\nBook to be\nSame day in day to day they have\nTo be in the evening di di di di di di di di di di di\n\nDing ding ding being in a in a mate and me being the only way\nTo do on your knees you'll have\nDone\nAgain the\nGame and you know Lynn knew I was raised in a\nThe good news and then\nAnd may be\nLead your blonde da da da da da\nDa\nDa da\nDa da\n\n\nDa da da\nDa da da da\nDa da\nDa da da\nDa\nThat they use to an end\n... ... ... ... there's no no no no I Need to go\nWith the ... they say you live\n...\n... ...\nAnd\nAnd get to the gas\nSisters and\nGiven the may ...\nTo\nTime is now than\nBrothers and sisters\nI\nAround the man\nCan Suzanne who don't have to stand in line roads\nSome rich mining\nThe banks do where you can do the sisters in\nRoom\n\nOh right this is the suitcase junk and you're listening to undercurrent Mm\nIn the\nRight to not be\nThe\nWhen I'm done with now\n\nMe by [noise]\nSo it\nSay\nDi\nBe um\nUp to the\nRight thing to say\nThe strong\nMan drove through the\nAt all the\nWay we me\n\nBoth on both my\nOr is it a aren't\nReal ...\nYou know the you know\nWe know we don't we know\nMy mom goes mostly men don't\nAll about ... million\nGod [noise]\nKnow [noise]\n\nThen a\nI\nCan't wait to hear the rest of that album that's a new one from ... the fear\nIn front of that Bob I can ... and the Nigerian brother it's give us a call ... ... and the big takeover brought us Kelly girl it's under current thank God for the ... and if you're just joining us welcome\nIt's next musician is from the San Francisco bay area here's Mickey bloom and the grand Blair's\n\nNo we're the dead man\nAnd they are the nasty\nDown playing do you mean by well jets man a man\nOne of the big\n\nBeen\nOur didn't know how\n\n\nThe time\nShe Chinatown\nThat to\n\n[noise]\n[noise]\n\n\n\nI'm\nAnd\nAll of ... where the K ... bad day by day I've learned they begin happy\nDog my number one K. and appreciating the happy to\nMany police seven F. M. K. J. C. K. Kingman and then you one point three of them Flagstaff\nMostly sunny in humans this Sunday Morning highs reaching up to Ninety five degrees today partly cloudy in the evening with the local around sixty eight\nIn Kingman sunny skies today highest reaching up to eighty three some columns southeast when throughout the day was partly cloudy skies and a low around fifty eight in the evening in Prescott mostly sunny today highs reaching up to Seventy five\nPartly cloudy in the evening all over around forty eight in Flagstaff sunny skies highs near sixty nine some common southwest breezes partly cloudy in the evening all over around forty\n\nIt's ... like I said I'm here with you with some great music coming up we'll hear from cat now and Taj Mahal some milk carton kids candy Staten and not go and medicine for the people that speaking with a tune by Rodney crowd that he wrote in two thousand five [noise]\nBrain from Nate in\n\n[noise]\n\n... ... ... ...\n... ... ... ...\nIt's the ... the man\nWhat Google wrong\nThey don't believe me\n...\nThey tried to tell you the\nWhen they dried it they they you\nKnow I don't belong in\nNot if you can hear me the phone\nHour being home\n...\nGood good ...\n\nIn\nAnd you better moving moving around\nOn ... and ... and out of a\nThey have a A R planning\nRead the bill money\nYou may you may hear this day\nAnd then I'll go down there\n\n\n\nReversing the\nOr a man and a\nBe the next thing you needed to\nBlaming\n... you need to be\nMayor she\nYour dreams are watching their\nLook me in the dark\nSide of\nReligion or their\nVoice in the world\nNow where\nBuy me a\nWash away or throw\nA\nWere saying to me I saw\nHow counsel know came\nTo do is when Trump to allow me\nTo just be on your always waiting patiently\nI have seen them all\nI see them all\nName pay\nMayor she\nBrings a fortune ...\nLook deep and he's well\nHe's trying to\nBad because they\nLaw may\nLive by the monkey\n[noise]\nMoney won't you please take another so\nHow do you watch the bingo\nIf mental shape than\nRattles demand ...\nHoney please give us any\nMammal would you take take another two miles and then you go to the\nTrouble comes everyone will be a ...\nI Believe very your mom is ... you know no\nNever to choose the\nDon't you know that I Do like all the others do what you never will be running on Johnny ... do\nYou want your show\nJust to watch the multi\nUrging takes all the other and bank got only do you\nWon't you please let us just to go\n[noise]\n\n[noise]\nHow do you want to listen to not watch please\nBe strong and you may not see any and then it's not so long to\nWoman job hunting for me is shaking her son you know but you know no matter what you don't you know know that I\nUsed to ... go together so what did you ever win the money well but he believes ... there are these new hunting show I Need the help that honey to anyone jak honey please tell that money so\n...\nDo they may do\nNow ... memory rivers\nAnd then they ...\n\n...\n...\n\nShe's ...\nMe and I ...\nOr ... or cherry off ... off by ...\n... ... ... ... well ... ... ... ... ... ... ... ... ... ... ... ... [noise]\n... ...\n\n\n\nThat was not go and medicine for the people find his Ho Chi two thousand sixteen release he says the songs on this record were written between his age of Eighteen and Twenty one and they're all about coming of age the song we heard what the wolves have returned\nIn front of that ... dentist and give us here's looking at you and it with candy Staten with what's so funny about peace love and understanding\nIt's undercurrents I'm ... if you're just joining us welcome\nFrom Albuquerque Australia here sisters Vicki thorn and Donna Simpson this is the weights on under current [noise]\nDays ago ugly into this were\n... to try and help\nMe\nUnderstand the really been one\nI was being bloody that year\nAnd it didn't bother coal roadside and\nWhen a strange ... ... on my way\nTo go now to like\nHours ...\nLove is for the call [noise]\nEvery body massages in some\nGame but if you ain't got to\nVisit one\nMade is\nWanted everybody trying\nNot something you just hold on\nYou know we give\nThat they\n\n\n[noise]\n\n[noise]\n... ... [noise]\n[noise] [noise] ...\nNot something you just fall into a situation that you jobs and language\nNow that's not the you just call it the choices that you got ... thank you can legislate it may be related to own a love causes love too late to\nBody else is the greatest love that good ab ...\nWe also broadcast in Arizona community radio network at eighty nine point five FM cagey C H ... Williams Ninety One F. M. K. J. C. P. press get Ninety point seven F. M. K. J. C. K. king meant in Ninety One point three offense like staff\nYour weather forecast for Kingman the Sunday Morning sunny skies expected today was highest reaching up to eighty three some calm southeast wins partly cloudy in the evening with the local around fifty eight in Prescott mostly sunny high switching up to Seventy five partly cloudy in the evening Loeb around forty eight\nIn Flagstaff sunny highs reaching up to sixty nine to ... southwest breeze\nPartly cloudy in the evening with all up around forty\nAnd you mostly sunny today has reached Ninety five partly cloudy in the evening a low around sixty eight\nPartly cloudy in the evening what all up around forty in your most mostly sunny today has reached Ninety five hardly caught in the evening hello around sixty eight\n\nIt's ... it's got to be like after nine here with you well here's some great music I picked out this next hour including Lucy is loud birds streets Anthony David and father John misty and to get us going he's a great ... John\n[noise]\n[noise]\n[noise]\n[noise] and then after\nIt's bad\nIn leaving the house\nThey can speak to me and to me or for that you know things in your carry on\n\nIn the\n... name is Matt\nWe're having now\nI\nThink the candy and um\n\n[noise]\n[noise] [noise]\n[noise] [noise] do you\nRetirement age now I'm\nKidding [noise]\nAnd now it's been\nJust yeah so\nThe the yeah\nIt can be you know\nLet's leave it in ... um [noise]\n\n... cookie a role for cookie\nShould not forget the semi cook it's my um\nShow not broken the them a cook and smile\nMy radical go a little while\nOut and do for the young\nLeader on talking all day [noise]\nWhen you stand before that they know\nThen ... grow and then\nKnow about that or long\nAnd where do we chose not to say whether\nI knew what to do the right\nMy new hobby\nDo these long grid\nJust want to be peace in the middle east\n[laughter]\nI'm Talking about\nYou\nGet to the money\nOne not too much\nAnd what not to look\nI'm looking\nAt\nThat many at all\nThe the the time not long\n\nTalk to you know the answer off the\nAlong\n\nHang on buddy Miller and I'm Jim Lauderdale and you're listening to undercurrents American music with a passport\nAnd games you ride\nAll out allows the job of love and nice and\nReally be\n... to\n... [noise] Mm\nMr Right name brand in Miami this week with\nGet the like the way the middle there is no ... no man don't let\nWith that Muller while the ... ... ...\nKnow those kids\nOut the\n... ...\n... ...\n\n... will do no matter what\nWhat was your new business in the suburbs that'd be ...\n... ...\nTo ...\n\nUnder current\n\nUnder current ha\n\n\nHow 'bout that went for a little New Orleans style prince CJ near and the red hot Louisiana band that was bad luck\nGabriel yeah cool gave us ... father John Missy brought a date night and it was Anthony David with a lovely day it's undercurrents I'm ... if you're just joining us welcome here reference fecal featuring Luther and Cody Dickinson\nOh whoa whoa whoa whoa whoa\n\nSo much although they're\nOh\nLa da dum\nLike\nWe need a man\nIn life the\n\n\nMy brain oh my\nAnd\nWe need a man you\nWell\n...\n\nDa\nDa da da\n\nDa\n\nAlso broadcast on the Arizona community radio network at eighty nine point five FM kj the age ... Williams\nNinety point one FM Jay Jay Z be Prescott Ninety point seven FM kj decay Kingman in Ninety One point three a famine Flagstaff\nYour weather forecast for keeping them in the Sunday Morning sunny skies expected today was highest reaching up to eighty three some column southeast wins partly cloudy in the evening with the local around fifty eight and ... get mostly sunny highest reaching up to Seventy five\nPartly cloudy in the evening low around forty eight in Flagstaff sunny hides reaching up to sixty nine to ... south west breeze partly cloudy in the evening with all up around forty and you must mostly sunny today has reached Ninety five partly cloudy in the evening a low around sixty eight\n\nIt's ... like I said I'm here with you will have some great music coming up in just a moment we'll hear from Peter ... and John Clara no by punch brothers John Lee hooker junior let's start out with something familiar hears Coldplay [noise]\nYours\n... dead you have a man or woman or\nA single mom\nYeah you\n\n\nThe number\nYeah you know then in non\nRight there you know in the three yeah you\nThough there\nDo you know when a dumb or\n\nHey we're shovels and wrote and you're listening on the current\nLeave the when the guy\nNa they never\nA really bad or do win win but through the history and you know\nAnd your knees and but you know and it's ...\nShe made a ... but I may never Dan Rather they began\nYou know the the\nI mean ... ...\nNo one can\n\nMy non\n\nShen dream\nTo do I'm Alive\n\nNo I Want to know\nThe the\nNo I'm just I'm\n[noise] he ...\n\nFor a\nLong way you can take\nOver the\nPhone call\n\nAll\nThe time and\nTime again over the line with him on this one guy was the only way more than some of them are ...\n... ... ... ... ... ... ... ...\n\n\nFrom a from\nA\nFrom a phone\nCall from what you said\nIn the second one was about\n\n... ... ... ...\n... ... ... where\nI got\n... feet won't be season is Jeanette\n... ... ... ... known as fast as I can\nGo read them ways to me you know ... ... ... ... ...\nDo ...\n... ...\n... ... ...\n...\n... well not born in the no fly zone mine and I get angry\nAnd come back from the shadows brand new friends when I got many in la di\n...\n... ... ...\nIf you ... go run the risk ... they've got in ... the man\nKnows go were made ...\nThey get ...\nWell then the ... the no fly zone by and\nI get a new angry I go back Ron ...\nNa brand new neurons well I've got many ... oh\n\nNo no no no they go a\n\n\nDoesn't he have a warm boy that's Marty Stewart and his fabulous you ... with old Mexico they left slack and Abigail Washburn gave us what you're going to do and it with ... with the jumbo with Clara no thought at the top of that sat and electric\nIt's undercurrents I'm ... if you're just joining us welcome here John Lee hooker junior\n\nI see a lot of faith in him but I\nDon't know it's true it's grown ... number\n\nOne\n\nJoy is I\nAlways wanted to be just like Bonnie and Clyde\nMan I'm all about how\nDid you try to make sure you\n\nBack\nOn the um\n\n\n\n\n\n\n[noise]\n\nOh\n\n\nGod oh lord I\nBring truck back a little known about too\nMuch about that\nThan I Am glad you're\n\nAnd\n\nEverything got it from a\nAre happy Mother's Day and\nI don't use their pants down\nThem but they're not backed down\nAnd pass a\nHe's\nInto\n\nSaying\nEighty nine point five FM McKay Jay Z a Drake Williams Ninety One F. M. K. J. C. P. Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three of them Flagstaff\nSunny skies expected it in the forecast for Partridge today highs reaching up to Ninety four was partly cloudy skies in the evening and loads up around sixty five in human mostly sunny today highs reaching up to Ninety five was partly cloudy skies in the evening and a low up around sixty eight degrees expected\nThanks for listening\nIt's undercurrents you like a salon here with us in great tens coming up we'll hear from Jason is bell the suitcase jacket the big takeover and noble is the start out with Charlie muscle light [noise]\n\n[noise] [noise]\n\nAnd then\nWe got to lose the\nHere I don't know\nDon't you know don't do is um [noise]\nI ain't no dog boost [noise] well we don't mean\nTo you know\nThe big three\nYou know to be\n\n[noise]\n\n\nTo the region or the wrong thing\nTo me you\nKnow nobody would be good to be you know the way he wanted to\nDay to day even though they may they may\nBe in the deep end di di di di di di di di di di di\n\nDi di di di di di di di ... in a in a band indeed and the only way\nTo do on your knees you\nKnow Don\nDo\nThey need to be you know when I was a\nOf the good news and\nTo be\nLead your well I don't do\n\n\n\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise] ... ...\n...\n... ... ...\n...\nThat they use to an end\n\n...\n... ... there's no\nNo no I Need to go\nWith the ... they they are ... ...\n...\n... ...\nBeing hit man\nI understand from\nCan't get to the gas\nChambers sisters\nThey\nDrew\nTime is now and\nWe lowered\nBrothers and sisters I\nThan there\nCan sit down and you don't have to stand in a world\nWe're really mine in the event of a thing where you can\nThe sisters and\nLittle ...\n\nOh right this is the suitcase junk and you're listening to under current Mm\nIn the\nEarly ... the leg\nWhen Tom but John man now [noise]\n[noise]\nI mean by\nSo it\nSay\nPressed shirts that as a\nBe ...\nBut up until\nThe strong\nMan to the\nSaid oh\nWay we me\n\n... minute\nIs\n...\nThe\nPenal you know we don't we don't\nAbout my mom goes mostly men don't\nAll they do not let me know alone\nGod [noise]\nKnow [noise]\n\nNah I'm\n\nCan't wait to hear the rest of that album that's a new one from ... the fear\nIn front of that Bob I can open Qunu and the Nigerian brothers give us a call ... ... and the big takeover brought a silly girl it's under current time ... and if you're just joining us welcome\nIt's next musician is from the San Francisco bay area here's Mickey bloom and the grand Blair's Mm\n\nNo\nWe're the dead man yeah\nAnd they are the nasty down playing [noise] do you mean by well just man oh man named the big\nThe uh\nYeah well my main concern was the big\n\nAlarm didn't know how\n\n\nThe time\nBeing Chinatown\nNa\nNa\nDa tank you know\n\n[noise]\n\n\n\nThe\n... ... ... ...\n\nBottom where the da da da da da da and day by day I've learned they begin caffeine\nBlah blah blah blah okay did and appreciate it but that may be unhappy\nWere you also broadcast on the other was on a community radio network at eighty nine point five FM Jay Jay Z age ... Williams Ninety point one asked them cage Jay Z peep press get Ninety point seven FM Jay Jay Z gate Kingman and then you one point three FM facts that\nIt's mostly sunny in humid today highs reaching up to Ninety five degrees partly cloudy skies in the evening with Lowes expected up around sixty eight degrees in Parker's sunny skies in the forecast for today highs reaching up to Ninety four partly cloudy skies expected in the evening with loads up around sixty five degrees thanks for listening\n[laughter]\nIt's ... like I said I'm here with you with some great music coming up we'll hear from cat no and Taj Mahal some milk carton kids candy Staten and not go and medicine for the people that speaking with a tune by Rodney crowd that he wrote in two thousand five [noise]\n...\n\nGirl [noise]\n[noise]\n\nIt the ... the\n... goo goo wrong\nThey do believe me I\nDid it a win\nIt they try to do you\nWhen Dr ... they they you know I don't belong in\nNot if you can hear me the phone\nOur be how\n...\n... ... ... ...\nDo\nYou\nHome of\n... and you better mood ...\nOn November ... and out of and\nThey got five ... planning\nBig deal for money\nYou make a New Year's day\nAnd then I'll find out that\n\nThey can\nOr am lamb\nBeing mean and then you needed to\nBlaming\nYou need new\nJail me or see\nYour dreams of origin there\nAnd look the in the dark\nSide of\nAnd they\nBuy me a\nWash away or trouble\nA\nAre saying to me you saw\nHow count so no I came\nTo do is let ... be\nI Would just be on your on the\nPatiently\nI seen them all\nThey pay\nMayor she\nDreams of fortune ...\nLook deep in these well\nHe's trying to\nListen and\nThat because they\nBy may\nThe body monkey\n[noise]\nAnd he won't you please take another show\nPretty much being ...\nYou should get a mental shape do\n... do\nNot he won't you honey please do you have a young\nMom once you take\nTake another chance to let me know\nTrouble comes everyone will be a teacher\nI'm a woman should probably very you'll probably lose what you do know\nThat you\nDon't you know that I used to like all the other though what you never know where do you want your money ... money to do [noise]\nYou want your show\nJust to watch the multi\nUrge you take a libertarian backyard only do we\nWon't you please let us just to go\n[noise]\n\nMoney will listen to some money won't you please\nBe strong and you may not see any man or not so long\nRunning on the job honeybees shakers honey on but you don't know what you don't you know know that a\nHuge huge gray and I go together you know when you win the money well Joe's honey please don't there are these new honey will show honeymoon they looked at how many do you want you honey please do their honey to\n...\nJust ...\nKnow they may do\nNow ... memory ...\nAnd then they ... their retarded\n...\nAnd\n\nShe's going to ...\nTo me and I ...\nOr ... ...\n... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... well [noise] [noise]\n\n\nThat was not go and medicine for the people from his Ho Chi two thousand sixteen release he says the songs on this record were written between his age of Eighteen and Twenty one and they're all about coming of age the song we heard was the wolves have returned\nIn front of that ... dentist and give us here's looking at you and it with candy Staten with what's so funny about peace love and understanding\nIt's ended currents I'm ... if you're just joining us welcome\nFrom Albuquerque Australia here sisters Vicki thorn and Don assistance and this is the weights on undercurrents [noise]\n[noise]\n... days ago observing into this world\nWhole body is to try and help\nUnderstand the ... been one\nPowers mean\nAnd it did bother toll roads and\nA strange in K ... on my way\nTo go now to like\nHour belong to\nLove is for the call [noise] every body massages in them\nYou can gain the whole world but if you ain't got all\nMain one but\nMade is everybody\nWanting everybody trying\nLove not something you just hold on and\nYou will be given the way\nThat yeah it is a big\nMm\n\n[noise]\n\n[noise]\nMm [noise]\n... ... ... ...\n[noise] [noise]\nIt's not something you just call it the choice that you got ... thank you can legislate it may be related only love causes love too late\nBody else is great and love that could have the\nThe dot org we also broadcasts an Arizona community radio network at eighty nine point five FM K Jay Z a drink Williams Ninety point one F. M. K. J. C. P. Prescott navy point seven FM cages the cake Kingman and Ninety One point three of them in Flagstaff\nSunny skies expected it in the forecast for Parker today has which no two Ninety four was partly cloudy skies in the evening in low it's up around sixty five in Yemen mostly sunny today high is reaching up to Ninety five was partly cloudy skies in the evening and blow up around sixty degrees expected\nThanks for listening\n[noise]\n\n\nIt's ... it's got to be like I said I'm here with you well he had some great music I picked out this next hour including Lucy is loud birds street Anthony David and father John misty and to get us going ... great ... John\n[noise]\n[noise]\n[noise]\n[noise] and then after\nIt's bad\nWhen you when\nThey can't smoke in like leaving the [noise] carrying around\nAnd to me personally to me and to me or for that I don't think you're Jeremy Alan\n\n\n... is that\nWe're just now\nI was saying\nYeah I'm just kidding I'm [noise]\n\n[noise] [noise]\n[noise]\n\n[noise] [noise] do you\nYou were tighter than that I ...\nI Know ... yeah [noise] it's a carry on [noise] [noise]\nNow how long it's been\nJust yes or\nDoes he think yeah it can be you know\n\nThe thing is the least carry um [noise]\n\nWalk to cook good role or group is uh\nShow not broken the their mom cook and smile\nRadical go ... fall\nOut it's all for being young\nNeed for the day [noise]\nWhen you stand before that they know\nAnd I ... grow and then\nKnow about ... who\nWhere we should not be\nKnew what to do the right\nAnd I knew one of\nGive you a hundred\nYou'd be more like you know\nThese these walk he believes\nThe chief\n[noise]\n[noise]\nI don't want\nIn the marsh\nYou know\nLooking\n\nThat many\nNo no no I'm In the\nThe time they come\n\nHer husband\nThe fence around the\nThe beginning they get they get along\nDo\nOh you know\n...\nI Am buddy Miller and I'm Jim Lauderdale and you're listening to undercurrents American music with a passport\nAnd gay in Iraq\nOut loud but the job of love a nice\nReally be\n... to\n... [noise] Mm\n... were granted my ... with\nJust like the way the ... there is no things you know they don't like\nThat Muller was that the ... ... is\nThere\nDa\nDa ... ... ...\n...\nYou will do no matter what\n... should be disarmed does that mean you don't hear of it they don't bother to do\nA woman who was usually the summers that mean you know they they\n...\n\nUnder current\nHow 'bout that went for a little New Orleans style prince CJ near and the red hot Louisiana band that was bad luck\nGabriel yeah who gave us Don May ... father John misty brought a date night and it was Anthony David with lovely day it's not ... I'm ... if you're just joining us welcome here's Reverend fecal featuring Luther and Cody Dickinson [noise]\nWhole\n\nSo much although they're\nO da\nLa da dum\nLike they're you\nWe need a man\nIn like\n\nBrain oh my\nAnd\nWe need a man\nAnd\nWe need a man\nDa\n\n\n\nNa\n\n\n\nWe also broadcast on the Arizona community radio network at eighty nine point five ... ... ... a drink Williams Ninety point one F. M. K. U. E. Prescott and he points to have an ... came in and they one point three ... like\nSunny skies expected it in the forecast for Parker today ... up to Ninety four was partly cloudy skies in the evening in low it's up around sixty five in Yemen mostly sunny today high is reaching up to Ninety five with partly cloudy skies in the evening and a low up around sixty eight degrees expected\nThanks for listening\nIt's ... like I said I'm here with you all have some great music coming up in just a moment we'll hear from Peter yarn and John Clara no by punch brothers John Lee hooker junior let's start out with something familiar hears Coldplay [noise]\nYours\n... did you have a ...\n[noise]\nThe you\n\n\nThe number\nYeah you know then ... no not\nReally I mean yeah in the three yeah\nThough there why\nNot at all when a ... a month\n\nHey we're shovel the rope and you're listening on the current\nThe Yahoo guy\nThe burden to bear\nA really never to win but through the tree you'd never know\nCan you believe in but you know ... ...\nAnd then you need them but you know ... ...\nThe made in my man but I may never Dan Rather stay in\nWe know the the\nI mean ... ...\n\n... my non\n\nCan dream can\nYou know I'm Alive\n\nNo I'm just I'm\n... [noise]\n\nIs ... ... ...\nWhen he was all\nOver the\nPhone call\nThese kind\n\nOf like a lightning when\nI'm On\nThis one guy on the same time\nThe ... ...\n... ... ... ... ... ...\n...\n...\n...\n... ...\nWhat kind of took a scary thing is with us from when\nThe wind is about\n... [noise]\n... ... ...\n...\nI've got\nMe she won't be season is to know\n... ... ... ... ...\n... ... ... ... we\nWould do is we do like ...\n... welcomes me to do\n...\nYou always welcomes we moved to her ...\n\nThat's the way back in the know prize on my and\nI get angry\nAnd come back from the de ... the brand new friends what I got many in law died\n\nIn ... no legal\nIf you ever do you go from there is what they've got in ... who\nKnows ...\nThey get ...\nOn in the no fly zone by and\nI get a new documentary it goes back from ...\nBrennan friends when I got many ... as far as I\nDo a little\nBit older men you know they know they go a\n\n\nDoesn't he have a warm place that's parties Stewart and his ... with old Mexico they left ... and Abigail Washburn gave us what you're going to do and it was ... with the jumbo with Clara know that at the top of that sat and electric\nCurrents I'm ... if you're just joining us welcome here's John Lee hooker junior\n[noise]\n[noise] I said to them but I have\nBeen done in such a number\n\n\nBack\n\nAnd I\nAlways wanted to be just like Bonnie and Clyde housekeeper\nTrying to to make sure you see I\nMan Who Lied to be good to meet you see I fail\nBack\nOn the uh\nThat\n\n\n\n\n\n\n\n\n\nBrand God oh lord I\nTruck or none of us to talk\nAbout that\nThan I Do well Brad John\n\nBut man\n\nEverything got it from buffalo\nEver had learned today and\nDon't go down\nBut then a failed now\nAnd I made a\nHe broke\nBegan to\nRead about in\nMaine man\nBang\nBang", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "28"}