{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the Arizona community radio network at eighty nine twenty five I stand cage Jay Z they drink William Ninety One that same cage GDP Prescott Ninety seven percent kj easy to to men in Ninety One point three FM ...\nPartly sunny this Monday in ... heights reaching up to Ninety to some ... south when throughout the day partly cloudy and the evening a loaf around sixty six in Kingman mostly sunny today high switching to eighty degrees partly cloudy skies in the evening Loeb around fifty four\nIn Prescott partly sunny highs reaching up to Seventy one partly cloudy an evening a loaf around forty five degrees in Flagstaff partly sunny skies are expected to in the forecast with high switching to sixty four mostly quiet in the evening elope around thirty eight\n\n... coffee I crossed the line here with you for the next hour I picked out some great music which I think you'll really enjoy well Institute little feet\nConway woody and the light and let's get the ball rolling with being less slack and ... [noise]\nDo you\nThink you know what you\nBring that don't ask\nDon't bring you\nSo that's why my one\nConcern made certain days when he went down for a\nPretty good\nFor\nThe last thing\nThat was that brings\nTo hear from certain\nThings like that where you have somebody like south\nPark [noise]\nTo go\nTo the\n\n[noise] [laughter]\n\n[noise] 'cause I work\n\nThe things that\nWe can you tell\nMe that\nWe could just\nThink that they can do\nThings for the last time we make you glad they make me down down\nDown down\nNatural thing you can you bring them yeah but I Do not bring down\nEvery cancer will now three pounds\nReally down down down down down down down\nDown the street you can do that\n\n\nIn the\nBrain glory and the\nAnd then\nSay you're a is on the gear system\nCamera borough can\nOn the way the and Shane\nAnd you know we're always\n\nNo ...\nNo ...\nA small\nFor the ...\nNo\n\nA well\n\n... do the job bad no good\n[noise] [noise]\nGlad moms ain't nobody on a lot of me and how\nOn the Greek up with a lot a lot in the mountains and nobody noticed about a year after the trial\nDon't know what\nBe out in the shade [noise]\nGot\nA bank he died in Europe\nYou want to get them both John how can we talk about ... million others around and have\nMe about this we mentioned it coming home and\nI actually\nThat meant you know I should be allocated about\nTheir job you think\nThat you\nOut and how they've been saying about ... miles either going to stay\nWhile I ... I don't know but a la la la la la\n... about a jeep ha ha you know why they say a while you're in a a ...\n... they they have the ...\nA la la la la la la la la la la la\nLa la la la la la la la\nBridgette or you know why are you saying you're right I Am very na na na na you buy the\nYeah\nLa la la la la la la la la la la\nWho do you go about you where are you know you're in a minute\nOh I don't know\nHalf from G you\nAlready have a very very\nBy no yeah\nWe left them to go but up to ... go up on what's good about do you do\nYou know\nWhy am I right here say hey that's dry you know we're\nHearing and say hey\nNa na na na na na na\nNa ... are you a wire you say you're saying yeah why a painter and their value by\nYeah hey hey ding dong\nDoctor mom we ate who belong in a ... a young lawyer or a I die you blog\nAbout my God to teach you to know\nWhy I ask why are you a very fine\nYeah paying ...\nNa na na\nNa na na\nDa da da da da da da da da da da\nNa na na\nG. God are you there are wearing a wire saying hey yeah that's why you buy a ... year other na\nNa na na na\nNa na na na na na na na\nNa na gee you know why [noise] [noise]\n\nUm maybe\nShy\nThan any man they need to\nDay ...\nWell not rather young\nTo be spent on it uh\n\nThe the the\n... name three broke\nUp on\n\nPardon me\nIn some things\nHe did\nOn to be based on its way\nYou know [noise]\n[noise] no no no\nThey didn't do you like to go in with a kid I don't know\nHow long is the thing to get\n[noise]\nWhat do you\nDo you\nDo that\n\nCan you\nDo\nDo\n[laughter]\nTo go do you see my friends are in the bathroom getting tired and\nMay waiting for me to just across the bomb about ... minutes they give him a lot of someone asked him about God I Know I\nI Know you're trying to\nLearn the queen of the main\nYou know I'm trying to take in by\nThe bars close it and you feel like falling\nAll carry you\n[noise]\nA way along with my\nJeremy me\n[noise]\n\n\nWow what a great version of we are young featuring fun and the ... mice throws\nWhich is a star studded group of beautiful wonderful musicians with the distinctive rhythms and sounds of go by it's recorded by an all star cast of legendary musicians in fact\nIncluding when of is just social clubs but a buddy those daughters and I might eat the why did\nYou find is that the French singer Christine and the queens gave us damn what must a woman do\nWould end up ... critiqued our current administration with Tangerine man and it was Conway with woman you've been listening to undo currents and if you're just joining us welcome hears Patty Larkin on under current\nI Know\nDuring nine or\n... oh\nI'm the I'm On my\nWay\nMm oh ...\n...\nWho am I ...\n\nNa ...\n\nYeah\nLove can make huge um hold on\nI'm home again Mm\n[noise]\nYeah um let's see\nMm\nOh there you\n... ...\n... ah ... um\nI'm home again Mm\n\nMm\n[laughter]\nOh my God yeah yeah but so\n\nMany gay and I believe\nFor them to do that [noise] are\nThey going to say that\nMost see as many as ... [noise]\n\nYeah you really love God and interviewed on\nKnow\nDo you see that on on saying you\nCalled me on the news and then\nThey give you reason though is releasing\nNinety point seven FM J. D. C. K. king then in Ninety One point three FM Flagstaff\nPartly sunny this Monday in Yuma highest reaching up to Ninety to some ... south when throughout the day partly cloudy in the evening Loeb around sixty six in Kingman mostly sunny today highs reaching up to eighty degrees partly cloudy skies in the evening Loeb around fifty four\nIn Prescott partly sunny highs reaching up to Seventy one partly cloudy in the evening Loeb around forty five degrees in Flagstaff partly sunny skies are expected to in the forecast with hydrogen up to sixty four mostly Claudia in the evening elope around thirty eight\n\nIt's ... like I said I'm here with you for the next hour with some great tunes including ones from our low Hannigan\nThe boat deans van William and Elvis Costello and the postures\nLet's start out with one from jealous of the birds Naomi Hamilton bandleader from Belfast Ireland\nSays that this song plastic skeletons was written once she got back from South by south west in two thousand sixteen that was her first trip to America and she brought a journal and wrote a bunch of stuff in it\nWhen she got home she says she went through it and wrote that song in full it's a collection of little words and images that she picked up in the U.S here's plastic skeletons on into currents\n\nWhere money Danny\nMean by\nKnow some of the study\nReally or\nBecause that's the right by the ability to undercurrents ready\nShow ...\nYork law school\nRead the news\nHe did you get to\n\n...\nCity is you know the thing is this does go say what you said\nThey got sued the defendants\n... years old and\nSaying is brown\nHis own son\nPercent which is a little more business in\n...\n... mom I've gone to trial in my hand and I'm ready for a loan\nEven\n[noise]\nWe drive down the cellar higher were able to drive all the way down to\nWhen we get to our campsite\nThere's a bigger room there\nSo we got bored cross ...\nControl between both sorry\nThan we are always on the other side\nYou're there you're our fear of\nLike you can kill your little bit of\nBeach for\nYou learned back to when you wake up\nThe security for one another\nYou feel a lot more than what the\n[noise]\n\n\n\n[noise] so many um\n\nSo many well do you know\n... and\nYou\nOf money on\nOn\nA R I Want\nI just want\nKnow I don't really\nSee I\nIn a [noise]\nYeah I just saw\nA\nGuy on\n\n\nGuy on um\nOn\nGlad that they may\nUp\nWe don't lose when you got to\n\nYou\n\n\nThis Jackson Brown and you're listening to under courage\n\n\nDon't know I don't mean to me when\nCall ...\nThey got to be\n\nThat was Jackson Brown and ... cents on place with the dreamer\nIn front of that a new one for an Elvis Costello and the posture it's Mr and Mrs dash and it was a ... piece Jay Douglas gave us celebrate my love would ban William at the top of that sat with cosmic sign\nIt's under current I'm ... and if you're just joining us welcome here's a song designed to make you feel better hears southern avenue\n[noise]\n\nTo\n\n\nThing\nOr a\nDog\n\nUm ...\nYou\nHow\n[noise] I [noise]\nThis [noise]\nUm well they don't [noise]\nWe also want to catch on the Arizona community radio network at eighty nine point five FM cage Jay Z a Drake Williams Ninety point one from kj deep deep Prescott Ninety point seven FM cages eat cake Kingman and Ninety One point three FM black stuff\nMostly sunny skies in Kingman today highs reaching up to eighty degrees partly cloudy skies in the evening with Loeb around fifty four partly sunny in Prescott this Monday morning has reaching up to Seventy one partly cloudy this evening globe around forty five in Flagstaff partly sunny hydrogen to sixty four mostly\nQuality in the evening all over around thirty eight and you must partly sunny has written up to Ninety to some call themselves when throughout the day partly cloudy in the evening with low up around sixty six degrees\n\nIt's under ... like I said I'm here with us for the next hour hope you like the music that I picked out for you we've got some good ones from carrying more in age age and fleet Fox's and even Donovan first off mace\nWe've got some good ones from Kerry Moran age age and fleet boxes and even Donovan first stop Macy Gray from two thousand ten beauty in the world\nShe's\n[noise]\nInternet and\nThat um are\nHer and her parents\nHearing\n\nAnd the more than\nThey called me in\nDon't know\n[noise]\nHey this is Jay Jay thanks for listening to under current\nThe ocean German\nIn there\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n\nRight oh whoa whoa whoa\n\nWhoa back\nI'm going to die you\nHow this\nPrime locked in a\nRow row row\nQuestion what\nRole in\nOh whoa whoa whoa\nWhoa whoa whoa whoa\nThey do and I pray that\nWhoa whoa\nTen\nNine in all the\nOld old Opry I added row\nRow row\n\n\n\n\nIn the pouring rain\nAnd Robin\nLost my voice and I lost my clothes lack in Charlotte I knew I knew\nBut when I Will\n... ... leaves ... gone I Try not to panic as I'm\nFrom the south ...\nAt all then\nEverything is saying and I can now right [noise] [noise] [noise]\n[noise]\n\nMm\n... ...\n... ...\n... or\nDue the fear [noise] oh yeah man [noise]\nYou are much sunshine\nList on the show and\nYou never know\nClean things may\nMom mom I was told\n[noise]\nYousef cat Stevens gave us you are my sunshine when the two thousand fourteen release tell them I'm gone past the standards brought us as a treat it with the Donovan from Nineteen Ninety nine\nWith to Susan on the west coast waiting and fleet Fox has brought us aisle\nIt's under currents I'm gravity of that and if you're just joining us welcome here's a new one from Paul McCartney [laughter]\n\nJune ...\nWas driven days are over ...\nThe polish ... Vermont\nThe\nStreet\nTo the\nOne\nWay the\nPretty\n[noise]\nPeople\nThe TV [laughter]\nPeople [noise]\n\n\n\nYou shouldn't be jaded daughter\nAgain you know the big issue in ... new try\nYou got some fish the the\nEighty nine point five FM McKay Jay Z a drink Williams Ninety One F. M. K. cheesy Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three ...\nRadio easy dot org we also broadcast on the Arizona community radio network eighty nine point five FM McKay Jay Z a drink Williams Ninety One F. M. K. GDP Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three of them Flagstaff\nMostly sunny skies intimidate highs reaching up to eighty degrees partly cloudy skies in the evening with love around fifty four\nHardly sunny in Prescott this Monday morning hides reaching up to Seventy one partly cloudy this evening Loeb around forty five\nIn Flagstaff partly sunny high reaching up to sixty four mostly cutting the evening of low around thirty eight and you must partly sunny has reaching up to Ninety to ... south wind throughout the day partly cloudy in the evening with low up around sixty six degrees\n\nIt's ... like I said I'm here with you with some great teams coming up from St Vincent quota thing Richard tone and universal speakers first off here's Bruce Springsteen [laughter]\n\n[noise]\nShepherd\n...\nFor leach and Jews\n\nWe were ...\n\n\n\n\nThe\nMembers lived up to orange\nScreen do by eleven retreat he yeah he was a quick and\nAbove the lady in the book but you\nIt's going to be under the sun and she knows really\nThe Bronx fresh cut off the boat and so what are your memories for\nMay well it's not like he was quick in the day I\nYou want to know what happiness is it is a there's a ... some\nTo look forward to this cat is going to get the creek new skin mango is so smooth smoother than they do they do go to like jump up to the ...\nHello this is talk shows and you're listening to under current American music ... ... ... ...\n\nLady\n\nAnd\nAsked you\n\n[noise]\nJackie green with crazy comes easy and up tempo songs that offers and appreciate it not to the black crows whom Jackie laid lead guitar for during the bans two thousand Thirteen world tour\nRichard Thompson in front of that with the new one from these Thirteen rivers album no matter and it was put our faith with little girl dreaming\nIt's undercurrents I'm cap the well here in New one from universal speakers in just a minute\nYou can hear border radio Thirteen twenty am on the radio ethics download the app install it and so like kale I think as your favorite station\n... in the Arizona neurotic village will be hosting ... has been five K. it'll be this Friday starting at six PM with post race games on a campfire starting at seven Fifteen yeah this will be held at the Arizona Nordic village eight miles past ... up highway one eighty\nThis is folk singer Michael Jonathan inviting you to tune in to this week's broadcasting we have the Austin trio the trolls measures and the son of the legendary John McHugh and Jonathan McEwen his son\nHe both artists music in conversation on this week's broadcast\n\nConversations this week's broadcast\nUm\nTo the evening at seven on board or radio so he's twenty and\nYou're listening to under current coming to you with support from the corporation for public broadcasting and the friends under current thank you for your ongoing contribution here's a new interpretation of an old too from the reiki band universal speakers [noise]\n\nNa\nNa\nHey it's drawn more short it things will get in on the garbage American music or the fans\n\n... thankful that need to undo the coverage American music for the past ...\n[noise] [noise]\n[noise]\n\n\nWell we'll just you won't kill me again so I don't know\nWhat's happening in it then\nIt's going along guinea all show what did you want\nTo put your agenda [noise]\nBack and I'm like you know that\n\nDo you feel like I'm back\nAgainst on its own little\nYou can't just\nWhen you were kids and she the\n[noise]\nBe on your knees so\nOne may\n\nEat them go through all those slain all that money should be\nGiven something important maybe\nWhat was wrong to kill me again I've\n\nSeen rich change am I getting it wrong\nYou're listening ... ... am I getting it wrong laying on my way and I\nWhen it's not it\nDidn't do it well you even get a\n\n\nBetty live at with what was it you wanted featuring Trombone Shorty in front of that it was Sarah Borgias end the broken singles from the album loves middle name that was headed down\nThe record company gave us I'm getting better and I'm feeling it right now and universal speakers brought us that cover of the tide is high it's undercurrents I'm ... and if you're just joining us well here's the Reverend Shaun Amos\nShe moved to smooth the I'm In\nI'm ... I mean\nThe brain\nDo when\nLate ... when\n[noise]\nOr you\nTheater\nYou want to talk\n\nCan you do the ... press get Ninety point seven FM cage easy kicking met in Ninety One point three of them like staff in Kingman\nMostly sunny today I near eighty degrees south south west when seven to fourteen miles per hour tonight partly cloudy those around fifty four Prescott mostly sunny eyes near Seventy two today partly cloudy tonight loves around forty five\nBlack south mostly sunny eyes near sixty five today and tonight partly cloudy lows around thirty eight in Yuma mostly sunny with a high in eighty nine today it partly cloudy tonight with the lowest sixty four\n\n... ... across the line here with you for the next hour I think that some great music which I think you'll really enjoy well let's see two little feet\nConaway ... in the library and let's get the ball rolling with bailout flak and Abigail Washburn [noise]\nDon't you\nYou know no one is that it you\nYou don't bring 'em well\nNo no not bring you\nOnce you for that was the one that well\nSounds like you're not going to lead the way down down down down down\nPretty good\nGoing down down from the actual bring that\nAnd we're we're pretty good\nTeaching a fortune ...\nCompanies are paying to see a lot of food do you think\nThat was three and\nWoman in the city should teach sooner or later\nYou're still not very clear now something pretty time shoveling down down down springs bring\nTo ... [noise] [noise]\n[noise] [noise]\n\nWhere people can live with somebody that was the\nTo\nMe you know\nWe can you tell\nMe that\nWe could just\nThink that the guilt thing\nFor the last time we knew that they bring down down\nDown down\nDown or something you can you bring you down down down down down\nDown down down down down\nDown down down down down down down\nDown in the same\n\n\nThe\nFall prey to play the\nAnd then the\nOf sheer arrives on me gear system\nA line\nBorough can\nOn the way the and Shane\nAnd you know little you know way\n\nKnow the you\nKnow\nKnow Paul\nFor a ...\nNo\n\nA\n\nBill and do a little bit and you know good\n[noise] [noise]\nI'm Glad I don't even have more than a nobody on a lot of me and\nOn the hand picked up a lot and a lot in the mountains and you'll be known about a year in the day after the trial\nI'm looking at it that way\nBut you\nMaking sure the ball and these are joined Shane [noise]\n\nGot bank he died in Europe\nGet them both John how we're going to five years in the near with others around wouldn't have\nMe about this we mentioned to come and no doubt\nThat you\nKnow maybe you know I should be allocated about is how do you think\nThat you\nAnd hobbies or do you get about ... miles either go to Shea\n... bucks a call ... ... ... ... what a la la la de la ...\nAbout a boutique or you know why you know you're saying yeah well he uh\nA boutique that are you still are\nWhy if you're saying yeah well you have a a ... I Know\nThey say hey as\nNa na na na na na na na na na na na na na na na na\nBridgette guy you know why and say hey yeah I Am saying hey you know in\nThe\nHa ha ha ha ha ha ha ha ha ha ha ha but\nWe're going gee you\nAlready know you're very very\n... you know yeah\nWe are you left out to go but up to ... ... ... ... ...\nYou know why\nAm I a lawyer saying hey you know try you know\nAnd say hey\nA R I lost a loved one ha\nNa ... are you ... if I might have a\nValue by though yeah hey hey ding dong\nDoctor my we ate who belong in a ... a young lawyer to talk I die you law\nBut my God do you\nWant to if I were you a very very upset by\nThe same game as an attack but around\nNa na na\nNa na\nDa da da da da da da da da\nDa da da\nNa na na\nNa em Ali G. God or you saw Renee hey hey hey hey yeah that's why you buy 'em yeah yeah yeah\nHa ha ha\nHa ha ha ha well\nGee you know why [noise] [noise]\n[laughter] [noise]\nUm maybe\n\nThan any man you can they do need to do\nThat day ...\nRather\nI'd rather young man\nOne of the band on its way no um\n[laughter]\nThe scene that she had\nAbout these\nNames pretty well they can make a\nLiving on Sunday\nAnd some things\nHe\nTo be done and say\nOn the mean based on its way\nTo know\nDo that you do crowns just like the way\nThings then you know in may the kids don't know\nI tend to get\nWhat do you\nDo\nDo\nDo\nCan you\nDon't\n\n[laughter]\nTo go to ... do you see my friends are in the bathroom getting tired of\nWaiting for me just across\nAbout ... minutes said give him a lot of the song by asking a lot of God I Know I\nI Know you're trying to\nClean the gutters made\nYou know I'm trying to take you back\nThe bars close and you feel like falling\nOkay I mean you\n\nWhen Baltimore\nTo me\n[noise]\n\nWow what a great version of we are young featuring fun and the how Bonner maestro\nWhich is a star studded group of beautiful wonderful musicians with the distinctive rhythms and sounds of go by it's recorded by an all star cast of legendary musicians in fact including when of is just social clubs by buddy bill daughters and I might be filled by this\nYou can find is that the French singer Christine and the queens gave us damn what must a woman do\nWoody and the ... there's critiqued our current administration with Tangerine man and it was Conway with woman you've been listening to undo currents and if you're just joining us welcome here\nSure enough man and it was Conway with woman you've been listening to undercurrents than if you're just joining us welcome here Patty Larkin on under current I Know\nSweet lie\n...\nUm be on my\nWay\nHome I guess ...\n\nNa ...\n\nLove can make huge um hold on\nI'm home ...\n\nYeah um let's say\n\nI'm a huge\nMm Mm\nMm right yeah I ... I'm\nI'm home again um Mm\n\nMm\n\nOh my God yeah by so\n\nMany good elite force\n[noise]\nOh yeah that is\nMost see as many as ... [noise]\n\nYeah you know a lot of the road in ... [noise]\nKnow they\nDo you want to do that on on the new\nCalled me I mean you\nReally really seen you know\nOr eighty nine point five essay kj ... age ... Williams Ninety One that same cage ac peep Prescott Ninety eight point seven as than Jay Jay Z cake Keenan and Ninety One point do you ask them like staff\nIn Yuma mostly sunny in a high in eighty nine east within five miles per hour today tonight partly cloudy those around sixty four\nHuman has mostly sunny skies in a high near eighty today and tonight partly cloudy laws around fifty four\nPrescott mostly sunny highs near Seventy two today tonight partly cloudy laws around forty five and in Flagstaff mostly sunny with a high up sixty five today partly cloudy with a low of thirty eight tonight\n\n... like I said I'm here with you for the next hour with some great tunes including ones from our low Hannigan\nThat do demons van William and Elvis Costello and the postures let's start out with one from jealous of the birds Naomi Hamilton bandleader from Belfast Ireland says that this song plastic skeletons was written once she got back from South by south west\nPeter from Belfast Ireland says that this song plastic skeletons was written once she got back from South by south west in two thousand sixteen that was her first trip to America and she brought a journal and wrote a bunch of stuff in it\nWhen she got home she says she went through it and wrote that song in full it's a collection of little words and images that she picked up in the U.S here in plastic skeletons on the degree\n\nRight\nAre you guys have\n\nReally are\nTo\nBecause that's where I bought a ... de undercurrents radio\nCurrents radio\nShow very wrong song\nIt you are law suits\nTo understand what goes on and he\nSaid that you can reduce\nHe do that\nYou know the day the stove and go away\nThey got sued the dead\nMan yo this whole thing and\nMan saying is brand\n...\nAll this land which is a little more business in\n...\n\n... how long the motive mumbles Scottish prowling my hand and I'm ready ball will\nOr even a\n\nWe drive down the cellar hardware\nWhen we get to our website\nThere's a big move there\nSo we got ... ...\nControlling up between both sorry\nOther always remember ever start\nYou're very your hours for a\nSaying like you to hear a little bit of\nBeach so\nTo go back to when you wake up\nCheer you you're going\nYou feel a lot more than what the\n[noise]\n\n\nOh and by\n\nSo many ways\n... and\nYou\nKnow and\n\nAre na na\nNa\nI just you\nSaw you know I don't\nSee why\nNo no no no [noise]\nYeah I saw\nA\nAnd I know\n\n\nGuy on um\nA ...\nGoing to they\nSeen\nGoing to say\nDa da\n\nDa da da da da da\n\n\nPointed to\nYou think\nI\nThis Jackson Brown and you're listening to under current [noise]\n[noise]\nWhich are which caused\nDon't know I don't mean the way\nOn ... ...\n... ...\n...\n\nThat was Jackson Brown and ... cents on the list with the dreamer\nIn front of that a new one for Elvis Costello and the posture it's Mr and Mrs dash and it was a ... piece Jay Douglas gave us celebrate my love with Stan Williams at the top of that sat with cosmic sign\nIt centered currents I'm ... and if you're just joining us welcome here's a song designed to make you feel better hears southern avenue\n[noise]\nTo\n\n\nAll right\nAll\nAll right\nUm let me\nYou\nYou\nHow\nThe\n... Williams now deeply one ... Ninety point seven at the same cage easy kicking men in Ninety One point three ... in England\nMostly sunny today eyes near eighty degrees south south west when seven to fourteen miles per hour tonight partly cloudy lows around fifty four ... mostly sunny eyes near Seventy two today partly cloudy tonight lows around forty five\nFlagstaff mostly sunny ice near sixty five today and tonight partly cloudy lows around thirty eight and ... mostly sunny with the highest eighty nine today it partly cloudy tonight with a low of sixty four\n\n\nHey it's under ... like I said I'm here with us for the next hour hope you like the music that I picked out for you we've got some good ones from carry more in age age and fleet Fox's and even Donovan\nFirst off Macy Gray from two thousand ten beauty in the world [noise]\nTo do\n[noise]\nNa na\nNa na na na\nNa na na\nNa na\n\nThe morning and\nThey called me in\nTo\n[noise]\n[noise]\nHey this is Jay Jay thanks for listening to under current\nShould in Germany\nHim a player\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n\nRight oh whoa whoa whoa whoa whoa whoa\n\nBeen holding back\nNo\nNo this\nPrime ...\nRow row\nRow row\nShe was in\nA row and\nOh whoa whoa whoa\nWhoa whoa whoa whoa\nThey know what I bring that\nWhoa whoa\nCan do\nIn all the\nOld old Opry I added row\nRow row\nRow\nRow row\n\n\n\nIn the pouring rain\nAnd Robin mean\nLost my voice and I lost my clothes like in ... new and then\nA button when ...\n... ... leaves will go on to I Try not to panic as in um you know\nFrom the south ...\nI mean you know\nFrom the south and we were\nDo y'all been\nEverything is saying and I can now right [noise] [noise]\n... ...\n\n... ...\n... ... ...\n... ...\nDue the fear of yeah man [noise]\nYou a much sunshine\nSunshine\nSleeping\nMy mom I once told me\n... ... ... ... ...\nYusef cat Stevens gave us you are my sunshine from the two thousand fourteen release tell them I'm gone past the standards brought us as a treat\nIt with Donovan from Nineteen Ninety nine with to Susan on the west coast waiting and fleet Fox has brought us aisle it's under currents I'm gravity or that and if you're just joining us welcome\nHere's a new one from Paul McCartney\n\nWas driven days you know ...\nMad at me do it in well\nThe Bush really Vermont\nFees [noise]\nCheese\nDo\nOne\nThey\nTo me\nThan just\nTo\nBeat up on\nTV [laughter]\n\n... James and the daughter\nThe back of the nation from ... to try\nYou got to see the\nButter radio waves eat dot org\nWe also broadcast on the Arizona community radio network eighty nine point five as than Kay Jay Z a drink Williams Ninety point one this damn cage Jay Z peep Prescott Ninety point seven Afghan kj easy cake Kingman and Ninety One point three FM like staff\nIn Yuma mostly sunny in a high in eighty nine east when five miles per hour today tonight partly cloudy those around sixty four\nEngland has mostly sunny skies in a high near eighty today and tonight partly cloudy laws around fifty four\nPrescott mostly sunny ice near Seventy two today tonight partly cloudy laws around forty five and in Flagstaff mostly sunny with a high up sixty five today partly cloudy with a low of thirty eight tonight\nIt's ... like I said I'm here with you with some great tune coming out from St Vincent put out the Richard ... and universal speakers first stuff here's Bruce Springsteen\n\n[noise]\nShepherd\nTo\nFor the changes\nVe we will ... ...\n...\n\n\n\nMean\nThe dog to\nScreen do by limiting retreat he yeah he was a quick end\nThe late ... in the book\nIt's going to be under the sun neutrinos blew me\nTake runs fresh probably below them to be removed for\nTo grind fresh Kobe Bryant and serve me move furniture\nDay was not like he was quick and the day I\nYou want to do or happiness is it is a there's a hunch is going to look forward to this is going to get the green and blue skinned men go is so smooth smoother than the devil may need to go to like jump up to the ... main rebel [noise]\nGround eastern\nThat's why he walked out\nCan either way he was born\nHe's cutting it easier\nTo do with the\n[noise]\n[noise] [noise] [noise]\n\n\nUm the man no way what do you really can't make it messed up when you go and no way that can be when you read that change your mind not do well to\n\nDo you head they ... they ...\n[noise]\nHello this is Richard structure and you're listening to under ... American music ... ... ... ...\nWho\n\n[noise]\n\nNa you've been\n[noise]\n\nOkay and do\nJackie green with crazy comes easy an up tempo songs that offers unappreciated not to the black crows whom Jackie laid lead guitar for during the bans two thousand Thirteen world tour\nRichard Thompson you find is that with the new one from these Thirteen rivers album no matter and it was put up with little girl dreaming\nIt's undercurrents I'm God you're that we'll hear a new one from universal speakers in just a minute\nYou are tuned into\n... well here in New one from universal speakers in just a minute\nYou were tuned into border radio Thirteen twenty in ... a C. dot org we also broadcasts an Arizona community radio network\nToday's border radio day sponsors human community theater presenting Agatha Christie's and then there were none assistance will react play that will keep you guessing to the very end opening friday November second at seven PM and running weekends until November Eighteen the pecan grove elementary school\nSix hundred twenty first avenue in you more humid community theater dot org\nThis was folk singer Michael Jonathan inviting you to tune in to this week's broadcast we have the Austin trio the trolls managers and the son of the legendary John McHugh and Jonathan McHugh and his son\nAnd he sort of music in conversation on this week's broadcast\n\nDo you think it's seven on board or radio so he's twenty and\nYou're listening to undo currents coming to you with support from the corporation for public broadcasting and a friend to undo current thank you for your ongoing contributions here's a new interpretation of an old tune from the raking band universal speakers [noise]\n\n\n\n\nJumbo shorter things will get you on the garbage American music where the parents\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\nWhoa whoa whoa Yulia can go out and know\nHappened is that\nGoing along in your show what did you\nWould you say it again [noise]\nBack in the last\nWhat did you get your field I'm back\nIn the weekends dot in all\nMind\nWhen you were kids and she\n[noise]\nWhat do you know you don't\nAlong\nKnow\n\nI eat them go through those slain than what it\nIs it something important maybe\nWhat we want to kill me again I was\n\nListening to change\nLaying on on the ...\nWhen it's not it\nDid you what you eat lunch I don't get me in\n\nBetty live at with what was it you wanted featuring Trombone Shorty in front of that it was Sarah Borgias and the broken singles from the album loves middle name that was headed down\nThe record company gave us I'm getting better and I'm feeling it right now and universal speaker it's brought a sec cover of the tightest high it's undercurrents I'm ... and if you're just joining us well here's the Reverend Shaun aim at\nWould be I'm Ryan\n\nThe burning\nDo when\nSaying look we've\nHappens you have\nTheater no\nLead you to want to talk to\n", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "29"}