{"month": "10", "state": "AZ", "station": "KOFA", "content": "\nYou are to chew K O at the\nBorder radio Thirteen twenty am and order radio ...\nWe also want to catch on the Arizona community radio network at eighty nine point five FM cage Jay Z a Drake Williams Ninety point one F. M. K. J. D. E. Prescott Ninety point seven FM kj the cake Kingman and Ninety One point three FM Flagstaff\nSunny skies today hind you're Seventy seven some get up to thirty miles per hour from the north\nMostly these guys in the evening with a low rent sixty one in that window will continue in Kingman sunny skies hind you're sixty seven most including the evening a low around forty four mostly sunny Prescott today on your fifty five and partly cloudy and the thing with the low around thirty six in Flagstaff today mostly send these guys are high and you're forty five\nIn the evening there is a twenty percent chance of snow showers with part of the ... guys and the low around twenty eight degrees\n\nCourageous under current some great ... welcome bought a great music coming up this hour we'll be able to stick around check it out from Susan to death ski Walter Martin Roderick mirror ball Buffy ... Marie Lu drive\nIt let's get right to know with a little bit of Appalachian sitar this is Donna yeah we can't think of the ... ah\n\n\n\n\nYear\n\n... or a\nOr a\nA ... a\n\n\nDown [noise]\nAbout Mm\n\nNah\nDa na we're\nNa na na na\n[noise]\nIn spring parish\n\n\n[noise]\n'cause she's got no\nI mean but she knows the ... most of my ... mother in law but to me\nLike about ... about last night's outcome\nSomeone trying to get on one man's Saddam was church maybe someone as\nThem to try to shoot all seen them\nHistory does during the\nSome one church any more\nSaddam was Charles maybe I Need\nAny money to church you know\nIt's more than ... maybe I Need someone\nBang bang bang bang bang bang bang bang bang where\nOn the ground blue ... and\nWell do do do that you do about the\nDa\n\n\n\nDo think [noise]\n[noise]\n\n\n\n\nMm\nMm\n\nUh Mm\n\nUh uh\n\nUh [noise]\n\n\n[noise]\n[noise]\n\n... ... ... ...\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n\n\n\n[laughter]\n[noise]\n\n\n\n\nNeed to be\n\nBy\n\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm\n\nAnd the gardening for here's the latest from my low green Mrs ...\n[noise]\nMan I say says they just knew I\nLost to the\nChange him he's a\nHere and why it could be the last ...\n\nI Know\nTo stay away getting\nBut you could see that\nBe if I\nBe if I could be the last year\nA\nIn key each SF in Ferndale, California\nAnd this is needed voice won\nThe Native American radio network\n\nBroadcasting from the campus of Arizona western college this is border radio Thirteen twenty am ... and border radio easy dot org we also broadcast on the Arizona community radio network\nEighty nine point five FM McKay Jay Z a Drake Williams Ninety point one F. M. K. GDP Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three of them Flagstaff\nSunny skies and humid today hind you're Seventy seven some got up to thirty miles per hour from the north\nMostly these guys in the evening with the low around sixty one and that window will continue in Kingman son he's got to hide your sixty seven mostly clear in the evening alone round forty four mostly sunny in Prescott today hind you're fifty five and partly cloudy and the evening with the low rent thirty six in Flagstaff today mostly sunny skies are high and you're forty five\nIn the evening there is a twenty percent chance up snow showers with partly cloudy skies and the low around twenty eight degrees\n\nOutrageous undercurrents I'm Greg McGregor welcome good to be with you and got a big basket music for a year from Marvin Gaye outcast a milk carton kids ... so much more right now ... ... this is a magic hour\n[noise]\n\n\nGot a big basket music for here from Marvin I'm curious to know card kids be Robert change so much more right now for ... this is the magic hour\n\nA\nWhich can\nThat she never see\n[noise]\nMm\nNo ...\nIn a small\nOh by the ...\nKnow\n\nA\n[noise]\n\n\n\nMm I'm\nDo\n\nWho [noise]\n\nThey they\nBring out of Nevada there anymore like jet you're bad\nHe said\nI think\n[noise]\n[noise]\n[noise]\n\nHappened to [noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\nWe May Day the tone\n\n\n\n\n\n[noise]\n\n\n\nYou know\n[noise] [noise]\n\nThey\nGive me you bring in\n\nThey go on stage thank you\nWill pick you mean you're pretty good\nI work with records\n\nLow low [noise]\n\n\n\n\nDaddy home on the go and the you all a long time\n[noise]\n\nSo what we take on the Bruce Springsteen song I'm On fire from wider wars Iran under current outcast with proto tired from speaker box the love below from two thousand three it's been what Fifteen Years and it's taken this long that I Am not bad at Andre three thousand anymore for\nThat ridiculous\nHey this is marriage heroes and you're listening to under ... American music with the war\n\nMovie\nHey this is Roger Ailes and you're listening to under ... American music with the ...\n\n\nNa\nHey I'm going\nAble\nIn the morning and\n\n\nKnow\n[noise]\n\nMaybe they can be a man\nThe and\nYou should\n\n...\n...\n...\n... [noise]\n\n[noise]\n\n...\nAnd\nMm\nThe every wonderful series heroes anything else from bill me up from bones sure on undercurrents\nRemembering Marvin Gaye you know the ... project which studio Rio sexual healing and it was first nations artist crystal joined us from Canada I'd rather go blind from her up when we do woman\nBreak your it's under current and if you just turned ... will get the new pardon kids on the way we're going to jump right back in now with a new one from ... power featuring lemon del ray ... woman\nHa ha ha ha ha ha ha ha ha ha ha ha ha\nDa\n[noise]\nSilly 'cause they\nTraining and\nDelete the\nHa ha ha\nGave me\nThe new one and\n\n\nYour tooth decay usa Yuma border radio thirty twenty am and border radio AC died or\nWere you also broadcast on the Arizona community radio network at eighty nine points I asked him Jay Jay Z a drink Williams Ninety point one Afghan cage Jay Z peep Prescott Ninety point seven asked them Jay Jay Z cake Kingman and Ninety One point three FM facts that\nSunny skies in Kingman today hind you're sixty seven degrees mostly clear in the evening with the Loeb around forty four in Prescott mostly sunny a hundred and fifty five partly cloudy in the evening with the low rent thirty six in Flagstaff mostly sunny a high near forty five\nEasy ... or we also broadcast on the Islamic community radio network\nAt eighty nine point by that same cage Jay Z a drink Williams Ninety point one Afghan kj deep deep Prescott Ninety One serving FM gay Jay Z gate Kingman Ninety One point three FM blacks that\nSome of these guys in Kingman today hind you're sixty seven degrees mostly clear in the evening with Loeb around forty four in Prescott mostly sunny a hundred and fifty five partly cloudy and the evening with the low around thirty six in Flagstaff mostly sunny a high near forty five today twenty percent chance of snow showers in the evening was partly cloudy skies Milo around twenty eight\nAnd humid today it's sunny skies behind you're Seventy seven a bit windy outside gets up to thirty miles per hour from the north most declares guys in the evening with the low of around sixty one degrees and the guts will continue into the evening\n\nOh right it's undercurrents I'm Craig Becker welcome and a few special things coming up to shower for mockery bow Leonard Cohen ocean Herbie Hancock\nCleveland Ali and more right now let's get going with the new one from fantastic and agreed Elvis's pushed back\nAgain and and\nThey were my mom to chew\n\n... years ago\n[noise]\nRight and it's\nCheap\nShot to\n\nMean and the [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nDay\nA\n\nBird\nAnd oh\nThree\nAny time you know\n\n[noise]\nMay not be able\nMuch to me\nMaybe in the long\nThat they may\nToo much\n\nAbove the\n... billion\n[noise]\n\n\nI Know and you're going to\nThem although not God will keep\nEye on\nThem do I do want to know\nI don't\n[noise]\n[noise] [noise]\n[noise]\nAnd on your door\nDoing a good\nThink yeah\nThe\nI was\nI don't know\nOn\nTo you [noise]\n[noise] [noise]\n\nOn the marble largest wouldn't\nKind of a victory march\nUh they don't\nHow do\nDo\nA NATO or\nLot of lord of the song\nNo no no no\n'cause they're saying the dry dry\nThrough all\n\n\nDa na ... to ... ... ...\n... where do we do on a ... ...\n...\nShe or it is ... ...\n... ... ... ...\n... ... ...\n...\n... ...\nA\n... and you'll know\n...\n...\n...\n...\nEmail\nTo ... ...\n... ... ... ... ... ...\n... against the shop\n\nI'm On\nThe right\nTo ... ...\n... ... ...\n... against the child\nI Know that on some of it you\nKnow to\nTake well and it's gonna be ... ... ... ... no no no no no\nNo\nNo\nNo\nUh no\nActually\nNo ... ...\n\n...\n...\n...\n...\n...\nNo no\nNo\nNo ...\n... ...\n... ...\n...\n... ... ... ...\n... no\n...\nBy ...\n... oh\nMm\n\nMm Mm Mm\n\nTerms ... the great Charles boy and marvels plus Lucy Williams they're nice to have a record a long long time ago called\nIt was a cold blooded yeah love ya bye Charles what life is the former angel and even just to me I ... from vanished current stroll Lloyd marvels ... big red machine him not stick\nAnd was ... Miller ... no one of the six nations more\nNew young crazy horse from psychedelic pill twisted road but what is the twisted wrote isn't it\nThe Williams there I have a record a long long time ago called\nWas it called plugged in London by Charles Lloyd lived at the Fillmore angel the name of this one ... from vanished gardens Cho Lloyd marvels with William big red machine him not stick\nAnd it was ... Miller ... Miller six nations mohawk\nAnd new young and crazy horse from psychedelic pill twisted road but what is it twisted wrote isn't it twisted road checkered past [laughter]\nBut we're having fun along the way something really interesting coming up from mark repo and I'm Steve Earle and Tift Merritt altogether that's coming up but first punch brothers would jump out this is the latest\nWhen it comes on but with the phone in San ... allowed to have you seen the real may go up stronger than last in the sci fri sure against the guy to hand out the star witness grandpa bunny and his daddy died that you want to do it but then you have to be the hard\nThing to be you know we've been people\nWho own guns don't believe they're not then again and another thing to do is go to Pam going from being on the bad as the land\nAnd to see the ... like a George in the dark ... still do the city particularly and you pay a little bit during the bomb zone or something like that you\nKnow again\nAgain a lot of time on the hand that\nCapitol Hill used to buy had um the thing\nIs I'm I'm\nWinning in him\nIn big good on the job I'm going to\nEnd it was only China\n\nWhen a jumble\nOf all\n\nThe time\nStanding there the last thing\nSaid you did have\nBombs\nWhy stay in the ... thing that we\nSo they do with it is\nTo\nCasting from the fringe of under current and from envy one stations like to deal GM Dillingham, Alaska Andrew radio Phoenix in Phoenix, Arizona and this is needed before he swam the Native American radio broadcasting\nFrom the campus of Arizona western college this this border radio at Thirteen twenty am ... and border radio easy dot org we also broadcasts an Arizona community radio network at eighty nine point five FM kj ... Williams\nPoint one F. M. K. J. C. P. press get Ninety point seven ... kj decay Kingman and Ninety One point three of them in Flagstaff\nSunny skies in Kingman today hind you're sixty seven degree it's mostly clear in the evening with the Loeb around forty four in Prescott mostly sunny a hundred and fifty five partly cloudy in the evening with the low rent thirty six in Flagstaff mostly sunny a high near forty five today twenty percent chance of snow showers in the evening was partly cloudy skies Milo around twenty eight\nAnd humid today it's sunny skies hind you're Seventy seven a bit windy outside gets up to thirty miles per hour from the north mostly clear skies in the evening with a low up around sixty one degrees and those cuts will continue into the evening\n\nAlright it's under current some ... welcome really excited about all the music coming up this hour and hope you'll be able to stick around enjoy it elephant revival Daniel rate listen night sweats\nUnknown mortal orchestra the mavericks and much more right now just Kurt Vile bison nice long track from his new what bottle idea it's backwards [noise] [noise]\nWas far away\nI was on the ground\nLooking into summer\nBecause there wasn't no\nEarning feeling in my chest to all of a long line on watch by who will just\nTo when will the sun's reborn\nVery deep within the psyche of mine so\nThere is the is within the ... so\nI was on the radio talk now with a friend of mine\nA new format because well we like to lack that was that I have learned\nWay out of mind\nWas far away\n\nOr\nAnd\nSo our Sheila now with\nSo I was on the ground saying this planet\nBut out of so\nWent bad was Sammy\n\n[noise] [noise]\n[noise]\n[laughter]\n\n\n\n\n... in the ... pretty\n... ... ... ... [noise]\n...\nBut elsewhere Donilon\nKnow I Know\n\nNinety point seven F. M. K. J. C. K. Kingman in Ninety One point three ... staff\nIn you know Sonny highest near Seventy eight north when twenty to twenty five miles per hour today\nIt's not clear those around fifty nine England sunny I hear sixty four today tonight mostly clear those around forty four in Prescott sunny skies in a high a fifty four today scattered showers tonight low around thirty eight in Flagstaff\nMostly sunny high near forty two today and tonight it's no showers likely low around thirty one degree\n\nAlready to tend to curb some great ... welcome bought a great music coming up this hour we'll be able to stick around check it out from Susan to death ski Walter Martin Roderick mirror ball Buffy ... Marie Lu drive\nAnd let's get right to know with a little bit of a couple of weeks in sitar this dog yeah we can't think of the ... uh\n\n\n\nAnd now\nNow\nUm\n... a\nOr a\nA ... um\n\nYeah\nUm [noise]\nThink about ...\n\nWe're being in\n... you know most of my ... and you eat your outlook on\nLife without them\nYou know most of my ... thing in the mountains and all but I'm\nLike no about last night's outcome\nWas trying to get on one met earlier they don't want to trust someone\nThat we should try to shoot I'll stay in the\n...\nSomeone trying to get on well\nYou don't want to trust someone\nThen and then what\nOn the ground oh\nWell good to know\nThat you do go through\n\n\nDa\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n\nMm\nMm Mm\nMm\nMm\nMm\nMm\nMm\n\n...\n... ... ...\n... ...\n...\nHunting party from Robert Mira ... Patel Pueblo the album his house tales should run under current\nHelium sequence historic resembling before that and okay go always good to see them every once in a while thinking about their incredible video if you've never seen before\n\nDa\nDa da da\n\nDa\n\n\n\nDa\n\n\n\n\n[noise]\nWhat are the dog by\n\n\n... ... ... ... ... ... ... [noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\nChurch\n...\n[noise]\n\nNice extend a gym there from I'm freezing McGee\nFrom the two thousand six of them see the numbers ocean Billy Oprah's Mickey an undercurrent Walter Martin with down but at the scene see anyone else would you do your job your belt though it's been getting together with the girl from Wendy my\nHope you're enjoying the music can be just to welcome it's undercurrents Susan desk you store here in the new Paul McCartney pursues the leaders from my low green Mrs ...\n[noise]\nNo but I Will say is a danger in a\nCan change it used to live\nIssue that you could be the last one\n[noise]\n[noise] or you know I don't think\nBut you could you\nBe if I\nCan be you know he could be the last ones\nTo do a\n[noise]\nWe also broadcast on the Arizona community radio network eighty nine point five ... kj the age ... Williams Ninety point one F than Jay Jay Z Prescott Ninety ... Jay Jay Z cake Kingman and Ninety One point three ... ...\nIn Prescott sunny today I near fifty four east north east wind aid to sixteen miles per hour tomorrow scattered showers near fifty degrees ... mostly sunny today I to forty two\nTomorrow snow showers likely in Ohio forty Kingman sunny today I near sixty four tomorrow chance of showers in a high near sixty four and you must sunny in a high near Seventy eight today and tomorrow sunny skies with a high near Seventy eight degrees\n\nOutrageous undercurrents I'm Craig me Ficre welcome good to be with you and got a big basket music for a year from Marvin Gaye outcast a milk carton kids happy Robert ... so much more right now for ... ... ...\nOh sure no good excuse me Robert change so much more right now for ... this is the magic hour\n\n\n\nWhich can\nThat's another thing\n\n[noise] [noise]\nMm the\nNo ...\nA small\nWho are in the ...\nNo\n\n\n\n\n\n...\nLa la\n[noise] [noise]\n[laughter] yeah [noise] that's\n\nThanks for listening to K O F thank you my Thirteen twenty or yum and border radio easy dot org service Arizona western college we also broadcast on the Arizona community radio network at eighty nine point five FM K Jay Z a drink Williams Ninety point when I think Kay GDP Prescott\nMany point seven FM kj the cake Kingman and Ninety One point three of them black stuff\nIn Yuma sunny heights near Seventy eight north when twenty to twenty five miles per hour today it's not clear those around fifty nine Kingman sunny I near sixty four today tonight mostly clear\nThose around forty four in Prescott sunny skies in a high a fifty four today scattered showers tonight low around thirty eight in Flagstaff\nMostly sunny high near forty two today and tonight it's no showers likely low around thirty one degree\n\nOh right it's under current from Craig ... well ... got a few special things coming up this hour for mockery bell Leonard Cohen shit or be Hancock\nCleveland Ali Al Gore right now let's get going what's the new one from fantastic ... push back\n\n\nIncense\nWe so cold and so\n[noise]\n[noise]\nYeah that's trying to build\nI mean and the president [noise]\nI [noise]\n[noise]\n[noise]\nAnd the\n\nMade\nThe\nDay\nAre a man named\n\nOver\nLast\n\nFor a\n\n\n[noise]\nLet me be\nDa\nDa da da da dum\n\n\nA baby on on a\nDa da da\nDa da\n\n\nDi di di\nTime\nLike the red white and I know to get it and get the\nDone although no no and I keep it\nKeep an eye on\nI Do want to\nGet by on the\nThat [noise]\n[noise] [noise]\n[noise] [noise]\nOn your door\nDoing a good\nKnow it yeah\nThe huge\n\nA busy time was\nI was down in the way\nBonding\nI\nDo you [noise]\nA ... year old law amalgam age I don't\nIt was a boy or\nFrom what you needed through\nSome sort of the big on who\nYou know being the and\nThe more than\nGive you ... you know\nYour own and Missouri Columbia had\nThrough a a\n[noise]\nThat's a ...\nIs how do the same as\nWho drew you\nA\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\nOn the mark ...\nKind of victory monitors\nOr ... or a they\nCardio or\nDo you\nA NATO or\nWhole lot of lord of the song\n'cause I don't\nSpa\nRobert Mugabe\nThroughout the\n\n\nA joke and so you know ... ...\n... more than we do ... ... ...\n...\nShe ...\nAbout books we love the ... ... ...\n... ... ...\n... ...\n... ...\n\n...\n...\n...\n...\n...\n\n\n... ... ...\nSaid oh\nWe angel\nOh\nGod yeah\n\nI'm On\nThe right\nTo ... ...\n... ... ...\n... against the ...\nWhen I Do that on some me you\nKnow to\nCheck well yeah you're going to be ... ... ... only ... you know no no\nNo\nNo no\nNo no\nNo\nHe\n... ... ...\n\n...\n...\n...\n...\n...\n... ... ...\n...\n...\n...\n... ...\n... ah\nI ... through the ...\n... ... ...\n... ... ... uh\n\n... no\n... Mm\nMm Mm\n\n\nTerms avoid the great Charles boy and the more votes plus ... Williams I sent her record long long time ago cold\nIs it cold blooded yeah lucky by Charles watch live somewhere angel and they just want to hear from vanished gr stroll Lloyd marvel\nMm Mm\n\n\nChina's Lloyd the great Charles line and marvels plus Lucy Williams they're nice to have a record a long long time ago called\nWas a cold blooded yeah love ya bye Charles Lloyd lived at the Fillmore angel the name of this one ... from vanished garden Cho Lloyd marvels Williams' big red machine him not stick\nAnd it was ... Miller validated ... Miller six nations mohawk\nAnd Neil Young and crazy horse from psychedelic pill twisted road but what is a twisted wrote isn't it twisted road checkered past\nThat we're having fun along the way something really interesting coming up from mark repo and I'm Steve Earle and Tift Merritt altogether that's coming up but first punch brother Swiss jumbo this is the latest\nWhen it comes on but with the phone and it's been it's been awhile since you've seen the real may go down the fan last in the the free sure the guy to inhale the star witness grandpa Bernie and his daddy dart that you want to do it but then you have to feed it high\nThing to be you know the people\nWho own guns on but we do not than a tan and another thing to do is go to Pam go from being on the bad as the land\nBased in to see the ... like a George in the dark on the door to still do the city particularly and you don't buy some of the ... you know\nAgain\nA lot of time with the\nThe bat had I'm fairly young\nI'm I'm\nWinning\nIn big good on its you know\nSome of the China\n\nWhen a jumbo\n... the\n[noise]\n\nStay on the other hand I'm asking\nWell stay in the ... the main thing that you know\nSo you were there\nWas\nTo deal GM Dillingham, Alaska\nAndrew radio Phoenix in Phoenix, Arizona and this is needed voice why\nThe Native American radio network\nBroadcasting from the campus of Arizona west in college is border radio Thirteen twenty eight ... radio ac dot org\nWe also broadcasts an Arizona community radio network at eighty nine point five ... age ... Williams Ninety ... Ninety point seven ... in Ninety One point three ... staff\nIn Prescott sunny today in your fifty four east north east wind aid to sixteen miles per hour tomorrow scattered showers near fifty degrees Flagstaff mostly sunny today eyes of forty two\nTomorrow snow showers likely in a high of forty Kingman sunny today near sixty four tomorrow chance of showers in a high near sixty four and you must sunny and near Seventy eight today\nAnd tomorrow sunny skies with a high near Seventy eight degrees\n\nAll right it's under current some great vicar welcome really excited about all the music coming up this hour hope you'll be able to stick around enjoy it health and revival Daniel rate listened the night sweats\nUnknown mortal orchestra the mavericks and much more right now just cook vile bison nice long track from his new what bottle it in its best sack words\nWas far away\nI was on the ground\nFar away\nI was on the ground\nLooking into some\nFor because there was a known\nAnd feeling in my chest the people of all alone and um watch five will this time\nTo when will the sons we bombed\nBuried the within the ... so\nI was on the radio talk now with a friend of mine [noise]\nNo format because well we\nWay out of mind\nWas far away\n\n\n\n\n\nSo ours Sheila now Bush with\nSo I was on the ground say good planet but out so\nTo the bone in green\nWent bad was Sammy\n\n[noise] [noise]\n[noise]\n[laughter]\nAnd so on\n... ... ... in the ... county\n... [noise] [noise]\nMm\nBetter stripped down\nKnow I Know\n\n\nAre ...\nNo English law and order Lori L.\nWe will no one day the trail\nAnd learning to read the stars\nA cold you chose\n\nHi this is Dana Rodriguez and this is Bonnie pain Bible and you're listening to under current [laughter]\n[noise]\nIn God\nHe's going to see where\nIt will not do\nLong does it mean\nIn God\nHe's going to say where does\nIt go for\n... [noise]\nBut maybe in time and they're sharing time then then the thing of the day when a\nSome of them in\nThe back home then why do\nThe uh the any [noise]\nIn some\nAnd like the bar and\nIn memory in\nThere was that when they go\nHe's gone into what how does this guy and\nThe\nI think in a ...\n\nElephant revival remembering a beginning distinctive lovely voice of bunny remembering a beginning oh survival from these changing sky knock on wood medicine for the people with backbone before that from ... and was back with dream\nThe ... I've been in the last\n\nAllison revival remembering there'll be guinea distinctive lovely voice of bunny there remembering a beginning with our Bible from these changing sky knock on wood medicine for the people with backbone before that from ... and was back with dream\nYou know in tune to fund the current agreement sicker and I just got to be cool to do something about the harvest moon so let's start with the group that always put out its albums in the fall\nRight now are just on and it just always fits here's the band ... across the great divide\nRight man\nJust\n[noise]\n[noise]\n", "year": "2018", "show_name": "UnderCurrents", "city": "Yuma", "day": "15"}