{"month": "10", "state": "GA", "station": "WSB", "content": "[noise]\n\n... how\nYou know bringing weather and traffic you depend\nDoor you know you asked me radio waves until the latest WSBIU more traffic on on demand when\nLive coverage on the people you\nDepend on the radio I downloaded out the door\nAnd go play [laughter] morning workout\nI'm busy I hate it when I miss white and Jamie brain\nWhen storms and we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the double USB radiolab piece all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now that don't have the radio ads downloaded out in the store and get it on my [noise]\nUs be broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and I hard here the game as\nBulldog talk on these ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the programming continues here at a later our normal and on it [noise]\n\n\n\n\n... power\nBe bringing weather and traffic you demand on now on W. W. F. B. radio I listen to the latest WNBA new more traffic on on demand and wait\nIn line continuing coverage of people you\nDepend on the radio I downloaded out in the outdoors\nNow what you ask me is broadcasting University of Georgia sports on not buy buy them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on ... about them on your radio and on AM seven fifty U. S. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nI'm busy I hate it when I this late and James brain when storms and will is power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their\nTheir latest news in traffic on demand is always severe weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out of the store\n[noise]\nNow when you asked me a broadcasting University of Georgia board or not he bought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com and and I hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal pinned on it [noise]\n\n\n\n\nYeah I'm a junkie here on the road a ... hour\nBe bringing weather and traffic you know no harm us\nDo you ever do you ask me radio I listen to the latest WSBIU more traffic on on demand way\nAlive continuing coverage on the news people you\nDepend on the radio I downloaded out the door\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and Jamie free\nAnd when they stormed the Willis Tower one\nGuy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates all their their latest news in traffic on demand is always severe weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now that don't you have the radio I downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\nI'm a junkie here on the road and ... how\nYou know bringing weather and traffic you've and on now on\nW. W. F. B. radio waves and to the latest WSBIU more traffic on on demand way\nLive coverage from the people you\nDepend on the radio I downloaded out in the outdoors\nThat what you asked me is broadcasting University of Georgia sports on\nBy by them at a um seven fifty due to broadcast restrictions we cannot alter the UGA exports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nI'm busy I hate it when I this late and Jamie brain when storms and released power would be\nThe guy you know you can listen to W. S. B. S.\n\n\n\n\n\n\n\n\n\n\n\n\nI'm a junkie for my family on the road a ... hour\nYou know breaking weather and traffic you've and\nNow on your\nDoor you ever do you have the radio I listen to the latest WSBIU more traffic on on demand where\nAlive continuing\nCoverage of people you depend on the radio out downloaded out the\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss late and James brain when it's warm than we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their\nTheir latest news and traffic on demand is always severe weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and they'll play [noise]\nThat when you ask me is broadcasting University of Georgia sports on\nThe part by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... him on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\n... hour\nCan you know breaking\nWeather and traffic you'd have an aunt now\nDo you ever do you have the radio I listen to the latest WSBIU more traffic on on demand when\nLive\nCoverage people you depend on the radio I downloaded\nUs be broadcasting University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty you asked me W at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] [noise] morning workout\nBusy I hate it when I miss white and Jamie breed and when they stormed than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news out your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and play [noise]\nThat what you asked me a broadcasting University of Georgia sports on TV by by them at a um seven fifty to broadcast restrictions we cannot operate the UGA sports presentation on and then when you asked me radio up or through W. S. B. radio dot\nCom tune in and buy hard here the game and bulldog talk on music ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nOn ... how\nBe breaking weather and traffic either end on now on your\nDoor you have do you ask the radio I listen to the latest ws meaning more traffic on on demand and when\nListen live coverage of people you depend\nOn the radio out download it out and the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss ... and James brain when storms and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading not happening right now do you have the radio ads downloaded out in the store and they don't play [noise]\nWhat you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and I hard here the game as bulldog talk on music\nBe you know breaking news weather and traffic you demand on on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand and wait\nA live coverage on the news people you depend on the radio ads downloaded out in the outdoors\n\nI'm busy I hate it when I miss white and Jamie brain when it's warm than we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out in the dark\n[noise]\nThat what you ask me is broadcasting University of Georgia by ...\nBy ... am seven fifty broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north through ws the radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nCan you know breaking weather and traffic you've and on now on your\nDoor you had to do when you ask me radio I listen to the latest WSBIU more traffic on on demand\nLive coverage from people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and buy hard here the game a bulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. at the program and continues here at a later our as normal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nA busy I hate it when I this white and Jamie breed when they stormed the Willis Tower one\nGuy you know you can listen to W. S. B. anytime anywhere with the devil USB relapse piece all their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio and downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to bring me on the road ... powerful\nI can hear breaking\nWeather and traffic you demand on now on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand for\nListen live coverage on the people you depend on the radio I downloaded out in the outdoors\n\nI'm busy I hate it when I this white and James and brain when storms and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the fear weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now the WWE and the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at\nAll do talk to me it's not he bought by them on your radio and on AM seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\nBe breaking news weather and traffic you demand on now on\nW. W. F. B. radio until the latest WSBIU hoard traffic on demand and\nLive coverage of people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty deliberate gap restrictions we cannot operate the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on\nThese ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n[noise]\n\n\nBusy I hate it when I this white and Jamie breed when storms and we lose power\nWhen the guy you know you can listen to W. S. P. anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out in the store\n[noise]\nThat what you asked me a broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com and and I hard here the game as\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nI'm a junkie for my family on the road ... how\nBe breaking weather and traffic you'd have an aunt now on your\nAnd know upgrade due to their best tenure tank warranty from the price of a six year warranty saved about three hundred dollars\nMr plumber includes a new ... new ball valve and super strong gas lines the official plumbers of my home but said show my water heater heroes\nMr plumber schools back in the kids are getting the pop quiz questions\nWell you might have financial questions Doug Turnbull here you may ask can we afford a bigger home or what's the best way to save for my next vacation or should I lease or buy a car or what have you have questions about saving spending or anything in between bank of America's experience financial specialists are here for you\nProbably serving Atlanta scheduled appointment at bank of America dot com slash conversation go ahead do it now start the conversation\nThe following message for monster contains multiple uses of the F word you may not be suitable for younger audiences and those easily offended\nFree it's a bad word that a lot of job sites use and it's creating a lot of noise you know those sites they tell you a free posting we'll get your small business qualified candidates and then the candidates you get aren't the candidates you want so they aren't free because you end up paying\nA lot or are there are those other sites where you post your job in the same environment as someone selling a human sized hamster wheel or were qualified candidates can't find you because you're jump hosts gets married really quickly way deep down at the bottom of the site\nPosting your job on monster means you don't have to post on those sites because we don't do any of those things we deliver candidates and qualified once monsters job posting started just forty nine dollars no hidden fees no relevant Kennett matches now having to re posted for ten minutes only the candidates you want delivered easily at a fixed affordable and honest price\nVisit monster dot com slash radio to learn more and cut through the noise\nIs offered at well put simply\nWe're your online homebuyer offered had in the modern homes selling ... with the person I keep in touch that read these to get on the traditional had a we buy your home when you see you can move forward them\nMoment you're ready we've had the pleasure of helping founded them happy home sellers we'd love to help you getting your and it is moving to offer pat dot com it's your basic information about your home and the next day when you agreed offered it green and there's no obligation\nMy an average had the better way to meet any like traditional selling can't compete and control very honored pad means no showing you pick your ... and ... even moving locally for free we have a Ninety four percent satisfaction scores ends at a lesbian EBE reading\nReading it truly is a better way they're thinking about where you want to live and they can get excited about making that knew when ... you're still go to other bad outcome ... just offered today for bed freely [noise]\nGarbled W veal sound another travel advisory out of the ... freeway the latest problem in the rye lay there and what he was for it and wrote acted exit forty four\nOf the brakes still before they find the trouble nearly wrote and again got sunshine believe it when he was starting to revive what are you still struggling for the ride forgets where downtown five volume\nStill filled in eighty five out they don't pass a four hundred and Seventy five out there and you're filling in for North side driving stack and back from seventeenth street down pat I twenty two Abernathy north on delays from my twenty up to north avenue Doug\nPay devised out is clean and green or Seventy five shout them filthy that read it five Seventy five north written regarding I'd still say seven minutes before we one\nFifty five extra food they have their job to go road I just wanted to traffic everything but it was a break all weekend long ago the triple the travelers that W. S. B. [noise]\nIs fifty\nFour after the our we've got an entire hour to go I'll bring you the Susan Collins speech which she had to stay on the floor of the Senate some people reacting they clearly never heard Susan going speak before yeah that was her\nWe'll delve into all of that when we come back right now let's go back to the phones Franklin incoming your next welcome\nGood to talk to you again my friend I have a great example a liberal policies fixing liberal policies shore you realize this week California state said pass a law that any company based in California has to have at least one female member on their board yeah\nSo how'd you get around that\nDon't incorporate in California\nWell that's one way but if you're there you just asked around the dress every last this way you're going to go yet a dime identified as a female outlets nickel dress well past that allow that everything's good yeah that was helping levels\nI yes listed I I think that that is actually a really good idea they can have one nice group they put on and identify for a month is as a woman in the you know they can even say we're teaching people how to walk in someone else's shoes perfectly ideal\nWhat other contradiction I discovered this morning my men's Bible study which will appreciate which was if I'm born this way right a state of the L. D. C. J. community but I'm fluid and my ... am I going to sweat a lot of fluidity uh-huh right\nYeah ... listen to this is this is the ongoing contradiction there of of our ... you were born here three but you get to pick whether you're a male or female it's\nAnd huh yeah [laughter] it's the contradictions listen I mean this is the same thing though the the believable women were supposed to believe all women but screw you Susan Collins I'm listening to all women no no but don't you Susan Collins\nBelievable women except not be the wheel and Kaiser who said she didn't know where capital and didn't know anything about it do believe the sixty four class should childhood fringe Brett Kavanaugh said this was the guy that you know or believe all women but don't believe these women don't under\nThe contradictions right themselves and all of this it is the logic of an insane asylum\nAnd that's where we're headed with this now when we come back Susan Collins she took to the floor she said she's going to vote for it capital want you to listen to some of her speech and how's this going to affect the Georgia elections will break that down and take your calls when we come back right here on WSBIU [laughter]\n\nI was just up in Charlotte and I saw some bad race cars going fast Doug Turnbull here and they were trying out a road course for the first time I mean that just set those cars that they had to be versatile let me tell you about versatility Chevrolet\nThey're the only brand to earn JD power dependability awards across cars trucks and SUVs means well just about everything there Jan and they've done it three years in a row they are the only brand to do that three years in a row let me say it again it's why they're great and it's why I trust Chevy\nDads pumpkin times and bad news and he's having huge selection of everybody's favorite going up your front porch had they season with tons of airline pumpkins anti catching shape than probably like beach sounds that red white and gray\nGreens plus get classic orange pumpkin for Jack o' lanterns and pine gay companies many medium cross incompetent as you can carry like Nineteen Ninety nine and digging out\nRight now is that perfect kind of plant\nTemperatures combined with a warm soil samples are playing and make it easy for the ground ... Mars nightmare say that the ... election of trees and shrubs give give\nVarious looming chameleon Japanese maples handler and hearing these trees in shots but I say you can plant with confidence in any professional how could they get hurt by the time to get on our plants landscape nursery signing with I\nA lot of games and play and and the\nAll men have by ... let you down if you suffer from any type of Iraq\nThere's ... disease regardless of your age your medical history the doctors in Atlanta health clinic and help you now be a lot of health clinic has the U.S patented device to help you get your sex life back\nOthers may claim a patented program but they still use the same old on patented technology you can trust the doctors at Atlanta\nHealth clinic we have the new its revolutionary treatment from Europe utilizing advanced acoustic wave technology we're delivering unprecedented results using US patent it and the FDA cleared medical device that regenerate blood vessels and a reptile tissue was short in office sessions and it's all done with no pain\nNo needles no surgery and no medication Gulf War a consultation today called for all for eight nine one six nine nine zero best for oh four eight nine one six nine nine zero called the trusted leader in Atlanta today and get your sex life back\nWith the Atlanta health clinic called for all for eight nine one six nine nine zero or visit our website at Atlanta health clinic dot com\nBubble you asked me about ... er Cox media group station [noise]\nTwenty four hour news whether an from\nFive and I am\n\nNow seven o'clock on friday evening I'm Sheryl Castro live in the ws the twenty four hour a new center with W S P ... story this hour has all but certain now the judge Brett Kavanaugh is less\nThan twenty four hours away from being confirmed as the new Supreme Court justice pre two point oh\nI'm Jamie do pre in Washington President Trump's nominee for the Supreme Court is on his way to victory in the U.S Senate\nI Will vote chicken for judge Kaplan Senator Susan\nCollins of Maine backing Kavanaugh along with Democrat Joe Manchin from West Virginia\nI think everyone everyone labor everybody\nFinal vote is expected on Saturday afternoon as Republicans and the White House are poised for a major Supreme Court victory\nSarah Palin suggesting she could mount a primary challenge against the last ... Senator Lisa Murkowski if she opposes Kavanaugh's nomination\nAnd it's we today pale and wrote quote hey Lisa Murkowski I can see twenty twenty two from my house that's ear Murkowski is up next for reelection drive now Mike shields and the ws me twenty four hour traffic center ...\nNo one else thought it was very good everyone thought it was was kind of a week that I talked to even among the Senate\nOr senators that they didn't think it was great but they all knew that you know his performance last Thursday he he really wanted to show he was it was that he wanted to to to make sure when you but he also needed to show the president that he was willing to fight for himself but he did this op ed today was about Jeff Flake or here's a little more Susan Collins from or for speech\nThat prints and then it has since relevant to the advice and consent ... ... ... nominees otherwise think censor a rat\nI worry that parent and if ... percent can lead to a lack of public faith and the judiciary and with these huge damage has a confirmation process living fall away\nSome of the allegations levied against judge Kavanaugh illustrate why her sense of innocence is so important\nYes I've been making the case for the last forty eight hours you you know so\nThe reason Democrats begin to pound the drum on the perjury stuff\nIs because they heard the little buzzing around the Senate that there were senators who were rather concern\nAbout did she perjured himself I knew that flake\nAnd Collins we're concerned about the due process issues because colleagues that there's where their friends knew that they were concerned about this issue\nI've spent a lot of time or the last forty eight Seventy two hours writing about first principles must Trump the idea of believe all women\nAre that we in this country we we believe that people are presumed innocent until proven guilty and even under federal law you know the Democrats say this isn't a this is just a job interview but even federal law says that any job interview and a person accused of a crime must be given the presumption of innocence\n\nAnd the Democrats it when you do that for capital and then they want to design him his due process they they want it to deny him the right to a fair hearing that included a how will allow him to confront his accuser\n\nAnd that was deeply persuasive and then just to be on the safe side Jeff Flake\nGod Bless him you know there are a lot of people don't like Jeff Flake ... and I've been very critical of Jeff Flake very critical I I was happy to see someone challenge him as a in a Republican primary I supported him strongly for the Senate he was a club for growth picking a hundred percent club for growth record and then grew in office once he got in the Senate and had six years\nAnd\n... there was constitutionally principled\nI may have disagreed with him collaborating with with some of the student leadership on the growth of government after many years of being a small government club for growth guy but he is constitutionally principled I always has been constitutionally principled\nAnd\nThat really matters here\nHe was not going to allow an innocent man to go down for something where he was falsely accused and the FBI report fairly well convinced the senator she was being falsely accused the FBI report\nShowed that Leland Kaiser had been pressured to change your testimony I'm told there are other pretty damning accusations within the FBI report about uh the level of coordination among the Democrats noticed the Democrats are not pushing for the report to be released you had to remember Spartacus far to kiss\nYou you had Cory ... who say I'm going to release this I'm not allowed releases say this and this is the closest I I'm getting the Spartacus or whatever\nHe's not releasing the FBI report why would they not released the FBI report ... why why would the Democrats\nWho were convinced that it would ruin Kavanaugh why were they not releasing the Afghan unless it makes them look bad\nBeyond what the Wall Street journal is reporting that one of Christine Blasey Ford's friends who happens to work for a Chuck Schumer associate pressured Leland Kaiser into changing her testimony burned in Roswell where you go back to the phones your next welcome\nHi thanks for taking my call I enjoy your show thank you so I heard something last week about um if Kavanaugh is confirmed that Hank Johnson is pledging to investigate his background yes\nI was just wondering how I'm Kevin I was going to hold up to questioning by ... Johnson\nWell in what he's going to do is he's going to threaten to stand on the side of the room where the biggest crowd is and flip the room upside\nDown [laughter]\nI mean that's what I Would do if I were held [laughter] for\nThose who have no idea what Britain and are about to hang Johnson believe that we would put so many people on the island of Guam it would literally flip over\nGosh yeah listen so if if if the Democrats take back Congress I'm using Johnson will be a committee chairman and they intend to\nAnd now here's here's what's so interesting this is a very interesting point by the way the phone number for all for eight seven to zero seven five zero one eight hundred\nW. S. B. talk the the interesting point here is that we have a lot of Supreme Court precedent on executive a privilege\nAnd you can't be dragging up the president to Congress to to answer Congress has questions I think ... we've never had a situation where Congress has wanted to harass the Supreme Court just\nAnd I think we will find there's a judicial privilege here that you can't dragged Supreme Court members before the United States House of representatives for\nQuestioning me even if there's an impeachment trial he doesn't Aaron impeachment uh investigation he doesn't have to show up and see here's the other thing I I'm fairly confident at this point\nThat if the Democrats do take back the house it's not going to be as big a margin as we were looking at a month ago\nAnd the reason is not going to be as big a margin as we were looking at a month ago is because the Republican base to suddenly infuriated by the Democrats and as they continue to go down the road beating the drum of impeach beach beach beach I think it's only wish for the Democrats\nAnd you're not going to have some of these Democrats in mid western states on the impeach uh Brett Kavanaugh bandwagon\nRiver back in the sixties there were billboards across the south the city impeach Earl Warren you couldn't get the Congress to impeach Earl Warren I don't think you're going to get Congress to impeach break capital and the fact that the Democrats want to turn it into a campaign issue is brilliant for the Republicans brilliant for the Republicans\nIn addition to saying they want to impeach Trump they went to impeach bright capital it gives the Republicans ... headed into November that the Democrats will stop at nothing to destroy everything\nAnd it will keep Republicans in the game it will keep Republicans fired up it will keep them engaged it will keep them willing to go to the ballot box to stop the Democrats\nAnd I think the Democrats will be able to get it back because it's just redistricting in Pennsylvania the way California shaping up a New York as well some of these liberal states but they're not going to have the margin that they thought it would be a narrow win\nIf they are even they will do it now but the tide has turned against him and I think it is imported to state over and over and over the reason the tide has turned against them\nIs because they overplayed their hands on Brett Kavanaugh accusing an innocent man of rape doesn't play well with moms and dads who see their son it could happen to him\n[noise] Atlanta's evening news very Gary\nNews militias accurate than be federal five day forecast for the same traffic every six minutes do you pass me [noise]\n... the glory carrier W. B. twenty four hour travels and air travel advisory fold and kill you look at why W a speech sham camp June ... guy twenty east bound and made a nursery exit the district a cult and delays in the area also another travel advisory and go in that county highway three sixteen westbound\nAt cedars late all lanes wide right there due to an injury crashes highway twenty nine\nAs your alternate still checking the don't tell connector\nHeavy volume south down from Seventy three down to twenty north down to lay started I twenty and you as you make your way up to north avenue this report brought you buy American Signature furniture hurry to American Signature furniture your new reclining destination they have just a spot for you to kick back again days or any day\nShopping American seniors your furniture today it at a U.S furniture dot com or Mike shields ... us be\nThe soundtrack of Georgia football's on doubled you asked me\nAnd my dogs are five and oh every\nPlay every store every game when the most of it off scot hour\nPlus in depth analysis all week from UGA largest Kevin butler and Arabs are\nWe're not playing at our very best for when you go out and win thirty eight to twelve you've got to feel OK about\nGeorgia Vanderbilt Saturday tailgate where he's already take all seven thirty on the home of dogs do when you asked me\nOut of ... ... email or phone you to help you stay informed whenever there's an outage just log on to your account and following easy steps to set them up to matter where you are you'll know when there's a problem I Know that George power is on it to get power back on started George power dot com slash store replacing your heating\nAnd cooling system is expensive there we've said\nWe have seen too many homeowners save money into systems they just need to be replaced Daniel J for reliable heating and air that's why we're proud to offer comfort is a service programs to let you get a new trend comfort system with nothing down\nSomething big change so [noise]\nThat means even if Murkowski does not bode with her Party Republicans appear to have enough votes to confirm Kavanaugh Margaret Willard ABC News\nWhite Chicago police officer Jason Van Dyke has been found guilty of second degree murder and the twenty fourteenth shooting death of black teenager ... McDonald reaction now from activists Jetta Diaa brown outside the courthouse ... as a black\nAs a psychiatrist one as Illinois and and as a as a man and not offensive America we never get to say that I\nWas also found guilty of sixteen counts of aggravated battery with a weapon he was found not guilty of official misconduct and top county closure today for a woman whose family was murdered right in front of her thirty\nTwo years ago oh dear Reynolds says it happened at a public housing complex scenario to back in Nineteen eighty six some of the\nOfficers said it was one of the worst crime scenes that ever see\nForty year old Sharon ... Thirteen year old daughter Samantha had been brutally beaten and raped and the knife to death and all the while Sharon's three year old daughter brandy watch I've had nightmares and everything\nElse for years faced with irrefutable DNA evidence sixty three year old Ronald ... pled guilty to rape and murder charges you will now spend the rest of his life in prison Pete combs WSBIU\nThe country's biggest mattress retailer is going bust mattress from filing for bankruptcy and we'll close up to seven hundred stores around the country the company's reporting more than a billion dollars in liabilities ws me noose on seven thirty two\nHearings are over the investigations are complete no very Kevin out confirmation comes to us the same boat\nAnd on breaking news coverage hand in depth analysis from your study by five AM's seven fifty to what do you have the\nVotes as Monica ... appears in here for cats deal at home you never accept that can choice standard or mediocre you want to bet no waiting no short cuts no excuses why you have\nTo call ... deal to upgrade your heating system this month before the cold really sets in the day to get your news state\nOf the arts systems the next day\nSale including up to twelve year industry leading warranty than sixteen hundred dollars a manufacturer rebates and did you know October is the best month to upgrade your home heating not only do you get ten deal than rebates warranties but you also will be ready for the cold snap the instead it happens\nThat feels highly trained at first tech upgrade to comfort with a system that does to home and your wallet that more than ... it's the best\nDon't wait 'til schedule is filling up bad for\nThe best service misses me Monica when you've got seven seven zero cats deal\nThe cat the L. A. R. dot com did you know the state of Georgia you need a license to cut hair you need a license to give a massage but you do not need a license to be a roofer\n... think about that you need a license to cut hair to get massages but not to be a roofer you could literally go into business today and start ripping someone's roof off without a license so think about\nThe kind of roofers that are out there you want to avoid the roofers that don't know what they're doing there's over a thousand rivers in Georgia it's scary\nYou want the best when it comes to your roof that's my friends at Dr roof\nDr roof never cuts corners they never tried to finish in a day and convince you that it's what's best for you they never rush because that is how mistakes are made Dr roof treat your home like it's a patient and delivers the same care every time that you would expect for a member of your family\nDo not be fooled Dr roof they never cut corners\nThey knew Assad cat from the census gated fresh ground game hosted by a beam digital editor Megan trains ground game is a conversation with a fever hoarders him get off the top political issues around the country I had this year's midterm elections animal on Amazon casts\nOn ... you know me I'm you're not even noon house every day right here on WSBIU I'm here to say look out Alfa reta we are coming your way to the doctor and hours and I will be doing the show live from serving ... ... and\nMars and read a bar on friday it's free and open to everyone get more details that W S P radio dot com [noise]\nSeveral UNC news times seven thirty five Mike shields now in the ... must be twenty four hour traffic center anchor\nNews Sheryl all age now open twenty ... Daniel ... filthy and delays in the area ... troubled continues in that county travel advisory highway three sixteen westbound at cedars wrote all lanes continued be blocked their use highway twenty nine as your alternate\nGetting reports of traffic singles networking correctly five twenty five cent south down at rich wall parkway the ex into ritual parkway acted nine use caution in the area\nThis report is brought to you by the U.S forest Forest Service in the ... this week in a plug getting closer to nature can get you closer to your family to find a forest near as you go to discover the forest dot org I'm Mike shields ws be\nStarted polish with horseback riding to pump a forecast tonight mostly Claire low sixties seventies Seventy tomorrow mostly to partly sunny highs eighty seven Ninety One Sunday a mix of southern clouds high near eighty seven and on Monday a mix of southern clouds Heidi's six low sixty nine eighty\nThree degrees right now in peach tree street I'm Sheryl Castro news Ninety five and am seven fifty W once they depend on it\nHere tonight the lovely and counted Deborah green produces the show long ... stuck ask them on the other side of the takeout window low T Chuck screens your call\nLow T we're kicking off a very special\nEdition of movie Monday you know every Monday we like to discuss movies on the mark air show and never before\nHave we had an Academy Award winner in Studio to discuss movies with us I'm honored in a privilege\nTo introduce to the mark M. show audience Academy Award winner Lewis Gossett junior Mr ... welcome to show how are you sir thank you it was a pleasure to be here I'm I'm a beyond words how excited and to have you in Studio on movie Monday I'm this is awesome and uh what's awesome is why you're in Atlanta why you got got honored this afternoon what happens after\nThat things do you and I started thinking about ... my roots are from here I was born in New York but there'd be some arrests but down here in Georgia mhm um and uh I've I've raised the family back in California I'm originally from Brooklyn New York\nAnd then let me get legally Bedford ...\nConey Island Coney Island oh All right and they ... as you but you know you get this ... and the guys just work through buddy [laughter]\nTightened ... an is where is it into the toys that are on and say OK third avenue and thirty Thirty years old tightened type ... diabetes so I didn't totally totally yeah [laughter]\nSo you buy you some are down here in Georgia\nEvery summer me and my cousins would come down to the farm outside of ethics George ... very night as a parent to have a free summer so the good enjoy themselves making babies or whatever they do and we had to work the watermelon farms wow and me and my cousins one big cousin his he was enclosed his name is Robert gossip\nSo he's he's also then my first cousin ... and the only thing they told me when it first came here don't name the chicken\nDish never named the judge ... or the cows as we found out this morning on ... on and let the highways never daily cows either we can you would come back to the end of the some very ... very strongly that we'd we'd be the capital of the baseball and basketball teams how how much of a great food a difference was it was a just\nA ... in every aspect to go from Brooklyn New York to ...\n... ... in in in retrospect it was very healthy yeah and I said I didn't suffer any of the stuff because we are to farm yeah you know you know the only thing that got me it was a I was I was\nAttacked by last people [laughter] [laughter] I've been attacked by both Syria I run I Would hope that you get\nTo the ... and then it was it was my ... great grandfather got a tobacco juice mhm and put it on every stings a learned how to keep my ...\nI didn't know that you know that that none of their ... skills this thing's going back to science so tobacco guy conglomerates if you're listening you have a new sales pitch ...\nHave you on your gets done by well [laughter]\nUm I I mean obviously in ... in Iran or today by by some some really important people um what what was the or do you want today\nI got a lifetime achievement award from the city of Atlanta or some a lot of the old friends you know the Andrew Young and the John Lewis is and the\nUh some wonderful people in the mail whose father used to hang out with a New York ...\nAnd civil friends you know John Lewis I met them when I was young young and I came down and did some of the marching and instead of the hotel we were allowed to write down the street and the church should so I met them or you know with Harry and Harry Belafonte him in Sydney\nBut coming out of Brooklyn you know they they grand because a dog bit me in the leg and kicked him [laughter] and I'm also does somebody grabbed me by the color the next thing you know I was back in Brooklyn wow you know 'cause I didn't do much less it's properly yeah but uh the best news about America especially about Georgia\nIs the last to give up in the civil war the first the diversity there there are all these major studios in all all people from everywhere is going to come here to get those jobs and that the platform of having worked in the last couple of years has been outstanding\nIt's able truly become the Hollywood of the south it's it's it's much better yeah and I and I don't know if I'm I'm speaking\nThe roofers that don't know what they're doing there's over a thousand represent Georgia it's scary you want the best when it comes to your roof that's my friends at Dr roof\nDr roof never cuts corners they never tried to finish in a day and convince you that it's what's best for you they never", "year": "2018", "show_name": "The Mark Arum Show", "city": "Atlanta", "day": "05"}