{"month": "10", "state": "GA", "station": "WSB", "content": "And the radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty you asked me WFDD programming continues here at a later our as normal and on it [noise]\n\n\n\n\n[noise] morning workout\nA busy I hate it when I miss white and Jamie brain when it stormed our what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always the weather coverage what about when somebody has breaking news staff is your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty new to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on\nMs ... by them on your radio and on a um seven fifty W. S. B.\nW. at the programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\n... power that can be you know\nBreaking news weather and traffic either end on on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on on demand and\nLive coverage from the people you depend on the radio ads download it out in the outdoors\n\nI'm busy I hate it when I miss white and Jamie brain storms and released power\nWhat the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand it always severe weather coverage about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happened right now or do you have the radio ads downloaded out in the store and go play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on mute ... them on your radio and on AM seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal depend on it [noise]\n\n\n\n\n... is our\nCan you know breaking news\nWeather and traffic you have and on now on your cat\nDo you ever do you ask me radio waves until the latest WSBIU lord traffic on demand and waiting\nIn line continuing coverage of people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on not by by ... am seven fifty broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up\nNorth through W. S. B. radio dot com zoom in and buy hard here the game a bulldog talk on music ... them on your radio and on a um seven fifty you asked me WFDD programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\n[noise] [noise] morning workout\nA busy I hate it when I this white and Jamie breed when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB relapse piece of all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio and download it out on the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on he bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com Chilean and I hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie for my family on the road on ... hour\nBe breaking news weather and traffic you demand on on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic I long to ban when\nLive continuing coverage on the news people you depend on the radio out downloaded out in the outdoors\nAnd Google Play [laughter]\nI'm busy I hate it when I miss white and James\nStorms and we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always the weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nWSBIU broadcasting University of Georgia board or\nNot he bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the menu at the radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on music ... about them on your radio and on AM seven fifty W. S. B. W. at the program and continues here at a later our as\nNormal that can do that\n\n\n\n\nI'm a junkie Brubeck we're on the road on ... hours\nBreaking news weather and traffic you demand on now on your\nW. W. F. B. radio until the latest WSBIU more traffic on on demand and\nThem alive continuing coverage of people you depend on the radio I downloaded out the door\nWSBIU broadcasting University of Georgia board or\nNot he bought by them at a um seven fifty deliberate kept restrictions we cannot offer the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com and and I hard here the game as bulldog talk on\nNorth to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on music ... them on your radio and on AM seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\nBusy I hate it when I this white and Jamie breed when a storm didn't release power\nOne guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always severe weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio and download it out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north through W. S. B. radio dot com Sudan and I hard here the game a bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal that can do that [noise]\n\n\n\n\n... than we have\nBe bringing weather and traffic you demand on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand and wait\nIn line containment coverage of people you depend on the radio out downloaded out in the outdoors and Google Play [laughter]\nMorning workout\nI'm busy I hate it when I miss white and Jamie breed\nWhen a storm didn't release power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with the double USB relapse pizza all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now to do what do you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um\nSeven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north through W. S. B. radio dot com tune in and I hard here the game and\nBulldog talk on ... about them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nMy job to bring back the on the road ... powers\nBreaking news weather and traffic either end on now on your skin\nW. W. F. B. radio I listen to the latest WSBIU more traffic longer than an\nAllied continuing coverage of people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on the part by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on that when you asked me radio up north through W. S. B. radio dot com tune in and buy hard here the game at bulldog talk on\nThese ... about them on your radio and on AMC seven fifty U. S. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] [noise] morning workout\nA busy I hate it when I this latest James brain when it's warm than we leave power\nWould be like a guy you know you can with the WNBA anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store\n[noise]\nWhen you ask me is broadcasting University of Georgia board not buy buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on that\nNormal and all that [noise]\n\n\n\n\nBusy I hate it when I miss white and Jamie breed storms than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news yeah if you were stationed on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out on the app store\n[noise]\nNow what do you ask me is broadcasting University of Georgia board ...\nBuy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on that when you asked me radio up north through double USB radio dot com tune in and I hard here the game at\nBulldog talk on ... about them on your radio and on AMC seven fifty W. S. B. W. at the program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\n... how are\nThat can be bringing weather and traffic you've been going\nNow on your\nDoor you ever do you have the radio I listen to the latest WSBIU more traffic on on demand when\nLive coverage people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and Jamie breed and when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio and download it out in the store and we don't play [noise]\nThat what you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty to broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nMy job to bring back here on the road ... hours like I can hear\nBreaking weather and traffic you've and\nNow on\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand and wait\nIn line continuing coverage of the people you\nDepend on the radio ads download it now can they act\nThat what you asked me a broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty you ask me do when you add the programming\nContinues here at a later our\nNormal and on it [noise]\n\n\n\n\nI'm busy I hate it when I miss white and Jamie brain storms and we lose power what\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store\n[noise]\nNow when you asked me a broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on music ... about them on your radio and on AM seven fifty U. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\n... hour\nBe breaking weather and traffic you'd have an aunt now on your\nDo you ever do you ask the radio I listen to the latest WSBIU more traffic on on demand where\nAlive continuing coverage of people you\nDepend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this late in gym to train when it's warm than we lose power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark and play\n[noise]\nNow what you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty to broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... by them on your radio and on AM seven fifty W. S. B. W. at the programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nYou're at my job to be on the road ... power\nThat can be breaking news\nWeather and traffic you've and on now on your door you know you asked me radio I listen to the latest WSBIU more traffic on longer than an\nAllied continuing coverage of the whole you depend on the radio out download it now and they act\nNow with us be broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com student and I hard here the game as bulldog talk on these ... about them on your radio and on AM seven fifty when you ask me WFDD programming continues here at a later our\nNormal and all that [noise]\nHurry into American thing as your furniture you're near reclining destination they've got everything you need to relax recline and unwind shot that Americans in nature furniture today and ... ... s furniture dot com Jill Nelson ESP there\nComes a time and every home lifetime to replace your window symphony for Marvin fiber glass windows by north Georgia replacement windows have unlimited lifetime Morsi backed\nBy a company in business for over a hundred years still for life said last a lifetime these are not plastic sheets looking windows infinity from Marvin fiberglass when his complement the architecture of your home for year round beauty huge savings this month's limited time offer Atkins you windows dot com\n[noise]\nNah Monica appears in here for cadmium goes only cavities I gotta check out that the dentist ... small problems before things get painful and try to avoid uncomfortable winter cold I tune that my heater for fifty nine dollars with cats\nNeal their expert ... by little issues before they become you guessed it painful pricey and uncomfortable way for an emergency schedule your fifty nine dollars came up today and mentioned Monica seven seven zero Hatfield visit ...\nArea are you interested in making some extra cash\nBuying real estate tax lanes the real estate and tackling network is offering a free tax link yet that will show you how to use their simple three step formula and they're proprietary website to earn secured returns potentially up to twenty five percent it's so simple you could do this in your pajamas from the comfort of your own home just point click and start buying tax\nLiens right through their Web site anywhere in the U.S\nAnd they're completely secured by the government so if you're lucky to become a real estate investor without getting dirty fixing up\nHouses then call one eight hundred five seven zero five three three nights now to get your ... get than getting ready to buy tax liens for as low as a few hundred dollars working only part time call eight hundred five seven zero five three three nine right now to get your\nFree tax thing get plus two free tickets to a live training event which includes a free smart watch just for attending golly hundred\nFive seven zero five three three nine that's eight hundred five seven zero five three three nine for your free tax\nLink it now individual results Mayberry\n[noise] [noise] [noise]\n[noise]\n\nWell come back the bulls bears have it's a blast over to the head over to Facebook Like is that bowls of bears radio see some of the bloopers behind the scenes and some of the educational stuff yeah there's mostly bloopers [laughter] see what it's always\nLike to but you know uh the stuff that doesn't make the production is doubly does it is a worthy of making it productive legal has a lot of ... a lot of fun to go watch his head over there like us on Facebook a check in with us if you ever in the academy you know of the studios of ... we've got a lot going on so excited to have you listen to us and\nWe're really making a big social media push to try to get the word out\n... one of the things that we always talked about on Bowles embarrasses understand that the financial markets is not a game it's not a hobby\nIt uh it it can be a business they can pay as a business you know early we're talking about trading for income trading as a business truly setting us up where you can receive monthly income where you can get the tax deduction or you can do this where you can build your business for you and your family that's what I Want to talk about I Want to talk about how someone can utilize the market and trade as business\nWell let's talk about the American dream build a business land of opportunity is not the land of a secure job with benefits and the opportunity comes with people that take advantage of the free market and so there's a lot of ways to do that you can buy a franchise you could start a ground up as as you run a restaurant I mean there's a lot of ways that you can own a business in America but think about this\nMost small businesses are not successful and the reason is because there's a lot of liability this cost this hard causes fix cars you know you have variable costs you also have employees and benefits in insurance an inventory to house and lines of credit\nAnd it can be overwhelming and for a lot of people it's basically what causes them not to have successes that they have to deal with all these day to day incidence of traditional business now imagine another business imagine if you could\nNot have to worry about inventory if every time you needed a customer you just posted online something to sell no somebody there to buy it or if you need to buy something at\nA lower price at a wholesale price somebody who's there to fulfill that over and sell it you never had to house inventory never had to deal with employees workers' comp liability ... building didn't have to deal with employees that right there what's that worth\nThat trading that setting up your trading and investing as a business you have all the tax benefits of a traditional business and yet you got a lot of the non traditional headaches taken out of your business when I saw that when I saw a trading as a business when I first got introduced to the financial markets\nIt was just amazing to see because I'd run small businesses for years and I had some success some failures lots of failures and when I began to realize that I could do the same thing as far as income and potential income without a lot of the daily daily grind and stress of running a small business\nFor every day when I'm Out on the highway or I'm driving down the road I always get behind that truck with letters on the top and I talked to that guy all the time here at bowls and bears radio and I always say there's a guy right now driving down the road with a bunch of letters on the top of his truck who's going from one job or the other is chasing my good employees that are trying to stiff him he's got people that are showing up for work he's got people that own money\nAnd my heart goes out to that guy 'cause I was that guy then I found them financial markets in this as a business is the dream and when business owners get exposed to understanding how the financial markets can be treated like a business\nIt's a game changer an eye opener for then we see it all the time and so many of you you don't understand that the markets can be treated like a business you have these dreams of owning a business\nSeriously Inquirer to looking at trading for a business because what's important is the long term results are still there but a lot of those traditional headaches at most visit deal with\nYou can get those out of the picture and guess what the sky becomes a limit well and that's exactly it champion a lotta individuals out there that want to start their own business they don't know how to get started they would love to utilize a business from home and that's what the markets can do for you online training academy\nThe sponsor bulls and bears I teach a class specifically on training as a business now this is a five hundred dollar values taught right at the campus every time we give it away your ... and bears the phones what up we only have a few seats the way we're going to take callers ten to twenty pick up the phone right now in call aid\nFor four five on trade that they for four five on trade for callers ten to twenty to get a five hundred dollar class on trained as a business from our sponsor online training academy\nIf you've always wanted to start a business and you don't know how to get started in the financial markets this is a unique opportunity for you again for callers tend to twenty pick up the phone and call eight four for five one eight Seventy two thirty three that's eight for four or five one eight Seventy two thirty three for callers ten to twenty\nFive hundred dollar class specifically on trained as a business again if you're trying to get this thing off the ground you're trying to get started with the online training academy\nHas the answer to that is a five hundred dollar class eight four for five one trade is adamant champ embolism bears\nUsed Ninety five five and am seven fifty double you asked me\nAre you scared of the ones just before your lights go out who knows how long have you be sitting there and the dark automatic backup generator kicked saying as soon as your power crashes but you need a frozen design your system generators or not one size fits\nAll forget your free system design and has meant when you called ... box electrical and I'm David Baker might experts who never leave me in the dark right box electrical get up to one thousand dollars off in two years maintenance for a limited time come right back to electrical don't fears\nDid you know the state of Georgia you need a\nThey sense to cut hair you need a license to give a massage but you do not need a license to be a roofer\nAides mark you think about that you need a license to cut hair to give them a sizes but not to be a roofer you could literally go into business today and start ripping someone's roof off without a license so think about the kind of roofers that are out there you want to avoid\nThe roofers that don't know what they're doing there's over a thousand rivers in Georgia it's scary you want the best when it comes to your roof that's my friends at Dr roof\nDr roof never cuts corners they never tried to finish in a day and convince you that it's what's best for you they never rush because that is how mistakes are made Dr roof treat your home like it's a patient and delivers the same care every time that you would expect for a member of your family\nDo not be fooled Dr roof they never cut corners\nAnd when you asked me about doorbell er Cox media group station\n[noise] twenty four hour news weather and\nFive and a um\n\nKnow seven o'clock on Jennifer grass live and they tell us the twenty four hour news center would tell us be top story this hour playoff baseball overturned in Atlanta and an hour when the Braves face the Dodgers in game three of the LDS ... black is at ... park where it's a must win tonight for Atlanta\nAnd Jennifer ... are here now is the tension rises and praised fans licking their jobs to get the Dodgers back down south\nWe're going to win a night when the more\nWe go back to LA we're gonna spank them on their homes are\nBuilt pretty good I think there are a slave is\nWhat the big reason for that in fact about losses\nZero tolerance right in a typical race in the playoffs\nOr something ... says there hasn't been any crazier wild clubhouse beaches\nAs one or go home and and everybody knows that there's not much talking about well we have to do\n... thought the first pitch tonight then Sean nuke 'em takes it all for the Braves Atlanta most one brief rate or the season's over first betrayal seven for march I like I Will do us me\nAnd it's two different types one increases one decreases information if it gets out of control than we have a chronic pain patient\nAnd not meaning they're paying a neck that mean they have a pain in the neck\nSo what happens is and chronic pain you have something called micro Gloria now what that is they have that part of the innate immune system in the central nervous system central nervous system is the brain and spinal cord the peripheral nervous system is outside the spinal cord central peripheral it's pretty easy to remember that they're\nSo what happens is decided all kinds of being released by the microbe Leah and it stuck in the mode where they continue to excrete or inflammatory cytokines\nAnd that's when you start having big problems and all the circumstances are microwavable shift for producing inflammatory cytokines the anti inflammatory ones and then sell heels\nSounds like a normal process I get punched in the arm is information then micro clearly subtle kinds of federal contact information the information the threat is gone the body says okay the threat is gone let's produce anti inflammatory chemicals now and get this to heal sometimes it goes rye\nOnce it balances restored at micro ugly or a return to their normal state and they start doing what they're supposed to do so what can we do to calm down this production of these chemicals that's the question everybody has one of the things you want to look at is sleep\nWhen you sleep your body heal how many people have trouble sleeping raise your hands a lot of you yes it's not something that's uncommon in fact it's something that's very common\nAnd it's you know you watch these commercials it's perfect asleep eight hours a day or seven eight hours it's perfect the Goldilocks zone seven eight hours is the perfect area that you want to be sleeping well it makes it look simple and then you can take this pill\nAnd that'll help you sleep seven eight hours but many times these pills don't let you go into the healing face the Aryan asleep when talking about that and just second not the ban from Athens, Georgia our image the rapid eye movement sleep and a lotta times people can't get into that face so even if you take medication you may be knocked out\nBut you're not sleeping in Tibet healing phase and that's what we want to do exercise can help but here's the irony if you're in pain what do you want to not do exercise I don't want to exercise when I have a headache\nAnd sometimes that makes the problem worse so what we need to do is find out what exercise you can do\nIf it's walking for some of you might be getting out of bed and walking to the bathroom that's the most exercise you can do do it walk around your bed may be going out for a hike maybe it's just lifting weights with your arms maybe it's doing pushups it depends what level you can do that\nTo help reverse these microbes we're production of this inflammatory a subtle kinds helped bring down the swelling\nPlus I got to go to a break I'm going to open up the phone lines if you do it at my at my screeners in there okay if you have a question give us a call the number of aid for for for for Dr Joe\nA for for for for D. R. J. O. E. that's the number here in Studio that number by the way we sort of my office is what I'm not on the air and the Atlanta area we have offices in Marietta dilute and Stockbridge and the website is Dr Joe dot com it's talk a lot about that coming up\nBut I got to health care question gets costly for for for for Dr Joe we'll be right back [noise]\nWe know how important the news weather and crossing guard who you say connect into Atlanta on us in the heart radio as listen to mark arum Hitler and Erick Erickson anywhere\nYou go on the other side of the country or the other side of ... but then when you asked me everywhere I live in the ... and the app store for on Google Play\nR U experiencing hot flushes or fatigue do you suffer from sleepless nights or low libido you can be suffering from a hormonal imbalance which can cause you to feel like a stranger in your own skin\nNorth Fulton compounding pharmacy can work with your doctor to develop a biological hormone replacement therapy specific to your needs and get your body back in balance the natural way\nVitamins and supplements go hand in hand with hormone replacement therapy and we're prone to offer pharmaceutical great products but we're still molecular pure and ... and ...\nWe also offer medications that are free of dies preservatives gluten and other allergens in the dosage that is right for your body north Fulton compounding pharmacy for shipping across metro Atlanta\nTell them you've heard about is a W. S. B. and receive free shipping on your first order for new patients north Fulton our ex dot com north Fulton our ex dot com or coal southern southern old four seven five eight nine three seven seven zero four seven five eight nine zero three\nA storied history of first Mercedes Benz invented the automobile over one hundred and Thirty years ago had the first female driver would visit birds have been invented four wheel independent suspension hand abs breaks just to name a few innovations\nAre being um of Atlanta has its own history of her first loan or car fleet on his first expressed service facility family owned and operated at Atlanta's Mercedes Benz connections in Nineteen sixty four RV him of Atlanta is proud to be a part of the Mercedes Benz family and driving innovation\nReady to start those long overdue Homer innovations or get rid of high interest student loans put the equity in your home to work for you erase it here with some timely advice from my friends have bright path mortgage if you have more than fifty\nPercent equity in your home you can use it equity to take cash out and you may have more equity than you realize because home values have appreciated as much as nine percent get cash to make those home improvements pay off those loans at a much lower rate or use the money for whatever you choose right now is the perfect time before\nInterest rates rise again to better your life investing in renovations kitchen a swimming pool or finishing out your basement home improvements equal instant equity coal bright pass\nToday the new costs mortgage experts new fees knew closing costs for the right path just even like I did called six seven eight seven zero seven sixty three hundred or bright path dot com Georgia residential mortgage ... my last one Seventy Seventy is Errol a twelve hundred would ask what ...\nDo hear nagging little voices in your head telling you all the things you need to do\nThis is David Baker check just went off your list\nDitch your phone furnished do not done when it's cooler a cooler a super seizing their know breakdown guarantee with their credit up to two hundred and fifty dollars toward any repair if you're British breaks down\nAfter your safety check in tune up this winter just sign up for a cool All right cool care maintenance agreement and you'll get two hundred and fifty dollar credit on any repairs through march they also help get rid of all those voices in your head Korean carrier turned to the experts\nHey Sean Hannity here from my friends at runners warehouse and I'm here to talk about TNT that's top notch tenants people who'll respect your property they pay their rent on time\nAnd are good neighbors to those around them out top notch tenants of the key to making renting rock and you find them by partnering with runners warehouse once your property is in rent ready condition runners warehouse taps hundreds of Web sites they but thousands of potential runners\nThe score you top notch tenants in just a few weeks on average now they do walk through so they do the thorough background check and credit checks\nThey assist with these documents inspections rental licensing everything that builds a solid foundation for a great relationship between you and your renters plus for one low monthly flat fee winters warehouse will manage your property twenty four seven\nTo keep your renters happy now there's no upfront fees no binding contracts and you can cancel at any time they have a number in Georgia it's for all for six six two twenty three twenty two renters warehouse great tenants live here [noise]\nSeven Eighteen and who they carry again that'd be twenty four hour traffic center travel advisory crash eighty five southbound that one at one Indian trail for lap lanes are blocked there from Sonia back past\nFever ruin road earlier crash three sixteen west down before the eighty five merge that's clear but delays left behind earlier crash duty but he's not in early before at twenty two north side dry\nThat crash still blocking to left lanes but the slowdown is easing up we can travel delays remain on the Southside Seventy five north down from Lucas grows\nUp to ... to brace take on the Dodgers about forty five minutes or so from now already seen a lot of increased surface street traffic around Central Park to lead on somebody finding to decide as well in the area before and after the game until now central ESP\nHave brains were look he would be Brad Pitt of radio that's why you listen to your mom do what do you ask me [noise]\nType of Dr Joe here last year there because we're talking today our answering questions today why won't my pain go away\nAnd it's a question I get it every day in my practice all my doctors and we have three officers in the Atlanta area Marietta Duluth and Stockbridge we get that paint question every single day\nWyoming fangled way and so we become investigators we and we got to dig around now here's the thing I Would love for everyone listening everyone watching we we stream these on Facebook and Instagram our podcast is called for the health of it all our podcasts are also on my website Dr Joe dot com\nHere's the thing if you come see us and you've got a problem chances are it's not going to go away and one visit I'm just can be real honest with ya so don't expect miracle and sometimes miracles happen we've had patients in my daughter's going to take a long time and we do it and it's amazing and they they do great\nUm but if you come in and expecting me to solve the problem or my team of doctors it's going to take more than one visit in most cases and you're going to have to work with us that's why push the nutrition so hard because you have control over that\nYou can control what's a lot of your pain problems a lot of your nerve problems because remember Ninety percent of the nerves don't feel pain\nSo we're talking about uh repairing inflammation and we talked about the micro uglier producing side all kinds of his inflammatory an anti inflammatory cytokines and those are chemicals that either cause inflammation or fight inflammation\nAnd one of my ... kind of haywire they're producing too much of the inflammatory and not enough the anti inflammatory so how do we re boot the nervous system and we talked about sleep which is important to me like that was right before the break\nMe kind of season with high expectations is now going south the falcons lose their third straight game and are now one in four record after they're forty one to Seventeen lost to the seal Steelers today in Pittsburgh Florida governor Rick Scott says the Florida division of emergency management today declared a state of emergency and more than two dozen counties\nHad a tropical storm Michael investigators on the scene after a deadly crash in upstate New York on Saturday killing twenty people the U.S Geological Survey has a five point to magnitude aftershock has rattled northern Haiti\nA day after five point nine magnitude earthquake left at least twelve dad in a hundred and eighty eight injured at that same location at Georgia ... dances and NASCAR playoff\nMay have been a disappointing day for Atlanta sports with the falcons game but chase Eliot redeemed that and the auto racing world winning and the ... monster energy NASCAR cup series for the second time and his career taking today's job or international speedway race is the rise to late raise restart uses pitch strategy to gain delayed did he handled finishes second\nThey raised again next week at Talladega super speedway and elite advanced by the way into round three of NASCAR playoffs Doug Turnbull ws be\nTelling us the news time at seven thirty two story that has everybody talking\nBreaking news from Washington and he ended up analysis from the local boy says you trust your band on new study by five AM's seven fifty nobody has to be [noise]\nForties heating and air conditioning and there's a lot of choices of Illinois need your vote\nNo I'm not running for office but we hear it you want to be your first choice when it comes to an air conditioning and heating\nThat it's right events right now he's with us offering rebates them up to twenty seven hundred dollars last zero percent financing up to Seventy two months on a brand new carrier air conditioning system\nAre system just needs a little TLC you can elect to get a tuna for only Seventy nine dollars\nTurn to the next to each Smith air conditioning and heating and carrier for all your AC and heating\nDon't let this campaign and before you get a chance to take advantage of want to be in office for ... and Kerry Smith dot com or these other exclusive special tendency your favorite superhero in action that he meant of\nCourse the East River dot com the Smith heating and air keeping it cool and ringing [noise]\nLike we've never see an oath six ...\n... places like ... the Georgia Joel wind up ... in the Atlanta area for wildlife professional ... washing dishes long term projects excellent benefit\nThis is the best opportunity and contractors are white you know this will be filled by I don't know I wanted to bring shocked that Georgia generally\nLined up trade dot com [noise] let there be life\nThe ability for Marvin fiber glass window has more glass less window frame more glass brightens your home with abundant natural life more glass expand your view of the outside can busy for Marvin fiber glass windows by north Georgia replacement windows fits a look at your home like traditional wood windows but don't why bill for life they last a lifetime\nSaid big this month limited time offered in gee windows dot com\nPlacement when\nKill now then and then that leaves the twenty four hour traffic center earlier crash eight five south down one on one Indian trail had for less lanes locked flown you're not Pleasant Hill they just created that over to the right shoulder\nEarlier crash do what he thought east on an early before north side Dr exit twenty two that's also cleared and only three open we can travel delays remain on Seventy five north now from Lucas grows up to exit two twenty two Jericho road it's a mystery delay on the west freeway I twenty east bound between exit eleven highly twenty seven\nAnd exit Nineteen highly one Thirteen you're bringing embraced take on the Dodgers about half an hour from out some trust seen a lot of surface street traffic there expect delays also until you find that ... in the area before and after the game Jill Nelson W. S.\nB. movies are all just rabbits with the most accurate and a bit of a weather forecast\nPartly cloudy and warm as we head through this evening headed towards the lunar Seventy one eighty six tomorrow at thirty percent chance of some showers a butter storms otherwise it makes us on the clouds and then on Tuesday rain checks comes up to forty percent with a high of eighty to rain and some gusty winds likely Wednesday and Thursday as tropical storm Michael will be passing nearby\nSeventy nine degrees on ... street street at news Ninety five five and seven fifty devil us be depend on it\n[noise]\nIf I was talking Joe here's what are you there because we're talking today about why won't my pain go away for ... folks if you if you're if you call in and they for for for for Dr Joe hang on and when it gets you I promise\nA for for for for Dr Joe just saw somebody drop out there let's take some calls that I've been a negligent here on my call his cough I'll give us a call for for for for Dr Joe Jordan how can make your day better\nPay and extending look out of jail you are welcome I Want to go see\nMy family already used as a essential stores excellent and just trying to figure out what\nMy next step things you recommend like you know your ... your ... that sort of stuff are are sometimes maybe larger life changing the kind of up in the whole lot of just how we eat and I'm OK trying to get a cold turkey the what's the next sort of baby steps to get out their lifestyle like\nThat that's actually a great question Jordan no one's ever asked me that in all the years thirty four years no one's ever asked me that simple question uh you're right I mean\nI say no to all that stuff and all that kind of hard\nAbsolutely so you're taking a if you're taking super brazen essential source that's the minimum amount of nutrients you should be taking every day so absolutely positively if if there's one thing you can do right away that's almost totally almost passive\nTake the super easy essential source I was on my website Dr Joe dot com new to powders I'm mixing together with coconut milk Rahman milk or you could just cold water and drink it tastes great\nSo step number one super reason essential source and I didn't want to know what's the next step\nAnd the next step would be good at my website Dr Joe dot com and watched a video called the seven deadly sins of nutrition\nBecause after we talk about the alcohol meat sugar dairy coffee soda in artificial sweeteners and I give you logic and it's some some people you can't you can't give them logic they'll argue anyway but it gives you the reasons not to do those things but all of the seven deadly sins of alcohol may tributary coffee so an artificial sweetener the most important wanting to give up your artificial sweetener\n[noise] okay okay so and it's an over six thousand products\nSo it's in it's in children's vitamins chewy vitamins I picked up a bottle of that artificial sweetener the worst thing you could give a kid if something is going to cause neurological issues and that's what the artificial sweeteners do so or be careful with that it's artificial sweetener note off your list forever it's done\n'em and then and my next step\nWould be have something raw at every meal and I say Raul broccoli cucumbers tomatoes Cato salad something raw at every meal\nSo if we can do things and essential source listen to the you know the seven deadly sins and nutrition there's another audio I have on there called uh so what can I eat and you can listen to that as well 'cause it tells you what not to eat and then the other one tells you what to eat and then on the website did no charge\nAnd then I'm studying something rod every meal and now we're going in the right direction no those will be my first steps for you\nBut it was so much I appreciate it nice joined project call and of course contracted care or you want to get the spine checked because the nervous system controls\nEverything so if you have a pinch nerve going to your heart can affect your heart your lungs your liver which Christine I'm going to get to you in a second and your friend who uh COPD um you want to make sure the nervous system is working 'cause that's often times the missing Lincoln and and we have a file and I I really should do a whole show on an ... I've been trying to do this for years and it's called the Dr Joe was right column\nAnd then the doctor Joe is right for a folder now with a call now the whole folder is that things I talked about on radio things I research things I Do a lot of seminars I teach postgraduate to doctors all the time\nAnd I predict things and if I was getting sicker and sicker almost every day and so my prediction making it today so that I can come back and quote this is\nThat the next big craze if you will in medicine or health care I should say is going to be working on the nervous system it's already happening but it hasn't quite hit mainstream yet and it will\nBecause we get doctors all the times referring to us we are doctors and hospitals and neurosurgeon the vascular surgeons and general practitioners and gynecologists and you're all just because they can't do what we do I can't do what they do\nIf you need a I don't know you'd prostate exam I Can't do that for you go to your relatives and get checked\nBut we check the nervous system the digestive system and the diet\nAnd so many people we we adjust the spine and if you have acid reflux heartburn we can pull the stomach down away from the die for him in most cases and by the way I've never promising results just so you know I'm never guaranteeing anything but I can tell you after thirty four years in thousand ... say millions of adjustments that I've given we got a pretty good track record\nBy pulling stomach away from the diaphragm relaxes the whole intestinal area and it's the new it's what's called the Paris sympathetic nervous system sympathetic speed you up Paris sympathetic slow you down and by doing that people sleep better they go to the bathroom better to love life improved at focusing improved in most cases\nSo we want to get the nervous system working at the digestive system working and then get a good diet and the minimum minimum amount of nutrient you should be doing everyday is Dr Joe super greens and Dr Joe the central source I personally take adrenal support because everybody asked me that every show I think adrenal support that's on the website to Dr Joe's B. complex\nNitric oxide increases my circulation as you get older your circulation gets a little weaker blood vessels get the aren't as a pliable or flexible as it used to be\nAnd I'll tell patients all the time listen this is what I recommend\nWhat you decide to do with this information is totally up to you\nI Can't make you do these things and even with nutrition you know our patients come in if he doc I just want chiropractor care I hear you guys are the best and I just want ...", "year": "2018", "show_name": "The Mark Arum Show", "city": "Atlanta", "day": "07"}