{"month": "10", "state": "FL", "station": "WJCT", "content": "[noise]\n[noise]\nOr do you live\nDollars to gather in a\nOut of a\nSing this song\n\n[noise]\n\nLa la\nLa la la la\n\nLa\n\n\n... ...\nEither but I mean my ... and ...\n\nWhat do you watch those are the\n\nMom does she\nLook student did not and he\n...\n...\n... ... ... ... ...\n...\n...\nNamed ...\nTo love to do\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n...\nYou're listening to relax radio on eighty nine nine that Ben W. J. C. G. H. D. tree in Jacksonville, Florida\n\nOn which source you look at this music was either inspired by a honeymoon\nOr war\n\nYucky bears ballot which means porches call\nPicks a number of the war on the Mediterranean and music\nAnd eat their travel throughout the Mediterranean while he was a naval officer during the first World War\nLater once he was on a honeymoon\nI suppose it doesn't really matter whether it was more service or his honeymoon that inspired in the most but\n\n\n... in the spring music behind you on you in the China National symphony orchestra let's let die until I had ...\nMy name's Andrea blade\nBy a chick composer whose name we should know pattern is coming up and just a minute\n\n\n\n[noise] the check composer Leopold cultures have arrived Indiana some three years after Mozart and he really charmed the music loving Viennese aristocracy because he played piano when he was a composer and a teacher as well here's an example of his work\nAs a composer piano concerto refine Howard Shelley as a soloist and he needs to London not talked players\n\n[noise]\n\n\n\n\n[noise] [laughter]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n[laughter]\n\n[laughter]\n[noise]\nMm [noise]\n\n[laughter]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n[noise] [laughter] [laughter]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[laughter]\n\n\n\n\n\nUh-huh\n\n\n\n\nInspired either by his time in the military going around the Mediterranean or his honeymoon Jackie their support of called scarlet the LA Phil conduct by Andre ...\n... rain this week reporter Chris ... talks about the peanut butter grandma Nineteen fifties Washington homemaker changed how the FDA regulates commercial food chain of shall we take note street to bus station Tel Aviv or Filipino surf\nWe cook a bright in fragrant yellow curry\nAnd we show you basically the toaster spicy coming up this week on the street radio ...\nSunday Morning at seven one eighty nine nine WG ACT your community you will ...\n... ... ... crazy things happen when you translate crazy tax\nWe get lost in translation\nSunday at noon on eighty nine nine W. J. C. T.\nFishes eighty nine nine to ... to get them Jacksonville providing news information in music\nFrom Florida as I'm close to George is golden I'll listen on your computer or mobile device W. J. C. T. dot org\n...\n\n\nPulled notes are published a famous treat on violin playing the year that his son Wolfgang was born you see find than playing what's important to Naples [noise]\nNaturally he wanted it to concentrate on playing the violin and become a band in Europe [noise]\nBecame known mainly as a keyboard player\nHe must have always had a tough spot for the federal as he called it turns out that he\nComposed the intimate a really wonderful and you're going to hear one of them and just by minute\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n...\n... ... ...\n...\n[laughter]\n[laughter]\n\n[noise]\n\n[noise] [noise] me\nToo [laughter]\n\n[noise]\n\n\n\nFar guitar by Anthony Sydney that was from a Chinese\nWalls\nAnd do classical music release now physically found sugar the architect was the largest scale piece of chamber music that she looked real it's got six moments scored for a string quartet and uh there's no climbing up the soon hard and\nDouble bass added to it this is the second most of the court that this is a new release on the Iranian Monday April and it's paid by an ensemble led by the main amazing violinist Isabel ... [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\nMm\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\nMm Mm\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nMm\n\n", "show_name": "Sunday Baroque", "year": "2018", "city": "Jacksonville", "day": "14"}