{"month": "10", "state": "AZ", "station": "KJZK", "content": "All the way\nTo do\nOh\nThen I hear your laundry Madonna I'm\n\nBack here I mean I don't care for him but he's very tall\nAt all about I've got to know about\nEverything's on them a\nOur from from the\nNo no\n...\nHe'd been\n[noise]\n\n[noise] [laughter]\n[noise]\n[laughter]\n[noise] [noise]\n\n\n\n\n\nLive on ... street Caribbean special thanks to our community partners of bridging the blues and the mighty Mississippi music fest especially Wesley Smith the matriarch brings us back each year\nTo found out more about St Paul in the broken bones find them on social media or visit them at St Paul\nBe sure to check out their tour dates they may be coming to a venue near you see\n\nActual thanks to our supporters honor them\nThem at the convention and visitors bureau arts Memphis, Tennessee our commission Tennessee tourism and bridging the bleak for support and making bill street caravan possible\nWe like to remind our listeners to please show your support for public broadcasting you won't find programming like this anywhere else you can find Bild street caravan on all the social media outlets follow us there we've always got special features an additional content that we think you'll enjoy go to our website at bill ...\nAnd sign up for a monthly newsletter and find out where the caravan is gonna be next and you can always keep up with Bill street caravan via our podcast is available anywhere pod cast can be found\nWe'll be back next week so Stephen I'm\nPat Mitchell really and I'm Kevin cabins and you've been listening to the sounds of Memphis on bill street Caribbean [noise]\nShe coming up next to the blues you ... on the road ... with Tony Stark looted [noise]\nNinety point one at him in Ninety One point do we have him get on\nYou're listening to the Arizona community radio network an eighty nine point five kj ca Drake press get belly Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven K. J. C. K. Kingman Boulder City Nevada\nAnd on translator cake to one seven ... like death months park at Ninety One point three of them\nShows that are [noise] [noise]\n[noise] [noise] [noise]\n[noise] no no\nHe\nAround\nIn\nMusic from Joe Louis Walker Bruce ... Giles Rob starting to get us role in this hour the roadhouse cuts Robert journeys to the heart of the blues that comes out in October\n\nAnd\nOh\nI meant by that and and do\nThey ever stop by both\nOf them a time when a new where there\nAre other band on by\nIs a higher than\nThat but I\nDon't get that back then that Tom\nMay\nPlay out in the rain man there may be\nDe de\nDe de de de\nBang bang bang so\nOut of time and and down and the guy in\n\nDe de de\n\nDe de de\nDe\n\n\nDe de ...\n[noise] [noise] they asked me to the back [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n... del doo doo doo doo doo heartbreak gr drink a Buddy Guy and Mick Jagger\nThere the opposite is brand new random Robin for close to start with a truck from a ... a piece called late the last of somebody's fool to a large set of a new music ... dream GW Jones and his grid first stop for live in Tallahassee Eugene how do we bridge is a step by step\nAnd\nThat\nPeople\nHave been\nArea but written\nNow\nCan get\n\n\n\nMy\n\nThe seasons by treating\nThe the loser for up\nMention\nHoney I Need you\nA\nOf money I mean you\nGo on to be\n... ...\nOnly law says\nYou can't really move out of jewelry that either way\nThree to ... to a\n\n[noise]\n[noise]\nWhat twenty first century\n\nSaw\nIt all they they just my strategy\nThat John Cleese day she'll\nShe'll know\nYour brain that day\nOh man I don't care\nThe last thing that I\nCome and gone now\nStill manage to do\nThe\nOld man we read it\n\nThe hard\nJust stay alive and say can I tell\nThem I\nMe go back\n\nWay that God\nWhat you do [noise]\n\n\nMinute\n\n[noise]\n\n\nNo no\nNot saying get down to you know maybe\nIt was a bomb\nOn the\nTo\nKnow\n[noise]\n\nI'm right\nAnd I'm Renee\nWaiting for you\nRight\n\nFew true love lives on a truck cold colon angels before docked DACA we I'm John Otis of course ... holding oaks that's where his release cold Arkansas had been Harper and shortly bustle wide open the SAT with love and trust for their release no mercy and that's why\n[laughter]\n\n\n[laughter]\n[laughter]\n\n\nOh no [laughter]\nGod\n[laughter]\n\n\n\nOh\n[laughter]\n[noise]\n\n\n[laughter] [noise]", "year": "2018", "show_name": "Live from Here", "city": "Kingman", "day": "07"}