{"month": "10", "state": "GA", "station": "WNGH", "content": "I'm Fred Child does his performance today from a PM American public media\nDoes has members supported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nIt's ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nMORNING EDITION and on second thought to political rewind and all things considered split their support make everything you hear on TV be possible if we didn't hear from your during our fault fungi your contribution now will still make a difference [noise] please take just a couple of minutes\nTo support the programs you rely on and enjoy on ... and do your part now at whatever level is right for you [noise]\nCould a G. P. B. dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\n[noise] Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n\nBroadcasted the Atlanta symphony orchestra on G. P. B. R. made possible that the generosity of the late ... H it'll just\n\n\nThere are a couple of moments which shoot pick your breath away\nAfter this choir and sometimes bleak in some of its\nMover ... or ... to do is good for\nJust crashed into the score\nThe principal gets conductor and the and I think any architecture [noise]\nNight we'll hear ... conduct the additives in New York and ... and corn and some of the way\nIn the dirty requiem setting the Catholic Mass for the gay and injured ... own\nI'm Sarah that law in the ass on GPS\nMonumental terrifying\nPosition to run the\nSymphony hall a very much this this\nHighs vision of the last judgment\nEven though I conducted this many many times it still is\nWhen you give that cue to the orchestra [noise]\nYou you know that you're unleashing something terrifying and glorious\nCharities Beckley am runs an hour and a half in before we start a few more minutes and Donald radical new things on ... directly and starting with a vivid memory and a great performance at work that he went to great lengths to attend\nI Do actually remember a an historic evening or would I drove through the night or from Germany to get in Austria\nTo attack and one of the final concerts or how between comedy and\nI was in the movie climb it was about to nail ever talked for months it was the Dennis all the money was a stellar cost and\nOne guy and he was by them quite sick or he was so limited physically through his comic back problems\nAnd yet this didn't mean to to figure that came on the stage he was a very small mom but when he actually stood up in the restroom or on the podium it was just a monumental performance by\nThis monument full iconic conductor and that's really where my relationship so to speak began with the peace uh that's where my ... to ... myself\nAnd I've done it's basically all over the world now it is however a thrill many years into my relationship with the opposites New Yorkers during the course to be a finally before me to hear\nThat he had a kind of complicated relationship with the religion\nCan you tell anything about the nature of his face or his views on race found his directly and masks and again\nI think the tea\nThroughout his life or in in an extremely Catholic country out or a troubled relationship was religion\nWhen you look at some of the pros I think ... drove juice that these are the was less his\nBelief his religious conviction I think it was far more the humanness\nWhat drove ... was last his\nBelief his religious conviction I think it was far more the humanist the believer in human rights the believer and\nTo be against oppression\nHe would choose the subject which was on some level\nIncendiary an insight into revolution\nAnd really when you when you track ... through through all these stories what one is riveted by is the growth great soaring themes and the great soaring courses they're all in some level addressing the human spirit the oil was addressing oppressed people\nOr or depressed person there they are all was a addressing freedom freedom of speech freedom of expression\nAnd I think that when you come to the ... in that we know that it was the death of this great human this this this ... this philosopher or understand that among Sunni it was this man's death that had such a profound impact on the composer\nShe reads mind so in a ... you see there are so there is such a correlation between what he's writing and ... so much of the subject matter and ends ideas about it was the level of and the devotion to\nAnother remarkable human being which just which gave us this work while it yes it is the Catholic Mass while it is addressing religion on our mortality are fallibility it begins quietly and it ends ... it's like ending with a huge\nLeap on me and the choir sings is quietly incessantly it says if it's just the the voice of humanity this\nFree me free me from all the suffering that we as human beings are subject to to you have to imagine and once again it's just a a Eidelson hot so to speak to Robert Hall or where he ... words when he he he spoke to the course of the ... you have to imagine that there are no don't need people here on his work\nDonald venting cause an airline G. P. B.\nAny arts and crafts\nManager\nThe latter symphony orchestra and correct\nKind of ... ... ... feet\nMm Mm no\nHe ... he can\n\nDo\n\n...\n\n...\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\nOn\nThe ...\n\nMore\n\nAnd\n\n\nMore\n[noise]\n\n\n\nRight\n\n\n\n\n\nMm\n\n\n\n\n\n\n\nOh whoa\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\nHe didn't\n\n\n\n\nWhoa\nWhoa\nWhoa\n\nWhoa whoa whoa whoa\n\nWhoa whoa whoa\n\nWhoa\n\n\n\nWhoa\nYeah yeah yeah yeah\nThat's what they learn to\nOr I mean you know we're moving man\n\nOn the\n...\n\nAh I\nKnow who\nThey were wrong\n\nOh no\n\nOh\nA little bit about you know\nSmack\nGone in and say you\nWant\nTo follow\nWere all just more organized and\nAll of these phone calls are in\nOh\nMm\nMm\nStay home and try and\n\n...\n...\n\n\n\n\nOn\nWhen you talk to each other and\n...\n... you\nNews\nA\nOn ...\n\n\n\n\nIn the\n\nWhoa whoa\nWhoa\nWhoa whoa\nWhoa whoa whoa\nWhoa whoa whoa\n\nWhoa whoa\nWhoa whoa\n\nWhoa whoa\nWhoa whoa whoa whoa [noise]\n\n[noise]\n\n\n\n[noise] oh\nYo\nYo yo\nMa\nOh whoa whoa whoa\nWhoa\nWhoa\n\nWhoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa\nWhoa\n\nWhoa\nWhoa\nWhoa whoa\n\nWhoa whoa whoa whoa whoa I mean all of the wrong wrong wrong wrong wrong wrong\n\nWrong wrong wrong wrong wrong\n\nI I\nAm on\nA or\nPhone call\nA ...\nAnd then\nAnd then\nHe looked\n[noise]\n\n\nA\nOh\nWhoa\n\nWhoa whoa\nWhoa whoa\n\nWhoa whoa whoa whoa\n\n\nYou're\nA man\n\nOn man I'm I'm\nA\nOh\nOoh ooh\nUm\nAnd then\n\nNo\n\n\n\n\n\n\nLonger on the\nAir\n\n\n\nWhoa whoa whoa\n\n\n...\n\n\n\n[noise]\n\n[noise] um [noise]\n\nLoan on [noise]\nOn the news\n[noise]\n[noise]\n\nI'm no\n\nLonger than any [noise]\n\nBlue\n[noise]\nAnything on [noise] [noise]\n[noise]\n\nWrong [noise] and or [noise]\nEarly on the\nLine I Know that everyone on the\nPhone\nCall or whatever\nOr Long Island on the phone\n\n\nWhoa whoa\nWhoa whoa I'm\n... ...\n\n...\n... [noise]\n[laughter]\nAll the time\n...\nThe\nMy\n\n[noise]\n[noise]\nYou know\n\nOr\nA girl or a\n\nOh\nWho\n\nAre on\n\n\n\nA loan\n\n\nFrom home loans\nLive\nAnd\nAll that\nYou know I'm a\n\nI'm\n\nA I'm a\nI'm a\nNa na na na\nNa\nNa na na hey hey you know ...\n\n\n\n... and\n\n\n\nI don't know\nWho\nI'm a [noise]\n\n\n[noise]\nYou\nKnow home who\n\nWho who really ...\n...\nOoh ooh\nYou know ... or maybe just a\nMatter a Luo\n... is on the show to be on\nA on a on a\nSeries the earlier in the movie a a ...\nOr ...\n\nWho was a long road rules\n\n\n\nWell\nWell well well\nWell well\n\nLong you know\nDay\nLong [noise]\nWhoa whoa\n\nWhoa\n\nWhoa [laughter]\nWell\n... [noise]\n\n\n\n\n\nRang", "year": "2018", "show_name": "The ASO On GPB", "city": "Chatsworth", "day": "12"}