{"month": "10", "state": "GA", "station": "WNGH", "content": "... and beyond this is GB radio on line a G. P. B. news dot org I'm Tom Barclay it's nine fifty nine up next to Sara that brings you another great\n... and beyond visitors GDP radio on line that GB news dot org I'm Tom Barclay it's nine fifty nine up next Sarah's asked all brings you another great performance from the Atlanta symphony orchestra it's the A. S. O. N. G. P. B. [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring\nYou the programs that mattered once you ... if you didn't get a chance to donate during the\nDrive your online contribution now will still\nMake a difference [noise] please take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n[noise]\nIt was Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome quarter but Georgia Public broadcasting radio network [noise]\nBroadcasted the Atlanta symphony orchestra on G. P. B. or made possible do the generosity of the late Virginia H it'll just\n\n\nThere are a couple of moments which to pick your breath we're off to the choir and sometimes bleak in some of its\nMover verse color to do is you're looking for\nJust crashed into the score\nThe principal gets conductor at the New York a\nAnd conduct the Madison the orchestra and chorus instill in their directly and setting the Catholic Mass for the dad in ... own\nI'm Sarah ... it's the ass on GPS\nSarah das law if the ASA line GPA\nMonumental terrifying\nMany Trump's position to run the\nSymphony hall a very much this this\nTies vision of the last judgment tons of water weight so [noise]\nEven though I can do for many many times it still is\nWhen you give that cute to the orchestra\nYou you know that you're unleashing something terrifying and glorious\nCharities Beckley am runs an hour and a half in before we start a few more minutes and Donald radical new things on ... starting with a vivid memory other great performance at the work that he went to great lengths to attend\nI Do actually remember a an historic evening or would I drove through the night or from Germany to get in Austria\nOr to attack and one of the final concerts of Hamilton County and\nI was in the ... it was a math to nail ever talked to form and it was the ... a stellar cost and\nOne guy and he was by them quite sick or he was so limited physically searched his comic back problems\nAnd yet this diminutive figure that came on the stage who's a very small amount but when the ashes to go up in the restroom or on the podium it was just a monumental performance by\nThis monument full iconic conductor and that's really where my relationship so to speak began with a piece a dots when I ... to ... myself [noise]\nConduct on it's basically all over the world now it is however a thrill many years into my relationship with the mountains of New Yorkers to of course to be a final there before me to hear\nThat he had a kind of complicated relationship with the religion can you tell anything about the nature of his faith or his views on race from his directly and that's been attacked\nThroughout his life or in in an extremely Catholic country out or a troubled relationship was religion\nWhen you look at some of the ... I think ... drove juice that these are the was less ...\nRelationship with religion\nWhen you look at some of the ... I think ... drove juice that day was less his\nBelief his religious conviction I think it was far more the humanist the believer in human rights the believer and\nTo be against oppression\nT would choose the subject which was on some level\nIncendiary an insight into revolution I'm really when you when you track ... through through all these stories we bought one is riveted by is the growth great soaring themes and the great soaring courses\nThey're almost in some level addressing the human spirit the oil was addressing oppressed people\nOr or they pressed person there they are all was a addressing freedom freedom of speech freedom of expression and I think that when you come to the ... in that we know that it was the death of this great human is this this ... this philosopher or understand that among Sunni\nIt was this man's death that had such a profound impact on the composer\nShe reads mine so in a ... you see there so there is such a correlation between what he's writing and ... so much of the subject matter in ... about it was the levels and the devotion to\nAnother remarkable human being which just which gave us this work while it yes it is the Catholic Mass while it is addressing religion on our mortality are fallibility it begins quietly and it ends ... it's like ending was a huge\nSleep on me\nAnd the choirs things is quietly incessantly\nIt's as if it's just the the voice of humanity this\nFree me free me from all the stuff that we as human beings are subject to to you have to imagine and once again it's just a a idle ... so to speak to Robert Hall or where he ... words when he he spoke to the course of the ... you have to imagine that there are not only people here in this work\nDonald venting cause an airline gp be\nCan\nThe Atlantic symphony orchestra and chorus\nOf ... kind of makes me\n\nMm\nNo he he he\nMe\nThat's no money for me\nTo\nDo\n\nTo me [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\nOh\nReally ...\n\n\n\n\n\n\n\nMe [noise]\n\n[noise]\n\nRight\n\n\n\n\n\nHi\n\n\n\n\n\n\n\n\nOh whoa\n\n\n\n\nIran\n\n[noise]\nHe\n\n\nKnew who\nAround and they don't\nReally\n\nHave\nTo\nReally know why because\nThey\nKnow\nThe ... the\nLaw\n\n\nMaybe they\nWhen they are going to\nDo when you were in\nThe\nMan\nOn the\n...\n\nA a\nRestaurant who\nDon't miss\n\nA day\nAnd he\nSaid oh\nNot really about the\n\nGone\n\nOh no\nWere all just more of it [noise]\nKnow they just don't go off\nOh\nMm\nOh\nMm\nAnd time and\n\n... ...\n...\n\n\n\n\nNo\nStay at home and tore down there and\nYou\n\nA\nOn ...\nYou\n\n\nKnow\nThe\nThe [noise]\n\n\nWhoa whoa\nWhoa whoa whoa whoa whoa\nWhoa whoa\n\nWhoa\nWhoa whoa\n\nOn\nOn the phone\n[noise] [noise]\n\n\n\n\nWhoa\nWhoa whoa whoa that's wrong\n[noise] well it wrong\nWrong\nWrong\n\nOn on on the phone right now I'm On my on on on on on on on\nA\nOn\nOn\nA\nOn\nLiberal or\n... or ... oh well above any of the law to put all on their way and then\nThey\nAre all around the wrong hands on a\nMinute wait a minute by\nWhen I\nWay I get a or\nA on\nOn on\nPhone\nA million\n... and and uh\nBut I mean he ...\nAround [noise]\n\n\n\nOh\nWhoa\nWhoa whoa\n\nWhoa whoa\n\nWhoa whoa whoa whoa\nHoo\n\nI'm\n\nOn a man\nOr\nOh\nOoh\nUm\nAnd then they\n\n\n\nLot\n\n\nOn our on air\n\nOh\n\n\nWhoa whoa whoa\n\n\n...\n\n\n\nOr ah [noise]\n\n[noise]\nUm [noise]\n\nAlone on [noise]\n\n[noise]\nNo [noise]\n\nNo no [noise]\nMostly the same here [noise]\n\n\nOr [noise]\nAnything on TV [noise]\nAll of those [noise]\n\n\nWrong [noise] ... [noise]\n\nThe line I I don't know where they're from all over\nThe walls all the\nOil\nA Long Island on the phone\n\nWhoa\n\nWhoa\nWhoa whoa I'm\n... ...\n\n...\n\n[noise]\nNo\n...\n...\nKnow you're kind of\n... will\n[noise]\n[noise]\nOh\nOn on on demand\nThat grow\nGrow them in the world or\n\nOh\nWho [noise]\n\n\n\n\n\nKnow on on\n\n\n\n\nThe moon\n\nFor all that\n[laughter] you know I'm a\n\nI'm\nWrong\nOr all\nWrong no\nNo no I don't know na na\nNa\nNa na na\nHey hey whoa whoa\n\nWhoa\n\n\n\n\nWhoa whoa whoa\nWhoa whoa whoa\nWhoa\nWhoa\nLoans\n\n[noise]\nOh whoa hoo\n\nHoo hoo ...\nWho who who\nYou know what I'm or maybe I'm\nA I'm a ...\n... email us ... you know that it's going to be\nA ... on the\nT. V. movie as a hobby\nYeah you just saw on the T. V. or ... or ...\n\nKnow you lose ...\n\n... what\n\n\n[noise] [noise] [noise] [noise] well [noise]\nWell\n\nLong you know\n\n\nWho [noise]\n\nOh\n[noise]\n\n[laughter]\nWell\n[noise]\n\n\nOr\nWhoa\nOh\nNo no", "year": "2018", "show_name": "The ASO On GPB", "city": "Chatsworth", "day": "15"}