{"month": "10", "state": "GA", "station": "WNGH", "content": "I'm a child is performance today from eight PM American public media\nThis has members supported gp Pete were in Eighteen station radio network you can listen online\nFrom a PM American public media\nJust as members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nFor the election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country listen on election night the wake up and hear what the outcome means for America on MORNING edition\nCritical election the central coverage NPR News [noise]\nJoin us for all the results on election night starting at eight Iran gp [noise]\nNinety seven point seven FM WG P. B. and W. GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nBroadcasted the Atlanta symphony orchestra on G. P. B. or made possible do the generosity of the late ... H it'll just\n\nBe coming finished this piece senior Napoleon invaded his city buildings lodging to directly in line of fire\nHe took refuge in a basement of another home\nDuring the massive shelling Beethoven try to protect the last remnants of his hearing covering his ears this all this turmoil Beethoven never lost his fears sense of independence and in parts of the fifth and final piano concerto of his there is undeniable pride\nInherently any between there's the other worldly sublime beauty\nI'm Sarah ... welcome to a concert by the Atlanta symphony orchestra on Georgia Public broadcasting the A. S. L. I. N. G. P. B.\n\n\nConcert took place at the beginning of this year recorded before a live audience the weekend of January twenty seven\nTonight conductor is music director Robert ... bono [noise] and the pianist in his Beethoven Concerto will be\nOr a live audience the weekend to January twenty second\nTonight conductor music director Robert ... now and the pianist and if they have been considered it will be Jorge Federico sorry have also on the\nProgram the lamenting symphony number one Jeremiah by how useful Leonard Bernstein into open the program I'm Thirteen minutes work by a member of the ... section at the Atlanta symphony orchestra Michael Curtis this piece is called everything last forever Michael ... explains\nA name came from a sign that was plastered above the crux street tunnel and cabbage town here in Atlanta which has a tunnel bits locally known as a sort of a demilitarized zone for graffiti artists\nIs decorated in redecorated hundreds of times a year it's very very beautiful I think and the sign it was plastered above it said everything last forever\nAnd the sign was feeling and being faded and then painted over\nAnd I really enjoyed that fascinating ironing\nEverything last forever has three sections what are their names to that ...\nYes use each movement is named for some street art that I saw here in Atlanta on my way to work the first movement is called toes because I saw a really beautiful painting tagged by an artist named toes [noise] it was sort of a mural\nTo feed their foot in two feet in sneakers\nWere just really cartoonish and beautiful [noise]\nYou're going to hear from bones [noise]\nThe arithmetic noted that carries through the uh the entire first moment that's the jazz east of the movement it's a it's a little bit Bernstein ask I think uh the second him in his bird sing love which was inspired by a painting I saw a bird on a doorway alone memorial drive in Atlanta [noise]\nBecause it's very beautiful and a few days later someone added a heart\nIt's a very sad song but it\nThe bird fines to be singing\nDespite what's going on all around it\nThe third movement is called we have all the time in the world to know very odd time signature throughout seven eight\nAnd the melody sort of\nClose on top of that and kind of bumps in the U.S\nSo we have all the time in the world to know very odd time signature throughout seven eight\nAnd the middle of the sort of\nFlips on top of that and independent bumps in the other thing the\nRobert De Niro conducts the medicine for the orchestra Michael Curtis everything\nA first symphony even Beethoven's first symphony has some quality of an essay as he finds his mastery\nThat Bernstein to do this at twenty four is just almost unbelievable\nAnd it is nevertheless a bit of an unusual symphony the fact of its overt programmatic content the fact of the inclusion of the voice which she's clearly heartening to mall or by having the last move and be a solo voice\nThe incredibly dynamic refund make energy of the second movement the sweet ... an epic nature of the first movement\nBernstein's voice was variable throughout his lifetime with works as a Serb it can even caustic as the third symphony with works as accessible and popular as west side story and everything in between\nBut Jeremiah somehow captures some very particular aspects germane to his musical character and I would say that this extraordinary arithmetic vitality of the second movement\nAnd his capacity to express deep grief and suffering in the in the third movement particularly [noise]\nAt some level Bernstein must have identified himself deeply with his own Judaism in Nineteen forty two and Nineteen forty to his choice of patience for the symphony the fact that the third movement as cash for his father there's certainly\nBetween forty to his choice of limitations for the symphony ... third luminous counters for his father there's certainly an aspect to reduce psyche but she was\nContemplating with his own our dealings with being Jewish [noise]\nAtlanta symphony music director Robert Spano\nBernstein wrote a note about this piece saying as for the program addict meanings the intention is not when a literal illness but an emotional quality that's the first movement prophecy ... only two parallel in feeling the intensity of the profits pleased with the people\nAnd the scared so profit nation to get a general sense of the destruction and chaos brought on by the pagan corruption within the priesthood and the people\nThe third movement lemon ... being a setting of poetic tax\nIs naturally more literary conception Bernstein rights he says it is the cry of Jeremiah as he mourns his beloved Jerusalem ruined pillaged and dishonor after his desperate attempt to say that the text is from the book of limitations\nAnd now on stage at Atlanta symphony hall meant the Sopranos Jennifer Johnson Cano\n\n\n[noise]\n\n\nMm\nWell\n\nOh\n\n[noise]\n\n\n\n\n\nAnd\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\nNo no no no\nMean we all\n\nWant\n\n\nWhoa whoa\nWhoa\nWhoa\nWhoa ooh\nJeeze\nJeez\n...\n\n\n...\n\n\n\n[noise]\n\n\n[noise] [noise] [noise]\nOh\n... ...\n\n... ... well\n\nA ... a\n\nL\nL\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\nOrleans\n\nOh\n\n\n\n\n\n\n\n\n\n\n\nAll\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\nWell\n\nI\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\nMm Mm Mm\nMm Mm Mm Mm\nMm\nMm\nMm\nMm\n\n\n[noise] [noise]\n[noise]\n\nMm\n\nMm\nWho\n\nWho who\n\n\n\n\n\n\n\n\nAnd\n\nOh well\n...\n\nThe reason\nWe're\n\n\n\n[noise] [noise]\n\n\n\n\n\n\nBeethoven Leonora overture number three that's a Nineteen Ninety seven tell our recording of the Atlanta symphony orchestra under the baton and then music director yo el levy\nAnd there's time for one more his ... overture\nAnd there's time for one more his ... you know for sure", "year": "2018", "show_name": "The ASO On GPB", "city": "Chatsworth", "day": "26"}