{"month": "10", "state": "CA", "station": "KALW", "content": "[noise]\nThe following program is a production of classical K. U.\nS. C. a listener supported radio service of the University of Southern California\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] these days that's the voice which for a huge percentage of the world's proper lovers is for all practical purposes the voice of her country the voice of\nThe fiery immensely accomplish Russian soprano on a new trend\nExcept for the occasional Vivian world class marriage I don't like to ... the voice of Russia in recent years has tend to be female\nFrom ... to Elena older [noise]\nBut of course such was not always the case [noise] from show quite recently in operatic\nAnd of course there has everywhere [noise]\nOoh oh\nJeez you and your your oh\nMaybe ... cheese or any\nOf the new ...\nAre you\nIn a career which lasted nearly half a century\nBegan his final performance at the both of you took Seventy he was one of the last\nRepresentative of a very special ... [noise] the singers were born in ... was spilled bizarre as Russia\nAnd the school and the romantic\nNineteenth century singing traditions [noise]\nBut who made the successful transition\nTo the new Soviet Union [noise] his case becoming the common people the leader of Mississippi union himself [noise]\nThe next day the recordings of the great ... euro [noise]\nDidn't trade are both in the new to the record shop [noise] [noise]\n... von ... [noise]\nUh oh my God he he he\nCould rule new\nKnees you'll\nLeave oh\nJeeze this is when you saw the\n\nTea in\nThe early ...\nShe did\nAnd [noise]\nThey're not actually be\n\nA very [noise]\n\nYour keys to\nTell you well you know oh yeah well you can you know we\nWere\nAll so much who will do the whole\nWe got the but the movie\nMaybe maybe the\nAre you you do\nThe\nFour oh you know maybe well I yeah oh\nYeah well you know do you\nDo did you hear the the only\nI mean he's just yes ma'am I Know I Do you love your\nUh uh the\nOnly kind of like a recording me using what used to be the Soviet Union [noise] difficult to take a nicely any of the recordings but you've on cars must be made over the years [noise]\nAgo he began recording in the Nineteen thirties most for made between the into the second World War and the death of justice Stalin in Nineteen fifty three\nOn the other hand the policy and Hondas at least not like that [noise] as to the nature and important I'll be sorry\n\nIt was nothing especially large like many ... is from John McCormack to ... to one Diego Florida is we're not blessed with the largest instruments Koslowski was perfectly balanced throughout the entire range and almost always perfectly control\nAnd it was controlled in a way that many Russians singers trained in the early decades ... tend to be in the principles that dominated Russian singing well into the ... era the principles of Italian bell ... chicken\n[noise]\n\n... g's job ... hot and the only nice yeah ... ...\n... oh I'm a ... I\nReally would yea\n\n\nYea I O\nO\n...\nF sharp the fact is crash crude inexplicable\nAnd Huckabee astounding\n...\n\nOr\n[noise]\n\nUh [noise]\nOh well well oh\nWho\nWas not ready to go\nOr when you really oh oh oh oh\nOh oh\nGod he I mean\nMaybe maybe not maybe you know\nAnd you know what I see oh well yeah you know\nI I mean\nThey oh well\nOh God I Am um\n[noise] um [noise] we're we're a ...\nYear oh jeeze yeah\nWell\nHe he you know oh da\nDa da da da da da da da\nDa da da da\nDa\nDi di ... and yeah I I\nLove oh my God you're\n\nHere you're [noise] ... the\nVoting thing I mean\nYou know we are going on in the long run\n... ah\nOh\nA ...\n[noise]\nAnd of course the simplest explanation for why he decided to do which is probably the most accurate as well\nBecause he could obviously\nThat was echoed in the from the news the barber of Seville supplying its own credentials and we heard ten or ...\n\nAfter arriving at the ... I'm praying Moscow Nineteen twenty six cars must he came very close contact with the reigning Russian ... of the previous generation the Sabine off following Russian Revolution became the first elected director in ... history\nWith the demand support and guide ... began moving into old moves roles but it may be not famous to think what was widely regarded bam now\nAs the prime Turner Brian\n... who are you\nAre going to renew my boy or\nA certain ah do you have to\nLay up oh for\nSure don't eat food\nYeah [noise]\nSee I don't know ... ... yeah [noise]\nBeen pretty good way to sell on ... [noise]\nWell it's been a\nReally nice to be\nA really ... ...\n... oh yeah oh [noise]\nGod we CD [noise]\nHow about you come alive he\n[noise]\nHe said I don't I don't know [noise]\nRod ... I Love a week\nOh\nYour ... you know I Do have a\n\nDog I mean I don't know what might have to make a\nPie I don't know my ... I mean you see when you're a\nNon ... oh yeah\nI don't know I mean he\nIs not good for you ... not ... but I keep me the ATF man\nA ... a\nMan many ... how can\nYou oh ooh I'm\nThe\nRule of law is\nLet's see if\nWe had no ... no ... oh\nOkay\nOh\nOh\nExcuse love song to Olga ... with ... soprano Maria Mexico is Olga that Polanski oh he fought Koslowski\n\nLewinsky remains nationally one of the most thoroughly compelling interpretations of the road\nFrom Koslowski at its best sophisticated refine\nThe gray area but the doomed Lenski sinks before his people do with these former friend\nSinger effortlessly folks the characters to death and his love for old it's such a sensitive the people the way you feel you're hearing one of the most perfect identifications up singer with character\nBody many yeah oh yeah\nHey Jamie ... I mean it was a\nLot longer than I did not\n[noise]\n\nUm [noise]\n[noise] [laughter]\n\nDid you see any\nOne of\nWhom I see\nJohn yeah well it's nice to see them all [noise] what was happening they\nDon't know\n\nThat's right and jobless [noise]\nFrom what I'm saying [noise]\n\n[noise]\n\nSo do many movie Mary from there these big election do of temper he bought in ...\n\nWith ... with small the typical role of the simple from the ... was not only an extremely important one for ... but also a chilling indication of how old the Bolshoi function during stone years\nBut its greatest here should be hurting the part that appears toward the end of the opera says much about the ... the Supreme example of A People's opera company but it also allowed machine or do something else\nIs simply because of his apparent Mac becomes the only one who can say to the old powerful czar what everyone is thinking mainly Denise murder\nAnd given the crimes of the mass murder them living in ... ... on her name was lost on no one especially after the turn of received for his performance the coveted stone right\n[noise]\n\nOh\nI\nSee [noise]\nThe knees\n\nWhoa\nWhoa\n\nWhoa oh\nYay yay\nYay\nOh I'm\nMe\n[noise]\n\n[noise] [laughter]\n[noise]\n\nThe the the new one ah\n\n\nHer life is\nAll day long every day\nDay\nLong long long way in la la\n[laughter] well uh\nOh oh\nOh oh\nBuddy or\nWas he would\nBe the name of the above\nAll oh whoa whoa\nWhoa whoa whoa whoa\nG. G. P. H. who\nDid he\nNot\n\nBe a\nLot of the\nFor your call true\nOh whoa whoa whoa [noise]\nYes [noise]\n\n... na\n[noise] [noise]\nOh ooh\nOoh Mm\nYeah he\n\n\n...\nCheese\nOh\nYeah\nYou\n\n\nWould ease you\n\nShe\nYou know not a\n\nG O", "show_name": "Record Shelf", "year": "2018", "city": "San Francisco", "day": "23"}