{"month": "10", "state": "TX", "station": "KTDH", "content": "Being a collaboration meeting platform allowing people to connect around the globe to get work done learn more it go to meeting dot com and from listeners like you who donate today's NPR station\nNo matter if you were a self proclaimed Newtown or just an interested party this is definitely an interesting mid term election cycle issues candidates the political arena is buzzing you hear about the issues and the candidates right here on H. B. PR your\nFinancial contribution right now it keeps it coming to you it's quick and easy to give on line and H. B. O. P. R. dot org [noise]\nMm\n[noise] [noise] this is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere on line at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support habit H. P. P. R. dot org for details\n[noise]\n\nSome composers easily fit the mold of the artist as confess or of his emotions the creative so with heart on leave [noise] his personal life are very much for finding expression is worth ... music fits them all but not here [noise]\nIf this music sounds much more likely to buy insurance costs you there's a reason for that [noise] it's pretty much what usually motion and confessional ... he was intending in this case I'll tell you why [noise]\nAbout ten minutes to seal [noise]\nThanks for listening so they can stay to [noise]\nLive from NPR News in Washington I'm jak spear\nAfter a brutal confirmation battle for Supreme Court nominee president Donald Trump took a victory lap at the White House tonight joined by newly appointed associate justice Brett Kavanaugh Trump attack Democrats and others recused of carrying out a campaign of personal and political destruction based on lies and deception what happened\nTo the Kavanaugh family violates every notion of fairness decency and due process our country a man or woman must always be presumed innocent unless and until proven guilty\nKavanaugh for his part thanked those who put him on the court while acknowledging the contentious confirmation process the ceremonial swearing in comes just two days after he officially joined the cord\nAnd most of the month before pivotal mid term elections\nSaturdays limousine crash in upstate New York is ongoing criminal investigation that's according to police and the national Transportation Safety board\nInvestigators are still piecing together what happened in the crash in school Harry that loved Eighteen people in the limousine and to pedestrians dead the driver was not properly licensed the vehicle had failed a safety inspection\nNTSB German Robert Sumwalt says his agency has questions for owner prestige limousines\nCompany's safety culture\nThe company's records records of prior clashes their management of drivers the fatigue management program vehicle maintenance fitness for ... driver fitness for duty we want to look at everything that we can\nPatient safety board investigators are still piecing together what happened in the crash in school Harry that lived Eighteen people in the limousine and to pedestrians dead the driver was not properly licensed and the vehicle had failed a safety inspection NTSB German Robert Sumwalt says his agency is questions for owner prestige limousines\nThe company's safety culture\nThe company's records records of prior clashes their management of drivers their fatigue management program vehicle maintenance fitness for ... driver fitness for duty we want to look at everything that we can related to the company that operated that lemons and\nThe crash occurred in front of the stores limos ferrying people do a thirtieth birthday celebration limo apparently ran a stop sign just part of the crash\nIt's been years since a firestorm in northern California wine country that left forty four people dead end damage Twenty one thousand homes Sarah was saying he of member station ... reports Napa County officials are testing new ways of communicating with the public during emergencies\nIt's windy and warm here in Napa red flag warnings are in effect I'm not like it was a year ago\nWhen the county sheriff's deputy ... drove around searching for people to rescue some of whom because of uncoordinated and to lead alerts were worn too late\nTo focus on people that you couldn't get to what you could have done differently\nThat sentiment that's threatening several changes chef John Roberts Senate putting special disaster sirens on squad cars to let people know\nIt's time to tune in time to turn on your television to turn on your cell phone to work with your neighbors communicate\nOther changes include mailbox evacuation tax for those who've left and a federal cell phones warning system set to debut here on Tuesday for NPR News I'm Sarah Varney in that but\nIt makes clothes on Wall street today the Dow was up thirty nine points to twenty six thousand four eighty six the NASDAQ closed down fifty two points\nYou have to be five hundred lost a point today you're listening to NPR\nBritish court is blocking a suit against Google which alleges the search engine company collected personal data on some four million iPhone users\nLegal challenge claims Google bypass privacy settings on iPhones to gather sensitive information for advertisers a judge from Britain's high court ruled today wasn't clear users suffered a any damage and to not allow the mass of legal action to proceed against the company\nEuropean Union leaders in media activists are demanding an immediate and thorough investigation into the murder of a boat carrying journalist over the weekend Teri Schultz reports that the last story Victoria marvel worked on was looking to misuse of eye you funds candlelight\nVigils are planned throughout Bulgaria to remember Victoria Marin ... she's the fourth investigative journalist killed in the new within the last twelve months\nThe committee to protect journalists in Bulgaria employ all efforts and resources to carry out any exhausted inquiry and to find those responsible for raping pledging and suffocating the thirty year old TV anchor and a reporter\nEuropean commission's those named margarita sin it's echoes calls for justice and for answers about whether the murder with link to her work\nWe must make the journalists everywhere are safe\nBulgaria hold the lowest ranking in media freedom among the member states for NPR News I'm Teri Schultz in Brussels\nEuropean airplane consortium air buses naming a new chief executive the company says its borders picked jump for Reed replace CEO Tom Anders in April for re currently serves as president of our buses commercial\nAircraft division he ended up Airbus Helicopters from two thousand Thirteen to February I'm jak spear NPR News\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for\nMembers state for NPR News I'm Teri Schultz in Brussels\nEuropean airplane consortium air buses naming a new chief executive the ... borders picked jump or read workplace CEO Tom Anders in April ... currently serves as president the buses commercial aircraft division he ended up Airbus Helicopters from two thousand Thirteen to February I'm jak spirit NPR News\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com and the ... foundation\n\nThanks for joining interesting but listening on Monday and it's ... I had the first to fuse for or casual switch coming up like a trigger for two men to Lin's by the ... later on\nIn this short piece by Sergei precocious gift which in under two minutes manages to encapsulate\nSo much of the very quirky sort of slightly off kilter middle ... since that for coffee of\nHad the march from the uh the absurdist drama the love for three orange is this is the group's ... ah\nThe march from the love for three oranges vibe recovery of this was the group's ... to ...\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nWhat about\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n\n[laughter]\nNo [laughter]\n\n\n\n\n[noise]\n[noise]\n\n[laughter] [noise]\n\n[laughter] [noise]\n\n\nMhm\n\nMm\n\nMm\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nYou know what\n\n... what do you\nHas to do and\nThat the ... switch number one by ... symphony orchestra\n\n\n[noise] [noise]\n\n[noise]\n", "show_name": "Evening Classics", "year": "2018", "city": "Dalhart", "day": "09"}