{"month": "10", "state": "TX", "station": "KTDH", "content": "Of October marks H. P. P. R. fall membership not wear a little short of that go but there's still time to make a difference every pledge matters become a high plains member listener go on line at H. P. P. R. dot or to give\n\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\n\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at H. P. P. R. dot org or call eight hundred six seven eight seven four four for\n\nA\n[noise]\nIf you were in band in school what instrument to declare [noise]\nWhen I was young I remember a lot of clearing it as being in junior high band\nThat there was a certain small kind of [noise] disdain for this instrument supposedly\nOne of the easy ones as opposed to those who wouldn't dare to pick up service [noise] how I Would love to tell kids of today when you're playing the clarinet you're\nHear his love for that instrument coming out in his flair and as you're saying it's clear that can trigger [noise] playing with a full Mozart clearing up control of coming up this hour or so you see on\nLive from NPR News in Washington I'm jak sphere President Trump traveled to Pittsburgh today to visit the synagogue that was the site of a deadly shooting over the weekend ... more on the president's trip\nAt the tree of life synagogue President Trump and first lady millennia lick candles for eleven victims who died after a gunman opened fire in the house of worship\nThe president and first lady also laid stones and white roses at a makeshift memorial outside of the synagogue\nThey've been traveled to a local hospital to meet with police officers wounded in the attack and to greet medical staff treating the injured Trump went ahead with the ... the Pittsburgh despite objections from some local political and religious leaders\nThe city's democratic mayor had asked Trump to delay the trip so families can hold funerals without distraction protestors gathered near the synagogue holding signs and chanting against shop ... NPR News\nPresident Trump wants to do away with birthright citizenship for those who are born in the U.S to parents who are in the country illegally but that may be harder than any things beyond W. V. okay radio in Lexington, Kentucky house Speaker Paul Ryan says Trump can't just make a change for example be an executive order\nWhat is it very clear is you can't change this via executive at a at the very least it would have to be statutory to Congress\nTop House Republican also noted GOP lawmakers weren't pleased when President Obama tried changing immigration law the executive order some constitutional experts have also questioned Trump's legal authority to limit what is currently a guarantee under the fourteenth amendment without the consent of the Congress\nIn Indonesia or the search and recovery operation is expanding following the crash of an airliner operated by budget carrier lion air divers continue to retrieve passenger remains with debris scattered over four hundred square miles of the java sea from manila NPR's Julie McCarthy has more\nInvestigators say it's too early to speculate on what brought down a new plane on a clear day the line\nFrom manila NPR's Julie McCarthy has more\nInvestigators say it's too early to speculate on what brought down a new plane on a clear day\nThe lion air seven thirty seven max eight one of Boeing's most advanced jets had only been in service to month the flight data recorder that provides information on the final minutes of the flight have yet to be recovered\nBut Clunes main line in what happened the night before passengers\nWho traveled from Bali on the same plane described to panic at the aircraft climbed and does it radically\nReuters news agency reports that data from the site flight radar twenty four show both flight experiencing unusual air speed and altitude in the first few minutes the c._e._o. of line air said there was a technical problem but it had been resolved Julie McCarthy NPR News manila\nDucks gained ground as investors were encouraged by some solid earnings numbers from several big U.S companies including Dow Jones component intel the Dow was appointed in thirty one points today to twenty four thousand eight Seventy for the ... up a hundred and eleven points this will be five hundred roast forty one points this is NPR\nFacebook has reported a profit but its overall picture for the past three months was mixed bears Jasmine Garsd reports accomplish struggles to keep picking up users due to conscience security breaches in privacy scandals\nThe good news or Facebook is it's still making money in the last three months more than Thirteen million dollars for advertising the bad news is Facebook's new user growth has flat line in the U. S. and it's declining in Europe\nThat might be due to ongoing privacy scandals cats last month the company reported that an attack on its network ... the data up to fifty million users Facebook has been warning investors that strengthening user privacy as a priority that will cost money and slowed down revenue growth\nThe company's stock took a dead after the earnings report that then Harvard back at around ... percent pay market close Jasmine Garsd NPR News New York\nThe heads of the major technology firms are warning or proposed digital services tax being put forward by the European Commission could result in slower growth in a decrease in innovation\nIn a letter to you finance ministers the heads of sixteen tech firms ranging from spot to fight a booking dot com so the effect of the proposal would be to undermine the ease stated goal the digital single market\nFirms went on to say such attacks last or her growth unemployment in the EU\nMission unveiled the proposal in March ... member countries should be able to tax forms of make profits on their territory even if they are not physically present could\nOfficers prices were lower today oil ending the session down eighty six cents a barrel or one point three percent the clothes it's sixty six Eighteen a barrel on the New York\nMercantile exchange I'm jak sphere NPR News in Washington\nSupport for NPR comes from the do the investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth fidelity brokered services allows the and Americans for the arts and Americans for the arts dot org\n[noise] good to have you here for good listening has always been a bar talks Hungarian sketches coming up Mozart's clarinet concerto Charles and I will play that for us a little bit later on the bass clarinet\n[noise] sometimes uh when I play this piece by Maurice Orville should though are fountains someone will send an email saying now should do it doesn't translate to fountains that's not an accurate translation that you're making well OK\nLiterally ... would be the ... the games of water or playful water\nAnd that's a nice way to describe found in those\n[noise]\nMore or less a nice way to describe some\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\nNo no no no no no no no\nNo [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nDa\nDa da da\n\n\nDa\n[laughter]\nNo [laughter] no\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nThe Hungarian sketches by the march ... festival orchestras conducted by he bought for sure\nMhm\nThe Budapest festival orchestra conducted by on Fisher\n[noise] Mm\n\n\nKnow\n\n\n\n\n\n\n[noise]\n\n\n\nMm Mm Mm\n\n\n\n[noise]\nUh [noise]\n\n", "year": "2018", "show_name": "Evening Classics", "city": "Dalhart", "day": "31"}