{"month": "10", "state": "TX", "station": "KTDH", "content": "A service you love joined us this Friday October twenty six that the H ... studio in Garden City to sample some tasty wine plus we'll be celebrating the one year anniversary of little ... from the prairie Valerie brown ... will be in house with my readings plus performances by Ron Raul than\nValerie Smith learn more at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream then please thank in patronize the community sponsors you hear mentioned on the air who helped cover the direct cost of operation thank you\n\nThe way Brahms articulate said phrases like us and it's like a ... insulation big\nThey might be inclined to side listening to the brand new recording to Brahms number three that I've got coming up for you which\nMuch of garden Swedish chamber orchestra about fifty\nI've seen seal here we are mid week like a great music for you for Brahms tell them on much more ahead stay tuned\nLive from NPR News in Washington I'm jak sphere the FBI is providing new details about what had caused potentially destructive devices center various high profile Democrats and the cable news network NPR's Bob respond has the latest\nThe FBI described five suspicious packages that were address two leading Democrats all large manila envelopes with the same return address Congresswoman Debbie Wasserman Schultz in office and Florida\nThe targets former president Brock Obama former CIA director John Brennan by way of the CNN office in New York George Soros a frequent contributor to democratic content Hillary Clinton and former attorney general Eric Holder\nThe FBI says the packages are being sent to its laboratory in Quantico, Virginia for further examination it'd be ... also says it's possible that more packages are still out there ... NPR News in Washington\nState media have published a security camera image of what they say is a vehicle blind to the Saudi consulate purported to be a scouting of force than the outskirts of Istanbul part of the killing of journalists ...\nImage obtained by state TV and other media today shows a black car with diplomatic plates an entrance to Belgrade forage Turkish president Recep Tayyip everyone has accused constantly officials are making trips to that forced and another area the day before the show was killed\nSaudi officials have claimed a journalist died after a fight broke out inside the Saudi consular nuts and bolts a federal judge today's ordering Georgia elections officials to accept absentee ballots and ballot applications with questionable signatures member station WBUR a bee in Atlanta has been trauma reports\nThan two thousand absentee ballots in Georgia have been rejected so far in some of them because people signatures on the ballot on bloods don't match what's on file civil rights groups filed to lock the seeming secretary of state Brian Kemp who oversees elections and is running for governor Sean Young with the ACLU of Georgia\nFile to lock the sitting secretary of state Brian Kemp who oversees elections and is running for governor shine young with the ACLU Georgia represented one group of plaintiffs\nElections officials who are not handwriting experts subjectively determined that there are things are so much even though people signature can change for a variety of innocent reason\nUs district court judge we may ordered elections official to give voters an opportunity to resolve the issue within three days after the midterm elections for NPR News I'm Nick named ... in Atlanta\nVoluntarily on Wall street today all three of the major stock market indices were down two percent or more dynamic ... grant for it in Chicago she says one reason many investors are so rattled the moment is the direction of stocks of stopping predictable\nUnfortunately the complacency ... market wasn't unarmed volatility we're seeing today is more than ... and you know reality is never as pretty as what we like it to be with\nToday's major declines blue trips are now down seven percent from their all time highs checking the numbers the Dow dropped six hundred and eight points today that I that fell three hundred and twenty nine points this is NPR\nDemocrats have been aggressively attacking Republicans swept the midterms were trying to repeal Obamacare as election day approaches Republicans are fighting back NPR's Danielle Kurtzleben has more\nMore than half of pro democratic TV ads in the home stretch to election day have mentioned health care compared to around one third of pro Republican ads according to the Wesleyan Media project that's a big change from twenty ten and twenty fourteen when Republican slammed Obamacare and Democrats barely touched the topic\nNow Republicans have ramped up their own messaging in a recent crop of ads GOP candidates promised to protect people with preexisting conditions however experts say the Republican Obamacare repealed do would likely have made insurance prohibitively expensive for some sick Americans Danielle Kurtzleben NPR News\n... Gibson which hopes to emerge from bankruptcy next month plans to do so with a new leadership team news released today the Nashville based company says James Jaycee Curley will become president and CEO of the company really worked for Levi Strauss and companies president of the Levis brand there was a member of its global leadership team\nOr the leadership includes ... who will be board chair under the new majority ownership group of the global investment from K. K. R. story brand Gibson has been building musical instruments were a hundred and twenty four years\nCompany will be abandoning efforts moving to the home entertainment and headphone categories that accounted for much of a debt roughly five hundred million dollars\nCould also features prices gained ground rebounding slightly from a two month low oil was up thirty nine cents or ... today and the session at sixty six eighty two barrel in New York\nI'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah while Christina Hendricks and Andrew rentals a new episode every Friday on prime video\n... thank you for tuning in\nAs we've reached mid week here it's a Wednesday and there's good stuff on the way a brand new release of the music of bronze his third symphony is just about ten minutes away he was running her ... of cologne was diverted into buying tell them on\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nOh\n\n\nOh\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nOh\nOh\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\nOr or or [noise]\n\n", "year": "2018", "show_name": "Evening Classics", "city": "Dalhart", "day": "25"}