{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nProgramming is supported by the Ord way presenting else the musical the hilarious tail based on the motion picture else tells the story of buddy the also journey to New York city onstage December fifth through the thirtieth tickets in more at ... dot org\n... and Susan Bennett here have been a partnership that's run groundbreaking restaurants pioneered food TV and help change the face of American culture\nAfter kind of keeping in touch when we ended up in France around the same time kind of serendipitously we um had a couple of bottles of wine [laughter] and I'm looking out the window and there was a rainbow and we said OK let's open a restaurant together and um I think the times that I appreciate Susan the most is when\nWe've gone through a failure for were failing because failing together so much more fun than failing by yourself when\nWe're celebrating the pair of this year's winners the Julia Child of wars and talking with him about how they started how the world's changed and how they have to together that's coming up on the splendid table ...\nLive from NPR News in Washington I'm Barbara Klein\nRussia is threatening to retaliate if President Trump withdraws from a Cold War era nuclear weapons agreement Trump said yesterday he intends to terminate the Nineteen eighty seven intermediate range nuclear forces treaty accusing Moscow of violating it for years the b._b._c. Sarah rates for reports\nIs calling a unilateral withdrawal from this treaty by the United states unacceptable and dangerous the deputy foreign minister insists there's no basis of President Trump's accusation that Russia has long been violating the ...\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nCan can sons Germany's foreign minister says Russia needs to address allegations that it's violating the treaty but he calls Trump's decision to pull out of it regrettable\nIn eastern Congo militant rebels have killed to health care workers manning an entry to an area that's at the center of an Bola outbreak NPR's Eyder Peralta reports\nControlling the cold outbreak in eastern Congo has been hard because it is in the middle of a conflict zone with many armed groups and health ministry says the local militia attacked two members of Congress rapid intervention medical unit\nHealth workers have had a tough time vaccinating against the disease because of persistent rumors that they are spreading Ebola and harvesting Oregon\nLast week a group of young bikers exempted the body of a friend to find out if it was intact\nAfter negotiation they agreed to re bury the body and be vaccinated against Ebola because they had handled been infected corps meanwhile attacks by the Islamist group ATF have continued this weekend to the group killed a Thirteen people in a town at the center of the outbreak in ... NPR News Nairobi\nSome Afghan voters have another chance today to cast ballots for a new parliament as Jennifer glass reports from Kabul yesterday's vote was marred by violence and disorganization\nDoesn't mean we used to voting booth at this ... it's one of the dot four hundred polling centers around Afghanistan hoping for a second day his technical difficulties poor management and violent kept some African it's been a poll Saturday I had ... is skeptical that this election will be better than previous one\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nDemocracy for NPR News I'm Jennifer lack in Kabul this is NPR support for news comes from\nT I Am a tea I Am committed to helping those who are driven by purpose reached their definition of success investing and nice banking retirement learn more AT T I Am a dot org\nFrom Minnesota Public radio news on John Wannamaker forty years ago today President Jimmy Carter signed the boundary water canoe area wilderness act while there'll be doubled UCA is revered by many at the time the law was extremely controversial wisdom Crocker reports\nThe law banned logging snowmobile engine motorized boats in much of the wilderness access that people who lived near the boundary waters had enjoyed for generations in April in Nineteen Seventy eight NPR reporter Alan ... spoke with a protester and dilute\nThe hot day where are you carrying the float around here I met him he told me about that I Want to be able to use the motor [noise] where what a ... and I think that with it and I want to be\nThe boundary waters is now one of the most popular wilderness areas in the country although elements of the controversy forty years ago and they're being repeated in the current debate around copper nickel mining near the wilderness Dan Crocker Minnesota Public radio news delivers\nWorkers remain on the scene of a semi truck roll over at the interchange of highway one sixty nine an interstate four Ninety four in Bloomington the ramp from our throat to east bound for Ninety four is closed as crews cleanup the crash of Minnesota frozen food and packing company is recalling more than two hundred twelve thousand pounds of ready to eat pork and chicken\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more headlines WC A. M. P. L. S. dot org\nIn both cases do institutional customers in several states including Minnesota in Minnesota United will be hosting its final game of the season\nThis afternoon final home game of course the moon's take on the galaxy at four o'clock vets also the last game at CCF banks stadium for the Minnesota United next season they'll do view at all on the field near their new that's of course their new stadium in St Paul\nAfter today's game there will be a lighting ceremony at the new stadium Ali aunts fields exterior surface can be lit up in a wide range of colors and the animated designs the formal ceremony as invite only but if you're in the mid way neighborhood around six thirty tonight look towards the stadium to catch the show\nThe show's Minnesota Public radio news the time ...\n[noise]\nI've read this land and this is a splendid table from age to be an American public media the show for curious cooks in ... the splendid table is supported by babble a language that the teachers realize conversations in a new language like Spanish French German\nNovelist ten to Fifteen minute lessons are available and the app store or online at babble da di di di town and die progressive insurance committed to offering a streamline shopping experience or home in auto can be bundled together now that it's a progressive\nWay more progressive dot com or one eight hundred progressive\nFunny right for the little things that stick out your memory like the stuff that's why is this even in my head start to\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAnd one night I'm watching people cook on TV [noise]\nWhich is kinda weird sisters have been nice but anyway [noise]\nOne of the weather on screen chopping garlic and she goes now you really want to find some good fresh garlic when it's really fractured almost wet when you cut\nAnd that's it that random moment has stuck with me forever but two years later\nI got my first cooking job and that changed my life [noise] okay so probably wasn't just because of that garlic moment on TV but every time I think of marriage the militant and Susan senator the shots were cooking on my TV that day I think about how many people\nThere were like me sitting in front of their TVs and seeing for the first time they used to make cooking seems so fun\nNow Mary students Susan are way more than just Tunisia [noise] they've been in business together for almost forty years they open a quirky little restaurant called city cafe\nTo help to redefine the restaurant scene in Los Angeles\nToday they have a wildly popular group of Mexican restaurants called border grill and they're active\nPhilanthropists and this year they're also the winners of the Julia Child awards given every year at the Smithsonian's National museum of American history or the Julia Child foundation and it celebrates people who've helped\nChange American food culture [noise] next year with me today to Mary Sue and Susan thanks so much for joining us great to be here thank you were excited to be here it's a great moment congratulations so much\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... started a word\nChristie early host of life from here [noise] you know they see this country has more divided than ever but there's one thing we can all agree on other people just look at mental and I hope you'll join us for a glorious evening of music and comedy that just might bring us a little closer together\nDuring the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota within again for Assad the war in treaty Mr Gabriel ... [noise]\nLive from here Saturdays at five Sunday mornings at eleven o'clock on Minnesota Public radio news\nI'm\nFrancis lamb and this is the splendid table the chauffeur curious cooks and leaders were brought to you by progressive insurance protecting commercial vehicles and offering specialized coverage is designed to protect your business more progressive commercial dot com\nAnd by double a meal prep service living fresh gourmet dinner gets that our table ready in Fifteen minutes with just one town got what does the work so you spend less time chopping and more time with family learned more gobbled dot com slash splendid\n[noise]\n\nWe're talking to ... this year's winners of Julia Child the wars and when we last left our her when they were telling us about the first years of their seminal LA restaurant city cafe for the French food [noise]\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOrg to learn more than\nOne day a week for ages and Susan I'm decided that she can take a trip and go to India and uh I'll never forget it the night before she left we were having a little kind of like a fake fight\nOr a race thing we were racing to see who could bona leg of lamb quicker and that's how it's worked out which I think I Want and\nShe didn't win because I like through my arm up in the air as in a gesture and she had her knife in the air and I cut the tendon and my finger\nSo I had to go to the hospital and get a cast and she was like oh maybe I Can't go and I said no no you got to go you got to go and so then there was me Jose Luis and [laughter] doing everything for those two weeks ago she was gone but what happened is when she came home\nShe was gung ho to put about you know four or five Indian dishes on the menu we did ... like little vegetable freighters we did a puente a pancake we made doll and curry and did it shot\nNavy and right and\nIt was really like immediately we just incorporated into the menu so it was all these rustic French things and a bunch of Indian\nThing yeah so that and and I had been so inspired over there by all the flavor profiles and just that it was such an interesting cuisine all vegetarian but it was the place where I I was staying on an Asher more a friend of mine lab I spent the whole time in the kitchen with\nHis cooks and all the women were you know not allowed in the main little kitchen they're basically we're just three holes in a cement block that you know you put a fire underneath the but all the women were out on the porch grinding spices making all the different\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAnd\nHad a very similar experience yeah my uncle was there and he I landed up so I could work in the kitchen of the hotel where he was and it had a big very very authentic type buffet and the woman who cooked it was actually the cook for the king and queen of Thailand for ten years before that\nAnd she didn't speak any English and I didn't speak any time but you know we got along immediately and we cook together all day every day for three weeks and then same thing I came home and we were\nYou know time Ellen salad and Chinese sausage salad anti red curry duck and I'm scallops and\nOh my gosh we have pictures that are just amazing and so then you know that our menu then became had cats who may and then ... hurry and then potato budget with mint cilantro chutney and then\nYou know ... and so it was a very mixed like that and one day the rigatoni that we bought from a person who made fresh pasta and delivered it came and it was like three or four inches long instead of the normal inch and a half\nAnd we were like what happened I said oh we had a problem with the cutter and blah blah blah blah blah and then I you know we were we this is how season and I kind of work together we're in the kitchen going oh you remember those chicken breast we we've got to use them today no matter what we can't let him go another day okay well let's just\nLet's make a sausage outta that chicken breast with a lot of ... stuff it into the rigatoni and then\nI don't know what do you think of let's just try with cream and parmesan anyway that rigatoni became like a signature dish that everybody ordered and so we had to tell the pasta company can you make our rigatoni long all the time [laughter] and literally it became one of those\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nDown in Mexico like our measurement bananas or you see something in the market I mean when we first decided to turn city cafe into a little tiny Mexican restaurant called border grill we went to Mexico for three weeks we drove around in a little tiny VW Bug and we\nYou know asked a trillion questions of everybody we could do find\nIt but if we'd go to the market and see something we'd never seen before we would buy it and then we would take it and ask people what it is how to use it with this chili that I remember we discovered Chipotle eat chilies and we'd nobody nobody knew what it should probably was more or less a chain of restaurants that it was Nineteen eighty five yeah\nYeah I mean we didn't you know that that first trip to Mexico we stay well our little kitchenette city cafe was myself and Mary Sue and a and a dishwasher\nBut then eventually we hired like a ... student who came in you know probably wanted like Eighteen dollars now is that no no no we'll hire you for like five dollars an hour or whatever it was a fantastic whatever minimum wage yeah and he said he came to work for his name was ... and\nWe loved him and we ended up going to Mexico City and staying with his parents in their home and his mom took us\nEvery day for a few days to the market this is our first chip and we'd like bought everything that we didn't know what it was and come home and cook with her all day so it was how we started to learn about\nMexican ingredients and and we fell in love with this cuisine and then we did this driving around where we just like ate everything we wrote our first menu in the Volkswagen bug when we came back we opened up and when we opened up with this you know Mexican menu and literally we had to take our ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nMid eighties this is not stuff that was happening and shut the restaurants and\nYou know people starting today have such a different frame of reference them and I think ... they they probably grew up with you know their favorite Thai restaurant that they went to near with their family and their favorite Mexican place so they went to an oath of all that stuff is already\nBuilt into so many American politics are growing up though\nRight you know when we opened city so the bigger version when we open city restaurant and it was and food that was influence from cities all around the world ... we put a ton dory of and in and we got that ... or even from a owner of a Indian\nA hotel he was an Indian man we went downtown in a pickup truck\nAnd picked up this on fire tend to hurry up and so it's just rock clay that's been dry and it's like held together with elephant hair\nAnd we brought it back in the back of a pickup truck hoping we wouldn't hit too big a bump so that it would crack and then we learned all about how to fire it and then we spent one day like fourteen hours where you have to bring it up to like\nTwelve hundred degrees we wrap their bodies so we could stick our arm in there because you had to keep\nRushing the sides with a brown sugar and mustard while in order to glaze it and we played Indian music and incense and then finally you know the night before our opening party and Ruth Rachel was there that night and wolf we may we that night like at three in the morning we finally made our first batch of ...\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAnd it's like and we are dead outta money we had to open because we needed some cash we couldn't even buy groceries so we had been in the kitchen with our health department or the okay for about maybe forty eight hours when we open the doors and we were flooded with [laughter]\nWas a ... in student senator the twenty eight the winners of the Julia Child\nThey had gone through their stuff ahead of time and had pulled out just boxes and tags and piles of things and you know to a curator that's just\nPaul adjust a curator of the Smithsonian's National museum of American history talking about what it's like to get the stuff that goes into the museum's collection\nStick around I for instance lamb and this is the splendid table from ATM American public [laughter]\nOn the next NPR News presents for another edition of the democracy test those social media and twenty four hour news coverage strengthened democracy or diminish your nealconan interest Oregon Heather ... Richardson Monday afternoon at nine\nProgramming supported by setter point energies home service plus serving Minnesota for over eighty years they professionals are committed to helping you repair replacing maintain your hard working appliances learn more center point energy dot com slash H. S. P.\nEditor said will Elizabeth Warren got in trouble for saying she had native ancestry\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nBlended table the chauffeur curious cooks in eaters were supported by progressive insurance but the name your price tool offering a range of coverage and price options to choose from now that's progressive more progressive dot com or one eight hundred progressive\n... online test prep for the AC tea that's designed to improve scores students can get video lessons practiced questions an expert support on line PetSmart go far and enjoy the ride Emma ... dot com slash ACT and\n[noise]\n\nSo the Julia Child awards are given every year at the Smithsonian's National museum of American history and part of the deal is that the winters all donates objects from their lives that helped tells the story there's Korea [noise] 'til their stuff actually goes into the museum's collection to be immortalized forever [noise]\nPaula Johnson is a curator at the Newseum and she joins us to talk about how she gets it gets [noise] he Paul a great to have high Francis\nIf you have a very cruel part of your job and that is you get to go to all the winners of the Julia Child award and bring back something from them to display in the museum so I wouldn't know what\nWhat's that like I mean what's that like standing in front of someone who's going through their stuff and you know they were thinking\nOh man I'm going to be in the Smithsonian\nYeah it is a cool part of my job I Will admit that it has been different for each of the winners to tell you the truth\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... dot org\nHad of time and by the time they came back with a very wonderful list\nI pretty much knew that there were certain things that ah stood out to um ... donated a collection of menus and as you probably know he is an artist and these menu or works of art and\nShow both of course the menu items but also he is women see as well as photographing documents and a few kitchen tools\nFrom Rick bail us ah we were able to collect his original field notes from his research in Mexico in the Nineteen seventies they are just fantastic because he was a an anthropologist of keeping incredible notes as he traveled around different regions of Mexico\nAnd the field notes are handwritten\nAnd then midway through they are typed\nAnd he realized that he really wanted to type is notes halfway through the trip so we bought a little typewriter and he donated the typewriter as well cool I'm from Danny Myer we collected around his concept of enlightened hospitality that really shaped and and drove his groundbreaking restaurants in in New York\nSo we have again another document this notebook of his conversations with people that he was asking for guidance dividing Union Square\nIt's quite a diverse collection as you can see we're really looking at again the biographies of people and their particular stories um this year I'm it's wonderful to have been able to go to Los Angeles and to speak with Mary Sue militant and Susan vinegar about it\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\nWhat the struggles may have been what were the challenges\nHow did they land on\nYou know this very successful formula that they have so for me it really starts with the story of learning about who the people are what the big themes might be in their in their histories\nAnd then to show up and talk to them about what that might look like what is the kind of the the kernel of of their their own history [noise]\nUm so I was delighted to be able to go to Los Angeles at the end of July and to meet them in border grill\nThey had gone through their stuff ahead of time and had pulled out just boxes and bags and piles of things and\nNow to a curator that's just you know that's catnip for like ... and I'm looking at that and I they had a pretty good sense of what we were after and\nHad come up with some great material so what is it what is it for their donor or do you ever need so much as yet [laughter] okay that's where we watching\n'em we are in the middle of collecting this material I'm too big boxes arrived a few weeks ago and in one box was Mary Sue ... knife bag um that she hacked\nFor competing on top chef masters when she did and twenty eleven\nAnd you know this is an object that we don't have anything quite like it in the collections yet and they're at all was um you know all beautifully arranged their six nights forced bachelors your chopsticks scissors Lester is all of this stuff\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAre um shapes that reflect the cuisine that they were really featuring in city cafe and so we have um a nice sized eight or ten pieces [noise]\nUm and to come to the museum we will have a ... um you know Mary Sue ensues and\nWe're very into color very early on and so we have a pink chefs coat\nI'm with border grill embroidered on the cough I'm which again was shows how they're very conscious of the fact when they are doing something on television that they can also show that border grill part of the camera angle on which is is wonderful um and then we've got\nYou know the archives are always you know very very interesting to go through I mean there's paper and then there's paper and\nFor us there were these little notebooks that didn't look like much but of course when you pick them up and you look at that and then you realize oh my gosh this is their first trip to Mexico you know trying to really research some of the colony roots of dishes that they were interested in for their restaurants [noise]\nSelf little no books like that not everyone from India and for Thailand sort of cool and you'd have to ... where you can sort of imagine as a researcher looking through this and\nSort of seeing the thought process of somebody who is curious about food traditions in other parts of the world and cooks and and people in other parts of the world and to then think about bringing that back for their restaurant in Los Angeles yeah it's so cool to because I imagine you know\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nThrough essentially somewhat like as you said someone's life story through the objects that they have held and written in is an emotional process for them\nIt is kind of um and in fact you will see people bring that stuff out and then it's there and then when we come and we start handling it gently of course but handling it and and talking to them about it\nYou know that the stories are triggered and when they start telling the story the meaning is made a parent of what this object represents to them and their and their lives and what they care about\nAnd there are these emotional moments when somebody will you know have that look on their face", "show_name": "Splendid Table", "year": "2018", "city": "Rochester", "day": "21"}