{"month": "10", "state": "GA", "station": "WSBB", "content": "That what you ask me is broadcasting University of Georgia board somebody by by them at a um seven fifty to broadcast restrictions\nWe cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nBe breaking weather and traffic you demand on now on W. W. F. B. radio women to the latest WSBIU more traffic on on demand and wait\nIn line continuing coverage of people you depend on\nThe radio I downloaded out in the outdoors\nUs be broadcasting University of Georgia ... buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through ws be radio dot com tune in and buy hard here the game and bulldog talk on these ... about them on your radio and on AM seven fifty when you ask me do when you add the programming continues here at a later our as\nNormal and all that [noise]\n\n\n\n\nBusy I hate it when I miss white and Jamie breed and when they stormed and relief power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news and traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now or do you have the radio ads downloaded out in the dark\n[noise]\nNow what do you ask me is broadcasting University of Georgia board ...\nBuy them at a um seven fifty a broadcast restrictions\nWe cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com and and I hard here the game at bulldog talk on these ... about them on your radio and on a um seven fifty W. S. B. W. at the program and continues here at a later our as\nNormal depend on it [noise]\n\n\n\n\nAnd ... how\nYou know breaking news weather and traffic you've and on now on your\nDoor you ever do you ask me radio I listen to the latest WSBIU more traffic on on demand way\nAlive [noise] continuing coverage on the news people depend on\nThe radio I downloaded out in the outdoors and Google Play [laughter] morning workout\nBusy I hate it when I this late in gym to breathe when storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out the door\n[noise]\nWhat you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports person\nThe broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and buy hard here the game as\nBulldog talk on these ... him on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road a ... hour\nCan you know breaking weather and traffic you demand on now on your\nDoor you know you asked me radio waves and to the latest WSBIU more traffic on on demand where\nAlive [noise] continuing coverage of people you depend\nOn the radio ads downloaded out in the outdoors\nNobody us be broadcasting University of Georgia sports on TV by by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on the ws me radio up north through W. S. B. radio dot com tune in and buy hard here the game as\nBulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and Jamie brain when a storm didn't release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P ... piece of all their\nTheir latest news in traffic on demand is always the weather coverage what about when something happens breaking news staff is your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now or do you have the radio ads downloaded out in the store and play [noise]\nThat what you asked me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions\nWe cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com Julian and hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty don't you ask the W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nOn ... hour\nHear breaking weather and traffic you've ever been on on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on demand where\nLive came around\nPeople you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss late and James brain\nStorms and relief power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading not happening right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north through W. S. B. radio dot com tune in and I hard here the game at Boulder\nMute ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal depend on it\nSo later our as normal depend on it [noise]\n\n\n\n\nI'm a junkie from here on the road on ... hours\nThat can be breaking news\nWeather and traffic either end on on your\nW. W. F. B. Radio Welcome to the latest WSBIU or traffic on on demand and wait\nIn line continuing coverage on the people you depend\nOn the radio out downloaded out in the outdoors\nNow what you asked me a broadcasting University of Georgia board or\nNot he bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north through ws be radio dot com tune in and buy hard here the game and\nBulldog talk on these ... them on your radio and on AMC seven fifty U. S. B. W. at the program and continues here at a later our as\nNormal depend on it [noise]\n\n\n\n\nBusy I hate it when I this latest James the brain when storms and we lose power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates of all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio and download it out in the dark and they'll play [noise]\nNow what you asked me a broadcasting University of Georgia board not buy buy them at a um seven fifty deliberate kept restrictions we cannot allow for the ... presentation on the USB radio up north drew double USB radio dot com and and I hard here the game as bulldog talk on these\n... them on your radio and on AM seven fifty U. S. B.\nW. F. B. program and continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... power that can be\nBringing weather and traffic you've and on on your skin\nW. W. F. B. radio\nListen to the latest WSBIU more traffic on on demand and wait\nA live coverage on the people you depend\nOn the radio I downloaded out the door and go play [laughter]\nA busy I hate it when I miss white and Jamie breed when they stormed ... power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and get it on the line\nWith us be broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nOr through ws be radio dot com tune in and I hard here the game as bulldog talk on these ... about them on your radio and\nOn a um seven fifty W. S. B. W. at the programming continues here at a later our as normal and on it [noise]\n\n[noise]\n\n\n\nYeah I'm a junkie here on the road a ... hour\nYou know breaking news weather and traffic you know on your\nDoor you had to do when you ask the radio waves until the latest WSBIU more traffic on on demand when\nLive continuing coverage of the people you depend on the radio out download\nNow what do you ask me is broadcast University of Georgia sports on not by by them at a um seven fifty do the broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up\nNorth through W. S. B. radio dot com tune in and buy hard here the game a bulldog talk on these ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nA busy I hate it when I miss ... and James brain when storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece all their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio and download it out on the store and get it or play [noise]\nThat what you asked me if Ron camping University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on\nMs ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie for my family on her own a ... hour\nBe breaking weather and traffic you demand on now on your\nW. W. F. B. radio until the latest WSBIU more traffic on on demand for\nAlive [noise] continuing coverage on the news people you depend on the radio I downloaded out the door and go go play [laughter]\n\nBusy I hate it when I this white and James and brain storms ... power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now or do you have the radio ads downloaded out in the store and it'll play [noise]\nNow when you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at\nNormal and on it [noise]\n\n\n\n\n\nYeah I'm a junkie here on the road ... how\nBringing weather and traffic you've and on now on your skin\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand and\nLive coverage on the people you depend on the radio I downloaded out in the afternoon\nNow what do you ask me is broadcasting University of Georgia sports or\nNot he bought by them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nMorning workout\nBusy I hate it when I this white and Jamie the brain when it's warm than we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now to do what do you have the radio I downloaded out in the store and it'll play [noise]\nThat what you asked me a broadcasting University of Georgia board somebody by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through ws be radio dot com field and and I hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road a ... hour\nYou know breaking news weather and traffic you demand on now on your\nDoor you had to do you ask the radio I listen to the latest WSBIU more traffic on on demand way\nAlive continuing coverage on the news people depend on the radio ads downloaded out in the outdoors\nAnd go play [laughter] morning workout\nBusy I hate it when I this latest James brain\nWhen they stormed and we lose power when\nThe guy you know you can listen to W. S. P. anytime anywhere with the ws be real advocates all their their latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and we don't play [noise]\nNow what do you ask me is broadcasting University of Georgia ... buy them at a um\nSeven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm a junkie brain here on the road ... PowerPoint\nCan hear breaking weather\nYou know breaking weather and traffic you demand on now on your door you had to do when you ask the radio waves until the latest WSBIU more traffic on demand and\nLive continuing coverage from people you\nDepend on the radio out downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on ... by ... am seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\n[noise] [noise] morning workout\nA busy I hate it when I this white and Jamie breed when they stormed the Willis Tower would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio and download it out on the app store and get into play [noise]\nNow when you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north through W. S. B. radio dot com Chilean and I hard here the game as bulldog talk on ms\n... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... power\nHear breaking news weather and traffic you demand on now on your\nW. W. F. B. radio I listen to the latest WN meaning more traffic on on demand and\nThem alive continuing coverage of the people you\nDepend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this latest James brain when a storm didn't release power one\nGuy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store\n[noise]\nThat would you ask me is broadcasting University of Georgia ... buy them at a um seven\nFifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on ms ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\nTo get to free tickets to the fans workshop call one eight hundred three hundred Ninety forty four seeding is extremely limited call and the next ten minutes and you'll also reserve of free copy of fans money for deals guide that's one eight hundred three hundred Ninety forty four that's one eight hundred three hundred Ninety forty four\nVisit us we radio dot com and register for a chance to this week's loyal listener and the winter gets to the classical crossover drew hill on their time was tour November twenty first because energy center tickets are on sale now I've lived nation dot com [noise]\n... FM doraville er Cox media group station\n[noise] twenty four hour news weather and\nFive and a um\n[noise]\nNow seven o'clock and Jennifer regret that live in the devil you let the twenty four hour news center with deadly you at the top story that's our [noise]\nOnce again the communities coming together and Pittsburgh in memory of\nThe eleven people killed in yesterday's shooting at the tree of life synagogue among the speakers the executive minister of southern Pennsylvania is Christian associate the Reverend lady Barlow says in the face of violence every people every religion stands together and\nCame to a Christian sanctuary at mother a nanny in Charleston at Sutherland Springs in Texas you stood with us and today with our whole heart we stand with you\nThe Jewish federations Jeffrey ... the federal government should investigate\nNation needs to come together\nUnder the common sense of how we stop ... like this from happening ever again New York\nCity the Empire State building dimming the tower lights and illuminating the masked in orange the color of gun violence a weird ... holding her ABC News\nAnd synagogues all across the country remembering the victims Bradley ... the rabbi at temple Sinai in Sandy Springs\nThe fact that so many people showed up today after the events that are really strong message to all those who think that they can deter Jewish future and the the\nUT the Jewish experience with\n... security has stepped up across the country\nThe Syrian with bullets officer security has stepped up across the country out that there is patrolling outside many of those synagogue is hearing and metro Atlanta as well sixty one degrees in Atlanta clear and cool tonight Los fifty sunshine tomorrow high Seventy Atlanta's most accurate and dependable forecast is coming up\nLife returns to normal at Atlanta's Hartsfield Jackson airport one day after his fishes package scare\nA suspicious package down Sunday outside the airports international terminal brought out Atlanta fire police and the bomb squad to the scene to investigate an airport spokeswoman says the package turned out to be to flashlights and with the radio the investigation wrapped up into seem cleared about an hour and a half later\nTelling us the Cheryl Castro reports the Atlanta Airport incident comes just days after a Florida Man was arrested accused of mailing over a dozen pipe bomb like devices are prominent Democrats and their supporters\nFirst first this is W. B. twenty four hour continuing our attendance\nUp one side to number six in the eighties college football pool after beating Florida yesterday Florida tumbles for number nine to number Thirteen\nThe falcons had the NFL Sunday off meanwhile the league today wrapped up in a series of three games in London as the eagles beat the jaguars twenty four to Eighteen in game five of the world series tonight in LA after a surprising Red Sox win on Saturday\nNight the Dodgers tried to hang on the red Sox are one victory away from winning the series telling us the new Simon seven oh three\nTwenty Eighteen mid term elections Republicans and Democrats battle it out for control of Washington and the state of Georgia follow it every step of the way we do free and the southeast largest news team amused by five Pan Am seven fifty do you asked me\nTo get her Dale card well here I Want to thank you personally but the overwhelming response we've gotten to our investigation into the gimmick of leasing when they tell you everything is free to get a new air conditioning and heating unit all you pay is a small monthly fee I'm especially pleased to know we've actually\nEducated homeowners before they fell for this too good to be true proposition which goes something like that they say you'll never\nHave to buy a system again and for a small monthly payment they take care of everything here's what they're not telling you it's a leaf by the time you're least term is up it's possible you've paid far more than if you're purchased it wants to stop leasing\nYou'll have to pay a big residual payment to buy out your lease and if you want to sell your home the leasing company gets to do a credit check on your potential buyer I'm especially happy to know we've prevented some single moms from falling for this expensive give it\nWants to see the fact check out my free research report on line and fight heating and air companies that offer my make it right guarantee at trust they'll dot com slash know leaf\nHey Sean Hannity here from my friends at runners warehouse and I'm here to talk about TNT\nThat's top notch tenants people who'll respect your property they pay their rent on time\nAnd are good neighbors to those around them you know top notch pennant so the key to making renting rock and you find them by partnering with runners warehouse once your property is in rent ready condition runners warehouse taps hundreds of Web sites they ... thousands of potential runners\nThe score you top notch tenants in just a few weeks on average or they do walk through they do the thorough background checking credit checks\nTheir system at least documents inspections rental licensing everything that builds a solid foundation for a great relationship between you and your renters plus for one low monthly flat fee winners warehouse manager property twenty four seven\nTo keep your renters happy now there's no upfront fees no binding contracts and you can cancel at any time they have a number in Georgia for all for six six two twenty three twenty two runners warehouse great tenants live here\nThe salvation army project share it helps your neighbors in need with basics like food and utilities for as little as a dollar a month ... George power bills you can make a big difference and George powerful Metra donations up to one million dollars a year visit Georgia Power dot com slash give\nYou all depends on WSBIU came during your daily commute give yourself one more line of defense against major traffic problems over the u._s. be tripled in traffic colored hair fall I Want to get sucked sucked coming\nDown the side or automatic when us audio alert and another and do what do you ask for your marriage and when you asked\nMe for ... she'll know dental you\nMust be twenty four hour traffic center earlier crash by somebody if I sound Benedict seven highway Ninety to that and cleared and only three of them but you're still flew up to half a pound like parkway earlier crashed ... he's done on the ramp to eighty five ... junction still blocking the left lane they're causing a just a bit of delay in roadwork on Seventy five north down\n... leads from del up to the north Lou this report sponsored by usa a life insurance company help secure your family's tomorrow for less than you may think visit usa dot com provided by usa a life insurance company San Antonio Texas chill Nelson WSBIU\nI'm just watching movies are all just read it with the most accurate and dependable by the forecast mostly clear and cool this evening and overnight by Monday morning we're down to fifty sunny and Seventy tomorrow afternoon Tuesday sunny low forty\nSeventy tomorrow afternoon Tuesday sunny low forty eight high Seventy three then mostly sunny Wednesday with the highest Seventy seven\nSixty one degrees on Peachtree Street at news Ninety five and seven fifty dabbling us be depend on it the information presented on this program is not intended to take the place of your personal physicians advice and it is not intended to diagnose treat cure or prevent disease\nDiscuss this information with your own physician or health care provider to determine what is right for you\n[noise] want to learn today was something completely different from\nDoctor showing\nHow did you hear so where do we spend a bit of time together fun show today as trying to make every show ... I've been talking about foods that he'll and then foods\nThat harm as well and a lot of you may be having problems and you can't figure out how people have help from can't figure out which means a lot of you do of course you do I see it every day at our officers so patients come in and they say doc I've got this and this and this and I sit there with him and I listen and many times\nMost times within five minutes of talking to him I can ask them questions and also you drink diet soda yeah I Do all the time you\nDo anything with a modest when glutamate in it what does that nothing about processed foods ... acid and they say yeah I Do it all the time and so a lot of the symptoms you may be happening having could be caused by some of the food you're putting in your body innocently\nUsing I've headaches every day I Can't figure it out there is no pattern to it there is a pattern to it I'll I'll show you how to find it and so people come to me all the time and they say doctor Joe I'm looking for a pill to solve this problem now I get emails from listeners all time and I got a I Want a pillar lose weight I Want a pill for my sex life I Want a pill to give me more energy\nWell we have supplements we have a lot of supplements and I created them and and they work very very well for most of the questions you ask because I designed them around you ask me questions\nBut then I have to sit down with them and say listen you can do this if this is the only thing you want to do that's fine I always say the minimum amount of nutrients you should get his doctor Joe super greens and Dr Joseph central source the minimum amount of nutrients and those are two supplements or on the website Dr Joe dot com\nBut then I'll say we also maybe want to consider changing your diet you may be a chiropractor care if you have pinch nerves chiropractor to fix that\nUh we may need to change our sleep patterns so we will try to get to the cause of your problem and not just treat the symptoms and some people who say maybe Dr John ... I really don't want to diet I don't want to exercise I just want to tell us can help me lose weight\n[noise] well I Wish that pill existed but it doesn't and you can read that you know you see all these ads and you'd probably get emails for magic pill Dr secret I Love that one\nJoe here's a lead you with us today as always it's a pleasure having you here and thank you so much for telling your friends of the show is just growing in leaps and bounds every time I talked to my uh\nMy social media folks in my my Web designer folks and they're just saying listen we're getting so many people go into the website and I do appreciate that thank you makes you follow us on Facebook follow us on Instagram a because we do video live stream a lotta these shows and um you can always watch them live if you want to and we always take those shows and put 'em on our website\nDr Joe dot com and so you can watch or listen to a archive shows podcast as they're called in the modern day\nUm and sometimes people upset with Dr Joe what about a certain topic and maybe a few weeks ago I did a whole two hours on that topic you can just go listen to the show if you have health care question give us a call here in Studio ... for for for for Dr Joe that numbering sort of my officers when I'm not on the air\nSo here's the thing whenever I went to a party this week actually and bunch of different doctors ... medical doctors neurosurgeons come up to me and they always ask about the show and ask about the research that we do and ask about a day of questions himself has got to remember where doctors were also patients\nAnd the thing is that most doctors and I'm not knocking them for this believe me 'cause this is a little little habit of mine little session of mine is I read research so maybe Dr Read one article in New England Journal of medicine or whatever the journals American Medical association and they find out one topic on one thing and they say okay now I understand that\nBut they're missing a lot of other topics\nThat is why this folks that myself and other people that sit there and just scour the research constantly trying to come up with new researching new ideas so that we can share it with\nYou guys years ago\nWas how did you get started into this thing uh I I I was living in Georgia drove up to New Jersey to visit my family and it was Christmas I drove back and I was so poor\nAt the time I just graduated college had no money and I started bicycling to the grocery store not near my a rundown Roach infested apartment\nAnd I go on Tuesdays 'cause they had dented cans of food and bad torn bags of rice and um I Would buy that stuff and I live on it because it was so cheap and I started feeling really good\nI couldn't figure out what was different in my life and then I realized I was eating a plant based diet\nIt was by accident that it started and I started saying gosh I feel really good my sinuses aren't running my stomach feels better not blown out\nAnd I started saying gosh I feel really good my sinuses aren't running my stomach feels better not bloated like I used to be and that's when I started realizing what what is it that's different and when I looked at everything I realized that was in and after studying all the degrees I have several ... nutrition\nRealize that the only thing that made sense was eating more plant based foods and so when people come to me and said Dr Joe I've been told is nothing that can be done for my condition that might be true however there might be in the alternative world options that we can introduce for you\nAnd I love coke managing cases we have a medical doctors all the time we manage cases together and we'll do a chiropractor part of your medical part with the nutrition part and then we see some amazing results\nSo I'm not saying don't take drugs I'm not saying don't have surgery if you need it absolutely take it but we want to try to get to the cause of the problem not just treat the symptoms so I told you before going to talk a little bit of an MSG and I really haven't covered this a whole lot and hardly any shows and all the years I've been on radio\nSo I've been studying MSG for about Thirty years that's kind of when the research started coming out and it's called ... toxin what they do is they they particularly attacked the brain cells and they over stimulate them to the point where the cells can die\nSo dietary always stimulation through panic acid receptors transmit signals to the nervous system north ... acid receptor the cells have little ports on kind of like a star trek type thing where the ship can pull into another ship\nIt that's what happens in your cells you have these docking stations were different nutrients can be absorbed you might have a vitamin D receptor site you might have a good time of gas receptor site um you might have a hormone receptors site so there's a lot of different receptors sites on the cell and we learn more and more about this every day\n[noise] and so when you get MSG with him a gas that there's a receptor site on the cell and it can kind of dock with the cell and if you have too much it over stimulates the cells and the cells can actually die so why do we even have MSG well good time a gas it is and ... and but\nIt also was a flavor enhanced her now when I went to school a couple a hundred years ago we learned that there were a sweet sour bitter and salty taste buds on your ... and that's how they work and you pass the test of you wrote those four things down and you got an a\nWell recently in Japan we discovered a new taste bought\nYou would think after all these years and older dissections and and we've torn apart bodies that we ... we wouldn't find anything new we found the new taste bud\nAnd the taste bud is called NO mommy taste but I Know sounds silly mommy right well mommy taste buds are stimulated by savory things so like a steak or a gravy or something that's rich and savory it didn't make sense to me when I was in school sweet salty sour bitter what about a steak\nHey now we know we have a mommy taste buds so modest sodium glutamate ... asked it stimulates do mommy taste buds and enhances the flavor it stimulating a whole nother taste but so you're tasting things on his taste much better\nThan something without it so we add MSG and originally we use the seaweed extract we need is way back when in Japan and it it had other nutrients mixed in with it and it's so it wasn't this barrage of lieutenant gas it well once we realized we can make ... acid\nBacteria make it and we can take this concentrated time of gas had modeled sodium glutamate well that's when things went wrong\nWe messed with Mother Nature member commercial it's not nice to fool Mother Nature\n[noise] so that's where the problem comes in and if you eat packaged food\nRead the ingredients and a little bit when when do you have coming up soon I'm going to list all the different names that monitoring glutamate hides under\nThat go to our website Dr Joe dot com one of my books I wrote called eating right for the health of it we have a whole chapter on this specific topic\nBecause it's such a big issue in the world the chiropractor my team of doctors and I we want to protect your nervous system the best we possibly can from physical damage pinched nerve bones out of place muscle spasms and that's why chiropractic work so well in most cases with paid\nBold moves out of place to slowly get the joy to pitches interviewer takes the nerve and you have pain high practically we put the bones back in place most times the pain goes away it may take several visits and don't get excited if it doesn't happen to one visit and people love us\nThat's pretty awesome but in our officers we all want him we also want to make sure you're not irritating the nerves from a chemical standpoint and Montessori glutamate is one of the things that can do it now if you have aspartame which is an artificial sweetener which is in about six thousand different products probably more than that now\nThat's another issue because when you start mixing the do we've got a problem now we thought we'd have a gas receptors only existed in the brain they find in just about every Oregon the tissue in the body that means when you eat foods that raise you panic acid levels it affects the cells throughout the body\nSo I don't think just because you ate it you didn't have a reaction well I don't have that problem I\nThey just because you ate it you didn't have a reaction well I don't have that problem I eat MSG I don't have a headache and it's affecting them I promise you it's called sub clinical now sometimes called Chinese food syndrome right you go to Chinese restaurant to eat MSG gotta headache MSG and yeah you know about that you're the lucky ones\nYou are the ones that know that it was time of gas is affecting you my concern of the folks that don't get a reaction because when you then because you have a problem you avoid it if you don't know you're having it and it's a problem now if you take MSG and combine it with aspartame\nThe blood glutamate levels are twice as high as they would be if it's MSG alone but he aspartame actually makes it works works to break if you have a health care question give us a call your studio for for for for Dr Joe my website is Dr Joe dot com hundreds of hours over a thousand hours podcast their video audio you can download them if you want to\nIf you have questions give us a call here to studio a for for for for Dr job you can send them to my website if you don't get on the air today did you want to make an appointment to come see us in Atlanta area we've offices in Marietta\nDelusion suffrage I don't go anywhere I'm Dr joyous was you know we'll be right back\n[noise] welcome\nTo Jimmy can hide your new nine weeks it was so good how do you make the highest quality ingredients in line I mean we definitely don't think that long when it's fake pairing thing to baby right and we don't do the baby carrier to carry the one ... green we sent to the ...\nI mean not face these damages\nOkay I'll take a turkey Tom oh don't name on it makes it harder\nDry our new nine green we ... we get ... yeah my\nRenowned medical correspondent and endurance race champion pop are not empty people ask\nMe how can you keep eating at the age of Seventeen healthy living is important which so his name if you have paid you can't train so improves I discovered salon ... plus this unique topical pain reliever contains too safe and effective anesthetics nothing as work better for\nSalon ... cream or wrong [noise] hey Sean Hannity\nHere from my friends at runners warehouse and I'm here to talk about TNT\nThat's top notch tenants people who'll respect your property they pay their rent on time\nAnd are good neighbors to those around them top notch penance of the key to making renting rock and you find them by partnering with runners warehouse once your property is in rent ready condition runners warehouse taps hundreds of Web sites they but thousands of potential runners\nYou're welcome thanks for listening guinea and folks all this up as we talk about our most and run a website Dr Joe dot com also available on Amazon but you've got a website Dr Joe dot com we have a whole page in the store my books are there and my supplements are there uh we have a ... a blog I write articles if you want to be my articles if you're a reader\nUm if you like podcast we have audio and video so go there and make sure that you pick whatever way you like to learn and start learning all sorts of new stuff\nOr how we do it on I guess we'll take another ... another call and let's take another call if you have a question give us a call for for for for Dr Joe\nWayne how can make your day better a digital how're you doing I'm very good sir\nGood question I have a child who was um he has ADHD sure and um when I went to the doctor the doctor said during basketball and medication you know\nIt's some of the brain of stuff that I Know what is in ... and you can resolve situations that will do it to use his education that I Do not show al ... says Russian uh\nADD is a big question is the number two article download it on our website a number one is about acid reflux and I'm going to tie those two together for you\nHer stomach job your stomach job every stomachs job is to break proteins into something called amino acids seafood a hunter Clark asked that activate something ... it breaks down the proteins into ... they'll say just dissolve it basically one specific amino acid called trip to feign\nGoes into her small intestine combines with vitamin B. six so she needs to be vitamins as well great to chemical called five H. D. P. which becomes a chemical in her brain called serotonin hey\nUh serotonin is dinner transmitted helps her focus and come down with ADD and ADHD patients we find that this is Sarah toning issue so the medications we give those patients are to utilize the serotonin more efficiently\nWhat if we just made more ... [noise]\nWell there's a novel idea so chances are again I don't know I don't you do anything about your daughter but chances are she's probably got some digestive issues sheet bad gas ... a lot probably bloating she's probably very ...\nUm because that's signs at the digestive system isn't working properly\nSo what we need to do in most cases and I've been doing this for thirty four years now we're just the stomach acid reflux heartburn burping gasoline we take the stomach and massage or put down away from the diet for him and when we do that the stomach relaxes and is able to break the proteins down into the amino acids to produce the nerve trends matters\nSo for someone like her I Would you know I'm assuming shut digestive issues I've never seen one somebody would ADD who didn't have it in thirty four years I Would get around Dr Joe super greens and Dr Jones essential source which is the minimum amount of nutrition\nDr Joe super breeze and Dr Joseph central source which is the minimum amount of nutrients you need to every single day\nUh bring it to come see us if you're in Atlanta area bringing right to see us and we can work on her stomach and then we do a further work up to see what other kind of nutrients we need I probably get on the vitamins as well 'cause you got to get to be six so if you give the body the raw materials hopefully can start producing the neurotransmitters so that our whole life turns around and then we got to get her off the sugar as well\nSo you're saying that the plant\nAre okay so I guess I Need to just bring him in ... so it can um public should do tend to have a candidate of the guys are\nBy far the easiest thing to just bring her into Russia and if you go to a website Dr Joe dot com or you can book it right on line or if you dial this number eight for for for for Dr Joel we're not on the air\nOr you know during the week you could always just calling for for for for Dr Joel get are set up as soon as part\nOf the shows that I call him the last year and then we can take care of it and we actually gets\nVoted ... thanks so much and that's a real good question because I see that question all day every day and it it killed because I\nI'm sure I had ADD we didn't have a name for back then you were just a jerk or the class clown or when you got smack around locked and that's what it was now looking back sure enough all the things that our research and a lot of the techniques we've designed to develop for ADD patience\nI had a little sign those were tickle Asia had burping a lot of bloated all the time I wasn't that Jesse my food properly and then once I started getting my stomach fixed\nAnd I got on things like Dr Joe super green thought Joe central source raw food a lot of salads a lot most of those problems just went away\nIt's pretty simple stuff so it's kind of neat um\nFuck I go to a break when I come back we're going to give you a list of things the way ... that that is actually MSG in disguise you can be blown away by knowing what you're eating insects you monitor what he would've made affecting that schools have a gas receptors I\nHave you ever get question give us call ... for for for for Dr Joe my website if you want to get supplements if you have questions or listen to the broadcast want to make an appointment Elana area we have offices in Marietta diluting suffrage we would love to be your doctor's help you get well and say well but Saudi softer Joe dot com the number is eight for for for for Dr Joe ... where we write back\nAnd [noise]\nSound like you neck pain back pain shoulder pain headaches chances are you benefit from chiropractic care\nMost people benefit from chiropractic care because chiropractic care tries to get to the cause of your problems and not just cover up the symptoms if you're ready to get well once you go to my website Dr Joe dot com or call a for for for for Dr Joe and make an appointment for you and your friends and your family today\nWe have officers in Marietta Duluth and Stockbridge make an appointment today so we can help get you well and keep you well\nIf you're struggling to find job related help for your child the disability Tommy nobody center it's helped train thousands of people with disabilities by meaningful employment locally people like leases son\nDynamic than our game I signed the training I mean very confident and you need to take on independent I Know I don't worry about him being able to support himself thanks for coming in our future looks bright\nHeld the ... center continue to impact families in our community by donating cars or a monetary gaffe now and Tommy now the center dot org\n[noise]\nI recently learned that the average person than four hours a week on line as a small business owner without a lap cat in St funding Kathleen none of those hours I had to ...\nGo daddy I got\nThe hate them a name and show some hundreds of modern designed for all kinds of restaurants to real estate I connected my social programs\nTo my site and you hire enveloping Google Search as any time in\nWith no second guess certainly facing during our and when I needed have their own\nLand twenty four seven divorce but at the ready to make the idea of real\nGuy that can make your own way for free at ... dot com [noise] all the\nAnd how do you need to feed on line [noise]\n\nThere's something so unique about a business built on family in his nurturing with a level of care dedication and respect that sets it apart Hi I'm Monica ... and for almost forty years I worked for a family owned business WSBIU TV\nAnd that's what I found when I walked into Woodstock furniture mattress outlet a family owned and operated business that started out Thirty years ago as a small variety store and the heart of Georgia they pride themselves on selling better quality furniture at lower prices\nBut what I discovered is that the heart of their business is the desire to serve you the customer\nThe Aaron family provides a friendly laid back atmosphere with hands on customer service it's one of a con shopping experience with great deals on everything you can eat but your home Woodstock furniture mattress outlet found that secret to success it's view the customer\nStopped by one of their seven convenient location sedative experience of Woodstock different\nStop by one of their seven convenient location sedative experience of Woodstock difference does it Woodstock outlet dot com for location near ...\nAre you scared of the ones just before your lights go out who knows how long you be sitting there in the dark it's automatic backup generator kicked in as soon as your power crashes but you need a pro to design your system generators or not one size fits\nAll we'll get your free system designing estimate when you ... ... I'm Dave bigger now my ex virtue never leave me in the dark right box electrical get up to one thousand dollars off in two years maintenance for a limited time called bright box electrical and don't fears\nTradition meets technology this month group of piano way Cooper here and we'll show you how to teach yourself and play the piano in no time using the latest key word products with apps on your mobile device that the way we can to me and I have to acknowledge enormously on al Cooper piano\nSteinway yum all ruined task do and why five clear here comes the use of our location under the giant neon ... south between Claire more and more through jails details on line and if you haven't got caught it appears\nWe've saved some listeners a lot of pain aggravation and money and some are about to get her Dale card well here earlier this year I started warning you about a relatively new gimmick in Georgia\nCompanies wanting you to leave your home heating and air conditioning unit their pitch claims everything's free and you'll never have to buy another system in for a small monthly fee they'll take care of everything here's what they don't say\nYour payments may go on for ever and be prepared to pay huge residual buyouts if you want out of your least see my full report it truck they'll dot com slash know leaf [noise]\nSome forty eighth grade carrier Depp yes the twenty four hour traffic center\nEarlier crashed to anybody found on the ramp to eighty five now than his guinea junction having left lane block that taking their time getting that thing out of your way roadwork on Seventy\nFive north down still blocking for right lanes from two sixty one don't grow up to exit two sixty five north loop roadwork housing happy delays imprecise county foreigners doubt that from sixteen pilgrimage down to bald rich marina wrote exit Fifteen to write lanes block through their only the left wing getting by and the moonshine festival in ... bill\nHas several roads closed around highly fifty three until later this evening avoid that area if possible kill Nelson W S P", "year": "2018", "show_name": "The Mark Arum Show", "city": "Doraville", "day": "28"}