{"month": "10", "state": "PA", "station": "WVYA", "content": "For your membership learn more about membership and signed up today\nAt W. V. I. A. dot org\nThis is W. B. I. eighty nine point nine up at W. B. I. H. D. one scratching Wilkes Barre Hilton W. B. Y. eighty nine points out that Williamsport WTO eighty eight points ... Mansfield W. P. A. you not the one point five of them ... and ... how to universities W she asked you eighty eight or nine of MC even grow\nWe have a translator in sun buried by point seven this is your art that information station listener supported public radio W. V. I. S.\nSupport comes from ... percent October's national seafood might be a plan that includes fishes heart healthy one wow for salmon specializes in Alaska sockeye salmon carries a wide variety of other fish and shellfish find salmon and more ... percent a dot com\n[noise] how long they'll come to the ... this week from today that for I mean there's recorded live stops in office I mean I think in the ...\n\n\nShe said\nWell you\nDid you go back\nDo\nDo\nDrove\n\nI mean I was in the so called me McDonnell on both coasts with a blender ... Appalachian I'm so\nI'm going to get more from Eileen some live shock recorded a while but with her immigrants to lighten up which we were very fortunate to host as a public radio ... in Cincinnati back in two thousand and two\nIt's all ... all live recording the sweet with ... billion you know heart cherish the ladies die he's through a lot of movies to see but with that you can eat live via Skype\nFrom Charlotte North Carolina to Washington DC I was a great pleasure of working with the chieftains going back to the ... Steve all this redo a life and here they are live in Dublin with bribery is march nine points of ... the ... the chief since [noise]\n\n... hello\nOkay you say your high in this country we say hello at home which is the same thing\nOn much the same I Want to show your nose flute and I mean this is a food to go back in my family for a long long time it belonged to my great grandfather\nAnd I'm called Mickey McConnell um that he was ... he led the flute on day he was a great ... and here's a good character on that\nHe died around I think the last years of dating hundreds debating Ninety seven are Eighteen Ninety six Ninety or something like that and it's great to how much they instrument that he played and I'm going to play you a tune\nI Know a tune that he would have probably played because this is a very old tune a tune called the black bird\nHey this particular and dumps June it played many different ways his players have a set time church sometimes are kind of a horn type are they even have to pay their salaries\nBut she also there's also shown to it and I was ... I Know left shoulder and perhaps land was explain something to you about the shelves were then I'd be can expend but to show\nWell the black bird doesn't refer really to a feather ... species that much more to political are\nMore I should say a character from history and I'm sure you've all heard tell us plenty prince Charney well the father of ... he was known as a young pretender what's known as the old pretender so the blackbird is the ... name for the old pretender\nOn the short cause of course was a very popular cause I\nIn Scotland and Ireland but this is a\n... mall earning for phone\nRang ... um I heard and a senator me in a man getting rich ... who\nIs a young man so being on a long time and change and\nA saying in mind blowing bone\nMost Raleigh\nHas flown my song\nSo they see me reflecting Sharon's do learning in\nMaine and I I'm more than ...\n... hurting\nYet if anything should be lying to me in ... in ... I Know what I mean\nMy belongings bird I Would say ... was the ... the\n... the book and it's all full of fall has they oh man to ... or the ... was chosen to dwell on when the ... oh\nHa and die um resolve then in ... or ... ...\nAnd when she saw it all out in spring forward to seeing gold mining low he is am\nI hot or play with my jaw on mine Shariah injure on jaws building mine alone my heart\nFor oh loading\nHe's called stun gun or in a coal ranges so much\nAnd all the news too much blood and bone was ... he\nBeing\nIn Maine and my blood bird and I were to go\nI'm In Maine\nAnd my blood bird and the words food or were\nThe laws do no bow on the judge and the ... and ... to the\nTime on any voters when from ... or\nA love scene was for sun from then food ... and\nIn scar on 'til then he's staying on high steamed aiming then he's seen a stranger tubing yet is may ... to\nRemain in for on saw orange spending\nAll builders to launch a bloodline bone was ... CD [noise]\n[noise]\nNah for jazz bonds saw her being a ...\nNah found that it poses a chain shady\nFather I'm no good shot oh actually\nSaw shipping\nThree who um who are\nThe own\nKnees you might\nThe law is many many I'm\nSure they do or small we go\nWe she um [noise] uh\nYeah it is up sees oh\n... or ... oh\nMan it's all like a movie and it's gone the um my\nFall oh [noise]\nBut you know heart giving us the rich texture of the traditional solo show no singing style and ...\nBeing joined us far music can chat a traditional some weak at North Carolina sworn to look at it in\nAnd we'll hear more from him with Julie ... Iran also dice through and they say ... it's all a head and when you're ready to take it on and again it'll come online streaming adolescent again page said by NPR Music\nYou can listen there and check out an online playlist too sir\nI listen to gain page said by NPR Music you can listen there and check out an online playlist to for details of all the music is eating in just a few days time look for all this will read you don't come and stay with me now for more music this is NPR\nAnd the next fresh air weekend Temer Jenkins talks about writing and directing her new movie private life during Catherine hunt and Paul Giamatti as a couple in their forties trying to have a baby by any means necessary\n\n[noise]\nNot along [noise]\n\n\n\nChatty the ladies be cheating going along on piano on ... on to win that line up our music has been on live out his ideas as we can provide a good to me Kennedy's films from North Carolina and the ... came to the vet Julie ... joining the in the heart\nAs we can provide that we're going to sneak in and we saw from North Carolina and the ... the set Julie lab joining being a heart for how can I keep for singing how can you I Hope you'll join in\nAnd they were recorded at this one guy that traditional so weak on a different occasions from ... who gave I I got a nurse and you radio listeners these lovely live performance says\nHis old instrumental the crew in the sun I this American ... of an Irish ballads the people I or the sailor boy called tighten up the boy this is that he's real\n... Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nOr a ... like they really are wearing them on the car the many fascinating to me uh\nOn ... ... s ... more than I Am\nThe ... of member John return Mm\n... mother ...\n\nNine days\nLow ... and\nI'm a marine right now we have\nA right to bear right whether than fire or nice to meet ... ...\n... the one that you go into the ... by three boats oh oh oh man uh during\nThe ...\nThe ... I just think ... I mean there she didn't fire bars are shrinking\nPie in the ...\nDo ... and ... ... ... ...\n... me mom gives me joy hard on the other one I have a nice sweet I'm a boy Mm\nI'm earning ...\n... ... ... ...\n... will be my live among the titans play ...\nNerve and do they do you mean he is not either ...\n\nI see you know\nWhat a loan Rob me a\nTo bear that we as your as I ...\nJoey ... murder and ... and ...\nAnd she knew her vote again soon\nAre up ... these are ...\nYeah that's not the ... the heart ...\nMy ... in the late\n... my ...\n...\n... ... ...\nOf the world who may no that's right I go on\nI'm I'm\nA I'm a brother\nYou know the word ... play no my heart and ... ...\n...\n\nA lot of the time I find that excruciating to Alex and Emma because of all I'm here in the fall for some reason I like the ... I don't know how this is Adam ... some ... ... ...\nAnd our carpets because Carole one time\nMm Mm\nMm Mm Mm\nMm Mm Mm\nMm Mm Mm Mm\nMm Mm\nMm Mm Mm\nMm Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm", "year": "2018", "show_name": "Thistle and Shamrock", "city": "Williamsport", "day": "07"}