{"month": "10", "state": "NY", "station": "WAMC", "content": "To businesses government and not for profits serving the capital region for over fifty years U H y dash us ... pounds [noise]\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. UNH the Ninety points reruns from Utica W. M. K. E. H. D. nine point nine Kingston W. O. F. R. H. D. Ninety One point seven Middletown WC yell each dean Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine ...\nW am cue HD won all five one great Barrington W. W. E. S. H. D. eighty nine up just go to U. N. D. H. D. Ninety point one Stanford W and our eighty eight point five rooster WAMC am fourteen hundred Albany [noise]\nFrom public radio international this is living on her and\nAmid constant conflict between Palestinians and Israelis lack of water the Gaza Strip causing a humanitarian crisis it's a ticking time\nCondemning disease spreading gossip [noise] people will stop moving to the census was stone rockets still be moving with empty pockets desperately calling out the clean water also a new study shows compelling evidence of a relationship between eating organic foods and lower cancer\nRisk what this study tells us is that when it comes to the risks for cancer an organic diet makes ...\nA cleaner set of ingredients closer to nature fewer additives less processing is probably in general playing a role here on those stories and more this week on living on her around [noise]\n\nFrom NPR News in Washington I'm nor rom President Trump is accusing reporters of trying to use the sinister actions of one individual to score political points uh fifty six year old Florida Man it's in custody charge with sending bombs two prominent Democrats this week\nThe president was campaigning for Republican candidates in North Carolina hours after Caesar say ox arrest yesterday before he left Trump said\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com that prevented\nTalk about was that had rightfully so it was a big thing rightfully so but now we have to start at the moment\nThe president also said he doesn't plan to contact former President Obama or anyone else targeted by the pipe bombs Obama campaign for democratic candidates in Michigan and Wisconsin yesterday when Kleinfeld are of member station WBUR ... reports\nObama told a crowd of thousands that Detroit's Cass technical high school that Republicans are following a familiar play book he says a GOP wants to scare people into voting for them by stoking fears over the Honduran migrant caravan heading towards the U.S and Obama says President Trump is continuing a pattern of making false promises\nThat he he was going\nElection in fashion before they're like [noise] the\nDemocrats hope Obama will energize voters especially in urban areas that failed to turn out during the past presidential election for\nNPR News I'm Quinn Klinefelter in Detroit\nSeveral thousand Central American migrants continue to walk north through Mexico saying they intend to seek asylum in the U.S many of them have rejected Mexico's offer to apply for refugee status in Mexico's southern most states\nSince early October federal authorities had been releasing hundreds of asylum seekers and families who cross the border illegally in Arizona\nFrom member station ... in Phoenix\nMatthew Casey reports setting volume in a court settlement that limits how long children can be detained federal immigration authorities started releasing families to churches and activists in Arizona\nNow the releases are also happening in Texas and California pastor bell Jenkins founded a San Diego based coalition that can provide about one hundred shelter but he says the group may need five times that number\nIf we could turn over the ... you know every two nights we probably could handle it we're we're going to happen if people are going to get stuck in the system so to speak\nJenkins says families stay at the shelter longer when sponsors back out his coalition is trying to find more beds for NPR News I'm Matthew Casey in Phoenix and this is NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting and the state of Joan crock who's request serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. dot org\nThis is WAMC regional News I'm Lucas Willard former vice president Joe Biden was in Kingston friday to stump for nineteenth congressional district candidate Antonio Delgado as part of Biden's effort to turn out and vote for democratic candidates across the country more from Hudson Valley bureau chief Alison done\nBiden addressed a large crowd of Delgado supporters saying the November ... mid term elections are like no other Bush is about\nThe character of the nation [noise]\nI appreciate the fact\nLong as I'm deadly earnest about this Delgado faces freshman Republican John Faso in a statement said he is pleased to welcome tied into the district adding quote I appreciate his contribution to American political life over the past forty years and his ...\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tell you what your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog for his dot com\nThe federal receiver overseeing to Vermont ski resorts after the owner was accused of massive fraud has built over five million dollars\nA Caledonia and record reports us district court judge daring Gales approved Michael Goldberg fifth expense report which built over a one million dollars for a seven month period the receiver says you reduce billing rate for himself and his employees in the case\nThe forecast rain today highs and the lower forties rain likely tonight with temperatures around forty degrees and cloudy with a chance of showers tomorrow hides in the upper forties support comes from the ... annual Woodstock invitational ooh the or showcase\nHandmade acoustic guitars and string instruments concerts clinics and more through tomorrow at the ... theater and utopia sounds stage Woodstock invitational dot com\nWe now return to living on earth it's six minutes after six o'clock [noise]\nFrom the Jennifer and Ted Stanley studios at the University of Massachusetts Boston this is living on Earth I'm Steve her with a major study published in the journal if the American Medical Association has found what many people have long suspected eating organic food appears to reduce the risk of cancer\nAmong some sixty nine thousand people tracked by French scientist over several years those whose diets contained more organics had about twenty five percent fewer cancers overall with thirty five percent fewer breast cancer as an older woman and the more than Seventy percent reduction in focus\nThis study suggests but does not prove that pesticides and other chemical residues in foods cause cancer but there's no reason to wait for more research when it comes to making food choices advocates say including the president of the environmental working group can cook Ken welcome back to living on earth thanks Davis great to be here\nSo when this study came out it showed strong evidence in support of the long held beliefs that organic food is better for us how do you feel now that the study is out there\nWell you know I guess I feel as if we should have been doing studies like this a long time ago we really do need to be much more careful about the low levels of carcinogens that we still have in our diet the fact that several cancers here\nDid show or a market decrease to me tells me the organic food is probably targeting the mechanisms that are associated with those cancers and the other thing that's interesting\nWhile they speculated about pesticides there are other chemicals in non organic foods that are not allowed in organic certain chemical dies a certain color rings a certain flavorings that simply are not allowed in organic food manufacturers\nThat in addition to pesticides may be another reason why there's lower cancer rates amongst these are mostly women who are eating more organic food\nAnd of course if the product is made from genetically modified organisms it's not allowed to be labeled as organic\nIs true as well and there really are not very many chemicals that are allowed in organic manufactured are packaged food compared to conventional where there are thousands so there are lots of questions raised by this study but to me it goes back to the basic point\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nWell how how 'bout remark that cliche for extinction fair enough Peter Peter doctors with environmental\nHealth News at the age of ... Oregon daily climate or we'll talk again real soon\nAll right Steve thanks a lot to talk to you soon\nAnd there's more on these stories at our website eh Lolita or G. and if you have a joke about climate change tell us about it right is it comments at eh Lolita or gee that's comments at ... dot org\nComing up trying to make do with little freshwater in the Gaza Strip that's just ahead on living on earth to\nSupport for a living on earth comes from the Gordon and Betty Moore foundation and from a friend of St Louis for the the worst\nStreaming support for WAMC comes from my dog harness dot com and no choke ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog for his dot com\nOf miles of trails for hiking ... outdoor exploration L. O. G. L. C. dot org\nSteve Lewis Subaru Hadley, Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford in Springfield offering new sue Bruce plus used cars trucks and SUVs Steve Lewis Subaru dot com\nSupport for WAMC comes from leads to lock the passage scenic by way of supporting the war and burg Historical Society graveyard walks down to dinner with the dead\nToday through Monday in Orangeburg passage poor dot org I Love New York and from Adam spare acre farms became sea Kingston Newberg ... local apples pumpkins and squash Adams grown moms plus Moore may groceries meets ... deli bakery and seafood Adams forums dot com\n\nIs living on Earth I'm deeper would\nKnow where is the seemingly endless crisis between Israelis and Palestinians more acute than the Gaza Strip a hotly contested piece of land just twenty five miles long and roughly five miles wide\nThousands of buildings were destroyed and more than twenty two hundred thousands were killed by Israeli forces and the twenty fourteen war with Seventy one death on the Israeli side\nTwenty one years ago we sent reporters Sandy ... to ... to document the acute shortage of drinking water there and back then he found that eighty five percent of wells were to contaminated for human consumption\nHe recently returned and now that figures up to Ninety seven percent\nThe shot the refugee camps stretches for about a mile Gaza's Mediterranean coast ... beach in Arabic\nBut it's hard to find a pool ocean breeze here\nThe eighty seven thousand people squeezed into half a square kilometers cement block dwellings or all refugees and their dissent [noise] of Gaza's nearly two million people three out of four\nRefugees families forced to flee their towns and villages during the creation of Israel in Nineteen forty eight\nAnd an anti again back to them and then there was three when her family was driven out of the village of for momma\nShe doesn't remember much besides the refugee camp which she now lives with three younger generation they share three small rules\nAnd all that if he said no matter\nWhere you meet you may God give you\nCan do today the entire family greets us in the front room Nineteen members of the named them family most sit on the floor ... checked walls they introduce themselves\nNow on the man and\nA half was\nToday it's Ninety four degrees and with\nSo and then again if I could have had it gets\nHot suffocate [noise] there isn't enough space to sleep\nThere's no space to do can you see\nThere is no fan because electricity in Gaza comes just four hours a day\nTo ... to ...\nMy mother got Owens water\nIn the city forget about it there isn't any is [noise]\nWater that comes out of the tap is way too salty to drink\nThat's because the aquifer below our feet has been over pumped so badly that sea water is flowing is\nSort of ... families there\nStreaming support for WAMC comes from my dog harness dot com and no choke nope ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tell you what your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com [noise]\nFor most people in Gaza it's not quite as dire [noise]\nTwo thirds of guys let's get water delivered by truck desalinate water is pumped into roof top picks fire hose [noise]\n\nBut when it comes to water and got the better off is only by degree the dissemination of water is unregulated and because of this water has virtually no salt it's probably just tickled contamination says former Palestinian deputy water minister rep he al ...\nAnd when does this door at the a household would have done for more than the indies didn't this liberal diminishing at each of the ...\nThat seven and ten people basically drinking poop or ... if you prefer and in terms of parts per million UNICEF Gregor ... says the only really safe\nLevel is zero already the presence of one is too much wind because of the moment you have one you actually have a potential to gross depending then how long you've got your will just sitting in the tanks\nI caught up with Greg or is he rode out to inspect new water project than southern cause\nThe longer they all that the more you could then produce all you've got all sorts of other than a little uh animals that actually start growing in your water and it just gets worse when children drink this water they start getting the runs switched you have repeated diarrhea the end result is actually your child would not grow\nTo its full potential you actually see children being stunted what it also means is actually put them in in terms of brain development you would actually have a measurable impact on the issue of those children as they as they grow up\nLate last year a British medical journal found an alarming magnitude stunted among gossip as children\nGossip pediatrician Mohammad Abu ... says there are so many other\nYeah how'd you how what is in the summer to be\nThe host but the debate it of course but there is very very very busy\nDoctor a boost ... takes me through the children's ward and hold Nasir hospital in Gaza City structures sawdust and touching a baby girl hooked up to a respirator\nShe looks even tiny or some of these children have recently had heart surgery\nOverwhelm doctor says he's seeing a sharp rise he's ... children like gas to enter right from the dirty water\nBe suffering from the division of for one more thing from day out of here from fever\nAnd because of the extremely high nitrate levels of water the doctor is seeing other effect\nWe have and should have been getting is not working\nBefore he tells me they had Fifteen or twenty cases any given time now it's forty\nIf it did we have and that was but that didn't baby and machine in him ... and the number is ...\nSo our cases of something called blue baby central\nThe high nitrate levels deprive the blood of sufficient oxygen\nStreaming support for WAMC comes from my dog harness dot com and no choke nope ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com yeah five kids is in one ear\nSo sharp prices know Castro into writers stunted growth renal failure and hypertension from those high nitrate levels blue baby syndrome and Dr ... says he's seeing big increases in pediatric cancer whether from water effects of three wars he doesn't know\nBeyond the lack of water he's seeing the effects of malnutrition which he blames Israel economic blockade\nNutrition is very bad [noise]\nDoes afflicted baby before series is we don't have any bishops lived in London a division now is so big it was ... you know ...\n... is severe malnutrition sometimes a newborn infant just skin and bone doctor says the law do you think losing more and more [noise]\nPalestinian health ministry data backed up Dr ... some years observation they know a doubling of severe cases of diarrhea especially in children and serious increases in kidney disease\nAnd and food and water borne diseases including hepatitis a salmonella and typhoid fever\nThe British medical journal Lancet corroborate the shortage is a clean safe water has contributed to a sharp rises and diarrhea among young children in the Gaza Strip\nDiarrhea is the world's second biggest killer of children [noise]\nIn the distance we hear an explosion\nMuch pauses for a short moment that ignores it he says I come here just forget everything [noise]\nLiving in I'm Sandy Toland in the Gaza Strip\n\n[noise]\nComing up the necessity defense for climate civil disobedience that's just the head on living on earth\nFunding for a living on earth comes from you our listeners and United Technologies combining passion for science and engineering to create the illusion designed for sustainability in aerospace building industries in food refrigeration\nUPC companies such as Otis carrier Pratt Whitney and teach the Arab states to students are helping to move to world forward\nYou can learn more about the United technologies by tuning into the race to nine billion hot cast listen at race to nine billion dot com that's raised to nine billion dot com\nThis is P. R. I. public radio international\nSupport comes from Saratoga bridges Boston Spa community resource for people with disabilities and their families supported employment data services and more Saratoga bridges dot org\nThe center for natural wellness school of massage therapy offering fulltime at part time massage therapy programs classes begin this February C. N. W. S. T. dot com for more information\nFulton County Center for regional growth seeking development companies to execute retail end housing development projects in Fulton County S. C. C. R. G. dot org\nStep up presents experience Hendricks the music and the legacy of Jimmy hendrix at the palace theatre April third tickets on sale now at ticket master dot com\nAnd from South ... spirit shop located in the southwest corner of the Berkshires specializing in curated small production wind and regional handcrafted spirits and beer real wine for the people south ... spirits dot com\nIs living on Earth I'm speaker would on October eleventh with twenty sixteen climate activists Emily Johnston and that clap steam took bolt cutters to chains on to enrich pipelines in northern Minnesota [noise]\n\nThen they turned emergency shut off the shelves for lives for and sixty seven [noise]\nWhy don't they have the two women and three other so called valve Turner's temporarily stop the flow most of the oil coming from Canada's tar sands that day a protester who acted in North Dakota spent months in prison at the pair who acted in Minnesota also face\nStreaming support for WAMC comes from my dog hardest dot com no choke no poll dog ... invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nOctober ... in the middle of the trial or Minnesota judge abruptly acquitted them of all charges and they joined me now from Seattle, Washington welcome to living on earth thank you thank you very much Dave\nHow does it feel to have these felony charges thrown out on a\nI think we all have mixed feelings about that I've been feeling guilty with you know happiness that we are not going to jail and quite frankly that I'm off bail and may have the opportunity to do several disobedience again because I\nHad to be very careful while out on bail because if I got arrested it could be revoked and I could spend all of my time in the Clearwater county jail awaiting trial\nBut um you know we're disappointed that we did not get to put on the climate necessity defense that we wanted to with you know the very well respected experts that we had lined up to testify for like Dr James Hansen you know former climate scientists from Nassau and Bill McKibben so it's a mixed bag\nEmily yeah I I'll go being stronger about it than that and say that you know I was really heartbroken not so much by the acquittal of course which is a good thing it was the sort of second best scenario we could have had\nBut by the denial of our expert witness testimony on climate change and on civil disobedience you know it would have been the dream trial it could have made a really big difference so that thought that this kind of trial might happen\nIn that courtroom in front of those jurors and that might make set a precedent that would really have an impact nationally on the climate change debate seemed like a really important thing to me and of course until four days before trial began it looked very much like it was going to happen\nSo you know it's it's a real shame that that it did not\nKnow as I understand that you heard the judge to let you use the necessity defense\nYes and he had granted that to us back in October of twenty Seventeen and in fact he had copies of our expert witness list for a for about the last year and a half\nSo at any point in that time period he could have constrained us constrain the number of witnesses said you can't talk about this or that and he chose not to the fact that he did that for days before trial began with stunning at the lawyers who couldn't have been more surprised we couldn't have been more surprised\nThat moment he'd been very very reasonable and it seems like all systems were go and to be clear the thing about that that was so striking apart from its sudden his was the fact that normally speaking defendants do not have any burden of proof it's it's the prosecution that has a burden of proof normally\nBut because we were going to use a necessity defense and say that what we did you know was essentially a necessary under these circumstances that we find ourselves in to prevent the greater harm of climate change\nWe did have the burden of proof and all of a sudden he knocked out our ability to defend ourselves essentially because who is going to listen to a poet a retired lawyer and a software engineer from Seattle\nOn climate change you know we're not scientists we have no authority so no matter how articulate we had been it wouldn't have had anything like the same impact as the former head of the NASA Goddard Space Center talking about climate change and how urgent it is or about Minnesota scientists talking about how urgent it is and how much is already changing in Minnesota\nSo you know again we had no ability to defend ourselves without experts to testify to those things\nAnd the software engineering or co defendant was\nWas ... a young father of three who was our support person or support people were all arrested they win\nStreaming support for WAMC comes from my dog hardest dot com and no choke no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog's heart is dot com\nPersonally am very sorry he didn't get to testify in the necessity defense hearing or in August a year ago when he testified there was not a dry and there were um\nYou know when he talked about his young children and what they were facing\nAnd then the case becomes even more confusing I guess because the judge was in the one hand you can have witnesses to make your case and then he proceeds to go ahead to quit you of the charges\nRight that was after the prosecutor had presented his case which was only two witnesses the sheriff who arrested us and local Enbridge employee\nAnd all he proved was that we had broken some chains that were holding the log into the enclosure where the emergency shut off valve was and we never disputed that\nSo we were charged under a statute which was one of the sort of enhance penalties statutes that are being shoved through state legislatures right now by the fossil fuel industry to give them you know further penalties against protesters\nAnd the statute we were charged under was specifically damage to pipelines\nAnd the judge ruled and he was correct that the prosecutor had not prove that we had damaged the pipeline and anyway\nYeah in the ... century he was ruling that there wasn't evidence for a reasonable jury to convict that space like write it as a matter of law then that was because of course we hadn't damage that pipeline right\nI'm going to ask you to speculate about both of you in a ... about judge Robert Tiffany and the decisions that you made in your case how do you think the judiciary might have been influenced by outside forces politics sentiment the fossil fuel industry\nThis is Emily in terms of you know what kind of pressures he may have been under or what he may have been I'm thinking you know whether his mind might have changed\nAbout what kind of precedent he wanted a sad and so forth you know it's it's impossible to know and and it's you know distressing and it certainly something we've been wondering about he seemed like a very reasonable guy he gave us a necessity defense he wanted to hear what we had to say\nAnd he wanted to let the jury hear it so you know the about face was quite extreme\nWe know for sure that Enbridge provide something like two thirds of the budget that county so I you know they obviously have some influence direct or indirect we don't know I mean we have no way to know what may or may not have happened behind the scenes but\nThe fossil fuel companies have terrible amounts of influence and power in this country and you know that's why we have to fight them and the ways that we have to fight them because they do on and control our political system all on all levels\nTo what extent did you understand what you did this direct action the law enforcement could bring felony charges against you know\nAbsolutely knew that that was not only a possibility but it's strong probability and we accept that risk", "year": "2018", "show_name": "Living on Earth (PRI)", "city": "Albany", "day": "27"}