{"month": "10", "state": "NY", "station": "WAMC", "content": "Support for WAMC comes from the agreement village in presenting mark rally on Thursday November first friday night the spurs and Saturday November third Chris Barrett of the spin doctors the Vermont barn dot com\nAnd the chase and companies an employee owned firms providing engineering Lance urban planning environmental health and safety landscape architectural services for Seventy years Jason companies dot com\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point\nThree Albany W are you an HD Ninety point three ramps and you can WHM cage the Ninety point nine Kingston W always our HD Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC A. N. H. D. Ninety three three candidates Harry W. A. N. C. H. D. one oh three nights high kind a rogue WAMC wage the window five\nOne great Barrington W W E S H da da na ... go W. A. N. D. H. D. Ninety point one Stanford W a in our eighty five Bruce during WAMC am fourteen hundred Albany\n[noise]\nSome public radio international business is living on her and [noise]\nAmid constant conflict between Palestinians and Israelis a lack of state water the Gaza Strip causing a humanitarian crisis it's a ticking time bomb\n... disease right again and gossip [noise] people will stop movie to the sense that they will be moving with stones rockets there'll be moving with empty pocket desperately\nCalling out the clean water also a new study shows compelling evidence of a relationship between eating organic foods and lower cancer rates\nWhat this study tells us is that when it comes to the risks for cancer an organic diet\nMakes ... a cleaner set of ingredients closer to nature fewer additives less processing is probably in general playing a role here on those stories and more this week on living on their Dick around [noise] than\nLive from NPR News in Washington I'm ... brothers Cecil and David Rosen power eulogy eyes in Pittsburgh today as part of the fabric of the local Jewish community W. I. D. S. Katie my reports two main divide development\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\n\nYou only have like ... and David ... fish and\nHelping set up all he had to do with lead service\nTheir friend Bob Goldstein says it was seized those custom to lag his finger and tell people you better go to services\nWe're taking a cough and I've I gave money gets me all the time\nYou better though the services that so many remember of\nFamily and friends say David Was quieter industry it's worker fascinated by police Nazis though was born politician who want it to be involved with everything that they might think brothers parents they're sharing them with the community services he said I won't be the same for NPR News I'm Katie my input that\nPresident Trump and members of his family traveled to Pittsburgh to console the victims of this past weekend shooting facing a mixed welcome from the city is Jewish community some residents near the squirrel hill neighborhood were eleven people were shot and killed said Trump was not welcome unless he changes his ways over others said that as president he should be welcome\nMen spouting hatred for Jews as blaming the mass shooting one of the worst incidents of anti Semitic violence in us history Trump has been calling for national unity at the same time he's been expressing partisan rhetoric at election rallies with midterms now a week away\nA top Republican lawmaker is pushing back against President Trump's assertion he can revoke automatic birthright citizenship without involving Congress or changing the constitution or if NPR's Ayesha Rascoe\nTrump says he believes he can act on his own to an unrestricted birthright citizenship for those born in the U.S to parents who are not us citizens and an interview with ... he said he could end the right with an executive order\nIt was always told me that you needed a constitutional member ... you don't need a number one number one you don't need that\nBut Republican sneak around the house Paul Ryan says Trump can't do that Ryan told a Kentucky radio station that such a move would be unconstitutional saying it goes against the plain text of the fourteenth amendment the White House has offered no further details about Trump's comments Ayesha Rascoe NPR News the White House\nUs home price gains appear to be easing something they could help potential buyers were part of the reason for the slowdown is a drop in sales tied to higher mortgage interest rates prices are still up substantially from a year ago the U.S and the Case Shiller twenty city home price index because prices in August up five and a half percent from the same period last year\nOn Wall street the Dow closed up four hundred and thirty one points today you're listening to NPR\n\nA lawyer representing convicted mob boss James Whitey Bolger says he blames his clients death on decisions made by the Federal Bureau of prisons\nAttorney Jay W Carney junior in a statement today said Bolger was initially sense the two consecutive life terms but had that sentence change to the death penalty prison officials say the eighty nine year old Bolger was found dead in his West Virginia prison cell today he'd been serving time for his role and eleven murders prison union official says Bulger's death is being investigated as a homicide\nA new study finds when teens and young adults stop using marijuana even for a week they're learning and memory improves new study adds to a growing body of evidence suggesting park and her some brain functions and young people more from NPR's ...\nAt the top of recruited eighty eight point to using young people of age of sixteen to twenty five about one half of them were asked to abstain from the truck for a month on the other half the control group was allowed to continue using\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for a long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nThe didn't at an early in the last week the results are published in the journal of clinical psychiatry ... NPR News scientists exploring the seabed off the coast of central California have found something unprecedented hundreds of octopuses between rocks covering groups of white eggs\nThe cluster of up words of a thousand octopuses which on last week into Dave's and seem out an underwater extinct volcano located in the Monterey Bay National Marine sanctuary submersible cameras spotted the often reclusive creatures\nI'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent thought whether that's on line over the air or in a bottle more at Sierra Nevada dot com\n[noise]\n\nFrom the Jennifer and Ted Stanley studios at the University of Massachusetts Boston this is living on Earth I'm Steve her with a major study published in the journal at the American Medical Association has found what many people have long suspected eating organic food appears to reduce the risk of cancer\nAmong some sixty nine thousand people tracked by French scientist over several years those who diets contained more organics had about twenty five percent fewer cancers overall with thirty five percent fewer breast cancer as an older woman in a more than Seventy percent reduction in them focus\nThis study suggests but does not prove that pesticides and other chemical residues in foods cause cancer but there's no reason to wait for more research when it comes to making food choices advocates say including the president of the environmental working group can cook Ken welcome back to living on earth thanks Davis great to be here\nSo when this study came out that showed strong evidence in support of the long held belief that organic food is better for us how do you feel now that the study is out there\nWell you know I guess I feel as if we should have been doing studies like this a long time ago we really do need to be much more careful about the low levels of carcinogens that we still have in our diet the fact that several cancers here\nDid show or a market decrease to me tells me the organic food is probably targeting the mechanisms that are associated with those cancers and the other thing that's interesting\nWhile they speculated about pesticides there are other chemicals in non organic foods that are not allowed in organic certain chemical dies a certain color rings a certain flavorings that simply are not allowed in organic food manufacturers\nThat in addition to pesticides may be another reason why there's lower cancer rates amongst these are mostly women who are eating more organic food\nAnd of course if the product is made from genetically modified organisms it's not allowed to be labeled as organic\nIs true as well and there really are not very many chemicals that are\nSupport for streaming on WAMC comes from the Davis financial group providing the base financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nQuestions raised by this study but to me it goes back to the basic point a cleaner set of ingredients closer to nature fewer additives less processing is probably in general playing a role here\nBecause there was a whale of a story\nHow about we mark that cliche for extinction fair enough Peter Peter doctors with environmental health news that the agent Oregon daily climate thought or we'll talk to again real tune All right Steve thanks a lot to talk to you soon\nAnd there's more on these stores at our website eh Lolita or G. and if you have a joke about climate change tell us about it right is it comments and Ella leader or gee that's comments at ... dot org [noise]\nComing up trying to make do with little fresh\nComing up trying to make do with little freshwater in the Gaza Strip that's just ahead on living on Earth Day to\nSupport for a living on earth comes from the Gordon and Betty Moore foundation and from a friend that sailors for the the working with both church to restore ocean health\nSupport for WAMC comes from Chico two thousand presenting ... last film days November eight through twelfth in Cooperstown curated slate of thirty one films lawmakers talks parties are and hikes or at the last ... days dot org wild bird unlimited nature shot Saratoga Springs New York\nProviding bird feeding hobby products and unique nature gifts with an emphasis on us and small businessmen products W. B. U. dot com slash Saratoga Springs\nIn Saratoga bridges Boston's Bonnie nork community resource for people with disabilities and their families supported employment they services that mark Saratoga bridges dot org [noise]\nMm\nIt living on earth I heard what\nNowhere is the seemingly endless crisis between Israelis and Palestinians more acute than the Gaza Strip a hotly contested piece of land just twenty five miles long and roughly five miles wide\nThousands of buildings were destroyed and more than twenty two hundred thousands were killed by Israeli forces in the twenties fourteen war with Seventy one death on the Israeli side\nTwenty one years ago we sent reporters Andy Kohut to go to document the acute shortage of drinking water there and back then he found that eighty five percent of wells were to contaminated for human consumption\nHe recently returned and now that figures up to Ninety seven percent\nThe shock the refugee camps stretches for about a mile Gaza's Mediterranean coast ... beach in Arabic\nBut it's hard to find a pool ocean breeze here\nThe eighty seven thousand people squeezed into half a square kilometers cement block dwellings our all refugees their dissent [noise] of God's as nearly two million people three out of four\nFamilies forced to flee their towns and villages during the creation of Israel in Nineteen forty eight\nAnd an anti virus that infects them and then there was\nThree when her family was driven out of the village up her momma\nShe doesn't remember much besides the refugee camp where she now lives with three younger generation they share three small ruled\nThat if you might as well where are you meet you may God give you had\nTo today the entire family treats us in the front row Nineteen members of the named them family most sit on the floor ... checked walls they introduce themselves\nThen and then all of us and a half and\nToday it's Ninety four degrees into when\nSo how did that and again if I could have had it gets\nHot suffocate [noise] there isn't enough space to sleep\nThere is no space a dog can you see\nThere's no fair because electricity in God's comes just four hours a day\nTo ... I just knew\nMy mother got Owens water\nIn the city forget about it there isn't any\nStreaming support for WAMC comes from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nSo badly that sea water is flowing it\nSo the question of families there's Fifteen year old Mohammed ... piles plastic jugs and doodles wheelchair and rules that to the mosque for sputtering taps provide the most basic necessities for life courtesy of her mouth [noise]\nFor most people in Gaza it's not quite as dire [noise]\nTwo thirds of God's will get water delivered by truck desalinate water is pumped into roof top picks fire hose [noise]\n\nBut when it comes to water in Gaza better off is only by degree the disseminated water is unregulated and because this water has virtually no salt its pros are fickle contamination says former Palestinian deputy water minister rep he al ...\nAnd when does this door at the a household would have done for more than ... than this liberal with diminishing ... each of those same\nThat seven and ten people basically drinking poop or ... if you prefer and in terms of parts per million UNICEF Gregor ... says the only really safe level\nIs zero so already the presence of one is too much why because of the moment you have one you actually have a potential so gross depending then how long you've got your will just sitting in those tanks\nI caught up with Gregory zeroed out to inspect new water projects in southern Gaza\nThe longer they all that the more you could then produce all you've got all sorts of other than the little uh animal that actually stopped growing in your water and it just gets worse when children drink this water they start getting the run so we have repeated diarrhea the end result is actually your child would not grow\nTo its full potential you actually see children being stunned that what it also means is actually put them in in terms of brain development you would actually have a measurable impact on the ... of those children are they as they grow up\nLate last year a British medical journal out an alarming men that you stumped among gods as children\nGods a pediatrician Mohammad Abu ... says there are so many other\nHow one of my ... in the summer to be\nThe most but the debate is it of course but there is very very very busy\nDoctor a boost ... takes me through the children's ward and ... knots or hospital in Gaza City stretches out is in touching a baby girl hooked up to a respirator\nAlone in her hospital that she looks even tiny or some of these children have recently had heart surgery\nOverwhelm doctor says he's seeing a sharp rise in these illnesses children like gas to enter right from the dirty water\nBe suffering from the division of from vomiting from day out of here from fever\nAnd because of the extremely high nitrate levels of water the doctor is seeing other effect\nWe have and should have been getting is not working\nBefore he tells me they had Fifteen or twenty cases any given time now it's forty\nEvery day we had was but that didn't baby and machine\nIt is not working before he tells me they had Fifteen or twenty cases any given time now it's forty\nEvery day we have the votes but then didn't baby and machine in him ... and the number in the ...\nAnd so our cases of something called blue baby central\nThe high nitrate levels deprive the blood of sufficient oxygen\nAnd so some babies look blue\nBlue is slips bluish fifth Lewis skin and blood the color of chocolate I see it was ordered to give that up in years but now the ... and when you\nAnd so sharp rise isn't gastro ... stunted growth renal failure and hypertension from those high nitrate levels blue baby syndrome and Dr ... says he's seeing big increases in pediatric cancer whether from water effects of three wars he doesn't know\nAnd beyond the lack of water he's seeing the effects of malnutrition which he plans on Israel's economic block a\nDivision is very bad [noise]\nDoes afflicted baby before she uses it we don't have any bishops lived manipulation now is so big it was ...\n... is severe malnutrition sometimes a newborn infants just skin and bone doctor says\nThe last few years increasing more and more [noise]\nPalestinian health ministry data backed up Dr ... observation they note a doubling of severe cases of diarrhea especially in children and serious increases in kidney disease and and food and water borne diseases including hepatitis a salmonella typhoid fever\nThe British medical journal Lancet corroborate that shortages of clean safe water have contributed to sharp rises and diarrhea among young children in the Gaza Strip\nIn the distance we hear an explosion\nMuch pauses for a short moment\nThe doors it he says I come here just to forget everything [noise]\nLiving on Earth I'm Sandy toilet in the Gaza Strip\n\n[noise]\nComing up the necessity defense for climate civil disobedience that's just a head on living on our\nFunding for a living on earth comes from you our listeners and United Technologies combining passion for science with engineering to create the illusion designed for sustainability in aerospace building industries in food refrigeration\nUPC companies such as oh just a carrier Pratt Whitney and do you teach the aerospace systems are helping to move the world's forward\nYou can learn more about the United technologies by tuning into the race to nine billion hot kept listen at race to nine billion dot com that's raised to nine billion dot com\nThis is P. R. I. public radio international\nSupport for WAMC comes some of the aircraft museum of picture books aren't Amherst, Massachusetts presenting exhibition our voice the courage to Scott king illustrator awards with art depicting African American life history and culture Carl museum dot org\nMannix marketing lens falls New York specializing in search engine optimization and Internet marketing since Nineteen Ninety six medics marketing dot com\nSienna college a lot of ... hosting an open house on Saturday November test sharing information on new degrees and data science communications nursing and a new NBA option for undergrads CNN dot edu slash open house\nAnd the blue marble a world of gifts or north pleasant street in Amherst anthrax marketplace Northampton offering a hand selected collection of jewelry scarves pottery wall art and gifts the blue marble that is [noise]\nIt living on earth I speak or what on October eleventh with twenty sixteen climate activists Emily Johnston and clap steam took bolt cutters to chains on two Enbridge pipelines in northern Minnesota [noise]\n\nThen they turned emergency shut off the shelves for lives for and sixty seven [noise]\nSo for laws for at sixty so [noise]\nI don't think they shut down the two women and three other so called valve Turner's temporarily stop the flow most of the oil coming from Canada's tar sands about the\nA protester who acted in North Dakota spent months in prison the pair who acted in Minnesota also face felony charges ms ... an editor and poet ... ... and a retired attorney were charged with damaging the Enbridge crime wise are prepared to mount a climate necessity defense\nWhen October night in the middle of the trial of Minnesota judge\nAbrupt we're quid them of all charges and they joined me though I'm from Seattle, Washington welcome to living on earth thank you thank you very much Dave how does it feel to have these felony charges thrown out on a\nI think we all have mixed feelings about that I've been feeling guilty with you know happiness that we are not going to jail and quite frankly that I'm off bail and may have the opportunity to do with all due to be the IMF again because I\nHad to be very careful while out on bail because if I got arrested it could be revoked and I could spend all of my time in the Clearwater county jail awaiting trial\nBut um you know we're disappointed that we did not get to put on the climate necessity defense that we wanted to with you know it'd be very well respected experts that we had lined up to testify for us like Dr James Hansen you know former climate scientists from now and Bill McKibben so it's a mixed bag\nEmily yeah I I'll go being stronger about it than that and say that you know I was really heartbroken not so much by the acquittal of course which is a good thing it was sort of second best scenario we could have had\nBut by the denial of our expert witness testimony on climate change and on civil disobedience\nYou know it would have been the dream trial it could have made a really big difference so they thought that this kind of trial might happen in that courtroom in front of those jurors and that might make it set a precedent that would really\nHave an impact nationally on the climate change debate seemed like a really important thing to me and of course until four days before trial began it looked very much like it was going to happen\nSo you know it's it's a real shame that that it did not\nKnow as I understand that you heard of the judge to let you use the necessity defense\nAnd he had granted that to us back in October of twenty Seventeen and in fact he had copies of our expert witness list for a for about the last year and a half\nSo at any point in that time period he could have constrained us constrain the number of witnesses said you can't talk about this or that\nAnd he chose not to so the fact that he did that for days before trial began with studying at the lawyers who couldn't have been more surprised we couldn't have been more surprised until that moment he'd been very very reasonable and it seemed like all systems were go\nAnd to be clear the thing about that that was so striking apart from its sudden it\nWas the fact that normally speaking defendants do not have any burden of proof it's it's the prosecution that has a burden of proof normally\nBut because we were going to use a necessity defense and say that what we did\nYou know was essentially a new necessary under these circumstances that we find ourselves and to prevent the greater harm of climate change we did have the burden of proof and all of a sudden he knocked out our ability to defend ourselves essentially because who is going to listen to a poet a retired lawyer and a software engineer from Seattle\nOn climate change you know we're not scientists we have no authority so no matter how articulate we had been\nIt wouldn't have had anything like the same impact as the former head of the NASA Goddard Space Center talking about climate change and how urgent it is or about Minnesota scientists talking about how urgent it is and how much is already changing in Minnesota so you know again we had no ability to defend ourselves without experts\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success would weave district to me and gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nOf three who was our support person or support people were all arrested they went in knowing that that was a possibility but it was certainly our hope when we're planning the action that they would not be arrested so we're very very happy that he's acquitted and home with his young family\nWere happy that he's acquitted but I personally am very sorry he didn't get to testify you know in the necessity defense hearing a in August a year ago when he testified there was not a dry and they're um\nYeah when he talked about his young children and what they were facing\nAnd then the case becomes even more confusing I guess because the judge was the one hand you can have witnesses to make your case and then he proceeds to go ahead to quit you of the charges\nRight that was after the prosecutor had presented his case which was only two witnesses the sheriff who arrested us and local Enbridge employee\nAnd all he proved was that we had broken some chains that were holding the log into the enclosure where the emergency shut off valve was and we never disputed that\nSo we were charged under a statute which was one of the sort of enhanced penalty statutes that are being shoved through state legislatures right\nNow by the fossil fuel industry to give them you know further penalties against protesters and the statute we were charged under was specifically damage to pipelines and the judge ruled and he was correct that the prosecutor had not prove that we had damaged a pipeline in any way\nYeah in ... he was he was ruling that there wasn't evidence for a reasonable jury to convict us basic right it as a matter of law then that was because of course we hadn't damage that pipeline right\nI'm going to ask you to speculate about both of you in a ... about judge Robert Tiffany and the decisions that you made in your case how do you think the judiciary might have been influenced by outside forces politics sentiment in the fossil fuel industry\nThis is Emily in terms of you know what kind of pressures he may have been under or what he may have been I'm thinking you know whether his mind might have changed about what kind of precedent he wanted to that and so forth you know it's it's impossible to know and and it's you know distressing and it's certainly something we've been wondering about\nHe seems like a very reasonable guy he gave us a necessity defense he wanted to hear what we had to say and he wanted to let the jury hear it so you know the about face with quite extreme\nWe know for sure that Enbridge provide something like two thirds of the budget that county so I you know they obviously have some influence direct or indirect we don't know I mean we have no way to know what may or may not have happened behind the scenes but\nThe fossil fuel companies have terrible amounts of influence and power in this country and you know that's why we have to fight them and the way that we have to fight them because they do on and control our political system all on all levels\nTo what extent did you understand what do you do this direct action the law enforcement could bring felony charges against you know\nAbsolutely knew that that was not only a possibility but a strong probability and we accept that risk", "year": "2018", "show_name": "Living on Earth (PRI)", "city": "Albany", "day": "31"}