{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n\n[noise] more music memory so jarring one of those David Lean collaborations the romantic and very popular mentally he wrote as Lawrence theme from doctor Zhivago\nWell okay we're going to stick pretty much what the early Nineteen sixties that's where we're going to have to end Saturday send them out with the Nineteen sixty four big hit for Walt Disney he was so proud when Mary Poppins in Nineteen sixty four opened and got a total it's Thirteen Oscar nominations including the one that he said meant the most to him\nBest picture it did win five including best actress for Julie Andrews and best original music score for the Sherman here as one of the wonderful melodies they wrote Jim Jim jury and then\nA voice you're going to recognize [noise]\n\n\n\n\n\n\nBut [noise]\n\nBecause I was a prank just make one aguaje justifiable\n\n\nYou lead it always say that goes I can we\nWe\nHave enough\n\nBut I'm doing it for the\n\nNew\nOne and I said it to me go and how many girls me why [noise]\nOh I Know the lovely thing she it to ...\nLet's look just like how\nYou miss the gift we don't show [noise] [noise]\nI Try really hard to say it backwards like Julie did I never got the hang of that especially not as an eight year old that was super Calif graduates to ... from Mary Poppins a big hit Walt Disney was so proud when it was nominated for best picture and that was of course from the soundtrack of the movie with the Sherman Brothers Richard and Robert who didn't speak\nTo each other they didn't help you enjoyed Saturday send them a time when more full\nShallow me off I'm Andy motion hosted sounds Jewish every Sunday all present in what ... been entertaining our Jewish music and usually comedy the jazz from New York [noise] hip hop from Israel\nWedding dances from Europe devotional museum in Jewish song American style\nYesterday who shop\nI Hope you'll join me on south Jewish Sundays at three PM on MTV music radio and TV on wind\nStations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte there'll be MP in Jackson\nW. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G. [noise]\nHi thanks for standing in the arts our time Larry Morsi with the arts commissioned\nEach week we bringing in depth discussion with a different state of Mississippi\nThis week I'm Talking with blues researcher and writer Jim O'Neill a native of Mobile Alabama O'Neill has been researching and writing about the boys for many years he's one of the founders of living was magazine and produced directly to many Mississippi blues musicians through his ... his life\nFor the past dozen years O'Neill has been one of the researchers are writers for the Mississippi ...\nThe trails allowed O'Neill to dig deep into the history of the blues and communities throughout the city will talk about his journey into ... producer as well as these years living and working clock staff and some of the highlights from his recent blues trail where Mississippi loose historian producer Jim O'Neill on the arts our right after the news [noise]\n[noise]\n\nHello and welcome to the arts our I'm Larry Morsi with the arts commission and this is the arts commissions weekly turn at the microphone here at MTV each week we come to you with a different in depth discussion with a different creative Mississippi and that could be an artist a musician or somewhat helps\nPromote the arts in their community and I I think today we're we're we're talking about the ladder and uh we're talking to Jim O'Neill who went a long time is a city resident he lives out of state now but he continues to work\nHelping to research and promote the blues and a African American music history of Mississippi Jim thanks so much for joining I'm Glad to be here Larry\nWell Jim your uh your CD is so long and a lot of stress we we we probably spend the whole first segment just kind of going through all of your accomplishments but for those who don't know your name maybe you could just kind of hit a few a few of the high points about some of the work you've done over the years\nI guess my first real musical contribution was uh when I was a college student at Northwestern and uh some friends that I've formed are founded living blues magazine which was America's first blues magazine so my wife and I published the magazine\nAnd from Nineteen Seventy into a Nineteen eighty three when we turned it over to the University of Mississippi and uh so it's still being published there now is and that's what forty eight forty ninth year or so\nAnd I still contribute to it you know I was the editor for a while but uh I'm Still a contributing editor and founding editor\nAnd then I also ah have had a couple of record labels are one started in Chicago and then another one started in Kansas City where I moved to a later a rooster blues records and Stackhouse recording company\nAnd I ah lived in Clarksville for a while a help to work with the sunflower river blues festival and I had a record store called the sec house and um we had a little studio in the back where we recorded a lot of\nThat's great and you mentioned that you are so where to take a quick moves music break here but you mentioned you recorded some folks in the back of your store and Clark stale so we're going to listen to one of the uh one of those artists and maybe just tell talk a little bit about that super chicken James super chicken shots or ...\nI had seen the James Johnson they called him James Coleman\nJobs than when I first knew him and he was\nPlaying bass with his uncle big jak jobs and sometimes in with other groups around clerks Dale\nThat was back in the seventies when I moved to when the clocks tail which was an eighty eight he started coming around or or one of the other local artists Ernest guitar Roy ... was trying to first told me I should record him and\nSo I got some talking to super chicken and he was driving a truck at the time and while he was you know driving a truck he would be thinking of song writing songs and he he had made a lot of little cassette tapes of his own music you know over ... and\nThey were really interesting I fought and or does he has a really he and he and his local big jak jobs or if they really are most original lose our mail the delta and several generations you know they\nThey were doing something different you know\nAnd he had like comical flowers in songs that were kind of social commentary too and and they were different styles of arrangements they weren't the standard blues so he asked me I Know so so I told him and he he thought he was just going to write songs for other people to record but\nI said no you should record these loans I remember one of the things he said well if you know if I started having to go out and play it by going to have to leave my truck driving job [laughter]\nHe was afraid of that but now now he's out there he goes all over the world player you know and he doesn't have a truck driver I Know\nWell let's listen to this is from his um album shoot that thing that came out on a rooster blues records this is James super chicken Johnson on the arts our\n\n[noise]\nBut this is lonesome in contact with some time\nThis into a rain I'm all in all my entire\nTeams don't do the same time zone\nFees being\nWinter of ...\nAnd [noise]\nKnow what the liberal\nSwing into the you know\nIs involved\nSing and stopping in time\n\nMountain movie then\nWhen they don't\n[noise]\n\n[noise]\n[noise]\n\n[noise] ...\nI'm an artist I like to thank I'm a chef I like to go like to\nPress register newspaper and said graves who was and had found the delta blues museum there they were kind of encouraging us to come to Clark stale and instead of Greenville or somewhere else and so we did we a lot of building their car sale that had been an old\nIce cream store it was called a green boat and we changed it to the Stackhouse they look like a steamboat\nLike the top of the steamboat right there was a really claim building smokestacks\nOn top named it that because of the smokestacks also because\nHouston Stackhouse was the blues artists that I was real fond of it so we thought that would be a good bluesy name for it\nThe uh first sunflower river blues festival came after a few months after we open the store and\nWe have books the actual that and I got over this rush to come down and son Thomas played on a Jesse mayhem pill and a lot of local bands too and it's a time you know it was one of the things that we tried to point out\nTo the local business community was that people would come to ... to hear the music you know that that the blues could be a tourist attraction and that was kind of a hard point to sell\nOne of the famous quotes is still a circular it sounds ... some of the people would say nobody has kind of come out that way here a black man play a guitar\n[laughter] but they did [laughter]\nYou know there were a few few tourists at the first festival and grew and grew and then they just had the the thirty first festival last week in Clarksville and there was people from several different countries around the world there and\nSo it and the little tours of small tourist industry has grown up there you know the few businesses like cat head and\nGround zero club that cater to the the blues tourists and the local blues crowd so are\n\nBut you know you can't\nBut you know you can\nDo [noise]\nWell you know they would\n\n\n\n\n\n\nYou're listening to empty being music radio\nMississippi Public broadcasting [noise]\nWe're back on the arts our for our final segment and today we're talking with Jim O'Neill he is the founding editor of living blues magazine and one of the primary researchers and writers for the Mississippi boost trail among many other things he's done in his life so Jim there's now over there at least two hundred martyrs two hundred markers now and\nUh we have another three about to be approved to believe yeah okay\nSo we were still rolling on yeah there's a we saw it at the beginning you know they were six\nAnd then they say well maybe we do ten and then we have a ... a meeting and came up with a list of a hundred and I thought we would be lucky to get through a few more but it gets such great response to markers and did that uh and it kept getting funding\nThrough the state in the department of transportation and the Mississippi or the national and our pre manatees and national down for the arts and local sponsorship you know every ... every marker has to be have some local sponsorship um but yeah it's just a a great joy that is kept going so long\nAnd so ... you're all along with Scott bread is they said the community says we want to have a you know we want to have a a marker for Otis Rush and and there may be you know a two sentence description that the local people could tell you about Otis Rush so\nWhat happens once they've decided okay now there's going to be in this this marker what what do you Scott and get going on\nWell you know we saw less the beginning\nThat a lot of this history was already documented that we could just use what we had but we also thought it'd be an opportunity to do additional research and so\nAnd that's the same time this kind of explosion of information on the Internet through genealogy sources has occurred over the last decade or so\nAnd a lot more information you can look up a lot more things you know from old newspapers on the Internet and I do a lot of microfilm research I go to the department of our guys in history when I'm In Jackson a lot of times just looked through microfilm of newspapers and in marriage certificate ... so we\nAdded that kind of your information so in ... in the case of oh just rush and found out that he was from the local courthouse in uh Philadelphia, Mississippi that he was married in Nineteen forty nine when he was like Fifteen Years old\nOr maybe Seventeen you know we had I was still researching his birthday and just a couple of months ago [laughter] and that's not what we thought it was and\nThat happens to a lot that we find out what we're right on the markers even after we do the research sometimes nothing something else comes up and I you know talking with Otis or in his family\nAnd doing the you know getting some local whatever local uh information we can you know we were able to add a lot to the usual biographies goes\nYou read the oldest Russia's biography and it kind of dismisses his early history of Mississippi which happens a lot from the guys who went to Chicago it's like\nSo so was born in Mississippi in Nineteen thirty two he moved to Chicago in Nineteen forty eight and then became a famous blues artist you know\nBut there was a lot of routes for the blues from what they were doing in Mississippi and there's a lot of family history and stuff that hasn't been documented so that's that's one of the things that's same with magic stem from ... you know one of the things I find out about him was that\nIt's a time when he was growing up in the NATO a string band music was still really strong in the black community so he was listened to fillers\nAnd you can hear some of that in his music if you listen to some of the boogie and the kind of country breakdown stuff is lanes lines or something maybe in the ... yeah\nSo you know that's all been really interesting and so and I guess one of the most interesting cases for me was the uh the prince McCoy marker no that's not a name that none of us has ever even heard when we had the first meetings you know when we came up with a list of markers we should do\nAnd while I was researching the uh one of the WTC handy markers Wu handy so you know in history\nOthers of blues and supposedly discovered that a lot you know to the blues in Mississippi so I decided well maybe there's more about handy we can find too even though he's very well documented and he was the most famous blues associated person in America for years\nAnd people still know his name\nAnd they were like contemporaneous lots of newspaper articles and things I mean he was he was a celebrity in his in his lifetime Oh yes yeah and not not just in the\nBlack community ... he was well recognized a\nYou know in the general press and so there's that apple up information on him [noise]\nAnd I said but I thought maybe there's more we can find out about him just not on you know not in the general histories and found out from a a handy scholar in New York that there were some manuscripts of his book\nSome unpublished some other versions of the manuscripts he had a book called the father the blues that was published in Nineteen forty one and that's one of the primary sources of a blue sister you know the early blues history Mississippi we heard the blues and taught while er and in Cleveland, Mississippi where you've heard this\nTrio play ended in that uh inspired him because the crowd started throwing money at him when his orchestra he had a an orchestra to the time that was probably in Broadway hits and marches and different things and they weren't getting the response and the crowd but these ragged trio if musicians did you know\nAnd one of the er the manuscript turned out he actually named who that was and it's not in the book published book doesn't name who that trio was but one of the manuscript did and it was ... McCoy\nSo uh I started on the press McCoy trail and found out that he lived in Greenville and they had a popular orcas or their later after after that after this Andy experience when he just had supposedly had a ragged trio\nAnd then moved to Winston Salem North Carolina and that tracked him they're found out and he'd become a ... a member of a minstrel show and I managed to talk to a nephew of the main Iran's Mr Bush show and\nI'm finally decided that uh we had enough information to do the marker although we hadn't ever come up with a photo\nAnd they I think the day that the market went up in Greenville reporter I'd been talking to in Winston Salem found the picture of him [laughter] oh wow [laughter] so we don't the picture not on the marker but are there are pictures of him now he was a very tall man and he's posed with the little yeah", "show_name": "Ask Me Another", "year": "2018", "city": "Jackson", "day": "13"}