{"month": "10", "state": "TX", "station": "KTDH", "content": "In concert at age ... videos [noise] they'll have his band jazz guitar settled and Morrison don't missed in my living room concerts for twenty Eighteen ... Dover lie that H. P. P. R. Garden City Saturday November tense RSVP at H. P. P. R. dot org and be there [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find an occasion to thank them for their support\n\n\nAll right folks high plains morning is coming up next on member supported high plains public radio how about the new music from it so I've got some nights out [noise] and a great new folk duo all over the crow\nReally great album ones on the cello ones on the federal I think you'll love it [noise] we've also got some old ones from van Morrison I got some credence somebody Charles some kinks some Robert Earl keen\nA little chip Taylor and some Joan ... born we're going to have a son Tuesday so stay tuned high plains morning is up next only right here on your public radio station high plains public radio [noise]\n\n\nFrom NPR News in Washington on corporate Coleman President Trump and first lady Vilonia Trump are scheduled to visit Pittsburgh today following Saturday deadly shooting at a synagogue around by with a synagogue says the president is welcome to visit however a group of Pittsburgh Jewish leaders have written an open letter to Trump asking him not to come and\nA rabbi with the synagogue says the president is welcome to visit however a group of Pittsburgh Jewish leaders have written an open letter to Trump asking him not to come until he fully denounces white nationalism\nFunerals for the victims are getting underway today as NPR's Sarah McCammon reports from Pittsburgh the two youngest victims will be laid to rest after a joint service\nCecil in David ... were in their fifties and were attending religious services when they were killed friends say the two who had intellectual disability founded supportive community at the tree of life synagogue rabbi checked diamond who once led the congregation remembers it brother that the constant presence at services and steady groups\nThat I give my study group at the end of the year of a purple was oppressive they were carried around with them wherever they are they're very proud of it they brought a lot of joy that were full of love and they really had a a presence in the community in general the Jewish community and they will be missed by by all of those\nServices for the rest of the victims will be held throughout the week Sarah McCammon NPR News Pittsburgh\nPresident Trump says he is considering in order to end the constitutional right to citizenship for babies born in the U.S to parents who are not us citizens and then for your Joel Rose reports Trump is trying to make immigration crackdown the focus of next week's mid term elections\nTrump made the remarks in an interview with ...\nWith the only country in the world\nWhere a person comes in has a baby and the baby is essentially a citizen of the United states for eighty five years with all of those benefits ridiculous it's ridiculous that it has to end in\nFact more than thirty countries around the world offer birthright citizenship\nThe fourteenth amendment to the constitution guarantees the right to citizenship for all children born in the U.S when pressed on whether he can change that Trump says quote there saying I can do it just with an executive order unquote though it's not clear when or if Trump would issues such an order if he does it will certainly spark a legal battle\nThe full interview here's this weekend on ... on HBO Joel Rose NPR News\nNew group of Central American migrants is walking north from Honduras they waited across the river into southern Mexico on Monday and one person reportedly died NPR's Carrie Kahn reports this group hopes to catch up to a larger group of migrants that's walking toward the U.S border\nPresident Trump has not let up on his condemnation of the caravan he told Fox News he will build pens everywhere so migrants who make it to the U.S border and asked for asylum will stay until their claims are finished the defense department says it will send fifty two hundred troops to quote heart in the U.S Mexico border\nNPR's Carrie Kahn on Wall street the Dow Jones industrial are up one hundred and Ninety three points at twenty four thousand six hundred forty three\nThis is NPR\nDanish police are accusing Iranian intelligence officials of planning an attack on a person in Denmark Danish police have put three Iranians under protection and arrested one person\nThe detained person is a member of an Arab militant group that initially cleaned and then denied responsibility for a deadly attack on a military parade in Iran last month\nThe man under arrest as a Norwegian citizen of Iranian descent\nChina is overturned a twenty five year ban on the sale of products made from endangered rhinos in tigers leading to widespread condemnation from conservationists NPR's Rob Schmitz has more\nSaid council unveiled rules that will allow the use of rhino horn and tiger parts for some medicinal and cultural purposes twenty five years ago raging band these products as part of a global effort to save endangered animals the animal parts were used in traditional Chinese medicine despite showing little to no benefit and scientific studies\nEnvironmental investigation agency a British nonprofit says China has made\nAnd despite showing little to no benefit in scientific studies the environmental investigation agency to British nonprofit says China has made a brazen and regressive move which drastically undermines international efforts for tiger and rhino conservation\nStudies show an estimated three thousand eight hundred and Ninety tigers remain alive in the wild wild or less than thirty thousand wild rhinos left poaching is reducing the number drastically you cheer Rob Schmitz NPR News Shanghai\nNassar says it's Parker solar proven now gotten closer to the sun than any other space craft it's about twenty six and a half million miles from the sun the goal is to get within three point eight million miles of an encore of a Coleman NPR News from Washington\nSupport for NPR comes from NPR's patient other contributors include progressive insurance offering its home quote explorer so shoppers can evaluate options in one place when buying home insurance costs in quotes and the rates are available online learn more at progressive dot com\nHappy Tuesday folks this is the beginning of the week still yes but we're going to get through it we've got great music for three hours we're going to have a great time together and tomorrow it's Halloween so if you've gotten any good dark non obvious\nHalloween ish songs you might want to hear send me an email Amarillo at\nH. P. P. R. dot org and I will try to get them in the play list it's kind of tough to do three hours of non obvious and that means\nMonster mash folks I don't know I don't know if I can do it hey thanks or tune in and this is Jenny ... live in the studio and a high plains mornings got some change for you this first hour will do some ... so I got some cater rhythm some night owls and we'll just and candy statements well\nLet's take a look at our weather across the high plains it is nine and seven central Tuesday October thirtieth twenty Eighteen looks like a little bit of rain a little bit of snow possibly cooler temperatures and tidbits on so it's a bit inconsistent across the listener regents to listen up for your area\nEither going to be in the fifties and sixties today lows in the thirties and forties\nNorthwest Kansas northeast Colorado slight chance of rain after four pm today\nCloudy skies I've sixty up high fifty one rain is likely but for one am tonight then the chance of rain and snow cloudy this evening low of thirty six and a slight chance of rain in the morning on Wednesday cloudy than clearing high it's going to be fifty one\nNorth central Kansas partly sunny and breezy highest fifty eight chance of rain mainly after three am tomorrow morning continuing into Wednesday morning ah mostly cloudy overnight low forty two cloudy on Wednesday as well then it will gradually get Saudi I Will get up to fifty six\nSoutheast Colorado cloudy day to day I was going to be fifty three rain this evening after ten pm low of thirty four and pretty likely terrain on Wednesday as well mostly before nine AM mostly cloudy throughout the day higher forty nine\nMostly cloudy and windy in southwest Kansas within forty mile an hour gusts I was getting up the sixty though likely reigned that evening after four AM cloudy skies overnight lower forty one and more rain on Wednesday mostly before noon that's going to be fifty\nSunny and breezy in the panhandle of Oklahoma and Texas today had sixty two she has a shower tonight after four AM that will continue into Wednesday mostly cloudy overnight lower forty two cloudy and breezy Wednesday the high is going to be forty two so it's really not going anywhere [noise]\nAll right folks let's start this puppy off the go ahead and started off with a great one from Francis England from the album paths we have worn from twenty Thirteen Years on our way on high plains morning happy\n... started off with a great one from Francis in Glen from the album ... we have worn or twenty Thirteen Years on our way on high plains morning happy Tuesday\nThey need to get in the ... in New guinea\nPig on a show at the time to go day you can put on\nAnd then and there and I'm\nJohn\n[laughter]\n\nTo the time to\nDo the grade\nNew mom and dad hated the rates that\nThe mind\nBut I Do the same time\nEyes ... by\nWay\nAnswer\nDay and\n\nDa da da da\nDa da\nDa\nDa\n\n\n\n\nDa\n\n\nShe\nIs when you're going to\nSpanish\nShows just\nAs much as she says\n\nTo\nA\n\n\n\nH\nGeorge Bush and the search engines\nAnd judge the judge found dozens of some ... that\n\n...\n\n\nMm\nOh man\nClean\nMm\nI could have to be you know say they're\nMarried you know your mind just to be you\n\n\n[noise] [noise]\n[noise] ...\n\nDid not think that the people they said\nFans da da da da\nDe\nThat they knew\nWhen you show\nBeing\nJob on the job\nWrote that their main\nBecause the dog\nLa la la and you're\nDrive so I'm not there to show\nOh my dream back there and that means\n... not\n\n...\n... ... ... ... ... ... ...\n\nYou might work\nA day and the ... job man you\nKnow to be\nThere yeah we are no doubt be get back home\nHe my new\nRat on the road\nHey man he stops Randall where\n\nYou know to me to do\nJob and then the ... and [noise]\nAnd now you know\nYou know ...\nHe he you know when\nNo jobs\nYou know jobs that when I\nKnew\n...\n... that's where\n... ...\n... ...\n... ... ... ... ...\n[noise] [noise]\n\nReally no no dreams where we can do\nThere for the day ...\nDay is done\nPossible in Sweden they already\nUs there for the St Bernard ...\nNew meals and she said sure she she\nGo to Shane no little dream as we can\nDo rising and sending\nMail the regime you know do the dream\nKnow the bottom line\n\nNa\n\nHousing yeah the ... so there is no longer\nA ball around the town nine on my own joined ... Simon ...\nA brown a\nIn a in a little bugs ... I'm ... I'm ... I'm In a in a\nBird ... twin October song on the high plains morning Donnan hawks before that was hello Mary unicorn with autumn line so sleepy little dreamer we have to read them back home that night out dreams inside and all over the crowd at the top\nHalloween is coming in time to celebrate demons books and other things that go in the night [noise] Hi this is bill McLachlan and this week on exploring music we're going to investigate the area's system\n... fascination that's scary tails and encounters with dancing demons seemed to hope for composers and or a few minutes we'll [noise] a whole week of scary sounds when exploring music [noise] weekdays at noon central\n\n[noise] this is Ninety One point five eighty ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nCost of operating H. P. P. R. Web stream or underwritten by community\nAvailable everywhere at H. P. P. R. dot org\nThe costs of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nLive from NPR News in Washington on corporate Coleman funerals will begin today in Pittsburgh for some of the eleven worshippers killed at the tree of life synagogue on Saturday\nPresident and Mrs Trump will arrive in Pittsburgh later today despite a group of Pittsburgh Jewish leaders who wrote an open letter they urged him not to come on let's see clearly denounces white nationalism NPR's Emily Sullivan has more\nThe president's visit was announced by press secretary Sarah Sanders at a briefing on Monday she also said the media it's unfairly blaming Trump for violent acts committed by a lone individual Trump said he will spend time with wounded worshipers and police officers during the visit\nNPR's Emily Sullivan meanwhile rabbi Jeffrey Myers of the tree of life synagogue of Pittsburgh has said that President Trump is welcome to visit\nThe president says he's considering ending the constitutional right of birthright citizenship you told online media outlets Axios on HBO that he'd do it by executive order and he would apply it to the children of non citizens however\nThe fourteenth amendment to the constitution explicitly states all persons born or naturalized in the U.S our citizens changing the constitution requires action by the U.S Congress or by state legislatures not the president\nThe mid term elections are a week from today across the U.S vice president Mike Pence and former president Brock Obama will make campaign appearances in Georgia this week Steven Fowler of Georgia Public broadcasting reports from Atlanta\nObama will lead a friday night rally in the heart of Atlanta historically black universities center it's the latest in a string of high profile visitors on behalf of Georgia Democrats including five sitting Democratic senators on the Republican side vice president Mike Pence is appearing with Brian Kemp but three stops across the state Thursday\nSenator Marco Rubio and Donald Trump junior up also stumped for the current secretary of state\nWith a libertarian candidate also on the ballot both candidates are trying to turn out enough voters to avoid a runoff\nFor NPR News I'm Stephen Fowler in Atlanta\nTyphoon YouTube made landfall in the Philippines today nearly a week after hitting the northern Marianna islands from manila NPR's Julie McCarthy has more\nTyphoon you two known locally as rosy tail has been lashing northern and central loose on the largest island in the Philippines rains have battered the capital manila further north ... province of Isabella bore the brunt of the storm with thousands of residents fleeing for shelters\nThe typhoons high winds flattened flimsy home uprooted trees and downed power lines\nSome residents described the wind is stronger than last month's deadly Thai food among coot some of the same agricultural fields devastated by that storm were inundated again with up to six inches of rain huge you has moved out to the Philippines sea headed for the Chinese coast Julie McCarthy NPR News manila\nOn Wall street the Dow Jones industrial gr up one hundred sixty points It's NPR\nThe national weather service is warning a large scale precipitation event is starting today a weather front is arriving in the upper Midwest\nThat will mean heavy snow through the entire stretch of the Rockies today through tomorrow morning especially in Colorado farther east front will bring heavy too excessive rain from Texas through the Ohio Valley\nAccording to a new study concern about the environment appears higher among minority groups yet most people believe that white people are the strongest supporters of the\nThe tax that's mostly sunny and breezy with a high near sixty two but chance of showers tonight after four AM that continue into Wednesday mostly cloudy below forty two tonight Wednesday cloudy and breezy with a high of forty to\nSupport for high plains morning is provided by the panhandle planes historical museum honoring World War one armistice day centennial featuring doctor constantly no at six PM Thursday November eight at the he's a wood lecture hall more\nAt ... dot org and just remind or the energy and environment reporting on each PBR comes from IT the great plains and the corporation for public broadcasting All right let's start this puppy up let's here's a poll born this was a request your gets you a healing on high plains morning\nGroup looping group can can do to improve boom boom boom boom boom\nWe can do to prevent it and put them in and do\n\n\n\n... and ...\nWake in order\nDo the names of in the movie\nIs there only pay\nAnd hatred and\nRead in the\nAnd each time I feel\nA\nAnd a ...\nMaybe\nIt makes the job market of God\nOr five hours\n[noise]\n[noise]\n... um [noise]\nSome kind of you\nTwenty or\n\nSome children [noise]\n[noise]\nWhen the when\nYou know in in ...\n[noise]\nThe genes [noise]\nIn in the days and all the [noise]\nIn England and um\n... ... [noise]\n[noise]\n[noise]\nIn June\nJune\n[noise]\nMm\n\nMm [noise]\n\nMm\n\n\nOnly\nI thought I could change something on the same light you wait for it I don't care like clouds in ... son down low riders day and\nEducation is based on and\nWish it would replace\nNot lying down but my I regret anything\nThat's really been changes you began\nI can show you what I see I'm not sure someone in\nOn a regular played by Ghana maybe we just the ...\nI\n\n...\nAnd ... you\n... would have been present that to to to where\nNot so well you can read\nThat's a bleeding showed a man\nBelieves in tendency to ... yeah\n\nNot make it to her I don't know\nWhy you some time and the watches no\nNo one neighbor is saying nothing to do\nOn and still try hard\nThat's the ...\nOn line down with him on the ground\nGuess I'm Still the ups and\nNa na na\nWhere\n\n... ... the\nOne thing that can be\nDone like broke the ... would you rather than make rock or do you know\nLike ... when the Muslim ... and ... and all we have so many of the ... to one of the reason I don't I\nWhen John than like a I\nOh no no ...\nDa da da da da da da da da da da da da\nDa da da da da da da\nDa da de ...\nAnd in\nThat [laughter]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nOn our next New York for her mother broadcast feature works by rock modern off and we're speaking this is Alec Baldwin please join me as we hear a lot of me or horror which some of them was Enron long enough for sure archer originally Eugene Oregon\nPortland, Oregon and it was one of our money\nThe afternoon to central\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. S. H. P. P. R. dot org\nLive from NPR News in Washington I'm Lakshmi Singh funerals for the victims of the shooting at a Jewish synagogue in Pittsburgh over the weekend or getting underway today NPR's Sarah McCammon reports from Pittsburgh the two youngest victims will be laid to rest after joint surface\nCecil in David Rosenthal were in their fifties and were attending religious services when they were killed friends say the two who had intellectual disability founded supportive community at the tree of life synagogue rabbi checked diamond to once led the congregation remembers a brother that the constant presence at services in study groups\nThat I give my study group at the end of the year or two of a ... book as a present and they were carried around with them wherever they went and they're very proud of it they brought a lot of joy and they were full of love and they really had a um presidents but community in general the Jewish community and they will be missed by by all of those\nServices for the rest of the victims will be held throughout the week Sarah McCammon NPR News that's burg\nAnd well some people say they would support a visit from President Trump others say just the opposite side accusing him of fomenting messages a paid protesters are preparing for President Trump's visit to Pittsburgh\nThe president says he's considering in order to end the constitutional right to citizenship for babies born in the U.S to parents who are not us citizens NPR's Joel Rose reports Trump has tried to make his immigration crackdown the focus should next week's mid term elections\nTrump made the remark in an interview with ...\nWith the only country in the world where a person comes in has a baby the baby is essentially a citizen of the United states for eighty five years with all of those benefits ridiculous it's ridiculous and it has to end in\nFact more than thirty countries around the world offer birthright citizenship the fourteenth amendment to the constitution guarantees the right to citizenship for all children born in the U.S when pressed on whether he can change that Trump says quote there saying I can do adjust with an executive order unquote though it's not clear when or if Trump would issues such\nPress on whether he can change that Trump says quote there saying I can do adjust with an executive order unquote though it's not clear when or if Trump would issues such an order if he does it will certainly spark a legal battle the full interview airs this weekend on ... on HBO Joel Rose NPR News\nIt's nearly midnight in Indonesia with no rest for the many searchers scaring the job is safe for victims of Monday's plane crash a lion airplane was carrying one hundred eighty nine people when it crashed shortly after takeoff\nSo far at least twenty four bodies have been recovered from the waters there remains have been transferred to Jakarta for identification as NPR's Julie McCarthy tells us there's very little hope that anyone could have survived this crash\nIn Jakarta, Indonesia as presidents greeted grieving relatives looking for answers rescue crews worked through the night searching for the wreckage of the Boeing seven thirty seven max eight\nAnd updated model of Boeing's widely sold jet the c._e._o. of lying Ayres said that the new planes are flown only since August headed unspent supply technical issue in a previous life\nThat's NPR's Julie McCarthy reporting this is NPR knee\nChina has overturned a twenty five year ban on the sale of products made from endangered rhinos and tiger's leading to widespread condemnation from conservationists NPR's Rob Schmitz has that story\nChina the council unveiled rules that will allow the use of rhino horn and tiger parts for some medicinal and cultural purposes twenty five years ago raging band these products as part of a global effort to save endangered animals the animal parts were used in traditional Chinese medicine to spite showing little to no benefit and scientific studies\nThe environmental investigation agency to British nonprofit says China has made a brazen and regressive move which drastically undermines international effort for tiger and rhino conservation\nStudies show an estimated three thousand eight hundred Ninety tigers remain alive in the wild wild or less than thirty thousand wild rhinos left\nPoaching is reducing the number drastically each year Rob Schmitz NPR News Shanghai\nLooking at new economic data out today for the U.S consumers are still optimistic about the economy's ability to keep growing so much so that the conference sports reading on consumer confidence has reached its highest point in Eighteen years one of the reasons is strong jobs market unemployment\nHas fallen to three point seven percent its lowest level in nearly half a century\nAnd the games in home prices in the U.S have slowed fourth fifth consecutive months he had some ... Case Shiller index looking at twenty city\nRoads five and a half percent in August compare with the earlier was also down from a five point nine percent gain the previous month one of the reasons for the lowdown\nClimbing mortgage rates I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from the three I owe the powering enterprise digital transformation with artificial intelligence predictor of analytics an eye on the solutions learn more see three I O T dot AI and the ... foundation at ... dot org\nWelcome back to high plains morning on members' support at high plains public radio thanks so much for being here this is our three of our show\nWe've got more great music this hour we'll have some Robert Earl keen for you and some Bobby Charles why not why not let's we'll have live in the studio Catherine's dribbling is going to stop by from the Amarillo youth choirs\nThey've got a fabulous presentation this Saturday one night only the performing with the Vienna boys' choir yes that Vienna boys' choir\nYes it's very cool so everyone in the Texas Panhandle it's going to want to stay tuned to hear that chat also will have a we'll have some more music we got some restaurants in there they're going to be playing on the [noise]\nThe Texas Panhandle going to want to stay true to hear that chat also will have a we'll have some more music we've got some returns in there they're going to be playing on the friday night November\nNight that's right November night friday night the rafters\nBe kind to me folks I was up late last night All right it's eleven o seven central and we're going to look at our weather and very briefly it's kind of scattered we got some rain we got snow we got some sun cooler temperatures today and uh\nYou're gonna have to listen to your region were all stay in the fifties and sixties for high as well just stay in the thirties and forties\nNorthwest Kansas northeast Colorado You're seeing a slight chance of rain after four pm\nCloudy skies high of fifty one rain is likely tonight before one AM than a chance of rain and snow cloudy skies tonight love thirty six and that slight chance of rain continues into the morning tomorrow cloudy skies clearing up later I was going to be fifty one\nPartly sunny in North central Kansas today pretty breezy as well I was going to be fifty eight tonight chance of rain mainly after three am that will continue until Wednesday morning cloudy overnight lower forty two cloudy on Wednesday gradually clearing up with some sunshine high it's gonna be fifty six\nSoutheast Colorado mostly cloudy today with the highest fifty three rain this evening after ten PM and it's going to likely continue into Wednesday morning overnight lows thirty four mostly cloudy Wednesday high forty nine\nSouthwest Kansas forty mile an hour wind gusts today cloudy skies high of sixty likely rain tonight after four AM that'll continue into Wednesday cloudy overnight low forty one and a look for rain tomorrow highest fifty\nPanhandle of Oklahoma and Texas sunny skies today breed the with the highest sixty two we are going to be a slight chance of showers after four AM tonight slash tomorrow morning it'll continue into Wednesday\nCloudy tonight low forty two cloudy and breezy Wednesday high at forty two that's not different that's the same high that's very weird All right let's start off this hour we're going to hear some uh ... let's get some Joan ... years her version of smiling faces on high plains morning\n[noise] [noise]\n[noise]\nWe got all the with the Burger King long good they\nHave done on the [noise] you got all the Web to [noise] uh\nAnd then he got on the wall or New Jersey [noise] when she learned all the time\nShe got 'em well\nHouse all the wrong\nYou're ... you're\nGoing to be named you made in\nYour own with getting into the job and all this information from him and he got all those and then you are good and you're listening to\nJohn and all the ... when he got all the way that the Pentagon and in the world now where do you [noise]\nYou've got all the ... not all ...\nAll day long and there's\nNo\nDoubt I'm a well I haven't got on she she was a\nGood mood\nAnd he got off the wall do\n[noise]\n[noise]\n[noise]\n[noise]\nWell\nTalk about Donald\nDonald with us long Marable\nYou got all the [noise]\nAll you want to rely\nKnow I'm\nAll bomb\nBomb\n\n\n[noise] go\nThe age PBR living room concert series continues with south western folk trio the rich dirt live on friday November Nine ... RSVP H. P. P. R. dot org don't miss the Richard November ninth ... than the there\n\nA special thanks to all of the high plains public radio member listeners who called in ... were stopped by the studio to show your support for public radio on the high plains\nThere's still time to help your public radio station by filling the gaps and get your dollars doubled thanks to a generous member in Amarillo, Texas who has issued a membership match to help meet the goals your pledge can have twice the impact when you give today at H. P. P. R. dot org\nPlane flew in Des Moines\nYou're tuned into high plains morning on number supported high plains public radio we just heard them Bobby Charles he's got all the whiskey\nBefore that we have Robert Earl king off of gringo honeymoon that was barbecue and we started off with Jonah Osborne doing smiling faces sometimes\nThanks so much for staying tune support for high plains morning is provided by United Wireless providing coast to coast service with plans to fit your budget stores in ages across the region coverage you deserve service you expect\nProviding coast to coast servants with plans to fit your budget stores and agents across the region coverage you deserve service you expect details at United Wireless dot com\nAnd by the county CB inviting everyone to come play and stay overnight in one of more than twelve hundred hotel rooms in Garden City of lodging restaurants and events at the county CBD dot com\nAlso quick announcement for those of you in the Amarillo, Texas area tomorrow night\nWeight that tonight I'm going to fix that tonight don't miss the or fail piano trio chamber\nMusic recital it WTO's Mary Moody northern recital hall seven thirty nine pm tonight enjoy live classical music\nFeaturing Julie bees on piano and guinea is on a cough on violin and ... of on shallow that it's tonight to Tuesday October thirtieth for more information you can call eight six six five one to eight five for\nAlso just a reminder all of the community calendar events that I mentioned on this program are always on H. P. P. R. dot org which means if you've got something you'd like to share go for it go to H. P. P. R. dot org cliques that events tab and just click submit your event it'll come right to me it will get it on the air\nArt folks it's eleven twenty six central and this is your high plains morning\nAnd I've got to live in Studio ... guest for the first time we welcome Catherine struggling she's the executive director of the Amarillo youth choir and uh this is this was an exciting week for you you've got a pretty uh pretty prestigious group coming to thing with your with your kids\nYes the the ... D won the the big one the one that was founded in fourteen Ninety eight I mean that's crazy isn't it [laughter] it's it's pretty impressive it's really cool now they've been here before is is that right\nThey have but they have not been to Amarillo in over eleven years wow and so it's so nice to have them back in for us to\nBe the one to support them coming back and be able to share the stage with them yeah that is really unusual because they don't normally share the stage there's\nThere's a level of expectation of talent and so for this opportunity I had to send them an audio sample and kind of opposition are boys and they accepted and I'm just so proud of them and I'm excited and looking forward to Saturday well tell us\nA little bit about the actual event the Saturday it's going to be the Vienna boys' choir featuring the Amarillo youth choir mostly it's going to be the boys singing with the boys\nYes in a ... boy wires and girl quite as we have for acquires altogether and over a hundred and fifty students but\nThis particular concert will be for the boy concert choir which is our most experienced boy choir we have thirty six members and they will join the stage with the piano boys' choir at the end for their finale\nUm they'll sing to songs and uh the Vienna boys have twenty five members traveling with them so it'll be a just a beautiful sound here sixty angelic boy voices singing these lovely songs they're going to sing um\nTwo songs one is by Strauss and it's called for ever and that is actually the title song for the Vienna as boys new CD that their touring and promoting and then they're going to sing something fun they are going to think Billy Joel\nNice yeah that's so cool now tell us a little bit about how does how does one get prepared for something like of this ... I mean this was this was pretty impressive these are I'm there for different Vienna boys' choir travel at all times and it's\nThe kids that come in there they're they're in school they're trained and then their prime to go on these tours and they live breed and eat everything about these choir you got kids that are kind of doing this extra curricular early\nThat's correct we meet with them one hour week\nEverything about these choir it's you've got kids that are kind of doing this extra curricular early\nThat's correct we meet with them one hour a week after school and uh the Boyd meat on Tuesdays and\nWe've had them since the beginning of school and so they've had about eight practices and we've just been hitting hard and we had another concert that we did earlier in the year and so they've been working on a bunch of repertoire but they are so talented and so prepared that they're able to include these to\nBid slowly go on a\nThat\nDay back [noise]\n\n\nAnd\nFor days Shannon ...\nThere's some Spanish to\nShe's kind of the girls stop to show\nTheir but it's been about\nShe danced who should be\nStory really do this stuff and\nWhile\nCan't do the yeah to me that's the whole yeah\nMan good for some then\nThe ...\n\n\nKnow good or\nShe lives\n\nDo they do\nThat was the wrist or as in I'm into something good off their brand new release live at the top\nYou enjoyed that you want to go check them out guess what you can\nThey are going to be playing a living room concert apathy been on the space on friday night November night is going to be an extremely fun night folks coming out for it you just got our sep at H. P. P. R. dot org bring some friends will have some palace copy lots of cookies you can be why else can be a really great night\nAnd it's a really fun to hang out with a bunch of other folks that love live music they're coming all the way in from ... New Mexico so let's\nSet them properly thanks against you Catherine from the Amarillo youth choir for all her fabulous service getting these kids are honed and ready to perform as one of the most foremost choirs\nIn the world we had teach your children before that with Crosby stills national young and Billy Joel Vienna you can go check that out it's a Saturday eight PM\nNot going to be the Amarillo globe new center all get all the links to ticket the panhandle tickets dot com up on H. P. P. R. dot org\nSoon as I get off the air folk well it's eleven forty five then troll support for high plains warnings provided by commerce banquet convenient location throughout Garden City local staff and home town decision makers will ask within an spoiled to help find your financial solutions number FDIC\nAll right let's keep this music going I got some kinks for you here here comes yet another day in ain't true on high plains morning\n\nThe bone\nLife\n[noise]\n\nThere may be\nBing bing made\nA ban on her ... and\nPays me in the\nUm yeah\n\nAnd I go to the data", "year": "2018", "show_name": "High Plains Morning", "city": "Dalhart", "day": "30"}