{"month": "10", "state": "TX", "station": "KTDH", "content": "Now if you think that description sounds a little familiar you are right this is actually the trouble we've devoted to explore you simply because this is just the grants is a former for customs and composers\nAnd audiences are always love it so joined us this week when it's boring music [noise]\nWeekdays at noon central\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream and please thank and patronize the community sponsors you hear mentioned on the air who helped cover the direct cost of operation thank you\n[noise]\n\nOh hey this is high plains morning coming up next on member supported high plains public radio folks\nIt is Wednesday and if they were getting over that hump together I got more music for you today how do we do some Rita Coolidge or that is right she's got a new album out we have some Simon and Garfunkel by her class\nGary Knell said she lives in cloud I got them David Crosby in their blood sweat and tears and another one from the late ... rash plus racial Coleman is joining me in the studio we're going to have a blast they tend to fall membership campaign on high plains morning [noise] them [noise]\n\n\n\nLive from NPR News in Washington on corporate Coleman hurricane Michael is now blamed for at least twenty six deaths authorities in one county in the Florida Panhandle are raising the death toll there the area including Mexico beach in Panama City where damage to homes and businesses\nHandle are raising the death toll there the area includes Mexico beach in Panama City where damage to homes and businesses is extensive NPR's Debbie Elliott has more\nMost of the storm related deaths are reported in Bay county along the coast where hurricane Michael made landfall search and rescue efforts are still underway thousands of people have been reported missing a high number in part because of fractured communication system\nNPR's Debbie Elliott Michael came ashore in the Florida Panhandle is a strong category for hurricane\nSecretary of state Mike Pompeo is visiting on pro where he talked with Turkey's president and other leaders they're reviewing the case of missing Saudi Arabian journalists Jamal ... Turkish officials have said they believe ... was murdered after he went inside of Saudi conflict and never emerged\nSaudi Arabia denied that Pompeo visited Saturday leaders yesterday and said the Saudi Government is investigating\nPresident Trump is threatening to cut aid to any country that helps hundreds of Honduran migrants now walking toward the U.S southern border Maria Martin talked with the director of a migrant shelter housing the Hondurans who are passing through Guatemala City\nFather mode of which says if they hit ... a shelter no housing nearly a thousand migrants from Honduras he says more are expected on Wednesday and describes what he's seen as a serious humanitarian crisis\nYou know that I wanted a little more you said\nThe Trump Administration is threatening to cut off aid to any country that helps the so called march of migrants including Guatemala and Honduras\n... will not do the ... syndrome that it goes on them as it by the rules of equal\nThis previous to work with migrants for over Twenty years since if he'd had really gone to help the poor these hundreds of people would not be fleeing from violence and poverty for NPR News I'm mighty on Martin\nThe European Union had hoped to approve a breakfast agreement at their summit taking place today in Brussels but at the results reports talks are at a standstill with just over five months to go until Britain departure from the block\nEuropean Council president Donald Tusk says he has no grounds for optimism that the jammed Brexit talks will be resolved at this meeting you leaders ask the British prime minister Theresa May come with new proposals or risk leaving in March with no deal\nThe biggest hurdle is a settlement on held the border between you remember Ireland and the u._k. Northern Ireland can remain open for trading in traffic\n... you would like Northern Ireland to stay in its customs union but May's government says that's not a long term solution there were reports the EU is willing to extend the transition period by a year in exchange for British concessions on the border issues for NPR News I'm Teri Schultz in Brussels on Wall street the Dow was down more than two hundred points [noise]\nThis is NPR\nRussian officials say a student in a vocational school in Crimea attacked other students today killing at least Seventeen people and wounding more than forty others he then took his own life there have been differing accounts of what happened\nRussian officials for suspected a terrorist bombing now report suggests some of the victims may have been shot to death\nProtesters are rioting outside of Hindu temple in southern India to try to prevent women from entering NPR's Lauren Frayer reports from Mumbai the temple reopen today for the first time since India's Supreme Court ordered it to admit women [noise]\n\n[laughter]\nFemale TV reporters covering the reopening of this temple in the state of ... are among those who've come under attack by protesters Hindu temple is dedicated to celebrate deity women between the ages of ten and fifty were banned from worship but last month India's Supreme Court ruled that\nThe Hindu temple is dedicated to celebrate deity women between the ages of ten and fifty were banned from worship but last month India's Supreme Court ruled that discrimination\nThousands of police are surrounding the temple to ensure the safety of female worshippers but protesters have blocked their access and hard line Hindu groups are threatening mass suicide by self immolation if women are allowed to enter Lauren Frayer NPR News\nMumbai there was no winner drawn in last night's mega millions lottery the jackpot rolled over it is now swelled to eight hundred sixty eight million dollars is still the added prince says that's the second largest jackpot in us history it's the biggest ever for the mega millions the next drawing\nWill be on friday on core of a ... NPR News\nSupport for NPR comes from NPR stations\nOther contributors include Subaru featuring the all new three rows sense with seating for up to eight and a choice of second row captain's chairs love it's what makes a super super learn more ... it is\nTime folks we got high plains morning up right now on high plains public radio hope you are ready for three hours of great music\nThis is Jenny ... live in the studio at I always am and I'm so grateful we've got Rachel Coleman from liberal live in the studio with me we're going to join you for these three hours of music and I've got some Courtney Hartmann and ash Taylor Ashton we've got them Elton John and Leon Russell we've got the ... so new anti oh Klee\nWe've got some great music for you today on high plains morning and Rachel welcome to high plains morning thank you so much for being in the studio with us today well thanks it's my pleasure awesome well you know at first and foremost I Want to celebrate we were all just high fiving and jumping in the air like little freaked out because we met the goal left our [noise]\nThat's right and we want to thank Jocelyn Dewey some Garden City for helping us get over that finish line it's always really exciting and a satisfying when we see that people are joining us and also helping us meet are matched challenges so we'll be doing that also this our\nWonderful and so we are just so grateful for everyone out there this is how we do this folks this is how these membership drives\nGo one member at a time one person at a time coming forward and saying I Want to support public radio on the high plains it's something I Can't fathom living without and I'm absolutely going to go forward and protected and encourage others to do the same one eight hundred six seven eight seven four four four is the number to call\nThere is a lot going on across the high plains so I have some community calendar things for you I've got uh some weather for you and we're going to have a great time with this music\nThe thank you so much for staying tuned in supporting your public radio station uh I don't know about you write till I Love you are a a former newspaper or your former journalist or current\nI'm a former journalist summer journal aren't covered dark side of PR okay recovering journalists and for NPR as a as a ad copy writer you are you're reprieve with me so we are so grateful to have a you know people across the high plains you've lived here for how long\nMore than Twenty years so this is this is this region I don't know about you I Am always just absolutely\nBlown away by the variety of people that support public radio you get to me the most interesting people they come in here they have these life stories some of them are from here and everything amazing that happened to them happened to them right here on the high plains sometimes they come from all over\nLike I I grew up in Tanzania a okay that's incredible so we're going to celebrate or we're going to celebrate today on high plains morning we're going to have great music we're going to tell you about all the cool events going on across the listener region and a Rachel I Want to hear some request so I'm going to ask you for some in addition to ask all of our listeners out\nGoing on across the listener region and I'm Rachel I Want to get some request so I'm going to ask you for some in addition to ask all of our listeners out there call us at eight hundred six seven eight seven four four four or go to H. P. P. R. dot org now during the show we have got a membership match on the table don't we\n[noise] that's right we've got five hundred dollar membership match from a friend in Tribune\nAnd I am a huge advocate of member matches they helped me especially this morning I wanted to renew my membership and kind of make up for a shortfall that I had in the previous year and\nI got to say here at H. P. P. R. you are never guilt trip to uh I you're welcomed with open arms and you don't have to let those a previous experiments be a barrier and you're thinking just come in here they are going to hug you\nOn the scene in\nThe case may be going to be in\n\nShoes and [noise]\n\n\n\n... ... ... ... ... ...\n... ... in\n... ...\n... ... men and women are thinking\nLike I'm I'm\nOriginally from the ...\nBush really and I'm a ... which are the kids learn\nBy ...\n... names and\nThe and the\nPolice shooting\nFrom the other to learn in\n... la la la\n\nLa la\nLa\n\nDown to the new law\nWhich is you named ... ... ...\n...\nWhen the choose\nA new life to choose one in\nWhich the\nNumber one place you can\nBe\nFound on\nThe news\n... to\nDuring\n\nSome\nTry to in some sort of\n... ... ... ... ...\n\n\n[noise]\nOoh\n... to\n... was a\nWhile I'm\nSean I'm\nA\nA\n\n\n\nIt's beginning to look a lot like fall across the high plains with pumpkins on porches and the faint smell of firewood feeling beer which means it's time for H. P. P. R. is full membership campaign [noise]\nWell H. P. P. R. understands the importance of uninterrupted programming we also know that without listener contributions the service would not be possible through H. P. P. R. you gain knowledge and grow community so please give today at H. P. P. R. dot org\nYou're tuned into high plains morning on member supported high plains public radio we just heard new music from Gregory Allen is a cough got a new album out called evening machines I Love that title\nThat song was called where are you going to go Courtney Hartman with Taylor Ashton they paired up for an album called bid on your side that was which will\nWe had baby driver Simon and Garfunkel and the top of that set new music from dawn and hawks but a lot of combination people in there that was ordinary day\nThanks so much for stay in tune to high plains public radio that says high plains morning I in your house and music director of high plains public radio I'm ... I'm so excited I've got Rachel Coleman live in the studio with me from a liberal Kansas and\nRachel it is nine twenty eight and we need to keep on track for our five hundred dollar membership match we need folks to call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org to get their dollars doubled during the music\nWell and I brought some extra incentives along to help sweetened the pot here at sewer County Community college we've just introduced a new program in partnership with K U\nAnd it's for intelligence work and national security so like spies yes like spy excellent and you could start in the middle of the high plains here you know all causes five state area all these small communities sprinkled here\nAnd end up doing all kinds of things that could literally help save the world and so I've brought these save the world flags that's I think it lines up nicely with the mission of H. P. P. R.\nI'm a\nDad Joe Millionaire\nAnd loan to\n\n[noise]\n...\nTo ...\n[noise]\n[noise]\nFind\nShe\nOn the\nThe but\n\nMom\n\nKnow and the\n\nLovers we want to buy on you that was Carly Simon put your little disco pants away before that we have the door with the by off of a more than hotel started off with a lot of doing secret agent man you're tuned in to high plains public radio and this is your ...\nMore than hotel started off with PS alone doing secret agent man you're tuned into high plains public radio and this is your morning music show high plains morning\nI'm Jenny ... below your regular host your standard host for the music and\nI've got live in the studio with me Rachel Coleman and she's here because she's a big long time supporter of high plains public radio at once you share her energy and ah she wants to share her talent\nTo encourage all of you across the high plains to step forward and support high plains public radio get your dollars doubled during this program by calling one eight hundred six seven eight seven four four four you also get 'em doubled if you go to H. P. P. R. dot org\nGood at home page click that give now button a tiny little brick in the upper left\nTakes you right to it you can get your dollars doubled and for five dollars a month if you do five dollars a month totally doable for\nMost people just make that jumped it's sixty dollars a year that's it and you get that calendar submissions of photos across the high plains we've got so many reasons to do it plus Rachel you brought in some ... that last that was all about us spies and intelligence and secret agents well\nThat's because we've started a new intelligence program at Seward County Community college in partnership with K U and we just got in these amazing hat I Love them I really caught at one I haven't figured out how to ethically get one for myself\nBut they say save the world because that's what you can do as a member of the intelligence community and all kinds of\nDifferent agencies and capacities and the intelligence community is recruiting people from the high plains people from small towns people from places with a immigration a connection so that people who are bilingual can be part of it's important work and you can start that at Seward County Community college\nSave the world and we thought it was perfect to bring those caps too\nHigh plains public radio this morning because that's also a part of saving the world broadening our community keeping abreast of the things happening in the wider world which are connected to us right here\nSo I Hope you will join us this hour and through the rest of the morning we've got the five hundred dollar membership match up for grabs and of course the calendar which Jenny was talking about it's so beautiful\nI'm proud to say that one of our instructors from Seward county helps contribute some photos to that suit sprinkler journalism instructor and they're beautiful so you'll get the calendar no matter what if you're very fortunate will draw your name and you'll get one of our for swag sets and uh we just hope that you will become part of it is important important initiative\nA right now I have I think you can I tell the think you know\nYou do it every show it's radio thing is is new to me [laughter]\nSo Maria entirely drinks are friends from Kansas up there in the eastern corner of of Kansas near Kansas City they are driving today through Nebraska on route to Wyoming and they are listening to us on line because you can do that\nUh we're everywhere and they requested a song by Darrell Scott I still miss someone so Jennings is going to add that to the line up this morning and we will be thinking of you are writing so much for calling\nOne eight hundred six seven eight seven four for for the number to call thanks so much to Charlie thanks so much to Maria for your note absolutely play this for you Darrell Scott here's a live version or he's playing with Danny Thompson and Kenny Malone in North Carolina\nI still miss someone what do you want to hear folks get engaged engage with this music that says your program one eight hundred six seven eight seven four for for the call and give us a request we're having a blast\nFor the next three hours we're going to raise five hundred dollars but it starts with your phone call right now one eight hundred six seven eight seven four four four and when you're making that request\nPeople supporting one another and that's what high plains public radio is\nJust forty seconds left of this hour we are going to have news at the top of the hour but then we're back with more great music but do it right now make your call now at eight hundred six seven eight seven four four four or go to H. P. P. R.\nDot org just twenty seconds left in this hour get your dollars doubled do that five dollars a month sixty dollars a year gets you that gorgeous calendar will send out right after the drive and you'll have it ready for twenty Nineteen and also you'll get in on those drawings one eight hundred six seven eight\nSeven four four four and new is coming up next thanks so much for supporting your public radio station one eight hundred and six seven eight seven four four four\n... where you're joined us as we were going to do this you\nKnow if you think that your scriptures so little\nFamiliar subjects you the truth we do because it's just the grounds for former for special measuring composure and orders his regime over to join us when we're born [noise]\nDo but Noone central\nIt's an audience is always love to join us we want to foreign music [noise]\nWeekdays at noon central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find an occasion to thank them for their support\nLive from NPR News in Washington I'm core of a Coleman secretary of state Mike Pompeo is in Turkey talking with leaders and reviewing the case of missing Saudi Arabian journalist ...\nThe Turkish government suspects Saudi Arabian official killed him ... met with Saudi official yesterday who vehemently reject the allegation and say they're investigating McCain's\nMeanwhile Pompeo told reporters the U.S had a great relationship with Saudi Arabia I Do think it's important that uh\nKeep in their mind we have walked with important\nRelationship an actual relationships with us body company governmental voices of things we work together all across the world\nReduce the risk to the United states of America and the world's largest they sponsor terror Ron bodies have been great partners working alongside\nIn an interview President Trump criticized the criticism of Saudi Arabia comparing allegations against the kingdom to sexual assault allegations against Supreme Court justice Brett Kavanaugh Trump says cabinet ... innocent\nThe Taliban have claimed responsibility for a bombing in Helmand Province that killed a parliamentary candidate three days before the election Jennifer glass reports from Kabul\nThe bomb was placed in the office Abdul Jabbar ... Lashkar Gah the capital of Helmand Province in southern Afghanistan\nThe Taliban control much of the province and say they kill the parliamentary candidate on the last day of campaigning\nAfghan president Ashraf Ghani called car I'm On a martyr and Braves fan of the country he is at least the tenth candidate killed in the run up the parliamentary elections scheduled for Saturday with the Taliban and Islamic state have down to disruptive vote and colon Afghan to boycott it\nOr distribution centers election workers and pulling sites have all been attacked with more than two hundred and Seventy people killed or wounded\nFor NPR News I'm Jennifer glass in Kabul\nOfficials in Canada say they'll move forward with a plan to pardon Canadians convicted of simple pot possession charges and Dan carpet jak reports the move coincides with the legalization of recreational marijuana which came into effect today\nThe government will issue pardons knocking down the state or the expungement of records pardons will apply to anyone charged with thirty grams or less of marijuana\nThe main cabinet ministers on the Canada's file public safety justice health and border security will lay out the plan in broad terms other news conference in our water sources say the partners won't be granted right away and there will be several options that could be used to facilitate the process was to have people fill out of formed qualified\nPrime minister Justin Trudeau had promised to address the pardon issue as soon as legalization of recreational marijuana came into force\nIt's estimated that hundreds of thousands of Canadians carry possession charges on their records for NPR News I'm done carpet Churkin Toronto\nOn Wall street the Dow Jones industrial average is down two hundred eighty four points or more than one percent\nYou're listening to NPR News from Washington\nContinues along the Florida Panhandle and in parts of Alabama and Georgia from hurricane Michael at least twenty six people are known dead from the storm in Florida Georgia nor\nThe land in parts of Alabama and Georgia from hurricane Michael at least twenty six people are known dead from the storm and Florida Georgia North Carolina and Virginia was unknown is how many people are missing\nThe long running voice of big bird and Oscar the grouch on Sesame Street he's retiring actor Carol spinning is leaving the children's program after fifty years NPR's Andrew Limbong has more\nI sell ... has been a part of Sesame Street and it started in Nineteen sixty nine\nTo ... very\nA newly laid an egg laying here to\nBe free Finney dedicated his life the puppetry even met his wife Deborah on the set of Sesame Street and twenty Fifteen he told NPR that he was close to his characters including yes big bird but also\n... it's pretty much ah I think I Know how he thinks because he thinks exactly the opposite of what I think is the\nWay to be two current senators actors stepping into the bird at ... rolls into Limbong NPR News\nEuropean Union leaders are gathering in Brussels for a meeting on the future of the United kingdom's exit from the EU noticed Brexit\nToday's supposed to be a deadline for you and the United kingdom diplomats to reach a deal on how the u._k. will leave the block next march it's been tough going negotiators are stolen over what to do about the border between Northern Ireland which is in the u._k. and the republic of Ireland which is a member of the new\nUm corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Hitchcock's insurance\nProvider and customize insurance for small and medium businesses so they can do more and be more learn more at age ... CEO X. dot com or from an agent to Scott's insurance encourage courage\nWelcome back to high plains morning on member supported high plains public radio we've made it to our two of our show congratulations folks we are chugging away at this uh five hundred dollar membership match\nNow is the time to call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org and support the music that you the music program and that you hear on high plains morning and possibly have been hearing for almost forty years now continue the legacy with your support\nWith your phone call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org were not slowing down I've got Rachel Coleman live in the studio from liberal Kansas and uh we've got some great music coming up this hour Rachel\nI'm so excited I was sitting here looking at your list of emotions on the wall for this Dr feeling proud inspired empowered passionate helpful\nAnd it's great because it all goes along with the theme of save the world that the sewer County Community colleges promoting in our visit here and and uh try and some swag in on the table for people who join\nAnd help support this really important resource on the high plains\nAnd it's getting chili so we all need a net cap that's right it's so cool it says save the world it's a little gray knit cap with our with our motto on there and it helps promote the intelligence and say craft program it to her County Community college which we're doing in partnership with K U and that's a brand new thing\nI I Love that we hear so much on the news those of us who listen to the high plains public radio I see a large percentage are also news junkies\nUs so we listen quite a bit and we've got we've got spy talk all over the place it's almost surreal so it is really cool to hear that something right here on the high plains is blossoming and supporting these ah these are places of need and the intelligence community so thanks so much\nSo it is really cool to hear that something right here on the high plains is blossoming and supporting these ah these are places of need and the intelligence community so thanks so much for bringing that stop folks look at it on our Facebook page if they're really cool cat that just says save the world\nDead center you got a great T shirt with a gorgeous graphic on their um that shows you know like\nThe pieces of the a spy puzzle and then a fat fabulous little uh a notebook that you can keep your notes in an all your spy code\nSo we're really happy to be here and we want to support you and support the station you can do that too by calling one eight hundred six seven eight seven four four four join us a doesn't have to be a secret\nGet your dollars doubled right now with the five hundred dollar membership match or at Rachel we're gonna we're gonna play a lot more music this hour I'll have some David Crosby some any ugly we got some new Rita Coolidge as well plus a new track off the brother brothers albums\nCouple of identical twin brother that sounds so close to an updated beautiful version of the ... brothers at just warms my heart\nAll right let's take a look that was not English let's take a look at whether across the region Wednesday October Seventeen to twenty eight teen\nDefinitely pleasant across the listener region and uh we're gonna have high staying in the fifties and sixties do areas could see some rain over all lovely day lives in the thirties and forties North West Kansas northeast Colorado sunny with the highest sixty partly cloudy tonight love thirty nine Thursday mostly sunny breezy highest fifty six\n\n\n\nI think we're all joining in on the applause on that one a very cool lived track from Otis Rush I Can't quit you baby before that we had blood sweat and tears with I Can't quit her and ironically we had a pledge from someone that I quit one time [laughter] so Rachel tell us about the lady\nThat would be happy dogs and from Fort Worth and we're so thankful for her ... contribution to help us reach our goal were filled chipping away at it so join her and a Jenny I Want to know the story about the quitting\nWell I guess someone that I met when I first moved to the Texas Panhandle and she was just perfect she was such a fabulous ambassador for uh Amarillo I'm a woman who's just spent her life in service and she was just kind of one of these people I describe his life goals I just want to be just like this person\nUtterly trustworthy such a great mentor um and I had I had joined her as an AmeriCorp vista you know my life in service my my life and not trying to be a volunteer and give back to communities and I got the job at high plains public radio right after I started it would kind of\nIn the in the pending mode and I was like well is it falls through I gotta I wanted I Want to do this thing at refugee services attacks us and it was fabulous working with her but when the ... came up I Would just like oh my gosh I Can't I Can't even tell you this cat it broke my heart\nTo leave the fabulous team out there and people who really to dedicate their entire lives to service and that's just a core belief of people on the high plains that I've met so many people\nSo many fabulous people like Cathy that inspired me to continue and service and so Cathy thank you so much I'm so sorry I quit you and uh I I I Swear I didn't have those songs planned what I thought your pledge come in maybe you thought of that you're like oh Jenny quit the one time\nBut it was only it was only so I could do this um and I still totally support all the work that refugee services does and I thank you so much for everything you did to inspire me so joined Kathy right now folks she doesn't even live in Amarillo anymore she lives in Fort Worth\nWell in general I Love your story about quitting service but not quitting service because here at high plains public radio you are still serving this radio station provides really important relevant news to people all over the high plains of Colorado Kansas Texas\nOklahoma Nebraska and\nOur voices are amplified by what we hear on the radio we hear other people who care about the same issues whether it's refugee services whether it's water issues whether it's politics a that's a it's a conversation in a community that's going on all the time and we need you to join in\nIssues whether it's politics a that's a it's a conversation in a community that's going on all the time and we need you to join in\nEven if it's just five dollars a month even if it's if it's giving up that one coffee\nUh we we know that having more of us together matters and so it's not about the money so much as it is about the community we just want you to call in and be part of this one eight hundred six seven eight seven four four four and this is your way of being in service\nLet's hear from folks out and have let's hear from Colby what are some of the town down by a in Seward county that we can call out oh planes\nKismet um rolla Elkhart we have a a huge service area for college\nAnd it overlaps with the high plains public radio service area as well you ... uh I Know that some of the photos on the calendar or from us a chance to members to sprinkle and she also works with the college so um if you know to if you know people in Savannah\nA you will want to see this calendar and it will look like home to you so call us be part of this\nOne eight hundred six seven eight seven four for for the number to call I Love hearing from folks up in St Francis there's a coffee shop up there there's a community of people up there\nA support the art support culture on the high plains I Love hearing from Lamar I Love hearing from Holly and our eastern Colorado town and the Texas Panhandle I absolutely adore driving through there what great\nLandscape up there there's there's some area than a border there's some areas in the panhandle um Tampa everything is so fabulous to know that we're a part of this beautiful landscape across the high plains and we're joined by this one strange a more if its blob of public radio\nSo join me a perfect aim orphans blob for you to support [laughter]\nWith the music and we just got a request outrage when we got a request for diamonds interest and of course that's Joan by as an old folk song we play so many different folk songs on this show and I love hearing from listeners so call us right now one eight hundred\nSix seven eight seven four four four give us your request let's get some participation going and while you're at it make that contribution to public radio and chip away at this goal we've got to get to five hundred by the next step by by noon so we've just got an hour and thirty six minutes left Rachel given that number again one\nEight hundred six seven eight seven four four four get us over the halfway mark and our overall pledge drive\nAll right we're going to hear from joined by as I listen to that to Mike in Hayes diamonds rocked on high plains morning\nWe\n\nNot use\nWhy\nOh boy died you know\nHeading straight oh\nOne day my poetry was about the\nWeather you calling from\nIn ... and they let it\nGive me some\nLending we don't know what the memory and brain\nWhen I'm On the other\nI'm right in\nYour mind oh\nSay\nTease them not\nTo watch the movie yes I'm sure\nThe TV was\nUm\nI don't\nNot\nA\nHigh from na\nSpeaking directly by saying people\nThen na\nMm\nKnees\n\nTend to be the another word for it is\nKeeping me man\nThe CSI law do you do the and the\nDavid Crosby off as a\nPrevious to the most recent release light how he of course has a brand new album out we've got a request and for all we don't just quite habits yet that's right David Crosby still going strong that was drive out to the desert key lesson cloud before that with faded flowers and joined by it by request that was diamond and ... what a great song I had a sneaking suspicion that might have\nBeen about Robert Zimmerman if you know what I mean hey folks this is high plains morning on member supported high plains public radio it is ten thirty nine almost ten forty and I've got Rachel Coleman live in the studio with me I Am so thrilled to have\nYou here um and have a representative from southwest Kansas live in the studio and we were we were just discussing you know we've got we're chipping away at the five hundred dollar membership match we get dollars doubled\nUp to five hundred dollars for this entire morning and do we go until noon but do not wait make that phone call now let's get it going and stay on track for this goal one eight hundred six seven eight seven four four four and outrage that we have some other sweetened pots to add to that so folks donate\nNot only do they get their dollars dabbled but they can also\nThey can get a calendar with these amazing photographs of this region taken by ... area members of the high plains public radio\nI really covered the calendar I haven't been able to get my hands on my own copy yet I'm waiting for it to kind of put him and and uh the other thing that we're giving away is a chance to win four of our swag sets about save the world or the program for intel and state craft at three County Community college it's a brand new program\nHelps our new students get their feet in the on the ground for a career in oh a huge array of\nIntelligence community jobs and opportunities to really save the world we thought it was a great tie in with what's happening here at high plains public radio um it it is a T shirt a knit cap and a little nifty blacks by a journal that you can use for whatever code\nUm is a T shirt a knit cap and a little nifty black spy journal that you can use for whatever code or shot diary\nBut I'm Will be doing a drawing for four of those flags that's for people who call in this morning and we already have had some some people call in Terry Malone called and renewed membership\nUh Cathy in Fort Worth called in and also Maria and Charlie drinks as they're driving across the state they're listening online so um we're just happy for these members and we want you to join them and call eight hundred six seven eight seven four four four to be part of this\nOne person at a time one to pledge at a time one renewal one new membership at a time that's how we do this folks that's how we need this goal all of us have to come to gather and keep the station strong keep this signal on the air but it starts with your call let's get one call on the line\nRight now one eight hundred six seven eight seven four four four maybe you're out in eastern Colorado and you're listening having a nice day it's a little maybe a little bit sunny out there and do your side step and some of this a\nColder weather that we're having here one eight hundred six seven eight seven four for for the number to call to heat it up for your public radio station and if you've already a renewed if you've already put in your pledge to support we just want to say\nThank you thank you so much for powering the service across the high plains and I encourage you I Know you have smart friends encourage them to make that step also it's as quick as a phone call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nEight hundred six seven eight seven four four four or H. P. P. R. dot org we have more great music coming up this hour and beyond will have some uh Elton John we got from Leon Russell and read a Coolidge off her new album as well\nSupport for high plains morning has provided by Amarillo symphony protesting George Gershwin concerto in Africa ... virus conducting featuring Conrad dial on piano October nineteenth and twenty seven thirty P. and at the globe new center\nAmarillo symphony dot org and by commerce bank whether you're looking for the convenience of online banking or the assurance of investment management converts can help coming bank dot com member FDIC\nAnd by red wing shoe store in Amarillo offering work boots featuring iconic style with classic triple stitch and hand crafted red wing original leather for construction transportation manufacturing and other industries more at red wing dot com\nWe have a lot of things going on across the high plains this is a this is where like everything from now until the end of the year all across the high plains so many events so many cool things going on so I wanted to tell you about a few of them Amarillo, Texas listen up\nFor a better employee health reduced absenteeism improved employee satisfaction that sound good to you well on Wednesday October seventeenth that's today from eight thirty AM to three thirty PM Texas a m's agra life extension service\nYou can learn how all are possible when you learn to develop health and wellness programs that suit your organization specific needs get the details that have bothered workshop Amarillo College downtown campus\nThirteen fourteen south Polk\nFor more info you can call eight or six three seven three eighty to eighty nine\nAnd then jumped in Kansas say it's not often I get to announce touring comedy musicians was talking dogs but junk and Kansas get ready for this comedian taught Oliver a nationally known comedian is bringing the last year town with his amazing talking dogs hilarious comedy at a bit of magic get ready to bust uh got on friday October nineteenth\nSeven thirty PM at the state and county junior and senior high school in Johnson Kansas don't miss Todd Oliver and if you need more in so called six two oh three five three zero zero one two\nReady so this is just ah this is something that we do\nOliver and if you need more info called six two oh three five three zero zero one too\nNow Rachel this is just ah this is something that we do here on high plains morning because we have the time we just kind of make it a platform for all of the different folks across the high plains and the towns and communities that are hosting arts and culture that are hosting a\nKind of community service things that make this place better on the high plains eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nSo I've got an event coming up this weekend that I Want to talk about where it is part of our partnership with humanities Kansas from there to hear immigrant stories of liberal or we're going to host a story telling story recording workshop at two PM in our library on campus\nNormally the library is closed it will be open on Saturday at two pm for this workshop um it's not limited to first generation immigrants who might be a story about your grandparents how you and your family got to Kansas and we we've got a\nA moderator who's going to give it some chips and help us get those things down on paper will also do some sound recording and that will all become part of the Kansas historical archives so this is a free event is a great opportunity to save some family history and to talk about the tapestry of our community so it's two PM\nWonderful the folks wanted one person at a time one involvement at a time keeps high plains public radio\nOn the air and things like the community counter really does join us across the five states we are here together for high plains Public Radio's listening region and we just need you to step up with your support and power this service\nFor everyone across the high plains call it an eight hundred six seven eight seven four four four and share your share your involvement how is it that you listen to high plains public radio maybe you're out in Colby right now maybe you're out in such Hanna is this the ... to ... to have a chance to okay I've heard it both ways where people just liaison over the tea but\nYeah it's it's such a cool such a cool town name I Love that one uh we had one from nor cater the other day\nA La Crosse we've had so many different places up here from our Texas Panhandle right now you're out there listening in the Texas Panhandle represent protects us folks do it for me one eight hundred six seven eight seven four four four or go to H. P. P. R. dot\nOrg put down whatever you're doing just take this pause it will take a couple of minutes out of your day and you'll get your dollars doubled if you can do that sixty dollar level you get the calendar and you get into drawing and right now\nYou've got a hundred percent chance of winning one of the force that\nThat's right and you know it's part of saving the world and being part of this community at H. P.\nP. R. and we got any ugly up next she's about she they are going to a trio of women from Oklahoma they're going to be playing the living room concert in a spring up twenty Nineteen were so excited they are playing both in Amarillo in Garden City should the song wake up on high plains morning one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\n\n[noise]\n[laughter]\n\n[laughter]\n\n\n[noise]\n\nIn the two he\nYou know\nThose\nNeed busy I'm\nNa show\nOwnership the community that we have here on high plains public radio is so important to every one of us that thrived here on the high plane to live and work on the high plains that not\nHave to miss any of that access not have to miss any of the music\nOr that larger markets get because we come together because we all put a little bit into the pot all of a sudden boom you look up and you're there one step at a time one call at a time be the next caller an eight hundred six seven eight seven four four four and joined this community of listeners become an active\nPart in the program and you hear on your public radio station it's right there on the dial but it's powered power by supporters by members just like you that made that call that's the only thing you gotta do make the call and put forward your contribution and all of a sudden you are part of something spectacular on the high plane just thirty seconds left in this hour\nLet's end it strong one eight hundred six seven eight seven four four four or H. P. P. R. dot org give us a request tell us what you want to hear if you've already pledged\nCome at me bro let's do this ten seconds left in this hour let's get some callers on the line right now one eight hundred six seven eight seven four four four we want to hear from you right now we want to hear how you engage with high plains public radio news his next we'll be back [noise]\nEither this is bill McLaughlin what are you the joined us as we grew up in the sense\nThat if you think that description sounds a little familiar [noise] this is actually the total we've devoted to explore simply because it's just the grounds for former for customs composers an audience is\nAlways love to join us this week on a foreign music [noise]\nWeekdays at noon central\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nThe costs of operating H. P. P. ours Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nLive from NPR News in Washington I'm Lakshmi Singh was spotty electricity and phone service to search for missing hurricane victims in the Florida Panhandle is precarious\nIt's been a week since hurricane Michael leveled entire community as floodwaters recede more bodies are being recovered\nThe death toll in Florida and other states is at least twenty nine dozens of people are unaccounted for with fears rising that people may still be trapped beneath their collapsed homes NPR's Greg Allen takes a look at one community that was almost wiped off the map\nSome of the worst destruction is in Mexico beach or search and rescue teams have been combing through thoughts of destroyed homes would help all dogs and lifting gear does have been reported to Mexico beach it's not clear yet how many Florida emergency operations center says twelve doesn't beg ... plus one death in ... county had been confirmed by medical examiner's\nThat's when the storm of also been confirmed in Gadsden county ... county there also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina\nThat's NPR's Greg Allen secretary of state Mike Pompeo says Washington will wait for the result of investigations into the disappearance and alleged murder of a Saudi dissident journalist who resides in the U.S and parents Peter Kenyon reports from pay ... says if it's proven that Saudi Arabia was involved and Jamal ... death such an act would be indefensible\nPompeo met with President Richard ... and they just goes to probe of what happened to ... after he entered the Saudi consulate in Istanbul Pompeo told reporters on his plane that he's not going to get ahead of the investigations but rejected the notion that the\nThat's NPR's Greg Allen secretary of state Mike Pompeo says Washington will wait for the result of investigations into the disappearance and alleged murder of a Saudi dissident journalist who resides in the U.S NPR's Peter Kenyon reports from pay ... says if it's proven that Saudi Arabia was involved in Jamal ... death such an act would be indefensible\nPompeo met with President Richard ... and they just goes to probe of what happened to ... after he entered the Saudi conflict and it's been bull\nPompeo told reporters on his plane that he's not going to get ahead of the investigations but rejected the notion that the U.S might condoned the kidnapping are killing of a journalist\nI'm not going to speculate are obviously if someone gave you the activities of the boys\nNo no one is going to defend\nActivity of\nDerision Saudi investigators entered the Saudi consul general's residence today to conduct a search Peter Kenyon NPR News ...\nGerman Chancellor ... America was expressing cautious optimism about the fate of Brexit we have more from as we Nicholson\nSeeking independence Todd before heading to the e some is in Brussels under the microbes that she regret the United kingdom decision to leave the European Union and that Britain had shaped Europe in many ways they last for decades\nEven swimming at a time in all not them off with\nAn NGO in ... that\nI very much great which will remain a click on TALK of the youth wants to left shutting concerned about the Irish border medical said the most difficult to see how often next to the end of the negotiation sickening she sees a good chance ... solution\n... Britain must recognize that made the difference between being a member of the European Union and not being a member for NPR News I'm Esme Nicholson invited\nUs thoughts are lower was down down fifty four points at twenty five thousand seven hundred forty four this is NPR\n\nTo Roman Catholic bishops from China or inviting Pope Francis to visit their country NPR's Rob Schmitz reports for the first time Beijing allow the to the ships to attend to Vatican meeting\nPeople visit to communist China would be an historic events unsinkable years ago which was the Vatican signed a deal with Beijing and September is now possible\nChinese bishops ... died and you know shouting of attended the first two weeks or a meeting of bishops around the world\nSeeing the pope on a daily basis they're present a sign of a far between the Holy See in Beijing falling and agreements September twenty second which gave the Vatican along so I say in the choice of bishops and try to one of the bishops quo as close ties to China's government\nHe was ordained by the state sanctioned church was excommunicated by the Vatican that is until Beijing's deal with the Holy See when the pope recognize legitimacy go said he didn't do end up all my visit China but said he was praying for it Rob Schmitz NPR News Shanghai\nThe national marketplace for candidates is officially open in Canada at least one hundred eleven pot shops were expected to open their doors today more heavy yet to follow in certain areas we went on sale at the stroke of midnight Canada is the second country to nationally legalize recreational marijuana why was first\nStill know mega millions lottery winner that raises the jackpot around eight hundred sixty eight million dollars in numbers were three forty five forty nine sixty one sixty nine ... nine lottery player that forty four states Washington DC and the U.S Virgin Islands get another shot the jackpot friday night\nThe odds of hitting all six numbers are near one in three hundred two point five million this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy\nEvery winner that raises the jackpot around eight hundred sixty eight million dollars and numbers were three forty five forty nine sixty one sixty nine ... nine lottery players in forty four states Washington DC and the U.S Virgin Islands get another shot at the jackpot friday night\nThe odds of hitting all six numbers are near one in three hundred two point five million this is NPR\nSupport for NPR terms from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first\nLearn more at Raymond James dot com\nOur three and feeling free on high plains morning thank you so much for staying tune for your morning music program only here on your public radio station high plains public radio\nThanks so much again to everyone who has pledged their support during the fall membership campaign\nI'm Jenny ... live in the studio with Rachel Coleman 'em up sewers County Community college we are enjoying this music together we're enjoying hearing from listeners were loving all of their request that are coming in and uh we're down to our final hour here Rachel we've got to get this\nGoal met five hundred dollar membership match on the table we have got two hundred and fifty left of it we're going to knock it out\nIt's not a hard thing when you think of the vast area that each ... served\nWe've got people who are listening all the way up in Nebraska all the way down to Texas and we've heard from people at both ends of that spectrum this morning so there's no reason for you not to call in to join to log on at H. P. P. R. dot org and give on line if you are at work and you don't want to be calling\nDo it on line it's quick easy and will will be happy to help you\nWhen I think about the wide area that we serve it's just kind of overwhelming because that's a vast territory that was seen as almost a wilderness a couple of hundred years ago and now it's tied together through all kinds of things including technology and it's amazing station\nSo we really want to hear from all the corners of the territory if you're out there in eastern Colorado give us a call if you're in Oklahoma call us or we're in Kansas we're right at the center here but we want to hear from all the farther points\nEight hundred six seven eight seven four four four or go to H. P. P. R. dot org and represent for your chunk of the territory I Love thinking of that as we're\nFive state region where they were very very far away from top to bottom I mean no one's going to a concert down in the Texas Panhandle they're listening and bingo in Nebraska\nHowever we're all joined\nBy this community of arts and culture or by hearing all the different under writers that support the programming that care enough to put their money on the line and promote\nThis programming with their businesses support also all of the arts folks that go into H. P. P. R. dot org and click on that event submission and let us know about what's going on we are a really great resource for that we hear from have canyon we hear from\nUh I'm hoping to hear more from Seward county area\nUh and and share these really incredible event people don't know what's going on you know we're all really busy we don't even look up and you don't even think you know what I might want to go to our opening you know what I might want to go to the concert this comedy thing\nUm and we don't hear about it but high plains morning we have three hours every weekday to bring this territory together so let's hear from you if we haven't mentioned your town yet this morning let's hear from you one eight hundred six seven eight seven four four four or go to H. P. P. R.\nYou're about it but high plains morning we have three hours every weekday to bring this territory together so let's hear from you if we haven't mentioned your town yet this morning let's hear from you one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org let's hear from some of the smaller towns are you in Brian's corner\n\n\nDay and\nThey were saying\n\n\n\nYou know\n...\n\nOr the night time zone still in Colorado\nAnd green died like ...\nAnd ... song to me\n\nThat ...\nDon't you tell me what ... do you have to make up Saddam\nOver in just laying there would be\nThinking boy you do not bring her heart is not\nAnd all the way where\nLook or you going to bring\nA pool or like a pretty smart\n\nAnd then ...\n... has been involved Elaine\nWhere Scott ... the land is any\nOr you're going to bring\nGoing on right now\nAnd\nKnow and then following\n... been involved in a place\nWhere the Scottish ball landed him in changing\nFrom the mountains just what you really\n\nAnimal audience guys regions of\nThe time comes up to even out of the day when it goes down the street man\nIs you know taking the easy king\n\nI'm going to bring\n\nH. P. P. R. it's our station it's where you hear stories that matter to have planes communities with the sharp inside you've come to expect support this station at H. P. P. R. dot org\nThanks so much for staying tuned to high plains morning on member supported high plains public radio you are tuning into our phone membership campaign I'm Jenny ...\nLive in the studio with Rachel Coleman who's here visiting with youth so that she could encourage you to support and power public radio across a vast territory on the high plains Rachel how are we doing today good\nI Love coming to the station it reminds me of so many things of reminds me of growing up in South let's Kansas and how when I moved back from Chicago one of the things that\nEmboldened to me to make that change was knowing that there was a public radio station here\nThis was in the late eighties early nineties before the Internet was a real thing and I was from such a small community I knew I was going to be giving up my neighborhood coffee shop in Chicago I was going to be giving up my public television and my Avon guard movies and my art exhibits\nBut I knew that I Would still be connected to the wider world and to what I thought of at the time being twenty it's real culture [noise]\nUh I was going to be connected through H. P. P. R. and that had borne out to be true in the Twenty years since then [noise]\nEight hundred six seven eight seven four four four is the number to call\nTell us what your experiences with your public radio station how is it that you tune in do you remember when it was nothing on the high plains do you remember before ... do you remember before K. A. N. D. with powered\nOr let us know let us know if you've been there throughout different changing times for this public radio station because you know all across the high plains you know there was a time where we didn't have it down to the Texas Panhandle and some citizens thought really really hard um and brought it to everyone down there and it does make a huge different people driving through maybe you're in\nFor is the number to call tell us what your experiences with your public radio station how is it that you tune in do you remember when it was nothing on the high plains do you remember the ... you remember before K. and the with powered\nOr let us know let us know if you've been there throughout different changing times for this public radio station because you know all across the high plains you know there was a time where we didn't have it down in the Texas Panhandle and citizens thought really really hard\nAnd brought it to everyone down there and it does make a huge different people driving through maybe you're in or maybe you're in a truck right now maybe you're going to and from for for pleasure maybe you're just taking a little too little across the high plains pull over\nDo it this is worth this is worth your time and energy to call eight hundred six seven eight seven four four four and just tap in to this community service that we have available at high plains public radio\nAnd Rachel I Love how you describe it as a territory because it is kind of a unique station other stations have their ... their tower and they cover a larger market and you can always just say I were in Denver you can say yeah we're in Wichita\nA but we are different we are a wide wide space we are desperate communities we are small towns we are larger town but we're also joined\nBy high plains public radio eight hundred six seven eight seven four four four is the number you can call right now and become a part of it gets your dollars doubled snag a counter and get in the drawing for the Seward county a ...\nThat's right we've got Seward county spy swag give a wave It's MORNING it's a T shirt a really cool knit cap in a journal\nAnd the model on it and save the world that because we've just introduced an intel in state craft program at Seward County Community college in partnership with K U students can get their ... they can get introduction to the craft and intelligence work and then they can transfer to K. U. and get that bachelor's degree and go on into the wider world and help\nFight against evil and save things and that's really part of what high plains public radio does as well in small ways in individual ways as Jenny mentioned\nAnd also in the wider a scope of the the story of what's going on in our country and our world right now if you call eight hundred six seven eight seven four four four you will be entered into our drawing for the swag but more importantly will be part of the network of\nCommunity that helps keep the station on the air and that's so important we really want to hear from you throughout the entire area that we serve\nEight hundred six seven eight seven four four four to power this service across the entire\nHigh plains public radio region\nWe've got some community calendars a ... events I Want to announce for those of you in the Amarillo area\nJoin the Amarillo museum of art for the thirteenth annual twelve by twelve art exhibition and silent auction it one night only again it's tomorrow night Thursday night exclusive silent auction bringing together gifted artists across the entire panhandle region and you can get a chance to own an original work\nCreated specifically for that event everything has to fit within one square foot\nAnd a or smaller and all the proceeds go to help the educational arts program that Amarillo\nMuseum of art that they put on and this is Thursday six thirty pm to eight thirty pm to get there early get I get your eyes on which one you want and I but silent auction so\nI joined your community members get in a bidding war with someone and make some friends at the am a museum is at twenty two hundred and south Van Buren for more info you can call Aida six three seven one five zero five zero or go to ... dot org\nYeah but get there early get I get your eyes on which one you want and I but silent auction so\nI joined your community members get in a bidding war with someone and make some friends at the am a museum is at twenty two hundred south Van Buren for more info you can call Aida six three seven one five zero five zero or go to ... dot org\n\n...\nOh\nNo no no no no no no we don't even know\nWhat to do the ... ...\n... ... ... ...\n... ...\n... ... okay [noise] [noise]\nOh\nGame\nAnd we never thought of\nAnd\nDown by the time\nShe never even\nNa na\nYou weren't awake before that you are certainly awake now Harry ... than on high plains morning that we've got to get up we gotta get up right now on our support for high plains public radio they'll give us a call at eight hundred six seven eight seven four\nIf you weren't awake before that you are certainly awake now Harry ... on high plains morning that we've got to get up we gotta get up right now on our support for high plains public radio so give us a call at eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nBefore that we had ... we had some requests for an African music that was ... off the fabulous most recent release doing yet to have all those guys still putting out music and at the top we had a\n... released version of diamonds on the soles of our shoes a kind of a reduced lady Smith black my mother presence on that lots of base lots of funky based on that one that was Paul Simon off of Graceland\nThanks so much for tuning into high plains morning this is Jenny ... live in the studio with Rachel Coleman one of our ah one of our loyal listeners who also stepped up to ah help encourage her fellow high plains citizens out there to support public radio during the fall membership campaign\nAnd uh you know we're chipping away at this goal Rachel\nThat's right the ... from Canadian, Texas called in and supported us and we would like you to join them\nUh it's kind of neat the Canadian uh was recently named as a cultural destination and a pan handle jewel ah by the emerald Texas commission on the arts and so that's just completely in line with what we do here at high plains public radio\nEncouraging in acknowledging the little ... that are scattered across this entire region\nWe just need to hear from three more of you this morning if you call in one eight hundred six seven eight seven four four four there's still time for you to get in on the give away for the spy swag a special packages from Seward County Community college that I brought with me today\nAnd if you pledge five dollars a month you will automatically received a calendar with the beautiful photography of\nThe high plains and this is really an art quality calendar that you would normally shell out money for in a bookstore but it is right here at home and it's given to you for uh being part of this community so call us at one eight hundred six seven eight seven four four four\nWe'd like to hear from three more people this morning before the twelve o'clock hour and that will help us ... five hundred dollar challenge\nAnd so your money will be doubled when you call and we really are waiting to hear from you got people in the studio ready to answer your phone call you can also log on to a H. P. P. R. dot org and give on line\nEight hundred six seven eight seven four four four thank you so much to every one who has called in so far thanks so much the casualties\nAnd of course that cultural designation for Canadian we were also thrilled to hear about that I mean we already knew that place was a cultural head of cultural district but now it's official so that's so exciting all across the Texas Panhandle we've got these strange little towns that have so much culture in them\nUh you know for instance pampered got the Woody Guthrie center all these cool things going on all across the region and here on high plains morning it's kind of a launch pad it's kind of little spy notebook\nFor how you can keep up with some of those things with the community calendar not to mention a it's kind of part of my passion is to keep live performance going across the high plains we're always trying to partner with different communities bring concerts and um but we need listeners support in order to keep that stuff going\nFolks drive through our region all the time and isn't it great to be able to have high plains public radio be a source of a a ...\nEnter all these cool things going on all across the region and here on high plains morning it's kind of the launch pad it's kind of little spy notebook\nFor how you can keep up with some of those things with the community calendar not to mention a it's kind of part of my passion is to keep live performance going across the high plains we're always trying to partner with different communities bring concerts and um but we need listeners support in order to keep that stuff go and\nFolks drive through our region all the time and isn't it great to be able to have high plains public radio be a source of a a mouthpiece for people to hear about those concerts and know that they're going on so they can go connect with other folks who love music love art loved learning love history on the high plains stand up for that education that you receive\nA from high plains public radio stand up for cultural a district designations all this beautiful stuff we have across the panhandle\nAnd uh and all across the region indeed one eight hundred six seven eight seven four four four we got to get to a hundred and fifty more dollars to meet this grant we've got less than Fifteen minutes left in the show we are going to do that drawing in just ten minutes so give us a call now don't delay we want to get your name in the hat\nPun intended because it has to involve you get half a T shirt and a little notebook such cool stuff to give away for the holidays and if you do that sixty dollar ... a month sixty dollar a year five dollar a month level you also snagged a calendar not to mention getting that sixty dollars doubled to a hundred and twenty\nFour your public radio station thanks to a friend and Tribune, Kansas with stand up for public radio right now one eight hundred six seven eight seven four four four we need to callers on the line right now one eight hundred six seven eight seven four four four to keep the power of public radio going across the high plains\nAnd I you know what we've got we've got more music coming up Rachel\nThat's great we would have plans for well I read a cooler tried the new album out called safe and the arms of time we just got it and uh you know we always heard her singing singing with Leon Russell on mad men's a mad dog than Englishman so let's hear how she's going right now\nThis is the kind of a classic singer songwriter that you hear on high plains morning and nowhere else on your dial\nRest assured no one's playing the new read a Coolidge except for your public radio station one eight hundred six seven eight seven four for for the name of the song is we are blood because we are we're all a family here on high plains public radio but that number one more time Rachel\nOne eight hundred six seven eight seven four four four thank you ma'am here to read a cool edge on high plains morning get involved at eight hundred six seven eight seven four four four\n\n\n\nWe really are and\n\nWe are we are the women\nWe are and\n[noise]\n\n\nAre going to be I\n... we uh\nYou", "year": "2018", "show_name": "High Plains Morning", "city": "Dalhart", "day": "17"}