{"month": "10", "state": "TX", "station": "KTDH", "content": "Not only press visits the mountain stage this week along with Jill so viewers\nHi this is Natalie ... joined me than speaking live performance on mountains\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter up high plains public radio visit H. P. P. R. dot org and look under the support him for details\n[noise]\n\nIsn't that folk to friday we are going to celebrate on high plains morning coming up next on member supported high plains public radio\nI have got quite a mix for us we are being so inspired by all of the phone calls all of the support we receive so far in the fall membership campaign this is our final day of the on air portion that will come at me boroughs and this is we're going to have a great time today\nOne eight hundred six seven eight seven four four Ford the number to call weaponry Charles I got them gearing Nicholson in their town Van Zandt Lee Harvey osmund Dr John and I got to hear from Joe Cocker what do you need to hear they do and I think going next [noise]\n\nLive from NPR News in Washington I'm core of a Coleman President Trump said it certainly looks like missing Saudi Arabian journalist ... is dead Turkish officials claim they have recordings that proved could show was killed\nCertainly looks like missing Saudi Arabian journalist Jamal could show gene is dead Turkish officials have claim they have recordings that proved ... was killed in Saudi consulate an instant bull a charge that Saudi deny Trump says if Saudi Arabia is to blame the response will be quote very severe\nAfter talking about ... Trump attended a rally in Montana last night and praised a Montana Congress men who attacked a reporter last year NPR's Don Gonyea reports the issue involved congressman Greg gene four day\nJune fourteenth was elected in a special election in twenty Seventeen that's when he assaulted a reporter from the guardian newspaper he pleaded guilty to a misdemeanor assault last night the president ... visited that attack calling Jean forte quote my kind of guy\nYour body [noise] president recalled first hearing of the assault terrible elections and I said well wait a minute\nI Know Montana pretty well I think it might help him today campaigned\nIn Arizona which has a close US Senate race Don Gonyea NPR News Missoula, Montana\nMore than a week after hurricane Michael slammed the Florida Panhandle cities and towns are facing the daunting task of trying to rebuild NPR's Debbie Elliott reports on the clean up in Port saint Joe a coastal Florida town a leash a smiley\nAnd her brother are clearing out the apartment she shares with her disabled grandmother ... [noise]\n\n[noise] the\nApartment was inundated by storm surge and now most of their belongings are piled on the curb\nDevastating um it is depressing um\nYou know I Try not to think about it too far but it's been a lot of people coming in and helping all we can do with appreciate any and everybody that comes in our bank you is\nNot good enough power is slowly coming back but down trees and debris line just about every street in town Debbie Elliott NPR News port saint Joe Florida\nElection officials in Afghanistan are delaying upcoming parliamentary elections in a southern province and here's the ... reports from its ... followed yesterday's assassinations of the powerful police chief of Kandahar\nThe police chief with assassinated by his buddy got in a brazen Taliban attack\nIn a ... during a high level meeting in Kandahar to discuss security plans for parliamentary elections expected the Saturday now voting will be delayed in Kandahar by one week it throws even more uncertainty around the elections which have already been ... by deadly militant attacks and controversy NPR\nVia deemed on Wall street the Dow is up two hundred ten point the NASDAQ heats up well over one percent at Seventy five hundred Seventy five this is NPR\nAnd the navy says one of its helicopters crashed on the flight deck of an aircraft carrier off Japan the accident was on the USS Ronald Reagan the navy said there are some injuries but none are life threatening and serve it says the cause of the crash is being investigated\nIn major league baseball in the Boston Red Sox are going back to the world series last night in Houston the red Sox beat the Astros four to one to clinch the American league pennant NPR's Tovia Smith says Boston wrapped up the ale championship series with a pair of home runs button\nTook an early lead with a home run to left field than cemented it in the six when Raphael Denver snacked a three run Homer\nThat socks defense was equally strong and look for a moment like a replay of Wednesday nights controversial call when right fielder movie that slipped up to catch a fly ball headed over the wall and the field I'm called thin interest\nReplay of Wednesday nights controversial call when right fielder movie bet slipped up to catch a fly ball headed over the wall and the field I'm called fan interference\nThis time than steered clear and vets sort up and made the catch starting pitcher David Price called it special but not enough and vowed for more wind to take the two thousand Eighteen titled the Sox will battle either the Milwaukee Brewers or the Los Angeles Dodgers Tovia Smith NPR News Boston\nThe Dodgers and brewers square off tonight in Milwaukee and game six of the national league championship series Los Angeles leads a series three games to to\nThe national weather service says flash flooding persists in central Texas rivers are overflowing and officials are releasing water from food dams along the Colorado River it's going downstream toward saturated areas\nI'm ... NPR News\nSupport for NPR comes from the three audio the polling enterprise digital transformation with artificial intelligence predictive analytics and I owe to solutions learn more at sea three I O T dot AI and the ... foundation at ... dot org\n\nHappy Friday the high plains morning on member supported high plains public radio I Hope everyone feeling fantastic\n... live in the studio with you I've got three hour the fabulous music we're going to get through a lot today I don't know about you but I Need some music that's led me into a weekend so it's going to be great or we always love hearing requests during our fall membership campaign so let us know if you have any\nMandatory songs that you need in your ear holes I'll definitely see if we have them I Do have one requests from John a from a Garden City I'll see if I have that in their otherwise I've got some great stuff on deck we've got some secret sisters from Ray Charles and Don Bryant and some of the day and I like sing and some of the other hand\nThanks so much for tuning into high plains morning thanks so much for tuning into high plains public radio\nOr we've got a lot of cool things going on today we're going to give away tickets to boo at the zoo in Garden City Kansas if you love Halloween like I Do and you got specially if you got some little one who's going to be for you will do that later on in the program we've also got some uh an interview with Rob ... he's having a heart opening tonight\nAt chalice Abby but man this is all about the music today on our final on air portion of the fall membership campaign\nCurrent time is nine o seven and changed central time let's take a look at our weather across the high plains for friday October twelfth nope that's not right is that right no it's the nineteenth folks You're welcome\nSunshine rains Supreme across our entire majestic land high plains we have such a lovely ... day today so please go outside and celebrate go get some lunch somewhere else highs are going to be in the sixties and seventies everywhere lives in the thirties and forties\nNorth West Kansas northeast Colorado sunny skies hide sixty eight clear tonight lived thirty six Sunday with the highest sixty four on Saturday in the evening clear lowest thirty nine and sunny on Sunday high of sixty nine mostly clear in the evening lower forty one\nNorth central Kansas mostly sunny was a high above Seventy two mostly clear tonight lower forty degrees sunny on Saturday hired sixty four Saturday Night clear lower thirty nine and ... on Sunday as well I was going to be sixty seven mostly clear in the evening lower forty three\nPartly sunny skies in southeast Colorado today gradually getting very sunny ... going to be Seventy three clear tonight live thirty three Sunday on Saturday as well have sixty nine clear in the evening low of thirty seven and sunny on Sunday high it's going to be Seventy one mostly clear in the evening load of thirty eight\nSouthwest Kansas lovely day for you as well sunny skies high seventies\nSunday high is going to be Seventy one mostly clear in the evening load of thirty eight\nSouthwest Kansas lovely day for you as well sunny skies high Seventy three clear in the evening lower forty that's not bad sunny on Saturday high of sixty seven clear at night lower forty and more sunshine on Sunday hide sixty seven clear in the evening low a forty four\nAnd finally our Oklahoma and Texas Panhandle today mostly cloudy but it will get Sonny later on I was getting up to Seventy clear tonight low forty two\nIs going to be a little colder tomorrow funny it with a high of sixty four mostly clear Saturday Night live thirty nine and Sunday a slight chance of showers otherwise mostly sunny hives sixty partly cloudy and the evening it's a low of forty four\nFor example uh well\nLooked at a time\nDownload their little things I Do know that\nOh [noise]\n\n[laughter] [noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n\nYou again today [noise]\n\n\n\n\nNo\n[noise]\nNo no\nWay you\n\n[noise]\n[noise]\n\nDon't treat them but you\n\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n...\nNew York when they turn to love this for um [noise] I don't think the main then much to you and they will or\nThat maybe you know\nOn the\nAnd I you know\nAnd I you know whose liberal but\n... and it seems like do you think about those who\nDidn't ... you\nKnow\nKnow that that is Jane\nNo I\nNew store where\nWe\nLive\nTo\nCorrect\nThey did do\nBe I'll be made and an globally up the\n\n[noise] yeah well yeah you don't need it and the and\nThe bugs that you know no longer\nCan you let the young man and he\nHe but no no no no I mean\nYou know during you know you got\nA new young men were killed that day\nOh you've got\nYour bed so that they see you\nKnow I Know how\nTo tell me how are you\nKnow I'm\nSure the young man and\nHe pretty\nWell do\nYou go into Oh thank you\nWell know your\nJob and they were\nA job\nThat Tom Kalil no no no no no no no no no no you\nKnow the pay per day but I don't have a\nPin it down to\nThat so\n\nNo no no no no no no no no no no no no\nI\nDon't I don't\nTo your best\nBet\nThat showed\n\n\nThen they kept\nDoesn't plan to do that\nIn the\nNo no\nNo no\nBetter\nThat I don't\nBad habit of it\nI don't have the pin\nDon't know tell no no no no no I don't know that it's not it's\n\nOh no\nNo ... channel a\nUm you know Tom\nNa na na na\nHey hey ho\nHo\nYou know he was\nHit and then I'm gonna\nTell mom I\nI'm not really no no I'm I\n\nReally do you know a very good um it's\n\nA\nYou know I'm On\nThe phone was\nNo no the reason that\nThat you really is\nA guy\n\nIn any time in\nWay\nThat he you\nKnow no\nNo no no we're them oh my\nKnow ha ha well she\nSee that you know the\nNa na\nSix seven eight seven four four four start this weekend strong started with something you can be super proud of that you supported a service that you use that you appreciate one eight hundred six seven eight seven four four\nFour do it for the music do it for high plains morning all the different artists that we play on the show and while you're at it give me a request it is friday folks worth celebrating\nOne eight hundred six seven eight seven four four four or go to H. P. P. R.\nDot org let's hear from Gaiman let's hear from beaver\nWhere my Oklahoma panhandler one eight hundred six seven eight seven four for for just ten seconds left before\nNews from the Texas Panhandle I'm going to hear from Colorado as well and hey Nebraska stay tuned news is up next we'll be right back\nH. P. P. R. connect is radio for the curious\nFor people who want to know more about the wider world people who want to know about how things work why things happen and what's really behind the changes going on all around us we offer the best and informative enlightening and inspiring public radio programming to satisfy your curiosity visit us\nAround us we offer the best and informative enlightening and inspiring public radio programming to satisfy your curiosity visit S. H. P. P. R. dot org to find out more about the services offered on high plains public radio and H. P. P. R. can act\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream then please thank and patronize the community sponsors you hear mentioned on the air who helped cover their direct cost of operation thank you\nLive from NPR News in Washington I'm more of a coalmine officials in Florida have reported new talent aides in the wake of hurricane Michael that is increase the storms death toll to at least thirty people across four states\nDamage assessment continues Florida governor Rick Scott is asking President Trump to boots recovery efforts at tend to air force base and Verizon people along reports the hurricane wrecked airplane hangar and flooded buildings\nMore than twenty thousand Florida resident worked at ... air force base last year according to the state's governor Rick Scott\nThe baby is a major economic driver in the region and it was home to a multibillion dollar effort to stealth fighter jets somewhere damaged by the storm in his letter to President Trump Florida's governor after president to quote direct immediate action to dedicate the needed resources manpower and funding to return indoor air force me to full operations as soon as possible\nDemocratic Senator Bill Nelson has been playing down fears that tend to will not be rebuilt\nAfter Hurricane Andrew destroyed ... homes that air force base in Nineteen Ninety to that base was shut down on you belong and journey bay county Florida\nA new NPR poll on life in rural America shows many people in small towns feel they're doing better than their parents and have a positive outlook on their economic future NPR's Kirk Siegler reports the counters stereotypes often portrayed by politicians and mass\nMedia the NPR poll was done in conjunction with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nMany surveyed said their hometowns did face serious economic challenges but there's also optimism Rob Clements lives in rural delta County Colorado one struggling natural resource based county that seen an influx of new people and jobs largely thanks to technology\nIs fun to see you see people out on the streets with a smile on their face and you know I'm not worried about where their next paycheck is going to\nCome from climate daughter was recently able to move back to her home town to take a job with a local company installing broadband Kirk Siegler NPR News\nElection officials in Afghanistan have delayed parliamentary elections in the southern province of Kandahar\nElections in the rest of the country will proceed tomorrow Pamela constable covers Afghanistan for the Washington Post she told NPR's MORNING EDITION the election to lay in Kandahar followed a deadly Taliban attack yesterday on top of provincial officials\nObviously that ... that are taken on murder [laughter]\nCalm things down a con artist very large product which is ... it's going to have a college or pay a credit for governor I had a great word it got a kid to carry that people are very nervous and worried so I think that's obviously a measure designed for short term relief that\nWashington Post reporter Pamela constable on Wall street the Dow Jones industrial gr up one hundred and Ninety five points at twenty five thousand five hundred Seventy one the NASDAQ that nearly Seventy five Seventy five hundred fifty nine\nThis is NPR the national weather service is predicting a warmer\nThe nearly Seventy five Seventy five hundred and fifty nine\nThis is NPR\nThe national weather service is predicting a warmer than normal winter for the northern and western parts of the United states that includes Alaska and Hawaii weather service official said there are no parts of the U.S that are expected to be colder than normal\nHowever that serve it says it's possible there could be wetter conditions this winter across the mid Atlantic and the south\nIt's expected to be drier than usual in the Northern Rockies the northern plains and around the great lakes\nPresident Trump's former campaign chairman Paul Manafort is heading to court today and here's Carrie Johnson reports the judge wants to move ahead with the process of sentencing Manafort\nJudge TS Eliot says he wants to clear up what will happen with ten criminal charges on which a Virginian jury deadlocked this year prosecutors say they'd prefer to leave the usual known until after Paul Manafort finishes cooperating with their investigation\nBut they say they will not object if the judge wants to dismiss that counts so long as they reserve the right to file them again\nA jury convicted Manafort filing folk tax returns failing to file reports of foreign bank accounts and bank fraud Manafort had asked to wear a suit to court but the judge denied that request reasoning that Manafort should be treated like any other defendant who's been convicted of a crime and remains in federal custody\nCarrie Johnson NPR News Washington\nThe Boston Red Sox are going to the world series they defeated the defending champion Houston Astros last night for the one to win the American league championship they'll play either the Los Angeles Dodgers or the Milwaukee\nBrewers I'm corporate Coleman NPR News\nSupport for NPR comes from NPR's missions other contributors include a log me in makers of go to meeting a collaboration meeting plot for allowing people to connect around the globe to get work done learn more and go to meeting dot com and the listeners who support this NPR station\n\nBack to high plains morning on numbers supported high plains public radio where an hour or two of our\nFriday friday music sat this is Jenny ... live in the studio thanks so much for being here with us during our fault membership campaign\nThis is the final day of our on air portion and it is a great chance for you to finally\nEnd this week strong for support for public radio you can call one eight hundred six seven eight seven four four four to support what you hear on the dial across the high plains wide vast territory we have so many different listeners out there\nSuch a community of folks out there and you can be a part of that community all it takes that phone call at eight hundred six seven eight seven four four four we got some cool things going on this hour\nOh we've got some ... at the zoo if you're in the Garden City area we got some tickets were going to do a drawing for at the end of this hour so hey folks also today's the last day you can even buy tickets but hey we got for here we got for that you're going to\nHave the chance to win when you put in your pledge of support what eight hundred six seven eight seven four four four you can also do it on line at H. P. P. R. dot org if that's easier for you but do it soon so we have a chance to go out there and check that stuff\nAnd you know what you don't have to make that contribution when you want to get on the drawing but we certainly hope that you will for your public radio station one eight hundred six seven eight seven four four four I hey got a phone call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nThis is Jenny ... I'm going to live in the studio with Shonda Collins she is the\nNice silky voice of our underwriting but first I Want to tell you about the weather and ah and then we'll then we will talk to Shonda one eight\nNice silky voice of our underwriting but first I Want to tell you about the weather and ah and then we'll then we will talk to Shonda one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org I'm to write a song about that phone number\nSupport your public radio station and this week strong start your weekend with something\nThat will make hearts big and beautiful and uh also shine down public radio across the high plains speaking of shy and we've got so much sun folks it's almost like they're gonna trick us I'm looking around for the catch friday October Nineteen twenty Eighteen sunshine is raining Supreme across our majestic line that's rain with the G\nHigh plains we have such a lovely day to day please go outside and celebrate hides are going to be in the sixties and seventies lower than the thirties and forties\nNorth West Kansas northeast Colorado funniest guy type sixty eight clear tonight little thirty six sunny on Saturday Hi I'm sixty four Saturday Night clear with the low thirty nine and sunny on Sunday high in sixty nine Sunday night mostly clear low forty one\nNorth central Kansas looking good as well mostly sunny hide Seventy two mostly clear tonight low forty degrees Saturday So these guys have sixty four clear in the evening lower thirty nine and sunny on Sunday high and sixty seven mostly clear in the nighttime I never say nighttime low forty three\nSoutheast Colorado partly sunny gradually getting very sunny high Seventy three tonight clear low around thirty three Saturday Sunday with ... sixty nine Saturday Night clear skies love thirty seven and very warm on Sunday Sunday with the highest Seventy one Sunday night mostly clear low thirty eight\nOh\nA\n\n\n\nIn\n\nNa na\nNa na na na na na na na na na na na\n[laughter] any\nAround ...\n\n\nBut I can go\nThe east or even\nMad if need\nNow and there was\nBack and try\nBand Jamie am a\nMan a man\nA pretty good I can\nAn hour and\nMine are saying\nMan I ran a van like right now I'm\nI got a\nBright blue collar ...\nO\nZ in the ... ... ...\n... ... ... ...\nIn your ...\nThe swimming around ... dress and\nAre you there were ... were they\n... didn't move your\nWay the\nWay you never know a ... you know\nThe [noise]\n... you were in the shadows drone who we\nDon't know but I can hear new\nWindows or where to\nNo you don't have to do\nBarron Barron regard to man the\nMan the barrel need rain ain't got married and um [noise]\nWell I can see maybe you can win for\nThe New Year's eve\nIs bad ... you write\nDon't you don't have\nThey are in a year\nAfter that big of a well in\nA way that whereas we though was\nThan the man we\nAnd they make that pledge and support right now at the sixty dollar level you can get that gorgeous counter and it is really spectacular and it's also a testament to coming together on the high plains just like what the station does this calendar has submissions of artists all across our entire vast listening region and they are on real\nI mean there's this one with the big purple crazy storm one of those mothership looking storm clouds you've got the sun set behind a silo you have this evening after a storm\nReflection of like six different colored in a puddle on a field you can't believe I mean heaven on earth across the high plains what better way to celebrate it plus the holidays are coming up drop down sixty bucks you can get some calendar for your loved ones you can do a gift membership\nAnd right now one eight hundred six seven eight seven four four four if you're in the Garden City area you also get entered into the drawing for the for ... tickets\nI'm such a fun events such a great way you know Lee Richardson made sure that there was no admission and made sure it was free access to everyone\nJust like public radio you turn on your dial it they're waiting for you but it's only there because other folks have power to they've called one eight hundred six seven eight seven four four four and made sure that it was we had this access you\nKnow one of the pictures I Love and the calendar is the great horned owl sitting in the eyes see Laden branches and it's titled eyes and if you could see this outs face you can see him looking a little eyes it is a great photograph\nWe also want to make a shutout to Claudia from Amarillo, Texas who says I Love Ninety four nine connect\nAnd listen to every morning while she tries to W T AMU it starts her morning we appreciate that give us a call we do love to hear from you at one eight hundred six seven eight seven four four four we are members supported\nAppreciate that give us a call we do love to hear from you at one eight hundred six seven eight seven four four four we are members supported and mission driven\nOne eight hundred six seven eight seven four four four let's hear from all of the folks across the high plains who have dedicated their life to a complete\nYou know service to the land therapy to supporting one another to taking care of your neighbor we're not going anywhere folks that only because of you your call one eight hundred six seven eight seven four four for\nJohn you're the beach boys for you to be true to your school folk where our cheerleaders give us a call ... eight hundred six seven eight seven four four four\nWheeling loud right you're right down in there there's a movie and re I Do right away no matter buddy of\nYou know I Can't tell by the\n\n[noise]\n\n\n\n\nI got to be like oh the\nLower than they did was\nAll I Do do\nDo you know\nDon't know you know she'll do me he got\nThat kind of love and they're going\nBe in a hurry\nDid they get\nI have not\nAble to get a\nLittle well\nKnow I'm a well when\nWell well yeah\nDo yeah\nThe keyboard\nAnd now that the is the only\nI got to be like all the\nAll I Do like than guys\nDo you know\n\nDo you think they were\nThink\n...\n... on\nMy\nWay knees you\nTo\nWhen\n\n...\nGreen Zone name new\nThe new star\nYou know they when they do you live\nI Am sure\nBreathe round the\nAnd then the nine or they were in\nWe we're gone\nMan they're smiling\n... ...\n...\n[noise]\nNew the new\nFree [noise]\nTerm but there are\nYou\nNear where\n\nOver the years and more\nWe read e bay\n[noise] all\nOr ... or\nWhere the baggage in your\n...\n\nCity said that they emailed Valerie this morning and would appreciate a calendar sent to their home thank you and keep up the great work\nPublic radio here yourself think I Love that give us a call one eight hundred six seven eight seven four four four don't miss out on your opportunity for your name to be drawn poor booth at the zoo which is this Saturday from four to eight PM at Lee Richardson do\nAll right but we've got twenty seconds left trying to get those tickets together a lot to do that yeah that's what we got an who's got it okay I'm going to pull one out of the hat\nIt is Ginny trace Jenny is from\nWhere is Jenny from I don't know it must be ... Garden City I guess okay are regularly and then yeah\nBe sure to come by the studio at and we will see you when you come by\nMe because we\nNeeded\nNot only press visitors the mountain states this week along with fuel Silvio\nHi this is Natalie ... joined me this week in live performance on mountains [noise]\n\n[noise] this is Ninety One point five ... eighty nine point three ... service of high plains public radio available everywhere at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial supportive community sponsors you'd hear mentioned on the air please funding occasion to thank them for their support\nLife from NPR News in Washington ... sang Turkish state media report prosecutors are questioning employees of the Saudi consulate in connection with the disappearance of a journalist NPR's Peter Kenyon reports ... G was last seen entering the consulate October second\nTurkish media couch say more than a dozen employees of the Saudi consulate were being questioned in relation to ... disappearance Turkish investigators have said they have audio and other evidence showed you was killed in the consulate in his body dismembered\nThe latest leaks from Turkish authorities said investigators searched a forested area in northeast stumble because the Saudi diplomatic vehicle was tracked heading to the forest the day 'cause she'll do disappeared\nTurkey's foreign minister mobile job a shoulder today that he read news accounts that President Trump had requested Turkey's audio evidence but he said it has not been shared Peter Kenyon NPR News is done\nWith the Trump Administration facing more backlash over its tempered response so far to the Washington Post columnist suspected murder\nThe president is Alta drawing condemnation for apparently condoning the behavior of the Montana congressman who was charged with assaulting reporter last year at a campaign rally last night for Republican Greg gene forte people laugh when Trump brought up the attack\n'cause I had heard that he body slams a reporter [noise]\nAnd it was the way up [noise]\nI think it was way up and I said oh this was like\nOh the election or just before\nAnd I said oh this is terrible he's going to lose the elections and I said well wait a minute\nI Know Montana pretty well I think it might help him\nJean forte is up for re election in November the top us commander in Afghanistan says he was not the target of a Taliban attack in southern Afghanistan yesterday that killed two senior security official Jennifer glass reports from Kabul that a Taliban infiltrators opened fire in the Kandahar governor's compound\nThe Taliban said us and NATO general Scott Miller within me\nJennifer glass reports from Kabul that a Taliban infiltrators open fire in the Kandahar governor's compound\nThe Taliban said us and NATO general Scott Miller within being targeted the attack along with Afghan provincial police commander of the ... who was killed Miller says well it may have been a closed confined space he believes the attack was on Afghan security forces that he was not the target\nThe killing of ... and the provincial head of intelligence has left a security vacuum in Afghanistan and south the country's election commission has postponed parliamentary elections in Kandahar for a week the rest of the country will vote Saturday\nElection related violence has already killed or injured more than two hundred and Seventy people and both the Taliban and Islamic state that they will do what they can to disrupt the election for NPR News I'm Jennifer glass in Kabul thousands of\nCentral Americans are still making their way to the U.S border despite President Trump's threat to order the military to seal off access to the U.S lined with Mexico a caravan of people it's gaping violence or poverty mats and a Guatemalan border town today in preparation for their crossing into Mexico you're listening to\nNPR News [noise] early voting expected to begin and ate Florida counties Monday and extend through election\nDay November sex from member station WFSU Lynn how to report the move adds a few extra dates for voters to get to the polls in Florida counties that were hit by hurricane Michael\nJackson County supervisor of elections office has no electricity the bay county supervisor of elections office has no roof\nAnd the usual precinct voters may be accustomed to have likely been damaged in Tallahassee Leon county deputy elections supervisor ... says governor Rick Scott the executive order gives impacted counties greater flexibility by keeping a handful of early voting sites in each county open longer\nIs counting probably five so they're just going to run all the way through\nElections supervisors in the panhandle are grappling with this place to voters infrastructure damage and spotty power and communications for NPR News I'm Lynn had\nHer in Tallahassee the European Union's top court is ruling the polling much immediately suspend its measures lowering the retirement age for polish Supreme Court judge judges the European Court of justice altered states at polling needs to reinstate those judges who have already been forced out because they were at least sixty five years old\nPollin says it will review the court's ruling and decide how to respond turbulence is blamed for minor injuries aboard an urgent China Airlines fly from Miami to win aside as yesterday I ... in the ... is Fifteen people were hurt when flights there too you know three hit rough\nConditions I'm Lakshmi Singh NPR News\nSupport for NPR comes from NPR stations or their contributors includes the three audio T providing a software platform that enabled organizations to deploy artificial intelligence predicted analytics an audio to solutions an industrial scale learn more of the three I O T dot a our\n\nMy own me we are in our three this as high plains morning it is friday this is Jenny ... live in the studio and we're having a blast here I got more great music I've also got a ... in Studio interview with Rob wind Gert\nI met with him before I headed up the Kansas but hey just pretend to seriously sitting right there talking to me because it's going to feel like that\nThis is this is our third our folks of our final day of the on air portion of the fall\nMembership campaign we need to raise a total of eighty five thousand for the entire month of October to stay on track to not have to cut programming and keep everything solid everything or you know and love on high plains public radio moving smoothly end of the ...\nTobar to stay on track to not have to cut programming and keep everything solid everything or you know and love on high plains public radio moving smoothly into the future but it only starts with you one eight hundred six seven eight seven four four four singing with me one eight hundred six seven eight seven four four four\nI Know you were I felt it hey at the number to call eight hundred six seven eight seven four four four we're going to have a Rob interview we've got some other music coming up we got from Terry Allen\nI got some a band the band I've got some ... Dr John but go ahead and get it on this now support the music programming you hear on high plains public radio\nSupport for this show is provided by friends of aliens Skinner opens ten twenty four presenting Carol Williams concert organist on Sunday October twenty first at seven thirty PM more at FA SO Amarillo dot org [noise]\nAlthough we're going to look at our weather for friday October Nineteen twenty Eighteen sunshine is raining Supreme across the majestic land we call high plains public radio ville and it's going to be high in the sixties and seventies lives in the thirties and forties folks get outside it is summers and\nNorth West Kansas northeast Colorado sunny with a hive sixty eight clear tonight low of thirty six Saturday sunny sky tied sixty four clear in the evening with a low of thirty nine sunny on Sunday as Well hi of sixty nine Sunday night mostly clear lower forty one\nNorth central Kansas mostly sunny with a highway Seventy to clear in the evening lower forty sunny on Saturday highway sixty four clear at night last thirty nine more sunshine on Sunday little cooler sixty seven in the high clear in the evening when I was going to be forty three\nPartly sunny and southeast Colorado today also high is going to be Seventy three clear skies tonight live thirty three sunny on Saturday high of sixty nine Saturday Night clear skies lowest thirty seven and Sunday on Sunday high in Seventy one mostly cleared Sunday night low of thirty eight\nSouthwest Kansas sunny hype Seventy three how nice clear tonight lower forty sunny on Saturday hide sixty seven clear in the evening lower forty and sunny on Sunday hired sixty seven in the evening mostly clear lower forty four\nPanhandle of Oklahoma and Texas mostly cloudy today it's going to get gradually sunny in the afternoon ... Seventy clear tonight little forty to\nA bit cooler tomorrow but still sunny high of sixty four clear in the evening lowest thirty nine and Sunday we're seeing a slight chance of showers in the panhandle mostly sunny though hide sixty partly cloudy at night with a low a forty for\nUm and prolific\nYeah yeah pretty prolific I'm I share studio with a guy actually like both teach it W. tea and um it's great to have his energy you know kind of inform what it is that I'm doing um we we birth where we're actually we work incredibly differently from one another um he's a painter and I'm a kind of [noise]\nYou know I don't know I I guess I'm just more of\nA hodgepodge or type I just a noodle or you know I I ... I guess so yeah ... yeah ... yeah I think\nSo I mean certainly but um\nIt's um you know it's good to have him around were always kind of working with one another and we see each other every day and uh yeah it's it's a good relationship but it's also you know it's I think it's good um for the both of us you know to um you know it really informs artistic practice and um\nIt's it's nice to have that you know I've lived other places where my studio experience is much different you know I had to\nMake a certain amount of money in order to afford you know to do certain things and oftentimes I find myself in cramped little studio spaces and I think that's a part of the the panhandle experiences experience as well as you get to really kind of [noise]\nStretch out and and kind of um\nJust the you know I mean I don't know maybe it's a part of it just it's just the landscape I don't know perhaps that informs artistic practice um I mean I don't I don't do anything that I Would say is directly related to the Texas Panhandle but certainly something about the panhandle is\nIt's doing something to the way to work as an artist I'm what that is handling it I I don't know I mean I maybe I I don't know I mean maybe there's something about this the meditative quality of the landscape that perhaps has something there are some somehow like\nComes across in my work but um it it it's hard to say and um and plus you know I've only been producing work here for a little over four years so you know sometimes it's hard to really assess what's going on you know maybe it'll take a few more years to figure out what it is that I'm doing specifically or or rather in terms of how the landscape here actually informs what is that I'm doing well\nTell us about this particular show cannon and few is the name of it um which sounds very musical it it it is\nTruly informs what is that I'm doing well\nTell us about this particular show cannon and few is the name of it um which sounds very musical\nIt it it is um and that I don't [noise]\nYou know I'm interested in music but I wouldn't really consider myself to be like a you know a musical sort of person but I did like the terminology spoke to me because they can and has this kind of [noise]\nUm [noise] it's just a musical term that refers to um [noise] uh what if I can I describe it quickly voices in unison does this make sense I think of and then a few would be a more long drawn out disparate sort of\nYou know what I'm Talking about it and it's about um the components that I'm sitting around in my studio making\nThat are part of the few that really create the candidate you know once these works or or realized and then exhibited altogether becomes to sort of you know this this composition right um this kind of can and if you will\nSo the pieces in the show or do you consider them like each one is an individual kind of movement of this greater things that they work together or where they just this is I'm going to go ahead and focus on this one finish it and see where the next one goes and we'll work them altogether later have had yeah I mean I think the\nLatter but certainly when I'm making the work the intention is that they'll all be a part of a family unit you know to be exhibited um you know in unison 'em and they all share and is that a similar static right I mean they're all basically made out of just\nDebris and detritus and just cast away are you know or failed art works that I've just kind of a repurposed um [noise]\nSo yeah they're like I mean you know I've been making are for you know my whole life and so you certainly see a common thread you know if you're looking at everything altogether [noise] um I mean the work is not objective it's um they're very\nThey're these little objects there just these strange quirky just little object things you know and I just\nPieces in shape yeah there and it had to yeah and there's like there's a certain tactile quality to them there's a certain appearance that you know they they have this a lot of the materials that I used or use their older\nI'm so they have this kind of aged appearance to them I mean it's it's difficult to explain because I'm Still trying to figure out specifically um how that agent is you know really applies to what is it I'm trying to do but but they do kind of have this retro um appearance I hate to use that word but\nYou know just the first word that comes to my mind you know we're in in terms of just describing like the agent is look of these things but um that's not to say they look like these rickety old things that you'd find in like an antique shop 'cause their paper sculptures and they're very clean and they're pretty um\nYou know very much rooted in I hate to say mid century design but that's just I think just an accident I think that's just by virtue of a lot of the materials that I use sort of come from that era so and I hate that term\nTo introduce a well they do what kind of a broken down kind of deconstruct that I'm really elemental and kind of you know basic kind of muted colors yeah a lot of them right absolutely yeah so you mentioned that you like to use materials that have been cast off then tossed out um did you\nKind of come to this when you returned home or have you always been fascinated I Know the you know sustainability is really an important thing to you and your you know when you're dealing with you know not just your work but just in your life sure\nUm you know actually I started working this way maybe around two thousand\nIn your life sure um you know actually I started working this way\nMaybe around two thousand eight or nine I actually I worked at lots of galleries museums um and then I worked at an auction house in New York for a long time and um I\nFirst became aware of the amount of waste that these are you know that these these industries generate and um\nYou know and I just that was just something that was obvious and just I thought huh [noise] um but it didn't really go anywhere but then um when I was living in New York it was harder for me to produce work that I had been making a few years prior you know cost a lot of money so I started you know because the cost of living there is very high and and what I did was kind of reverted back to\nWhere I really started as an artist which was just basically making water colors you know\nYou could crank out a bunch of water colors and the day um it wasn't that expensive although the paint you know got expensive over time it's like once you get better you want to start using nicer quality materials and that just kind of became prohibitively expensive so I just start start START I actually stopped making art for a while and I really got obsessed with 'em\nLong distance running and I don't know how that happened but it's just they're definitely relate I think so yeah so they became that there was this obsession and I did that for a long time and I got you know pretty decent at it and uh but then my body was slowed down from constant an injury so I returned to the studio and I feel like\nA lot of um you could draw a\nWell okay so training for the marathon running a marathon I felt there were a lot of similarities between um you know that and and making art in a studio you know you're alone [noise] you know with your thoughts um rather your thoughts are kind of um reduced to sort of the task at hand you know and I like that um and then it's\nAlways a struggle to continue going forward and not just leaving and getting a peanut butter and\nShare yeah candy but then you you know you get the runner's high and then you know you get a studio high too and things are going really well because it's like you're pretty much\nThe amount of control you have over things well\nI don't know it's like it's just a very reductive sort of practice and I think that's what I like that's the way I sort of compare that to you know running is just\nIt's this thing this process it's very stripped down and elemental when I feel like the um the way that I make art or at least the experience I get out of going to the studio and making urges feels that way to me as well\nYeah you know well I I don't know it makes me think of that uh that Sondheim song from a Sunday in the park with George where it's like putting it together and it's like I said you know just little pieces together you are now this particular um show that you have coming up is this something where you feel like\nDid you get this did you get the high or whether that's a little bit more of a labor of love and you had to kind of like ... out to these things just pour out of you um how long did it take to get this show together [noise]\nUm and how many pieces are in it I\nI haven't decided how many pieces um maybe twenty some ... I've got a bunch set or just\nFull disclosure weren't speaking a little bit before because we're going to be in our pledge drive a and this is going to be happening on the last friday right so you will by the time folks are hearing that you will have decided because they'll be on a wall oh yeah [laughter] I I mean I I kind of working on it yeah yeah\nBut I like to just kind of go into a place um become familiar with it and then figure out you know and show up with a bunch of work and just you know carried the hell out of it you know just sort of figure out what it is you know\nI haven't been to the space in a while so my memory of it is not the greatest so I feel like I just have to go in there [noise] excuse me it's awesome\nI haven't been to the space in a while so my memory of it is not the greatest so I feel like I just have to go in there [noise] excuse me it's awesome yeah and a\nBig open room yeah big big kind of slow there and they got this empty room and then they sometimes even have stuff\nYeah or out yeah so I don't know\nThe last time I was there is actually for a friend's exhibition and he had there were these small works on paper you know not much larger there you know maybe sixteen by twenty and smaller and he had just a ton of them um and I work differently as an artist I don't like to cram when not to say that was crammed with work but I\nLeft to meet this go oh my goodness this is so exciting and I'm looking forward to celebrating and doing my final happy dance for this fall membership campaign during high plains morning this is a wonderful wonderful show it's been a staple it's been a pillar of the service for very long time\nAnd ... who is doing a fine job posting it you know all these shows that have come through and left their\nTheir fingerprints on high plains morning in June and there are loads in the archives [laughter] and Jenny certainly is one of the the staff members that is constantly going above and beyond and such a great team player and it's a delight for me to be able to tune in in the mornings Jenny and have a little bit of a reprieve\nFrom life and enjoy some wonderful fantastic music so thanks for all of that the music do you have enriched my life with and ah I\nLife and enjoy some wonderful fantastic music to thanks for all the music do you have enriched my life with\nAnd uh I Know that there are a lot of listeners that feel that same way and and feel that same sentiment as I Do\nAnd they call because this is an exposure to them high plains public radio keeps them in touch with the world while at home on the high plains whether it's through music program or a news magazine or western swing music or jazz or blues\nFolk Americana there is a little bit for everybody and there's room for you to join the table this morning and supporting these great programs on high plains public radio one eight hundred six seven eight seven four four four can you help your public radio station this morning meet this challenge\nThree hundred and twenty five dollars left you don't have to do all of it if you'd like to uh we would certainly love to hear that\nFrom you and to receive that kind of sound investment from you if you are not able to do the whole three hundred and twenty five\nThen do what you can and then watched that cascade into other calls and to other people who are willing to support at whatever level they can\nWhen you call one eight hundred six seven eight seven four four four you'll be asked just a couple of questions and your name your address your phone number your email if you'd like to stay in contact with it that way we have a great newsletter that goes out weekly thinks to\nAge ... executive director Bob Davis so you can keep informed on what's happening at the radio station but also what's happening in our region because we are regional source\nFor news for entertainment for information and it it's all made possible by your contributions one eight hundred six seven eight seven four four four be the next caller for your public radio station to help H. P. P. R. meet this goal and celebrate a very successful high plains morning\nAnd we've just got Seventeen minutes left of this hour folks but I Believe we can knock this outlet meet this challenge thanks so much to the burn\nFrom palace coffee company three hundred and twenty five dollars before the end of the hour\nI'm gonna give you some pledge of music I promised used them\nBanned in the mud and people from Dr John if we can get to it but we need to hear from you at eight hundred six seven eight seven four four four give us or give us a give us a little nudge tell us how you listen to this music what it is the uh you do in the mornings when high plains morning it's kind of on is it on in the background or you kind of actively\nListening to annoy hey what's this with your pet\nAnd pen I've heard people say and write down who who is this\nAnd they'll go look it up later and they'll add it to their personal you know are kind of music one eight hundred six seven eight seven four four four we are so grateful for everyone who has made those phone calls so far you can be the next one that we think on air but do it now eight hundred six seven eight seven four four for\nUp to three hundred and twenty five dollars left on the match we can do it with your help one eight hundred six seven eight seven four four four and we're gonna hear the band you're rag mama rag on high plains morning\n[noise]\nBe relaxation and she'd been saying\nDo you own the ...\n\n\n\nDa\n\nDa\n\nDa\nDa\nThe\n\n\nOf\nWell mom and I know you're out\nOf being an enclosed", "show_name": "High Plains Morning", "year": "2018", "city": "Dalhart", "day": "19"}