{"month": "10", "state": "TX", "station": "KTDH", "content": "Amazon spot of the problem itself and no longer uses the contraption\nIn New York I'm David Brancaccio with the marketplace morning important\nAmerican public media\n[noise]\nBy there and this has been with Bachmann exec me one hundred years separate box be minor mess and beat them it's nine cents on the ground and achievements of two distinct you're as this week politic spring is a bridge those were almost as we pose the question\nHow do we get from ... debate though is\nThat this week on exporting music [noise]\nWeekdays at noon central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere on line at H. P. P. R. dot org\nThe availability of H. P. D. r.s Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n[noise]\n\nGood morning high plains high plains morning on members' support at high plains public radio\nVirginians are alive in the studio is day one of our fault membership campaign [noise] we've got a great next the music for you to get us in the mood we got some wailing Jenny's\nWe've got some ... puppy love barge that's fun to say early in the morning I get the music from the deadline and I got a couple a times in there to buy any rate and I just got a request\nFor the Jimi Hendrix that's right so high plains warning its\nNeck stay tuned [noise] high plains\nPublic radio [noise]\nFirst supported high plains public radio\n... live in the studio is day one of our fault membership campaign that got a great next music for you to get us in the mood we got some wailing Jenny's\nWe've got some ... puppy love barge that's fun to say early in the morning I get the music from the deadline and I got a couple of times in your body right and I just got a request\nFor the Jimi Hendrix that's right so high plains morning it's\nNext June [noise] tightly\nPublic radio [noise]\n\n\nLive from NPR News in Washington on corporate Coleman hurricane Michael was a little more than fifty miles off the Florida Panhandle with top sustained winds of one hundred forty five miles per hour it's a category ... storm very close to a category five\nSome parts of the Florida Panhandle and Big Bend region could seat storm surge between nine and fourteen feet\nEnough to swallow some homes Florida governor Rick Scott is urging people who've been told to evacuate to leave now\nListen to local officials you do not want to be the person who survived the storm just to put your life or your family's life at risk after passes because you didn't listen to local officials\nDuring the storm first responders cannot come out and said you it's too dangerous now is it time to prioritize to keep your family's faith do not take chances\nThat storm is expected to crash into Florida in a few hours then rocket north through Georgia the Carolinas before ... into the Atlantic ocean\nMeanwhile Georgia's governor is issued an emergency declaration for hurricane Michael from member station W. A. B. E. and Atlanta ties name Shona reports that state is bracing for the storm this week\nState of emergency is now in effect for Ninety two counties in Georgia and head of hurricane Michael governor Nathan Deal says the state's watching the path of this storm closely\nIt appears that those southern county is all the one's going to be most likely impacted and we will put in place all of the provisions related to an emergency declaration we just hope that it is not too severe and that it does not last too terribly long\nThe emergency declaration is in effect for seven days already Atlanta's Hartsfield Jackson international airport has canceled forty five flights today for NPR News I'm named ... in Atlanta\nThe Russian foreign ministry said five party talks involving the United states north and South Korea China and Russia are needed to ease tension on the Korean Peninsula\nMatthew bother reports from Moscow the state come and rather statement comes after Chinese and North Korean deputy foreign ministers met their Russian counterparts today in Moscow\nIn a statement released following the conclusion of meetings with the Chinese and North Korean diplomats Russia's foreign ministry notes as the multilateral talks or the way forward the three parties also said in a joint statement that the United nations should begin looking at using sanctions on Pyongyang as part of a coordinated Parker toward denuclearization\nUnder President Trump the U.S has been actively engaging North Korea at the end of the nuclear stalemate\nFollowing secretary of state Mike Pompeo has written visit the young young South Korea to the north Korean leader Kim Jong ... with planning a trip to Russia for NPR News this is Matthew Bodner Moscow\nOn Wall street stocks are sharply lower the Dow was down two hundred sixty two points or one percent the NASDAQ down nearly two percent this is NPR a\nNew report from watchdog in the U.S government accountability\nIt's October it is a new season or feeling the changes I don't know about you I always struggle when the when the weather gets bizarre and for the high plains you can't say much pretty much always bizarre um but I feel like we're all kind of together we're in this thing together we're all like what's going on you know and so\nI loved hearing about you know the the theme for this round is gain knowledge grow community give now\nThis is something where we're about a month out from the mid terms we're hearing so much about community we're hearing so much about people getting involved with their communities getting involved with politics getting informed by listening to things like all things considered MORNING EDITION and I don't know about you but as a news junkie and a music lover\nHigh plains public radio is everywhere I Want to be\nIt's everywhere you want to be in his every thing that you want to be as well there is such a diverse\nA programming list to that you can enjoy on high plains public radio from the news on MORNING edition and all things considered in the afternoon\nTo the music programs like high plains morning since Sonia classical music in the afternoon jazz in the evening that Saturday line up is just incredible including songbirds [laughter] yes thank you thank you [laughter]\nThere's just really wonderful things on high plains public radio and H. P. P. R. means so many different things to so many different people and affects people differently\nAnd your membership opportunity right now can reflect the relationship that you have with high plains public radio there is no set requirement for your membership you can give\nA onetime fifty dollar donation you can give a one time five hundred dollar donation we know that not everybody can afford that five hundred though we certainly know that people do and there are people that put down five hundred\nA rate on a regular basis for the station because that's how much value they have\nThat's that reflects the relationship and the importance that they have placed on high plains public radio and Jimmy ... and I were here asking you to have a look at your relationship with public radio and and what does that value and can you help support it because listener contributions is what keeps this music going\n\nSaid\nDu\nI'm not\n\n...\n... [noise]\n\nI'm not\n\n\nNot\nSure\nThat\nWe do know that\nTo be the\nMain the math\nAnd you\nKnow and all\nAnd\nThen they\nSaid oh no\nNo no\nBanned in the\n\nBank and\n[noise]\n\n\n[noise] [noise] do you do\nIn St\n\n\nLouis and I know you've got to\nDo that today\n\nWhen\nThe\n\n\nThey\n\n\n\n\n[noise]\n\n[noise]\n\nHow about a little riot for Bonnie rate that was you told me baby before that we had Beth would from late night radio that was guilty we started off that little blue sat with bleaker street doing my baby well folks it is high plains morning it is\nOn it is nine twenty four almost nine twenty five central and uh this is Jenny ... live in the studio with ms Valerie Smith\nAnd we're having a great time we got great music here and we are celebrating public radio on the high plains that says something where you drive through this flat vast region\nAnd you can find on your dial people telling you about what's going on in Eritrea and for that alone I Am so grateful and Valerie you've been a part of this station for an extremely long time [noise]\nFourteen years in counting excellent and it is my great honor to have been able to observe\nThat the region with with public radio and to add my services in my talents to keep the station on air but that is small in comparison to the many many listeners who have supported the station for over Thirty years in Kansas in eastern Colorado for over Twenty years\nIn the Texas Panhandle one public radio was introduced down there and\nThis is truly a a legacy of thousands of people who believe in the service and who wants to see this service continue for the next generation and it's like passing the torch\nOnto the next generation so that they can have access to great music programs like high plains morning and to to the news and information that's going on around the world\nSo we're asking you to take a moment right now and have have they have a little look at your relationship with public radio and and what\nWhat is the importance of public radio what would you like to be like without high plains morning\nAnd if it would make a significant significant difference in your life without the service then we just ask you to participate in keeping this alive and well here in the high plains\nOne eight hundred six seven eight seven four four four there's a gold is our of five five\nFive callers who are willing to step up to the plate today for their public radio station and for the service and for this music with a five dollar a month the contribution which equates to sixty dollars a year five dollars a month if this is something that is affordable and reasonable to you than please\nStep over that line of being a listener in becoming a member ended supporter of the service one eight hundred six seven eight seven four four four let us know that you've got five on it\nI have music lovers they keep in touch with me over email once in awhile they'll just you know they have great playlist is warning that says ...\nTo step up to the plate today for their public radio station and for the service and for this music with a five dollar a month the contribution which equates to sixty dollars a year five dollars a month if this is something that is affordable and reasonable to you than please\nStep over that line of being a listener and becoming a member and supporter of the service one eight hundred six seven eight seven four four four let us know that you got five on it\nI have music lovers they keep in touch with me over email once in a while they'll just you know they had great playlists this morning but says making me feel better or we got people that I have a regular back and forth with that just loved certain artists love certain um certain types of music when I play them they get into it um\nWe know you're out there we know you're out there supporting we just need to step it up one eight hundred six seven eight seven four four four and have a few more hands on the air just a few more hands on the air that are like yeah I can do five dollars a month\nA high plains morning as one of the flagship shows it's been around for what almost forty years now I'm making sure that the people in the high plains have access\nTo human selected a playlist that are relevant to us relevant to people of the planes\nOr someone to do and all that a heavy lifting for you going through all the CDs that are new going through the the new stuff that's coming out and also digging out some of the old stuff and making sure that it gets it do you know we've got Willie Nelson who have not stopped putting out records\nBut listening to some of his old stuff you have to check in with will ease old stuff sometimes hearing a artists like Joni Mitchell cat Stevens\nA dusty Springfield this is not stuff that's played on the rest of the stations out there and it's the good stuff\nSo just knowing that we're so silo to the irony of it being silo D silo media everyone's listening to the individual streams and here you can tune into public radio across the United states and the world and get a little flavor of where you are and my goodness the high plains has a really great flavor\nTo step up for that one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org we've got so much more music on the way so to support it\n[noise] you know that song that is floating around my head right now and and this is common for me I typically have a song that that fits every occasion and every conversation and the one that's a ringing about my head right now is a three eleven song that says music's what I Need to keep my sanity\nIs right\nToo we\nTyler shoulders off of his album purgatory that was born again before that ... barge off his most recent release manic revelation that were silent movie\nTyler shoulders off of his album purgatory that was born again\nBefore that ... most recent release manic revelations that was silent movie\nAnd we started off with the ... the death salons\nOr from their new album hurry home just in love with you with that song you're tuned into your public radio station it belongs to you we're the station of the people so people let's support it give us a call at eight hundred six seven eight seven four four four or go to H. P. P. R.\nDot org ... live in the studio with Valerie Smith and we are tapping all of our music lovers out there today\nYes indeed we did hear from one listener already this morning during high plains morning Mr call in William from Garden City Kansas\nOr I'm going to step out on a limb and say he probably call because I quoted a three living song [laughter] and he is a die hard three eleven fan but he is also a wonderful advocate for high plains public radio he tuned in and he listens\nTo the news programs he listens to high plains morning he also really enjoy since Sonia and the diverse programs that are available on high plains public radio and he was willing to call in today\nAnd put a put a pledge for the amount of passion that he has for the service we certainly hope that you'll take a moment right now and think about how passionate you are for public radio\nCan that passion equate to five dollars a month to sixty dollars a year the goal for this hours to hear from five callers we've heard from Colin Williams who's going to be the next person to step up and joined calling in meeting this goal for public radio so that this service can continue\nTo be provided in over three hundred communities across the listening area\nNow's your time to shy and B that next caller at one eight hundred six seven eight seven four four for five dollars a month\nLets light it up one eight hundred six seven eight seven four four four it is nine forty two we've got Eighteen minutes left of this hour I Want to stay on task for high plains morning I Know these listeners are out there I Know folks are out there tuning in\nI Know this music carries you through your morning when it's over you know it's time to eat and grow up and do we have this experience together I can I I Am beyond humbled that I'm the one that gets to you know pick out the play list and talk back and forth with y'all and\nYou know go to the go to the labels and say hey can I get a can I get a CD of this this is a this was a band this is an artist that I think that my people on the high plains with love so high plains public radio this is our shared space so much support it we have to support it\nAs a community license the we absolutely rely on our listeners\nTo call the eight hundred six seven eight seven four four for every so often just to keep the wheels rolling one eight hundred six seven eight seven four four four or go on line to H. P. P. R. dot org and just put up your hand in the air and say you know what I listen to this music I loved his music I don't want it to go away\nAnd you were mentioning Valerie earlier it's a place for your sanity\nAnd there was a story this morning on MORNING edition which I'd just assume everybody in the world just listening to MORNING EDITION and the just rolls right in the high plains morning talking about stone is talking about space\nUm and it's something that you really do have to fight to get any more\nAnd I I feel like listening to three hours of music that is meditation\nIt is it is meditation and like you mentioned earlier a five dollars a month is way cheaper than therapy\nAnd so you know what I listen to this music I loved his music I don't want it to go away and you were mentioning Valerie earlier it's a place for your sanity and there was a story this morning on MORNING edition which I'd just assume everybody in the world just listening to MORNING EDITION and that just rolls right in the high plains morning talking about stone is talking about space\nUm and it's something that you really do have to fight to get any more\nAnd I I feel like listening to three hours of music that is meditation\nIt is it as meditation and\nLike you mentioned earlier a five dollars a month is way cheaper than the ... so than therapy so if if this station is where you come to to keep you in touch with the world while you're at home on the high plains if this is a place where you come to to enjoy quality music\nThat enriches your life here on the high plains them please consider becoming a new member\nOne of the best things that you can do for the service it's become a new member that second best thing you can do for the service tell your friends to listen and bring them into the public radio fooled because once you start listening to public radio\nOr it gets in your blood and it it does not go anywhere so if this is a source of sanity for you\nThen didn't please become a new member and support this one eight hundred six seven eight seven four four four pledge drive\nIs a is a great time for people to come together and really a enforces the essence of many hands make light work when we all work together we can accomplish great things\nAnd we're asking you to work with your public radio station today at one eight hundred six seven eight seven four four four joined calling Williams in keeping high plains morning alive well in a ... to our region\nWhat eight hundred six seven eight seven four four four we're going to do this one phone call at a time you need to be the next one one eight hundred six seven eight seven four four four I'll sweetened the pot will play some way when Jenny story off their new album Fifteen you're not alone on high plains morning\n\n[noise]\nShe's in a in a ...\nIn touch\nDoes crackers\n...\nTo um\n[noise] um\nAnd you read the book and then leave 'em she says you know no ...\nMan and\n...\nYou\nWould be [noise] Mm\n\n[noise] one of them have fun job you\n...\nPut this in your ...\nName me\n\nOne of them my dream job you know ...\nNew book should remain\n\nNa na na man you know um Mm\nDon't be afraid to me is\nWhen the phone down for\n... na na\n\nNa na na ... Mm\n...\nMe too ... ...\n\n\n\nMm Mm Mm\nSure no one there was good to be a ...\nSometimes ... ... ... ... ... ...\nAnd some other\nNa na\nNa na\nDay of the fall membership campaign to the first hour of high plains morning let's just blow it up let's just really celebrate public radio\nOr we are all in this together and none of us are alone out there because we have public radio available via the airwaves and you make it possible one eight hundred six seven eight seven four four four or online at H. P. P. R. dot org ... your public radio stations asking five\nDollars a month five dollars a month can you do this can you make a one time donation every little bit of help SARS one phone call who's going to be the next caller Bob Davis is going to pick it up one eight hundred six seven eight seven four four four\nThirty seconds left of this hour folks let's stand up for great music on the high plains\nWith stand up for some of these hidden gems will stand up for tuning in and go wow I haven't heard that song in forever let's hear from some of our long hollers out there who tune into high plains public radio and are like what is this weird stuff this is going to make my drive that much more delightful as I drive across the flatus to prayer you can possibly thank\nAlright folks we got five seconds left one eight hundred\nAnd you make a one time donation every little bit of helps hours one phone call who's going to be the next caller Bob Davis is going to pick it up one eight hundred six seven eight seven four four four thirty\nSeconds left in this hour folks let's stand up for great music on the high plains\nLet's stand up for some of these hidden gems let's stand up for tuning in and go wow I haven't heard that song and forever let's hear from some of our long haul her is out there who tune into high plains public radio and are like what is this weird stuff this is going to make my drive that much more delightful as I drive across the flatus prairie you can possibly think\nAll right folks we got five seconds left one eight hundred six seven eight seven four four four will be back after news\n\n\nHere on the high plains we love our live music and that's why H. P. P. our living room concert series brings you inspirational song writers from across the world which shows in Amarillo Garden City and towns across the high plains joined the mailing list and learn more about living room concerts at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three ... heart of service of high plains public radio available everywhere on line at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support\nTibet H. P. P. R. dot org for details\nLive from NPR News in Washington on ... and the national Hurricane Center says hurricane Michael is just off the Florida Panhandle with tops who said winds of one hundred and forty five miles per hour Florida governor Rick Scott said greater danger is from the water he says the code will get it leads to twelve inches of rain\nSo think about that a foot of rain in some parts of the panhandle again prepare for major flooding from the storm the national Hurricane Center is for catching storm surge to be between nine and Thirteen feet\nThat means a water will come miles in shore and could easily rise over the roof so houses\nOnce the hurricane makes landfall it will move north east into Georgia it will lose strength but it's still expected to be a tropical storm then it will push into the Carolinas before accident into the Atlantic ocean\nNow that Brett Kavanaugh has been sworn in as a Supreme Court justice abortion rights groups are gearing up for what they expect to be more difficult fight in the years to come Planned Parenthood unveiling a new strategy designed to prepare for the possibility that roe versus Wade could be overturned NPR's Sarah McCammon has more\nWhere the cabinet on the court abortion rights opponents see a new opportunity to weaken or overturn roe the Nineteen Seventy three decision that legalized abortion nationwide Planned Parenthood's Don McGahn said abortion rights advocates expected increasingly difficult environment\nAlready women across this country have to access funding they have to access transportation they have to access housing that have to access support network\nPlanned Parenthood officials say they will focus on shoring up abortion rights and state legislatures expanding access in states with more liberal abortion laws and reducing stigma surrounding abortion Sarah McCammon NPR News\nImmigration and Customs Enforcement officials will and spent a privately run immigration jail in Southern California it's\nBeen cited for violations including poor medical care and news is in cells from member station KCPW cue we'd eat for ... Romero reports\nA contractor for ice will investigate the Atlanta processing\nUp abortion rights in state legislatures expanding access in states with more liberal abortion laws and reducing stigma surrounding abortion Sarah McCammon NPR News\nImmigration and Customs Enforcement officials will inspector privately run immigration jail in Southern California it's been cited for violations including poor medical care and Newt's in cells from member station KCPW cue we'd eat for ... Romero reports\nA contractor for ice will investigate the Atlanta processing center which is operated by the GEO Group one of the largest private prison companies nationwide but a former detainee got ... says he doubts then you inspection will improve conditions by the up to two thousand people held there\nThis is going on for years they known about this\nEvent goes that he repeatedly said detainees suffer seizures and ... on the floor without proper medical care\nBut I made it will get their either ordered by example leading yesterday\nThe GEO Group says the company takes the federal inspectors report seriously most ice detainees I locked up and facilities run by private companies according to a new report by Syracuse University for NPR News I'm fighting that have metal in San Francisco\nOn Wall street the Dow is down three hundred and sixteen points It's NPR\nA new report from the government Accountability Office finds cyber flaws and the Pentagon latest weapons systems\nThe jail reports that the Pentagon it's just starting to grapple with numerous vulnerabilities common problems included passwords that were easy to guess or weren't even changed from the factory setting the report cites Pentagon officials who say their systems are secure\nGuatemalans former vice president has been sentenced to Fifteen Years in prison in the country's first major verdict against corrupt officials Murray emerging reports the case was brought by a controversial un backed anti corruption commission\nFormer vice president ... summed up by the tea was charged with defrauding the state of what the mother of millions of dollars for purchasing chemicals that were to clean the contaminated lake up on the ... in reality the chemicals did nothing but make by the tea rich in this case the press here cause magic waters\nCivil society groups are hitting the verdict as historic\nThey said this shows the un backed anti corruption commission known as C C ... has indeed been effective in fighting corruption at the highest levels\nBut did they served under former president of it is more than enough he's also in person facing charges in other corruption cases in which was that the is also implicated for NPR News I'm a ...\nA private TV channel in Turkey is airing footage that it says that shows the missing Saudi Arabian critic Jim ... he went into it Saturday consulate in Istanbul, Turkey last week and vanished the Saudi Government says it doesn't know where could show he is turkey says it suspect he was kidnapped or killed\nOn corporate Coleman NPR News\nSupport for NPR comes from NPR's visions other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christiana Hendricks and Isabel who pair premiering October twelve on prime video\n\nHigh plains we are back with high plains morning this is our two of our show this hour we're going to have a blast we are celebrating the first day of our fall membership campaign I'm ... I live in the studio and I'm In Kansas and I love Kansas I'm from right by Kansas and I've got Valerie Smith\nWho's also from Kansas and we have got so much GOOD Music value I think I'm getting the caffeine kicking in\nFantastic hey this is pretty exciting speaking of Kansas or in your old\nOn prime video\nHigh plains we are back with high plains morning this is our two of our show this hour we're going to have a blast we are celebrating the first day of our fall membership campaign I'm ... I live in the studio and I'm In Kansas and I love Kansas I'm from right by Kansas and I've got Valerie Smith\nWho's also from Kansas and we have got so much GOOD Music Valerie I'm think I'm getting the caffeine kicking in\nFantastic hey this is pretty exciting speaking of Kansas or in your old stomping grounds on the eastern side of the state we just heard from a brand new member from and lays Kansas well\nTraveled back and forth from a late that he also lives in Colorado is well but he drives across\nThe listening area a couple of times of year and a couple times a year and when he does he turns his dial the high plains public radio\nAnd even though he only tuned in a couple of times a year he's still valued being able to have access to this while he's into listening area and he had stepped up to the plate to become a new member\nSo Craig Loomis thank you so very much for calling and supporting public radio\nAnd appreciating that you have accents and high plains public radio certainly appreciate your contribution this morning\nWe do have a couple of people on the line so we're still waiting to tally up to see if that goal was made for last hour thank you so much to everyone who is listening things to people who have already made their contribution this year and this month\nYou are the reason that public radio is here and these new members that have been acquired in the last year or the last hour Craig room is in rocky unreal\nPhenomenal welcome welcome to the high plains public radio family and it's great to have you as a listener and supporter of this service\nHowever it's a new our ten o'clock hour and looking forward to more music the Ginny will be spinning for us today here's the goal for this hour three hundred dollars there's a goal of three hundred dollars this hour that's one dollar per community that high plains public radio served in the actual listening area\nHow much of that can you do right now can you represent your community with a one time donation today of fifty dollars one hundred dollars maybe you want to do the whole three hundred dollars that's one dollar per community that will receive public radio for a year what a great gift that keeps giving this is an opportunity\nFor you to support public radio on the high plains here's the number to call one eight hundred six seven eight seven four four four or pleasure support on line at H. P. P. R. dot org\nThank you so much to Craig thanks to rocky thanks to everyone who called in with keep this thing going strong we got to get new members we've got to get excitement we've got to get those you know people that we know listen to really just take that next step and support it because we can't do this without you all\nOf them like I'm In the lane and I hate him on the head with a walking cane and I'm\nGoing to win that story well\nBut they still are you well know\nThe day but like I Know and that and I got it and they asked to take a short then read in a way to do or you\nKnow but they\nTo thank ... know then again in the Florida right now\nNo but the\nWhether they do things around with the job and I gave him the game for a ... been a long way or that dollar you\nKnow day\n\nWell\nToday I mean well like I don't get it and I got no it and they asked it tastes like short and bread and I'm\n... dollar you know they\nWent on a plate and then the day and then he tried to chase down the hill that I'm aware of that story around\nAll day\nTo day\nWhen I got to get it and I got no late and they asked me the side short then red and oh where are you\nWhen I got them and that and I got it and they asked a date like short for it and\n[noise]\n\n[noise]\n[noise]\n\nMm [noise]\n[noise]\nMm [noise]\n[noise] [noise]\n[noise] Mm\nMm Mm Mm Mm Mm\nMm Mm\nMm [noise]\n\nMm [noise]\nMm [noise]\n\nMm [noise] Mm\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\nMm\nMm\nMm\nMm [noise] Mm\n\nMm Mm Mm [noise]\nMm [noise] [noise]\n\n\nMm\nMm\nMm\nMm Mm [noise] Mm Mm Mm [noise] Mm [noise]\nMm [noise] Mm Mm\n[noise]\nMm\nMm Mm\n[noise] Mm\nMm\nMm [noise]\nAnd\nIn in\n[noise] Mm [noise]\nMm\n[noise] Mm [noise]\n\nMm Mm\nMm Mm\nMm [noise]\n\n[noise] Mm\n\n\n[noise] I I Love a few things more that I Love a African blood that was a bit of a car tray or a Mali that song is called ... so God so great to listen to this kind of music on a Wednesday morning oh chilly out it's all over kept most of the high plains\nI just love this stuff before that we had Dorothy Freeman off of her most recent released letters never read that was over there we started off with some Sean McConnell that's off his album and done where he did some of his songs and to strip them down and that's on the bottom of the the\nThis is high plains morning odd your members supported high plains public radio this is Jenny ... live in the studio with Valerie Smith and we are drumming up support for high plains public radio right now your public radio station needs\nAll chilly out all over cats most of the high plains\nI just love this stuff before that we had Dorothy Freeman off of her most recent release letters never read that was over there we started off with some Sean McConnell I thought his album undone where he did some of his songs and strips them down and that's on was bottom of the see\nThis as high plains morning on your members supported high plains public radio this is Jenny ... live in the studio with Valerie Smith and we are drumming up support for high plains public radio right now your public radio station need to hear from you if you are one of those music listeners\nThat relied on high plains morning and has\nFor years and years let's do this folks let's get together let's make sure that we have this service stabilized and secured for future generations and man we're going to need it over the next couple of months one eight hundred six seven eight seven four four four or go on line to H. P. P. R. dot org\n[noise] yes and good morning to you hope that you are having a really lovely Wednesday Jenny and I are hoping to celebrate a wins day by winning with public radio in meeting the goals this first day this first to show up high plains morning for the drive a goal for this month for this month [laughter]\nFor this month's at three hundred dollars a no\nGo for those have our you know the ideal and bomb the goal for this hour is three hundred dollars in the school has been set to represent the three hundred communities that high plains public radio served and the ironic thing is that we've we've heard from listeners who don't even live in one of those three hundred communities but are driving through the area\nAnd know the public radio model that that it is dependent upon the listeners to make contributions to keep this service on the air waves and they have stepped up to the plate we've heard from Craig in rocky brand new member of the pie plains public radio please help us celebrate\nBecause that is how effective new members are for the strength of the service you can become a new member joined them today represent your community right now by calling one eight hundred six seven eight seven four four four well\nValerie what if the three hundred and first community as a community of everywhere else everywhere else where you have to tune in remotely you have to tune in through the Internet you have to go to H. P. P. R. dot org you have to listen on your phone you listen through tune in you listen to Radio Free America\nWe have this access everywhere it's one of the wonderful things about being in twenty Eighteen you can get high plains public radio wherever you are\nI have people talking to me from Lawrence, Kansas from Los Angeles and we've got people in Osaka of Japan we've got people in New York City people in North Carolina we've got people all over the place people that used to have a connection\nPhysically to the high plains and left and they don't want to lose that very special thing that\nThose of us living and working still on the high plains get to celebrate every single day\nOne eight hundred six seven eight seven four for for this is done one at a time one contribution at a time people that want to grow this public radio community\nTry John ...\nAnd\n\nNa na na\n\nNa\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\nA little less bang for your off the album there's gonna be a storm that with my friend today before that and instrumental from the punch brothers that was prelude we're walking boss Willie Watson off his fabulous a folk singer volume two album Willie ... and he's in the uh\nThe rowing machine you might recognize as planned June Shelley at the top of that ... that\nAh that would be I got what I wanted I think I might need a little more coffee Valerie Smith\nIt happens when you work in this industry it certainly happened indeed copies the fuel that keeps\nA staff member of the high plains public radio going and you are the fuel that keeps the station on air that is what your contribution does is it supports wonderful quality programming\nAnd you know a great thing about high plains public radio that it offers to the listeners is ... if you could see what I see right now let me let me describe it to ... over there clicking away she's doing three things right now as well as talking on the air\nAnd she is ... looking at her play list and making sure that everything is okay she put time care and attention to every song that goes out on the radio and this is a great value because it's not just an analog somewhere some statistics that are playing that the top\nSongs and putting them in constant rotation this is Jenny seeking out entertainment\nMusic and art that reflect the values here on the high plains and the people can resonate with and that people can truly enjoy it's not to the top\nTwenty country songs or pop artists that you're going to hear you're going to hear underground grassroots\nAnd attention to every song that goes out on the radio and this is of great value because it's not just some analog somewhere some statistics that are playing to the top songs and putting them in constant rotation this is Jenny seeking out entertainment\nMusic and artists that reflect the value here on the high plains and that people can resonate with and that people can truly enjoy it's not the top\nTwenty country songs or pop art is that you're going to hear you're going to hear underground grassroots endeavors and that is exactly what high plains public radio is and it's made possible\nBy you know the answer you know the answer it's made possible by you and your contributions and the value that you place on high plains public radio\nThere is a goal this hour three hundred dollars which represents the three hundred communities that sit in the listening area and we're excited to hear from your community one eight hundred six seven eight seven four for for this is the first day of the fall membership campaigns\nThere's an overall goal for the month of October of eighty five thousand dollars and we're inching our way closer to only eighty thousand remaining now this is a very\nUm this is this is a rather large lump sum of money that high plains Public Radio's needing to continue servicing the high plains region\nBut the great value of it is that\nWe're not asking one person to do all of this this is a collective group of people coming together like minded people lifelong learners\nWho benefit from the programs that are offered on high plains public radio and it's everybody doing their part you remember she has no set level twenty dollars a one time donation right now of twenty dollars will get us that much closer to three hundred dollars\nMaybe you can do it when time donation right now of one hundred and fifty dollars then we'll be halfway to this goal you don't have to do it all alone there are people here willing to help\nAnd want to help and wants to participate and and show their passion for this service many hands make light work and we're just asking you to do your part right now at whatever level you can one eight hundred six seven eight seven four four four\nWe'd love to give a shout out to your community right now when you call and pledged your support well thank you will think your community and then\nTwo hundred and Ninety nine other communities will also be thinking your community for stepping up to the plate for public radio this morning one eight hundred six seven eight seven four four four\nCan do this together folks that says this is the power of people we've got\nWe've got a lot of people across the high plains is five states of coverage the reason it's a little pricey to do the survey is because we've got so much land we've got Nineteen different transmitters and translators and we got to keep that access going and it ain't easy so we need everyone out there who listens\nTo step up and become a member one eight hundred six seven eight seven four four four let's go into this pledge drive strong and support this music\nSupport for high plains morning has provided by Amarillo symphony presenting concerto an F with ... conducting and featuring Conrad Dow on piano like October nineteenth and twenty seven thirty PM at the globe new center emerald symphony dot org\nAnd by Garden City downtown vision striving to promote the historic business district by offering incentive programs and resources for those ready to locate a business to downtown Garden City Kansas\nArt Valerie we're going to keep the music going we're going to play a track off the new big thief album capacity or the song is called sharks mild this was a this was one that I really enjoyed listening to when I was on my drive out to go to the\nDow on piano that's October nineteenth and twenty seven thirty PM at the globe new center emerald symphony dot org\nAnd I Garden City downtown vision striving to promote the historic business district by offering incentive programs and resources for those ready to locate a business to downtown Garden City Kansas\nArt Valerie we're going to keep the music going we're going to play a track off the new big the album capacity\nOr the song is called sharks mild which is a this was one that I really enjoyed listening to when I was on my drive out to go to the ... springs spoken bluegrass festival and going out to the different music festival making sure that we're getting a sample of some of the relevant new artists that are coming up\nYou just can't keep up there are so many of them\nUm but it's something that high plains public radio puts a lot of value on it's making sure to support young independent artists to support new music new voices poetry on the high plains a live music to just really be present for it and share it with everyone across the high plains give your that number again\nOne eight hundred six seven eight seven four for for your support right now makes this possible ... is able to to support by playing the music from these independent artists and these people who have incredible talent but maybe they don't have the validation of a major record label\nBut they're still worth a listen\nYour support makes this possible the gift that keeps on giving one eight hundred six seven eight seven four four four let's hear from you and your community right now\nOne eight hundred six seven eight seven four for four years of ... and ... link or big thief on high plains morning with sharks smile\n\n\n\n\nShoes she came to Lynn\nShown on Israel game\n\nAnd\nEight hundred six seven eight seven four for ... for for what [laughter]\nSo hard it's so hard dug it certainly did a great job of helping high plains public radio meet this hour legal there's still a little bit remaining so what can you do to meet this three hundred dollar goals that says it's significant goals three hundred dollars\nFor this hour and it represents the three hundred communities that high plains Public Radio's serves that our towers the Nineteen towers stretch across and served three hundred community so if you have\nThe availability to help your public radio station right\nNow meet their goal so that we can celebrate it successful our than please can consider doing so right now here is that phone number that important phone number one eight hundred six seven eight seven four four four I think [noise]\nBy there there's just been with lots of exactly one hundred years separates box be minor mess and based on the line of grounding achievements of two distinct your [noise] which we could exploring as a bridge those world as we pose the question\nDo we get from bar debate over\nThis week on exploring music [noise]\nWeekdays at noon central [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere on line at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter of high plains public radio visit H. P. P. R. dot org and look under the support for details\nLive from NPR News in Washington I'm Laurie London [noise]\nHurricane Michael is now an extremely dangerous category for storm and continues to grow\nForecasters say it will make landfall around mid day to day posing the threat of catastrophic searches of the water and roof shredding wins FEMA says it's had nearly three thousand people in the field ready to assist\nAnd as NPR's Rebecca Hersher reports Michael is predicted to be the worst hurricane ever recorded on the Florida Panhandle\nMichael's maximum sustained wind speeds or near one hundred and forty five miles per hour that's strong enough to rip off ribs downed trees and overturned mobile homes hurricane warning in effect for hundreds of miles of coastline along the Florida Panhandle storm surge of at least nine vertical feet is forecast near Panama City Florida\nUp to twelve inches of rain could cause flash floods in some areas and tornados are also possible according to the national Hurricane Center Michael could get slightly stronger before it's powerful core makes landfall in Florida this afternoon\nThe storm is expected to turn northeast says it hits land moving across Georgia and South Carolina on Thursday before busting out into the Atlantic on friday Rebecca Hersher NPR News\nThe U.S Supreme Court is weighing in on lawsuits over a citizenship question the Trump Administration wants to add to the twenty twenty cents is NPR's Hansi Lo Wang reports the administration is asking the court to stop lawyers from questioning administration official under oath about the citizenship question\nLower courts that order two key officials behind a citizenship question to testify out of court they include coverage secretary Wilbur Ross who approved adding the question to the twenty twenty centers and John Gore you acting director of the Justice Department division that the administration says it needs the question to better and forced the voting rights act Supreme Court Justice Ruth Bader Ginsburg has put both of their ...\nActing director of the Justice Department division that the administration says needs to question to better enforce the voting rights act\nSupreme Court Justice Ruth Bader Ginsburg has put both of their depositions on hold temporarily until the high court decides whether to block them permanently dozens of states cities and other groups are suing for the removal of the citizenship question\nIf you will discovers households with non citizens from participating in the census and harm the accuracy of the information collected on view along NPR News New York\nPresident Trump is repeating and an supported assertion that California Democratic Senator Dianne Feinstein leaked a letter written by the woman accusing Supreme Court justice Brett Kavanaugh of sexual assault\nTrump's comments at a rally in Iowa last night prompted the crowd chanted lock her up Feinstein is the ranking democratic member of the Senate Judiciary committee she denies leaking the letter that led to the firestorm over Kavanaugh's confirmation\nOn Wall street tech stocks are leading a major downward slide the Dow is down three hundred and Seventy nine points this is NPR News\n\nOne person is under arrest in Germany as part of an investigation into the slaying of an investigative journalist in Bulgaria as Joanna Kakissis reports it's the third killing of a reporter in the end you this here\nVictoria Medina was found on Saturday she'd been raped beaten and murdered she hosted investigative reporting program at a private station run by her ex husband Filin moxie move he\nSpoke at a makeshift memorial for her she was a fighter she would not be satisfied just investigated you want to treat each of us killing has shocked the use which considers itself a safe haven for journalists under threat\nThe anti graft watchdog Transparency International ranks Bulgaria is the most corrupt in the European Union and the least open to press freedom for NPR\nNews I'm Joanna Kakissis in Rousseff Bulgaria\nMeanwhile Turkish media is airing surveillance video of missing writer John Malkovich soggy walking into the Saudi consulate in Istanbul but doesn't show ... leaving\nThe footage purports to show a team of Saudis arriving in Istanbul the day he went missing it also shows a black Mercedes Benz leaving the Saudi consulate after he entered and the team checking out\nInto partying the country later that night\nSaudi Arabia remain silent as the images plate across the television networks in Turkey and around the world\nThe kingdom is under pressure amid growing international concern for\nThe writer I'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Roma knows a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\n\nWe're back with high plains morning all members supported high plains public radio that says our three\nBut it is day one of the fall membership campaign it's a new season we're all losing our minds a little bit because of the weather's changing we can't focus we can't sleep and that's why we need a weight I'm Talking about me or and I were that's what we need great music on the high plains\nThank you so much for staying tuned to your public radio station thanks for being there\nAnd supporting it and making those phone calls at one eight hundred six seven eight seven four four four in support of great music and great access to public radio on the high plains I'm Jenny ... live in\nSeven four four four in support of great music and great access to public radio on the high plains I'm Jenny ... live in the studio as I often am but today I've gotten Valerie Smith in here with me\nOr one of my oh gee incredible uh inspirational people who really keeps public radio going in this region\nA thank you for those kind words Jenny the admiration and certainly mutual with all of your efforts as well and we'd also like to express gratitude to all the new members who have called in so far during high plains morning a dug in in ... thank you so much\nFor supporting high plains public radio and expressing your gratitude towards the service and the high plains morning we also want to welcome Craig Loomis\nFrom Aurora, Colorado who drives the area upon occasion and wants to support the public radio station that he enjoys while he's traveling through we also heard from someone who's visiting family in similar on this morning rocky unreal again welcome to the H. P. P. our family\nAnd earlier this morning colon Williams did call in and put his support to public radio he's actually going to be hosting songbirds with me in the next few weeks so do stay tuned for that ... [noise]\nSo at ... o'clock hour again welcome to a new our welcome to a new season this is a new fiscal year for high plains public radio begins in October so this fall membership campaign is incredibly important because it sets the tone\nFor the rest of the year and let's high plains public radio no where we'd say what we can and what we cannot do in our mission is to provide great quality public radio programming to you so your contribution right now will seriously have a lasting effect on the rest of this year for high plains public radium\n[noise] one of the best ways that you can support Public Radio's ... by becoming a new member statistics show us that high plains public radio listeners of this service only\nFour percent of the listeners are members only four percent so if all those people who are listening right now just gave Fifteen dollars we would meet the school we would meet this school and high plains public radio would return to normal programming we wouldn't have to be here fundraising because we would have met the goal\nBut uh not everybody does that not everybody takes the initiative and those people that do call him pledge their support\nHigh plains Public Radio's incredibly grateful to them because they are the backbone of this service so this hour Janine are wanting to welcome five new members the high plains public radio five new members from each state that we broadcast and which is Nebraska\n\n... ...\n... ...\nNew gas station in the middle of nowhere\nMedic yeah look yeah man\n... ... ... sun shine upon it and ...\nAnd\nAnd that\nI and ...\nAnd\nThe question\nYou weren't in their backyard\nDirty or training\nNot gangs [noise]\nGod\n[noise]\n\n\n\n\n[noise]\nShe\nJune morning\nJune morning shower [noise]\n\nBut says high plains morning on member supported high plains public radio thanks so much for being here we just had an Oklahoma singer songwriter that with Caitlin pay off her fabulous album Bible Belt that was middle gate station got to meet her and see her at the folk alliance and the Oklahoma room\nOr in such a great time we're so proud of all of our regional musicians that we get to play and showcase here on high plains morning before that Yousef AKA cat Stevens off the most recent\nRemy nominated album the laughing apple that's almost called mighty piece island ... before that with someone's arms and we started off with Graham an Emmy Lou\nUh that was the angels rejoice last night I Love the music Valerie Smith live in the studio with me right now and we had a fun little idea about the five states saying we're doing\nYes absolutely high plains Public Radio's looking for new members right now soup and if you have been listening and utilizing the service for well why don't you consider making today the day that you call him pledge your support\nH. P. P. R. would love to welcome a new member from each of the states that public radio serves so that to Nebraska\nColorado Kansas or Oklahoma and Texas and as a treat when you call in to represent your state\nUh Jenny will play a song that has your state in it whether it's Oklahoma Nebraska Colorado so as a reward to you for representing you will have a dedicated onto you your community and your state but it all starts with your phone call one eight hundred six seven eight seven four four four\nSo let's hear from a new member in Texas how about a new member and Oklahoma is there anybody who's been listening for a while in Colorado that would call and become a new member today how about Kansas have you been listening to high plains public radio for a while\nNobody has been listening for awhile and Colorado that would call\nAnd become a new member today how about Kansas have you been listening for two high plains public radio for well today the day in Nebraska H. P. P. R. church it's a little portion of Nebraska\nBut we do have some members for him in Nebraska which is really great that they want to support high plains public radio so let's hear from another new member\nKnow him but then\nI'm\n\nWhen I'm\n\nWe\n\nMy\nGod I\n... ...\n... ... my\nSaying\nWow man\nI'm On my\n\n\n\n\n\n\n\n\n\nNo\n\n\n\n\nNo\n\n\nNo\nBaby but no\nWay they're just not\nThe only thing\nYou\n\nWere saying and I'm\nIn\n\n\nThey\nThen\nThat would be\nMuch treadmill\nWeighing\n\n\nNa\nYeah [noise] he will\nMake me happy he said oh no\nI\nLove\nThat man na\n\n\nNa\n", "show_name": "High Plains Morning", "year": "2018", "city": "Dalhart", "day": "10"}