{"month": "10", "state": "TX", "station": "KTDH", "content": "To exactly one hundred years separates box be minor mess and based on the ... century\nGrounding achievements of two distinct your is this week with exploring music bridge those roles as we pose the question\nWe go from ... debate though is\nThat this week on exporting music [noise]\nWe days at noon central\n[noise]\nThis is Nadia one point five ... eighty nine point three ... heart of service of high plains public radio available everywhere on line at H. P. P. R. dot or\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or crawl eight hundred six seven eight seven four four four\n[noise]\n\nThere you are high plains welcome to your high plains morning on numbers supported high plains public radio [noise]\nSome words are hard hey this is Thursday it is my favorite saying we have got growing on the high plains of man see any answer yes that's right we actually have actual getting in the end you live in the studio today the day period we're going to do this today we got some great music for you are going to talk about for nearly as come at me bro mealy ad\nThey tune high plains warning it's not only right here on your on the new members supported by the public radio station [noise]\n\n\nLive from NPR News in Washington encore of a call them and the national Hurricane Center that tropical storm Michael is now over central South Carolina it tops staying wins or fifty miles per hour it continues to move east and will strike north\nStorm Michael is now over central South Carolina\nIt tops stained Windsor at fifty miles per hour\nIt continues to move east and will strike North Carolina and parts of southern Virginia leader in the afternoon it will move into the Atlantic ocean later tonight\nMichael crashed into the Florida Panhandle yesterday as a major hurricane wind speeds of one hundred and fifty five miles per hour catastrophic damage it's feared\nStephanie Brandon is with the red cross staged in Tallahassee, Florida\nWe've mobilized hundreds of volunteers around the country and even in the states affected and they're ready to roll up their sleeves and help those affected in these communities\nAt least two people have been killed in Florida and Georgia and hundreds of thousands of customers do not have power\nThe Russian space agency has suspended all flights of its ... rocket program following a dramatic launch failure today an astronaut ... not had to make a hard emergency landing Matthew bother reports from Moscow the crew has been safely recovered in remote context\nOn the Russian space agency says it it is investigating the cause of the failure but will hold no press conferences today\nWhat is clear that the so you will not fly again until the cause of the failure is identified a live broadcast or the launch showed that the Russian American crew experienced the sensation of weightlessness and spinning a boost their separation signaling that it serious problem had occurred\nRussia's space program deep in crisis has experienced a series of high profile launch failures over the past decade\nBut never in a twenty year history of the either the program has a mental use rocket experience a problem on launch the failure followed the discovery last month of the material ... spacecraft currently dogs to the international space station this has raised sharp questions about quality control for NPR News I'm Matthew Bodner in Moscow\nStock markets in Asia plunged today following yesterday's sell off on Wall street Chinese markets plunged by five percent on Japan's Nikkei average with down nearly four percent markets in Europe continue to slide and beers or he Berliner says there are several reasons for the global fell off\nA among them a technology stocks which are really propped up the market which of blew the market for so long\nUh they've started to fall I'm as well as there are higher interest rates for all kinds of things you'll on treasury bonds are up that could make them more attractive and thoughts and hanging over all these are the trade tensions between us and China they're real and they're not going away and this could be making the mood in the markets darker\nAnd bears or a Berliner in Washington meanwhile stock market seemed to be recovering a little bit today on Wall street the Dow Jones industrial ... forty eight point twenty five thousand six hundred and forty seven the NASDAQ ease up about fifty points the and the five hundred isn't up five\nThat does NPR the federal\nGovernment is expected to announce today a cost of living increase for people who receive Social Security the Associated Press estimates that increase will be two point eight percent and would take effect January first\nThe average increase for a retired workers would be about thirty nine dollars any increase in benefits will go to Social Security recipients as well as two disabled veterans disabled workers surviving spouses and children and retired federal workers\nTurkey's president says authorities are investigating every aspect of the disappearance of the Saudi journalist and then boom\nNPR's Peter Kenyon says turkey is demanding an explanation of what happened to Jamal ... after he entered the ... in ... last week\n... says hunker is concerned but because she'll be disappearance though he is not repeated allegations by unnamed investigators because she'll be was killed inside the consulate invest\nHe is not repeated allegations by unnamed investigators because she'll be was killed inside the consulate investigators do the Reuters news agency that will lead they're following is the apple watch the show bused believed to have been wearing when you enter the consulate on October second\nSaudi officials denied any wrongdoing fifty nine year old ... opinion pieces for the Washington Post\nHas sometimes been critical of the Saudi Government and crown prince Mohammed bin ...\nSo she'll be wrote that he felt an obligation to speak up for pro reform activists who had been detained by the government Peter Kenyon NPR News Istanbul\nThere with a new earthquake in Indonesia today that killed three people it was on the island a job but not the Lewinsky where earthquake and tsunami struck nearly two weeks ago the death toll from ... to doctors has topped two thousand people this is NPR\nSupport for NPR comes from NPR station or their contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart for being a hindrance and Isabel who pair premiering October twelve on prime video\n\nGood morning high plains that says high plains morning on member supported high plains public radio it is time for three hours of great music plus it is Thursday we're going to have growing on the high plains would skip man see any and guess what y'all I Am so thrilled to my favorite part of my entire life\nDuring pledge drive I get to actually touch with skip and Sandy on some of these days they're kept so much for coming in\nAnd I thank you you're most welcome gay as well so we're going to have a blast yeah you think we got three hour than us right now\nI think we have three hours at a ... actually we could\nGo forever if the phone rang 'cause you know that's the one that's our goal right now we need to uh to appeal to the folks who\nDeeply love your Thursday segments as much as I Do out there I'm Jenny ... host of high plains morning and I get the privilege of air and growing on the high plains on Thursdays at ten thirty central and it is just this little slice of heaven I get to hear\nAbout all the things that I Wish I could do and so I Love to live vicariously through all of your endeavors and potted plant and food and I get to hear all about these you know ... donkeys if the travel travel show so we're going to celebrate growing on the high plains how many years have you been doing it\nI'm more than more than you would imagine [laughter]\nWe're going to say many years many years probably at least twenty [laughter] amazing I Hope you I Hope you pause sometimes really dislike let that sink in because\nTwenty years' worth of I mean that's you know there are people that grew up with you you know that that listen to this program\nAh people out there that listen to the high plains public radio and know the value of it and feel their sense of place through your segment so we just want to celebrate that today and folks today we're going to have we're going to talk about ... which is one of my favorite word to say I think ... ... yeah and lay ocean as I say yeah those are those are good word [laughter]\nSo we're going to have we're going to have a black today um that comes up at ten thirty central get here the segment um I normally have weather right now but I haven't quite got that yet\nI'm let's just chat for a minute about the fall membership campaign where in day to\nUh we need to get the phone's ringing we need to get people who support this service\nBecause of the sense of place because of the high plains roots of it and that's how we're still going people for forty years now most\nHave come forward for public radio and we need it to happen it has to renew you know you mentioned in your in your a segment that it just requires a little bit of care every so often just like a ... ad and that's all we're here asking for\nRight my one once a year a food and water [laughter] and we have\nJust like a ... ad and that's all we're here asking for\nRight my one once a year a food and water [laughter] and we have a little food and water here that I Would like to do I think you to a person who called in a with a renewal\nAnd we thank you so much and uh they are a shy person who believes and are supporting the station but not necessarily they might not be ... that yes yes you might be very very uh it ... and yeah vociferous but humble ooh words were\nNa for\n\nMm\nRoaster the I'm not into the\nDid and you know no ...\nOnto\n[noise]\nThat that I'm the only way that you had the\nBaby and all day long on on the\n\nYeah\nThe computer was today\nMaybe you can do a lot\n\nYeah\n\n[noise]\nThanks so much for tuning into high plains public radio you're listening right now too high plains morning\nMorning music show I'm Jenny ... live in the studio thanks so much for being with us I got to get man see any with me here in the studio this is one of the highlights of my year y'all we just heard since Sarah ... from her\nAlbum from where I started that's on what's called the only one we had her live in the studio when she was passing through Amarillo about a year and a half ago\nBefore that the straight bird off of one of the earlier albums best medicine I found out they just broke up but hey they have a brand new album out they went out with the bank so we'll be getting that um\nOff of one of the earlier albums best medicine I found out they just broke up but hey they have a brand new album out they went out with a bang so we'll be getting that\nUm I've already requested it that song was called Black Hills and we started off with Freddie and Francine\n... who we have seen at the folk alliance live in a tiny little hotel room that song is called the future of my farm and I dedicate that you skip and all of our growers on the high plains out there good morning skip how're you doing today I'm doing very well thank you excellent\nGlad to be here yeah we're um we're going to just be playing music we're going to be chatting we're going to be in courage in all of our listeners out there or to\nPut a little bit more into the public radio station that they love and ah why do you support public radio why do you do so much for public radio\n[noise] well it's it's really been a part of my life and our lives my husband and I uh since the very beginning when Clinton\nHad this crazy idea [laughter]\nWe're not out great that it should ... that that we should come from the planes you know the sound should come from the planes and the prairie and it has worked out great\nA but in order to keep working I'm as those of us who have been here for a long time sometimes some of us move on to something else or somewhere else and we need to replace we need to replace and replenish all the time and so\nUh this time of year a harvest time it's when we also need to harvest some new members and\nMaybe some existing or some old members that need to re new you know we would love to hear from you one eight hundred six seven eight seven four four four\nLittle buds little pups at the ... we need some new sprout right and I know this is this is the time right now we're we're hearing a lot of news some of it's very heavy a lot of things are happening um but you know what I only get to know about that stuff\nBecause I can tune in on my radio dial\nOn the high plane and here it\nAh I don't we don't always rely on like having like devices were not people of devices and signals and so you are data an unlimited this I don't I don't do that I'm not I'm work for a radio station I turn it on my dial and it is so important to me to have that little fuzzy ...\nOne of the Nineteen sixties old stereo and I can hear the news every morning I feel connected I feel like I have some kind of an idea of what's going on everywhere else\nAnd that's that's the key everywhere else and uh it it is connected but it's connected worldwide so at this time uh it seems like\nIn some ways you hear the same things over and over and over and over and over and over and a high plains public radio gives you news and music and other information um\nThat isn't it isn't repetitive that isn't repeated over and over a we let you know what you need to know and and what's important for all of us to know but we don't beat you over the head with it [laughter]\nYeah it is a curated by the pros of will cost and I love the the the conduit all funneled through the high plains that people that are sitting at the helm baking decision adding the little flavor like growing on the high plains like I'm a little spouse on the prairie\nWell and also the news that I was listening to I had to drive driveway moment at curbside here before I came in the building today because I wanted to hear the rest of the news about Colorado and people stealing water from each other [laughter]\nAnd so it began yeah and I I thought yeah this is us and its its worldwide nationwide it's worldwide and it's us yeah\nIt is it is really nice to know that are on the ...\nAnd it's it's worldwide donation mind it's worldwide\nAnd it sucks yeah it is it is really nice to know that I'm On the high plains we have a voice and that voice is high plains public radio so please all of you out there if you haven't renewed in a while give us a call at eight hundred six seven eight seven four four four\nThrowing down you know a little bit each time you hear these pledge drive\nThat is what it takes to keep it going and encourage your friends and family that you know within one eight hundred six seven eight seven four four four you just want to make it even easier go to H. P. P. R. dot org on that main page to talk on the right to give now you can just put in your pledge right there give us a note till skip how much you appreciate what it is that she does\nUm we get to listen to music for three hours every morning which to me feel like this meditative antidote to some of the news that we hear 'em but you know they were mentioned in the morning the news isn't all bad we had we got to ... year old up this Cuban underground a recorded tapes that are going to be coming out and you bet your bottom dollar I Will be sending an email and asking for that\nOn and these fantastic places to put up the great music they do support public radio so it's it's a group effort is everyone coming together to bring to the high plains the call us at eight hundred six seven eight seven four four four or go on line to H. P. P. R. dot org\nAnd we play a lot of independent artist here so I'm going to play another one right now we got brandy Carlisle offer album bear creek here's rise again I Want this to inspire everyone out there it's the fall membership campaign let's get some new folks out there we've got a twelve hundred dollars left on his pledge a\n... of the corporate match right now you're going to get your dollars doubled every bit that you put in fifty bucks turns into a hundred thanks so much to double L. transport\nA trip in Oklahoma um so we're going to get them brandy Carlisle one eight hundred six seven eight seven four four four or what a H. P. P. R. dot org and show up for your public radio station\n\n\n\n\nIt's beginning to look a lot like fall across the high plains with pumpkins on porches and the thing to smell of firewood feeling beer which means it's time for H. P. P. R. it's full membership campaign [noise]\nWell ... understands the importance of uninterrupted programming we also know that without listener contributions the service would not be possible through H. P. P. R. you gain knowledge in group community so please give today at H. P. P. R. dot org\nThanks so much for staying tune too high plains morning on member supported high plains public radio this is Jenny ... live in the studio with skipped man's Seaney we just heard a little block of great music Shelby Lynne ... should have been better Bob Marley in the ... before that\nForever loving jaw and we had a brand new Carlisle at the top with rise again\nBeginning to look a little bit like fall skip\nYes it is [laughter] and and or Antarctica in summer on Kansas but hey you know what we're going to we got snow in some of our region we've got sun in some of our region how about we give the people what they want they want the weather\nOkay and I'm going to do that it's going to be cloudy to partly cloudy on the high plains today highs will be in the lower forties to upper fifties tonight chance of showers and thunderstorms just about everywhere\nIt'll be cloudy to mostly cloudy with Lowes in the mid thirties to lower fifties [noise]\nAnd now we're going to look at the sections right and the first time I've ever done that and this is so exciting to not have like to give this to somebody and like so great to just listen to the weather I Love it\nNorth West Kansas and northeast Colorado will be mostly cloudy with a high near forty tonight showers likely mainly before midnight cloudy with a low around thirty five getting close to be enough free Steiner [laughter]\nNorth central Kansas is partly cloudy widespread frost in the morning hides in the upper forties tonight showers and slight chance of thunderstorms Lowe's and the lower forty\nSoutheast Colorado mostly cloudy with a high near forty nine tonight mostly cloudy with a low around forty and a chance of showers and thunderstorms southwest Kansas areas of frost before now\nTonight mostly cloudy with a low around forty and a chance of showers and thunderstorms\nSouthwest Kansas areas of frost before nine mostly cloudy with a high in their forty six tonight cloudy with a low around forty and a chance of showers and thunder storm\nThe Oklahoma and Texas Panhandle are cloudy with a high and you're fifty seven tonight mostly cloudy slight chance of showers and thunderstorms lows in the mid to upper forties skipped\nYou want a job [laughter] I can I can I just outsource it whether you use it up so well\n[noise] well I have something else to read do lived here that is a thank you [noise] to uh Derek vale from dodge city Kansas who is renewing his membership\nAnd a sustaining and and renewing his membership and he has a ... doesn't have any comments about it but he's been around for a while so I think he likes what we're doing thank you Derek so much for your support and because of our um [noise]\nI'm wonderful double L. transport gift here uh Derek money and your money if you call in will be doubled do and you\nOne eight hundred six seven eight seven four four four we're going to chip through this Fifteen hundred dollar corporate match thanks so much to an early adopter of high plains public radio double ... transport now skip you were mentioning they have they've been here since\n... Ohio yeah yeah they have been here and they are still here and they are supportive and we couldn't do it without you double L. that his dory and Dennis lap\nAnd they're just across the border into the Oklahoma Panhandle from liberal and um we really appreciate your support all the support you've given a four years and years and and if you appreciate what we do here what we send to your community to your ears\nUm this would be a good way to say thanks to someone who has been here for the long haul and a double L. transport\nLong haul pun intended yes that ... commodity\nLawyer right now the double L. them for a lot of love so this is a lot of love coming from someone who really really love public radio and once you provided wants to make sure that they put a little extra forward to encourage everyone else out there that's listening just throw in a little bit ... doesn't have to be much if everybody just to twenty bucks we're down here right\nAnd we don't we don't have a limit of saying you have to have that much in order to get your name right or to be a supporter or whatever it or if you are are in some tight Financial Times right now\nI'm maybe twenty twenty five dollars is is gonna be a big gift for you but it would become forty or fifty dollars because of double ... transport now's the time for you to make a pledge of whatever size that you feel you can do and that you think the station it's worse in your life\nUh and uh by making that pledge your doubling that pledge this is a this is a great deal right now we don't want to let this get past us so we do need some calls we had we've had a couple of calls a since we started but um\nIt's a quarter to ten so it's time to get the phone ringing also people are\nSitting out there are relaxed and we need to get them going [laughter] and so that\nAgain it's one eight hundred six seven eight seven four four four just pick up the phone folks now at the time to do it get it over with it is Thursday or going to have growing up in the high plains would skip Nancy any up at ten thirty central this is the perfect day to do it\nUp at ten thirty central this is the perfect day to do it take the take advantage of double transports generosity and their encouragement or this is high plains people supporting other high plains people um for us to be able to have the access it just has a price tag on it bottom line and that\nBeautiful beast of the honor system you know we're always struggling to stay on on the air\nBut we know you're out there we get about four percent of our listeners actually contribute let's be set up we need we need to have some little ... here today on high plains public radio given that phone numbers get\nA one eight hundred six seven eight seven four four four excellent or go to H. P. P. R. dot org if you don't want to interact with a human ... our our robots are also standing by on ... on on there so we got twelve ten left and what do we got left in his first hour about fourteen minutes left or the first hour\nI Do want to let you know that in addition to do a little transport with this corporate match support for high plains morning is provided by the Garcia charitable foundation of Dr Bill Garcia and ... Garcia\nCommitted to improving the quality of life for those less fortunate through education and by United Wireless serving southwest Kansas with wireless products and plants that suit your needs stores and agents across the region coverage you deserve service you expect United Wireless dot com\nAnd of course by the panhandle planes historical museum celebrating archeology month with dynamite day that's this Saturday October thirteenth one to four pm gets can excavate and make fossils and more that you can get more information that panhandle planes dot org ... I saw a light yes someone is calling and a\nAnd a pledge form as being filled out that it's always good to see we but we have two other people sitting around waiting\nDrumming their fingers one eight hundred six seven eight seven four four four let's have a big thank you to Dorian Dennis lap of double all transport take their money they want you to we've got twelve ten left on this challenge grant\nHow about we listen to some uh a garden seemed to music again that sounds good All right David Greer off his album panorama here's apples and oranges making me hungry on high plains morning give us a call support your public radio station one eight hundred six seven eight seven four four four\nThat number again eight hundred six seven eight seven four four four\nMm Mm Mm\nMm\n\n\n\nMm\n\n\nA new membership uh doubled by Dorie and Dennis lap\nOf double ... transport and the Oklahoma Panhandle and\nThese two go way back for their with their support of high plains public radio so that's so exciting thank you so much to the left for that and folk take advantage we've only got a\nHalf like half a minute left in the first hour let's stay on track one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org and I were gonna try to keep it on track for five hundred bucks an hour it's getting doubled all of its getting doubled\nUh this is ... we got skip Nancy any here we're going to have growing on the high plains coming up next our so give us a call folks eight hundred six seven eight seven four four for news is next\n[noise]\nFor exactly one hundred years separation Fox be minor mess and making much money running achievements of two distinct you're this week we're exploring music bridge those roles as we pose the question\nWe get some bar debate though is\nThat this week on exporting music\nWeekdays at noon central\n[noise]\nIs Ninety One point five ... eighty nine\nWe days at noon central\n[noise]\nThis is Ninety One point five ... eighty nine point three ... heart a service of high plains public radio available everywhere on line at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nMine from NPR News in Washington encore of a cold and the national Hurricane Center says tropical storm Michael is producing heavy rain and tropical storm force winds over north and South Carolina\nThe center is now close to Charlotte North Carolina and has topped Hussein when that fifty miles per hour Michael stormed ashore Wednesday on Florida's panhandle with sustained winds of one hundred fifty five miles per hour the director of FEMA Brock Long that the agency of tracking catastrophic damage\nHurricane Michael went through in called massive amounts of a devastation along the Florida Panhandle uh as well as moved through southwest Georgia last night and continues to push its way through South Carolina in North Carolina as we speak\nThe national Hurricane Center says the tropical storm will move into the Atlantic ocean later tonight initial damage reports from western Florida suggests widespread devastation from member station WFDD Dolores ... has more\nI'm inside one of the day that places in Dade County they eat in a fortified wall of the emergency operations center could not walk the town of this strong wind battering\nEverything in sight when Michael pat when it was calm enough\nTo lift the hurricane battered for just wandered stepped out tied for the first time trying to process what did you happen and then you're having trouble contacting their families and we felt service and power it they'll down but that hasn't stopped reports of buildings in home came in\nAnd everyone ... loved one for NPR News I'm Delores inkling in Panama City\nNow that the ugly booster rocket carrying an American astronaut and a Russian cosmonauts failed during lunch today the crew was forced to make an emergency landing in Kazakhstan\nThe two crewmen had a very hard landing but ... says they are safe and in good condition photograph taken after the landing show the men sitting upright on those as having their blood pressure checked\nStock markets in Asia fell sharply overnight with stock exchanges in both Shanghai in ... in both tumbling more than five percent\nAnd bears Rob Schmitz reports they were influenced by yesterday's plunge it on Wall street Hong Kong counseling\nIndex was down nearly four percent on the mainland the Shanghai composite for more than five percent and the ... composite plunged nearly six and a half percent in Taiwan the tech heavy tie extra up more than six percent which shares of lens maker an apple supplier log on precision tumbling nearly ten percent\nMarkets elsewhere in Asia also fell sharply\nMeanwhile the price of major crypto currencies including bitcoin plunged with Thirteen billion dollars worth of value being wiped out and just a matter of hours\nOn Wednesday President Trump blamed the Federal Reserve for raising interest rates despite market turbulent calling Wall Street fell off a long awaited correction Rob Schmitz NPR News Shanghai\nSell off continues on Wall street the Dow Jones industrial average down two hundred and Eighteen points the NASDAQ is down forty to the U.S and the five hundred is down twenty thing this is NPR\nFederal authorities say they arrested and charged demand in New York with making a huge bomb in his home federal prosecutors and the FBI allege Paul Rosenfeld planned to bomb the national mall in Washington D. C. authorities found that two hundred pounds\nAnd the FBI alleged Paul Rosenfeld planned to bomb the national mall in Washington D. C. authorities founded two hundred pound bomb in his basement the officials allege Rosenfeld intended to kill himself in any random politicians he happened to strike along with civilians\nCatholic bishops in taxes are promising to release a list of old pre credibly accused of sexual abuse as Laurie Johnson of Houston Public media reports parishes are expected to release the names early next year\nThe Texas Catholic conference of bishops since the list will date back to at least Nineteen fifty and will include names of priests who have been credibly accused of sexually abusing a minor\nCardinal Daniel ... the archbishop of Galveston Houston set in a statement the decision is a response to calls from Catholic laypeople for greater accountability and transparency\nDinner to also leads the U.S conference of Catholic bishops and has been meeting with Pope Francis at the Vatican to discuss the nationwide sex abuse scandal\nAll Thirteen hundred twenty parishes in Texas say they will publish the names of acute clergy by January thirty first the bishops also pledged to update the list when new accusations are made for NPR News I'm Laurie Johnson and she used in\nThe U.S energy administration said heating costs will rise this winter along with fuel prices home heating oil users will pay an average twenty percent more this season or about Seventy dollars on corporate Coleman NPR News in Washington\nSupport for NPR comes from NPR station other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and it was about who they're premiering October twelve on prime video\nWe're back with high plains morning on member supported high plains public radio welcome to our two of our second day just to to ah of the fall membership campaign here at high plains public radio this is the time were a couple of times a year we come to you to let you know hey\nThis is your public radio station it does not exist without your support without your help and so many inspirational people step forward\nAnd put up their money on the line and keep it going and we want the next person to be you one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org so we can keep doing what we do here at high plains public radio\nThanks so much for being with us I'm Jenny ends or a low I'm your host and music director here at the station I've got skip Nancy any live in the studio is Thursday it's my favorite day and skip we're going to have your segment growing on the high plains coming up at ten thirty central\nGood they're good and I love I Love how the ones that we do during our membership campaigns you always tight and the uh the active growing the active nurturing something beautiful and taking care of something and and and being the person that water that feed that watches that pension the leaves print that\nUm and and encourage them to grow you tie that ride into what it is that we do here during the pledge drives yeah\nWay are we are doing all those things right now but only with your help the listeners help ah we need to hear from you and what better time to hear from you then when you can get your money doubled\nSo if you want to give us a hundred bucks it'll become two hundred bucks a thanks to double al transport\nIt's they have been so supportive over all the years I've ... I can remember hearing their name from the very beginning a and they believe in what we're doing we I'm not saying just you and me to any but everybody listeners and a supporters\nAnd they believe in what we're doing we I'm not saying just you and me journey but everybody listeners and a supporters of all shapes and sizes and places um and so they are for this morning\nA for the rest of this morning or looking at a matching your dollars [noise]\nUm and it would be a full match so if you give fifty dollars it becomes hundred if you give a hundred dollars and becomes two hundred\nSo please say thank you to dory in Dennis lap of double ... transport for all the years that they had supported and they're still in their supporting and doing thank you so much one eight hundred six seven eight seven four four four is a way for you to call and say thank you\nBy making a pledge of any any side so you can also go H. P. P. R. dot org if you are so inclined\nAnd we are looking today for new members the station cannot continue without getting new blood new folks that are going to uh put up for their public radio station if you already are a member and you want to add to get if you want to increase your sustaining membership\nThat is also something that helps so much but we also want you to encourage those you know who you have discussions about high plains public radio stories and content all the entertainment all the wonderful music for the station brings\nMade me\nAngry\n\nVe things and\nThe main main\nMm Mm Mm\nThe murders ... by ... maybe ...\nAnd after all was said and done battle had been focusing on the streets soldiers ... wanted to go ...\nAnd actually been been meaning to read you know\nNot the only fear of a server\nAnd after all was said and done battle had been followed through on\nThe rich and ... wanted to go home mhm\nMm he will do is ... ... we did in New York\nIn ... the low new rewrote the law or\nLate ... that's a good\nThe new by shooting a child who is\nSo many others didn't\nMe more than that really made a bright user shatter um\nEach other and try\nWas said and done that'll have been followed through on a mission to\n\n\n\n[noise] you're tuned into high plains morning we just heard will be laid off his album gala event and I love old unknown singer songwriters and then someone reissued some old album from the seventies love at Nineteen Seventy one that was summer color skin\nValerie June before that offer most recent release the order of time that was with you\nThat would offer new album the long road that was painted lined we just welcome back to the high plains\nOr for a living room concert about this earlier when what that that was on the twenty eighth of September and we're going to try to get her down in Amarillo in twenty Nineteen we started off that short that with Harry kinda juniors dance of the sugar plums ferries skipped man see any it is just about time for your program\nAnd uh that sugar plums very song was pretty good huh\nIt was pretty good and it was a clue [laughter] just something that I just kind of decided on the spur of the moment here today we need to get the phone ringing we need to make sure that folks are and they're started ringing [laughter]\nAnd I don't even know yelled ... we'll see we'll see um but anyway we do need you to call we need you to call for several reasons one is to support the station that you love otherwise you wouldn't be listening to me you must love what we're doing here somehow or another is to take advantage\nOf a wonderful match a\nThat is being made for your money or with your money a double L. transport and the Oklahoma Panhandle it's been a long time supporter ever since the very beginning I can remember hearing their name\nLong long long time ago when we were all than wouldn't this be a great thing to do\nAnd being over in pure Seville and the little school the where the roughly ... and you had to put him over the equipment to keep your eye [laughter] those were that age yeah and double L. is still here and they are still supporting and not only are they supporting\nWith their own contribution but they want you to support too so they're going to double your money\nThis is how they do it the ... everyone does it yeah and it is going to be for a this morning during uh during the show until noon or you can get your\nMoney your membership your renewal your new membership pure additional here it is you don't get from the ... right they will double that\nAnd so we want to thank them Dorian Dennis lap from ... transport now's the time to call in and double your money that way also announced the time to call in [noise]\nAh because I just kind of decided at the spread of the moment\nUm\nI put up sandhill plum jelly this year and that's a real special thing because sometimes you don't have sandhill plums and most people don't have sandhill plums but\nEven in our listening region most most of the folks at the high plains don't have\nIt's it's kind of you know like western Kansas up into Nebraska down in around New Mexico and maybe down into\nYou know like western Kansas up into Nebraska down in around New Mexico and maybe down into Texas a little bit but it really is kind of where we live and where we listen and so and some years are the sandhill palms freeze out and so there aren't any\n... but it is an incredible taste and an incredible experience to have real homemade\nFrom the territory sandhill plum jelly and I was able to put up about a dozen jars and I'm going to take about half of those\nAnd give them to you if you will want to call in\nOne eight hundred six seven eight seven four four for ... we're going to take the next we'll say five calls and we're going to be playing my show my fundraising special show a while you call a and we will see if we get some phone calls coming in\nAnd you will get your pledges if you make a pledge you will get it doubled by double will transport and\nYou will also get if you're one of the first five you will get a a jar of sand he'll plump jelly if I can I'll deliver it but if it's not in my area somebody else will deliver it or will ship it but now's the time because next year there might not be any [laughter] very true one eight hundred\nSix seven eight seven four four four is the number or Web in your pledge an H. P. P. R. dot org during growing on the high plains which is going to be up shortly we've got just a couple of minutes left or going to start that\nAgain get your dollars doubled right now this is such a sweet time pun intended um you've got this hyper local extremely rare\nHand made our ... skipped man see any what do you call it it is it jarring when you do jellies your ... jams and jellies ... letting everybody know canning and preserving I Know that I've seen it on the front of a garden book\nAnd this is this is such a treat this is something that is I'm going to encourage you to give the phone a ring one eight hundred six seven eight seven four four four next five callers gonna get a handmade sandhill plum jelly\nYou know you can't go into most grocery stores and buy that stuff they just it's just not there sometimes they if they if they feature Kansas products they will have it for a very brief time so this is your chance it would make a great Christmas gifts for somebody's across the country that doesn't know about than they'll plum jelly yet a\nIt would be great to just hog it all for yourself and I won't say anything about that either one eight hundred six seven eight seven four four four\nAgain an eight hundred six seven eight seven four for for this is such a wonderful time to call\nUh but um some years you don't have that and the gamble yeah yeah\nHow how often do you say um your you have something in your yard right yes now how often what do you think your percentages where it's like yes we had a really good into plum a season versus\nThis year I did pretty well but I also had people see people saved their plans for me and given to me that sometimes Oh thank you very much Linda for giving me and you'll find that I made jelly with and now I'm giving away that the next caller is on it and that speaking of that we we did for um\nDuring that during the show I had four we had four colors and they're all getting a jar yes and they're all happy about it but I had planned on doing five jar so\nHere it is I've got one large are left for the next caller one eight hundred six seven eight seven four four four if you want this very special\nArea treat special area treat and he'll plump jelly and they get all ... and you also get your ... your dollars doubled yes yes\nAnd like I said before I Will delivers many of them as I can but if it's somewhere where I'm not going to be able to get to you or we will have somebody else delivered or will ship it to you\nOne eight hundred six seven eight seven four four four there's another jar on the line folks and you know what the sweetest thing about this the sweetest thing you can do is get your dollars doubled one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nI'm six hundred and sixty dollars left on this matching challenge I'm so thrilled that you're alive in the studio with us um so we have you said we have do we get all five\nI think so uh I'm thinking that yes we did she is nodding her head\nYes okay wonderful so we got rid of some sandhill plump jellies out of your cupboard yeah that's so fantastic right gosh\nBut we still have money to match you do have money to match a and so if you have not yet called and a pledge support maybe it's a new member or if you're a new listener new to the area or maybe you are\nYet called and a pledge support maybe it's a new member or if you're a new listener new to the area or maybe you are an old time listener like me and like double oil transport folks a\nThan a you can get to you can get your money matched if you want to do an additional pledge\nWhatever uh you know if you want to give an extra ten dollars is going to become twenty so now's the time to call one eight hundred six seven eight seven four four four if you are listening there to Jenny and all of her wonderful effort if they if if her morning ... get you going and keep you going\nAt work or at play a then call one eight hundred six seven eight seven four four four and pledged you support and tell us about you and tell us why you listen and what you like and what you don't like let's see if we can fix I\nParticularly like the ... what you don't like I Know that experimental jazz doesn't fly on high plains morning I get a bunch of oh what is this and I was like okay I'll I'll work on that that means you're listening that means you're listening we want to take a minute to say thank you so much to everyone who helped chip away so significantly at the matching goal thanks so much to a gym of Hays\nDerek of dodge city and of course we're excited about dodge city right now we've got K O and Q\nA with the new ... new trends that are out there we are going to have high plains public radio coming straight out of kale and Q\nAnd a I'm going to do a post about that there's so much this has been something that's been in the works for five years now\nUm high plains public radio it's strong because the people who hold it up are strong and they call an eight hundred six seven eight seven four four four and they go on line to H. P. P. R. dot org during these membership campaign and they put a little extra and and you know what we need some new members we need people to encourage those who they care about\nUh that are listening we want to thank our listener in New Mexico we want to thank our listeners all across the region and outside of the region the thank you so much we got that a sand he'll put on but we still have six hundred and sixty dollars left on his match so how about we do a little more music\nOkay and then after that music will uh we can announce some of the names of folks who\nThe jelly people the child and uh when I Know them the jelly people yeah a couple of other uh folks didn't want their name a rather than we can do that we are very happy to rather we cannot do that we can not do that yes the negative I still think you we can absolutely thank\nYou yes All right to support for high plains morning is provided by pioneer communication offering high speed Internet an optimum fiber to the home service with speeds up to fifty megabits per second more AT T I O n C O M M dot net\nAnd by Amarillo College enriching the lives of our students and our community Amarillo College on the Web at a C. T. X. dot edu\nNot to mention the ... civic center presenting the national tour of the Broadway musical Jersey Boys Tuesday through Thursday October sixteen Seventeen and Eighteen seven thirty PM at the\nUh Amarillo civic center auditorium panhandle tickets dot com also I got to speak to someone on the cast of joys the boys so we'll have a chat with Cory green and tomorrow live on high plains morning\nAll right we're going to keep it real unless you can de Rawlings machine here that to be young is to be sad is to be high on high plains morning\n\n\nKnow I went in the air around\nAnd I went in the\nGet and the boy\nOh\n\nAnd\n[noise]\n\nJohn\n\nNa\nNa\nVe\nI\nYou guys\nAnd\n[noise]\n[noise]\n[noise]\n[noise]\n\n... ... ... ... ... ... ... ... ... ... ... ...\nOne man or woman and the reason why we're\nNot will ... will do they know the law you know it well but do we didn't have a ... oh man\nDollman live ... oh well you know but to me I didn't have a burden that bomb man I don't know that is\nSo new ball\nThat ... vote is no longer go to Jerry narrowed down in Georgia ball that your phone he went on the road at yeah yeah\nMm Mm Mm Mm\nWhen I went to my window now when I was with them I Know I'm In my life\nOr whatever so we just going to say thanks for it thank you very much and this is a person from Garden City who's also getting some jelly\nAnd I'll probably be able to get that to you because I live close to here and then we have this is the one that just knocks me out here uh we have a shy person or a person who doesn't want his name right on the air from Kalamazoo, Michigan wow [noise]\nAnd um he is here working on wind turbines at near beaver Oklahoma ... Atlanta get some jelly thank you very much that's so great thank you all so much for your participation\nIn that last hour it ain't over yet we've got five seconds left at this hour call eight hundred six seven eight seven four four four new this next and another hour of high plains morning\n[noise]\nBy there and this has been with weapons exactly one hundred years separated Fox be minor mess and be so much for the grounding achievements of two distinct your is this week could exploring music the bridge those worlds as we pose the question\nHow do we get from ... to be the way\nThat this week on exploring music [noise]\nWeekdays at noon central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da ... service of high plains public radio available everywhere on line at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support\nLook under the support tablet H. P. P. R. dot org for details\nLive from NPR News in Washington I'm neuron the White House is offering reassuring words about the U.S economy as the stock market tumbled for a second day NPR's Scott Horsley reports the administration also defended the president's comments at the Federal Reserve has quote gone crazy\nWhite House economic adviser Larry Kudlow echoed the president's saying stock market volatility is not unexpected after a long period of steady gains speaking to reporters in the White House driveway Kudlow stress positive economic indicators those include low unemployment and rising corporate profits\nMe I'm betting on the U.S economy as I said I think our economies are so good and so strong right now I Will share Kudlow axiom profits or the mother's milk stocks\nKudlow says the president was simply sharing his opinion that the Federal Reserve has been too aggressive and raising interest rates he insists Trump was not trying to compromise the feds independence Scott Horsley NPR News Washington\nTropical storm Michael continue the way across the southeastern us that storm is moving into North Carolina which sustained wins nearing fifty miles per hour NPR's Jake Harper report\nThe hurricane was downgraded to a tropical storm overnight but the danger is not over Michael continues to send heavy winds and rain across the region causing power outages and possible flash flooding the national Hurricane Center says tornadoes or possible in parts of the Carolinas and Virginia\nAnd storm surge watches in effect along the north Carolina coast where water's could move inland and reaches highest four feet the center of the storm is still moving north east and it's expected to intensify tonight as it heads into the Atlantic Jake Harper NPR News\nSpace flight community is reeling from the failure of a Russian rocket during a routine launch to the international space station NPR's Nell Greenfieldboyce reports the astronaut and the ... were unharmed since the space shuttles retired and twenty eleven now that has relied on Russian rockets in space capsule to get ...\nFor not end the ... were unharmed\nSince the space shuttles retired and twenty eleven now that has relied on Russian rockets and space capsule to get asked shot to and from the space station it's the only way up or down for people this time the rocket blasted off from Kazakhstan and the transmission from Russian launch controllers seemed normal but then [noise]\nAnd they come in and put five ... of\nThe capstone me to sudden rapid dissent NASA says there'll be a thorough investigation no new crew will be able to go up until that says resolved\nThe failure comes just after another problem with Russian space hardware caused alarm that one was a hole in a capsule that let air escapes from the station no Greenfieldboyce NPR News\nAnother earthquake struck Indonesia today and measured sects and shook the islands of Bali an job of official say that three people died [noise] stock prices continue to fall at last check the Dow is down a hundred and forty five points the S. and he was down Nineteen and the NASDAQ as down three this is NPR News\n\nThe head of the international Monetary Fund is urging countries to de escalate their trade conflicts Christine Lagarde spoke as the IMF and the world bank began their annual meetings of the nation island of Bali in recent months the U.S and China have imposed tariffs in the hundreds of billions of dollars on each other's goods\nAnd American being held at Israel's international airport appeared before court today to request should be allowed entry to the country Israel demand she apologized for her past supportive a boycott against Israel NPR's Daniel Estrin reports\nTwenty two year old Laura taught them has been held at Israel main airport for more than a week since she chose to appeal her case rather than be at home\nShe had a visa to study in an Israeli human rights program but Israel denied entry and said she was a pro Palestinian activists supporting beating yet boycott development and sanctions against Israel she'd already set in court she no longer support that Israel says if she apologizes it might let her in the country\nHer lawyer Laura ... says she won't do that\nEven if she is not a supporter of PBS she is not willing to say that it's an illegitimate listening for other people to support\nThe judge has not yet ruled and I'll call them continue to be held Daniel Estrin NPR News ...\nVisitors to the crop all is the most popular tourist attraction in Greece are out of luck today it's close by a strike workers cold at twenty four hours strike because they fear some landmarks maybe sold under an added privatization fund created as part of Greece's international bailout officials say historic sites won't be part of the program\nI'm Durham NPR News\nSupport for NPR comments from NPR stations other contributors include the Jacob ... last foundation supporting the health and wellbeing of underserved populations at ... dot org and the John B and Catherine the MacArthur Foundation Mac found dot org\nLet's say we'd say All right if it will be D our three or on a high plains morning right now and high plains public radio thanks so much for it stay in tune and sticking with us hope you're enjoying the music I'm Jenny ... I Am joined live in the studio by ... and she's she's Thursday royalty here on this program\nI we all get to know her so well through her traveled enter travelogue and her garden logs and we get to hear about the roses and the roots and the plant things and word donkeys and the dog ... [laughter]\nI Love them donkeys and ... those donkeys are right here in my heart side by side but thanks so much for coming in and always lending your time and talent too high plains public radio\n... ... those donkeys are right here in my heart side by side but thanks so much for coming in and always lending your time and talent too high plains public radio you are one of the original you are one of the people that got that stuff started and thank you so much for being here to keep it going\nWell you are most welcome and I think it this is this is the best of all good causes hair high plains public radio if this is something new to you uh we've been here for almost forty years it's it's moving on\nUm in terms of the calendar and time we've been here a long time and we want to be here even longer we can do that if you want to call one eight hundred six seven eight seven four four four or go on line H. P. P. R. dot org and let us know that um\nWe can count on you\nTo be a supporter but you know not just in money\nBut and listening time we need you to listen we need you to comment we need you to be a part of the family\nOf this station this is such an incredibly different station you talked earlier Jenny about friends that you have across the country that say why I I used to live there but now I don't but I still listen and I you know when we travel when my husband and I travel or when we talk to family and friends\nIn California are back east in New York\nWe have we have people and near Boston in Massachusetts that listen we have people in Manhattan that was and we have people in San Francisco area that listen uh\nAnd it's something different for them I mean they say we don't have this and I wish we had this so this is a very special place\nAh this this public radio station and you are very much a part of it by supporting once a year or whenever however you want to do it a one eight hundred six seven eight seven four four four and what's most important about your contribution now is that if you give anything at all\nIt will be matched you will double your money because of double ill transport dory and then the lap\nOr in the Oklahoma Panhandle they've been here since the very beginning they're still here there's still listening they still want you to listen one eight hundred\nSix seven eight seven four four four is the number to call to just be welcomed and joined this family um you know being an advocate for the station like those people like the ... that are putting up their money to encourage you to make that phone call\nAnd then the men\nAnd women and men [noise]\nAnd food [laughter]\n[noise] Mm\nMhm\nMhm Mm and there and\n[noise] and [laughter]\nAnd then we all\nThose things to do\nAbout buying now than I thought oh my\nYeah [laughter]\nAnd the guy [noise] and you know we don't want\nTell you not only you know what to do the business and I'm always gone up by ... ... talk about all\nDo and\nYou know I'm I'm okay [laughter]\n\n\nMhm\n\n\nMm Mm Mm Mm Mm [noise] I'm\nLeaving Mad Men they [noise] they should have bad that they [noise] they ... they ... they [noise] they do bad things on the ... and\nHe gave me a little you know Julie ...\nWe're going to\nDo to that the mom bigger than the best buddy [noise] maybe the bed and then they can be done right\nTo ... billion a lovable and you know\nYou are the jobs are leaving did you do have a little your dream in the\nStudents look when you know\nNeeded a man that the\nThey did it a bad man I mean you know [noise] maybe it is a bad man but he really be a\n\n\n[noise]\n[noise] um\n[noise] maybe ... that are [noise] Mm [noise] [noise]\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nI think public radio has a unique personality one that reflect the personalities of its many listeners in that community a blizzard that makes public radio possible on the high plains radio then foreign educate and inspires\nThree regional national and international news in through an eclectic mix of music knew the music you won't hear anywhere else\nIf you have gained knowledge and want to help grow that's amazing community of listeners gifts today at H. P. P. R. dot org\nHey Brian bureau here hosted punk and disorderly on high plains public radio this weekend I'm putting together a special episode ... punk rock ...\nWe'll hear from pairs the vandals fiber no effect on lots more do come hang out with me the Saturday Night at midnight central right here on HBO\n\nMuch central right here on a tree Peoria\n\n[noise]\nThanks so much for his day in junior high plains public radio this has high plains morning and we just heard what did we hear we heard some blues we heard Chris Isaac with a baby did a bad bad thing we like to sing that to the cat skip\nA credence Clearwater revival that was I put a spell on you we started off in both cases in Memphis friday night it is Thursday it is time to celebrate high plains public radio and skip we have six hundred and fifty dollars left that we need to knock out this hour and it's getting close to the end we've got thirty five minutes not even\nA left on the clock and we got to knock the six fifty out so folks if you've been holding on if you've been waiting this is the time to get this money doubled one eight hundred six seven eight seven four four four do it for the music do it for the community\nBe empowered to keep your public radio station strong you can also wedding at H. P. P. R. dot org that number again eight hundred six seven eight seven\nFour four four we have one person that has it has called I they just hung up and we're writing that one up a and their money will be doubled\nBut we have money left and we really need to use this ah we're we're down we're down to the wire folks yeah we need to get this money\nA spoken for men your name one eight hundred six seven eight seven four four four because after twelve we lose the money so we don't want to lose that money if you are listening or if you are supporter whether it's been all these years with me or whether you're a brand new to the area or a brand new to\nTo just the radio station have been here before but never knew we were here this is the time to get acquainted this is a time to get to know what one eight hundred six seven eight seven four four four don't let them loot six hundred and fifty dollars please yeah that would be a crime [laughter] and\nO transport is or what if they're one of the underwriters that have been there since the beginning they have every year renewed these are people that are kind of the bedrock of keeping it going there there there are things in our lives that are reliable and stable that you can count on\nThat you can tap that you can make sure that there's something there when it's needed and these are ... these are these are tough weird time in the in the public broadcasting world as\nI'm sure you're aware a if you listen to NPR you know that if you listen to public radio community radio even higher education a lot of the different community colleges that have radio station it's just a little tentative right now we need people to come forward\nWe need people to stand up and say no you don't have to worry about it I'm going to show up with my pledge of support especially being inspired by\nA Dorian Dennis ... of double L. transport that just want to put their money up as well and say look\nWe're going to put up this it was Fifteen hundred dollars total we're down to six fifty on that and this is the time to call we've got Fifteen minutes left um of this show I'm not fifty and I'm Sorry what time is it\nHey we've got thirty thirty two minutes left\nGosh somebody some lunch skip I mean from Santo plum jelly [laughter]\nUm so we're we're really counting on you right now to stand up and you like you said get acquainted with high plains public radio with your pledge of support an eight hundred six seven eight seven four four four\nOr go to H. P. P. R. dot org that one phone call what ever pledge amount you make you become a part of that bedrock you absorb right into the foundation and you say\nNo you don't have to worry about losing public radio in the high plains because I'm going to put up my energy\nYou absorb right into the foundation and you say no you don't have to worry about losing public radio in the high plains because I'm going to put up my energy and my talents and my money and do you own\nPart of the station then you know you become an owner when you make a pledge\nAnd um and we will support you and\nYour interests as much as we can let us know what you think let us know how we're doing but you have to a call in one eight hundred six seven eight seven four four four in order to maintain this you know I mean granted you could listen for free you don't have to give money\n\n[noise]\n\n\n\n\n... or ...\nI have sealed beef ... bowl water up your children are being put on blue\nMy breath and one ... do you\nLive ... miles in the sun buddy wide and bring\nA\nI have learned that the national or\nA bicycle or on a\nBut I bet it's a ... minute show what us while those\nRelated to the border to build a\nBird at all the way the law I Love new like\nYou're the nearest thing\nTo you or the nearest\nA I had a store or at least ... below\n... or\n... or a\nI'm about a year the year is\nTo be a a\n... or ... or\nI have watched the silver range from all the word I took the day there\nWas ... I Love the Rudy low\nBudding and on the line with us here is a thing\nA\nI have sort of ... so I'm In law\nMy learn uh\nA or a\n\nJohnny thank you so much I really appreciate that complement that with your the nearest thing to have then Johnny Cash for that Elvis Presley given like X. than never\nThank you so much I really appreciate that compliment that was your the nearest thing to heaven Johnny Cash for that Elvis Presley doing what ... never been to Spain\nBut he's been to Oklahoma as has skipped man see any who's lived at the studio with me right now we started off with a a\nTexas Panhandle area ban honey house of their album medicine lodge that's on was called Kansas how high plains does it get folks also I got two new albums from honey how\nThings to Mr Mike fuller for bringing those over we uh we are so pleased today we are chipping away at the school but we need your phone call next to get us there before the top of the hour we got sixteen minutes left skip\nFor folks to call one eight hundred six seven eight seven four four four and get their dollars doubled thanks to double ... transport a dory and Dennis lap\nOkay and uh it's getting down to the wire and now\nIt's uh getting time to make the call and vets are being placed here at at the station on whether or not we're going to make this we've got to make it we got to make it come on guys we try to make it and we have lots of calls but uh we um we need more and we need some more because we're not there yet\nWe've got a ways to go we have a four hundred and five dollars left\nTo raise and we've got about Fifteen minutes in which to do it so somebody needs to call in [noise] excuse me\nOne way one eight hundred and six seven eight seven four four four I'm going to say that phone number will skip costs what eight hundred six seven eight seven four for for for you to get your dollars doubled and really support high plains public radio and especially the music you listen to on high plains morning\nYeah we need to thank some folks um we we need to think a couple of people who really don't want their name\nSaid on the air but they want us to know that they are supporting and\nOne of them is from ... from uh Amarillo, Texas and one is this is great Fort Collins Colorado My aunt lives in Fort Collins come on our yes yes so much Colorado and a Amarillo much and then we do have some books we can think we can thank Pete Sessler from Greensburg\nThat's right on the edge of a of our area here too and we thank you so much\nA weekend sank Allen Abraham and Amarillo, Texas Alan and a lot of these folks have nice comments about high plains morning and how that really makes their day and makes it makes things easier for them uh Dolores cold from Amarillo\nAh called in and uh gave an additional pledge and we thank you so much for that\nAnd forest green from gauge Oklahoma we got a lot of Oklahoma folks down there today and I'm I was born in Oklahoma so I feel really good when we get an Oklahoma call but we need to make this we gotta do it for a hundred and five dollars the phone has been ringing that I don't know if they're all pledges or if it's\nBusiness called and things like that so please call if you can if you will you must\nOne eight hundred six seven eight seven four four four also hearing that people tune in and enjoy the music in the morning on the high plains morning really it's just like a\nHot bowl of fresh tomato soup with a grilled cheese sandwich dumped in it with them eat um and some like melted laced with you know we are so so thrilled to hear these\nAre folks that are fans of the music calling in during this program one eight hundred six seven eight seven four four four or H. P. P. R. dot org while I'm placing my bet I'm placing my bet that we're going to do it together so we've got\nThirteen minutes left to get to the end of the school one eight hundred six seven eight seven four four four or eight people\nLet's get so we've got oil Thirteen minutes left to get to the end of this goal one eight hundred six seven eight seven four four four or H. P. P. R. dot org thanks so much to our ... thanks so much to those of you out in Hasan dodge Kansas New Mexico what was that what\nGreenberg Greensburg Greensburg whereas yeah I'd I'd go on going toward Wichita and got out of dodge the through Kansas the way you all ...\nAnd um and of course Fort Collins Colorado Colorado and that's our second Colorado call today so that's great excellent lots of lots of people in lots of places are supporting our efforts here and there your efforts to you because you're an owner in that once you make ... once you make the pledge you rent owner\nAnd yeah we proud of that and right now doubled your pledge double it double\nAt one eight hundred six seven eight seven four for for twelve minutes left in this hour I'm going to keep the music going I'm gonna keep eating it up or how about we do a song that is the ultimate sunk a call into will do electric light orchestras telephone line and I get that number one more time\nOne eight hundred six seven eight seven four four four to double your money one eight hundred six seven eight seven four four four get those dollars doubled let's knock this thing out of the park\nOr do little double L. transport get inspired by the books in your community they might not be down the street but they're out there and high plains public radio and they're right inside our hearts here the electric light orchestra\nTelephone line on high plains morning one eight hundred six seven eight seven four four four\n\n\n[noise]\n", "year": "2018", "show_name": "High Plains Morning", "city": "Dalhart", "day": "11"}