{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nYou're listening to the Arizona community radio network on kj ca eighty nine point I drank cage ACP Ninety put one Prescott and kj decay Ninety point seven king when\nThe AC alright whether generator for cash overcame but that law to go to Gary overnight mostly Claire either go to people like Russ get broken belly Chino valley cooler temperatures like forty five degrees part with a lot of guys that are Williams like that and the ... valley who included I Do think thirty seven or whether center that you're getting\nSupport for the Arizona community radio network is provided by came in regional medical center fall means cooler temperatures football and the flu\nThis flu season get vaccinated help protect yourself and the most vulnerable members of our community ask your currency provider if the flu vaccine is right for U. K. R. M. C.\nBy the public radio programs you enjoy that and for middle aged editor Jane logo to June in radio dot com that church for ... at the Arizona humidity radio network that looks at any time on your smartphone\nWelcome to the global village first time\nTime in the whole village we had to the Dominican Republic sharing half the island does his Daniel ... eighty\nAnd renowned for its the ... stone music will highlight a wide array of different sounds and artist from the Dominican Republic this time in the global village that we're getting underway with one of the popular writers to come from that nation this music from the least luggage since we began this visit to a whole\nHe can\nBring to the table\nLow when all the other\nThing is you know I Am going that route\nThen\nUp to\nMe that's why they have I\nKnow\nTurn out to\n\n[noise]\n[noise]\n\n[noise]\nBut I don't\nNot that bad but I don't\n\n\n\nNot rich\n\nHa\nHa ha\nHa ha\n\n\nHa\nHa\n\n[noise]\nNow\n[noise]\n\nBe\nTo the\nYoung young kids da da\nI didn't know does that make me feel like I Know my dad\nGo again\nDidn't\nKnow what I'm Talking about the way up\nMan you know what I mean I Love to put them on the line\nTime that I'm not downtown\nDa da da da\n\nDa\nDa\n\nDa da da da\nDa da\nDa da da da da da da\nDa da\n\n\nDa da da da da da da da da da da da\n\nDa\n\n\nMcGahn\n\nHi letting some sounds from the Dominican Republic this time here in the global village and now we actually yeah up in New York City before we were done\nI noticed there by the name of ... originally from the Dominican Republic has made a New York home and they inspired both by\nLaw music in the home country and that Cuban music put together its own group and he was one of the artists featured on a Smithsonian Folkways collection it's part of their global lead of the boroughs series it highlighted to world sounds from New York City a release called cat scans and they'll send\nOne needed a song from ... and and some of the big names of music from the Dominican Republic you on ... on all we heard right in front of cocoa Mirren son from his album the Duke of the chapter\nOne of the uh popular but try that are the one we should get it done something a little bit different though they're from the full right to help them we heard last time he talks and least markets also something a little bit different from him but it really neat song called ...\nThat coming your way here in the global village on cruise time and after a quick break we would turn\nWith a wonderful jazz artists to his come from the Dominican Republican not added some ... different influences and to the sound of Latin jazz well hear music from the sun tan album from Michelle ... below and his trio the title track when that he wrote that is coming up next right here in the global village\nWhen you can't get bored or are you thinking when he am in Yemen on your radio catches on line that border radio ac dot org or you can use to tune in at ... ... s a\nToday's border radio days sponsors ... art center announcing the Eighteenth annual tribute of the muses award ceremony this Friday evening October twelve at seven o'clock in the historic human theater the words will be followed by the id black tie reception with live performances hors d'oeuvres and silent auction at the ... center tickets that you must show tickets dot com\nMostly clear tonight in Yemen low around sixty six degrees with up to twenty miles per hour from the south\nTomorrow mostly sunny but the high and you're eighty four in Kingman tonight isolated showers partly cloudy skies low rent fifty five degrees tomorrow scattered showers mostly sunny a high and you're Seventy two in Prescott tonight isolated showers partly cloudy skies low around forty four tomorrow fifty percent chance of rain but partly sunny skies\nAnd you're sixty one isolated showers in Flagstaff tonight partly cloudy low around thirty five tomorrow forty percent chance of rain partly sunny on your fifty three ...\n\n\n\nDa da\nYou think you need to\nBe able to do when they do need to do that they need to do anything to do to be\nThe big doo doo doo doo wop\n... ...\n\n\n\n[noise]\n\n\n\n\nGod [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nDa da da da\nDa\nDa\nDa da dun Potegal originally from the Dominican Republic who is the key figure in the sun you label that helped to shape the sound is Elsa Carter that find your all stars and did a number of recording thunder so name as well so any particular with el ... her to music from\nSo neither laying off from their album who has rhythm and say drawing rooms and influences of Cuban Puerto Rico and the Dominican Republic we heard in the corner from them and also from the Dominican Republic Michel ... and his trio doing one of his own competitions suntan from\nThe album of the same name as we're highlighting some sounds from the Dominican Republic this time here in the global village Rebecca minute with the adventurous sounds of steel Mara fortuna that's next stay with us here in the global village\nThis is Thirteen twenty I'm bored or radio K O at bay and border radio easy ... or a service to Arizona western college are more than forty five years border\nRadio is supported by ... hosting the Rio de surveys of Bruce ... start over twenty seven from five to nine at desert sun stadium celebrating craft beers from around the region in a party atmosphere featuring live music food vendors and the cool ride the humans motorcycle showing John information and tickets at Rio de survey so dot com\nA brochure first\nProduced by the Arizona how we department in Nineteen twenty five Arizona highways they bombed into one of the most respected and revered publications in the world doing K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November separate from five thirty seven and St Paul's cultural center for information does it K. A. W. C. dot org this has been made possible in part by a grant from Arizona humanities\nI don't think I mean one of the people who want to be going in one of the middle of the la la la la la la la la la la la\nLa la la la la la dot com\nThat going on with all of it\nOh yeah the ball\n\nOh whoa whoa whoa\nWhoa\nOn\nThe people may not hold on a\nI was on my own all\nDo man la\nDa da da\nDa da da da da da da\nDa da da da\nDa da\nDa da da\nDa da da da da\nDa de\n\n\nDe\n...\nAll the guns blah blah blah blah and\nThen you know we're a three\nYeah they all were da\nDa da dum\n\nLa da\n\nLa da dum", "year": "2018", "show_name": "Global Village", "city": "Kingman", "day": "11"}