{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nWell you've heard it here first north rip Oregon at the University of Minnesota which never sounded quite like that before dean Bill Maher their explored it's dynamic and color variety in fantasy by Harold dark\nI recorded him in performance just a few weeks ago in the reform added auditorium space or through where the instruments will be officially inaugurated on the twelfth the thirteenth of October\n... evening concerts with the Minnesota Orchestra and appear Saturday morning an afternoon show do explorations of the instrument all by itself\nYou can't make these October concerts to plan ahead it'll be a silver was cited by Nathan ... on Tuesday December the force\nThis is an instrument of compelling qualities\nAnd you can rediscover it and it's new circumstance I Hope to see you there and you can find more details with pictures in specifications all pipe dreams dot org this program Eighteen forty\nPipe dreams are supported by ... ... s alright total pipe organ resources very Pennsylvania\nBut Patrick James Murphy and associates incorporated ... Pennsylvania\nMembers of a poll by the associated pipe organ builders if American a collaborative of designers creators and maintain has a pipe organ found in religious and educational institutions concert halls and residences throughout the United states and beyond\nThe scope of resource guide and member perspective is available to you have a P. O. B. A. dot com continuing supported pipe dreams is provided in memory of Wesley seat doubly by his family\nAlso by grants from Walter McCarthy Claire you'll end and the grey stone foundation\nBy ... I'll be happy for Family Foundation or the Arjun Martha camera fall under the age are key foundation in celebration of the life of Martha hulings camera and by listening contributors to this public radio station\nBut we've been exploring what's new I Hope you've been entertained and that you'll stay tuned here for more find listening [noise]\n\nI'm Michael Barone this is pipe dreams from American public media\nThe globe is your home for the great American song what we call ... ... local chance\nIn popular song Nineteen thirties today from Frank Billy an ally looks like Kurt Eli Dianne Reeves in great reporter Margaret chill I spent some time with low Sundays and shame on MTV music radio\n\n\nStations have been ... music radio R. W. M. A. H. Biloxi there'll be MA ... W. M. A. U. Butte W. M. P. N. Jackson\nW. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at impede the online dot O. R. G.\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n... does not putting new one in ... was ... I don't think it's such as far as making a new piece of an old to ... which is what Patrick Scott has done their improvising a brand new ... around the nineteenth century John Dykes yet I see\nIt to the parking has made new organ twenty Thirteen for Providence United Methodist church in Charlotte North Carolina utilizing repurposed pipes robot Nineteen sixty five alien Skinner Oregon formerly the JFK concert hall in Washington DC\n... is quite fully explored in Patrick's come back this issue but I read the CD now when the aliens going to depart at the gym gets under your space was taken up by a new eighty five ranked ... organ the Ruben ... family ... been twenty twelve\nRecorded for the very first time for the release but the young Chinese teacher reside in this one ship in\nThe desert was here with an electric relative phew let's see ... those\n\nOn\n\n\n\n\n\n\nNa\n\nNa\n\n\n\n\n[noise]\n\n\nMm\n[noise]\nMm\nMm\n[noise]\n\nMm Mm Mm Mm\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n... the conclusion of the way of the cross leads to try it\nBut the pathway is full of pain and introspection as we've heard movements from the ... by Norwegian composer young low creek\nPlayed by Henry fears on the new mark garden you a pipe organ in the old guard culture told of the University of Birmingham in England instrument revealed in a variety of repertoire and the recent CD from region record\n... is French but she was ... in Birmingham is designed in the manner of Dutch classic ... with the sound quite different from what you're going to hear next to Christ the king Catholic Church in Dallas texas\nThis organ built in twenty Fifteen by the from a huge Asian clear of Montreal their hope is forty two the Henry McDowell ... Thompson Oregon\nContains fifty eight stops in one of those the French romantic static but the broad foundational tone and incisive dark read voices which will be particularly president in scared so and so not only the second symphony ... from which we're drawing some excerpts\nAre filled with Jason olden combines original and leader additions by the door of this work the scared so it was from the first edition the Dodgers and slowly come from a leadership position let's enjoy French organ music in Dallas texas [noise]", "show_name": "Studio 360", "year": "2018", "city": "Jackson", "day": "07"}