{"month": "10", "state": "PA", "station": "WIUP", "content": "\nLittle ...\nA low wage [noise]\n\nDo\nHave to do\n\n\n\nYou listen ended up ... one and I am your host for the evening DJ does back again will be PM got a little bit more chill vibes today\nA lot of a\nMore slow she'll step songs dry it's maybe a little bit of a little bit of a drone base but usually just to shield but today to just relax and a stick around as an WBFO ... one\nUm\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n\nLife that their military service has different many veterans transitioning difficult feeling lost an uncertain about the future these feelings don't take away from a veteran strength courage for CGI duty if you're a veteran in crisis or no one who is\nThe power of one person one connection one active compassion can make a difference for three twenty four seven confidential support Golda veterans crisis line one eight hundred two seven three eight to five five and\nOne would visit veterans crisis line dot net\n...\nNa\nGoing to learn things done grain\nCurling will ... will go away from\nWas germ germ fall on their animals\nWe will do this\n\n\n\nFor new record for like a da\n[noise]\n[noise]\n[noise]\n[noise]\n\nThis is Ninety point one W. I. UPS then Indiana's alternative source\n\n\n\n\n\nPM residents can apply quickly and easily on line by visiting PA better services dot P. A. dot and putting the voter registration\nAgain PA residents much register by October\nProject in November the local state and federal election\nIndiana county sustainable economic development transports we're going to local who was up on Tuesday and Wednesday\nThe workshop will be held an aging services [noise]\nOne oh five five oh street Indiana and will consider the community meeting them into nine yeah Tuesday October night in a an action plan exceptions I went they afterwards and the answer for there to be a\nFormer community members and anyone interested in like an act Vesta locally produced food\nAnd how they've been up in Indiana but he had\nWorkshop resulted from effort to the Indiana counts as an American I'm\nA development task force to support global economic development\nIn multiple sustainable way leaders from this project secured a technical assistance grant to help expand access to locally grown food\nTo our as BP or get additional information please cold case Snyder at seven to poor or two two zero five [noise]\nI got another a hour of\nShow music be off today so stick around election and I'd be I'd W. I. UPS I'm a Ninety four [noise]\n\n\n[laughter]\n[noise]\n[noise]\nDa\n\n[noise]\n\n\n[noise]\n\n\nNot I'm\n\nThe [noise]\n\n\n\nThan commercial free you're listening to Ninety One won't to W. I. P. in India and so they yeah [noise]\nMedical\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\nMade the moon and do the\n\nTo\n\nHave you on\n\n[laughter]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nYou look at the W. I. by UPS ... one another fifty minutes there's some pretty good pretty good but the state those some but they'll electronic music you've been a real job today\n\n[noise]\n\n[noise] no\nNo [noise]\n[noise]\n[noise]\nYou know speech does bother way\nToo many things to stay in the\nCenter will most a bull crap and vendors chauffeur ... three PM Saturday October twenty men are located a Belgian won a screen Indiana\nWho will be available for bridges on spike if you're interested in participating in the show what the craft or or vendor contact Amy fall and get them for three point nine forty five hundred forty official Craig a corrupt or or vendor application ended his wants to make\nThe greater Allegheny region of the American Red Cross\nAnd platelets each day to meet patient made him more than Ninety plus you\nCan help by giving blood at one of the upcoming\nDonation Wednesday October third I be three and I keep right Dr Indiana for twelve years six pm Wednesday October seventeenth of a VFW post Nineteen eighty nine eight to four\nSprings road bowl of it I Am for thirty pm Wednesday October some of the the the the hope\nThrough Nineteen ... Dr Indiana from opium to ... pm\nAnd Monday off for the second one of the United Methodist Church three Ninety eight Indiana\nThree on ... church street Indiana\nFor one of the objects like thirty or for making\nThe label but calling the local Red Cross profit above the super bowl four to five five six seven eight or by building W. W. W. dot\nAll right we're going to get back to the music listening to WIP if I'm not one\nSingle hoping to hear what you know by grabbing [noise]\nWhere you know [laughter]\n\n\nRather\nKnow [laughter]\n\n\nPlace you went\nBack in the crowd\n\nFor\nThis is a public service announcement from taking fishing out or to determine its unique fishing license that boat registration before heading out on the water let us begin\nOr you were there do you have a beak do you help plumage please tell me\nYou answered no which means you need to get a fishing licence and have your boat register because it helps local conservation efforts protected very natural resources you enjoy boating and fishing in generations to come do your part at take me fishing dot org [noise]\n[noise]\n\n\n\n\n\nThat was the WIP of ... one year old on so\n[noise]\n\n\nNa\nNa\n[noise]\n\n\n\n\n[noise]\nLet me let\nAnd you can do\nYou\nMight not be much much he led the bullies you know the man who do not come when you look for me I must got like ... everybody back up again how many jobs you're gonna miss him and he joined the garbage and so I just I Love my job\nHave a young boy\nNow\nThe world have now I Would automatically doesn't let it go to let it go to like get a ride with the one that I found that now\nThey're like never before we get the message I could never think of\nI'd rather not know how how do you know straight down the street\nHow many yeah yeah I mean we don't know ... how\nThis this year alone [noise]\nExactly so when we got time to waste time and [noise]\nGot to make time broke [noise]\nKnow that the judgment town right\nThe choice to make time sorting [noise]\nPlus it come out here and appreciate the little bit of life we got left off\nOn a dead always try to be you know that broke\nRight man don't [noise]\nKnow I and I and I said it's because I I Love\nNot said we'll get back to the show on the phone that Patty [noise] my check check check check check compared to before we get back to\nAll my listeners\nI promise day if I never used the phrase [noise] he said think about what you're saying [noise]\nNo better this family will know detained go no better than a white man were slave boats sail like I needed some soul searching my Pop's gave me some game and real person\nWe trace my steps to what they never taught me do my own work fast before government caught me so I'm a dedicate this one first to Oprah a lot of infamous sensitive in work control is so many artists gave for an explanation all us with this is my explanation straight from Ethiopia\nN. E. G. U. S. definition royalty gene royalty weight lifting N. E. G. U. S. description black it ... T ball and then let me finish the history books overlook the world and now that I've never tried to make it to our house to fight it\nStay with me let's say no no blacks don't you come get me can't keep 'em Oprah Winfrey can't let you by the time she juggler mob mob ball really sneak ally [noise]\nLike [noise]\n[noise]\n\n\nI\n\n\n\nJust a main\nYou to running back he got to know what's\nWere on\nAnd\nNow and again as\nThe years\nDon't do much many girls\n\nWhat was\nGoing\nRight\n\n\n\nWe're\nGoing to leave it in a week but I get a\nDrop water on where we bitch come right\nWhen we're\nA way that we start to plan man you'll more training than I Do\nMom grew up in the middle\n\nA lot of time or do I do the little\nTo the\n\nAll going by\n\n\n\n\n\nNo\nThey called me three wind up going forward you regretted it so [noise]\nWay way way aren't ... aren't ... aren't learning all the yeah ...\nI got in a mean gotta lotta enemies got a lot of people in China dreamy M I n G to trying to take away\nFrom where the kid and pray for you\nI ... I'm trying to Monday bond no not that important but they I got ran Robin woman family so I got\nThat can have candidates who got mortgages dirty Maine and so I got to stand trial deal with Iran then I got to hang on\nDay though for life yeah\nGot in a mean gotta lotta enemies got a lot of people trying to dream in then and she's trying to fade away\nFrom it when a kid and brave\nPeople dumping them and then God given about this one in part about this one and just about this one out about this one month occupied dragging him at all I got\nThat to me about a cold blooded why\nThe bodega summed up by the exam God showed me pictures that a\nThree man just to tell me they really have to\nSee the female version to me I got him was in my life when they were just to me I had to buy something about what they're going to be I got high hopes when we go see I got money and of course the one the free by the ... to be I have to buy it\nSome value my car tell me I'm In the last\nMillion take it too\nYou just disappears\nWhich who's the ...\nAnd this is\nCindy [noise]\nCountry seems\nThe news [noise]\n\n[noise]\n\nHumble legal problem\nWhen I was little\nPray to God mobile\nYou don't want to know my name is going\nHow to work my\nWay might make them shed jobs\nGoing to be serious journalist gymnast you didn't she didn't know where they got their troubled around but being allergic so you know that\nThe Grammy Award in\nTo jail if there was no place to live in Virginia who am I\nDamn America as a matter of months\n[noise]\nTown they're lurking\n[noise] than I Am a nurse or a magic family members\n[noise] working around but man they learn to\nBe there for your life is that the last\nA cake body armor suicide\n[laughter] machines innocent trying to make up your mind maybe just a job and she just she just she was so\nMuch of the gang members what are you doing\nAnd every other month moves on to join a German Shepherd beverages\nMy name is no matter what you want a whole new here is only one job\nWashing while the young men\nWere that's what\nWe're doing with all the time I\n\nI Know that there are no nursery\n[noise] we're ... we're doing\nMath and then [noise] then I remembered that them all\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [laughter]\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n\n[laughter]\n[noise]\n\n\n\n\n\nThis is a wrench this is a wrench into can of beans this is a wrench some canned goods a flashlight gallon of water batteries a can opener first aid kit radio supplied medication since an extra cash\nWe bring all these things together we have a disaster supplies and getting the list from your local Red Cross you can assemble all the supplies you need to be very your home and family for an emergency or disaster when we come together we become part of something bigger than us on to assemble your own kid visit Red Cross dot org the American Red Cross together we can stabilize\n[noise] the gym [noise] [noise]\nTo lose your job is on the comedy channel [noise] let's see\nDo you get the money was\nWay you know what\nWhat I really\nDon't want to [noise]\nBecause nobody\n\nAt one\n\nIt [noise]\nReally sort of you know when they're going to be getting the brand new just thought you know\nThe point of your money my white man\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\nRemember we make my my money [noise]\n\n[noise] today I got as\nMuch money they got the smell of like the\nIncreasing went blind when it gets put you may like\nCome to know something like in\nWhen I came in and getting money to pay you try to\nSame root as long as people think that will\nMade a little bit\nPosition woman on\n\nWe\n\nAre going to rain brings because that's really funny when you get any money money money going to happen when we got ... minutes\nWhen both to\nThe fact that when the bad call borrowed money\nWhen you buy\nLike jump\nHang with Richard Holmes\nMen that are now\nAbout you got to break\nUp with this young woman on\nOn the list\n\n\nOn the way we spend about what's your weather and then what happened with the devil come up come a little bit but you have to commit suicide by being done by and I could have got black and white he tried to make them\nSo I'm Glad to meet some\nAll that had to do not tell us when they met like within the human brain growth\nDon't black greed that will want they want the New York times got to be the Loma not when you bring shiny\nBut you can read what we got to be the doubled amazing and they were seeing what I did some ... ... like when you're on the same money now when you're when it's got to Bonnie looking in the way I Am black hoodie\nOh man suffers from a lot of\nOf the blue ridge which don't repeat there is no\nNo no no no\nI'm a Christian Woman\nYou know\n\n[noise] [noise]\n\n\n[noise]\n\n[noise] yeah you know we are talking about his wherever I go off on a [noise]\nGot that new young people are saying on the coast\nYou can't get it we just\nDid I'm gonna take it to ... if you leave Mickey you go in a way to go to a game I imagine that's what it was so ... good we get like a dime authentic to give a kind\nCop show getting down in the media when I had to protest the head of the year we bought the pet into place pretty\nAnd you know with all your ball and no money no money no money but it\nYou know with all your mom don't know what to\nWeight and made it through hell that the microbe that got bigger women got better you wander right how do you get in the game I'm Wondering how do I get to the raptor oh\nWhy did he get he said it took him ... magic when she didn't want the data may seek out but other men and she but never seen it there's so many negative pick them\nIn New York like mundane there to the head of how to do what you know keep a genome to what the evil in the neck to meet you you have a peace time that the middle finger to click when you see it that is my family\nTo me and my family tree in my arms legs has on my feet and that could cut them up and keep it diabetes did to beat a kerosene expressed that I've seen it a hundred dollar said every single saying the it's been a king all my life so I got to see the summer off\nI got your dream girl yesterday I got like\n... to me I'm a thought\nWe gotta move quick world in my hands I ain't got to lose ... like ... or ... did a possible ties to approach night\nGot to make it or don't demand world populated around my rolly run away to talk of the way they want to come uh come accommodate the longest time around is gonna be da da da da da da da da da da da da da da da\nDa da da da da da\n\nDa na can't get the king told you haven't won the ... to ...\nThat meant taking notes but when you when I was lucky that when it came to do was talking to him about wanting to cut the legs when you've got the game [noise]\n\n\n\nYou are locked onto your alternative source Ninety point one W. I. U. P. F. M. Indiana [noise]\nBig old John\nBagel Jane companies have been done on that one\nWhen he got back in the devil not with\n\nIt gives you know something is not immune\nCall me on the sidelines not what am I what I'm fine\nOut and die waiting known as the mayor\nThe caption viable based on the fact that it would have been\n[laughter] [laughter]\nI got on the guy's\n\nJohn it\nFor them and they ran does right William\nThe ... the more we're all boarded up from the border lord falling on our blood this day in and they'll break hills [laughter] so I'm\nBut rarely get it in the end it again and what the ... river bridge and you don't kill me\nYou know why do you normally\nYou know like I've been ... no ... no ... no object team I'm Amazed when\nMoney to keep them that they were going around the along the roundabout\n\n[noise] [noise]\nQuite recall I've been working on my blog ... do you feel good show I go way above what your dog being around the block\nOr maybe ... ... how\nWhich was called the AC chose you or you're just saying hey\nWe don't know\n\n[noise]\n\n\nOh\nMm Mm Mm and\nLet's go let's go get a way to say what they have a drink\nThe combined with John let's go get it down to somebody about to\nYou get more\nThan one day they'll get in\nAnd they did I went on and young men and\nWomen and\nOnly\n\nGuy\n\n\nAnd [noise] and then\n\nThe whole the whole goal\nIn mind and that could you on the podium di\nDi di di di\nDi di di di di di di da da da da\nOh\nOh\nOh\nGuys today\n\n\nAnd then they and and and [noise] and then and then [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nYep where like where you are you know my niece\nAll and I try but it\nBring a\nTight race for a number the way that we would go away\nThe\nNo science or trying to think about that type of\nDo I read and write and read in the wrong\nWay and then it's dry eat crab\nAway the ending Jay do\nI'm On the line on one level or a black lab rats\nToday was the the ... oh you are going to go on\nPlans are way but the the world you know do\nOn jazz they do a jazz they\nThey\nOn jazz\nThan a ... I don't\nGuy that I don't know what I said I Am every\nWe're still going\nWay it is right in\nTo gauge it applying\nReally mad at the moment I'm right\nAnd then why\nReally\n\nYou\nHeard\nWhen you when you go\n\nDo you do what you mean do you read the ... you just need to be three in the [noise]\n... no ... on the road like you got your ride with heart and soul\nBad predators we'll get to the one I ... I went to read from the old guy flow exec gold like party all hard headed for better for my role\nBeing slow or to Jim Beam suit with air over repeated the Jim Rainville on the big screen thing you can go team go when they're gone it as a cat when it is so weak pills woman at a flag in Alaska who led to the rest of the Muslim or they go to the bathroom to enjoy that branch their papers with the low ... bear the chicken that I said it but I won't go there\nBurned down and the clue like our ... our humor and bad and yet ... house put them into bad bad manner by\nWith the damage green like a pro war\nReview on that and the ... down and still grow your own ever get out the\nWindow right next to live for the winter when a TV dinner ... posted in leather when it's up to seven to never went up to that can put up put print long worm swimming in a\nFreedom fighter beat up minor fly back Dr ... even if you don't take time leader with rap we do phone Mueller print\nThat marine Greenpeace little special one that walked three feet across there had been much shut up and they still ... real to them they're like no way no brain hairs don't even know threatening pills in a ... million then ... just about to get a real deep inside\nWith the down in the grand like a pro war\nReview of mine was down to the phones you grow through the room put up close like your wife can strike of ... three straight down but in this coup in ... and got a crown number ... ...\nHis lap dolphin adult playing left in the blood and his beard almost go St James sugar\nBut this sharply were rooming with in this country where in ... in his hand alone in US law research on on flows like I'm standing Duncan the other on the ... Danley French\n... from a pay increase or when you can win a man and his family drug ... before you get spoiled and drink with management ... to give their role you'll string mid boils and free movement of rare collections of flowers in his helmet didn't bears with west be\nStraight down in the loop current ... honestly want to count them out to look stupid dumb bells bound tell how soon will burn we face down in the blue green like a\nBand will bring you drinking water from the ... the founder you for calling with the map and we have a home\nH M M P H M M ... rock rock camp right by the beach with him and\nUsed to be named him and\n\nThat's\nA stupid\nOr you tell me that you know it's a time machine\n[laughter] kind of a joy good bad [noise] I'm the guy was\nNot any more and more than you are you the I'm leaving the gotten [noise]\nLike they can always [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\nThe bags the length of time and changing the numbers you switch to add to yet\nWriting letters wedding diamond and I have to look in his unit juggling city braced version I changed the law that bought the month which is that what swayed me so I called the ... and in Lebanon in different cities with different loving their body and it cannot be because\nTally different did when she hit my different room is another friend asked me to tell me ... tell me the truth telling me live with the next guy name a cropper let\nMe I'm with the next ... unprotected sex got my name is ... is a\nLittle crazy all around I had a baby\nOn maybe it's time to let them maybe blaming guns in the next billion baby mama and blame it on if asked her what she will namer dot\nShe looks just like you\n[noise]\nMatt generic play makes my day to day staying up late watching you make a shape now blonde habit then the ... when it from one posted that denounced the violence skin tone blue violet violet spoke at all yet stopped as well that'll die\nAbout a problem that the long blocks she posed and that's when the kind of pie\nBy any kind of love and then the baby's mother got hooked on it but that lost my baby brother\n... murdered them playing by the time that way since I Can't write small already come home with the situation just staying right Dr same arguments thing\nThem in the name ... that's when it came around lots of my body and my first barbaric now and he looked just like you\n\nGod in and of course now time for all around pop click on a calm down\nDark brown Portugal gave me parts and the lawyer game or uncle rotation cook\nCounty girl in the adult now the Audi Pearl think I got along with a model Shia daddy's girl the baby's blowing them back to back west buy a bag boy when I asked that\nTo knock the song in the background and down hold an egg roll into Pakistan\nI Know you don't even that is trying\nTo do and I\nYou can run and on and the right to you know and the way you move it's like you can use the vacation and\nDrinking a hand in on it and I swear I now live life you ought to vacation\nGetaway\nMega after whatever happens is I had to happen\nYeah [noise]\nUh no you know you ...\nManaging like you bring battery ... stands in Iraq and trying to think that the ... dancing ...\nBlame it on that alcohol or blame and I'll say it you\nKnow how to you how to keep the only\nBad my main can pop pop out like crap seek out the best smokes well plug Chechens are light you flew in from may ... let me see how loud and it gave us a wide as they do need to be taken care of habit but just like a pamphlet on that Chad issue [noise] yeah I Know in balance and\nYour songs [noise] ... ah [noise]\nYou made in China and get a Law Order was a song or no games are grown in morals relaxing\nTime John does the same language\nYou mean going through understand why they gave away ... case\nBand so wedded ... baby I I'm just saying I don't\nYou know I Am down from what I have\nA [noise] yeah\nHad a major cells that\n[noise]\n[noise] it goes up on not that I lay\nComments dieting blowing through hanging out you know that you need to have\nA Nineteen year old and they need that now on line and let's go let's go let's go let's well anyway well\nActivated getting mad at so many charges on my part are God I think you're going to die to\nGet them to get a negative negative role and get a place to get a drink pop a bottom maybe we can get away with us die in effect we can sort of by the town\nHave you ever been to Texas and south by south west and what we ... we can get arrested where they might know us off in a in a direction I mean they\nKnew and want to be the bad is going to be with somebody who I never had it no status as often as medics you just got to\nKnow you being run by you know you try to argue screaming and shouting and you know we honor roll like we did go to college though and hundreds and thousands I pay nine as intelligence why 'cause I Know I\nMean trying things can't claim\nKnow you're ... you're acting so friday and Ira and hello to weigh a little bit later in the case in New\nHampshire and I know you're\nDragging in and out of the day as as well as I got a letter writer or you want to vacation we're learning and getting carried away\nWith whatever happened just had\nDo you pay\nFor\nWhile you were trying\n[noise]\nUh uh\n\n\nGreat go\n[noise]\nDo fear a bad guy\nSo stay or dance or\nWage [noise] slaves or fun or growing and growing up I had to get him topping ... [noise] what\nIf I pick you up for how\nWe had been something you know are we sure all the way do I saw potentially you from oh you know that I did I don't know if you know but I Know who you are you going to be\nBig as Medina just get in line and let's don't make other plans say you know fairly you worked for the man well let's say for the phone call enough on human saint already on saying they get like ... say it again [noise] as soon as you can on\nA [noise] bridge or a or a\nDon't know [noise]\nOr a or a girl or\nBe in bed so you\nAre ... [noise] um [noise]\nSay she says the U.S house or a girl or\nWage [noise] slaves or on a on a growing number I had a year to top it would [noise] and I'm doing this\n\n\n[noise]\n[noise]\n[noise]\n\n\nBe free you're going to be getting a receipt like never made is going to do with the raw meat the\nCountry and even to get your body but you have to be good to be going to be green is all I Need a really or like the main roads id this ain't free me baby was it make a bet you mean with the with the three ... they do you think there'd be\nSweetie honey what are your view of what he opened up your book\nWhat you want to do when I did it like every day now doggy style showers\nFried chicken eating at a bank is managing your friendship based on what it means you won't be your mother says she didn't really give us your story to sort of you know she you know Bush wanted to point toward the washing machine to do\nYou're\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n\nOoh ...\n... ...\n... ah\nAh one\n\n\n\nDa\nDa\nDa de da de ...\nI think I can\nAnd I think you know\nA penny ante and she\nWhile\nWell and also\nMay not be a general you know\nNot denying how\nWomen are less good\nAnd on and on and you\nAnd love the show\nAnd she said you know and I think they need and then you can eat and then when the\nOne by one by one by one by one\nAnd I\n...\nTotally out of the day that day and night and they all died and I\nI enjoy and\nAnd I am\n\n\nBy\nYour mind\n[noise]\n[noise] [noise]\nA guy\n[noise]\n[laughter]\nWell\n... ... ...\n...\nOh read another awesome bad from Austin, Texas that was the well you're listening to smash Elia Ninety point one\nWIP FM I'm Kevin James kill my sister got a quick PSA for all of you are aren't registered to vote yet the deadline for PA voter registration is quickly approaching to vote in the next election you must submit your registration application but two nights\nPierre residents can apply quickly easily on line to visiting PA voters services dot P. A. dot Gov and clicking butter registration like again peer residents must register but to bring that to participate in November's local state and federal elections thanks\nAlright I'm going to continue to music with rotten easy record label awesome record label out of California ... mixed jaguar song damnation check it out\n\n\n\nMm Mm\n\nA right that was Blackwater holy light an Easy Rider records and all female group that is currently killing at currently on tour you check them out if you like what you heard that was Easy Rider records label all four there's less bans I just played on the label good stuff check him out an inch beyond Easy Rider records\nYou list Ninety put one W. I. UPS em\n\nMilk your face off [noise]\nDrag listening to smash Elia Ninety One W. I. UPS them I'm Kevin James kill much you're\nGoing to do the final hours of the nights you just heard alright pie which smoking like ninja engaging the Halloween different Portland, Oregon I Know these guys\nGood bad or write the check them out but for this hour I'm going to go back in time back to the sixties and seventies place in punk rock before you called punk rock here is the New York does with personality crisis Chiquita\n[noise]\n\nOr so and I don't\nAnd I got that\nDa da\nDa\nNa na na na na around\n\nOn on that\nAnd now I'm not trying and then\nLearn a lot about it but we've\nThey try\nNot that wound\n\n\nMm Mm Mm\n[noise] [noise] [noise]\nAnd then a lot so that will no\nNo no no because in the ... the the that the God no no no no no no no\nNo no no no no no no\nNo no no no no I'm not going to go to a dog like real world\nOr a no no no no no no no I don't know where that\nYou know and you know\nThe more you know so\nNa na na na na na na na na na na no [laughter] [noise] [laughter]\n\n[laughter]\n[laughter] [laughter]\nAnd that way I I\nYou know when and ran and ran\nAnd [laughter]\n[noise]\n[laughter]\nAnd and and and the mob man oh\nYeah and you're like me but I Know wait a minute and the dog and you know and I mean I'm I'm not on the Internet and pattern which bombed out after a while now to Baghdad mad\nAnd angry diner [laughter]\nOh right that was we found was related to me you're banned from yesterday you let's not go on to the UPS Sam I'm Kevin games too much or on smash Ellie and it's a dead ...\nTo\n\n\nCars you\n\n\n\nNot I'm not trying\n\n\n\n\nBring more back\n\nProblem and I\n\nAnd I am\nNot the\nNo no no no no no\nNo no\nOregon there\n\n\nPeople just\nDon't want\n\n\nThank God\n\nFor that\n\n\n\n\n\n[noise]\n\n\nWhy I wrote\n\n\n[noise]\nButt\nGod\n\n\nDiverse than commercial free you're listening to Ninety One\nYou must be listening to match Dahlia Ninety put one W UPS them up next I got a block of some female based ban and up first we got the coolest duels in school check it out girls' school years come on let's go\n[noise]\nPA residents can apply quickly easily online but his being PA better services dot P. A. dot Gov\nAnd clicking the gut voter registration like again PA residents must register about Tobar nut to participate in November's local state and federal elections\nImportant stuff go out and vote\nOr right I'm going to do this block we're going to go to Detroit with some political stance punk rock here's the MC five with the American ruse check it out\n[noise]\nPoint right now\n\n[noise]\nAnd it's not as big bill bill\n\n... [laughter] and and and I ... I mean I Know\nNow the\nThe thing is I Know\nAnd I'm like you know they may\nWin and a little\nHe isn't all around the house and\nWe'll we'll know who they are and what I can\nI can cook I'm a ... a normal\nMy album they pay a little\nBack up and say well you\nI'm like whoa\nAnd I know\nI'm Still a long walk\nTo the bottom line and we'll\nGo out\nAnd we'll all bought a\nK and a gun in a while to go out and say hey let's call\nThem how the\nBom\nBom\nBom ...\nCome out and we'll\nGo on and what I Know\nI have to be a\nTeeny tiny ... no\nChoice but to see a small\nTown called\nAnd said hold on to them but you all\nThe time for the\nOr do you do\nIt comes to no\nAnd well when I go out to come up with a lot of them are on Long Island\nI I mean God man about\nMean I Know on\nNo real\nThe new\n[laughter] they announced that mankind are and I kind of a time and I think [laughter]\nI don't want to go out and got our\n[laughter] I'm I'm a\nProud I Am [laughter] come on [laughter]\nI don't know [laughter] ...\n[laughter] that I came around and that kind of girl [laughter] [laughter] okay [laughter]\n[noise] [laughter] [noise]\n[laughter] [noise] [laughter]\n[noise]\n\n\nWell\n... ... what a woman's\nBody but I'm ... ... ... what do you think you know who who's ... goal\nAnd then when you were going to change\nAnd for him in ... [noise] and whatever job but I Know I went on between him and I turned on my\nAnd then\nAnd run on the\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nYeah yeah they were [noise] remember and this is an actual scene in the book as as as I said many of my experience has turned into scenes in the book and this was in Atlanta Georgia and there were\nI went to a very kind of racist bar in a suburb of Atlanta and there were these guys showed up and\nWe started talking about Trump and um and they said oh she's he's going to win and she's going to lose Pennsylvania and I said oh come on and I pulled up I don't know five thirty eight and they said look I I mean okay Ohio perhaps but they said no she everyone thinks he's a liar and she's not going to win\nAnd you know and throughout the trip there were echoes of this and it was just it was just so surprising I mean it almost made me think everyone should get on a greyhound and go across the country um if we want to understand the totality of America I mean I understand what happens on the coasts very well but\nThe totality of America is is is different and often quite disturbing\nLet me ask you about the role that the election plays in the novel I was fascinated 'cause obviously the novel isn't only about that but it does play a large role in it yeah no look I mean\nPutting a political gloss on this was not my intention to begin with I mean I thought the Trump would be in the background the way things you know the way you want to set you want to set a ...\nIt's going to be a flash in the pan because really what every novelist or almost every novels wants to focus on our people you know characters and and the character of burying his wife seem are where I really wanted to concentrate this a FEMA is a very talented woman who is Barry who is in many ways smarter than Barry any kind of knows it but\nAnd she's a graduate of Yale Law school at all these different things but she plays the traditional hedge fund wife role of not having a job and uh and just taking care of their kid I mean to her credit the kid is\nUh on the autistic spectrum and he's non verbal so there is a lot of work that she she she does but the ... I Want it to the book to be a kind of do wet between these two characters one who's running away was on the road and the other who's left behind to pick up the pieces\nIn writing that and in June and I'm going to stick with the election just for a second so you're on the bus and you're talking to people\nWhen you get back and November race to thousands sixteen happens and Donald Trump becomes the next president of the United states you are then left with the task of writing your novel did did it change yet did did did it change the tone\nThey change the tone toward the end the little bit and you know it was a ... I mean you know I said to my editor said please don't use the tea were too many times [laughter] because of the thing is you know that that that that\nHe sucks the air out of everything you know there's a real danger in writing a book that even has him as a you know not to protect us being in the background because he ... he was all of our private time he does not want us to interact with\nOur friends are lovers or spouses are um partners our children are parents I mean he you know he wants this world to be in a very authoritarian way everything is about him right\nSo how do you write a book in the time of Trump ... write a novel rather um where are you still want people you want to explore people's humanity but [noise]\nThe novel concludes because he does win the election and we'd go beyond that a little bit\nSo there's no way and in fact it plays into the way these two characters are ... husband and wife um interact with one another but\nI really want it the book to be also about their kid who is on the autistic spectrum and I wonder if the book to be I don't wanna say hopeful but I wanted him to have a journey as well\nEr and I wanted that journey to sort of go beyond Trump so the novel I don't want to give away anything about the ending but there's a grain of it leaps ahead so to speak and and it leaves the T word behind a little bit and that's what\nMy dream is for the entire country I guess\nThe name of the new novel is lake success carry Stein you are is our guest on this week's show the book is published by Random House\nDid you find happiness not personal happiness but of those people that you were talking to whether it be your character and the ultra rich or the people on the bus station where were you finding glimmers of happiness along the way in this country\nWell first of all the countries beautiful [laughter] it's a beautiful country and I like a you know when when you're on the Amtrak you don't need to get some view of it or when you're in a car you see the interstates\nBut there's nothing really like the greyhound bus um there were scenes on shakeup will duty or going through Texas through the [noise]\nThe mountain ranges of of western Texas or as the sun went down I mean wow it was beautiful and happy and there were there were a little glimmers of happiness first of all a lot of people on the bus were the first generation to go somewhere or many of them were\nI talked to people who were going to college for the first time I'm at the University of Texas El Paso wise and there's a huge El Paso chapter I met professors who were teaching the first generation students and from either\nAnd it didn't it didn't feel at that point I mean Trump was somewhere in the background but it didn't feel like the country was\nCompletely off the path I mean ... yes when white supremacist got up and and and we're able to dictate to the rest of us what the conversation would be and people pretended to fall asleep or or look out the window or or something nobody stood up to them you know that was a great for taste of the fact that\nThose people those white supremacist on the bus would eventually make their way into well into our government's\nA report that people that they would vote for and and so there were glimmers of both the awfulness that would uh overtake America but also of the incredible incredible beauty and hope in this country\nYou talk about at the beginning that the inspiration was this realization your friends have been exiled from the city of New York because they could no longer afford it so with that in mind what did you learn\nAnd and what did you learn in helping to answer some of those questions as to how and why did that happen\nWell I mean as I said before I mean I I don't think that Manhattan is kind of the a nexus of happiness these days because most of the hedge fund people I met were not very happy [laughter] they were endlessly competitive um nothing was ever enough they were mowed it in a strange from their communities their families\nTheir children everything you know they lived a very an existence that was just about a couple of spots on the map in Manhattan to fund or gigantic apartment et cetera and and their club and you know the the friends have who have left New York\nAre the happiest people I Know you know and um um they went to Berlin or parts of California or\nWashington state or well a great deal of them moved to the mid Hudson Valley which is where I spend about half of the year a sort of in the rye and back Hudson type of area um and and and there's like a little\nYou know you leave New York you buy a very nice house a nice plot of land and and you have fellow people to to talk to 'em some are even crazy enough to commute to New York every once in a while even though it's like you know from Hudson is what almost two hour ride but um\nThey find it worthwhile in order to um [noise] in order to uh live someplace where which isn't as toxic as Manhattan has become I guess is what I'm saying\nWhat was it like for you to\nTo write a novel like this so soon after writing a memoir of writing autobiography and putting yourself out there and then suddenly looking at something that is ultimately as many novels are very person\n[noise] well the interesting thing here was that it was the first novel that I had written that did not have\nA protecting his was exactly like me you know a ... a Russian Jewish immigrants from the former Soviet Union and I mean very Jewish so you know are taking baby steps away from the usual stuff but uh [laughter] but he was a it was um different for me is wealthy and I'm certainly not he's a\nHe works in a in a field that I did not all you know actually when I was a kid I I I\nI grew up poor in Queens and I I you know Wall Street was this glimmering sort of thing that you know you thought wow\nUh being bullied as a kid in my in my local school but one day we just wait you know I'll I'll make a lot of money I'll show everyone and that by the way it was the sort of the the the ammo of a lot of people I met you know they grew up lower middle class on the periphery of stuff and they wanted to they want it in and Wall Street\nI mean really in our country Wall Street in tech are the only two industries where you could really a pain immense wealth um [noise] and\nI mean I went to um math and science high school 'cause I was in high school in Manhattan [noise] one of those very selective schools that was almost all immigrants are and that was the last time I seen this level of competitiveness I think it's been a long long time\nYou do write about being a father though in the snow was that something conscious\nStruggle with addiction and those who are addicted to opioids are forty times more likely to move on to heroin\nNo one wants to leave in pain\nBut no one should put their health risk to be pain free\nThere is another choice\nPhysical therapists treat pain through movement an exercise no warning labels requiring and do you get to be an active participant in your care\nChoose to treat your pain street flee\nJews physical therapy visit move forward P. T. dot com to find a physical therapist near you\nThis public service announcements brought to you by the American physical therapy association\nI'm any good and the host of democracy now your daily grassroots level I didn't let in international independent news hour\nW I use the vendors now airing democracy now from week Monday to friday and then by the end on your alternative W. I. P. Ninety point one Afghan tune it you won't forget\n[noise] [noise]\n[noise]\nWelcome to counter spans your weekly look behind the headlines I'm Janine Jackson this week on counter spends listeners may know that Donald Trump big speech at the U.N General assembly was met with laughter\nBut another funny not funny events that took place was largely overlooked and it's sort of glorified photo op Trump\nProven approaches we'll hear from drug policy alliance is senior international policy manager Han ahead sir about what's going on\nAlso on the show former Chicago police officer Jason Van Dyke is standing trial for first degree murder for the two thousand fourteen killing of Seventeen year old ... McDonald if convicted he could face up to life in prison\nFormer Chicago police commander John birds died September nineteenth he was only convicted in civil suits despite being responsible for years of systemic torture coerced confession and violence visited on black communities\nVan Dyke and birds maybe outliers but coverage that treats them as robes without interrogating the system that allows them to ... their behavior is part of the problem\nKind of been talked about bridges reign of terror with former Chicago Reader reporter John ... and we talked with reporter an activist Jamie Calvin about Van Dyke some murder of macdonald we'll hear part of both of those conversations today\nThat's coming up and you're listening to counter spin brought you each week by the media watch groups fair [noise]\nSeptember twentieth Columbus dispatch ran in an op ed from Jim Carol identified as deputy director of national Drug Control policy and President Trump's nominee for drug czar\nCarol events concern for the lives lost two drug overdoses and empathy for the loved ones devastated by their loss as well as those in recovery\nAll by way of explaining why he was in Columbus to meet with law enforcement officers from Ohio went across the Midwest about working together to stop heroin ... cocaine methamphetamines\nPeople's lives that immediate recourse to a policing response is writ large in Trump's call to action on what his administration calls the world drug problem\nBut it doesn't reflect the direction of much of the actual world so how much impact cannot disconnect have\nHad a head start is senior international policy manager at drug policy alliance she joins us now by phone from here in town welcome to counter spent ... thank you for having me well\nAnd you have reported the nature of the un event at which this document the global call to action on the world drug problem the nature of the event is itself\nTelling the un has its maybe byzantine waves but this was still special what was the story behind this less than Eighteen minute meeting [noise]\nWell I think ultimately what this was was just an attempt by\nTrump and his administration to have a photo op where they're surrounded by other countries that look like they're giving support to the administration and to demonstrate leadership on the drug issue without providing any real Lucian both domestically and internationally so\nTrump posted this high level event that was called a a call to action on the world's drug problem where the U.S ambassador to the U.N Nikki Haley and un secretary general terrorists all gave her remarks\nAt the event Trump launched into you know very outdated eighties nineties drug war ... about a drug free world drug free future is about eradicating supply and the scars of drug addiction\nWhile ambassador Haley just went on and on praising Trump for his leadership on this issue and saying he's ready to take this leadership worldwide the event in itself the strings so false because Trump has demonstrated no leadership on this issue domestically he's\nTreat addiction and support people who use drugs and may be struggling and has just enforced a very criminal justice heavy approach\nConnected to this event was a document called the call to action on the world drug problem which the U.S\nMission circulated to other un member states which was a one page document\nAnd there are several things wrong with this document I mean both the way it was circulated which was you know is given to these countries saying this is not open for negotiation at the final document and if they sign their invited to this event with Trump and kind of have this photo op\nUh with Trump the UN is I mean as you said it's very bureaucratic but it does rest on the pillars of negotiation and consensus so all documents are agreed upon and ... and other\nCountries got to weigh in and negotiate the language but is\nJust came out of nowhere and said it was final and non negotiable\nSo it's very contrary to regular un pros disease and also ... says he's on drug policy where there's several\nAvenues for a debate and this is not one of them there's also problems with the language of the letter it doesn't mention key UN agencies like development program or it doesn't even mention development goals the un aids\nThe office of the high commissioner for human rights and\nIt kind of ignores some of the agreed upon language and the last few years at the un about human rights development keep populations you know women and children and harm reduction strategies that doesn't have the word harm reduction in it so it's\nThere there's a problem with the language of the tax there's a problem though with the way it was circulated and ultimately I think it was just a ploy by the administration to look like they're showing leadership on this issue\nYou know the non mention of human rights a seems central or as we think about the impact that the drug war has had you know um but there's not just\nAs media might lead a casual reader to think there is not just the Trump world view of things and then people who are only defined\nThat runs counter in terms of the definition of the problem and in terms of the responses represented and in fact those views as it happens we're showcase on the very day that Trump had his kind of dog and pony show\nThat's right so on it's it's ironic that on the day that Trump had this event former prime minister and heads of state that make up the global commission on drug policy that says a distinguished group of world leaders ex presidents of Switzerland and Greece and Colombia and Brazil\nAre together with people like Richard Branson\nAnd before he passed away Kofi Annan\nThey make up this global commission on drug policy in on that very day they were launching their report that's called regulation the responsible control of drugs where they call for an end to drug prohibition they talk about the harms that drug prohibition has reached across the world and calls for taking control of drugs\nThrough governments are responsibly and this is you know this isn't coming from grassroots activist or this is coming from from people who used to hold high positions of power who you wouldn't think wouldn't necessarily be the ones\nFor then didn't kind of these very innovative groundbreaking strategies but they haven't they have experience and their their language is just in such stark contrast to Trump's language therefore it thinking they've seen what hasn't worked they're calling for\nNew approaches that do work and for trying new things as well while Trump just looks backwards\nAnd I said I knew them but I didn't know them well and birds said well\nThey were calling on the floor when I did this to them so the lawyers then went and found Satan and coach he's and sure enough\nThey knew all about this electric torturing pointed them to other victims and over the course of the next Fifteen Twenty years or a list was built up more than a hundred men who'd been given electric shock Kevin suffocated with plastic bags typewriter covers mock executions\nHave been conducted news someone been beaten really severely in a small group of detectives and in the commander who had done and\nHow we are in the local media deal on the case\nWhere the local press is at a disadvantage in that the reporters have to cover the whole federal building so they run in and out of several trials and there happened to be another trial going on at the time of a sports agent and this involves testimony of some celebrities and as a result\nI was really the only journalist who sat through the whole Andrew Wilson trial and then sat through it again because it it ended in the midst trial\nSo the local press did notice that the police change their defense from the first trial\nOur guest room never worked and then the second trial they said Wilson burned himself on that same radiator and the reason why we know this is that we have a jailhouse informant the jury did know that this guy had a long record of fraud or in his national record of fraud perjury\nIn addition to other crimes but nonetheless I was the only one who really spotted that and uh so my story came out\nMy editors thought that would be the end of it that the dailies would run with this are now and uh nobody did it did get noticed by the office of professional standards are the\nPolice department body that investigates excessive force and they reopen their investigation and later cited my story as a starting point\nAnd in Nineteen Ninety three birds was thrown off the force but that was really treated as as a one day story birds thrown off the force over torture charges and in part it was because the police board\n... issued a very vaguely worded statement in which they never said Bridgette tortures anybody and so the next story I did and had to do with the lack of concern about the victims and it was called town without pity and it was\nReally pointed out how the city knowing that torture had occurred was willing to look the other way even though there were men on death row who would be executed unless somebody looked at their cases and they were there on the basis of torture confessions\nWas it that reporters were just in some measure of beliefs about such horrible charges\nI think that's the case I think too that nobody cared about Andrew Wilson and it was a cop killer and a lot of people thought you know he got what he deserved if he got it and I think that's one of the lessons here that in every society there's a torture will class and\nIn Chicago at that time the torture will class was African American most of them with criminal records\nThat was John Connor ... speaking with counter standing two thousand seven his reporting on police torture in Chicago\nSixteen shots testified against the tales in Congo law enforcement were telling about the killing of Seventeen year old African American like Juan McDonald when counter spin talked with Calvin and December twenty Fifteen he implicated media and the bigger picture of police of being\nThe media is part of the same machinery\nAs the police departments false narrative about individual instances like the little pond McDonald's case and larger macro narrative about the state of the city\nSo you part of what is I think getting lost right now and understandably given the extreme and they'd Regis nature of what if he can only be called the execution of a clown McDonald\nIs that this is not a huge departure from the norm I mean this is the norm so in October twentieth of last year the police involved shootings so called of a black teenager on the southwest side\nWas treated by the media on the basis of information solely provided by the\nPolice department and a spokesperson for the fraternal order of police the police union as kind of routine story of\nOfficers self defense young man with a knife lunches at officers shot in the chest I sometime later [noise] completely on critical response police shooting almost invariably about eighty eighty five percent of the time of an African American that's the story that requires between forty and fifty times a year in Chicago\nWe use journalists do not\nUnless there are exceptional circumstances dig into the story to you know do the hard work on the scene in the neighborhood to find out what happened to this day even in this post Ferguson era the tendency is just to publish the police blotter I don't want to exclude myself from that indictment of the press\nI was brought to this story not by my own hunch OR Insight or intuition about what had happened here\nYeah a couple of weeks after the shooting to the fact that the facts were sharply at variance with the official account that there was video and he was in a position close enough to the investigation to say that he was concerned that this is not going to be vigorously investigated\nWe hear about the police code of silence Calvin suggested an expansion of that idea\nA lot of different things have entered into you know ... concerns the nearest reelection but also I think just the culture of how the police department respond to that said this repeatedly in recent weeks it was really striking if you look\nAt just all the different acts including officers at the scene and then how the investigative process was handled at every\nStage and at every level at the police department and the city in response to this orderly appalling incident the impulse the default just the cultural reflex was to circle the wagons\nAnd to a couple of down on what they absolutely had to know it was a false narrative [laughter] so you know there's a lot of talk in Chicago now about conspiracy and cover up and I think those words apply have their place but I think they're also misleading and I think what we're confronting something in some ways more disturbing\nWhich is the culture and you know we talk about the code of silence which is one of those really resonant phrases and it's very evocative because there is in fact a kind of course the silence of police officers who\nWitness abuses but are intimidated silenced by fear of retaliation and I think there is also silence of victims who knows they won't be believed him and won't be taken seriously so that that term makes some sense or another sense in which it's really\nAn appetite because what company might click on McDonald's\nIncident reflects and I think it's an instance of a much much broader phenomena is an absolute ears effort to maintain\nBack to the U.S [noise] that I think is where we have not been affected us we might be in and the trade in in ... in that dynamic and it's critical to do so many other climate Donald SARS [noise]\nThat was Jamie Calvin before that we heard John Connor Roy\nAnd that's it for counter spin for this week counter spinach produced by the media watch groups fair based in New York for more information you can check out our website fair dot org the show's engineered by Eric I'm risotto I'm Janine Jackson thanks for listening to counter [noise]\n\nYou are listening to Ninety point one W. I. UPS Indiana, Pennsylvania\nI thought it was to oh\nI didn't think I had what it takes how am I figured I'd get around to it someday\nBesides is probably to expand you get a cold and\nThen one day I sat down at the piano drums Harvey lately I went to a music store and tried some caution declaring that they learned a few simple no one really knew what he can actually play a song a pretty simple one but I did it for\nMe I couldn't believe it [noise]\nWhy make excuses and then you can make music why wait just dismiss which brought to you\nUm jump shot to\nTime\n\n... ... ...\n... ... ... ... ... [noise]\n\n[noise]\nHave\nAnd we need to do\nTo me is just going\nAt all but um yeah yeah it could\nPlan on being I Am not a good\nGo\nUp to the big things do you know but then at the top and maybe you're not getting the matter is bringing Olympics\nIndependence day you're not a\nBig fan of a\nTo do and now\nI Am not in\n\n[laughter]\nShe she began\nIn\nJohn John\n\n\n\n\n[noise]\n[noise]\nThe winter\nWon't back down by Tom Petty and heartbreak ... may rest in peace\nIs eight or nine in the studio right now on MORNING mix rock and roll Syria with the on now you point one WBFO them with your host which is ... ... I Hope you guys have been a great day to day so far I Know we just started about twenty minutes ago but I'm Still roll them so the\nRock and roll music in general the boss do go in and I'm so super excited for this play list I made it like last night honestly couldn't sleep or anything but honestly like my mom kept running and honestly I just kept adding stronger I kept falling in love with a playlist\nThis next door and coming up like my mind is the Fox running so by the band ... we're going to play Fox on the run which is also the guardians of the galaxy to trailer song but it still is more than that\n... what\nMike or [noise]\n\n[noise]\n\n\nOh\n\nDi da\n...\nWheat or low ball\nBad knees\nYeah de\nDe de\nYou are listening to Ninety point one W. I. UPS Indiana, Pennsylvania\nAre you doing the job was speaking on\nBehalf of Iraq so good rock and roll right but don't drive on the door of your drug problem there\nHave a limo coming\n\nUp in the country that can protect lab National Association of broadcasters and the ... public\nShine Indiana\nListening to the dumps\nGot the money they don't make any person [noise]\nAnd that was take it easy by the eagles and we have a lot more songs that go from that I can just throw it out there for a second it's eight twenty two in the studio on MORNING next rock and roll stereo as you've heard this morning mixed but this is my show on Tuesday so it's rock and roll Syria\nWith your way of noble on Ninety point one W. I. U. P. F. M. it'd be guys like I said I've read John Mica joined in the ... I Hope you guys having a great morning I sure am I Love coming in here on Tuesday mornings at six AM\nAnd you know just plain public broadcasting for an hour or turning on the station and then come and do you guys live with you know great rock and roll music um it's always fun you know some people may think that waking up at six am is pretty bad you know you get used to it but this next one coming up we're going to jump to a little bit of a motley crew on the doctor feel good album this is Dr feel good\n[noise]\n\n\n\n\n\n\n[noise]\n\nAll and they're just trying\nFigure\nRun the place they\nIt should\nHave a lot of people\nOf them are already don't they don't want to come down the guy was on\nTop and they have a\nLot\nOf time on\nDon't know but at\n[noise] ah [noise] ah\nSame thing with\nTo them not to\nWorry about the about\nDemocrat on the dawn of the brain you know you're going through the\nOther but yeah I Do you\nA little bit\nAnd [noise]\n\n\n\n\nOne\nThey need\nTo\nA bad\n[laughter]\n\n\n\nAnd you're\n\nBut I just\n\nNa na na na\n\n\nNa na na na\nNa na\nNa ve\nDa\n[noise] [noise] [laughter] [noise] and you\nKnow\nThe machines are going to go to the ... and to do that in some way to do too\n\nDo the ...\nDid um\nThey don't\nHave a very sharp and her\nAnd to do all your turtles by the\nOr more than ... people made I happen to them they've\n... in a in a movie and\nThen they are and ...\nAnd ... and ... the bigger the man came in to the people here and da da da\nDa da da da da da da da da da da da da da\nDe de de de ... go\nTo a ...\n...\nPeople died and\nIt's not as bad as\nThey go\nOut and ... dollars plus drawn\nUp the rent dot\nAnd it's going to be in the ...\nA a\nLot of the\nDay [noise]\nAnd the day and then I'm\nGoing to be there in the day and and and and ... and ... and ... and ... just because it's going to have a child or\nI went whoa\nRattle where we're from the belong\nBed out that they are by British learn our dead\nA tall\nThen\nThat'd be ... on on on the line now\nLike him or her and\nSlide as to why why\nDo some other leg dead and gone\nFather and his dad may I ask\nThem being all the time on de de\nDe ...\nThey are they\nGoing to be interesting to ... to ... to ... I Would\nTo better right around ... bundle\nWindow or a book by ...\n... by you buy that you know do what they did not want to go\nTo the bottom of\nThe doubt\n[noise] [noise]\n... by you already\nThey're already a riot [noise]\nPassed me by\nA new diagonal ...\nWeigh in total\nThe knob be dying out people\n\n[laughter] [noise] go\nTo the way down on\nThe off a while\nTo go beyond the pale in a way that maybe some day [laughter] because\nI found out they don't\nThat bothers\nMe is that they go on\nAnd when you're out of the last ... and a lot of people that got killed by and\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\nYou are listening to Ninety point one W. I. U. Penn Indiana\nAnd that was murdered buffet by Metallica debris is all that like I said\nIt's eleven minutes on the target just jumped through the entire time on the garage ink album it's definitely one of their life and as long as the topic of the great one is eight forty nine in the studio and mourning mix rock and roll stereo with your host which has me Liam Noble\nHope you guys are having a great morning I say that every time I tune in but I really do hope you guys are I Know that they can fluctuate you can have a great day one minute and the next day your day can go\nYou know bad or whatever but I Hope you guys are whoever's listening or um how many people are listening you guys have a great day no matter what because like honestly the rock roll music honestly I have a great day because of the\nThe next one coming out you guys are the song by AC DC it's a really great song in my opinion especially with the bagpipes in it like the first time I was in the song and I heard the bagpipes I was honestly\nYou're the back by ... we will be blown away\n\n[noise]\nNine nine nine nine nine\n\n\nNa na\n\nSay as\nA\nNo no\nMe\n\nKnow\nDay\nTo day [laughter]\n[noise] [noise] [noise]\n\nDa da da\nDa\n\nDa de da\nDa\nDa da\n\n\n\n\n\n\n\n\n\nAnd that was bad medicine by Bon Jovi you could just tell when he played that song and he told us one more time with feeling\nThat was my first job that I've ever been doing him just saying that really my eight year old self went nuts and started singing along even though I didn't know the lyrics\nIt is not over seven in the studio on MORNING mix rock girl stereo with your host which is merely a noble the next song I wind up you guys is a pretty good one um I'd be kind of those are not making the playlist last night while I couldn't sleep because sometimes I really am an insomniac\nI don't know why don't I don't I'm not diagnosed with that I just like can't sleep sometimes I'll wake up like one AM and I'll just be like I Can't sleep now I'm up\nBut um I was kind of making the platelets like one AM in the morning and I was kind of thinking I don't really play a lot of the doors I Know that I'm with Jake plays a lot on our media next break onto the workday what you should check out Monday's from two to four pm\nBut I don't really play them and they definitely are staple in classic rock and general so I'm going to play something from the ... hotel for you guys this is roadhouse blues\nOr [noise]\n\n\n\nDa\nDa da da da\n\nAnd that was separate ways worlds apart by journey definitely my favorite song by the band in general I Love that song so much and especially when I told him in concert over the summer and they ... you know that's on blasted out with their opening I was blown back I never really heard of journey why new journey like don't stop believing in faithfully and all those other you know\nRock and Roll Hall of fame it is nine twenty two in the studio I'm morning mixed rock and roll stereo with your host which is me Liam Noble on Ninety point one WIP up then your alternative source\nThis next door and coming up you guys and they saw him by queen and I just want to you know I'm super excited for the human Rhapsody movie which is coming out in November\nI'm very excited and I know that um my good co host and good friend as well ... on the ... box which is you know is what we're both coasts on on Wednesdays from eight to nine pm\nHe was saying he's listening to a lot of queen lately so I kind of want to surprise them and play the song forum on the jazz album this is that bottom girls real masters so I Hope you guys enjoy\nOh no\nOh\nNo I haven't read [laughter] oh you know that bottom God you may go to Iraq and um\n\n[noise]\nAnd when\nThat's really nice guy\nIn um\nTakes me on the side [noise]\nThat your red flag died in\nNew candidate oh\nUm [noise]\n\nBut I mean I Know\nLine between a man of\nMad mad mad again\nActually on July\nNo I'm inside the restaurant that\nThat it all hang out fast found on\nIn July and\n\n\n...\nNow so\nVery ...\nThe ... and that is the role\n\nDa da da da\nNa na na na na\nAnd you get your son\nGuess they may do catch a\nDa da\nDa da da da\nDa da da da da\n\nDominant in that\nTo see there you go to you\nTime manager to really be\nFor now the\nIt'll be turned down the\n[noise]\n[noise]\n[noise]\n[noise] yeah\n\n[noise]\n[noise] [noise] and you know\n\n\nOther\n\nWay\nAround and a\n\nGuy in\n\n\n\n\nAnd\n\nYeah [laughter]\nOh\n\nOh oh\nMm [noise] Mm [noise] oh [noise]\n\nMan [noise]\nWhen when [noise] [noise]\nYeah I mean\nSee I don't\nAnd I am and I'm willing to die and then come up and down or not\n[noise] ah\nHa ha\n[noise]\nBut\nI don't know what we are guilty or innocent na na na na\nNa na na na na na na na na\nNa na na na\nBecause the\nIn a gallon you know\n\nThat either\nDid and by\nThe time of my work and da\nDa\nDa da da da da da\nDa da da\n...\nAnd\nAnd I'm not a lot\nAnd I don't know\n\n[noise]\n\n\n\n\n\nAnd that was working for the weekend by lover boy deathly atomic you got to relate to everybody this weekend because homecoming is right around the corner is nine forty nine in the studio or morning next rock and roll Syria with your host witches me Liam Noble on Ninety One WIP FM your alternative stores\nAnd I have one more song before I end this show today on this beautiful morning although it's kind of cloudy and it might rain later on but whatever it does\nThey are last song or my last song for you guys make sure the checkout Jake's lips neck which is my great cohost in very good friend as well on Mondays from two to four pm on break on through the workday that will be next week makes it a checkout Jake an eye on that you box which is tomorrow from eight to nine PM it should be a great show we have a great playlist lined up for you\nAnd make sure that check me out again on smash alley from Wednesday night or Thursday morning however you want to call it from a twelve am due to a um it should be a great time to play a lot of metal and stuff like that a lot more head banging stuff it should be a great time\nAnd make sure the checkout Jake on sports talk live which is right after his median mixed break down to the workday that would be from four to five and there were they talk about sports and all that great stuff although I I Love that stuff I Love talking like listen to football and watching football in general\nEven though the bird's back in Philly or not doing too well and what they're doing All right they're doing to into I'm definitely still\nYou know they could do better but I'm definitely still written for I'm I'm an eagle standard heart I'm from Philly after all\nBut this next on how to play for you guys ... I Will kind of pushing it to the next show so I'm going to make a quick but I Do love you guys and this and that last song is on that I've been kinda same for a very long time\nAnd it's a song it's very dear to my heart of kind of showing it to a lot of my friends that up here it's definitely one of our favorite songs back home on the animals album by pink Floyd this is cheap [noise]\n\nUm\n... were you on\nThe area I Know [noise]\nWith those things that go on and um [noise]\nYou know what the young man that any way Jay Leno and Charlotte Charlotte said the\nWhite\nAnd [noise] oh\nYour own body me saying oh my\nGod I'm a young guy and\nDa da da da da da da da da da da da da da de da de ... decreed convert [noise]\n[laughter] I live in and then ...\nWe are now or in and on and on the up and go to no way to manage your own surge Idaho ... on women\nAnd men\nOr ... or treat me alone ... dogs and they did and you\nWant to eat I shot the charter that he's a very interesting and all that sort of\nTo the way it is why why why\nWhy why why\nWhy do I like the next day so\n\n\nAnd I think too much\nFile space [noise]\nNot going to buy my\nThere really is and I\n\nDay\nThe\n\n[noise]\n\n... ...\nIt's not going to love God that in the ...\nRegular ...\nThere's a no man sitting next to me\nMaking love to do it on a guy in June\nMm Mm\n\nRead em em Ali\nIs but it's still really don't know\nIn there we were\nOr the generation the loan and\nI'm jak nimble\nOn the stage my man we're plunged in\nMy by\nI met a girl who's saying blue\nJust mild and and\nTo the music store where I heard the music is good for\nBut the man said the music\nIn this G the children streaming\nLovers cried in the poets dream\nNot a word was walking\nThe church bells who broke in\nThe three men my nose\nThe father's not in the whole\nThey caught the last train ...\nAnd they were saying in [laughter]\nNa ve but no this was dry\nAnd then go no boys would\nDrink whiskey and\n... with the other day that\nThis will be the day\nHe was singing a prime minister man and I do not sure they do do do you want to do was\nWas drinking will do a thing in the day that I\nI don't want to play out like you say you're my second verse three ...\nThree then we by name like months to get their hands and not get your hands off my sounds over all my friends you know more three dimensional there when you got to keep your weight problems within the Trump so you think you know like they have to sort of showing you knew create wire movement where am I mean there was\nBe in\nIn a boat when I\nRead and I\nAnd so\nCan't ... you know dreaming\nMade to be a\nThing\n[noise]\n\n\nAnd I wonder Dr da da da da da da da\nDa da da da da da da\n\nDa da da da da da\nDa da da da da\n\nNa na\nNa\nWho\nServed in the middle of a\nReal real dumber than a dollar more of a man [noise]\n\n\n[noise] [noise] [noise]\n\n\n\n[noise]\nOh\n\nA mom\nOf three\nBy\nThe time it\nMade you\nThere and then you're\nTo do it on\nHer and her new\nI\nBig game and\nMatters and don't tell me to be good to\nThere\nGo\nThere and\nDo\n\nMerits that we have\n\nFair and [noise]\nThey're going to\nThey\nReally know where\nThe guy [laughter]\n\n\n\n[laughter] I don't\nKnow\n\n\n[noise]\n\nSome\nWill do the world\nDo anything to do and in most yeah\nI grew up in the dominant seeing the dominant shaving in and out\nThere for the wealthiest shot tonight and they don't count\nIt back to the way that I hit the ground it may not know the ball back your brain gets lots of your head you know they do a lot to do so much to the west and the back beat the other now because you don't go out to shine she Joe blow\nAnd\nIt's a cool place and they get caught up in the bundled up now wait till you get the media mesh back the debt by judging by though in the light but just be getting really did want a kitten so you might as well we'll know bio how about your but\nWe like it and I'll never get bored and\nLay down\n\nTime\n\n\n\nGo\nAnd pay down\nThe same\nWhile to be inside without coming back\nCame out\nGas mask God\nI\n\nGuy\n\nNo\nI hear the journals are moving to know what you saw me was the first job so quiet\nIs on the moon that brings reading but\n[noise]\nMan and a man on\nI raise down and break I\n\nNot\nAs big room but the last\nMost was running the shura skills in the journal robotic\nWatch the sun\n[noise]\nBut I've been a blind man on a\nMan I go down and bring them to do that\n\nOr [noise]\n[noise]\n[noise]\n[noise]\nUh\n[noise]\n\n\nYou're listening to\nNinety point one government right now you\nAnd\n\nSo on\nAnd\nOn their feet\nJust seem to come\nIn and\n\nYou can do\nTheir own you know\nThen never did no good [noise]\nYou could feel of a ...\nAnother food to no good\nYou got to the ... too\n[noise]\n\n\n[noise]\n\n\n\nOne change on the new ... new liver you away [noise]\n\nNo but what you knew\nYou got they cared\nOn their people\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise] Mm\nMm\nMm\n\nLike saying well\nBe\n\nAnd tear\nDown the plane down dying\nAt a\n\nPeople go\n\nTo be a\n\nLot in the military\nAnd\n[noise] [noise] [noise]\n\n\n\n[noise]\nHey everyone is me Ryan here coming at you with this huge in here on nine of blood W. I. B. M. them your alternative source\nHave to do it and I\nMiddle of the girls are being there for\nSpeech the name of the\n[noise] the binders than them [noise] to have a sales job just go\nTo the ... I\n\nLand that most people that\nAre paying for the [noise] the staff every day [noise]\nI\nJan space ship way back in the same thing [noise]\nThey will be a good not for the things than they used\nThe stock market no man put them on the ball go bald guy on the lives of Rio Grande do honor and a\nWay to do and go to them for\nA walk down the concern but still\nI mean I Do think that they're going to have to go outside dog do you see\nA movie and they\nDa da\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da\nDa da da\nDe de ...\nMhm\n[noise]\n\nYeah what'd you do with your taking pictures and the question like what people the flowers are best friends\nI'm Sorry I'm afraid I don't know that a felony on his show you something\nLike\nFlowers do have a best friend\nSome answers can only be found in the journal discover the uncertain due to just go with the force dot org and find a drill near you wrote you\n\n\n\n[noise]\n\n[noise]\n\nAble to do and it\nThe\nAnd [noise]\n[laughter] [noise]\nDo\n\n\n\n[noise]\n\n\n\nYou\nTo do\nConditions and the way\n\n\n\n[noise]\n\n[noise]\n\n[laughter] [noise]\n\n[noise]\nThen there are enjoying\nShow and\nShe showed me\n[noise]\n\n\n\nHow old are you are successfully intercepting the Ninety point one megahertz radio beans being transmitted as a speed of light from your alternative source or something you are you fail Indiana\n[laughter] down there and you'll do\nThat way\nLook good for damn sure [noise]\n\n\nDown here\nAnd ah\n\n\n\nOh well\nW. I. U. P. and\n\nNa na na na na na na na na\nGod\nI'm\nIn the Long Island\nAnd\n\nThe won't do this\nThe the they don't let the down\nThey get they may\nMen do bad bad\nThe million man when\nWill never be here and\nBy Clyde and then they\nThey\nI think they did he they\nBad\nMe\nYeah\n\n\nCatches Saturday spot every week here on Ninety One W. I. UPS them from eight to ten PM your host the holiday will play all sorts of punk rock a rock and roll\nAnything I really want to dump out there on the airwaves pretty much it would be my hard drive but not to be my head and if you are listening and you'll receive awards so check me out every week it's ten pm find me on Facebook at Facebook dot com slash Saturday spot of you argue feeds as always listen to Indiana Public radio station and started\nWay more than ...\n\n\n... ... ... ... are\nYou ever seen one of those they would just seems like every motive again to read the joke where down the euro bread\nWell you know you say about all the time and I found a way to get out of ...\nThey May Day you\nKnow what I'm saying don't ever use\nThere\nNo big\nWas that long and loud\nThink we\nMary\nThey made like a\nDa\nDa da da\nDa da da\n\nOut\nAnd our law\nAround the\nLaid off you know\nThe fly\nThe mail man\n\n\n\nNow they're saying\nYou know\nAnd\n\nMaybe we need to be some do you mean me\nAnd\nAnd that and uh\nOur and our [laughter] our our\nRight here by this guy [noise] pastor or a tree\n[laughter] a long time\nAnd I\nNo di di\nDi di di di di da\nDa na na na na ve to get by\n\n\n\n\n\nA male and\n[noise]\nAnd [noise]\nAnd and and and and and\n[laughter] no nowhere\nThere and I'm Linda [noise] yeah\n[noise] no\nNo and and and ah [noise]\nAh\nOn one you hear about an hour ago and now gotten you know nine eleven [noise] and ah\n[noise] are\nDi di\nDi di di di\n... they please and you know\nAnd yeah\nAnd\nUh and\nAnd\n\n\n...\nAround\n...\n\n...\nThe around\nThen in the shadow\n\nAre\nYou in the\nNews or you know this\n\nIs why you get a\n[noise]\nThe news about\nNa na na\n\n\n\n\n\n\nCheaper\nAnd all your dreams and\n[noise]\nAnd you know\n\nThan they\n\nWere bad\nBy\n[noise]\n[noise]\n\n\n\n\n\nWas Led Zeppelin with what is and what should never be\nAnd what is and what should never be in your weather forecast for the next few days or this afternoon there's a chance of showers and thunderstorms cloudy with a highway near Seventy seven\nJets precipitation is eighty percent for tonight showers ... also likely before too in the morning and then another chance of showers afterwards mostly cloudy with a lower around sixty\nFour tomorrow partly sunny with a ... near Seventy three or Wednesday night partly cloudy lower I'm sixty four for Thursday showers ... mostly after one PM but the highest near Seventy nine\nFor Thursday night showers and thunderstorms are likely before twelve AM and then a chance of showers between midnight and do am most cloudy with a lower I'm sixty five\nFor friday chance of showers after eleven am partly sunny with a hard and you're Seventy or Saturday chance of showers before ten am partly sunny with a high near Seventy seven\nFor Sunday mostly sunny high near Seventy eight and on Columbus Day mostly sunny will die near\nBad for any of you are individuals who liked to go out and be bag or bonds during homecoming you may get rained on but ah hopefully in your\nAltered state of mind from all the homecoming festivities you probably won't mind\nUp next we have the more music so stick with us as in Ninety four I wanted to be ... in our guy was playing music until two in the afternoon for a while to do\nEvery weekday um with me specifically drawn from a while to do in the afternoon yeah not even on WBFO ... thanks for listening folks\nAnd um [noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\nThey need\nTo do or do they go down to [laughter]\nTo to do what you do have to do [laughter]\n\nYeah [laughter] yeah [laughter] yeah I\nDon't know why\n\nDoes that mean that ball\nAnd go\nTo Brad address [laughter] I don't even have to worry\nAbout that prior to run again you can read more about the green with better and you know when the ball\nDown to about maybe going to\nDo and should be able to do\nAnd who sent all the time you do\nFor a fan of you know I'm ...\nFor\nThis is Ruth Ruth with us [noise] [noise]\n[noise] food food food food is really nice [noise] do\nYou have for this [laughter]\n[noise] if\nIf if he became an independent country continue to be to be able to get them to get them to better protect down\nInto the battle\n\nNeeded in the sixties in unity do we need to do when someone needs to be the\n... don't know that um the young woman other news now in the guns do you know being a mom\nSo do you just do\nWhat I Do believe she ... she can do ...\nBaton Rouge in your\nTime you can do to\n\nTry to do\n\n\n\n\n[noise]\n[noise]\nFaster than\n\nThat is\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n\n... and I wanted to be I B. S. than me noose heard some um I guess I knew were versions or of a classic rock songs you heard a a T Miller's up why like New York a more recent version as kind of unsettling to hear what I liked it but\nI e mess with the rhythms too much and I I I Will I prefer the original version and this I actually don't know the original artist\nOf 'em that strong a\nCase of loving you I'm pretty sure it's not by those\nVersion and what you're probably a used to so without further ado we're going to read some public service announcements were the station and then jump right back into the music for the next hour and Fifteen minutes of Showtime\n\nAt ... ... ... there's a keyboard on my way sorry [noise] ooh this is important\nThe deadline for a voter registration is quickly approaching to vote in the next election you must submit your registration application by to overnight BA residents could apply quickly and easily online but by visiting P.\nP. A. voter services dot P. A. dot Gov and clicking the voter registration like again PA register residents must register by a job or not to participate in November's local\nState and federal elections very important if you would like to uh take who represents you and our Republic of the United states of America\nOctober sixth there's the six o'clock series continues with rooting out micro aggressions in our daily interaction\nThis event will teach their three different types of micro aggressions aimed to teach students how to recognize them and their own lives\nIs event takes place in the hubs or hire him from six PM to seven thirty pm for more information visit WWW dot ... dot edu slash six o'clock series of six isn't a word six not the letters six or number six not the numerical character six I Wonder what a micro aggression\nIs I'm guessing if something small that makes you mad or something that makes you a little mad I don't know if it has to be small maybe it does\nI I think another word feathers pet peeve maybe I don't know maybe I should go to the seminar [laughter] anyway more music up next year Ninety point one W. I. P. F. ... thank you for listening this is the afternoon dark I was\n\n[noise]\nSide of the rank and what do you\nWould you know black a real dog does that\nThe ... really I'm not that I read on the\nLine\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n\nThat panel on line\nAnd\nKnow how to pay the rent on time\n[noise]\nA\n\n\n[noise] ...\n\n\n\nI\n\nDa\n\nDa da\nAnd\nSo that had been productive\nThen\nThey\n\nThe early in the day in day to day\nMany many many\nWomen and and\n\nNow they are a\nMile and a\n\nAnd wanting to do and\nAnd and then there are other into another country or any other day and she\nAnswers coming in and out to eat and drink and then you got a\n\n\nAh they're\nBack\nEvery and get out of\nNo I don't mind the trash dump Don said that goes on and\nBe gone around [noise]\nUm [noise] and the da da da da da\nDa da da\nDa\nThe day good for you know\nDuring the live really do the right\nNo\nNo no\nNo no I mean that was a ...\nYear old and\nI'm a runner who\n\n\nI Know\nNo\nI was calling is it the more\n... than we do know that gene bar\nBut we may well be [noise]\nUm do\n[noise]\n\nWell it was American is a national organization that were over a hundred years the reminded programs and services did allow people to overcome their challenges\nTo become Lytle numbers of their community that volunteers of America\nWe don't tell people we help people help us do we find out how you can support the programs that are working in your community contact\nVolunteers of Americans today call one eight hundred eight nine nine\nZero zero [noise]\n[noise]\n[noise]\n\n\n\n[noise]\nWhy German actors and di di di\nDi di di di man\nAnd the family [noise] box cheese\nIn the war\nIn Iraq and Iran and\nThe last one and I can run\nAnd\n\n[noise]\nYou know the [noise]\n[noise]\nIran Iraq [laughter] [laughter] [laughter] [noise] [laughter]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[laughter] [noise]\n\n[laughter] [noise]\n\n[noise] [noise]\nThis is W I asked them you're all\nReady for me\nNa\nNa\nNa na na\nNa na na na\n\n[noise]\nDo you go\nWhy do these people can\nAnd I are going\nHere they are\n[noise] [noise]\nMan [noise] na\nNa na\nNa or\n\n\n\n\nMm\nMm\nMm Mm [noise]\nBoarding went into this\nKnow do what they didn't take a little low\nSo but you know he used to play\nIs it a little on the moon I'll never thing you know\nJanitorial normal no one will be taking the\nIs a big ... big ...\nNumber came to the dog would do you do get\n\nWhat the real world\nCertainly we want to be er and joining us oh\nAnd the the ... the thing\n\nYou breathe when the\nThen one day\n\n\nI'm any good in the host of democracy now your daily grassroots liberal and imbedded international independent news hour\nThere'll be I use the um bend now airing democracy now from the week Monday to friday but by the um on your alternative W. I. P. Ninety point one tune it you won't forget\n[noise] [noise]\nBad and\nTo be made people do that again the bill will be eating\n\nDo\n\n[noise]\n[noise] [noise]\n\nThey need\nFor the three [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] the\nWay from the [noise]\n[noise]\n[noise] [noise] in the national news and the [noise] the only\nThing that\nWay the\nThe\nThe ...\n\n\n\n[noise]\n[noise] maybe you\n\n[laughter]\n\n[noise] [noise]\n\nThere is no way [noise]\n[noise] [noise]\n[noise] you know oh\n[noise] well\nThey may be um [noise] and\nYou\nKnow [noise]\n\n\n\n[noise] I\nDon't know\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\nDown down down\nDown down\n\nDown\nDown down down\n\nDown\nDown [noise]\n\n\nOh\n\nWhen\nMade him [noise] [noise]\n[noise]\nThe town that may get\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nAll right that was the ... campaign came with love come down and to be a point when if you are listening\nOf three\nBeginning your mind\nCalled they often\nGo\nCan be\nPut in\nThe\n[noise]\nAnd\n\nRight that was that Marlina Shaw with California Soul your interview I Wonder if you are listening to the median\nMixed Tuesday edition my name is ... ... and before we jump back into the music we're going to take a quick look at the weather for this week currently outside it's mostly cloudy\nHigher of Seventy or it's currently Seventy three degrees outside or we're looking at eighty three percent humidity it's gross out today it's it's not an October day outside uh we're looking at chance of showers and thunderstorms cloudy with a high and you're Seventy seven for today\nChance of precipitation is fifty percent new rainfall amounts between ten and a quarter of an inch to nothing nothing major\nUh but you could accept higher amounts in possible thunderstorms so that a lot of rain amount which will be if it only rains if it's under storms that will be higher\nOr tonight we're looking at showers and thunderstorms more likely between or before two AM than a chance of showers after mostly cloudy low around sixty degrees south west winds friday miles per hour\nOr tomorrow we're looking at partly sunny sky is Seventy three degrees this is not October get together whether please\nA Wednesday night we're looking at a low of sixty four partly cloudy skies please be cold or a Thursday we're looking at eight thirty to eighty percent chance comes under storm so that's a big pretty big gap I'm I'm sure the meteorologist as very unsure about that one a hive Seventy nine degrees come on\nA Thursday night sixty to twenty percent chance\nThirty percent chance of showers with the higher Seventy to come on thirty percent chance of showers Friday nights then mostly cloudy skies Saturday partly sunny than a chance of showers\nI Seventy degrees come on this is not October whether I just wanted\nTo be cold and Halloween and so like where I can be comfortable wearing jeans and a sweatshirt\nThat's all I Want I have all this new clothes but I Want to wear full but whatever I can have what I Want\nAnyway there's one way that you could have your say into having what you want and that's by registering to vote we're going to take a quick look at the library PSA which is on voter registration the deadline for a voter registration is quickly approaching devoted to the next election you must submit your registration application by October night\nPA residents can apply quickly and easily on line by visiting pie a voter services dot P. A. dot Gov and clicking the voter registration link again to PA residents must be registered by October nice to participate in November's local state and federal elections\nThat's next Wednesday guys October ninth get out their vote please registered to vote because voting is important and our country is in a big\nWe're we're in a state right now where things could go either way and if you want if you want your voice heard if you want to be part of the change if you want to be if you want to make a statement if you want to be part of the change your help out and make this country a better place you've got to get out there and vote\nGet these people who you want in office or keep them in office no matter what it's\nYou you just got to do it I'm registered to vote I'm ready to vote I'm excited to vote in the next election um yeah get out there and do that guy's just important it's the future [noise]\nOr we're gonna take a jump right back into the music here's Diana Ross it's I'm coming out um WIP Ninety point on\n[laughter]\n\n\n\nThat guy and\nThen\n\n\n\n\n\n[noise]\nAh I just don't enjoy it as much and I I just like um a lot of the beach boys music is very very very emotional and very like fueled on\nHow you could just I feel that the beach boys initial running the sixty you can feel Brian Wilson's passion\nFor for the music that they are playing through through the sounds you can tell that everybody who's playing is is doing it because they love playing that music and I feel like he gets a little bit lost in a some of the stuff that they released in the eighties\nBut then there's there's there's little gems and there there's Kokomo and there's there's that song very somber so it's it's\nI feel like that song was written to be in the end credits of a movie and I'm not sure if a movie exist where that song is using the credits but if not all make one\nAnyway ah I Apologize for that so for that or\nA set of music being a little bit longer I was checking out a I was reading up on the new venom movie which I was excited for\nA until the review started coming out and they're saying it's a train wreck however upon why was viewing reading about this new rent a movie with Tom Hardy which I'm Still going to go see probably this weekend\nUm 'cause I I absolutely adore Spiderman and I will pay money to see anything\nRemotely involving Spiderman which is what led me to watching the newest trailer for Spiderman into the spider verse which is the animated movie the animated Spiderman movie that is coming out this Christmas I Believe\nAs shelving fantastic from Netflix the Netflix series or the get down which is a personal favorite of mine or um the film dope he was the main character in that is voicing miles round which I thought it was a very very very good casting Joyce\nAnd I'm I'm very excited to see miles morale is a appear on screen as Spider Man I think that's very cool and I think that there were a lot of opportunities in the past to introduce miles morale is as just like\nBeing like okay this is Spider Man this is miles morality Spiderman\nAnd not even being like oh here's Peter Parker coming in to teach this kid had ... Spiderman\nA there are a lot of opportunities to do that and this movie seems to be like\nI it seems to be like this is miles and miles and he's used it Spiderman and the universe and then Peter Parker comes from a different universe and he teaches miles Ralph how to be Spiderman\nSo maybe me getting excited for it because it did something that I didn't want it to do\nMaybe that's a little premature I haven't seen the movie yet it looks very good the cast also includes a Jack johnson from or who you might recognize you might know from the movie tag this summer which I saw it and I really enjoyed\nUm he's he's voices an older Peter Parker who's a little bit out of shape which I thought it was hysterical when I first realized like what they were doing with Peter Parker a you've also got Nicholas cage as Spiderman the war Nicholas cage is Spiderman\nOr and my personal favorite casting out of all of these is John Mulvaney as the spectacular spider ham who is an if you don't know who spider him his he is an alternate universe version of Spider Man who is an anthropomorphic pig\nAnd that casting is just perfect I I Love ... I Love spider ham he's just such a goofy character it it's just I Would love to see a spider and I would like to see them focus a lot on spider Hammond is but maybe not a spider ... movie there's just so many in jokes to make his name is Peter Parker\nI'm Talking about Spider Man and things that people don't care about you probably just like shut up with the music\nAnd you know what I Will [noise]\nWe're going to jump back in your Bobby Brown it's every little step on WB\n[noise]\nWhere they can still go out\nMean you can get another bank he looked\nMay pick ... odd\nCan explain this big time you get is\nAbout that in mind\nKavanaugh's Yale classmates have made similar remarks about Kavanaugh's drinking last\nWeek one of them Kavanaugh's classmate it yeah Luisa Gary withdrew her support for cap and all she has been featured in an ad by the Judicial Crisis network that has been running on television\nAnd Indonesia the confirmed death toll from friday's earthquake and tsunami has reached at least eight hundred forty four it's expected to rise to the thousands as rescuers are just beginning to reach some of the more affected areas on the island to sue the way say\nThe seven point five ... magnitude quake toppled hotels mosques and shopping malls in the city of Paolo landslides buried entire nearby villages\nThe United states and Canada have reached a tentative deal to save NAFTA the north American free trade agreement the new try lateral deal will be known as the United states and Mexico Canada agreement and a victory for American dairy farmers candidate\nHas agreed to open part of its dairy market to us imports the new deal does not resolve the dispute over us tariffs on Canada steel and aluminum exports\nThe proposed deal must now be ratified by lawmakers in Canada the United states and Mexico\nLori Wallach of public citizens' global trade watch criticize the new deal saying quote\nUnless there are strong labor and environmental standards that are subject to swift and certain enforcement us firms will continue to outsource jobs to pay Mexican workers poverty wages dumped toxins and bring their products back here\nFor sale Wallach set\nIn Brazil tens of thousands of people took part in women lead rallies in Rio de Janeiro Sao paolo in other cities Saturday to ...\nBoth in auto is currently meeting many polls even though he was forced to stop campaigning after being stabbed last month both to NATO was former army officer who's openly praised Brazil's military dictatorship which lasted from sixty four to Nineteen eighty five he said he used his government housing allowance to pay sex\nWorkers called women week threaten gay people with violence and called a political opponent too ugly to rate the theme of Saturday's protest was not him my\nUm because her resent so long\nPeople the people\nDemocracy that we are\nIn news from Gaza Israeli soldiers fatally shot seven Palestinian protestors on friday and injured more than five hundred others taking part in a protest\nThe dead included to Palestinian boys aged twelve and fourteen Israeli soldiers have killed at least a hundred Ninety Palestinians in Gaza since the great march returned protests began in March meanwhile Palestinians\nAnd the west bank Jerusalem in Gaza have launched a general strike today to protest against Israel's new Jewish nation state law that declares only Jews have the right of self determination in Israel\nDuring a rally in West Virginia Saturday President Trump heaped praise on North Korean leader Kim Jong on saying the two of them have fallen in love\nI was really be self and so was I Will go back and forth and then we fell in love\nLet alone a horrible\nIs [noise] so on presidential\nNews from Burma the families of two imprisoned Reuters reporters have asked for a pardon the reporters were detained in December while they were investigating the killing of ten real Hindu Muslim men and boys by security forces and local Buddhist and Burma is rock Heinz state\nOn friday supporters of the writers reporters held an event to the United nations speakers included their attorney among Clooney\nHe says about much more than just to innocent men I mean if you care about press freedom you care about this case because it sets a precedent if these people that look up and other people that you've got to do the kind of reporting that they do and too many countries around the world with being a critic regimes look up anyone who criticizes them\nI'm a news a whole host of laws to basically criminalize speech\nAnd cost descent and you have to fight every single time that happens\nEnvironmental news the Trump administration's taken a number of steps in recent days to roll back environmental regulations and over say the New York times is reporting acting environmental protection the administrator Andrew wheeler\nHas completed a proposal to dramatically weekend in major environmental regulation covering mercury a toxic chemical emitted from coal burning power plants\nMeanwhile the Interior Department is proposed loosening major offshore drilling regulations that were put in place after the two thousand ten Deepwater Horizon oil rig disaster and the Gulf of Mexico\nThis all comes as the EPA has announced plans to dissolve its office of the science advisor which was created to give the head of the EPA sound advice about science\nDetained migrant children from shelters across the country to a barren tent city in West Texas the times reports hundreds of children are being sent to each week from shelters to the tent city which currently houses sixteen hundred children\nThe U.S government is now detaining a record Thirteen thousand migrant children\nA federal judge has ruled congressional Democrats can move forward with an anti corruption lawsuit against President Trump\nThe suit accuses Trump of violating the foreign emoluments clause of the constitution by receiving payments from foreign governments through the Trump International hotel in Washington DC and other establishment around the world\nThe Justice Department sued the state of California Sunday night shortly after California Governor Jerry Brown signed a net neutrality bill to restore Internet rules that were rolled back by the Federal Communications commission last year\nCalifornia's attorney general savior ... defended the state law saying California will not allow a handful of power brokers to dictate sources for information or the speed at which website\nSlowed unquote in other news from California Governor brown has signed legislation requiring all publicly traded companies based in California must have at least one woman on their board of directors by the end of two thousand Nineteen\nMassachusetts Senator Elizabeth Warren has announced she's openly considering running for president and twenty twenty she spoke on Saturday in Holyoke, Massachusetts\nFor women\nTo go to Washington are broken\n[noise] I Will take a hard look\nAt running for president\nAnd on friday protests were held in Dallas in New York to honor slain Texas men both John on the eve of what would've been his twenty seventh birthday John was shot dead in his own apartment last month by a Dallas police officer who is now facing manslaughter charges protesters\nDecried the killing of both I'm John\nFong was murdered in his\nHome\nAfter all of a certain number Dodger\nOfficer in Virginia was shot\nHim\nWe're here\n\nThere was just some of the headlines that says democracy now democracy now dot\nOr the war and peace report I'm Amy Goodman\nAfter a dramatic friday began with the Republican led Judiciary Committee planning to approve Supreme Court nominee Brett Kavanaugh\nAnd ended with a pause for a week long FBI investigation and Dr ... Christine Blasey Ford's claims that cabin or tried to rape her and high school Democrats are now focused on how the probe is being handled President Trump ordered the FBI investigation friday\nAfter Republican Senator Jeff flake of Arizona surprised his colleagues on the Senate Judiciary committee by green to advance Kavanaugh's nomination only if an investigation took place the committee voted eleven to ten in favor of Kavanaugh Supreme Court contests\nDecades of progress in our country on women's rights\nShow explain what happened when he went into the elevator when you spotted him\nUm there were some reporters standing around um the door of his office they spotted him first and they ran behind him\nMoney and I ran behind them and you know Maria before I did not know Maria we had just met I didn't know her story she I knew we were she was telling me that it was her first time trying to talk to a an elected officials so I was giving her tips like you can share your story tell them what you were there\nUm and um we just ran into the [laughter]\nAnd I just put our foot and the door as it was closing and then just stayed there\nAnd um the adrenalin of running behind him at the fact that we knew that we just had a few minutes\nUm we use those minutes in the best way we could we I think without really explicit you're talking about it we were really demanding a connection\nWe're really asking him to be there in that moment and feel the pain and the rage that women across the country and survivors survivors across the country are feeling ring and show you told him you are sexually assaulted\nI ... I said to him Senator Flake feud that just a few days ago I stood in front of your office and for the first time shared my story of sexual assault [noise]\nUm I did it because they recognize myself my own experience ended up to Fort testimony um and I I I Want to I Want to know what you know what are you one message are you sending to your children and my children\nUm do you think it's a ... are you comfortable with the idea of putting someone who's been accused of sexual assault in the Supreme Court for the Next Fifty years and we're both of our children to grow up in that country\nSo you are also trust publicly talking about your sexual\nThe same reason and it took me many years more than ten years before I told my mother\nUm and um I might that fear that I had as a child was confirmed that thing that my father take that back was I'm so sorry I was not able to protect you so I Know that we don't tell our stories because\nWe are often confused ashamed feel responsible and are afraid to cause pain to the people that love us\nWhich is one of the answer as to why Christina Ford hasn't told her story for all of these ...\nThat's exactly right um I Wanna say you know lots of people are talking about Iraq can you do you think that you changed you know flakes not Senator Flake mind and I think if it touches being Monday and I ended up elevator and if he had just heard of that for the first time the story of someone from the first time\nI Do not think that he would have changed to vote I think it was the cumulative effect of thousands and thousands of people\nI'm pouring like going through these incredibly painful experience to try to change the culture to bring into existence a new country a country where we are not constantly\nIgnoring the believing I'm doubting that truthfulness and the value of women out of our stories of her voice as a country where we're not um relegated to a you know experiencing not just sexual violence but political violence by [laughter]\nUh and economic violence so so I think all of us are doing this incredible kind of labor of love of telling our stories and through that pain bring a new country into into existence um and that's really what\nAnd the Senate Judiciary committee committee to confirm um the judge Kavanaugh as a as a Supreme Court justice so it was eleven can\nParty line vote mhm where were you when you heard this\nThat he said he would not vote yes again where it counts and the Senate floor unless there was an FBI investigation\nI was in the same a can of atrium of the Senate building where I had met Maria or when they heard both of those uh events I was not close to a TV screen I wasn't watching um the events as they were unfolding I was hearing reports from people that\nUh we're watching it and I both both ah both points I was you know could have surprised and shocked um and reminded that really\nLike people it's that that\nIf we sit back and allow events to unfold by themselves um we give up all of our power out these nomination denomination of Brett Kavanaugh was I'd given at the beginning of the summer at everybody assumed these was\nGoing to happen without any snack um and I think people who know that they were going to lose their health care women who knew that our rights were at stake said well we still have to fight and it was that spirit\nOf like well we still have to do whatever we can to try to stop and that ... buildings no matter what happens you have Changed History\nUm I Hope that we really change history all of us everyone that's watching today out by showing up these week I think we have an opportunity to change history I Want to make sure that we don't we don't\nThey did to his Supreme Court the court works for us um we all in the same way that we're asking senators to take these beans ... decision very to take this responsibility very seriously I Want to ask people in this country to take these women very seriously cold year senators if you're near Washington DC\nCome to Washington DC show up at the heart Senate building every day these week at nine o'clock come to a rally that's going to happen at noon on Thursday in DC\nAnd you are a true organizer I think the media denigrate the activists they will often say showing came for the first time of her own volition she'd never protested before and I think implicit in that\nAre that there are what they call professional activists ... you were the coal executive director of the center for popular democracy says or talk about what that means popular democracy\nI think popular democracy is both um what we as fire a these countries to be we I we the people at the center for popular democracy the people who are showing up for the first time that people who have been showing up for years\nUm are all of us share these ideas that democracy is not a spectator sport that it is that we ... that we breathe life into it every time that we engage\nIn that it belongs to us in the way is is both are protective shield in some ways against corporate power but it is also a the way in which we express our love for each other um and our willingness to take care of each other\nA so that both both of those ideas are what I'm you know what why popular democracy is that thing that uh my organization is trying to\nWhat would you like to see the FBI\nAsk what questions do you feel needs to be answered and the issue of the number of people said they want to talk to the FBI who has not been contacted yet President Trump says they have one week week and the um investigation is very limited\nMhm [noise] I wanted to make sure that the women who were so courageous a and came out in public to I'm sharing their experience of what kind of know get a full hearing that the FBI really ah does everything in its power to ah\nUnderstand their stories um I Want to make sure that uh the investigation of also reaches into all the people that were around Brett Kavanaugh at that time I'm leaving the country deserves um uh and and we fund we desperately need people to have\nTrust and the court um but again I don't want us to just give up our power and wait for the FBI to resolve these questions I wanted to all of us to you know I Want to build all of us to become a legion of\nElevator [laughter] across the country let's make sure that they look at us led sharp and say look at me look at me that's what social movements are made up look well\n\nRang and\nRang and\nRang and\nAnd\n\nYou know either and I'm I'm\nTime and I want to try and do do\nA lot of ... well\nSure it was on the line and all the way she was in the\nMirror and you know and\nThe brain and where\nHe you know kind\nI'm a I'm a ...\nLa la la la la la de do\nA blood that long ago\nBut um but on the bus was but it\nKnow and I'm In the middle of the brain\nYour ... on and yet as\nHe\n\n\n\n\nIs Ninety One one W. I. P. O. Indiana alternative store ...\n...\nGet a\n... ... ... ... ... ...\nSure\nChanges the way down\nOr spring yeah\nThey\nDe da\nNa\nFashion\n[noise]\nMm Mm ...\n\nWe are\n...\n\n...\n\n[noise]\n\n\n\n[noise] the\nDa\nDa da da da\n\nDa da da\nDa\nDa da da da\nDa da\nDa da da da da da da da\nDa da da da\nDa da da da da da da\nDa da da da da da da da da da\nDa da da da da da\nDa\n\nDa da\n\nThe point one W. R. U. P. F. M. India\nThe\nProblems is that the guy that is democracy now fortunately we had\nA we have a good saying that we were sold furniture to the bugs to this day to be low was reminding people for Bob for the talk which is what happens in Georgetown Prep stays at Georgetown from\nThat's been a good thing for all of us are\nAs the FBI expands the scope of its probe into Supreme Court nominee Brett Kavanaugh will speak with a former student\nPrivate high school Georgetown\nWas calling I'm a graduate to come forward if they have information about any sexual assaults possibly committed by\nWe speak to the American civil liberties union which for is only the fourth time in its history has come out of his whole to Supreme Court nominee now the ACLU is running ads in the states again\nWe've seen this before denials from power and\nSexual relations with a\nLittle history movie streamline this\nCategorically unequivocally deny the allegations against me by the\nAnd as we choose a lifetime to feed on our highest court haggard in matters and\nWe'll look at the new trade deal between the United states Canada and Mexico will benefit workers and protect the\nWe'll speak with Lori Wallach of public citizen's global trade watch all that and more coming\nSaid Monday he wants the FBI to expand the scope of its investigation into Brett Kavanaugh even as he said the Supreme Court nominee had been treated unfairly by the media and promised the FBI would work quickly to complete its probe\nI Want them to do a very comprehensive\nInvestigation whatever\nThat means according to the senators and the Republicans are the Republican majority I Want them to do this I wanted to be comprehensive\nThough Washington Post reports the slightly expanded investigation will now include all look into allegations by a third cabinet accuser Julie sweat neck\nBut says she observed cabinet highschool parties in the eighties joining efforts to ... girls so they could be gang raped the FBI won't have much time to complete its work Republican Senate majority leader Mitch McConnell said he's planning a vote on Kavanaugh's confirmation by the end of the week\nThis comes as NBC News is reporting cabinet and his team work behind the scenes to refute claims of sexual misconduct by his former yell classmate Deborah Ramirez before her planes went public\nRamirez told the New Yorker Kavanaugh exposed himself to her by thrusting hurt his genitals in her face it a drunken dorm party when they were both ... freshman\nNBC reports cabin up personally contacted former classmates ahead of publication by the New Yorker urging them to go on the record in his defense\nThis country debt this contradicts judge Kavanaugh sworn testimony to Senator Orrin hatch and the Thursday hearing that he only learned about Ramirez is allegations from the New Yorker article meanwhile\nBest of Yale University after the pair attended a reggae concert in Nineteen eighty five this is Chad ... speaking on CNN\nRip them said the\nNew uh for something to that effect\nAnd um food ... through the eyes of the guard a and I'm the guy who understandably even though he had been aggressive in his response of film that was a little one step too far so we took this weird bread and then we were kind of a two\nTwo guys fighting the FBI is investigating\nThe Nineteen eighty five bar fight in which Kavanaugh was questioned by New Haven police but not arrested\nProtest against Kavanaugh's nomination continue to rage across the country in West Virginia Seventeen women gathered inside the Charleston West Virginia office of democratic Senator Joe Manchin Monday saying don't occupied the space until mentioned pledges to vote no on Kavanaugh's confirmation\nIn Washington D.C.'s National Airport women survivors of sexual assault try to speak with Senator Mitch McConnell Monday as he walked across the terminal but word nor by the Republican majority leader\nWhy women have to reorder whole\nWhole\nIn New York City hundreds of protesters gathered outside the club in Manhattan Monday\nFor marching to Grand Central station to protest Kavanaugh's nomination [noise] this is ...\nAn activist with the New York state nurses association and editor of\n[noise]\nShould be\nPresident Trump is under fire for belittling women reporters at Monday's news conference in the rose garden\nMrs Trump calling on ABC News is Cecelia Vega for the first question of the news conference you'll get a question\nDo you go ahead I'm sure\nShe shock that it was it was too short [laughter] I'm not thinking of food do you know\nThe president saying I Know you're not thinking you never do the White House has come under fire for editing the transcript of Trump's comments to say I\nKnow you're not thinking instead of thinking\nThe Supreme Court began the new session Monday and it's the ongoing saga Brett Kavanaugh's nomination to the open ninth seat on the bench the courts opening case involves the preservation of an endangered frog species that dust can go for\nPutting the government against the timber giant warehouse or which is seeking to develop land that's been designated as critical habitat for the frog\nThe court also rejected an appeal to review of two thousand Seventeen case upholding the legality of the ban on new uranium mining near the Grand Canyon a decision celebrated by environmental Native American groups who live in a protected area\nIn Indonesia the death toll from friday's massive earthquake and tsunami is that over twelve hundred people it's expected to continue rising as the United nations humanitarian organization said more than a hundred and Ninety thousand people or an urgent need of aid\nAmong the dead or thirty four students whose bodies were found buried Monday after a landslide in both their shirts\nSeven point five ... magnitude quake and cold office to nominee warning to early\nIran's revolutionary guard said Monday it's fired a barrage of missiles into eastern Syria in retaliation for the deadly attack in uh vases last month Iran believes the avant attack which killed twenty nine people and wounded Seventy others at a military parade in the southwestern city\nOf Iran is the responsibility of separatists supported by the United states and Saudi Arabia reports on casualties from Monday strike are unconfirmed\nScores of protesters were injured Monday in the west bank Gaza Strip in East Jerusalem the Palestinians and Arab citizens of Israel clashed with Israeli forces during a strike to protest Israel's Jewish nation state law\nThe law which passed in July declares only Jews have the right to national self determination and established Hebrew is the official language this protest or ...\nOr messages one message to the nation state law which he lived for father's been groomed their first lady\nMelania Trump has arrived in ... as part of her first major solo international trip the first lady will visit Donna Kenya in Malawi in Egypt over the coming week\nIn January democratic lawmakers said President Trump referred to Haiti El Salvador and unspecified African nations is being close asshole countries during closed door meeting at the White House Trump has denied making the remarks\nIn Barcelona, Spain baton wielding police broke up demonstrations and sit in protest by cuddling independence activists Monday is estimated a hundred and eighty\nPeople marched on the first anniversary of a referendum on independence that was banned by Spanish authorities riot police clashed with demonstrators outside the headquarters of Spain's national police after activists occupied Rosa highway and high speed rail line stopping traffic for hours a year ago more than eight hundred people were injured after Spanish police store\nSigned on so far uh yeah I was\nUm we were first moved to to do this um because we felt that it was stunning to me that we as a community I Believe no so much about what was going on during the eighties and and perhaps party culture um and that there are many graduates with the class of eighty three who were close to Brett\nBut who have not shown their faces they've not they've not spoken out about what was going on either in his defense or in Dr forced defense um and so I I I was stunned by that violence and felt\nWe have to try to do something to to shake my classmates and my schoolmates up and get them to think this is an opportunity for you to do the right thing and if it if if our little position and our drive to get them to speak um gets even one of them to say something that I I feel it's been a success\nAnd Bill Maher bowl or you were a freshman all when no Brett Kavanaugh was a senior at their school or did you uh how well did you know him and when you were to saw the testimony how does that jibe with your recollections of what he was like\nWell I didn't know Brett personally and I think it's important to note that I I don't consider myself a witness in this case in any way shape or form again I was a freshman and he was a senior he was a very big personality on campus he was a I'm a\nFootball player he was kept on the basketball team it was hard in a roughly four hundred person school not to know who the real social leaders were um even as a freshman\nUm so I knew him and his crew more by reputation than personal observation um however it just struck me during his testimony that\nGiven what I Know about perhaps party culture in the eighties um\nAnd knowing that he\nBragged openly on his ... page about his participation in that party culture that he would run\nHappened when he was under the influence of alcohol and that just felt wrong to me\nAnd um I I Know that there are there must be people who are closer to him closer in age enclosure in in social commitment ... that have to know more about what was going on and I think we've been seeing now from his classmates and I would like to see that from his\nPrep class in Nineteen Ninety the Washington Post reported that had masters from seven prestigious Washington DC area private schools including yours Georgetown Prep and Kavanaugh's\nHad sent a letter to warn parents about a party culture among their children\nWhich included heavy drinking leading to quote sexual or violent behavior the article quotes headmaster at Holton arms saying quote a number of parents and kids have expressed dismay over some of the situations that weekend parties were concerned about the potential for tragedy\n... can you respond to that\nUm yeah I unfortunately it wasn't a millionaire with that article when it was printed in in Nineteen Ninety I that was when I was graduating from college but what I read yesterday when it was first forwarded to me I'm\nShocked me in in some way because it was an acknowledgement on the part of the administrations of the schools that we all went to that there was a severe problem and it was a severe problem um but what is what a shocking and upsetting to me is that as I understand it\nNot much institutionally has been done to really put a stop to it and I know that there is a very very steep hill to climb for educators and managing teenage kids\nUm I Know that as as a parent of a teenager myself my son's Seventeen um it's not easy for parents to get involved but I just feel like wow that was a long time ago and we're still fighting the same battle with underage drinking and drug use with um\nBehavior on and I just wish that there was something more that that we could have done and the the twenty eight years plus that had transpired since um since that letter came out\nThat you have a close to Seventy names on this letter that you knew issue what do you hope to do with with it and what are you a hope they are all the people who signed a petition are willing to go public with their names are\nIt's closer to a hundred now actually didn't look at the number of this morning I should have it's it's been growing since I'm we released it on Saturday which um is probably a tricky day to try to get people to pay attention to it but since we started to get some news coverage on it um we've been getting more and more signatories\nUm and we've been very judicious with uh how we're going to proceed because there are a number of folks who signed who for various reasons such as they are employed by the federal government\nCan't have their names released publicly um but did they did find it in that they want it to indicate support so we're having to be very thoughtful and we're contacting everyone individually to make sure that they're aware that we intend to go public with their name make sure that they are they say they are and that we didn't end up with some fall centuries [noise] [noise]\nUm but the concern that I have right now is that I'm not all that sure how interested the FBI is in our list um they have their hands full and that's what is so\nUrgent about the situation to me is a week is not very much time for the FBI to conduct a very thorough in investigation\nUm they have to identify locate an interview a lot of people if they really want to get to the bottom of this um so they may have their hands full which leads me to believe that the press um maybe a more\nA effective way to get the word out and to get our letter to see the light of day and for then\nFellow prop alumni to take the action of saying you know what I Do have a story\nWashingtonian just a concept did not even exist it was not in our lexicon at Georgetown press\nExplain\nI feel culturally is important to recognize that the eighties we're a very different time and place for the country at large I'm not just in in private schools private all boys' schools um everywhere we weren't talking a whole lot about the\nSexual dynamic between boys and girls at the high school level it just wasn't part of the conversation when you compound that by\nHaving an all boys private school that's Catholic um the likelihood of meaningful conversations between administrators between parents and kids I'm coming up to try to recognize the fact that\nThere are thousands of shades of gray is between the gentlemanly conduct which was which was the the shorthand at the time to tell us how we're supposed to behave around girls um and and down and out rape um\nThere's so much nuance than there and it's a lot to cover and they're needed to be in retrospect hindsight is always twenty twenty a more concerted effort on the parts of parents administrators the school itself to to lock horns with the fact that\nGood kids do do bad things um especially when alcohol is involved and I think it's easy to criticize them now through the lens of twenty Eighteen um\nBut but I just just to be very honest about the million which we're operating at that time we weren't talking about\nThe subtleties of sexual dynamics we were barely talking about the mechanics of sexuality I learned most of what I knew about sexuality from my middle school health and sex education class not from conversations that I was having an high school about how\nYou know when it's okay to have sex and how you know when and how to stop you\nTreasurer one hundred and ... and so she was the call biggest contributor to the beach week Ross club as as well as a reference to the we're not a vote alumnus or could you talk about these references that you saw in the year book on what the what they would mean to you\nAs someone who is part of the school for a part of that school\nDoor on as with many private schools that have a whole\nPage dedicated to each kid it is a place for you to commemorate your time at school it's it's your way of of reading your finger right writing your name and the wet cement so that you're for all eternity I'm locked down it's a way to commemorate inside jokes that you have with your friends um and and just to basically have a laugh because we didn't have Instagram or Facebook\nThen so you couldn't go back in and take a look at the old photos any by any other means besides looking at your book\nSo collectively we all made up a lot of stuff um some of it could have been exaggerated some of that could have been entirely faked on but what I saw\nIn on breast page was a a championing of the drinking culture\nUm and and you don't if you were an innocent choir boy who occasionally likes to have a beer I'm call yourself the the\nCaptain of kicked city or whatever it was but he said on these these are things that just don't sit right with me and struck me as very much at odds with um how he portrayed himself and his interview on Fox and how he portrayed himself I'm In front of the Senate on Thursday\nAdvance the public confidence in the integrity I Would point to we have credible allegations of sexual assault we have a judge who has resisted calling for a full investigation what we would think of as as central to any any ...\nIt and as a political hit in response to pay back I Believe was his word for Trump and for Clinton that's\nThat that speaks more of a partisan than a judicial temperament\nI wanted to ask about that because\nThe hearing was really stunning in terms of the\nThe damages seem to George ... digit himself and his testimony in terms of the belligerence\nOr that he showed the members of the Senate and also the um the lack of would you buy or judicial restraint though in the way he approached though the questions that we're talking about him I'm Wondering to what degree those years really galvanized the board or to make this decision of issue\nWith the board was was considering seriously the allegations of sexual assault and attempted rape the board met after the hearing so that the board could have a chance to hear the witnesses such as we had it\nUm we like others have share concerns about what kinds of investigation there's how robust the hearing is and whether there's a fair chance for both of them to tell their stories robustly um and in light of of the allegations and as Susan Herman statement says in light of the allegations in light of the hearings we came out to oppose\nThe decision to launch an ad campaign in the same time\nWell the decision to launch the ad campaign of course followed the board's position the boards those that we would oppose but now that we are opposing it's incredibly important that we stand up it's incredibly important that we stand up because of the message\nThat the any confirmation of judge Kavanaugh which sent to sexual assault survivors it's important that we stand up\nGiven what this would say about the integrity of the court I Can't reiterate enough how important it is that we believe in our in our systems into believing the court requires us to believe that people will be a human or working as hard as they can to be impartial unfair\nAs a child and orchestrated political fueled with a parent pent up anger about President Trump and the two thousand sixteen election\nFear that has been unfairly stoked about more judicial record revenge on behalf of the coins and millions of dollars in money from outside left wing opposition\nGroups fish is a circus\nAnd talked about the Clinton conspiracy et cetera the million spent ... left wing groups he talked about left wing conspiracies his rage was almost an contained\nNow does this mean that progressive groups that go the before the Supreme Court should ask him to recuse himself I mean the fact that matters right wing groups have also spent millions of dollars he is not raising that\n[noise] um I think I Would leave to another day questions for a cute little but I Will say that we had a lot of conversation about it we the public can in discourse around nominations about how they become so partisan what we saw here was the nominee himself engaging in in part is and conduct and I think your question\nOf course raises for us I'm Serious question about how well the public perceives a decision that comes out against a group like Planned Parenthood then double ACP for example groups that have been opposing cabinet how well how would we assess the fairness and stand by the fairness of the decision\nThat affects you know quote democratic opponents close quote that might run to political gerrymandering or campaign finance or the census again this isn't about\nHow important it is for judges to really conduct themselves in a way that gives us confidence that they're doing everything they can to be impartial as they hear cases before them\nTo refute Deborah Ramirez is sexual assault claimed before it became public are there any ... if that's true and it concerns there about his conduct a leading up to the hearings\nI certainly think you know that\nIt's incredibly important that we have had a here that we have a hearing and that we have a full investigation and a full investigation seems important both for the integrity of the opportunity for judge Kavanaugh to clear his name should that be the case\nFor Dr Blasey Ford's allegations to be robustly hurt and tested and for the public to have confidence confidence in Canada is our as I said this is too important and we can have no doubt\nSo it's important for an investigation an investigation to look for the facts and to test the veracity of of the statements that have made\nI Want it to switch to turn out the gear and the last minute we have with you and that is the ACLU involvement with the migrant children should the New York times reporting the Trump Administration\nHas begun transferring detained migrant children from shelters across the country too embarrassing tent city in West Texas the times reports hundreds of children being sent each week from shelters to the center city which currently houses sixteen hundred children facility reportedly as no school children have limited\nAccess to legal services the U. S. government's now detaining a record Thirteen thousand migrant children your thoughts on this latest news and what it means for these kids were talking about almost two thousand children if the government is even telling us the truth on that\nWas so glad you raised it 'cause I think it's incredibly important that this that the story breakthrough even in the midst of incredibly important hearings about the Supreme Court as you as you indicated that it just a horrific story we have more children into tension now than ever before we have children being busted in the middle of the night\nTo be asking urging them to stand up including to sort of withholding withdraw money from the age of\n... and of course then you have the convergence of that issue with Kavanaugh when a judge Kavanaugh on\nI'm a federal court judge now I'm actively gotten involved with the case of a migrant minor she was Seventeen years old that's just the guards at KFC and try to prevent her from getting an abortion\nOr that decision was over ... rules and this young woman Jane Doe got the abortion but it was judge Kavanaugh now who intervened in that\nJudge Kavanaugh issued a decision yes that was going to\n... in the face of a ban on Jane does access to abortion that was going to give the government oh time shall we say to continue to look for a sponsor of time that really meant further delay time that didn't respect the fact that the government's obligation is not to bar\nAny of us from having access to abortion\nWell away smelling we want to thank you for being with us deputy legal director at the ACLU again in a rare move the group has decided to oppose judge Brett Kavanaugh's nomination to the Supreme Court and is now running an ad campaign in key states to target\nUm senators on their position on judge Kavanaugh that says democracy now when we come back\nI'm a new NAFTA we'll talk with Laurie ... stay with us\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] Mm [noise]\nThat music by the visionary Latin jazz\nMusician sharing Gonzales he died on Monday at the age of sixty nine [laughter] democracy now democracy now or the wiring T shirt part I'm Amy Goodman with finding solace\nWhile the United states and Canada have reached a tentative agreement to save NAFTA the north American free trade agreement then you try lateral deal will have a different name will be known as the United states Mexico Canada agreement of President Trump's celebrated the deal Monday\nMy great honor to announce that we have successfully completed negotiations\nOn a brand new deal to terminate and replace NAFTA Andy NAFTA trade agreements with an incredible new U.S Mexico Canada agreement calls us embassy a sort of just work and [noise]\nSo we have negotiated this new agreement based on the principle of fairness and reciprocity\nTo me it's the most important word and trade because we've been treated so unfairly by so many nations all over the world that we're changing that\nA but the voice was correct you are listening to Ninety point one W. R. UPS him a right now you're close to me ah my name is ... ... you know hosting for the a two hour spot of progression\nAnd uh that stands for the music that I'm currently listening to how long progressing through a this music\nHis band you know whatever you want to hear you'll probably hear at least one song that you enjoy during this block hopefully it's every single song or I Would like to think this is a great show for somebody who is looking to find new music that they may not have heard a elsewhere\nOr none of this is like top forty head of course 'cause we're college radio station I don't think we're legally allowed to play that music\nBut uh yeah this is kinda like besides just random smaller groups that I've just found through the help of Spotify or if you don't have a Spotify account I highly recommend\nYou guys getting Spotify and then going on there discover weekly playlist that's where I've gotten so much of my music that I play for this show every week they have a whole new fresh playlists mixed with a bunch of different uh songs and genres and\nEnd of that like but I Am just going to get right into the music here\nAh and of course if you do want to call in at any time today\nOr feel free to you could just give me a compliment you could give me a constructive criticism you could just give me criticism you could tell me a song you like me do you do a look into playing and of course I Would hope that ah I Would be able to do that for you I did that last week and it was very successful one of my favorite songs of that past week\nBut the number to call in is seven to for three five seven nine for eight seven and I'll say one more time for ya seven to for three five seven nine for eight seven but that said we're going to\nGo ahead and start listening to this first son and I got ready for you guys and then uh I'll talk to you guys a bit later enjoy\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\nMe and I'm\n\n\nThat they need to be [laughter] me\n\n\nAnd\nSometimes be Latino\n\n\n\nBut then\nThere was\n\nThey knew\n\n\n\n\nI Love ... I\nYou just looking at things in the office and saying that you love them\nDo with the land or you're just saying it because he thought\nI Love Ninety point one W. I. UPS that is your alternative source in Indiana, Pennsylvania\n[laughter] [laughter]\nWhat how does that have\nTo do it now the point one W. I. U. P. F. M. being your alternative source it was literally a cringe eat classic clip from the the hit film anchorman ah with with brick I Believe is his name or talking about how he loves different things in the office because his character stupid\nCan do to the point\nIf they live on\nSweetie [noise] for jobs that would be by\nWhen they do uh to to know [noise]\nThey go\nMan\n\nGod oh my\nThey said oh man that's the name and by the time for a man\nWild cat dog\n[noise]\nShow not saying\nDon't\nDo things to say\nAll Muslim I\nMay say oh man that name in my tree while\nCat or whatever but when they\nDon't ...\nLaw a\nSomething so you know so we didn't poll about a\nMonth or\nSo\nFor those [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n[noise] and tell us when the\nGuinea he still do but you are you pretty darn deep weren't born I'm an\nArtist too far off [laughter] [laughter]\nThere you go there is another ID for Ninety point one W. I. U. P. F. M. or whereas my ah promotions professor likes to call it W. I. U. P. F. M. Ninety point one\nOf which nobody says because it doesn't sound right\nUh but uh yeah for my promotions class I'll be coming and uh probably promoting something somebody whose group because a lot of people off to promote a radio event so you should go to that I have no information to give you two guys on that same for my group for our UP TV\nBut uh you know\nPeople make music and they like cursing their music right right it's like a common thing he's a radio supposed to like play music for people to listen to\nI just think it's kind of archaic that like\nCurrent radio still you can't like play curse words on it that like songs that have curses in it because it's really just like so so limiting to the type of music that you could play on radio and I guess that's why there are songs called radio hits and other ones that are called like underground hits and\nThat kind of thing but it it's just it's just strange but\nI guess I'll I'll live with it and I am and I could still find plenty of great songs for you guys to listen to like the one you just heard which was how can I Love you bye yellow days\nBeen a fan of for maybe a year and a half or so he has a really nice of low a smoother voice a with a very unique musical style to go along with it so it's not too boring\nI really like the new single he got more jazzy with it then he usually does usually he's more like a a Mac DeMarco type style a singer\nBut uh I'm interested to hear this next song it's going to be hike\nBy a guy named Rob and then after that we'll get into another ... or so or third song I Can't see or a certain song\nI guess I have a list I don't know but er hey yeah if there's any like bad weather and you're driving just like be safe you guys know better than me what to do but I Know that stuff he gets scary\nBut ah just listen to some music if you're close you up in your house hopefully everything's good hopefully the weather in your area is good I Know it's kind of sketchy around here at least from what I'm reading\nBut ah just enjoy this music if you can't that's fine I'll be here next week the same time\nOr just hope you have a great rest of your day [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise] [noise]\nHe game that\nAnd you may or may be Andy began late last night and they\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\nSit still for coming in Niger names on [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nYou\n[noise]\n[laughter]\n\n[noise] your tune Indiana's alternative sources Ninety point won W I UPS\n[noise]\nThat was a good a legal id there I appreciated it it was short sweet to the point didn't say anything extra had a catchy be behind it I give that in a plus\nOr you guys listen to Tucson is there a and then sandwiched in between those songs you heard a a PSA on childhood asthma\nI don't know about you but those are children's voices are really makes me sad so I kind of tried to spice it up afterwards by playing comic comic Hama and that song is by uh the student named\nUh I think his name as white boy sway his is a name and then be for that\nYou heard another one of his songs or by white boy sway in that one is titled Jerry Seinfeld is not that funny I thought that's an interesting point that a white boy sway brought up\nBecause a lot of people know Seinfeld is like the ultimate comedian but really if you listen to a stand up he's just doing everybody else does and that's just saying what's happening around him but he's just pointing out the absurd and this of it because really if you think hard enough about anything that you're doing from your day to day life it's absolutely insane\nAnd I guess I just uh uh give a definition for what to stand up comedians do uh I didn't really think about it until this point right now as I'm saying it live on air\nUh but really I mean like I could talk about lamps I could talk about ah this microphone in front of me I'm Talking into this like hunger junk metal\nAnd all of a sudden like it's it's being played in in cars these big hunks of metal that are just flying down the road or that you have full control of how absurd is that if I really tried I can make something funny out of that but uh it does\nSo I thought was funny but it is a good spokesman for the world where committee so maybe that's why it's so popular or maybe it's because of his television show\n\n\n\n\n[noise]\nAh\n\n\n\nOr or\n\n[noise] oh [noise]\n[noise]\n\nOh\n\n\n\nMm Mm\n\n\nDa da\n\n[noise]\n[laughter] [noise]\n[laughter]\nWell\nI'm\nFall no matter\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] I'm\nAnd and I'm\nI'm a\n[noise]\n\nIs bad or they may know how\nDown here in la\nThey\nKnow ... what it is\n\nYou know I'm sure I'm sure\n... or\nCan do I\nYour dream screw\n[noise] [noise] [noise] [noise] [noise] oh\nNo\nNo no no\nLike no no no\nDo\n\nSee I Know a\nAnd know the wrong ... to the bar and a few\nYou know they they made me happy\nShiny new\nDown ... was a do you have\nBig news\nA ...\nThe the a la la\nDa da da da\nDa da\nDa da da\nThat way forever\nBy day and they go\nOr go to the website are you guys just heard a little preview\nOf my up and coming new segment that'll starting next week on Tuesday from six to eight and that'll be called the forgot five five where I played five songs that I find from the website forgot ... dot com I highly recommend you guys go and check it out yourselves or because every single song on there\nYou will be the first person to listen to it so uh\nYou're guaranteed to have a unique experience it say the least of the first one was Martin Vic scat and buggy\nBy Martin additional uh you heard in scouting along with himself\nOr his album cover is very amusing if you'd like to look it up\nA and then you just got done listening to the star Spangled Banner slash lander burger by Harold wind come\n[laughter] and this is a favorite of mine throughout a what the three years now that I've been going on for ... randomly on my friend Ross and I found this song when we were living together in our dorm room\nAh it's called a baseball arrow by Harold wind come in all three four time base adventure\nAnd the album covers hilarious the song is just so absurd and it's all just base\nUh I remember we at one point we got a Bluetooth speaker and just blasted out the window at our dorm and we went downstairs to like see how loud it was and like our whole dorm area was listening to this insanely weird a unique song\nI don't know I was a different time still a great song though uh I have a lot of fun and I'm going to have a lot of fun collecting a and having a a reason why should go on forgot to fly to uh find some great hits\nThe song by Bombay bicycle club huddle the hill and then we'll get into some more unique songs there for ... during the last Fifteen minutes or so much so uh just the hills by Bombay bicycles\n\nAnd then we live our lives\nDown in ...\nMovies I\nTo try to buy a new way\nNa\nBuilding here in our them but they [noise] to to try\nThat that child nutrition better\nHim boy we\nNa na\nMe [noise] [noise]\n\n\n[noise] no\nThat there is a is loving\nCurb it I\n\nMatter what I Am a flash [noise]\n\nI Am fighting\nI carry on\n\n\nBegan to many rumors\nSharry that shows who died in\nUm oh\nGosh no\nNeither [laughter]\n[noise]\n[noise]\nOh\nMy gosh\nI don't live\nAnd die every\n\n", "year": "2018", "show_name": "no_show", "city": "Indiana", "day": "02"}