{"month": "10", "state": "PA", "station": "WIUP", "content": "[noise]\n\n\n\nMillion dollars on the number of them\n[laughter]\n\n\n[noise]\n\n\nThe title track to the ... the stratosphere known by ten dream dream\nWe also heard yes song called mind draw is taken from the keys to the ascension to go the net wraps up this week services thank you so much for listening I Hope you'll join us again next Saturday at six o'clock in the other two hours in a little bit of this\nA little bit of them in a whole lot of\nProgress rooms in a whole lot of psychedelic rock\nAnd have it all for you once more next Saturday\nAgain I think you are listening to take care Neal unite\n[noise]\nAny good and then posted democracy now your daily grassroots global and imbedded international independent news hour\nThere'll be I use the SPN is now airing democracy now across the week is Monday through friday that five pm on your alternative starts W. I. U. P. Ninety\n[noise]\nCatch it Saturday spot every week here in Ninety One W. I. UPS them from eight to ten PM your host the holiday will play all sorts of punk rock a rock and roll\nAnything I really want to dump out there on the airwaves pretty much empty my hard drive and then the my head and if you are listening and you'll receive awards so check\nMe out every week ten pm find me on Facebook at Facebook dot com slash Saturday spot of you are you feed as always listen to Indiana Public radio stations now he's Twenty one W. I. U. C. F. M. and India [noise]\nI called him on law and they called me and I was\n\nAnd honor\nYou\nGoing to take the time I read about\n... and\n... ...\n... ...\n\n... ...\nAnd ...\nAnd ...\nFor your\n... [noise]\nHe\n[noise]\nHe you\nPaying you know\nHe is now\n[noise]\n\n\n\nMm Mm\nMm\n\nI don't I mean his newsworthy music mattered since the U.S navy W I use the F ... Indiana your alternative also\n[noise] [noise]\n[noise] ooh\nWe'll just do that to me and for the daily news is yeah this is talk\nAnd to make more money\nThan\nThe middle of the\nTime it down and then you have to be that\nWay\n\nTo day she can she be\nWill be\n[noise]\nShe was being consumed in the media the ball and the by the\nWay in which by a\nStar machine [noise]\nAnd then they\nShe's a man and the man ... ... none of the room\nDa da da\nShe speaks two years\nTo me is all about the water through\nLa\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da\nDa and [noise] and and\nAlive and da da\nDa da\nAnd we will remain the mayor or\nIn the ...\nOr whatever why why is waiting ... worried about the late ... early ... I Am I the thing I ever made was obliged to them they run out of that and I don't know\nKnow a lot\nI don't know about ...\nAh\nI gather na\n... oh no Mm\n\n\nMm Mm during the day goes by\nDecember ... a ...\nA share of radical but I Do for a new ideas I'm\n... is just going to show\nShe she she um she she ... she said\nShe just said ... should\nShe\nShould run down the\n\nRoad which\nShe ... she said\n\n...\nA\nYou know\nDo you\n\nOr or\n\nOr\n...\n\n...\nAll along or gall\nName a\nNavy gallons\nAnd ... [noise]\n...\n... na\nNa ship\nShip ...\n... when\n\nThe boom\nBoom boom\nDue\nOf the ...\n\nNone of them in my mind of a I think it will dreaming of symptoms with seemingly last a long\nTime we ...\nAnd ...\nHe will not ...\nAny ... in the\nAir\n\n\n\nBuilding a\nCheese\nKing\n\n\nFew\nYears on the to love to do\nThat but then the other thing I'm much\nThan the changes of the nation from the canopy\nDog do you own the and\nWhere all the other thing we're going to do when they were about\nFor you when they be\nFree me\nThey're\n\n\n\nTo\n\n[noise]\n[noise]\n... you know she\n\nThe\n\n\nDa na\n\nNa da you\n\n\n...\nList is Ninety point one W. I. UPS then Indiana alternative source\n\n\nSo\n\n\nWhen\nI was\nThe milk or\nYou\nMean by that area or dodge children and my dad would have known them out and we're\nGoing to have your older brother and sister our time is going na na na na na and AA monitors on\nDogs that are down there and you're going to die for it and and my them laugh or bad guy and he went on that on a\nDay or an hour or two and a long time and I don't know about you\nDay by day [laughter] so I don't\nA long way since I had no way to live in Miami I don't want to talk about you know some of the news anyway [laughter]\n\nDay by\nAnd I don't\nAs I\nAm right now we're now joined saying you know I mean there's a big eyes too\nDa da da da da da da da da da da da\nDa da da da da da da da da da da da da da and a long long enough that I mean I Am I'm a I'm a I'm not I'm not sure how long\nTwo\nAnd a man on trial you\nKnow maintaining you don't want to go out and so I don't I don't know\nA I don't think you're right and there's no grey and da da da da da da da da da da da da da da da da\n\n\n\nNow do they got it\nWhen they're not [noise] I Want\n\nThere [laughter] [laughter] no doubt\n\n\n[noise] [noise] [noise]\n[noise]\n\nMm Mm\n\nMm\nViolence can throw some may just follow\nGround control some may just I'm\nJay Z all pro teams fail\nFan but you know how many\nRounds can throw\nIn a sense all\nName is Janice I'm\n... times may God's love to be with you know no\n\nSaid I'm In\nAnd now when you live or jumping\nThat uh\nMoney away in a\nRandom blood runs the\n\nThe\nLively thing and that's in the\nThe in\n\n\n\nAbout not on\nMan a marriage is a sign that they might like to know which way to go\n\nYeah yeah my job to do that and I tend to\nKind of thing I'm ...\nLines at\nTime as a\nBe [noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\nThey\n\n\nDe de de de de\nDe\nDe\nDe da da\nDa da\nDa\nDa da da da da da da da da da da da da da da da\n\nDa\nAnd then and then and\nThen they\nAnd da da\nDa da da da da da da da da da da\nAnd\n[noise] [laughter] [noise]\nMm [noise] [noise] [noise]\n[laughter] and\nAnd and I'm about a day on the show\n\n\n\n\n\n\n\n\n\nOr a down\nI'm\n... and ...\nA charity\nPer se or\nThe movie channel and\nDriving about on my on a little\nWell ... ...\n\n... ...\n... ...\nNa\nNa ...\n... ...\n... ...\n\n\n... from the ground\nHis story\nNow they use the mayor\nPhotograph\nSlowly but surely counseling a photograph to\nRemedy\nYard gifts in larger\nBut the thing is how there are\nNot a holiday um\nIn a\nRow in order\nYou get out friday and then you have right I'm going\nTo get the\nFive my\n... ... not for\n\nFull burden\nThem\nA\n\n...\nAutograph\nWhich is the money to do the grass\nOr playing a\nThat I have made a photograph ...\n\nRoads and not a\nNot the ...\nOn power back clique my parish is all\nMy gifts and try to\nGet the same thing for how they were\nNot a holiday All right\n\n\nOr you can have\nFast\n[noise]\nMm Mm yes they have that much money in\n...\n\n... Mm Mm Mm Mm Mm\nThey're ... they're going to keep the Syria do there all the games the Addams family\nThey knew the young ones that have come and they really are Maria I'm Leah Addams family\nTo me with just Shaw I'm ruining their new mom were gone by the\nTime all of the\n... ... ... ... E D\n\n\nO D O D\nG\nKnow by the way that the\n\nOne thing that I could just like the game as I was saying\nNot saying that when well my cousin who was killed during the\nDay because\nThey don't see any reality people was because I\nAm a I'm a little\nBy the way that the part\n\n\nTime to go to Jim calling\nDa da da da\nDa da da da da\nDa\n...\n... Mm Mm Mm Mm Mm Mm\n[noise] [noise] [noise] yeah he he you know they don't\nIf I'm On the pain in the [laughter]\n\nYou know come on and on and on the line and do you think\nThat\nOn my God\n\nKnow ... green they go to the\n... I\nCould see the thing to do it you\n\n[noise]\n[laughter]\n\n\n\n\n\n[noise] [laughter]\n[noise]\n[laughter]\n[noise]\n\n\nGoing to be\nWhat he meant\nBig thinkers and he understood that they knew\nThe names you\nEnd you know\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] the [noise] the [noise]\nThe may ...\nBump\nIn the [noise]\n[laughter]\n\n\n[laughter]\n\n\nAnd you\nAny Muslims\nIn the bank\n\nAnd you don't\n\n[noise]\nMe\nThat and\n\n[laughter]\n\n\nThen and\nMe me me me me me me me me me me and made me made me\n[laughter] me too [laughter] me [laughter]\n[noise]\n\nGave\n\nWant to be\nOn hand but on\nGame [noise]\n\n\nCan't get they get junk gateway get way we get get they get no good way\nTo let me tell you live in the unit out to be coming up with enough and I mean you know once I did I mean no one to ... I I think the game at that time I ever made a lot of mother died you know get on the ground so ah\nYeah we have an earthquake but it came out on the guy and he went on the job of hiding out in the next challenge I\nGot an a bump put a camera\nDid they get way she just let me get they get a good way to get away get they get it but I guess late in life then I'm\nGoing to get on with him to do not have them on a bomb on being the one to take me home with my little under the deal with the gap between the two of them on them go work out in the Marilyn in\nCharlotte and I've gone through my feet by ... J. O. P. though for the sequel is rather than I bumped he must be done by a blind in a paper will DJ the sequel but let me\nGet get get get get get they get to do just led to Jason get they get lazy get way too young to get they get their way to get\nLet me say life then boom boom boom boom boom boom gotta get\nGet get get get lazy gateway and they get a good way to get away is generally get they get getting lazy gateway y'all get they get ... get lazy yeah\nWe have enough equity both for the camera down the middle of a job in a play about going on and as a southerner both for the camera biting down payment on the job\nEngage in ... ... ...\nGet lazy [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\nMy\n\n[noise]\nKnow\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\nWhere there's a\nGame\n\n[noise] [noise] [noise] [noise]\nNo no no no no no no I'm In a long\nWay to\nThe title\nHow to tell me the pin my\nGod we\n\n[noise]\nNo\n\n\nNever can tell one\nIn ... and they can be that they want\nTo\nKnow we got out to\nDo\n\n[laughter]\n[noise]\n\nDon't know [noise] stand up three [noise] [noise] oh\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\nAnd then of course was any grant electric avenue for Gen you somewhere um five points\nBefore that autograph did dreams Carly chips and\nFrom her most recent release run away with me we also heard some newer dumped temple material click did wavy and we started off the said\nWhat's the elder Brooke\nDoing talking oh let's see what the temperature is around here currently is forty three degrees and cloudy expecting a low forty one tonight\nRain at times going up to forty seven tomorrow and then down to forty six on Monday\nWith rain throughout\n[noise]\n\nNa\n\n\n\n\n\n\nPeople come to the child or let me\nSee [noise]\n[noise]\n[noise] [noise]\nOn the wall and they\nWonder why\n\n[laughter]\n\nThe care about that\n\n... ... ...\n... ... ...\n... to ... ... ...\n... in ... due\n\nI Try to be sure\nThe stuff that\nShe\nMay get a call\nTo see\nWhen\n\nBoy\n\nBlame me me me now\n[noise] so I agree\n\nThis is Ninety point one W. I. UPS Indiana's alternative source\n\n[laughter]\n[noise]\n[laughter]\n\nMy being run by a rental\nVehicle please\nWhen you\nThe\nThe\nThen I\n\n\n[noise] uh\n\nUh uh\nI Know I'm On\n\nNa na\nNa na na na na\n... ... deaths\n\n\nThat's inside the all night Kobe\nWe've been waiting [noise]\nThere was a quick one W O UPS in Indiana [noise]\n\nOh yeah that or midnight special\nThere I mean you know nah\nButton and those are bad against on\nAnd then she will hung around around and ...\nAnd you\nLet them going in and then\nJohn in just a mommy and then you may not be in\nNine nine on me and\nThen you may not be\nSatire madness and escape I'm rich warrant\nThe midnight special is under written in part by deliciousness dot com information at age seven to two six seven to one six seven or the militias this dot com D. E. L. I. C. I. U. S. N. E. S. S. dot com\nLet's begin with Woody Guthrie singing his best known song with all of its versus followed by the song that inspired him to write it [noise]\nMm Mm [noise]\nThis land is your land in this land is my land from California to the New York die on land and the red woods far in\nThe Gulf Stream waters\nThis land was made for you and me [noise]\nA lot of walking that ribbon of highway I saw above me that endless skyway\nI saw to me that golden valley this land and they were you and me Mm\nOur own land ... steps sparkling slams a diamond\nIt was made for you and me\nThere was a big ah Waller and tried to stop me\nSign was painted\nPrivate property\nBut all in the back side didn't say nothing ...\nThis land was made for you and me\nWhen the sun comes Johnny and I was rolling in wheat fields away me in the last well rolling\nBoys was jak adding the ball was living in the\nThis land was made for you and me\nThis land is your ... in this land is my land California for the New York Carlin\nRedwood more in the Gulf Stream waters\nLand was made you ...\nNah nah\nNah nah nah nah uh from\nThe [noise]\n\nOh I'm na na\n\nNa na na\n\n\nNa na\n\n\nNa na\n\nNa na\n\n\nNa me mom\n\n[noise]\n[noise] [noise]\nThere's dry in the kitchen\nI can hear them but\nMin the man\nNo they do\nMade me ... know that the\nGum ...\n... may\n\nOh\nYeah\n\n\n\nYeah yeah\n... you know my luck\n...\n\n\nI don't want to do the ... the ...\n... and I don't know\nGood study then\nNo no no no no you\nDo you\nSee\nThe ...\nAnd ... and\nUm you know a lot of changes\n\nThe washing cars being down or the blues\nMan\nOr woman\n... and and I use\nTo a\nLarge um\nBack and\nLook bodies you\n\n\n\nAnd ... and ... and you\nKnow you don't have a job or you don't have to go you know you\n\nKnow a little ...\nOne son you know\n\nI and I'm In I'm not the ...\n\nOh this is talk with\n\nOn a train\nMhm Mm\nWell I\n\n...\nCheese\nMhm\nMhm mhm Mm mhm\n\nOoh I\nEver had in I live\nBy the meal but\nThat's how high way as they get the\n... we're driving to Montgomery\nWhether we're\n\nGoing back down well OK non Roman ... that we are driving you know what all the time and change\n\nWe could be ...\nBut no one ever told\nJim Carter designed to be\n... ... ... I don't know enough slip\nAway and we're driving ... through\nOne of the Chinese Shane\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise] well now they're our men\nAnd every one another de Vito one law day a no brainer by you\nKnow all the time and I'm\nJust ...\n...\nFrom the waiting room\nTo the crowded trains\nYou here about three of them running\nThen she went driving her two\nYoung children and their job and you know\nTo most young men of Indiana\n[noise] yeah yeah\nDriving\nAround and we're driving down to it and you know ... whether you're saying\n[noise]\n[noise]\nCan't tell us your rent I sure can they'll not passed or paying help not than\nThan than using a rat\nStill paying help and I\nThe cause I every minute ... ...\nReason like ours and they like they were seen black gay\nI'll be like they burn\nI Know now he's a big speech ... 'round\n... 'round ... 'round\nAnd he can't maintain new hand me down\nI Know now it's like a newly wed eats\nLightning ... mile\nNo luggage di da\nDa da da da da da da Silva non you'll love the children's how'd you know the them\nTo be that big around your mom is ...\nThe middle of chicken in the empty is going in and when you read his little jaded and eat in\nThe modern day in the lord did the ...\nI never there man\n\nHe brought back\nThe boats in the\n... the spot in me\nHe bought them a\nThat yeah that may be in order\nTo do\nIt you know young men\nHe showed on up to do more\nA dog can get more women\nThan a bad enjoyed can fall\nIn order\nI'm going to\nGet along that I'm a lot of them by me it's been a\nLong and I'm a\nI'm Donna students for now I'm\nYet did the job and Bob\n\nAnd\nI'm Glad that was\nLike back to being ... boy thank\nGod I thought well why are they not Jim ...\nOn the job you want a\nBig factor\nIn Florida\nTo me is John\n... was a great song shine and ban\nOn a bomb is John John and what is it a shot and back\nI'm Don I use that around the that's the way\nMy\nDoor\nBut it was\nA [noise]\nLot of money well spent a lot no [noise]\nLand the land a lack of a [noise]\nOr\nYou\nHe\nWas the man now\nBelieved to me and my mom\nBoom and I'm going back six they live on this three\nGrand you see me come man don't go my name is\n... ... man don't call my name\nIs ... I'm going back legs the leave all need the street and\nWas the man is now\nMan to me what the man I'm\n...\nI'm going back to actually live on the street the rainiest\nMimi ... man\nRead the main calming hide your when a\nThat was the man\nBelieve me it was the man I'm now\nGood I'm going back to take their\nMoney in the street man\nGot there there\nAgain be\nGood enough to go back legs below\nThe ball needs a tree\nLeaves me what's the matter lousy\nGot 'em flag new Green Bay game in ...\nMy head um\nMm I'm going back then they will live on\nThe history and\nRene you'll see something\n... the mayor Ron and some do on on roe\n\nRather go back and say the the ball on the street\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] the\nPromise\n\nNot to mention\nWell in ...\n[noise] to go\nFor\nA\n\nLong time\n\n\nAnd you know\nSee\nYou then we\nWent away and\nIt's funny\nYou can\nNeither John is\nWhen you meet 'em didn't seem to\nBe well do you have to go\nWhere we were\nIn the\n\n\n\nEvent Cassidy with your big posture miss it feels a goal by state from her album song\nPreceded by the original Broadway cast of this show burger do featuring David Brooks in Marion bell Heather on the other show by Frederick lowered Allen Jay better and we began with Bonnie Kobach wild mountain time traditional via the mic\nGrace in Evanston when they're on Chicago Avenue back in the Nineteen seventies the album entitled seems like yesterday\nThe midnight special is under written in part by deliciousness dot com providing foods and snacks for a variety of dietary lifestyles\nInformation at age seven to two six seven to one six seven or the militias ... dot com D. E. L. I. T. I. O. U. S. N. E. S. S. dot com\nIn the second portion of the program we'll have some dancing vegetables as well as songs about immigrants I'm rich Warren and you're listening to the midnight special\nIt's not corporate radio [noise]\nIt's not talk radio she must be paid ... what does that make her image or a swat\nRange turned on HBO and get a lot of white can all you Gary\nLeave but you\nNot pirate radio while we're sharing me this is college radio Ninety One W. I. UPS in Indiana\n\nWelcome back aboard the midnight special folk music and fires show tunes in satire madness and escape I'm rich warn the midnight special is under written in part by the ... dot com\nJudy Collins especially sent this to us it's a new song that she's just recorded marine knees Mitt is\n\nMy daughter did you mean\n... to ...\nWhen I was only one I cross the\nBoard I came to find the good\nBrought my dog\nWhen I came to marry I Hope for life\nWould be the true\nFor me and for my jaw\nFull you\nHigh harvesting the peach you\nKnow in California\nAnd then in ... oh my family and to me\n\nSince my\n\nDream\nWe came here for him all the ...\nOh\nNo we have and oh\n\nMy husband is a\nIs no raping criminal\nAre often God you know\nFrom the game and he and my daughter loves her father\nAnd he was always Chen\nHe too came from having to go to find watch freedoms ...\nShe is our own lead dog could dream um been oh we were to put down way\nWe gave our youth center\n\nAnd then Richard new forced to go back to the no\nFly\n\nZone dream\nWe came here for them all the and the whole you\nWe have a ...\nOh my name is\nMarie\nMy daughter is a jury\nBut\nShe says she is a worry\nShe will have\nTo be the\nRob slow them\nThe road and they were in love with him that I read those too dumb\nDo the Mets go boating [noise]\nBig all your own money we ah\nProbably zone Bob and\nBrother says the homework and on\nThe road truck the the the down\nPeople died from the ... the\n... the legal means to you all\nCold and I was in the papers and [noise]\nAnd others are not on the\nContract how we\nGone to Flint German border [noise]\n\n... from her new CD a song about the migrants attempting to reach Europe from the middle east and Africa across the Mediterranean reunion\nFrom her album check you Laurie\nBefore allies are ... the John Burn band B. Y. R. N. E. the immigrant and the ... which he says could be taken both figuratively and literally he said he started writing a song about immigrants and orphans and it ended up being a love song\nAnd before that John Burn band lowest text maniacs do poor T\nAppalled by Woody Guthrie set to music by Martin Hofmann recorded by scores of people from the Los text maniacs album crews ... borders and we begin with a new single from Judy Collins dreamers gr saw\nOn the midnight special we continue\nPerhaps your real hard time hearing on the one\nTwenty three and all the factory floor we make\nIncluding make them be down the\nThe\nGame ...\nDay oh we can't do it with my hands\nRead on the town where the the the middle of the men\nBlood named being just trying to\nJumped on the\nThe one who now nears silver\nWomen that are on the edge now\nMay I got laid off but on that level\nThen the rain in the car for\nStory and they don't know but\n\nMm Mm Mm Mm Mm\nMm Mm Mm Mm Mm\nMm lots of folks baggy face leaving home every\nDay meeting the heart old as the way to the California line for all of the desert sand zeroed getting out of that old I think they're going to a sugar bowl but here's one and\nNow the only that the port of and France say your number for the past and they all knew a job does raise me move you ain't got no re me why you better go back to the beauty ...\nOklahoma Kansas Georgia Tennessee now the bar and you're in the garden of Eden eight paradise to live in or the but believe it or not you won't find them so hard if you ain't got no re ...\nMm Mm Mm Mm Mm Mm Mm Mm Mm\nYou ought to buy a home or farm that gain deal no bodily harm or take\nYour vacation by them out to endorse the dose on your own town or a car you better stay right where are you are you better take this little tip from the calls I look through them all day every day but the headlines on the papers\nAll the way they are you a job but it does raise me as you ain't got no re me why you better go back\nOr ... lead in a paradigm live it or leave it or not\nYou will find the Lone Ranger don't read the\n\n\n[noise]\n\nYou can say that and\nYou can\nGet them on\nOwn a gun will\nMake you know not all of my body\nBut you just don't get much\nUs here\nHe\nIs not a you know I Can't\nI don't know\nWhere the demon that night\n[noise] down here where I Am around and you are on there and the only\n[noise]\nWell\nCabin John Jim is on the news out later they made sure to be\n... with the dog I mean\nTo me a\nBad\nTo change the way they are an old man dusty if\nI'm not I have gone down there\n\n\nHigh grew up in a French family than when I was growing up I didn't like vegetables so\nI had a real hard time with him we'd go to the supermarket and I try and push the cart toward the fruit loops and the pop tarts and mom order go right over to the vegetables in and pick out the nastiest looking zucchini and eggplant and horror horror as the onions and garlic\nI like the stuff now you know\nBut then it was a different story so I wrote a protest talking about\n[noise]\nCan you give me your money and it's intimate you know no no no no did you do you think you can you can you\nReally [noise]\n\nThe rain too easy with the group trap is already to also was free to ... Ralph Gordon and Paul rice lower recorded at hosting the\nPub on Lincoln avenue in Chicago September twenty eight Nineteen eighty four Ratatouille the rain too easy song before that Martin bogus and Armstrong with the barn yard dance also called the vegetables song by Carl Martin the title song of that album barn yard dance\nAnd we began with Robby Alice with his route vegetable opera from his recent release pumpkin\nTom Russell recorded a lot of his favorite songs or I should say recorded twenty of his favorite songs along with his regular psychic Andrew harden on guitar and harmony vocals\nHe recorded them just and then Andrew no big fancy production and here's one that's been covered by a dozen people at the song that Tom Russell co wrote with in Tyson ivy and Sylvia\n\n\nIn ...\n... you're in the sun just a canyon called already done\nLittle boy drifts de la ...\nWhere we saw that in the ... for a while O.\nJ. ... Katy bar the door a chain\nPool down that now Oregon spread it on the floor he saw men\nIn this sacred mountains and saw the dance of the turtle de ... when I was lying next to ...\nOn that all never aura\nI Katie shades the red and blue eye Katie\nWhatever game of the ...\nCage shades the red and blue ...\nWeather so jak about a year ago he said the place burned to the ground\nIt all he said he was an old ... to ... she left turn\nAll ... she got her a souvenir do projects fat out of ...\nYou said you should have seen her running through the smoke\nPollen that now the horror of\nI ...\n... ... I I'm a case\nWhatever became of the ... ...\n... ... am losing or I've been on ...\nYou know the eye and then breaks above\nIt always takes me back in time to ... to that but then you keep some school ... voted on the go ... you you don't find things that are less than a more like a double would know oh\nI a JD shades of red and blue I ... and whatever became of that ... ... ... ... ... I\nKid you know whatever the game of the novel ... the\nThe ... ... ... ... ... ... ...\n... ... ...\nWhatever became a ... ... you are\nSitting on the porch just sitting in\nThere's a lot you coming down the ... or ...\nGetting heavy there's a smile on a ... ... who is the weather is changing his son of Greece ...\n... storage tanks my hands\nTo steal it alone\nStill new alone\nNo ... Mm\nBone of oh All right\nThe line in crashes and the\nThe rains come down on that and\nAnd we're jumping Web ... though\nThe Jimmy Rogers your living on the radio [noise]\nAnd Jake's my hand\nShe says they are a little\n\n\n\nIn the middle of\n\nThings that have been able to\n\nIn the\n\n\n\nSee things get Marcy marks are performing a song words by Woody Guthrie music by Cathy fink howdy little newly town that's performed at one of our folks stage constitutes August thirty two thousand eight it's also on one of their album\nDot org the midnight special was underwritten in part by the ... dot com hope you'll be back with us next week I'm rich Warren and you're listening to the midnight special coming to you from the W. F. M. G. radio network\n\nI'm an ex guilt that can actually we've got new releases from Kevin Burke reverted singer Katie el ... rivers and lots more\nEasily than me one day and yellow really little [noise]\nThis is Brian also grow inviting you to join me for a new released on the next ... can I [noise]\n\nI don't know how it is where the music matter to the U.S navy W I use the F ... Indiana on your alternative also\n\n[noise] welcome to kill the connection in our music from the Celtic tradition\nIt's time to share some direct view and recently released [noise]\nAnd they're coming this time from Ireland England Scotland and the U.S [noise]\nYou're opening ... or from the goal away band back west featuring Brendan brown on accordion and his sister Maureen brown on fiddle I just love the way they've been raised these students which are old John Jude and apples in winter\n[noise]\nForgive me on my door you\nTowards the\nTowards the\nFrom the earth we came to know the trench in the way we learn to grow to the\nWhy\nMe a ton of both\n\n\nRolled over the\nGrow stars in\n\nFiddle player ... James backed by brothers for non and Cormac to borrow on guitar bass in the car in a medley of mouse in the ... the old ... and Jake minor version of the humor is a banned the singer before that was in the urban with this current band\nWebsite Celtic Connections radio dot ORG\nBy WSBIU\nBroadcasting service the southern Illinois university\n\nThis is Ninety point one W. I. UPS Bend Indiana alternative source\nThis is Celtic Connections I'm Brian also grow my friend and colleague carry recently celebrated our marriage to the Italian man that she wrote this next song for so in honor of their wedding I'd like to play her song tells me luck Mm\nMm\nMm no\nHow ...\nCan be nothing\nMany times\nMade a long\nLight of mad over the phone\nI mean\nMay\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\nNah die\nOh yeah na na na na\nNa na\nMean right now he's\nYou know I Know na na na na na\nTom Latham na\nYeah oh\n\n\nI thought everyone would enjoy singing along with that song from our childhood although I never knew there were all those versus that would be like the ... speaking with their mother normal waters and with Neil ... on harmonica in Martin ... adding guitar and vocals as well\nThe lovely instrumental before that was called Christ Church cathedral written by John ... fiddler with the double a nurse and performed here by the time to heal reversed on their fiftieth anniversary CD or on\nThe opening singer was Katie helps\nHer website is Celtic Connections\n\nYou're listening to Ninety point one W. I. U. P. F. bend in Indiana\nThis is Celtic Connections I'm Brian kills them grow new releases here's the objects from the Columbus, Georgia band wolf and clover including the first night in America Jerry's Bieber and Will Smith\n\n[noise] [noise]\nAge with their name one day we'll windy real\nWell maintained pretty cool [laughter]\nThey tell let no well I think they'll tell [laughter]\nIt's a nice one day and ... Lee are well\nI\nKnow it wasn't enough\nTo come in and do not ...\nOrders ball and then in the ...\n...\nSmall wedding\n\nI\nBet chained\nThen\nThe early\nHe was dressed\nI\n\n\n\n\n\n\n\n\nWas really the main really\nKnow the the the\nCheese has big ...\nIn the number\nNight for the last thing on my\n\nTo try to\nShow\nThe ... where a\nBoy\n\nBoy dog\n... ...\n...\n... ... ...\n... Mm Mm\nMm Mm Mm Mm Mm Mm Mm\nMm Mm Mm\nMm Mm Mm Mm Mm Mm Mm\n\n[noise]\n\n\nKevin Burke in concert with the great man Liam did you know the gang laugh or the and the ... that's ... newest album gold in the evening with Kevin Burke which costs are recordings from Portland as well as from Philadelphia and from Westport county Mayo\nOur website is Celtic Connections radio dot ORG when you go the links to all of this we\nDon't think connections is produced in the studios of WSBIU a listener supported service from southern Illinois university at Carbondale [noise]\nThis is Brian also grow wishing you over but we\nWe we can\n\nYou're listening to the all night cap on your alternative sources Ninety One of them are you in India\nUm\nSee out magazine was founded over sixty years ago by a group of folks who loved roots music\nToday it's a vital an entertaining resource for anyone who loves folk music the world over\nAs in the past thousands of people turn to sing out to read about and learn from the artist to play the music [noise] this is the sinking radio magazine [noise]\n\nThis is to sing out radio magazine and I'm your host Tom ... Miller with the recent release of some wonderful new mandolin CDs it seems like the right time to devote to program to the instrument mandolin its role in\nRecording contribute to that band black Patty is a duo from Germany who play blues in ragtime music on a variety of instruments including the mandolin\nDavid Benedict is a talented young men dilemmas too has released a new CD full of powerful playing from his all star Seidemann and himself\nOn the music comes from the Nashville mandolin ensemble a throwback to the age of the mandolin orchestra which featured Mandela was Mendez cello as men do bases along with the mandolin\nHere to tune called the flying wedge written by cake Dolby in Nineteen sixteen one of the few female composes of the era define wages attuned all about football and it's from all the rage their CD released a new world records\nOpened the program with Bill Monroe and his rendition of dusty Miller from the families set Nineteen fifty nine to Nineteen sixty nine the mighty mandolin on this week's edition of missing out radio magazine [noise]\n[noise]\n\n\n\n\nBe a modern or\nOf a man who was a\nEarly on\nBackground apply\nA man there's a lot of fun on\nMap but by\nNa na na\nNa na na na\nAll\n\nMe in a minute\nTo go to me\nBeen a way to\n\nGo\nDon't know why\nNot to go but she did not know\nIt was a murder or do you\nKnow now I'm about\nTo\nA ... the bird drew\n... the bloody man I had\nTime to rent to\nGrow to know those are\nCar and\nDrove all the\nMoney over\nMe bringing\nIt back but murdered a damn\nName was ruled on only\nNow he's bam\nOne thing is\nOh my God\nWho uh\nMean he\n\nWas still go to the wedding or maybe it's\nA murder that damn\nName was to ...\n\nDown ... will\nGod\nWhere we are too low to me\nWe\nDo love to see\nFound\n... she did not know do\nTheir own murder Dr\n...\nBe a little too\n... ...\n\nI really would lead but there are ...\nThey get speaking to dig and like you know\nThe latest homeland\nNow that many um man show though\nIt's been\nYear old shouldn't\n\nIn last night in ... games I even knew when I'm\nOn\nAny man ...\n...\nOn that show\nThen you do is make it in the bank [noise] totally and by and you're giving me if they don't shine it at all no\nOh no I don't need your gun loading much in the ...\n\n\n\nDeep\n\nThe\n\nLa ... we the\nRainbow Rhode Island and bank a woman there but ah\n\n\n\nAnd then they get I don't think that may be in\nA lottery has to do in big trouble break during his\nAnd address the cabs on prime time see I have been trying to learn the at\nUh economy and I have a real happy I may have been laying around Germany has\nA gun and I have a bad thing to do the crown prince you know right play that many men playing in the army has to do\nIt on\nAnd it's the talk of land labor in the upper Larry ...\n... along the same builder and allow to making news around the as dumb\nAnd rare\nReally are and they are ... to ... minutes later and then they\nLet him take me to the ground they blame correctly you know make money has been\nYou know\n...\nOh my God\nIn Ireland and they died in that regard\nHave you changed your grandma\nKind of money um\nWell\nNow\n\nThink between the wrong message slant already see the pain that plane and let me ask do\n[noise]\nYou know they'd be broke people behind it might go down the wrong line that I deem I mean I think he had the baby boom\nBang on happier that around we live here but I Do the job she has bank\nA really a ban on their own Larry I live near a big lead the promise laying on Saturday has been in the\nCarrier in Iran and they tell you the prom night when Iran be better than me without me has been\n\n\nWithin\nStill losing the\n\nThing\nRadio magazine is produced a little cat records studios joined me next time for another trip ended a fascinating world folk and roots music on this thing out radio magazine this is episode Eighteen forty two if I had\nA ...\nA Marine Le\nHave 'em around I'm\nA I'm Around ... between\nOh\nI got a bell\nThem All right [noise]\n\n[noise] are losing and wear down the road rage you just feel more Carolina with the blue Ridge National heritage area in North Carolina are council and gentlemen the W\n... so to all the things that I\nWas just\nMany people in the blue Ridge Mountains happened with me being descendants of the woods in Germany settlers\nWho made their way down the great wagon rode from Pennsylvania\nSo in brothers ... and ... there were boys in rural but\nFirst Listen to a record by North Carolina music legend ... they may not have realized that but they were listening to the music of communities with the shared heritage\nAt the time all they knew was that they loved it\nThe brothers grew up in a musical family and hit the road young to try they're lucky\nNew work their way up playing on the television and soon met American bass player Joan Landsburg\nWith whom they formed a trio billing themselves that the ... [noise]\n... first visited the United states in Nineteen eighty to a trip that included invitation to play on stage with Bill Monroe Randall [noise]\nIn Nineteen Ninety seven brothers traveled together tomorrow fast\n... has written about his first visit to the north Carolina hills that\nIt was like finding the source of our dreams the music\n\nBy two thousand and three Krueger brothers and settled in the blue Ridge Mountains where they live today\nFrom the north Carolina home brothers music has traveled worldwide in two thousand eleven endless inducted into the blue ridge Music Hall of fame and in two thousand Thirteen he won the deep Martin pride excellent in banjo in addition to recording and touring the cricket brothers hosting annual music\nHad a meeting will throw North Carolina where they teach and jam students in Belo enthusiast mountain music\nYou can find out about the other great musicians who live in play along the blue ridge music trail North Carolina by visiting Blue Ridge music in the\nDot com\n\n\nNinety One year old [laughter] [noise]\n\nHi I'm your calculation welcome to live and the fur peace ranch Larry ... is one of the world's acknowledged guitar masters hail buys legions of fans is one of the guitar got away Nineteen seventies and if they truly renaissance musician excels at all styles of playing\nIs also been Christian the troop pioneer Rochester used by the New York times up the godfather fusion by data left downbeat magazine\nI met Larry back in the sixties I have to tell you I didn't learn to play any jazz for these should be some good church they still used today they gentleman Larry Korea\nIn the snow in the\n\n\nA [noise]\nWho [noise]\nThe food\n\nMm Mm\n\n\n[noise]\nChange\n... ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nMy mother gave you know that they might be trying to [noise] you're listening to\nMy from your own countenance for peace rent\nIn two thousand seven\nMm Mm no room\nAnd\nYou're listening to W. R. UPS down Ninety ... one in the end of the ladies\n[noise]\n\nMm\nThis is your mind you're listening to live and the fur peace ranch\nThey're going to do what you would not like ammonia smokes it's called drink go single\n\n\nFor both\n\nThey\nGo\nTo the same\nOver and I'm going to\n\n[laughter]\n\n[noise]\n\nThey could do\nTo\nThat you do do do do do\nGoing to be able to prove to be the\nOf the things that they believe in like this little\n\nThe [noise]\n\nNot to go on the run was\n[noise]\nYou're listening to live from your ... fur peace ranch this concert featuring Larry Corey Allen joined by Paul where to go and mark Egan recorded June the second two thousand seven\n\nYou are locked onto your alternative source Ninety point one W. I. U. P. F. M. Indiana\n[noise]\nIs your mind you're listening to live in the peace ranch\n\nI Would like to dedicate this next peace of mind works racy\n\n\nAnd this is a combination of compositions first of all just total transparency which is going to be used as an as an introduction for the jurors gr a dirt Gore short for the George Gershwin standard love is here to stay [noise] Mm\nMm\n\nMm\n... ...\n... ... ...\n...\n... ... ...\nMm Mm\n\n\nMm Mm\n\n\nMm Mm Mm Mm\nMm Mm Mm\nMm Mm Mm\nMm Mm\nMm Mm\nMm Mm Mm\nMm Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm\nMm\nMm\nMm Mm\n\nMm Mm Mm Mm Mm ... Mm mhm\nMhm\nMm\nMm Mm\nMm Mm\nMm Mm Mm Mm\nMm Mm Mm Mm\nMm\nMm\nThat manner to\nDo\nDo do do um\n\nDo\nDo do do do do\nDo do do do do do do that too [noise]\n\nLive from your book how can inspire piece ran to the coal production fur peace ranch W will you be public media the concert producer isn't as accounting at the radio series producer is rusty Smith full\nAudio engineers the rest of the men\nAnd Adam ... ...\n... ... ...\n... ... ... ...\n[noise]\n\nHey an open up your door knocking fell off\nCharles Shapiro\nHigh high brew ha ha ha\nYes ma'am\nOctober twenty ninth Nineteen Seventy one the days in a motorcycle accident jumped the life of one of the most vibrant young guitarist music ruled is known\nAt just ... years old rock and roll lost weight on them and and here in twenty Thirteen his legacy is still as powerful as the guitar licks Denise continually remembered by going\nIn was a very unique an individual powerful person either you you loved why and how many people that knew him or you can stand to be around being\nI think my father is more of a year now and more known now than he was not\nOnly brother against rather growing up\nWe started playing music together\nThen became closer and closer to\nWelcome this guy dog didn't wait on retrospective in radio companion piece to one of the greatest\nMusical collections available today I'm Johnny nasty and we're about to hear from daughter ... current Allman brothers band members Derek Trucks and more and hangs the legendary ...\nFormer Allman brothers Dickey batch and brother Greg I'm home and not only that but thanks to the Allman brothers museums\nWe will share some rare interview pieces with Wayne Allman to get us started let's check out a sample of some of the significant work that Wayne routinely did during his brief buddy act\nJourney and rock and roll\n\n\n\n[noise]\n\n\n\n\n\n\n\nWhen you hear a medley of classics like that\nIt's no wonder that clean Allman was raided second only to Jimmy hendrix on Rolling Stones list of rocks one hundred greatest guitarists appalled by I'm Johnny now\nAnd many of us are familiar with his amazing contributions he made and co founder the Allman brothers band\nWell as the collaboration he did with Eric Clapton and Derek and the dominoes\nBut when you add the likes of love Aretha Franklin will pick your boss gags do lenient Bonnie Ronnie Hawkins not just mentioned the many sessions you went into that he didn't even want credit you have someone significantly special here's Bob cat with a great memory of Wayne\nI met Dwayne while I was caught in my first us all\nToday in the rhythm section going was a bike friendly very genuine\nPasta guy um he commanded a great deal of respect from the other musicians and the\nEngineer and people around the recording session and everybody got a smile on her face when a when I walked in he responding and\nObviously they had a ... a very strong\nWith each other there was something special on the air with wind there\n\nConcerned\n[noise]\nAnd you were locked onto Ninety point one W I Hope you get them Indiana, Pennsylvania [noise]\n[noise]\n[noise] welcome back to guide dog didn't wait on them in retrospect I'm Tommy now often made sure you get yourself a copy of one of the greatest box sets of music this holiday season where ever you buy music\nIn the early days of Twain's musical career skiing rather Greg started in a band called the escorts who actually open for the beach boys in Nineteen sixty five but quickly disbanded\nAnd the do will form the Allman choice that fan base themselves out of Nashville and play throughout the southeast and soon after morphed into the hourglass and moved to the glitz and glamour of Hollywood [noise]\nDaughter ... and brother Greg all him and tell us about the early days of Wayne and his first musical projects\nI mean and that's the interesting thing about the talk to you as a first song love light and the fact that they were you know in high school [noise] and um [noise] ... has been and the fact that they found that kind of passionate song right out of the box and\nYou know watching them for the developing go through you know falling in love with a yard birds or doing standing with the science of our knees he's never met before he walks in the studio with every Franklin laser down and\nWilson ticket I mean it's really interesting to see the story unfolds which I think that that's the one thing about the box you know and God Bless them censored\nTo see the psychedelic sixties you know San Francisco sound you know with the hours lots of trying to fit into that more than you could see the really deep root that was happening in Muscle Shoals for not for the beautiful perfect sounded a room and them being informed by that\nYou could see him gathering all the information that tough to then take this huge wanting me to do the band around south and just do it I\nAlways knew he had it but also always knew that a lot of competition\nSo we grew up you know player that people are ... that is given all this kind of they all seemed like there are struggling at one time at this one place in the valley in Los Angeles\nAnd uh it was one of twelve of all the names that was called the magic mushrooms I remember driving up to the place\nTo her so in that too and I looked up large key\nSaid Taj Mahal\nWhich is the top no none of us whenever parts of Pakistan and want to throw it out [noise]\nLauren am fires from each other\nJust a local bar will play that and I remember seeing that Marvin Gaye and thing\nI don't think\nThat's the escorts doing their version of a classic love lie\nDown let's check out the ... was shapes shade\nYou know\nThey need to change\nName\nYour gesture to gems from the early days of Duane ... with the escorts doing turn on your love life and shapes of things from the arm enjoy\nWell one person that shared the stage with Dwayne in the early days was former Allman brothers band lonely guitarists ... windows you played together\nIt was a guitar players dream to see what they would inspire each other to do\nDickey now shares on those memories and the impact of Duane\nFirst of all the great friends second wave we understood what each of us were trying to do and then there was a very good help the competition\nThe rest of the band\nIt wasn't a guitar slaying\nThe play that good I Know I've gotten to play\nThat is something I think\nThere's more calmer and that's the way you should work with another musician whether it's to guitar players or piano player and a base\nThe thing Dwayne really brought to this band you know we had six bandleader\nBut but what do I mean really offer was\nAnd ... from ...\nHe didn't have blinders on by any means\nBut he was straight ahead positive in his sleep focused and I'm\nOne of his things from LA is you know we've got to watch somebody we can send us but we can't leave him behind like go to the rest of us\nBut the oil was a unique and and with our first and uh I've heard it said before they either you you love and joy at home and if you see but knowing or you couldn't you couldn't stand to be around him well\nMy experience most people love to be the ones that didn't like him because he wouldn't put up with the\nOh the Justinian\nGrows to [noise]\n\nThis is a guide dog between all men retrospective and when we return Allman brothers\nDerek Trucks and Warren Haynes joined us and we'll hear again from where I go home and\n\nYou're listening to W. I. U. P. Indiana PA Ninety point one\n\nWelcome back to skydive between home in retrospect there I'm John me now to make sure to pick up a copy of one of the greatest box sets of music available online at Amazon and wherever you buy music for information on sky dog and other great works of music and\nGo to W. W. W. dot in Concord Music group dot com [noise]\nEven if they're inception\nPart of the mystique an attraction to the Allman brothers ban was their ability to put up\nAfter his passing the bans rabid fan base is wrong with the children and grandchildren of their original followed Derek Trucks and Warren Haynes talking about the legacy of Duane and the way he progress as a guitarist\nThe difference between Dwayne in sixty eight sixty nine Seventy Seventy one sixty eighty was really good sixty nine way yeah Seventy leaps and bounds better Seventy one like a whole nother planet and he was twenty two twenty three twenty more died before he was twenty five\nSo to not realize that [noise]\nWow when he was twenty five twenty six twenty seven twenty eight twenty nine or ... or\n... you know it's a would be a mistake to think that he was anywhere close to ten Juliet there's there's no way that he even scratched the surface of his own potential\nIt's fascinating as a as a handful of guys flipper brown Charlie Christian Dwayne\nBooker Little these guys that go out\nTheir late twenties and they found slowly realize [laughter]\nYou know when you look at the argument of life no part of me thinks that they knew that they were not going to live alone but it's amazing how much they back then you know individuals that way too you know that's a full body of work you'd have fifty years or not and not have that much to say so they got it got it [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nStage borough blues from the Allman brothers band I've taught me now\nTo this is a guide on the radio companion piece to the recorded box set of this state\nHow we would have enjoyed and in during the decades of six that's his band is\nGreg ... gives us a personal look it is relationship with brother ...\nI think it was during Christmas we get into these\nChristmas carols\nWhen he was younger where it gets stronger\nCase and the boys' choir and\nYou know we brother against brother growing up\nWhen we started playing music together\nThere was getting closer and closer friends\nThat was the catalyst with us together and\nA bomb\nMusic that nobody had ever quite heard before there was no charts for what they were doing\nBut we would never ever learned about buddy Holly and all the other artists too that were inspired by Sam Philips generous spirit of wanting to have this music get out to people and it reminded me of something that President John F. Kennedy said\nAbout the arts and I want you to listen to this because we are in an age where people like Sam Philips would have been denied people like I turned it would've been denied people like Elvis Presley would have been denied why because music and arts budgets are being cut everywhere because there was an assumed it no value\nTo what the music and arts does to community Winston Churchill said it best I thought when asked if he was going to cut them the arts budget from the a ... a British\nUh economy because they wanted to support the war effort he said to cut the arts budget than what on earth are we fighting for\nJohn F.\nKennedy [noise] John F.\nSaid above all we're coming to understand that the arts incarnate the creativity of a free people when the creative impulse cannot forest when it cannot freely selected methods and objects when it's deprived of spontaneity\nSociety senators the root of our John F. Kennedy knew the value of music and art and this goes all the way from sun records in Memphis all the way\nFamily you are part of the beautiful legacy of music and art in America so keep on singing [noise] my name is Michael Jonathan I'm a folk singer I Am a song farmer we'll see you next week\nKeeping secrets are catching up with nine eleven Michael's unreal effects Nissan was an old Johnny Cash song called the ancient history\nAre cheap engineers drone gulp to Nichols systems are ... Brennan eased mark Thompson the ... or TV and Internet broadcasters directed by Esther Matthews or technical directory screws brown\nWoodstock to remember the weakest joke on ... and our son's partner at the weakest Janice Hurley\nSpecials were provided by Hubbard spring water make coffee the seven believer feeder in Johnny ... Reno's in Lexington\nOur shirts produced witness for the visit like dot com Kentucky tourism travel has magazines begat fan company blue grass I've not eat so the Asian and the clarion hotel conference center south in Lexington, Kentucky bumping visitors from all over the world to Lexington, Kentucky\nWhich bones in the woods so similar registered trademarks of ritual lumbering music are she was distributed worldwide by the which owns radio network NPR rex thanks for listening I'm joke on bread for\nMichael Johnson and the entire with ... Dorothy had words we hope you'll join us again next week for the sun's old time radio hour\n\n[noise] [noise] good morning could mode\nYou're listening to you\n\n\n\n\nOr do you argue\nThey\nYou're bottle wide open\nWhole game now\nTheir job and\nGoing through your battle wide open\nAround\nRemote in the sun goes down\nThe zone friday\nAnd I'm In my own\nEngineer watcher hold your model wide open were\nI live at home and the Allegheny Mountains thing for him that\nHas a ... big day when you move to\nThe new launcher wide open\nAnd nothing happens and that's what happened [noise]\nSo we did a quick switch to another CD player and got to show rolling\nMakes for your patience [noise]\nWhat is it coming your way and just a few moments right here on your alternative sorts\nI Can't believe you found them she seems sorry we very clearly\n[noise] I guess we'll just know what is it gives starting this year I really don't know if they can find their presence they can find a gun everyday a kitten ... unintentionally killed or injured by loaded guns learn how to make your own home safer at and family fire dot org ... by the ad council and family fire well here's what's\nGoing on weather wise today are a rainy weather will continue for another few days and evenings there will be showers today before two PM today's high just forty eight degrees showers overnight tonight look for a low around forty one [noise]\nFor your Monday a chance of showers especially before two PM\nHigh around forty five degrees\nLook for a low around thirty seven under cloudy skies Monday nights they'll call them for a mostly sunny Tuesday with a high near fifty six rain moving back in Tuesday night and Wednesday especially after nine AM\nWednesday's high about sixty two\nOutside right now here in Indiana overcast gone forty three degrees\nGetting back to the music now with\nOne from the self titled debut release of the girls up Lester\nSomething that's going on around this area this time of the year it's called stuck in the corner [noise]\n\n\nDon't know my\n\nMy mother had been\nReason then\nOh the jewelry\nAnd we may be\nWally or\nWe love\nNow they're voting a\nLetter just a\nLawyer's day when the\nSeasons are turning around\nAre many alone\nWorld I don't\nAbout ... ... ...\nWhen a murder is\nAnd I go to buy and no one waiting\nA\nNew one to learn\nNot\nLove\nOregon can file\nLetter just\nOr years they've been ...\n\nThe the\n\nGenes to lead the\nBranches\nThe urban rose when the ... been turned before that the country gentleman do the fields up turn brown those two following the rules of mustard\nHere's Michael Cleveland with the steam whistle blowing\nAbout to be a total man but never got the hang\nThe ... bros by at\nFavor them shaking with the town's out but they\nOwn and no\nMom\nI'm\nThanks yeah they are\n\n\nSeen as I Know that\n\n[noise]\n\nAs picky bowler from her album queen earth in Scotland one called home\nSidelined before that from their album covers and cross roads you don't know what you got till it's gone\nThe bluegrass prior to Pittsburgh the Allegheny drifters\nWhat's long lonesome night without in that from their album can't wait and\nMichael Cleveland started that set off with the lawyers dream steamboat whistle blues Greek John Hartford so\nThis is the bluegrass ramble Ninety One ... W. I. U. P.\nMore music coming your way in just a few moments\nOlder you get these through the mid sixties you know the good stuff [noise]\nI'm Jim Bunning to join me were the only zone Sunday at six PM\n[noise]\nRape music from the ... the president [noise] great music he's now great music you don't know yet more more since Sunday simpler these what's happening\nWonderful isn't it I think you can prove to break the oh did they knew nothing really are and the forgotten offending camp life all that out from a yellow lab\nRight here on W. R. U. P. FM gets the Sunday simpler with mark Morris [noise]\n... [noise]\nElection days Tuesday November six find out what the candidates have to say\nTake the opportunity to ask them your questions that candidates night\nIt's coming up this Tuesday October thirtieth come to the ... community center ten fifty five oak street Indiana at Seventy um be sure to arrive early and submit your questions disadvantage open to the public and will include the candidates running for the office of state representative from the sixties second district\nDemocrat Logan ... and Republican Jim Suzie\nCandidates NATO sponsored by the league of women voters of Indiana county more information is available by calling seven to four\nFive nine nine nine two to five or by email at L. W. V. Indiana county at Gmail\nTitled could we get any closer\nThis is Jim louder Dale on the bluegrass ramble\n\n... a A R my garden and\nIt was he was living here hold on\nSee we go\nTo be black\nA\nA no mount and all that goes\nWhere they see that you can't drink the water\nAnd a wrong way or the\nDown at the same ... that come out there\nGo boy or a lone review by\nTo use the main flower\nNa\nNa na the goal\nBeing\n\nTo me ...\nA mount ... the\nBeans by our\nOwn you\nA mile and a\nReally\n\n... and\n... miles away nine forty one is what I mean the most damage and I mean a lot of the main the main body saying\nShe was found to go by and\nMiles oh my God in\nSaid why do why and\nWe'll we'll see growing up\n... ... ... ... or something for everyone you're listening to your alternative source W. I. UPS in Indiana\nGetting ready to meet your musical heritage it's time for the best in cope music on W. I. U. P. so long as we explore the rich and branches of music in America on today's edition of hope\n\nAnd robots catalogue of\nWas right when I could pay off to do or die down the Dodgers lying\nThe line merit dream down but you\nThem a separate railroad cars are the same boat ride downtown Martin modern momentum\nBuilt by many more lives right now\nReal ... and then I have a plan and they may be Jay\nBahadur down a little weird to have my house with the Labor Day today\nI don't understand the require them\nA ... a lot\nAnd they are liable\nRegarded in the rain the wall and then they began to blow\nUp the lord is way over time the creek don't rise it will be a long day for the snow in the\nKnow then labor\nSo come on and and take a chore that\nAll a lot has led by this how did that three thousand dollars a gallon to\nThere is a robot American Dream a bargain on the way\nA bygone time way stairs couldn't sell and they say\nMara by\nAround by\nThat dean my American Dream\nRequire\nThe Miami can dream\nRequire\n\n\n...\nThey should we go\nOver ...\nRole butter ... Street Room\n... shows me well ...\n... ...\n... takes\nA long long\nBall things that I took a\nLong time and through\nA long time a little dog yeah ah so ah they may can\nHere is my\nOh roshin from an album called keep on moving forward and here is my home\nJohn ... been in the J birds before that home is where I Belong solo can ramblers the one called making ... an Indian Judy started off this edition of folks on\nWith one call some assembly require a song about the fact that you actually could at one time buy a house\nFrom the Sears catalog [noise]\nGood Sunday morning I'm Jim great to have you along on a rainy Sunday we'll get details that for you in the forecast coming up in just a few moments we'll transition from home to Halloween [noise] with our musical selection they too [noise]\nIf there was ever a time to live United is this now now is the time to speak\nThe problems that keep our communities from thriving United Way fights for health education and financial stability of every person in every community will you volunteer or donate now at United Way out of work\nWell with the wind is today our rainy weather continues that since eighty percent probability of rain today\nMostly uh up until two PM and then\nAfter two it'll it'll be a\nRain showers behind your forty degrees showers overnight tonight the low forty wanna chance of showers mainly before to again tomorrow\nLook for a high around forty five down to thirty seven Monday Night and then some sunshine on Tuesday if the forecasts holds true and we hope it does a mostly sunny day with a high near fifty six that the rain on Wednesday especially after nine AM but for a high around sixty two degrees mid week\nForty three degrees outside right now\nAs mentioned we're going to turn our focus now\nFrom an album called second takes art for whips\nWhich is the ... on that before it went up and [noise]\n\n\nAnd I know now\n\n\nInterrupt the Martin Luther King it's been there for two years now and lonely misery nobody by he calls\nWhen they need to add a lifetime of belonging are piled up on the ...\nThe name of\nThey shoveled ... nobody would gain but I've been eating one of the\nIf I don't ... well it it really is a shame they say like if the\nSee a ...\n...\n...\nI was speeding pretty leading they've got the mayor in talking and the river not in\n... they know they are surely\nDamien him the director\nYou know hidden bomb you and they served a neighbor's well\nSometimes marrying\nPain he\nOn a war among Dover day George do you watch my your engine green bubble way\nTo the rescue of his ... didn't address the non smokers who do this to me of some young though yeah\nGuy\nThe Russian do when he was playing online and you\nKnow when you're a hero\nMartin Luther king\nBut he can do in ...\n...\nIn the lord\nOn the do\nWater down the beach\nThey don't want to take your money and the other thing\nIs about the Georgia where the ladies thing ...\nNo bunny well then\nSome storage tanks\n\nMust be and\n[noise]\n\n\nNa na na na na na na na na\nNa can show\nDog [noise] [noise] [noise]\nNo no no no\nNo no\nNo no no not\nToo sure\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\nI mean ... ...\n...\n\nOh\nNo no no no\n\nNo no no\n\nNo\nThen ...\n\nYeah and uh\n\n\n[noise]\nKnow over there and this guy\nBy ... by stopping\nAnyone anything you you\nAlthough the will to learn about do you have a\nDon't know whether I\nSay ...\nNumber up to the rail\nWidower all did win\nFor the\nFor\nDon ... all over the\nAll\n\n\nMm Mm\nMm\nMm\nMm Mm\n\nMm\n\nMm Mm\n\nMm Mm\nMm Mm\nMm Mm\nMm Mm Mm\nMm Mm\nMm Mm\nMm Mm Mm\n\n\n\n\n\nMm\nMm Mm\nMm\nMm Mm Mm\nMm\nMm Mm\nMm Mm\nMm Mm\n\nMm Mm\n\nMm Mm Mm\n... ...\n...\nThat's called the ... ...\nFrom his album some some [noise]\nWhat's the company before that the ghost of lobsters freak fleet\nRustic writers with goes in the river from their album hearing hearts\nJust spoke time Ninety point one F. M. W. I. U. P. great to have you along on Sunday Morning [noise]\nWe'll close out the show with a couple of more instrumental in just a few moments right here on your alternative source\nW. I. U. P. F. M. presents White House chronicle with Whelan king and Linda ... Monday morning offering a discussion of current events and issues in the nation's capital and beyond from the political to the personal it's news and commentary with an intelligent viewpoint\nAnd delivered with a sense of humor each week you'll learn something new or think about issues in the new way so joined little while and king and Linda ... for White House chronicle Mondays at seven AM on Ninety point one W. I. U. P. F. at your alternative source\n\nNinety\n\nMusic music you know more more since [noise]\nYeah\nKnow where you're at W. R. U. P. F. M. Sunday simple more more\nJoyce [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\nEnsemble music oh bleak [noise]\nIs greeting us with the aquarium movement from [noise] you know step sons\nCarnivores again [noise] on this\nSpecial sees me I'm spear edition of Sunday Morning classics and good morning I'm Tom Miller [noise] with a three hour plays is made up of ... macabre chilling music [noise] music the draws on teams of dust\nMel Lebanon spirit [noise]\nAn alien unknown forces in recognition of Sunday mornings sensibilities I'm approaching the subjects with fairly quiet\nSelections until turning to work so greater dynamics and intensity [noise]\nFor now we have the remainder of cents on the Korean [noise]\nFrom his carnival with the animal and it will be followed by ... [noise] ... [noise] the ... [noise]\nAnd then we'll have part of Sergei rock more than those [noise] the ... as the\nTear on WBFO ... Sunday Morning Clinton six [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWill stay with this coral version for a bit and then\nIt will give way to Reno risk biggies boots on the phone\nFrom his Brazilian impressions which he can pose as a result of his Nineteen twenty seven summer long concert to tour of Brazil\nBoots on top is a reptile Institute outside of Sao paulo where thousands of poisonous snakes are raised for Sarah production [noise]\nThe deadly creatures are represented by this day is there a\nThing as arranged by speaking [noise] a bit more now of the\nYou know to go to a\nFew years on the well\nYeah you bet ya yeah I'm\n... I'm\nA no no no oh no she is um\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\nThey Dallas symphony orchestra Eduardo ... in that recording up ... from ... Brazilian impressions\nThe music [noise] they're giving the composers impressions of the slithering deadly snakes raised at the Brazilian reptile Institute named content\nI'm Tom Miller your host presenting this first to three hours of music featuring haunting menacing in other worldly sounds which leads us now to twentieth century Russian composer\nDimitri shots Dakota bitch and for starters will have to movements from his youthful effort his symphony number one of his tenth of Nineteen twenty five\nEach sniff unease third movement taking us are taking up about nine minutes draw\nA leisurely and low key\n... that will be abandoned whiskey movements that will follow we had the Cincinnati Symphony orchestra ... Lopez cope Lucy and the third new but just to go to sniff honey number one\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] the second movement of Dimitri shows decode which is Seventy number one [noise] music that could help provide a chilling\nAtmosphere for use in a horror horror film perhaps him although the composer Justin ... inch intended nothing of the short when writing a symphony back in Nineteen twenty five\nAfter these reminders will have some more shots Dakota which\n\nDiverse and commercial free you're listening to Ninety point one F. M. W. I. U. P. in Indiana, Pennsylvania\nMy son aid and has asthma secondhand\nSmoke catch it to his asthma fell badly he ended up in the in the room I spend multiple nights intensive care now he's in a whole bunch of medications my fifty you is don't be shy about telling people not to smoke around your kids\nOf us kids are exposed to second hand smoke if you or someone you know want help call one eight hundred quit now a mess\n[noise]\nJust to Kobe wrote [noise]\nIs the number one was\nNot for years and then a\nHorror film or anything like that [noise]\nBut it's a different situation with these\nFollowing selections from his son ... score for the Nineteen sixty four movie version of the Shakespeare play hamlet were certain scenes call for music or they threatening\nEvil sinister and deadly character\nAfter this overture please okay we'll hear what she wants to code which created for\nThat goes to see\nAnd then the poisonings see from\nThe school work for him\nGetting his reforms by the Russians going Monique orchestra Dimitri ... conducting\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\nFeel like anything more than getting some ... with us and other places of the world there's certainly a problem with scorpions for humans because there's scorpions that are capable of killing an adult human here in the U.S the only people that would need to worry about scorpions isn't the case of one species which lives in\nArizona and western New Mexico\nCalled the Arizona bark scorpion and that scorpion\nFor an adult human or a healthy person it feels like a ... I think that's certainly not pleasant\nBut for a young child or somebody with a compromised immune system can always leads the complications that that are unexpected and and so it's always good to take care around when you're living around those pieces [noise]\nMore of them were pro Jim\n... says the plan you can listen to this in previous programs [noise]\n\nIndiana's only public radio station this is Ninety point one W are you\nLocal public health department helped identify managed to prevent this and many other health related issues I'm Marjory McGuinn president of women in government organization of women state legislators women and government wants you to learn more about how public health departments are saving lives\nThey make life better for all of us to learn more visit limited government dot org slash public thought health\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nPortrayals of two Russian which is about my yoga\nAnd Kiki more\nTwo sisters and above a yoga and Kiki more [noise]\nOf Russian folklore are represented by composer [noise]\nAnd I totally out of [noise]\nAnd with the Mexico City\n... Enrique but he's conducting I'm continuing [noise]\nWith Kiki Morrow in the background [noise]\nThey take us to [noise]\nTo the temple dance from at for Craig's unfinished opera [noise] love ... son [noise]\nAbout Norway's first Christian king [noise] we're about to witness the\nPagan preached ... protesting [noise]\nLoves [noise] planned to convert them to Christianity as they sing and dance in praise of food and [noise]\nThe trend high symphony orchestra and chorus holy Christian road conducting perform for us the temple dance from Griggs unfinished opera\nWell a trick question on WPN him Sunday Morning classics [noise]\n\n[noise]\n\n[noise]\n[noise]\n\nYeah\nA big no no\nNo no no\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nBut we do have the Berlin radio symphony orchestra ... conducting\nIn\nThree parts of this night on Mount triplets sweets from of course that cause a lot of opera\nHere on WBFO ... Sunday Morning classics [noise]\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\nThe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nSunday Morning classics presenting music from three scenes of act three a nickel or risk of course it costs\nField and opera [noise] a lot of the sequence of scenes we heard much from a sweet I'm of extreme\nTitled night on might mount a trick glove a natural mountain outside of here in the Ukraine and this is sunny morning classics I'm Tom Miller your host\nWe're going to finish up this middle hour of today's program with parts of two works by twenty century British composer rough on Williams\nThe first or the works is Satan dance a triumph\nFrom bond Williams job a mask\nFor dancing this excerpt regarding here is the second the eight scenes from job in which a Satan thinks he can get job to force fake and even curse God based\n... leads the Munich from New York is Geraldine Satan dance drawing from the second seat in rough on rains joke a mask ... dancing\n\n\n\n\nFor Altman park would end west Lebanon this is your alternative source Ninety One FM W. I. U. P. Indiana\n\nAnd this is Sunday Morning classics Amir classical music sir I'm campus community radio station for the last twelve years and this is Tom Miller of course [noise]\nWorks by rough on Williams\n\nPart of the seven symphony of rough on Williams\nSince ... and ... based on the music he composed food the\nNineteen forty seven CEO Scott Antarctic dark\nNineteen forty nine movie rather about Scott the English are British could explore trying to be the first to reach the south pole and he failed and did not survive\nThat was the London symphony orchestra Andre Breton conducting animal here\nSunday Morning classics\nYou are locked onto your alternative source Ninety point one W. I. U. P. F. M. Indiana\n\nMy piece is\nI'm a school [noise]\nI'm really\nGood\nI nursed dino Colbert plays in the hall of Martin King to move on to their dog or a Sunday Morning classics\nWe just heard the Martin king [noise]\nTalking to one of his children [noise] they were discussing what to do was pure yet\nHe wasn't pleasant [noise] and I'm your host Tom Miller and we continue now with a five part\nAustin auto sweets\nAll the works\nDisplaying persistent phrases or rhythms\nAs worse than excited heartbeat\nWhich may cause year two years to accelerate\nOh your spine tangles\nAnd skin ... hours [noise]\nThat's that's the first three elections begins with\nIn the hall of the mountain king the royal philharmonic\nWith the beach um choral society [noise]\n... [noise]\nThird of the five selections will bring us back too risky\nWears his dance of the known\nTheir royal ...\nThe whole of the mountains [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nAnd let me give credit\nWhere credit's due\nWith her in the background\nAnd explain what we've heard in that part of us to know ... different\nGreat in the whole of the mountain tank\nFollowed by\nMore suffering or for\nHer part of Mars\nThe battle on the ice\nSurvey for coffee has [noise]\nMusic from the\nNineteen thirty eight\nMovie Alexander nip ski [noise]\nYou know modern recording\nWith the St Petersburg filler Monica orchestra your eternal colonels and acting\nThat battle the ice was followed by\nScifri and our rich biggies\nDancer the new ones with the Minnesota Orchestra Yogi conducting [noise]\nAnd then we had a part of William Waltons improvisations on an impromptu Benjamin Britten\nThe inspiration for his improvisations was taken from this impromptu that\nTwo hundred McGregor with the English chamber orchestra it's playing in the background [noise]\nImpromptu was composed Nineteen forty five by\nBenjamin Britten\nAnd then in Nineteen sixty nine [noise] Walton composed a set of improvisation on that theme\nAnd this is only point one W ... Tamil your host\nWe have a complete work\nComing up next [noise]\nFrance was taught in Hans\nWe hear foreign\nWith piano an orchestra [noise]\nBut today Sunday Morning classics presents the solo\nGeorge ... or ... at the keyboard which ...\nParents raised on\nYeah yeah yeah you know\nA ... a\nA a\nJust a reminder about that or ... minutes which we're going to hear from ... in a moment\nOr\nThe deer survey or the day of rats judgment\nBut less turning it into dance ... towards a toss\n\nUp for a while [noise]\n[noise]\n\n[noise] [noise]\n\nThe uh\n\n[noise]\nMm\n\n\n\nMm\nMhm mhm\nMhm mhm Mm\n[laughter]\n[noise] [noise]\n[noise] [noise]\nMm\n[noise] [noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nDa de or if it was at the keyboard ... supposed to talk of the ... ... usually the pianist does the company\nBy an orchestra thing to talk more than ... based on the medieval\nChant ... or ... also known as judgment day\nYou are locked onto your alternative source Ninety point one W. I. U. P. F. M. it'd be\nAgain now the sweet ... leads the royals talk so am I worked ... and this mountain in Belize to meet to Nineteen king is not in reference to or anything like that are great in home to the mountain king but you know the difference\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nThe royals ... construe\nReforming the implications of trying to go off the Martin king ballets me\nWhich takes us to our next to the last election on this\n[noise]\nBoys\n... terror stir\n'cause we have the Chicago Symphony orchestra here but let's think [noise]\nAnd the second most [noise]\nTreatments [noise]\nDiverse diverted into [noise]\nWe're string orchestras [noise]\nOn Sunday Morning classics [noise]\n[noise]\n\n\n\n\nYou're listening to\nNinety point one dabba ... FM in Indiana, Pennsylvania [noise]\n\n[noise]\n[noise]\nSing out magazine was founded over sixty years ago my group of folks who love roots music today it's a vital entertaining resource for anyone who loves folk music the world over\nThousands of people turned to sing out to read about and learn from the artist to play the music [noise]\nThis is the single radio magazine [noise]\n[noise] this is the single radio magazine and I'm your host Tom ... where are the music comes from the CD the horse and the crane by Swedish multi instrumentalist Ali Muller we heard heaven and earth of course in the crane is on north side records\nThat time of the year once again when houses are decorated with Jack o' lanterns corn sharks and scare crows and other recoup ... Halloween season\nKids dressed in a wide variety of costumes both homemade in store bought get ready to go from house to house yelling trick or treat collecting candy from their neighbors\nThis week I'm missing out radio magazine I'll be presenting some of my favorite music of the season when clued songs about spirits and goals along with some particular we spooky instrumental\nOpen this week's program with John Roberts and Tony brand from their recording dark ships in the forest will hear dreadful ghost music for the Halloween season on this week's edition of the sinking out radio magazine\nThe state of mind trying to see the joke grains lying to me that he did the guy in Iowa and those too late\nSome handsome grove she came and they're playing for the wedding do strides she called them a threat to\nLie she hung herself down from a tree\nWhere two men a hunting and did her see they got nice fund\n... down and on her ... was found\nAnd this was a rejection letters Long Jones very may I Do you charge but on the ground that lasts\nMe lie and that may may see me as they pass by\nLet them take warning by my fate and Kuwait to this folly before it's too late and fly along the line and uh she played\nDidn't so to the ... he was forced to go\nOne morning on the top ... a little boat teach ends to spy on this to both with the large crew of men and the female goes to store up then\nDown ... down next to this young man goes to\nGr reaches a captain in his morning close he says captain captain\nStunned by the fence but rice the spirit to\nCalming hands\nSo up on deck this captain goes\nThey're raised by this direction food goes she says God ... captain gum\nIt was instant challenge this\nYoung man died and then saying child in the body lying just\nShe says captain a captain\nJoan ... so four he's sailing down there in your ... below\nAnd if you don't bring him up to me I'm mighty storm you soon shall see which will cause both you and your gallons men do we and leave you slum bug ring\nIn the\nDown ... down that this gap can go and ... the young man up to his foes underway she fix tug gr in lies on\nHim it made in ... oh\nDon't you remember when I was a maid you cause my poor trembling hard to believe that now I Am a spirit to come for dial\nYou book to me one spinach I Gotcha now down in a boat chief for said him down in her boat he was posed for to go and\nThat he did we all did at my house for the boat went down there and the flame of fire\nAnd then she sang she rose again\nNine died she sang this long full strain or you say ... who are left to be high and never prove falls to young a woman ... and [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\nBefore that we heard from three hat trio how Kennan Greg I stock and Eli rank all their from northern Utah on the edge of desired national park\nAnd we heard a song called Mojave from their recording solitaire that's an okey dokey records from three ... trio and we were off that set up with a song from John Roberts and Tony brand from their recording dark ships in the forest ballads of the supernatural in it\nSacrifice before the vessel can sail the dreadful ghost collected in the Canadian maritime dark ships in the forest is on foot legacy we're\nGoing to lead off this next Halloween set with Mike ... is recording Bosh and moonshine and a song called ghost in the winter is my ... on the radio magazine [noise]\nDoes that goes in the theater\nWhen stormy night she Lincoln's\nThinking they're going to\nShe wonders through the drifting\nBoat for her hand\nWith the real good luck in ... [noise]\nBut like every would react\nTo drill down like lowering\nTheir misery in your ...\nYour ... your address\nSome said there do you do a bad\nBe careful how you set up\nAnd then you should get to go [noise]\nBoring you step\nUp on her lines shield at least let your [noise]\n... Mm Mm Mm\nSit around with candles and then it was late in the night and we couldn't think much to say but the flame is right then we saw the herd and no I totally ...\nLet's get\nIt could happen to you people I Know half\nThe ... to my mom and dad both say the truth about the only thing to do ... did you hear about the head the scores and a ...\nMinute drive through he'd ride with you but the\nCoal mine got a little\nThe little boy they surely was that\nMany words he says it any better than it is\nIt did happen to people I Know I have seen in my mom and dad tell you the truth to that you don't lose too [noise]\n\nMy grandma could read on\nShe had that second say ...\nIt in that scene again to dinner at night they're going to get hired and tied on\nThe second floor the dentist chair and you wrote the cover all set you might not see when\nIt happened to those people I Do have ... to\nMy mom and dad stay in the whole goes to eating [noise]\nStopping it in the\nBelieve when we know the\n\nThese stories of greed he\nDid you hear about the boy it's hard to stand in the reserves now did you hear about the man in this prize sanitary you the devil\nHear about the cat did then did you hear about the baby in the when\nDid you hear about the degree to me\nPeople I Know\nMy mom and dad it's true you know to me\nIt you know as you said let's go\nAny\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\nNo no I don't\n\nLike it goes down the street [noise]\n\nMm\nSome non down saying\nBreeze ... not just a music [noise]\n\n\n\n[noise]\n\n[noise]\n\nA majority in the late\nOne one\nHard in the Gulf bird ... who manages\nA\nDon ...\nAnd I'm Martin a\nGiven a job\nTo do you know you know they\nYour mom there's a\nThe Muslim I'm\n\nOh\n[noise]\n\n[noise]\n\n[noise] [noise]\nOh\n\n\n\n\n[noise]\nA\nDay\nTo day\n\n\n\nToday\nSo um [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\nOh\n[noise]\n\n\n[noise]\n\nUh\n\n[noise]\n\nDespite the carnage of civil war and if you saw the film cold mountain can remember that the very earliest scenes of the battle of Petersburg, Virginia and behind the battle scene was stirring sacred harp song called mayor\nWe just heard the sacred harp singers that liberty church recorded in Alabama from the soundtrack to cold mountain a DMZ records\nAnd before that Robin ... Williams with murders and the Cumberland Plateau all about a battle on the Cumberland Plateau in Kentucky that's where my collection called in the jailhouse now on sea mh records from Robin Williams\nAnd we let off that sat with Claudia Schmidt from her recording Midwestern heart and Michael Smith vampire bats are flying fish records from Claudia Schmidt going to conclude this Halloween program with a little bit of advice from Tony Joe white\nDon't hang around graveyards late at night on the sink out radio magazine\n[noise]\nNewton agree um [noise]\nNew ... D O bottle warming bigger [noise] go through [noise]\n\nJohn Gray deep in the dirt and learn the bone marrow long to do the job market in the in the in in ... there are now the pressure on the planet and oh\nNo I mean the burger words for some reason why you've all around\n... [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n\nIn their ...\n\nAnd for birds flying and so do you have everybody in your home loans and things to be but there you go to the needs to\nBe there in the grass and all of them go down\n...\nMm\nHey and Sundays unplug Iran W. I. UPS than Ninety point one I'm Brittany dairy your host each and every Sunday afternoon from one end so three this is one of the times that I made it into a A R U P into Indiana to do the dishes\nToday I Am in a very rainy Indiana yes it is going to rain pretty much all day long today and tomorrow\nForty or forty three degrees right now and that's not too far off from our high temperature today a forty eight showers for the remaining part of this afternoon about an eighty percent chance of showers and then as\nWe get into tonight showers become even more likely in the overnight hours and below forty one then Monday pretty much the same a lighter chance of rain showers on Monday with a high a forty five but\nLet me just remind you if all of this rain is kind of bombing you out it could be worse it could be snow right at least we don't have to shovel the rain\nOr Tuesday we get a small tiny little break from the rain with mostly mostly sunny skies and actually a fairly nice high temperature of fifty six and even warmer still on Wednesday and Thursday even though the rain returns to us\nWednesday and Thursday with a high temperature Wednesday of sixty two and another high sixty two on Thursday as well with more rain so\nRainy week ahead of us but eventually it does get a little bit warmer and of course Wednesday itself is Halloween and so I Would it would just be silly if we didn't play some kind of spooky Halloween theme songs on Sundays unplug so most of the is going to be\nA mostly acoustic will say including this one from the December is\nIt's called the shank hill butchers here on Sundays unplugged shake he'll butchers with the December is\n\nThe shy to vote to drive and a\nYou know there's a you win those costs and\nThe sharpening cleavages on\nA very good in law though was\nMy\nName's your mind is why\nA week and when will blow your\nYour ... your\n\nAnd the Bernie\nShow the shame too strong a G\n...\nYears and we just like me and yeah\nThey should be sweet little\nBall\nBut some say\nA day and she\nKnow killing is that all night so it's a joke is that the ...\nChange your mind you\nKnow when\nFrom your\nMind\nAs a share\nShame\n\nChoose a\nPie\nThat waiting until they die and I'm\nA big gang that thing\nAnd that is that they're going\nMy job my\nOh man\nFrom you know I\nWas a\nShe [noise] was shy\nThe shade so important to try to\nThat's the shank he'll butchers from the December is a true story someone at least and we're going to continue\nEven though this one's not necessarily a ... not necessarily a Halloween song I still like to play it it is real big fish with the new version of use some of these lyrics in here uh probably\nNot a happy ... of ones but this is what they call off of their ... album so live acoustic and for the most part it doesn't necessarily found like a that kind of\nPared down version you might normally hear in an acoustic song because they're so filled with things like Trump beds and trombone and stuff like that it's real big fish with the Scott who stick version of the new version of you if you're on Sundays unplugged [noise]\nI\nAm a\nMom\n\nTo draw one of ... around for a job\nVoter drove through all\nVery last job better\nThe new new movers in ... ... you don't do that or do they\n\nHere's John or whatever and all of those polled the school\nNot use die you're doing all that transfer on there and do\nPeople get a new job from they're out there that you all getting bad\nThat got ate rat a\nFound that the new the new new budget and you know there's a new ... new new version of the new the new new budget and they do\nDo that to you know\n[noise]\nNew\nKnow no no\nYou guys want Iran outlawed or are you guys know Deborah oh\nSee and\nLive life but let's say the president the states and again\nDown and no benefit you know like but O'Neill still down them brown announced from any thoughts and image on a data when no better\nWay of thinking that that would be no\nWish the drinking and then it\nJust on the Internet\nRight so what am I doing was\nFeel like I\nThen you know where we're going this was going on and go back to where we didn't know ones that would be given a roadmap Cee Lo downturn you graduate in work you know I'm In Utah raised when you finish up your first year in the ... doing the right to keep moving now tell me what you're doing and they cause sometimes we're uh sometimes with\nSnow so\nI Try to ... no one wants to know out of hand the huge oh so you don't want to know where\nI just well\nSome a little green boat London\nYou when your show now\nWhat's the goal 'cause being both two names I made a train wrecks do we need to see a beef both\nThose tests that\nWe thought this was though it's back\nAre the good people who\nI've been changing channels that are seeing him on the TV show\nAll the good people who\nThe guy he spent ... which no\nWe got this sense that with a ... that's been one to watch on\nGive them some truth man who's ... who are using\nA turn on the boat too I mean in the mood to base to lead me as strange\nWhere people go\nI've been changing channels I don't see them on the TV show\nThe good people go\nThe guy he said the work which\nYou really you when you're up\nA friendly conversation\nSo tell me how great it was all going to be\nKnow there's some is stationed\nPhone so you start upon me by\nBy the edge of your all these\nLittle again in the show the\nDaughter really wanna knows where it all the good people go\nWhere all the good people go\nWhere people go\nWhere people\nGetting the kids now kick from the mid ... pi\nThey tell you to do the same the guy\nGun and Diana\nThen then the kids know\nVery clumsy and\nIt when the shaky to that and are being in\nFear you better be a\nAnd then she moved to New York [noise]\nTwo kids don't they don't make\nI'm thirty eight years old and I work in a graphic design company which is funny\nBecause I couldn't even realistic figure when I was a kid\nBut I met someone who told me you know what you can do anything if you really want to\nAnd if the teenage me where he or she tells you that wouldn't be into drawing in our if it wasn't for big brothers big sisters [noise]\nMost kids from my neighborhood don't get into art they got into trouble but I was lucky 'cause my big sister showed me early on that I didn't have to be like most people\nAnd to the young Lou from North Carolina [noise]\nMy big\nIssue and I assume visas that the real food a lot of the nation job as a graphic designer [noise]\nWhether you donate money or time you're helping big brothers big sisters hope a child and back to last a lifetime [noise]\nStart something to do big brothers big sisters\nDot org brought to you by big brothers big sisters them yet gone [noise]\n\nDiverse in commercial free drove listening to Ninety point one of them W O U P in Indiana, Pennsylvania\nTo the the two of my [noise]\nOn the Senate and\nGod's the men [noise]\nShould stay or should a boom [noise]\n... cheese G. G. [noise]\nYeah it has been going on line\nShould I say or should I go\nShould I say I'm sure that grow\nThis bug in me\nYou don't want me ...\nDon't you know we're close to me\nThen been no\n\nShould they should uh go [noise]\n\nKatie tons do with her version of should I stay or should I go from the clash and the I think all of us especially after the tragedy that happened eleventh ... eleven lives taken in Pittsburgh yesterday at a synagogue\nA I think we're all kind of looking for ways to give back and to support each other and and the time afterwards and and kind of a looking for ways to come together as people again so\nUh I Would like to remind you that they are still in need of blood or actually throughout this entire season this was when they get the least blood\nDuring the entire year so\nUm if you would like to donate to the American Red Cross there's certainly a great opportunity coming up Monday October nineteenth right here at the Indiana eagles\nOn Philadelphia street in Indiana they're holding a blood drive Monday that is tomorrow from one until six PM so plenty of time to get there now ... walk ins are welcome but you're going to help yourself out and them an awful lot just by making in a free appointment\nBy either visiting Red Cross blood dot org or calling their office at seven to for for six five fifty six Seventy eight in the red cross blood drive and uh the greater Allegheny region of the American Red Cross which is where we are\nThey serve a hundred different ... a hundred different counties in Kentucky Maryland Ohio Pennsylvania Virginia West Virginia\nMany many counties that are you know getting the benefits\nPatient needs in more than Ninety different hospitals so you can help just by giving blood it only takes a you know if it's your first time it might take about an hour but it is well worth it Monday tomorrow at the Indiana eagles from one until sex and then they also have one uh tomorrow with well at the whole run fire department and coal run\nA actually that's included in Pennsylvania one thirty until six so either if you're here in Indiana or if you're a little bit more far flung out including or you can donate blood super easy and you can make it even easier by visiting Red Cross blood dot org\nAnd coming up next let's hear from imagined dragons the acoustic version of radioactive here on Sundays\nUnplug bringing you all kinds of acoustic music from one until three\n\n[noise] [noise]\n\nRoutine raised in a\nWrong\nThere's a new way to turn them down a welcome\nA new driven into a lover\nOr all of our\nLine Jim Crow blow\nTo\nDo things to\nBe the rebels\n... to\nMe to say being a you know\nBit beyond the ...\nWay and I'm\nDe doo doo hey welcome\nDo they loo asking you slow\nSlow slow on the red line\nTo do ... ... ... ...\nOr ... or a man that\n\n\n\nThat's from imagined dragons and up next it's no patrol with chasing cars ... version of it now a good news is there is no snow in the forecast\nVery very cute cover Bailey Pokemon is the one who I covered that song originally of course monster mash a novelty song that came out in Nineteen\nSixty two best known song by Bobby Boris tickets and ah they remained in the billboard top one hundred short a it was a it was just a holiday hit and pretty much remains with us ever since then a a coming up\nEven more Halloween music spooky music as well as some regular ones it's here on Sundays and plug W. I. U. P. F. M. Ninety point one in Britain dairy your host for just about another hour with even more mostly acoustic music\nI don't know this is where the music matter she usually does the law UPS sales in the ... year old term short [noise]\nHey and that's a you\nTonight because it is going to be rainy and cold high temperature today a forty eight degrees and then dipping to a lower forty one tonight pretty rainy for the next couple of days in fact most of this week going to rain today tomorrow both of those rain\nAnd Tuesday we get a little bit of a break mostly sunny on Tuesday a high a fifty six and then warmer still on Wednesday and Thursday sixty two for the high both on Wednesday and Thursday but both of those days as well we're looking at even more rain\nOkay let's talk about some happy here things though then that rainy for cats Johnny Cash is on the way with his uh mostly acoustic version of one originally done by\n\nYeah [noise]\n\n\n[noise]\n[noise]\n\nAre\nYou come here for for ...\nThat you come to raise the did\nThat'd be compared to the G\nTo lepers and your is done I\nA ...\n\n\n\nThat song originally done by you chew that is a cover of it done by Johnny Cash it's called one coming up next another slightly Halloween song kind of creepy feel to it you know go pretty little head from allied to recommend [laughter]\n\n\n\nThink Joe\nBut it could kill so that's a good day God and the\nDo it in\nMichigan\nWho wish to make\n\n\nJust bringing was shut down\nNo don't you think that you\nOnly what do you make [noise]\n[noise]\n\n[noise]\n\n\n\n[noise] you may\n\nWhich which do you make\nIt and didn't know\nWhere\nDo\nWe make\nThe\nLives of reckoning with pretty little head it's on Sundays unplugged each and every Sunday afternoon one infiltrate bringing you mostly acoustic music next one a happier one certainly from Jack johnson it's called better together\n\nDa da da\n\nBest bang bang\nOn and\nAnd\nDa da da da\nReadings Clearwater revival with bad moon rising and I love that one it's also kind of a nice\nWill say a holiday song a a kind of Halloween song for us because we're getting into the spooky rest of the week it's also going to be pretty rainy so I'd just be careful out there and pretty much for every single day this week except for Tuesday you can expect some rain\nFor today showers are pretty likely high temperature of forty eight today right now we're sitting at forty three\nAnd the overnight hours hitting a low of forty one and then tomorrow morning it's still a chance of showers although it does start to taper off high temperature tomorrow a forty five and then Tuesday that is our one pretty nice day mostly sunny skies on Tuesday with a high temperature of fifty five and then Wednesday and Thursday both of those getting warmer\nWith a high temperature for both of those days of sixty two Wednesday is Halloween itself and if you're taking the kids out trick or treating\nExpect some rain because showers become more likely as the night goes on and especially until Thursday so a rainy soggy not so nice week ahead of us\nComing up it's post modern jukebox band that tries to take modern songs and and translate them to what they might have sounded like in the past this next one post modern jukebox takes on in saying Bye bye bye\n\n\nBaby but I\nReally bad la la\nGuy\nNo we\nNa na na\nKnow I found out by they\nThat you know that I don't\nBut every time by by not\n... the John de\nNo\n\nNa na na\nNa na na na na\n\nA\nFive time my\nGod oh\n\n[laughter]\n\nOh\n[noise]\n... [noise] I'm\nBig ball ... by\n...\nWhy why\nAlready knew why and why we\nWhen we\nAin't guy we will die\nDa da da da da da\nAnd\n...\nAnd information on the on a job\nOr when they say\nThey are a\n...\nThe law\nAnd when we guy and we will die with\nOne in the bar and then why we buy\nA\nAnd her an email and a\nMan made any side\n\nWho made the\nOh they did to me to\nStay away from a\nDon't think any thing\n\nThey need from\n...\nWhen he gave me no\n\nYeah I'm On June\n... this is talk about plagiarism [noise]\nThey can go\nDa da da da\nThat she had to do this this during the\nPlanting new laws usually vengeance Times'\nShe can stand\nBig the bigger\n\n\nAnd now\nWe're strong\nFrom\nTo my mom\nLawn or even though she's\nBe a\nBody and\n\n\nWell\nKnow how much hotter than than we do need ... and\nThat them and uh and than an hour\nThen how do you do\nYou do you go back and do it\nI've been doing that so many things in the economy\n\nHere I Am an Indian\nNa\nNa na\nNa\n\nThe beach\nAnd as bad\nThen they would like to bed at night\n\nCougar Mellencamp their hurts so good rock and roll is blasting I upon it gets a follow me stand by\n\nGrant knock on the road right now\n\nKnew a role in our\nI could do a roller rink in\nGet out the welding job in the\nBean by\n\nWrong number\n... ... not good for\nThem and I know\n\n\nNow or\nThe ... going on may ...\nNumber one song ... band back in Nineteen Seventy blinded by the light it's rock and roll classic\nSo the two for three by seven W. I. U. P. haunted hits the following in our spotlight this afternoon because the Charlie Daniels being Stevie Wonder eagles Michael Jackson words eve on\nA new voice to coach John Zachary Atlanta rhythm section Jim Stafford red bow Donovan Elton John John ... let's kick it off with jumping gene Simmons not to gene Simmons the kids\nJust love them a new\nPart would have gotten better when\nReal proud of being in may and read\nTo hold is about\nUp in my mind as they\nTo know\nGuy to pick\nUp the land the plane\nSay you be in the morning\nFor me at\nWe have\nBall\nA you know hey going around me\nIn with the with the ...\nThat man\nTalk from well\nYeah I mean read from by\nI mean you\nKnow the year when ...\n\nGot you hang\nThere goes your back it's down it's rock and roll let's start with you that you'd like\nTo hear give me a call Seventy four three by seven WBAI you'd be the best run up and so it's seventies eighties your every Sunday afternoon here definitely in the program we got oh well we last six years\nI think a to Z is probably one of the nicest age fifty five degrees sixty two on Wednesday chance to some showers why do we know also on Thursday high sixty two and charged again a so oh well what are we going to say here it's a it's like the weather anyway uh I guess it's like coming into the\nFall season in winners right around the corner just do do a lot of snow coming up that's all I care about any way like I said how does how lean treats here this afternoon good easier classics and all kinds of great stuffed twenty from that time period Elton John is standing by right up to this\nMy son has asthma\nSecondhand smoke has tried to his asthma so badly he I'm going to put me in that confusing I spend multiple night from fifth can now he's on a whole bunch of medications my Fifteen year if don't be shy about telling people not to smoke around your kids\nHalf of us kids are exposed to second hand smoke if you or someone you know want help call one eight hundred quit now a message from the U.S department of health and Human Services and CDC you're in the groove but rocket rules classics right here on ... one of them [noise]\n\n\n\n[noise] ... ... ... ...\n\nNo John their fuel for rent their\nHalloween plastics and our spotlight this afternoon the program more the standard by Donovan also like to get to the beach and\nThis with your the memories are so scary\nI'm sure you know\n...\n\n\nAnd [noise]\n\n[laughter]\n[noise]\nOh\nLying but ... that's already used to be wagging they're taking on the run it's rock and roll classic hot as Halloween treats and it is in the spotlight just after the ...\nRock and roll down\nThe road and in the early Nineteen fifty he was called rhythm and blues\nBut you couldn't hear those jumping sounds on the ... you had to go to the good the bad and that they're joining each week on the shoulder came before rock and roll on the news in the back\nOf the old I got back Monday Mornings at one point why W I use the belt\n[noise]\n\n\n\n\n\nRed bow their Nineteen Seventy two which queen of New Orleans their wrote more great classic Halloween swell favorites or the fall of ... a bill called the genesis stand about here just to go ... seconds after ... over the line [noise]\nThen three\n\nDie\nTime\nAnd\nTime\n\n[noise]\nTime [noise]\n\nDi\n\n\n[noise]\n[noise]\nRhythm section really done by the classes\nNineteen Seventy nine near spooky not only are playing some of the best Halloween a classic to step in the program or plan rock pop and do it in the seventies\nAnd eighties for you [noise] a\nTo buy it when\nDay every now and then the ...\nMain mainly their main the main thing on\nIn the\n\n\nLive without\nHave certain safety dancer it's rock and roll classic stump officer with something that you'd like to hear gimme calls Seventy four three by seven W ... or the seventies and eighties that seemed to broker\nA deal with twenty great Halloween classics here for you so far the program before calling us from jumping gene Simmons I had the dog will be from John ... if you know for a friend from Elton John Caesar the which Donovan\nAh the which green of New Orleans red boat swap which from Jim Stafford adult\nWith your your spooky simulate a rhythm section now this guy you're John Zachary he was a DJ in Philadelphia back in the fifties yeah disarm Iraq\nNew Yorkers were fine\nBut I just don't buy why and what I learned that the main course one man\n[noise]\n\nFrom\n\nWhite person a vampire named person\nDon't the walking\n\n\nAnd they\nFormation or\n\nThe costs blood is thicker\n\n\n\n\n[laughter]\n\n\n[laughter]\n\nOr being drawn\nThat was back when one but\nI'm the veins mommy named Becky\nMy first round up all\nAbout it much likes what God did\n\nNot know\n\nThe best of Russian Mob and soul rock and roll classic\nAnd much more to the ... I've got a\nOn the\nSaid I Do believe that John\nJohn I'm going to\nDo and you're going to\nWith the O. J. Reynolds\nDon't know what's in your mouth you know the mother is I didn't [noise]\nJohn ... no\nOne of my back\nRochester that candidates like magic woman their rate Halloween classics and our spotlight to step in the program ray classic it's coming back here for the couple of minutes I got some ... bought another Halloween classic ... earth wind and fire with the emotions and this would ever ... actually\nNever got to give me up [noise]\n\n\n\n\nAre her\nMarried her [laughter]\nWe know that you\nBy the time we made no\nWe don't learn\n\n\n\nUp and sold them that were nice pen da da\nDa\nLast\n\n\nWind\nPower right on the attack\n\nWell the biggest selling your outlook of all time they're real or the Michael Jackson with Vincent Price their Halloween classics spotlight this afternoon of programs not rich rough\n\n... back to back there Chris Rock or ride like when it's rock and roll classic budget within the Sunday afternoon air for your [noise] something that you'd like to give gimme called\nSeventy four three five seven W well you'd be the best rock pop and so it's\nOther seventies eighties separate a programmer featuring haunted hits a Halloween your for your next Sunday afternoon or we're going to do with Darrell Harvard joined us we're the biggest selling bands of all I'm six big number one song ten best men in Seventy one hit wonder if\nThat will be next week on the program here back it was more of hot it treats here for you got some eagle standard by\nThe\nBusiness progressive and psychedelic rock rock along with some occasional blues ... countries tune into vital tracks\nI'm Jim inviting you to join me this Saturday at ... pm on your all through the source W. I. U. P. FM Indiana\n\nFar from\nBeing too you\nDoes it mean to me she's you\nKnow and\nLong yeah\nWhen\nKnow no\nAnswer to the moon\n\nJae in Long Island\nIt if you're here to take a dare I'll make a bet with you that you played pretty good middle bought\nSo you're saying but I take your bet you're going to regret but not the best as everybody is\nThe devil gets you so\nThat are starting to show what are your tips the rose bowl and he pulled a bow across the screen but it made a evil he has been a fan of the joint ended it sounded like the [noise]\nWhen the devil finished Johnny said well you're pretty good old son but sit down in that chair right there and let me show you hide\nChicken in red ... picking out\nThe devil ... because he knew that he'd been the end he laid that goes along the ground that John ... the Johnny Depp will just come back it'd be ever try again because I told you what you saw the gun out the best that never be in the late found\nJob what don't the Georgia Dome Charlie Daniels being one of those classic Halloween so through this afternoon in the program substitute for three by seven W well you'd be the best of rock bumping do it or the seventies and eighties ha\nHa ha ha ha\nHa ha ha ha\nAny now well I\nLot and I don't mind my love of shale she don't know keep your hands the all the\n\nBy the la la la but you\nThose families do they do damage to do a lot ... than New York where\nA\nGuy a guy and junior ... na na\nNa na na na na na na na\nNa na na ve our own\nRodeo land in and out of about them and I thought well I'm In my daughter's talking about the ... honey out and we're all\nOn my side and you know a year and then you may may wine bottle and I don't know\nWell and I don't know\nWhy the bill Gaines meal yeah\nNa\nNa na na na na na na na na\nNa na na na na na na na na na na na na na na na na na\n\n\nSatellite shift you asked yourself or maybe just rock and roll classic shades\nOf those stretch of the program this afternoon job out there but you something that you'd like to hear give me a call ... Seventy four three by seven W ... of the seventies and eighties suffering to broker do twenty hunted Halloween classics here for you this afternoon let's recap though after the program adult in the hour you've\nHeard speak he bought land a rhythm section dinner with Stratfor jog Zachary or don't fear the reaper ... black magic woman from Santana wherever of wonder ... thriller from Michael Jackson and which woman from the eagles top of the of the devil went down to Georgia Charlie Daniels brand here's one here\n... Stevie Wonder superstition\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[laughter]\nAs\nYou don't mind that\nAbout it's your life with all\nAnd as a hung up the phone and the ... to me well not just like the ... a boy with just like any\nStory very shaping they're catching the cradle number one song in Nineteen Seventy four there it's rock and roll classic story about two hundred and forty five minutes left the gyms\nGrammar featuring Halloween classics here for you we gained in the NFL take a look at some of these scores good news Heinz Field this afternoon Steelers beat to browse thirty three D Eighteen\nI of course bad news the bangles one thirty seven to thirty four but the ravens they lost the suffering the Panthers thirty six to Twenty one jaguars losing to the eagles they finally got back to four hundred a twenty four to Eighteen or foreign foreign a year jaguars or three and five\nOr the interesting game tonight I think is the saints and the Vikings that's Drew Brees for almost forty years old and a really good quarterback and that that should be a good one tonight that's Ron eight twenty on NBC TV so joined up for that and uh that's rush up here for ... fell this afternoon on the program a rocket both classics\nAnd like I said Halloween classics in our spotlight this afternoon got another one here from served cliff Richard that's up next\nHey guys look and play some video games it's new Dan Neil game\nIs lifting a man drew\nDamage done how long how can\nI just don't understand this crazy digital world AIDS Day\nThat has\nJust played you don't have to be performing mineral thousands of siblings in foster care will take you justice you more information and how you're going to visit a dumb Jewish kids got a public service announcement from the U.S department of health and human so without us to the ...\nThe best of the seventies and eighties it's rock and roll classic\nPerson per day I saw the cat or\nA show came to you ... shows me so much to go go go\nStain ... man\n\n\nMean on you know\nLike most people are not and [noise]\nShe you know strange on\nThe marching band\nMe and my mom\n\n\nAnd it's\nLove that name right [noise]\n\nAnd\n\n\nThe same time you\nKnow reducing our spotlights every new program that's what Richard there would double woman let's see underwater group they are standing by\nAll those seem to London Shon ... and\nThriller beat it [noise]\n[noise]\n\n\nAnd and and they\nGo in\nBad\nI'm going to\n\nDi di da\nDa\n\nIt was either by their market a little logic\nI got another Halloween classic stand a bar after death rate news from the ... the president and the ...\nThe great music you know great music you don't know yet more more since Sunday sampler he's what's that\nI think you can prove that great you know the new nothing really are and the forgotten what the Sunday the blood all live out from a yellow lab and\nIran W. R. U. P. F. ... it's the Sunday simply with mark Morris says\nHe's got\n\n\n[noise]\n\nI freeze\nCage [laughter]\n\n\n\n\n\n\nDig back in the Nineteen eighty four they're a Bill Murray Dan Ackroyd late in the movie ghost busters\nRape Parker junior I got one more Halloween classic I Wonder what you think it\nMight be not standing up here in the by just a couple of minutes right now now they're moody blues\n\n\nOr\nLose the story in your eyes it's rock and roll classic joke about you\nMatthew how present with the end of radio from eleven to one\nThan the all night Kathy for about one AM until about stepping in the morning I'll be back here next Sunday afternoon here live three o'clock in the afternoon with the best rock pop and so it's not the seventies and eighties here for you sat there in the program we featured Halloween classics here for you next Sunday afternoon general hall a jaw notes will be here\nSix big number one song these guys had to go do tend to them and seventies one hit wonder is always some special seventies when he wonders so that'll be next week on the program there this is talk box and one more to stand by ear Bobby Boris Becker stayed about the number one song\nThis is Tom parts and this is rock and roll classic happy Halloween\nHolding these through the mid sixties you know the good stuff\nI'm Jim and binding to join me ... Jones Sunday at six PM\nTwo hours of some of the music ever recorded\nConsiderably right here on your alternative source\nLa la la\n... W. I. U. P. N. than Indian [noise]\nNo just\nAt least in the\nHall all very funny long it will I\nGet\nMy\nJacket on and on a show\nWhere the road and I was too short da da da da da\nDa da da da da da da da da da da da da da da da\nDe ... that any man and a as a guy on the boat that the other big risk by them they\nThis band or a bar Thursday to really dig in downtown on it\nDon Don and buying out and do a lot to be able to get back to Iran to address your grandmother she comes to mind\nThey learned just under like a few inducted into another on the line\nTo join the show\nThe window when they'll go through\nThe day we can do a lot of the other\nSide there was Frankenstein it's not going to know and love dying\nSome nominees but I gather you rather be\nAlso a new law than\nTo\n[noise]\n\n\nThe right to the doctor but Manson whether they\nNo one was there and a half so far on what's called air Frankenstein now as well to\nNo real being\nYo la la la la la land was Robin ...\n[laughter]\n\n[laughter]\nYou\nGet that empty how long the\nBut not at all the Muslims than the new well when did how the NYPD was black and their lives on my mind I'm never at that\nWe all know about ... [noise]\nWe were in the early ...\nFrom W. R. U. P. F. M. south studio welcome to the oldies zone for the next two hours music from the mid fifties right through the mid sixties we let off today's program at the beach boys and a song called shut down and the monster hot\nOh it was done by ... ... that was from back in Nineteen fifty eight and then I think will stay in Nineteen fifty eight the snow was requested earlier this week via email is ... towns in it's called for your love [noise]\nNeeds to be [noise]\nIs in [noise]\nOr you\nNa na no I wouldn't\nA\nOr\nWouldn't be hard for me\nBut we all know\nWhy I\nOr your ...\nI'm\n\n\nI Would do\nMe a\n\n...\nOh I'm\nNew\n\nLadies and gentlemen\nTwo nights you show me the ranking\nDa\nIf you tuned in acting to hear a bagpipe [noise] boy did you pick them wrong shift\nThe old [noise]\nAnd real interest him [noise]\n\nLong time now it's gone the only man or the around\nRemember but it was only one of 'em [noise]\nThe only one night and um [noise]\nTo be\nIn the line and they didn't\nMonitor their brain\nAs well not in the water you know there's no no no no\nWhen they all they want\nTo learn the landlady over\nBecause of\nJoin you get out and learn about\nJobs from Wall Street Journal\nThe winter that's all they wanted to [noise]\nIn the same way as well [noise]\nOldies worthless [noise]\n\n\n... you know I Know I ... I mean you know\nI Am not the only one who's in ...\nIn ... when I when you eat\nYour peas lounge to me\nBut you have um when\nWhen we're talking\n\nOn the day\nJobs can be free\n[noise]\n\nMan [noise]\n[noise]\n\nA year on\n\nMe it\nWas Bobby beat the name of the song we're sharing you Bill Haley and the comments about Thirteen Women and only one man and don't Shannon let off that set with run away\nThis is the only zone on your alternative source W. R. UPS ... Indiana was put on another song was requested this week here are the Robin wow\nGet into that right oh wow\nLove it but one day I was\nTold that they\nThey don't get paid that are\n... ... ... talk I said no no\nAre now we're seeing right you got thirty buck ...\nI Know you go guys but they\n\nThe ... the town a man\nThe ground me by my car and I know ... to\n... ... ... or\nYou\nKnow get into that\nGo into Iran\nHope you do that very\nKnow\n...\n\nBang bang bang bang\nBut then there\nLittle ball will be you\nIt's one of the very few Motown orders that I like a multiple of songs by the name of the lady was Mary Wells the name of the song was your old standby we also heard a song called zombie or some people call it gravy are zombies\nThat was performed by the monotone sand the trauma lows let off that sets with here comes my baby\nToday singer songwriters speak their mind sometimes it's love and peace sometimes it's concerted frustration\nNo matter what it's always relevant it's acoustic it's electric it's modern troop adores Saturday morning nine to eleven right here on your alternative source W. I. U. P. [noise]\n\nThe best in progressive and psychedelic rock and rock's along with some occasional blues ... countries tune in to fight on tracks\nI'm Jim inviting you to join me this Saturday at six PM on your alternative sources W. I. U. P. F. M. Indiana\n[noise]\n[noise]\n[noise] went to the [noise]\nNames you\nTo eat\nJohnny nature\nMovie and to\nI Dream of him and me\nWe're going to be\nConcentrate on Johnny and\nLa ... million\nTend to gather we don't know me and then [noise]\nI there you go to me is\nBe I\nDon't know I mean you\nAnd to gather the\nGum at the same\nNews\n[noise]\n[noise] no no we're not there or you know from the job market you\nWhen you grow up that far along are you on the news\nAnd it may may or may may may or may or may\nBe anybody can be a\nBeing\nDa da\nDa da da\nDa\n\nDa da da\nDa\nDa da da da da\nMaybe ... maybe ...\nYeah yeah those those two songs go perfectly well back tobacco thing the ... with Martian huh man Shelley February saying all about Johnny Angel your other\nWow and so\n\nUh so\nNo way to do\nMan being gone\nLet me tell me\nThe\nCar and go oh\nI beg your\nDog the dog and I love pro and some low ball the\nBlack man smashing\nMan is\nAll about that but they\nSaw her mind so\nVery very\nI Am now why singing\nWas brand new gun oh look\nAt me you\nTo love it when you look\nDay the guy who change do you do do\nDo I know I'm not sure though huh\n\nI just take my they\nSo walk them try to do while the ... what\nWe were on the way I got it\nTake it back the money from a\nMy\nYou going to help somebody screamed\n[laughter]\n[noise]\nBlue de Gaulle\nWarmest year or\n... ...\nIn God's lauded as much but all\n\n\n\n[noise]\n\n\n\nOr neighbors drawn up\nThat wasn't by ... by the\nVeins mommy named the budget by first round\nMuch much but\n[noise]\n[noise] [laughter]\n[laughter]\n... ...\n[noise]\nThink you can pull\nHim in ...\nThe sand on me your\n... ... ... ... I didn't know where you're the guy\nThe guy\nDid you see them being used pad you really love the nodding\nMe nearly ... million dollars\n... ... ... and uh\nI'll be your number one\nBe nodding\nYou will be named Daniel let me down\nAnd you know you guys\nThank God you can make [noise] you know no\n[noise]\nIs so\n\nOr all all\nWe know why\nWe don't want to do so\nWell oh I'm In a way to\nGo to ... you need to do or\nDo we do want\nYou\nOf the la la la la la la la la la la la\nLa la la la uh\nDo you do da da da da da da da\nDa da da da da da da\nDa\nDa da da\nDa da da da da da da da da da da di to be to\nWho was na na na\nNa na na na na na na na na\nNa na na na\nNa [noise]\nSome gambling you I Am the accent sounds studio we believe him\nLooking back to the only zone we just heard the times things so much in love we also had the dams a single what kind of food do you\nThink I Am and dinner with ... part one that was performed by John Zach really who I had a show in Philadelphia\nVery similar to the other children here we had here in Pittsburgh at one time I'm going to a break tradition now and actually play a song from Nineteen Seventy one this is a group decoded self mothers Sunday the name of the song is midnight in the graveyard\n[noise] [noise]\nAnd then\nThey made a\nReal bad\n\nI Am all alone on the\nRight out of here I\nI Do ... do you\nLove the way everything\n... says she learned last fall in line\nAnd the new law Ali\nHamdani John ... dollar job she showed me oh\nCream knowledge of friends who have grown\nThen I guess jail Korea ... oh God\nJust so I like the last ... years and\nMan miners are they going\nTo get to more to the morning I was on and on his own [laughter] and ... and you don't know to me you know big jobs on my\nAnd\nLow\nLow\nNineteen fifty nine now what's called ... it was done by Jimmy heat we also heard about Lori subtitles strange things happen an understatement their course that was done by the elite in crispy in St Peter's let all that stuff with them\nAnd the Kingston Trio will do kind of a spooky song ... ... to\nEvery single one of his medical bills and everything is just all taken\nCare of them do we have a nominal research are standing clinical care and the generosity of public which allows to treat patients regardless of what it's\nAt Saint Jude families never see the bill for treatment travel housing or food\nBecause the only thing a family should worry about\nThink has a view [noise] there is said and [noise]\nYou were in tune in to the oldies though\nThe vitamin and all the way the more you listen to\nThe center you feel [noise]\nI were a power upstream I'd walk home when I looked in your um your\nDon't really [noise]\nIt's a work of power\nBrings [noise] watch brought a lot but there were two years until you cook\nLike you count on your knees so\nWith\n...\n... ...\nIn McDonalds I learned a lot of just like the ghosts of Anne Boleyn watch they did in the lower end loaded was wants to get rich white\nUnjust he made the announcement Bob or has a young man who get her a long long years ago and she comes up at night when Gerald him so he went there and\nOn the news or are you oh the bloody ...\nOn there they are all about the ... um ... do well\nAnd Justin ... hesitant wants to do\nOn ... street has had on their knees or a\n... ... ... ...\n... ...\nI'll uh went there\n... I'm ... I'm In\nThe ... thing that is what all that she\nThen I ... I don't think I'm just going to win the thing that gets read training is that a world that law\nWhere they're at a ... I'm\n... I'm advocating Enrique is spread\nFor all his pals and gals that goes through the head of the joint just cuts the brand\nThat incomes and bill and just with a Jew she holds it up with a wild war room\nAt the end reply so dominant in just soon Mm when and under the\nUm ... uh when they're in talks\nOn a mass of in a new\nOne night she got to King Henry he was in the candy bar said he uh you Jane Seymour embroiled in I'm Katherine ... book how sweet Sam ...\nWith your head on nature are ...\nHer head tucked underneath her arm that was done by the Kingston Trio we also heard about an hour of strength is sung by gene ... Daniels\nDidn't via email this week pretty good one here's Vicki car [noise]\nToo easy when you say it\nLet him stay away [noise]\nNo not\nA\nChange in the\n\n[noise]\nHe began\n\n\n\nWe are the range of alternative so global you you'd be up in India [noise]\nLet's uh most take time out now so that I can put on some promos for some other shows that can be hurt here at W. I. U. P. when I return I Will help them do but seeing all about a nightmare for you\nI write music from the past the president and you [noise] great music you know great music you don't know yet more more since Sunday simpler what's happened\nWhen I think you can prove to a great deal of the old they knew nothing really are and the forgotten what the Sunday sample it's all about for eight o'clock pm Sunday\nIran W. R. U. P. F. ... it's the Sunday simpler with mark Morris [noise]\nGrace [noise]\n\nJoined me every Sunday afternoon for walking roles class when the best sixty Seventy to eighty rock pop and so to me every Sunday afternoon between three and six year old girl W. I. U. P. up in\n[noise]\nMan music from the days when transistor rates\n[noise]\nThat you [noise]\n[noise]\n[noise]\n[noise]\n\nA law\nIt is\nA lot\nOh my God when he learned\nA lot\nTo do with their way\nThey\nA\nA\nBeing the\nMost uh and\nUh uh\nSo\nUh [noise]\n\nUh no no no my uh my name is ...\nNothing you can ...\nTwenty feet tall holier than on the moon [noise]\nMy spaceships and\nHave big girls take it\nOr need later\nMoon Tommy day but\nShorty you take\nMe that\nWell that song is perhaps my favorite your where am I just can't quit playing it over and over my head and of course it does have a little bit of ... to it there's my thought I Would go in late tonight the name of the song was take me to your ladder\nWas done by buddy Clinton we also heard this I Swear that was the sky liners and the village let off that sit on the track noon is nightmare you are listening to the oldies zone on your alternative source W. I. UPS em Indian\nLet's put on a song that everybody plays this year here's Bobby ... [noise]\nLate in life when my all\nUneasy [noise] like my mom's from the last ...\nIt was a graveyard shift man\nDown\nThe calls Sunni laws they drew them as the the good old came from the ... the catcher Joe ... electrodes", "year": "2018", "show_name": "no_show", "city": "Indiana", "day": "28"}