{"month": "10", "state": "PA", "station": "WIUP", "content": "There are there are groups walk or brokeback\nMountain jak from buffalo to ... go wild or all that traffic and people are not going to like one of the idea that\nYeah\nGoes\nNa\nNa na\nNa\n\nBut\n\nThen\nAgain and\nThen later\nShe\n\nWould do with the bone\nIn Europe and I didn't know the point where they you know\nBut they didn't want to\nYou with a bomb at all\nBut\nAnd I'm\n\n\nGlad\n\nThe\n\n\n[noise]\n\nThe drought [noise] yeah yeah for drawing a German shorthair down\nRoad\nJohn [noise]\nAround the data that area but John is on the air\nTravel ban it\nWhen a man\n\nDo\nDo you [noise] [laughter] [laughter] [laughter]\nGosh it should\nBe shown na\nY'all then on the [noise]\nJohn it all around the area around ... no one down\nTrauma that if you\nTo read\n[noise] [laughter] that John shop and make\n\nSure that they should know I'll show you a\n\n... [noise] a child\n[noise]\nLocked\nThe door Ninety point ... W. I. U. P. F. M. India\nSix months from now I'm going to be a still just one thing I Want to change about me right now\nI've tried before but\nThis time I'll do it for me and the baby\nAs a quarter and you've done or or call one eight hundred lung usa for tools in tips from the American lung association we support the quarter in you\nAll right everybody in the car let's go [noise]\nWhat are we going to do first when we get to go for hikes are if you want what about can do it would go canoeing to\nSee what about a bike right no I Would have fish I've never been fishing honey we can do it all how long does it take to get to the forest it's not is it going to be long no so that it takes forever [laughter] it's not that far\nAre we there yet yeah we're here oh no\n\nIt's a short drive from your neighborhood to your nature has discovered\nThe Fort Dodge orange to find a neighborhood park or green space near you also find fun activities to do like boating and biking or camping and hiking plus much more it's All right in your nature has a public service announcement brought to you about ...\n[noise]\nYeah\nThe\nFirst book barns there's a\nThere was going to argue with you but we're more\n\n\n[noise] [noise] [noise] [noise]\nUm I'm\nI'm not sure\nYeah read\nDo that\n\nThan ...\n\nAnd\nTo your mom but\nThan I Do\n\nCatch it Saturday about every week here in Ninety One W. I. UPS them from eight to ten PM your host the holiday will play all sorts of punk rock a rock and roll\nAnything I really want to dump out there on the airwaves pretty much it would be my hard drive and I'd be my editor and if you are listening you will reach the rewards so check me out every week he says the M find me on Facebook at Facebook dot com slash better spot of you argue beach as always listen to Indiana Public radio station started point one W. I. G. S. femininity\nIntroducing the YMCA short you know the life ... ... who who were more than ... we recall\nWhen you take a jump shot at the Y. someone else getting job training practice yoga at the practices or leadership skills [noise] we get\nPeople of all ages incomes and backgrounds a chance to learn grow and thrive so well you might\nThink why he played with the way and also about lifting your tires and unity that show why we're so much more YMCA dot net ...\nThis is Ninety point one W. I. UPS then Indiana's alternative source [noise]\n\nAgain she will not\nCome on\nCan't\nBring the\nAnd the\n\n\n\nRight here from the white grows will go and if you're an apple a along with science vision or starting off that set your on Saturday spot every week it ten PM or hurts the holiday get to be on Facebook at Facebook dot com slash battery spot W. I. U. P.\nLike debating keep updated a major you go to the shows and I are starting about an hour Ellie will be kicking things off she's from hemp field a singer songwriter pianist\nAnd the fireplace be kicking off a after her along with space of apes and er before so really solid show tonight or no cover charge for that one uh age are starting house is at eleven oh eight showed off the street\nAnd a Walker and enjoy the dunes\nSo that's like your mouth or that show are also there's Derek woods band at the brown hotel starting about ten or ten thirty a jam band at a Greensburg there more and more stuff happening downtown Indiana a thanks to different establishment and I ... just sit down with her coming through town and developing so keep it locked on um\n[noise] she can be listening on the traditional airwaves maybe you're in your car or we can be on line at W. I. U. P. F. M. dot O. R. G. and click through to with them in the browser through that site or um you can go to tune in dot com is also an app you can download it on your smartphone at the streaming\nThat we use things going on with you at all the time it's your alternative sources are locals not return on WBFO\nThe Cold War zones to add\nWe show and I decided to laugh and I doubt oh wow so this is a long way back to drag it out there and\nIn but then you are [laughter]\nBad job [laughter] [laughter] oh no no no no the dog ...\nNinety One W. R. UPS them in the\nFish a lot\nLike that um [noise] I look back and dinner re what would be a bad day and we see my mother died in ... all the bomb had been recognized by they do it\nIt's not that that really\nWanting to know you are not strong enough job field on way way down to us by his mom when she was saying in the age of five but\nShe's [noise] she's la la la la\nLa di da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da da da da\nDa da da da da da da de\n...\nShe's a British East Asia\nBush a\nToday [laughter] in\nDa da da da da da da\nDa da da da da da da da da na na na ... have you know [laughter]\nAnd they went\nA plane but I tell\nAnd dad are one\nLot of things that can be done by saying they can't do a lot of money on ads too fast\n[noise] [noise] um [noise]\n[noise] nah\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\nThat was writing letters by that to me before that Jay church alone when she died in to rise up against and the revolution for men to record a ... of the five maybe a blood red white and blue\nAnd broken English you're there on the Saturday ... every week eight ten pm a round the first hour ear and they had a a jar signed health catch up a big local showcase ... rapes fireplace and Eli we\nUh they'll cover charge free to enter free to enjoy a coming up I got some stuff and I'm sure I Would be as they do the wrong you're wrong I Wonder if you want to be a beverage alternative source the end of the public radio\n\nFine [noise]\nNothing kills the bugs like getting pulled over for bus driving because both driving is drunk driving rocky by the national Highway Traffic Safety Administration and the ad council\nMy name is sue Smith I'm thirty eight years old and I work at a graphic design company which is funny because I couldn't even really stick figure when I was a kid but I met someone who told me you know what you can do anything if you really want to and if the teenage me where he or she tell you\nThat wouldn't be into jarring and our if it wasn't for big brothers big sisters\nMost kids from my neighborhood don't get into art they get into trouble but I was lucky 'cause my big sister showed me early on that I didn't have to be like most people and to the young me feminine Caroline [noise]\nMy ...\n... that the real thing a lot of ... out as a graphic design and\nWhether you donate money or time you're helping big brothers big sisters help a child and that can last a lifetime start something today at big brothers big sisters dot org brought to you by big brothers big sisters council\nChildish Gambia here on the salaries\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nBut [noise]\n[noise] [noise]\n\n\n\n[noise]\nTo ... to see ...\nHe saw the\nThat's a\n\nThe\nThe\n\n\nI saw\n... ...\n\n\n\n\n... to me\n\n\nShe\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\nMm\n\n\n[noise]\n\n\n\nCatches Saturday spot every week here in Ninety One W. I. UPS them from eight to ten PM your host the holiday will play all sorts of punk rock a rock and roll\nAnything I really want to dump out there on the airwaves pretty much have been my hard drive and it'll be my head and if you are listening and you'll receive lord so check me out every week says GM find me on Facebook at Facebook dot com slash Saturday spot W. R. U. beach\nAs always listen to Indiana Public radio stations now your point of view I UPS I'm really [noise]\nNo butter\n\n[laughter]\n[laughter]\n\n[laughter]\n\n[noise]\n\nThe\n\nSay anything\nAnd\n...\nIn terms of him and he said you\nWe can make the economy\nIn the United states and he said you\nTo get into ... and\n\nAm today\nAnd he\nAnd ...\nAnd ...\nAnd they can come in and [noise]\n\n\n\nAnd [noise]\nYeah [laughter] [noise] [laughter] the\n\nCame on [noise] [laughter] [noise]\nUm I remember\nThen\nThere's no\nThe the ...\n\n[noise] [noise] [noise]\n\n[noise] ...\n[noise]\nAnd da da da da da\nDa na na na ...\nThey didn't buy been done and I'm Renee ... you know for\nLiving and ... and I'm trying to draw a line on God and I'm not the\nWord I'm looking for a while to try\nOut for a job at a\nNa\nNa\nNa\nNa na\nNa na na na na\nNa\nAnd our band and you knew that a man with a man to be ... by ... being a major issue in this and what does it sound as bad as the other one in ...\nNew new news [laughter] never about an hour none of them or was it was really really really really humid and lead them to Adams as bad as I don't know what I'm going to remain in the ... [laughter] Bob biologists revenue\nSharing nuclear your big new ... learning and do\nWhat you do in the middle of the nation from Bob ... we don't read the ... when the ... but now that they had to lay on the news business if I were going to be\nIn on the Internet as well be that they had it in a ... a little bit more about the man is not in a little bit and then there\nAre already [noise]\nCame out with them and I came out in our house and I don't\nThink either\nSide our eyes and allowing me to advocate for [laughter] [noise] [noise] and I want to have an accent\nOr [laughter]\n[laughter]\nNo da da da\nDa da\nDa da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da\nDa da da\nDa du da da\nDa da da da da na na na na na na na na na na na na na na na na na na da da da da\nDa da da da da da da da da da\nAnd then [laughter] [laughter] and then and there are good and bad [laughter] [laughter]\nNo no the na na na na na na na na na na na na na na na na na da da da da da da da da da da da da da da da da na na na na na na na\nNa na na na na na na na na\nNa\nNa na da da da da da da da da da da da\nDa da da di di di di di di di di di di di di di di di di di di di di di di di di di di\nDi di di di di di di di di di di di di di di di di di di di ...\nBom bom bom bom bom di di\nDi di di di di di di di di di di ... well I got hooked on my blog by that I Am [laughter]\nAnd on and on the fact that um that live on that in Baghdad di di di di da da da da da da da da da da di di di ...\nA a a a lot of a job [laughter]\n[noise] and\nAh ah ah ah [laughter]\n\nAh I'm I'm a I'm a [laughter]\nUh-huh [noise] [noise]\n[noise] from the ...\nNow hold on I'm [laughter] the drought mostly young based on the ground [laughter]\nOne on your daughter the opposite of here John John [laughter] why not [laughter]\n\nAnd it's sad to still be a hit and run [laughter]\n\nI'm not\nSure how\nMuch\nShe saw me to say wait in line we all share the same man a man let's see I'm saying is shadow today ... a news\nIs actually an odd jobs\nUntil the last time\nThe law here when they did and\n\nI'm or\nAh\n...\n[noise]\n[laughter]\n[noise] she just because it's too early to keep what you can do to keep from getting\nShot at [laughter]\nSheesh\nEach each to each each each each each ... each each each\nWeek on a a large body rash\n[noise]\n\n\nNo and you were one W O UPS ...\n[noise]\n\n\n[noise]\n[noise]\n\n\n... [noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\nNew new age\n[noise]\nOr ... or ... or ...\n...\nYou will never mind the\nOr\nOr\nBoth\nI'm a ... year old\n[noise]\n\n\n\nKnow by\nA\nBomb on\nPlayer\n\n\n\n\n\n\n\n\n\nFor or in the in the\n[laughter]\n[noise]\n\n\nThat means to me that well\nThat's true\nIf they could be\nThe\nThe O. J.\n... was the string Josie\n... the\nMan do they do\nFrom the city so\nIn the street\nCan always hang our hat\nAnd a lot of oh\nDo the generals\nBaby drill\n...\n\n\n\n\n\n\n\n\n\n\n\n\n\nI\nBe in a row and I\nThink we should be in a row now\nAnd one\nNo no no no\nWell man I\n\n[noise]\n[laughter]\nNation in the bed\nThem and you may not matter\n\n[noise]\n\n[laughter]\n\nYou did you get down\nHow you did you did get the [laughter]\n[laughter]\nYou have to have [laughter]\n\nHe'd have to have [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\nOr just or [noise] or [noise]\n\n\n\n\n\nAnd\n\nBetween the two which is why they were able to go\nTo work or [noise] or just to protect\nOur beds with them or are they supposed to\nOr or\n[noise] or\n[noise] or\n[noise]\n\n\nOut there with\nAnd we have\n...\nBall they can\nNo one can do to you\nDo you love me\n\nAll day will\nLead\nWill\nHave a\n\nThe best in progressive and psychedelic rock along with some occasional blues ... countries tune into vital Frank\nI'm Jim inviting you to join me this Saturday at six PM on your alternative sources W. I. U. P. F. M. Indiana\n\nDefinitely got to check out that show uh let's\nSee you're listening to the musical box here on Ninety four you won your alternative source here in Indiana county\nW. I. U. P. F. M. just heard afterlife from their most recent CD electro sensitive to call feeling before that short day from her album stronger than pride\nThen using the way back machine we go Nineteen sixty three ruby in the romance fix our day\nAnd we started with the Greek more so great source for six or\n... we are going to show the hour would do\n\n\n[noise]\n\nOr\n...\nM strenuous [noise] books over many many many other news\nAnchors\nWere able to use [noise]\n[noise]\nLike a [noise] goes ...\nYou know a a [noise]\nFamily member [noise]\n[noise]\nNa [noise]\n\n[noise]\nOr ...\nBone or or\nBoth or\nOr [noise]\n\n\n\n\n[noise]\n\nNa na na\n\nBeep beep beep\n\nBe the baby\nBig\nBig\nBig big people\nMake they take\nPeople will\nThe blind leading both\nBuilding\nThat will be willing to be they\nBe can be can be [noise] maybe [noise]\nMaybe [noise]\nDing ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding\n\nOr\nA long long long long\nLong [noise]\n\nOr a wrong wrong wrong\nWrong wrong\n\nShe\nThe two\nTo see\nNext to each each due to the\nCan he can\nCan be you\n\n\n\nHer\nOr\nHer [noise]\n\n[laughter]\n[noise]\n\n\n[noise] [noise]\n\n[noise] [laughter]\n... ... deaths in the media [noise]\n\n[noise] step inside the on my cafe\nWe've been waiting for you [noise]\nKnow click won W O UPS in Indiana [noise]\n\nMm oh yeah that or midnight especially if\nTime and then you know no\nOne knows about it and on\nAnd then she was ...\n\nBut I'm going and then then\nYou're done and the man then you may not man and\nAnd I know me and\nThen it may not\nJohnny ... not on I mean when you\nGet the money will come on board our midnight special folk music ... show to strategize madness and escaped\nI'm rich Warren let's hit the road with German Suzie Malcolm from their recent release Mm\nTo diamond mulling come winter\nWhen the nine ... below them would love to\nBetween nine and ...\nCalled wouldn't come\nMy\nMain new loan and I can\nThat might go put up with more level\n... in this day and the thing that I'm\nA new a night some why didn't you on Monday\nYou Bonnie aligned be made by\nThe ...\nGuy he had to do that to\nMy baby me I\nLa la ... de nearby\nOn my on my life but they have\nOpened you put on ... to ...\nTo ... put it in there by the bring me\nThe ... done done over the next day and I\nChocolate brown said bring\nMachine the bond male out there that they do a lot\nShe ended up by ... by John Gray\n[noise]\n[noise] ...\n... ...\n... and we knew\n\nI'm a ... to\nThe girl is meat\nPull into the Sunni no\nIn the frozen\nOh don't mind\nRun the food is\nThrough the ...\n... ... ...\nYou would do\nAnd when they ask you this story and so\nWere you a pound and protest at all no no\nI did the power of the spirit keep using drugs\nThey you\n... ... ...\nYou know what your job got closer to God who you\nKnow when you see\nWhere the the\nSome buddies ... your car got to draw the shades gotta bowl or something\nBut you know\nWe we\nCan talk back yard you know I Am more than my genes nice lady [noise]\nDon't can sing too loud dance do what they do some\nBuddies you know we're we're we're hearing\nSome buddies your rock the boat if you played you how to swim about\nSome already have you know we're really seeing\nYou but I ran outside is not how we read in da da\nDi di di di\nSome too smart dark cry don't fall apart\nSome you know where we need\nSome money to you aren't enough during the Austin can we got to just get\nBut I hear that the strongest charge\nDie down just a moment of yours or maybe\n\nLittle hard just be be\nBurning you\nHear me\n\nSome buddies they stay the same way and it'll never change you know I\nReally do [noise]\nBut there was no strong in your voice their billions of them are just a non smoker but I\nDon't know the guy that you get to\nSee to allow the\nIraq in\n... New Jersey where we're\nThe\n\n[noise]\n[noise]\nTurn a blind Didi through my fade away\nThey're no good news today\nNow they're by right now the now the bulls were late\nNight guy\nTurning gray [noise]\nSon much else you know we read with no delusion damn me\nCrying where the guy\nDidn't we do the beat bolt in the bread dough the guns to live\nIn America don't die in the way we want to put that in dividing then\nBe given by chance the best one day in\nDay yet and [noise]\n... yeah [noise]\n[noise]\nPlay every one is running faster\nAnd it's not clear yet what\nAre we late and money dumb\nMaster I find myself you know\nWe were no delusion their means\nThe world is crying when\nThe\nYou know morning waiting to get in a kind word waiting to do it\nIn ... there you can paint in the gym or were you able to do anything\nYou\nJust want to say yeah\nAnd [noise]\nOur loan the world can be here\nWith them when they\nThe [noise]\n\n\nHard on the world can be\nGet three\nIn the fight over long then turning in dire that keeps non burning\nRushing river in the bud breathe\nThrough the snow\nIn much\nJust on de ya\n[noise] yeah [noise]\n\n[noise]\n\n\nWill say yeah later in the program that was Laura's soccer\nSay yes the title song ever album from last year before Laura's soccer Cindy ... and gray Larson with Cindy song if you say yes from across the water and we begin with Bob Frankie for his new release say yes it's song from ... until we must heart\nAnd perhaps that partying takes us to a Blue Ridge cabin and we'll go along with John McEwen along with Mark Kirk somebody's ... David Robert guitarist [noise]\nA shady with him and he used\nTo them no never seen anything\nFor her so close to the movies you know from day to for the for the last\nLittle girl now Gen thrown to the la la La Crosse should\nCome\n\nTo terms with the same thing for some\nFor\nSome for\nAbout a post doc some\nPhone cry\nWhen she came\nHome the crows\n\nLump sum\nSome\nOf the ban them as much as you said in the ... ...\n... [laughter]\n[noise]\n[noise]\n\n[noise] [noise] [noise] nah see actually [noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\nUh the\nHighly original interpretation of that Tom actually song my homes across the blue Ridge Mountains performed by bailiff like an Abigail Washburn from their album echo in the valley before ... and wash burn\nThe dome or brothers alternate Robin going back to the blue Ridge Mountains they don't say who wrote that but they wrote a lot of their own material that's still more brothers volume two or four CD set and you can hear where doc watching takes a lot of his influence\nBefore that Doc Watson Blue Ridge\nThat was in New York City and we begin with John McHugh went with Matt ... David Robert guitar\nBlue Ridge mountains hole which he attributes to read certain I'm Glad it's tasty from the album made in Brooklyn the two words hold on I can have many different meanings here's Kerry newcomer with one of the deeper meanings of old I\n\nHad been driving down this ...\n... ...\nGets stuck in these farm fields can speak to me\nThe hungry the nice thing no\nNo no no ...\nNo I think that's\n... to\n\n... ah you're right you're\nRight and they down here in ...\nI see the ...\nI'm a ...\n... ...\nNo no no\nNew\nNa\n...\n\nMm Mm\nI Want to read my\nNo new boys\n... do you um how long have you on your time and you could I Try to\nA home loan\nWe're the ... and you keep it down\nBut the gym too little to do I have two boys\nNo no oh\nMm\nMm\nMm\n\nHello hello Mr ... oh my mom and I'm On another young too\nBusy I wouldn't take your time it's ... it's not alcohol use the next day\nOn the telephone company got something you\nWere ... like me like\nThe only what your mother in law\nYour mother never want you on\nOn all ...\nNow when the old Alex bell dog\nWhat your mother a new home\nDumped her pain as she does\nLinger job\nNone of mine now than on the leading try\nWhat your mother\nWhat your mother on no\nA novel\nNow some adults today tend to live and all the way\nLittle reason the needle lets wind up being laid for get\nYour mother or an home\nDo to make her sorry she ...\n\n\nTo go in the rain don't bother to know when do well in your own little\nYou will not need when you're up in the in the morning they\nClean and neat you know just when the when you get to one way or when you're up in the in the more na\n\n\nGina foresight who's had a long solo career but also one third of the mouth Venus that's from her album copper rooster and other tunes and tails with the more commonly heard version of\nGolden slippers playing with her work pat florrie guitar Fritz ... banjo and Mike Kerwin base\nAnd both for Gina foresight with them a golden slipper as we heard Jim posten friend's golden slippers which he attributes to Jay bland probably the lyricist from Jim Post and friends\nAnd those friends including ... and a and hills\nAnd before Jim Post Stephen Gilman with his one minute nine seconds song big comfy slippers from returned to summer lake and we began with trek fury slipper mood from her album Rembrandt afternoons one of her recent releases\nDon't forget you can find out everything we play on the program with links to the artist and their record labels\nOn our website at midnight special dot org this is national program numbers sixteen it'll be posted the Monday evening after you hear the program at midnight special dot org and on the opening screen there's a link to contact me I'm always thrilled to hear from you all over at midnight special dot org\nWill be taking a trip back to the Nineteen sixties in the second portion of the program and also paying tribute to the mayor of McDougal street average weren't and you're listening to the midnight special\n[noise]\nA little of this a little that\nYou're listening to the whole night cafe on you\nWelcome back aboard the midnight special folk music and farce show too isn't that tire madness and the skate average Warren well in this day and age and these troubled times we all look back with fondness to the Nineteen sixties\nDismaying and he and his regime Mm\nInfringe read and don't ask to go\nAnd Bob Dylan remember those fabulous sixties much is being have cut burning and best of all the music\nWell now apple houses collected defined as those songs that one out of them called golden ... performed by the original artists made the famous you're thrilled to the side of child ... Jana Xi's\nHoliday by the monkeys what are they doing to rein\nIn the ghetto by Elvis Presley silent night similar clocks news by family go and who can never forget this whole time\nYes Barry Maguire is immortal evil destruction and of course my own masters of war offer the incredibly low prices three Ninety five and if you order now you also receive a treasury of acid rock featuring ...\nElectric prove your plane no sign hand people to name but a few\nBlessed as part of this special limited offer you also get the best of the super groups\nWith traffic cream blind faith ginger bakers air force and many\nOther yes this is a collectors dream golden protests plus two fabulous sixties albums all for only three Ninety five if you were to purchase these elections separately that cost hundreds of dollars in many cannot be found anywhere at any price\nIt's amazing backdrop in three Ninety five and check them on your posture name address your apple out by somebody came up in Indiana once again as three Ninety five and ... to ...\n... ... ...\nOne afternoon yeah\nBeatles groomed yeah\nYeah yeah and ... yeah\nMm\nMm as I recall yeah\nYeah yeah you can dress ... yeah\nYeah yeah I was ... yeah yeah yeah\nThe starting to get other than\nJohn was George Bush George was John\nAnd Ringo was played by my cousin to remind the gig yeah\nYeah yeah we're in waves yeah yeah yeah we sang a big yeah yeah yeah\nReally good ride every road you were in some Bob Dylan song\nThat's not the ... you don't even claimed to have gone on their side and you can build\n... you don't see what then is for\nAll were in the history of canned\nIt was like ... and again then saying that they need to know\nThey do a little a little bit\nThey live for the team no\nThey're saying they're big dean\nThings weren't necessarily better in the sixties but true this ain't the sixties no more Valerie and Walter Crockett mainly Walter Crockett Valerie Crockett died in two thousand nine from cancer da ... three\nAnd they were a wonderful duo together that's from their album moon bone before Valerie in Walter Crockett James Gordon the home line song from songs from basic black\nThose are things he wrote for the CBC morning program with Arthur black\nBefore James Gordon David mallet\nWild in the sixties from his album ambition preceded by the Don ones to civically the dawn of the ... Henry yeah yeah yeah from the folk stage concert of march fifteenth two thousand fourteen just won the Don ones were forming before the dawn ones\nNational lampoon with Christopher Guest something he co authored with Michael Donahue those fabulous sixties from greatest hits of the national lampoon\nOn the midnight special here's Tom Paxton remembering his old friend Dave em rock\nHe's been gone for many years no manufacturing\nEleven begins by noon men in June\nThey pose no how someone could\nA lot back into the\nClassroom they ran wrong and hearing and\nNew green green rocky road ahead and da da\nDa da da da da da da\nDa da da da\nDe ... said well we got\nBe strong lazy coat on a bill into\nDown the street and we didn't want\nIn may ... dream of going into\nA lab but what do they man Rob you pay rent in line\nFor me in the program\nToday and then\nThey will die than\nIt is a little bit to get away\nThe mayor of Google I read\nA new one man so Bruce Willis was glad to meet\nAll the view of this world of our little more Joan there's die\nBut I mentioned this friend of mine on his\nIn this big may world giants have open but\nThe gas line back into the\nRoom with the man Robert\nYou bring bring a rocky road with the way way\nAnd it's a little bit to\nLayer of molecular loser into you\nThey have a bus down the road what\nIs the mayor runs Meg\nJob last time that I don't walk but they\n... ... ... ...\n\nThe man who is ... ... ... be\nCheered me in a\nThen it's then we have the freedom\nBooks from Joan\nReal grain bank to be\nOn a he's\n... lodge and\nWith the ... uh\nThat when men but\nI the bombings\nIn just the actually the same\nWe'd love to the road and he showed me\nThere ... has ... and ... been there done\nThat since then learn from the Ben wrong we dress and\nThe lady who brings go during\nThe cold or in the um the ...\nOff and we go that closed down the wrong\nButton never stuff about\nHe stood for and we're\nKindly and job and he has two years old with close to ...\nThe main ... gallon\nOf things that you know the\nDated one\nEat the dam was named to\nOr riding a bicycle\n... well deserved\nWould be is live\nOlder zone then we'd play his big you get to\nKeep the flame but Dana Lane\nRead\nThat the teams in\nOur case the God he wants to train\nPhone number is there no matter how fun\nYou know the last do them wrong\nKnow you know that\nI was in the brain\nTo try\nTry to go\n\n\nI'm In I'm saying\nI mean you know\nRight\nShane\nAnd don't remember the\nTime like nine or\nEven all these years later\nA condo for on muscle to tease\nMy ah\nMm [noise]\nHe said not just my way it doesn't mean anything\nIt's just a locker room and a particular game he let kids between\nMy son just doesn't\nYou'll learn to live with a\nFollow\nOn me too\nMm\nHow do you know that there's still a hole in the study what could come of it any way\nHe did say that is\nFinally the tide is turning we grow bread day by day we\nSaw the fine line to read her book Las\nWith my sister\n\nI Love to get\nSome the love\nThat too many times\nTo saw a good way to speak on the side\nWe\n\nNeed to know\nWe need\n\n\nKnow\nWhen I was\nA cool man ... ...\n\nThat's a good thing that did get in the late ... na na na\n\n\nNa na na na na\n\nNa na na na na I think you know when\nI was learning now your dream dream na\nNa na na\nNa na na\n\nNow it may be that way too\n\nLast ... music was back in the ... you know\nThe name of that one day during the but nah ... ... ... I had only one single game you know\n\nWell\nLet them saying\nNow may I just try\nTake a stand\nTake a stand\n...\n...\n... or\n... and ...\nWe don't know what do you go then and then ... ...\n\n... you got was kept in ...\nMuch time and then and now\n... Simon tell the\nSilk isn't doing really well\nDoubt it time and\n... ... ... they may\nJust your eyes but it keeps you\nIn all of\nBecame your game\nPain that you can\nReal show\nThey had just a babysitting you know\nShe has been that way you have to pay a better man\nThe major uh gr hatch between Ninety two jobs in the lead the flowers seeing\n\nThe April ... December ...\n... time\nMountains calm them block to understand a month of\n... oh\nTo\n\n\nIt for many of them ... son was gone and it's gone for good winters common when our show bong last stand your brain\nIt never gets your palm tree hitting the ashes it privately\nThat power is we're seeing is\nReady for there seems to\nMe she leads the flowers change the nature\nDecree mighty of John\nKasich said the flowers to see the ...\n\nThat's the new ensemble true north west member Christian Granger saw ...\nDahl Eric Lewis enrich kicked in in a song by Fred Alley from an entire CD is a tribute to Fred Alley\nWater fire wind from the album solid ground the songs of Fred Alley vocalist of course Katie dog was the lead vocalist in that including this edition of the midnight special folk music and farce show tunes and satire madness and escape\nWe hope you enjoy the program you'll come back every week for these two hours of unusual radio programming I certainly welcome your questions and comments visit us at midnight special dot org on the opening screen there's little envelope with my name attached\nThat link go straight to my mailbox I'm always happy to hear from you so stopped by midnight special dot org where this play list number sixteen we posted the Monday evening after you hear the program at midnight special dot org\nI'm rich Warren and you're listening to the midnight special coming to you from the W. F. empty radio network\n\nAnd the next Celtic Connections we go back to albums released in twenty six teams to pick up some songs and choose that we haven't played until now\n[noise]\n[noise]\nThis is Brian pills or grow inviting you to join me for we visiting twenty six team next Celtic connection [noise]\n\nFor an elder to ... this is your alternative sources Ninety One event W. I. U. P. Indiana [noise]\n\nWelcome to kill the connection in our music from the Celtic tradition\nI'm Brian\nHe's released in twenty sixteen and pull up some vocal and instrumental tracks that I didn't get to play so far in the monthly new releases programs\nWill start with the French Celtic band dueling with John ... oil joining them on ... and contributing an original composition as the second tune into medley they start with the ... called red hair boy did John's tune wind are up and another slip Dick the wandering spirit [noise]\n\n\n\n\n\n[noise]\n\n\n\nAnd\nBy what had happened\n\nNa\nNa na ...\nDo not all of the things\nDon't have\nA role\nTo play\nA ... you know the\n\n\nHe does\nSome diamond\n... [noise]\n[noise]\nMm Mm Mm [noise] [noise] [noise]\nThat was Rachel ... of the Irish banned the gate to us with an old song from county are ma about the party of two lovers called Dobbins flowery bake the mentally before that was from the band which which is spelled G O P s eat\nBut we did their CD is on the current political speech of our website health a connection radio\nDon't the connection is produced by WSBIU at that [noise] a broadcasting service of southern Illinois university at Carbondale\n\nBrian also grow with music released didn't twenty sixteen here's a well known song MacGyver Snickers ... green shamrock shore get some hereby accordion player Mick McCauley which ... guitar ha\nFrom ... in K ... units\nWhere a\nWe were a ball or by about ... ...\n... after a week and on and find a guy there was more\n... drum shocks gone to New York by the way from\nAnd oh ... or the ... three ... that they are I'm like why ...\nSaturday well certainly a red phone bill joy I'm not too\nFar to nah you're saying\nAbout all the money\nAnd stole\nBy the way we see a a ...\n... we were being sick\nNo ...\nWe were all kind of financing\nNo one to ... ...\nNo not to be here\nWe think ball of the last movie I started ...\nThe ... three body that'd be like where he is very very\nWell I mean college ball who drowned ... to\nBar but it's just a little bit of money and\nGo by what\nAre we allowed any I Know a stone Harvey show ...\nI\nKind of a sudden the by by the Romans\nWe are surrounded by a lot\nOf chance we buy that for me you\n...\nLying to you and like why\nMe to do I'm not very good to grow\nThe bar to versus man\nI'm loving dog or\nWe see a ... a stone Harvey ...\n\n\n\n[noise]\nThe northern Irish band ... with Patti Brian's dream the done more or less is and the maple leaf featuring Conor Lamb and there are no Hagen both playing pipes as well as whistles and the trail before that was the Nordic fiddler block [noise]\nAll the C. D. sources are listed on this week's platelets on our website connections radio dot O. R.\nThis is Celtic Connections I'm Brian ...\n\nDiverse and commercial free you're listening to Ninety point one F. M. W. I. U. P. in Indiana, Pennsylvania\nThis its Celtic Connections I'm Brian kill so cruel the CD that was my choice for album of the year for twenty sixteen was the willow collection by Nova Scotia sisters Cassie and Maggie McDonald oldest elections on that album had some connection with the will of it\n\nTell me ... to ... to to the sun and\nMeet the ... the eating\nThat ... I like Chinese are on hunger\nThrough the and then\nGo dress ... says five to ... to ... the cross me\nFood\n... some Clyde crazy I wear my friends\nCan they showed the yes please the broader stranger\nWho am I ... I think the tree\nPretty clean as friendship\nIs fine even to this guy\nHim to a path to that so\nOther dietary and it's good though when it's really been to the ground and he\nIs the bodies ... and he does beneath the ground\nGreen friendship\nIs finding the sky\n... to see that just so ... I asked him\nTo a this is not\nDo all the time I\n\n\n\n\n\nDun dun lord garden or or\nYou going to have a gun show didn't go well for guns to know who shows up\nMan they call ...\n\n... ... ...\n... ...\n... ... ... ...\n...\n...\n...\nFor a good\n... well maybe she's\nGone gone\nGone gone show no no [noise]\nOh ... ... no\n\n\nThat was the one of a kind Irish ensemble called the global make with your ... boy or a farewell to the point that is from there too many sixteen album big looming to\nAll the titles artists and albums used on this week's program or on the current played with the age of our website Celtic Connections radio dot argue [noise]\nCeltic Connections is produced in the studios of WSBIU FM listener supported service the southern Illinois university at Carbondale [noise]\nThis is Brian ... grow wishing you hold it back [noise]\nAnd see\nWe if we\n\nServing Allegheny Armstrong Blair Cambria Fayette, Indiana Somerset and west\n[noise] [noise]\nHi I'm your Macau gonna welcome to live and the fur peace ranch\nTommy manuals dub certified guitar player by the late ... is unique thing or stop playing ranges from tender backing for balance to show stopping toward a forest producing incredible sounds from his instrument a household name in his native Australia he's played with actors diverse it's Tiny Tim and Stevie Wonder is live performances or exciting an amazing in fact they're truly unbelievable\n[noise]\n[noise] ...\nAnd\nJust thought I'd ease into a tonight [noise] mhm [noise] everyone okay [noise] you know in Sunday night [noise] at the camp [noise]\nMm [noise] [noise] [noise]\nThis is a little ... for people and I got my bass player there Mm\nNo drama can be [noise] [noise] [noise] I got to read them guys well here we go [noise] [noise] [noise] Mm [noise]\nMm [noise] Mm [noise] Mm [noise]\nThat money I'm saving up there [noise]\nTeaching for the last two days and then you got to recognize this kid is a great all\nThe\n[noise] [noise]\n[noise] Mm\nMm [noise] [noise]\n\n[noise]\nOh the ... and and but\n\n\n\n\nMm\n\n\nAnd um\nAnd [noise]\nAnd\nIt's a strong Iran dedicated to the graduate Africans looked down upon us tonight and says [noise]\n\nAnd\nThis is called the man with the greens bomb and you know one person that has a green from every every scene that person plant grows and she was like that everybody who came in contact with him was affected in a good in a positive way and as I travel around the world and [noise]\nI mean many young trees that have been planted by him and so here it is a man with a green thumb and there's a little bit of the individual is that perhaps some of my students might sing along with and we we may want you to join in you\nThat's how it goes like that\nWill do one more time [noise]\nEach time that comes in with the whole thing is do you want to leave had a good and makes you feel and okay here\n\nMm\n\nAnd made them\nDo not think about\nDa da da\n[noise]\n\n\nThis is live from your my calculations fur peace ranch this concert featuring Tommy Emanuel recorded April tenth two thousand fine\n\nThis is Ninety point one W. I. UPS Bend Indiana alternative source\n\nThis is your mind you're listening to live and the fur peace ranch\nSome people go to school just to learn how to teach\nWould you believe it\nAnd some people go to school just to learn how to preach but honey\nYou can't preach\nWithout going to school and he knew enough in educated to\nThat so [noise]\nYeah I saw [noise]\nYou'd better change your labor for the good lord says that's\nA that's a ...\nI knew a man he was my son\nKeeps trying to save and halt all his money away but we're not all around a taker put you down\nWay going to spend those dollars on the ground and that will\nListen to me children yeah yeah yeah yeah that's all\nYou better change your way of living in for the good jobs\nYou know men come from monkeys some people say but the good book doesn't see it that way doesn't\nYou go round believing that monkey tails\nYeah so\nYou better change your way or the ... so what are your gut for us to not be a driver what's left in\nMm\nMm\nMhm\nMhm Mm\n[noise]\nMm Mm\n[noise]\n\n[noise]\nMy little songs done my little song shoes\nI didn't necessarily manger point this song a June ... if you don't like the way the little song goes [noise]\nYou're pretty sure John and I don't get on your chosen that's a little\nBit\nYour drains railway man for the good lord\nI I'm not\nGoing to be\n\nMm\n\n[noise] thank you very much\nWritten by Billy Joel ... and so it goes\nKnow my good friend Joel more informed me that uh there was some folks in the in the house tonight who wanted to hear what Scott Joplin song\nScott Joplin was one of my favorite composers I never did learn a lot of his material I'm drawn to busy trying to learn my own material ... material but I Love Scott Scott Joplin work so much\nAnd that's the piece that I Do know how to play for you it's called the editor ...\nOr do you just go downhill from there\n\n[noise]\nMm Mm\nMm Mm Mm\n\nMm Mm Mm\nMm\nMm Mm\n\n\n\nVicious live from your my calculations fur peace ranch this concert featuring Tommy Emanuel recorded April tenth two thousand five\n\n... or whatever\n\nYou're listening to W. I. UPENN Ninety ... one in Indiana but they're usually [noise]\n\n\nThis is your mind you're listening to live and the fur peace ranch\nTommy man [noise] I guess I'm not [noise]\nThank you well I think it's time for a little ...\nI started playing the guitar oh [noise]\nStarted I started playing the guitar\nBack in Nineteen fifty nine my mom and dad they gave me a little cheap childhood prior to that\n[noise] ah my mother was the one who had musical talent and my father was one of those guys but if you watch broke down and you can fix it and everybody brought their loan and I was around for my dad to fix and broken down ... he was mechanical he could fix anything mechanic when work it out and even German stuff\nHe always said that uh the Volkswagen was Hitler's revenge for the way they were designed but anyway wouldn't go into that now good novel and um [noise]\nAs it so happens I drive a German car now any who\nUh yes so\nWhile I was still in my mother's whim she used to do the housework and she'd have or things like that Hank Williams when Jimmy Rogers\nAnd people like that playing while she's due due in the housework and dancing around and that and then every Saturday afternoon that it was a couple of local bands used to come down and do their rehearsals they're practicing ...\nAnd then oh it's a good time I get that it's probably my agent wondering where the hell am [noise]\nI was supposed to be an ... year old and I but I can that\nAnyway [noise] I was just [laughter]\nI think you're ... you're probably a doctor are you\nAll are testing a mother shipped away yeah that's all right it's just a text from your girlfriend is that your wife ... sorry\nThe boys looking for trouble All right [noise]\nWell my ...\nI was born and they're there and then they put my Bram beside the record player\nAnd stacked on all the records and I went to sleep when the records finished our how my lungs out my mother came into the regular driver and I went back to sleep\nAnd then when I got old enough to walk around\nIn diapers my mother had the same routine she put the washing and she put the laundry and at the same time every morning at my my father got to work my older brothers and sisters who go to school and I'd be in the next to the record player dancing around and then I wait for that sound can come and\nIt was her changing the gears on the old washing machine in the old days washing machines had to get books on the side and you engaged the engine to turn this around to see and I went to England when I heard that sound I knew it was dancing time [noise]\nI tried running down the hallway into the laundry and my mother it'd be getting out of the way 'cause I come up to the the washing machine in a way to go through and I began\nCan can can can can can feel to feel ... and then before going to be ...\nShe said I used to fall asleep against the washing machine\nAs I don't know what those of us um [noise]\nSo that was my first regulations with music the washing machine and the record player [laughter] and then uh\nI I uh I heard a Seventy eight record by a guy named after Smith\nAnd a song was called ... and that's a song that got started my mother bought me a little guitar had cowboys painted on it with a sitting around the campfire where the killings smoke curling up like this very groovy and or the strings were only about an inch from the fret board [noise]\nAnyway what I like to play for you it's a little bit of guitar boogie and this is a job opportunity and if you'd like to sing along leaves don't you ruin the whole thing is that a\n\nDing ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding\nDing ding ding ding ding ding ding ding ding getting getting a little\nBit but [laughter] [noise] [laughter]\n[noise]\nLive from the fur peace ranch or the coal production of the fur peace ranch in the Ohio University telecommunications center the concert producer is Ben Affleck helping in the radio series producer is run these [noise]\nAudio engineers run these men [noise] Jeff Lincoln [noise] Danny shorts [noise]\n[noise]\n[noise] [noise] [noise]\n\nYou're listening to the ... on your alternative shorts Ninety One of them don't argue India [noise]\n\n\nSo now magazine was founded over sixty years ago by a group of folks\nThousands of people turned to sing out to read about it and learn from the artist to point amusing this is this thing out magazine [noise]\n\n\n\nThis is the single\nAnd we heard frog I'm a little iPad written by bill Monroe from their self titled CD on ... records the environmental movement essentially began with the publication of Silent Spring by Rachel Carson in Nineteen sixty two\nIt was a worldwide best seller and it began to raise awareness of the impending climate crisis curiously I'm\nRecording this program on friday the thirteenth of April the anniversary of the publication of Silent Spring in Nineteen sixty nine Earth Day founder senator Gaylord Nelson witnessed the massive oil spill in Santa Barbara California\nInspired by the anti war movement of the Nineteen sixties he felt that the increased awareness of air and water pollution could force the subject upon the national\nAgenda Earth Day Nineteen Seventy was created were rare agreement between both political parties and the many strata of American society is moving quickly led to the creation of the environmental protection agency later in the year\nThe movement went global in Nineteen Ninety mobilizing two hundred million people worldwide campaign hit a snagging twenty ten with climate change deniers well funded oil lobbyists and reticent politicians\nThis continues in an even stronger form of twenty Eighteen\nThis week on this thing out radio magazine we'll hear songs about the natural world and we're open with the ants have a birthday sailing down my golden river by Pete Seeger from the recording the rainbow race on Columbia Records songs for Earth Day this week on the sink out radio magazine [noise]\n\n... my son in law are all ... [noise]\n[noise] uh all her life is good birds I her that well there are wrong\nAnd I was a ...\n... ...\n\n... ... like the last thing on the water lifespan or a ... my old ...\n... yeah and I was\n... ... ...\nLife to raise my sons and\nDaughters go the particles in level\nAnd then I Would not be a ...\nFor ... ... ...\n... ... na na na\nNa laying down my\nWinding up by the way\nTo lose from there and ...\nYeah and I was a\nReal long term\n\nWe're celebrating Earth Day this week I'm missing out radio magazine and that was out pet away from his recording mountain guitar a musical portrait of the Appalachian Mountains for solo acoustic guitar and that was a tune called stifles creek\nWhich actually I was named for the man who made his guitar Larry stifle some fair would records from al pettaway\nAnd before that from Leah Larson we heard a tune that was originally recorded by a Larry Sparks to call the little ways down the road from\n... recording long journey and that's on her own record label\nAnd before that we heard a couple of tunes from music on the mountain from William culture and Barry Philips a collection of instrumental arrangements of shaker music we heard like pretty birds and come life shake her life that's on board records\nAnd we let off ... with the anthem of Earth Day sailing down this golden river Pete Seeger and his recording rainbow race on Columbia Records\nWe are celebrating Earth Day this week on this thing out radio magazine could open the next set with John McCutcheon for recording done to rise again and water from another time it's Earth Day or the sink out radio magazine\n\nYou\nKnow moan a on a ... a\n... to run into the high court sunburn was an a scab companies from ... at the white ...\nJust another summer's day at ... bar with grandma bucket hanging off\nThe audio bumps rusty but it works fine rhyme with water\nAnd other times you don't take much but you gotta have\nYou'll always held new ways I'm just a little extra bowl the next\nIn line\nGoing a little water\nTattered going down the goose down stitched tells a story or grandma and her mom is not gum ground bomb times and the dress you all were\nNow wrap that night in those patchwork scenes I along with grandma in my in\nMy ... my life and you want to do with water\nThey don't take much but you gotta have\nYou'll always held the new ways to\nLeave a little extra program next\nIn line\nThe ...\n[noise]\nNewborn cry or in the past and future in this wellspring of my sons and daughters the boat in blood living on\nThere are stories pledge wise so land mines like water from a ...\nYour only having been a little ray is going\nNeed a little electrical their necks and\nThey're going to need a little water from\nNa\nGrowing wider Ronen\n\nRunning around\n\nIn the middle of the night as indeed each time that we lay on the shore of lake we heard the voice of the loon\nLoud and distinct from far over the lake\nIs a very wild sound quite in keeping with the place in the circumstance of the traveler\nAnd very unlike the voice of a bird\nI could lie awake for hours listening to what it is so thrilling when camping in such a wilderness is this your prepared to hear sounds from some of its inhabitants which would give voice to it's wild and there's\nSome idea bears wolves are Panthers runs in your head naturally I mean this noticed first heard very far off at midnight as you live with your ear to the ground\nThe forest being perfectly still about you\nYou take it for granted\nThat it is the voice of a wolf or some other wild beast for only the last part is heard when at a distance it with the un failing and characteristics sound of those lakes we were not so lucky yesteryear\nWilliams how though that isn't the case there in age [noise]\nHalloween of a man on a very high key having thrown his voice into his head\nI ever to sound exactly like it when breathing heavily through my own nostrils half awake at ten at night\nSuggesting my affinity for those living\nAs if it's language were but a dialect of my own after all [noise]\nFormerly when lying awake at midnight in those words I have listened to hear some words or syllables of their language but a chance that I listen to thing until I heard the cry [noise]\nI have heard occasionally on the ponds with my native town but they're it's wild and this is not enhanced\nBy the surroundings scenery [noise]\nI was awakened at midnight by some heavy low flying bird\nProbably a boon flapping by close over my head along the shore\nSo turning the other side to by half clap body to the fire I sought slumber again\n\n\n\nThat I Know that the guy\nGot nice\nGod Bless the crash it's Jim Lovell\nDi di di\n\nOh God the ground\n[noise]\n\nNa na\nNa ...\nA man a boy back to\nThe the ... in ... he was\nA\nLong way up in a bar in the new law walk\nWith me I see a man\nTo ... G\nWhen one day we went down our way to the bar either the no\n... I'm In a\nThere is\n... a day\nWe're not big guy and he's all songs will be a hero\nWalk with me I mean the the um man\nTo reread the you\nWere in one day we one way to buy their\nKnees you\nKnow ... I Know one day my\n... my home\nCounty and climb up to that feel so\nBad\nAnd I know and I go oh\nI Know and not by not\nOnly I Know that I went on the news there oh\nWith me and we said no man ... we do\nWhen one day we went the way up to\nThe bars the\nOh dear ... my ... I mean\nI hear your man\nDid ah been saying you\nKnow ... or\nYou know have you\nMade a\nWell with me and say man we\nWere in one day we read in a way\nTo live here for a walk\nWith me and we will miss jury we use when\nOne day we read in a way to\nThe uh the\nThe\n[noise]\n... to\n... to\n... to\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[laughter] 'cause usually you need to be\nIn the in the day\nI ...\nHave my brain around the corner and in\nA ... between\nOf oh because\nI had a bell\nIn the ...\nDrink a day I drink a lot more than ...\nAnd reading a girl with me my brother the\nOh\nI think I\nThink overall are they gonna\nDie it's about the level between um liberal does nothing but the\nCalls oh\nI got a bill\nOh well that's\nIt's a habit rather\n\nPaying their open up your door knocking fell off\nA girl high high rule huh\nThe only one what are you are you yeah\n\n[noise] [noise]\n\nThis\nYou know the little water paying too much [noise] cheaper to do a little more than ... ... ... ... and the\nMan they've done that they do they do it on a road or they're being able to build a new law our ten minutes or did you go to Laura ...\nWho will do do you do in\nThe shade slim I ain't no TV show or talk with\nThe\n... the main ... piece in the\nCountry and to the to\nThe ...\nStole the low on the other way around and move to mention that can be [noise]\nMay have\nPermanent\nThing\n[noise] what used to be voted no the reason is but it's something\nThe rain will they did say she is just so bad you gauge and they do say\nTeam during the ... you know animal bones or she'll accused mayors dream is to have a job as between when you go from the border and then they\nDo all these are voting for later on\nThey ... and Joe ...\nDo over and over the to\nWill in the\n... on the grill or what they learn to live in [noise]\nGames\nDo you do a report on the right thing\n\nKnow like it's going to a black man\nGod Knows what else can we say\nCome back so the company\nTry and she\nDo\n\nOh\n\nPart I remember my mother and father will tell me\nI Do do\nNo John [noise] um\n\n... ...\nTo ...\n\n[noise]\nIt's just me multi\n\nTown [noise]\n\n\n\nMy\nMother just waiting\nRich you know I'm a middle\nAged ... to ... ...\nCome na\nOh\nNo man right yea yea\nSaying you\nRich you know a\n... oh\nAll come\nRight\nAnd\nNo no no\nOh\nWhoa you got to\nThen you look around and say\n\n\nWearing your\nSpine and\nJim ... to ...\nWell nobody but John [laughter]\n\n\n\n\nDa da da\n\n\nWhat would I Do without\nGets the best or me and I'm trying to hide but I'm a loss to see\nWhat would I Do without you\nThe difference between what I've said and done\nYou're still spending by my size\nAbuse jeez so well read in mind\nI Would never make it if I was on my own\nOh you got them on and I\nYou got your sunshine and I've got a rain clouds you got home when I got my down so Bush would I Do without [noise]\nOoh what would I Do about ... [noise]\nOoh what would I Do\nWasn't a great having drew\n\nFrom Washington County Kentucky this week would songs kids the Kelley family bam\nFourteen time Grammy winner was an honor to have him here damn ... thank\nYou so much [noise]\nSeem is never ending we see it almost every single week on wood songs it's the it's it's that passion transcend everything love is the greatest transaction of the arts drew Holcomb has it he writes these songs not for a short he writes for his art there is a big big difference you know the world of music has changed so much\nLook what dancer Minsk he's doing he has taken such a brilliant artistic risk with going out with an album that is just full of heart and passion and\nAnd all the kinds of integrity that he as an artist has deep inside of his heart and he leaves at all or they're on on on the table so to speak with you\nYou said art is a form of faith\nIt's the artist duty to disregard public opinion because there's nothing more truly artistic\nThen to love others\nWhy it's difficult to be simple you know who said that\nVincent van Gogh an artist that never sold a single painting in his lifetime\nAnd yet he is now considered one of the most brilliant artist in history you know why because he loved\nWhat he was doing its that love that transcends\nIn an artist world and it's the only thing that reaches the audience we thank our audience my name is Michael Jonathan I'm a folk singer I Am a song farmer we'll see you next week\nKeeping\nNineteen Michael's happening some west coast from the breaking without ...\nAre cheap engineers Jerome going Senegal's systems are Brian pausing brand needs mark Thompson America Anderson or TV and Internet broadcast by Maria urging assisted by\nOur technical director is history math\nWhich on per member of the week is he Franken and our with our partners of the week our Mike instantly downing\nSpecials were bored provided by Hubbard spring water and they call the the step of the leader of the ... deli in Lexington\nOur shirts produce me the word is is it like dot com Kentucky tourism trauma his magazine they got bank up to me the bluegrass hospitality association and the embassy suite by Hilton like painting green but we'd been searched from all over the world he Lexington, Kentucky\nWhich zones songs similar Richard ... music art shows distributed world one rather with stones radio network NPR rex thanks for listening I'm Joe Congress\nFor Michael Johnson\nThank you very much for listening to this broadcast of the wood songs old time radio hour it's really nice for all of us who bring you the show to celebrate them many colors of folk grassroots music\nIf you'd like to write to me about how you feel about it I'd love to hear from you my email address is Michael at would songs dot com\n\n[noise] [noise] good morning could only\nDo more harm than\nGood morning\nOr good morning\nYou are listening to your alternative source Ninety point one W. I. UPS bend in Indiana I Believe in yeah [noise]\nIt's time for the bluegrass ramble on W. I. UP\nThin mom man a\nAnd then and then a board\nWrong well thank you for\n...\nYard yeah um but\nUh [noise] a pack and on the\n...\n\nBom\nHappy\nBut they do alone I Know I Know I knew\nMy ... on the\nBallot or\nGlad woman she's young\nAnd she um\n\nMy baby let me see then\nGive a man those doggone worry\nAnd after you go oh\nI Love that woman much changed\nNow I'm a very nice um\n\nCome on\nStaying\nIn her own way oh God in it any good Razorback nasty\nKnowledge of gum\nBin Laden\nLa la la la la\n\n\nGum\nChange um she sounded gum\n\nMe oh man you know everything there is no thing at all day long\nChi gung\nHo\n\nBlue cheese and go oh\nIt all I'm a very\nUm I\nData and to be known by [noise]\nYou know\nYou are locked onto your alternatives\nSince you left in a way\nRead all of them go mark ... that day\nThey may not have a better job of the day and\nThen you know the news\nIn a new mom\nAnd again on the new\nThat he didn't go\nAn old brain training that\n\nNo way that I began to thing she did the little one goal\nThe games that are in a\nIt was pretty well right now my mom\nDo that where mobile\n\n\n\nCan't stay there\nAnd build an awful lot\nYou just made it sound\nLike well\nThe bad\nWhile you're just a bad thing to me the\nA leak in the window the knees around the down to\nIn Florida now has\nTo jam\nThem with those models\nSmith and liberty money from an album ... cold that's what love\nTrains CD [noise] and as mentioned live bluegrass music with the Allegheny drifters tomorrow night at North Country were brewing he tried to say [laughter] North Country brewing up in slippery rock Pennsylvania\nYou heard from them big stone gap from their album out of the woods or music coming up and just a moment right here on your alternative source [noise]\nW. I. U. P. F. M. presents White House chronicle with Whelan king and Linda Gasper willow Monday Mornings offering a discussion of current events and issues in the nation's capital and beyond from the political to the personal it's news and commentary with an intelligent viewpoint\nAnd delivered with a sense of humor each week you'll learn something new or think about issues in the new way to join a little while and king and Linda ... for White House chronicle Mondays at seven AM on Ninety point one W. I. U. P. F. M. your alternative sources\nFrom their album\nThis is the Johnson mountain boys on Ninety bought one at W. I. UP [noise]\nI don't know\nPhoto with the man the world\n\nNow I double dog dare you\nShow me just a way to visit I saw\nAll the while the fast food and the women are known to have a lot of the number seven\nI'm harbor\nOr the one\nMa is Jane\nQuinn Gabriel ... I'll just come\nRebel straying out\nGod I get the just the man I write\nBut other than it will be glad that I\nFreight train to have a I got a ticket and I'm just the Iran I'm not welcome aboard the train to loan but there will be\nGlad that I Try to live on\nDay to go\nSouthern rail concluding are set the song is about ... was hobo on a freight train from their album on the road to manage the with the missing the warrior river boats from their most recent didn't he ramble songs with Charlie ...\nJohnson mountain boys from blue diamond and only a hobo\nWe started off this edition of the bluegrass ramble\nWith new music from Missy rains are album royal traveling now we're going to conclude with this election from the same album this is called darling pals of mine from royal traveling they to provoke time coming up next right here on your alternative source Ninety point wanted them up to you I you\nKnow [noise]\nHello and\n\nA\nPurple back in ... at the time\n\nGo back there in the last leg and the ... and I'm from Brooklyn New York but I got to let me try\nBoom boom\n[noise]\nWith the book Paul\nNewman\n\nAnd\n\n\nServing Allegheny Armstrong Blair\nBay Indiana Somerset and Westmoreland Kelly\nWe are the regions alternatives [noise]\nW. are you the best India [noise]\nGetting ready to meet your musical heritage it's time for the best in cope music on W. UP so come alone as we explore the rich and branches of music in America on today's edition of hope\nIn the mood then ...\nMommy was hard to find friends\nOn August ... created John Green town in London\nCame to me that there was no nothing\nBay game\nThe time he met mom\nDance plenty of rock and now\nLet's turn now to get in and they come\nAnd they were married\nThey'll be making\nRoad today\nA soft line that I feel they have\nEverything to pitch\nAnother one a botched\nWe all do well with Muslims in the rye around\nOn the breed Americans for all\nThe summer's gone\nCalls are surprised\nI'm going to start here by and by\nReading for with all that much farmers\n\nMm\n...\n...\nPretty didn't pay me to come again they land they miss the man de ... my mind and shared my\nHuh I could see them on the road the on their man\n\n\nOh the pretty birds from Louis Collins or weather page was a little slow to load so I didn't get to that [noise]\nBefore the song but now we got it so I'll let you know to be mostly cloudy day today the pioneer fifty six degrees\nThe early morning hours tomorrow showers we'll be moving in looks like we'll go from a thirty percent probability to sixty percent has the day advances look for a low overnight a fifty degrees and then the high tomorrow of about fifty nine with those showers around\nMonday Night there's a continuing probability of showers especially before eleven PM there will be cloudy overnight and quite chilly low thirty seven degrees will have some sunny skies on Tuesday with a high near fifty one\nBack down to thirty nine Tuesday night up to forty nine on Wednesday under sunny skies\nAnd then down to close the freezing on Wednesday nights thirty four degrees\nThe advance forecasts costs were mostly sunny Thursday with a high near forty eight so you get the idea we're going to remain\nQuite chilly throughout this coming week forty one degrees outside right now under fierce guys here in Indiana getting back to the birds this was always speaks on Ninety point one FM\n\nGary broken way\nHere's something you said there came a\nMom and dad [noise] ooh good they're they're [noise]\nDidn't fall\n\nGoing\nTo go a little bird [noise] don't you try\nJohn ... from\n\nMove\nMorning [noise]\nThe ... billion a boomer\nKing junior and\n\n\nWere the hardest job in a whole new and you\nNo no no\nThe\n\nThen they move\n... ...\n\n... ... ...\nEverybody it's Cathy fink Marcy mark sure and Sam ... thanks marks or at least on some time with Jim Rogers W. I. U. P. S. an in Indiana, Pennsylvania\nMm\nMm\nI Would when he\n\nSan ...\nAnd that's my\nKnife on the bread and ...\n\nMy\n...\n... to ...\n\nHim my trouble\nWith my grief\nMy\nI Know my ... years the loop\n...\n\n\nBut I\nTitled years in the making and here's a short little piece that comes from the the one in that sense [noise]\nWorld ... so give me your hand class but Harding well tool Rosin ball and he used to own\nRising above the law when he used to over ...\n... so give me your hand class but ... says well tool Rosin the ball\n\n\n\n\n\n...\n[noise]\n[noise]\n\nMajor leap from his album Rockville pipe that what's called Ross in on the Gore\nGina foresight from her album copper rooster another tunes and songs dinner nights version of ... and the bow and loud and Wainwright the third introduced that was his rendition\nOf Ross in the boat [noise]\nOr the Grateful Dead no that folk music was often a part of their repertoire during the years probably most likely due to Jerry Garcia is influenced he loved playing acoustic guitar and banjo\nAnd cut some albums with a mandolin that's David Grossman\nWe'll close this edition of fulltime with two Grateful Dead influences up first yeah for mentioned Jerry Garcia and David Grossman with fair Eleanor from their album shady grove and then from the brand new release from several lender Emmy\nCalled ripple have a great Sunday a wonderful we stay warm out there and take care of yourself and please stay tuned for Sunday Morning classics coming up next right here on WB\nTom Miller picture\n[noise]\nBobby rule ball do come to um to hit man oh there's one\nIn ... I mean whether to Larry ... or bring\nUp around ... you\n\n[noise]\nYou choose\nTo do\n\nBut again do you call in to the ball\n\nHe he should stick\n\nYou're listening to Ninety point W ... FM in Indiana\n\n[noise]\n\n\nIn modern French composer ... ... in the new our Sunday Morning class\nOn your host for Sunday Morning class offering a three hour classic traditional and six and nine AM\nTo Cooper ran a work he originally meant to serve as a tribute to more memorial to French Baroque composer Francois coop around and generally to French music of\nThat broke\nPeriod [noise]\nCovering late Seventeen through early Eighteenth centuries what music was revered as the embodiment of clarity grace and refinement sharing those same attributes are these remove ... named\nPrelude menu which and regular don't we hear now part of\nThe motive Cooper in\nIn a performance by the Dallas symphony orchestra\nOr had word of mouth conducting [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n[noise]\n[noise]\n\n\n\n\nWell\n\nOh\n\nMm\n\n\n\nMm Mm\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\nOh okay [laughter]\n[laughter]\n[noise]\n\n\n[noise]\n\n\n\n\n\nMm\n\n\nDon't I don't\nKnow\nWell we don't\nWhat may not be [laughter]\nWell oh God [noise]\n\nCourse tend to chill out giving that performance up their arrangements oh movements from Murray prevails told voted to program from their album troubles\nOf the\nExpress here on Sunday Morning plastics\nThe Indiana\nAnd we stay with that album of ... July into travels the orient express for another arrangement is there's this time of year hundreds problems Renault although gypsy from his piano quintet\n\n[noise] [noise]\n\nI'm from the Bronx I stand\nAccused puree instruments return now to twenty century Benjamin Britain's version\nOf square performed by the industry more constrained [noise]\nPart of Britain [noise]\nIn the [noise]\nAnd then it will be followed by another twenty century rendition of\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nHey triple play of how to square one yet and English folk to know the sixteen hundreds\nAnd we ended the set with um the one composed by Ernest Tomlin so and part of his first tweet of English folk dances composed by him around in\nNineteen fifty and ... are conducted the snowball radio symphony orchestra prior to that we had the English string orchestras performing part of Benjamin Britten sweet on English folk tunes his rendition of hunters for when we began with a more or less\nLegitimate or a sonic straightforward\nPresentation of it by the broadside banned three versions of hunters square\nOr elderly and for long this is your alternative sort Ninety point one F ... W. I. U. P. Indiana [noise]\nAnd this is our Sunday Morning classics bridging the centuries with examples that twenty century compositions that were inspired by music earlier times\nOr give modern arrangements of dance forms of past centuries British composer Benjamin Britten the twentieth century composed\nHis opera glory on a ... for the Nineteen fifty three coronation of Queen Elizabeth a second and we have next to Courtney dances from glory on I'm based on dance forms of the time of queen ...\nAnd the performance of the court the dances on Sunday Morning classics\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\nAlso released made possible in part by Virginia [noise] inventing the futures through our hands on approach to education and research [noise]\nThis is Ninety point one W. I. UPS then Indiana's alternative source\n\n\n\nIn the morning again and welcome to the middle of our Sunday Morning classics [noise]\nMy name's Tom Miller [noise]\nInviting your lunch and\nAs this hours playlist is made up a mainly\nTo works but I just to twentieth century pretty\nIt would be followed La Guardia molten [noise] improvisations on an impromptu [noise]\nUh Benjamin Britten\nWhich is the second actually the third movement started moving impromptu from that piano concerto [noise]\nAn excerpt of the impromptu is being played backstage by\nWith the English chamber orchestra [noise]\n\nIt's music that Britain First used for a Nineteen thirty eight radio drama\nAbout king Arthur [noise]\nBut then revised its in Nineteen forty five to serve as a third movement of his loan piano concerto\nAlso in Nineteen thirty eight\nNineteen thirty eight [noise]\nBut with a different third movements then\nThat'd be noted as a ... and ... that's the original version of the Nineteen thirty eight judo but he discarded it and replaced it with this impromptu\nWe're sampling in the background and will continue with a few more measures followed by a complete performance up Benjamin Britain's piano concerto ... movements with the revised third movements the impromptu\nBy the English chamber orchestra Stuart Bedford conducting\nAnd at the keyboard are so that was going to be Joanna McGregor [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\nMhm [noise]\n\n[laughter]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise] um\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nRight\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n\n\n\n\nAnd beginning the hour with two popular tens of Shakespeare's time\nMichael Pretoria says\nPacking tens town\nWhich he gave the time to is the Koran\nAnd it will be followed by Thomas morally my lord of options for\nBoth performed by\nGoes by the name late with yours\n\n\n\nDun\n\n\n\n\nFrom their album titled fortune ...\nThe early music ensemble named Lee which is just started this third our up Sunday morning classics with packing tens pound a current by Michael Michael Pretoria sin and that was followed by Thomas More at least my lord of options for its mask just completed\nAnd we continue with\nBirds are all of our sports march this Elizabethan era composer William birds version berries are differs very little from the one just\nGiven by Thomas poorly and which is here's the Phillips\n\n... what to\nWill na\n\n\n\n\n[noise]\n\nOh\n\n... Jones breast ensemble performing the earlier books for march by Elizabethan zero composer\nWilliamsburg down and he was preceded by\nMy lord of auction towards mess by Thomas morally and a performance by me which is morally also\nOf the\nSixteenth century a ... year classical music server on W. H. B. O. film I'm your Sunday mornings nine AM until after this reminder in this message will be back with music from the continent to\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\nDo you want to UPS bam eat Indiana, Pennsylvania [noise]\n\n\nSing out magazine was founded over sixty years ago by a group of folks who loved roots music\nToday to bite on an entertaining resource for anyone who loves folk music the world over as in the past\nThousands of people turn to sing out to read about it and learn from the artist to play the music which is which thing ham radio magazine [noise]\n[noise] this is the sitting out radio magazine and I'm your host Tom ... where are the music on this week's edition of the show he's from banjo was known pickle me ms recording plays Kenny Baker plays bill Monroe is re arrangement of the classic bluegrass fiddler allowable we heard big Sandy River\nThis week we'll examine young artist that take musical styles and expand them into something very personal artist to expand the tradition open with the band ... a band whose instrumentation would indicate a bluegrass band but the style is something else entirely we'll hear train down the line from their CD down the mountain\nArtist messing with tradition this week on this thing out radio made dizzy\nShe loved me not to\nTo make it hard to read and\nNew dawn in real life\nWe both know during\nLet's just chose chose to\nLow tail wings off that although\nPost graduate do we know that\nAnd jobs or on the ritual\nNo ... or ...\nOr ...\nMean and really I\nWe both know sharing\nCome down\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\nYeah I mean you know she took\nThe do\nThe\nThe gun\nOf the news so\nHere it's all done by the time\nYou may\nGet to you know\nBut for\nMe [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n... ... ...\n... ... ... ...\n...\n...\n...\nA ...\nNa na\nNa na na na na na na\n\nNa\nNa guy\nBearing down on\n... a\n... or ... or\n...\n... ... your ... [noise] ...\n... ...\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\nBecome ... to\nTo\n...\n\nMe at the\nHe did man\n... na\nThey may be a\nOn you know when they say [noise]\nAh no\nAbout nah\nYet Kelly do\nWe do man\nWell I Know you do you do me at the data and then you\nMay be the pen and there's\nI Am a\nMan named me\nAnd he does he do me yeah do you then\nDid did\nThat's the thing yeah me and na\n\n\nNa na\nNa\nNa\nNa we're\n\nCome in\nUm day is um\n\nNa\nNa\nNa I mean\nA\nFarm in dad did\nOh\n\nWell\nI Know\nYork\nAnd he didn't\nGuy de da\nDa da\nDa da da\nWas a little ...\nKnow not knowing where\nKnow I don't hold on I mean\nNever know is that\nMust now there's no no not at the un\n\nLove\nFor many years Lila and Eli grace traveled with their parents Paul and wind graze all over the country playing music\nThat was ... an alley from their recording where the waters around and we heard a wonderful song called common ground that's on their own record label Lila and Eli grace and before that in this set of young folks kind of following in their parents' footsteps we heard from Vivian lever\nWhose parents are James lever and Carol Elizabeth Jones from her recording time is everything we heard a great song called why don't you introduced me as your darling that's on free dirt records from Vivian lever\nAnd before that Jake armored ... for a while played in his father's bluegrass band northern lights but he went out on his own after a while we heard a song called company town from Jake's recording caged bird and he was a company there by his dad on the guitars dad Taylor armored thing\nThat's on his own record label from Jake arm reading and we went off that set with Emily Miller and Jesse ... and bully of the town from the collection the new young folk he's volume one\nKind of a follow up to those great collections put together in the eighties and early nineties on round or records put together by and Roberts cobalt and Joe to join it young ... the new young folk he's volume one\nWe're going to lead office where I sat with Molly title who was the very first female guitarist to win guitar player of the year at the IBM hey this is from her recording rise on campus record\n\n\nLights in psych well maybe I maybe I\nIt connected them with instructors who were some of the best musicians in the mountains and made it financially possible for them to rent instruments battles banjo and guitar [noise]\nThey jam has been at the that would be almost as big an understatement insane bill Monroe had something to do with bluegrass [noise]\nThere are now dozens of damn programs throughout the mountains of North Carolina South Carolina and Virginia [noise] many receives state in federal court [noise]\nGet you in the first jam classes have grown up to be some of Appalachian music rising stars [noise]\nInveterate jam students take 'em ribbons every summer at the most prestigious music competition\nMost important of all\nThey're growing up to be dedicated advocates for the tradition we are now teaching the next generation of musicians\nYou can learn more about the past present and future now music along the blue ridge music trails of North Carolina by visiting leverage music in the\nDark [noise]\n\n[noise]\nWe W. I. P. danced in Indiana [noise]\n\n\nI Can't ...\nThe war by which are\nShelter so and then ...\nKnow ...\nTo lean back\nThe ... and\nAnd then he had the law\nOur ... ... ...\nSo are you oh I'm a\nBut you know you're the diet donut hole in the garage so that they don't last shah ... by the mile al sham no no\n\n[noise]\nHomey mom in June\nAnd July\nAnd Halloween\n\nAnd\nTo sell me on the street\nAnd went on to try and minus\n\nMe black players can\nAnd have an hour and ...\nAnd you\nSo and you also I'm a I'm\nYou know your dad died Don's or the garage so where the rain last year on\nGo ah we'll call you by name now was a\nAnd [noise] [noise]\n\n[noise] nah\nNah\nYou know and I'm very na\nNa songs\n\n[noise]\n\n\n\n[noise] ...\n\n... ...\n...\n...\n... ship pause Shibley may be a ball and the\n...\nIs the the chance that a ... ...\n\n... ... pounds the your eyes bond that I'm a lawyer to come to new ... ... do you mean the other ...\n\nYou know ... ... like you do to lose a shadowy\nCorners of me oh\nJust about to small close to show\nMovie [noise]\nI think ... may be a father and she\nSaid the chance to bother quite hard for you [noise]\nOr the state of Lake Huron shine a shot and then\nTo\nMake a dog because I've done quite a loaded thing you know\n[noise]\nIf I didn't know who he is rather not know if I could have\nMore about\nThe stone\n[noise]\nMe\nHe he he he\n[noise] I\n\n\nI don't know and have them a lot and didn't know that I don't know [noise]\nTo me ... ...\nThat some ground up and down and do a\nShow or anything like that how you doing really\nThen you can do you do that it had to go back and do this\nI'm Glad you doing that so many things in the time I met ... mind you he ...\nAnd ... then then I\nAdded than I Am well\nNa na\nNa losing\nNamed Anna Anna\nI'm In a manner\nThat\nDespite the\n\nBag that traffic jam I'm going to say\nAnd then\nThey can I have to oh no no\n\nNo no\n\nNo no\nNo\n\nAnd I was on the ... and trying to hang in last normally would offer trying to\nBe another vote and until the industry and yeah\nI Know I Know when a compliment she won't butter made that show that's so sad to say that you know she was ... and then you know she has been on the ... and ... and ... when\nNa\nBecause you're\nThat way\nThe day and she turned to change but I think it shows that ex she's on the ... and ... and\nYou know you know you know what\nManaged to either change it makes much is a certain tone\nGoes in and so\nBy the as you don't even bother asking in a\nThem wages\nThe last show she\nWay you\nBills waiting\nTo\n\nKind of children who\nNow when you smile\nYou\nYou're a young man\nWho\nI'm Tiffany I have some tips for you on how to quit smoking like I did at first I did some reading about it I found a lot of great advice on how to quit smoking it picked out the ways I thought well work best for me\nI started by setting a quit date then I throughout my ashtrays lighters and matches I did other things too like exercising more and it worked but I still get cravings especially on long car rides to help me with that I put a picture of my mother and my car\nShe died of lung cancer from smoking cigarettes when I was only sixteen now I\nHave a sixteen year old daughter that picture of my mother reminds me that I don't want to miss all the things my daughter is going to do in her life including turning Seventeen\nYou can quit for free help call one eight hundred quit now a message from the U.S department of health and Human Services and CDC\nMm [noise] Mm [noise]\n\nYou're listening to W. R. UPENN Ninety point one Indiana\n[noise]\n\nIt's the perfect time ... years\nNo more borrow from each year\nFind that out by getting\nInto bed ring in Britain they demand\nTheir new restaurants down the street\nHe is the perfect guy in a\nGear you where you\nStreet your dream right from the people who may\nSeem to ...\nDo you feel when you manage to John\nDenver to cheat or not she died too\nOn\n...\nMm\nThink he's gone in ...\nOnly make the time when you talk to you know only you know you probably know that are ...\n... ...\nOnly know you've been the how when you've seen in low only eight or ... only know you're going to let her go\n... I don't know what she was ... I don't think that Europe\nYou say you lead my story I guess up once again what do you want to listen or maybe you just walk out the big issues and walk right out of there do you\nThe ... business you're not\nYou to read your fortune I'd rather you just read the news so they the years that headline take your shoes walk right out of the good you please just walk right out of the [noise]\nI don't want to ride my bike on I mean do you put a helmet on my head I'm tired of these mild that'll definitely takes it either way you know we're never that\nLiked the like you did they just remember\nSundays and Buddy Guy's going to come along and you ... always paid her will be done around then you smiling and she can censor the ah she does but I'm not that there\nLot to make me eat dinner and I'd rather eat the piece of toast it's really not that willing to sit across the table it's either way you know it's never that\nKnow to think you're really something I think you're really something else you could see the future by getting to see that we're\nOh great music from the parents the president and you do\nGreat music you know great music you don't know yet more more since Sunday simpler what's happened when I think you can prove to a great deal of the old the new nothing really are and the forgotten what the Sunday sample it's all about from age is eleven and yeah\nKnow where you're on the W. R. U. P. F. ... Sunday simpler with mark Morris [laughter] [noise] [noise] [noise]\nAnd you were locked on two Ninety point one W. R. UPS Bend Indiana Pennsylvania [noise]\n\n[noise] [noise] [noise] [noise] [noise]\nUm you're walking down the\nJust for me I now know\nModeled as lonely blues and\nI was an angry when two men\nThan than you\nWould use an unfair when our time rather than you do an interview James will Django produce\nAnd there will get the same thing\nBut then I looked in your right\nAnd there was no more than\nAnd the other two wacky and why\nThe now they\nThe ban in one and a lot\n\nAnd mother were tragic and say\nI was a top a loser\nI was a pageant gone bad\nTo do was you were\nAnd why give me one day and then the Q is not the new one in jail last little war\nNew data way you live\nI was no good no\nThen there was no longer booze and\nThere\nAnd and uh the\nUh the walking down and\nJust be you know when\nThe ban is not going by the\nTo that one it's all\nBadge a low low\nKnow\nCheese\n\n\n[noise] [noise]\nWow I'm Bonner ever lived in the theater then lane evil than my bonded anywhere in line and we'll we'll let them in my head and\n[noise]\nNow do within that I play in the bars close them loving though from while very non ... courses I took an open mind body and then\n[noise]\n[noise]\nI bet I bet\nThe\nGo community\nAway to let them go\nJust let them go [noise]\n\nAnd that's why the fathers will\n\nYou on that now we don't really many Monet no we don't be making about um [noise] out in the ...\nDa da da da\nDa da da da da da da\nDa da da da da\nDa da\nDa\nAlternative [laughter]\nYou\nThe ... and ... and ... and\nStill do they get real ... bus Joe's last year he right and you know she votes right those are really of God Knows\nOn line three\nAnd Brian ...\nThe men the\nModeling industry right around there is a word that my job but they're still still ...\n...\nThe most I'm\nJanice Janice with me when you get stressed me not this thing in the late ... if you don't expect too much ...\nMay be no\nThe right guy matter store than buy some\nThing is you know and then be\nGet jobs or um is to\nLet them jobs generated around\nAnd\nThen when they\nWere in there and then I knew that these men and women are going on now\nAnd then and\nThen the average guy in the car and they did mention those\nGuys are ...\nThat they don't want to go to mark his bottle\nOr is there is no matter what the\nName of it is jealousy and John and John's on the Internet and a member\nTo do things\nAnd learn\nLearn and make them and then and\nThen all around me that one of the newer and better and then\nLittle bit here and I know\nAre men a very\nAnd dry ... around the the ...\nAnd I am in a capital a Nashville and I'm Out in a row and ... and ... and ...\n\nYeah Mm\n\nNever sure\n\n\nJust straight\nUp all the\nThe kids who are the rules for\nAs\nWe were da da da da da da\nDa\nDa and get then Ron and probably go\nDown there who\nWill make a big I'd be dying to say that the\n...\nMan [noise] na na\nNa na na na\nNa na na na na na na na na na\nNa na\nNa\nIt's the law and order a man that was never a ah so I can\nRead on the true nature you know when\nThey look they just do what\nTo stay on the guy in the day\nThe ... ... well you know your daughters they added that\nOf the ...\n\nKnow to be the next\nTime bomb oh\nI'm In\n\nI said just below the\nGOP who was then there's a lot of dumb\nLuck in school\nWhen I have to do\nIn the mid ... been mocked and Iran and bomb go\nTonight because I Know what\nMakes me feel a little harder to learn\nComplicated and somebody bang bang\n[noise] [laughter]\n\n\n[noise]\n\nIt's just simple as something that nobody knows is that I knew as big as a bubble it does on the scene of a clean up the odds of the project will speed up the ... the top balls\nSince I'm a\nI'm there\nTo do something and nobody knows ... goes up to you in the back of my house in ... she loves ... no\n... oh\nI remember when I knew you and me no no no we used to be just your friends would engagement no no no no ... cause problems\nAnd you know ...\nShe's got a lot over ... million young not money things he got his own mind about that much time doing the no\n... no nonsense\nGerms are not going much shows her dreams I make sure that the dreams of relates to do that\n\n\nGoing to do all the time\n\nAnd\nAgain it goes back then the middle of nowhere where the big black serious you\nKnow and\nThere\nIs there but I'm not backing that does that back just keep walking\n\nAround in the big\nBlackout this way they will get better and they\nDo\nBut I Know\nAgo maybe no\nNo\nNo your honor the wrong wrong to\nMy\nJob in\nThe high hit about this hour about that that would be a shoo wee\n\nMan there's a lot of\n... them cut ... well but get me out\nAnd then\nAnd\nThen it the whole day in the middle of nowhere where the big black or share it you\nKnow and and now we'll\nCome back and that does not have been a lot of whoa\n\n[noise]\nNo no no no\nYoung not no longer they you know\nNo no no\n[noise]\nNo you're not allowed to me [noise] when\nYou're not from the [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\nThe same job and\n\nMiss bank shed green green\nMiss knocked me out money\nLunch carts dogs are like me I was reading\nI did go to me\nMan and\nA lot I don't know\nAnd the name I read and men then junior shed green green\nYou're like me are draining\nAnd you're you're gaining\nAnd\nNah and get a job and\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\nJanine and Tom ... and ...\nAnd we like to say something nice about on Fox's radio program can't think of anything at the moment [laughter]\nShe was with we were laughing can help seriously folks you shouldn't be listening to the song botch walking wall classics radio program every Sunday for three until six PM right there on your own turtle silver WBAI you'll see\nI'm\nOlder you get these through the mid sixties you know the good stuff [noise]\nI'm Jim Bunning to join me for the ... Sunday yeah six PM two hours of some of the best music ever recorded heard exclusively right here on your alternative source WINZ\n\nRadio a radio and this is where the music mattered shift you're listening to W. R. U. P. F. ... Indiana your alternative\nSources\nYeah ... ...\n\nI heard my cells\nTo see you good for us to see\nA full grown as soon\nKnow look things about\nThe only thing that's being\nDone ... chairs the food and\nThe old school movies and you know they\nTry to live in Buffalo wings\nBut I remember is raised the\nPart of a bleak drone [noise]\nNice sweet is Trent\nLawn and there's no\nEnd you could have had man though [noise]\nAh yeah\nI were the crown of thorn\nDo you need to be\nThe end of the things\nWe may be in the [noise] do\nYou do when you're in New Jersey the new been living in the in the eastern ... new the new thing\nWent to\nThe [noise]\nThe gun\nName them and they were\nWhen\n\nTend to\n\nOh my God you know the\nIs just not into\n[noise]\nBut I was walking down the street when one of my mouth\nReading the thing approaching the\nName them now who are still all alone why do you come in they\nThe evenings it'd be nice if you can put on than me on my way that you know why you do this and the other dog they looked at me and\nThen one\nMouths of the\nMain the main\n\nMinutes later after walking down the street I'm not a shadow of them may creep out of their lives and then it's not\n... done up to my head he made it clear he wasn't looking for right\nDon't want money not\nTo make a move our long thing why\nBut no you know I got to\nWill do we care [noise]\nGuy said to\nMe in a\n\nNow how did how did they was winding down coming you know I Lived it over to the new than what I thought I almost couldn't copper and I stopped\nTaking money from that she had a bank account with righteous dollar buddy mistake 'cause I Know the same I we are\nMoney to grow on the street\n\n\n[noise]\nWell you know I Want to\nBecause I\n\n\n\n\nThis too shall pass better car right on your forehead or tattooed on\nWhen the clock strikes twelve fifty days you could come tomorrow it's all it's all hell my friend next way\nShe's ... she's still miss his\nFive bad things that scandal has\nHappening now think named lab lack of cancer and your body at all do that [noise]\n[noise]\nWe think to me when we think ourselves as one all fang and reclaim this collection has a name demeaning McGreevey bad\nWhenever say hell man died so whether it's at the pound the rule that state self interest is divided up cancers\nBy the golden rule legend but we went\nTo the weather and then the others or do you um more than bad\nBecause it all the time ... you know we can't live like a buffalo with all with respect\n[noise]\nMean it goes on\nYou know we're going to be calling me from going to do known to many\nApplicant getting my degree no please try you know you go to the middle on him doing it in all\nMy ... like I don't know\nW by UPS your classic show\n\n\nHe ... he was just me\nAnd\n\n\nSees\nCan lead to\nA you know the ...\nThe\nThe\nL Word you know\nThe\nThey\n\n[noise] [noise] [noise]\nKnow the\nNa na\n\nNa na na\nNa\nVe been just doing their\nDo with\nThem but they\nWere\n\nWinning re\nRun play\nA man\nWell I Am on the uh\nAnd re\nMine there may\nWin\nWhile he no\nNo\nThat's rumors their dreams liquid back there it's rocket rules plastics up to Nineteen eighty three it's Seventy this metal ...\nSeems na\nIn that\nA lot\nTime with\nThe na na\nNa right in downtown\nSinger songwriter Albert damning get Marines Southern California man and really poor when it does the rock and roll classic Tibet to rough up and so it's\nTo Seventy days every Sunday afternoon here we get together something that you'd like to hear give me a call that the two or three by seven WBAI you'd be as I said the best run by the Soviets\nIt off with October Baby three here's sexy is that the genes mystery\nAnd then\nTo go\nTo the\nI\nTalk to me\nThat ...\nAbout three and run around in the middle\nOf\n\nGod this is a very\nWell\n\n\nThat\nShot in the end of the ...\nBut the\nBad we're going\nUp on the\nWhat everybody not\nJust about to get in and there's not a country in\n[noise] so I don't think I didn't know you might not think again and\nLike listening to morning yeah\nIt made me feel uncomfortable so\nI drove making tantrums every little thing like when my ...\nThan I Do have things over and over\nAnd it's all one game I found out I had all\nFamily got Neil ... slowly I learned how to live on it better\nYou can see signs of autism in children and young and they need money\nFrom early intervention they make a lifetime of different ...\nLearn to sign onto the beach dot org last minute Ron do you buy onto the beach and the outcome\nWe're here every Sunday yesterday for rock and roll lots of ... year old turtle source W well you'd be\n\nLegit to\nKnow\n\nNineteen eighty three there that shell of a long letter fair great\nClassic you stay in the ... Rouge Springsteen now here's Eric Clapton nursery slow random lay down Sally\n...\nGoes\nThe games\nIs no then this row boating and you just days you really go to\nI Know you've got to go do what you will make a fuel cell phone home and stay with me bumped\nInto jail or they\nBill ... is last so long to Joe Joe\nTo leave so soon\nYou know just to do they just\nSo they knew the owners runs ... Joe blow\nGoing to need those buildings guys you know this is all those will choose to stay with me and\nTo go along with Joe can you\nAlone to see those known a lot\nAnd then you'll be based show and dreaming\nTo build you go with the dirty birds\nGame you'll love rage down and stay with me\nTo do was so long to Joe judging\nBe made to leave so soon\nLong lounge Joe and Joe's\nThey using bottled water Joe duty\nThat you know they don't leave so soon\nKind of a dry run long just a joke then\nIt's rock and roll classic what the\nOh that'd be the end of the [noise] [noise] [noise] [noise] and he's\nGone a lot more jak outlet for that matter over by the doctor\nNo no\nNo no not so much\nMoney on da da da da da\nDa da da da\nDa da da da\nDa da da\nDa and\nDown right now I'm getting into going by and da da da da da da da\nDa da\n\nDa\n\n\n\nNumber a record year from October Nineteen eighty three that first I think that would just follow up some too little red ... rock and roll classic your Steelers wheels stuck in the middle of it you\nKnow [noise]\n\nGeez I don't see is that right [noise] and those kids don't vote on march\nGet down\nHere again a man or do you see a stalking me you know\nIt is I shouldn't do do do you do not pay and the moon will say well let me\nRight way and I am\nIt\nSeems\nTo go to a\nThing I can dig in\nMay steal\nRight hand\n\n\nEach\nAgain isn't I\nNo\nNo you're going to do\nNow we do\nThe\n[noise]\nWell they should stick to the love there that's Robert's Baltimore number one I can get six there's rock and roll classic to talk about your with your something\nThat you'd like to give me a call Seventy four three by seven WBAI you'd be the best of rock pop and so it's not the seventies and eighties classic it's every Sunday afternoon here we get together\nBetween three and six walk in the program we're played some great October Nineteen eighty three hits and seventies instrumental for you next Sunday afternoon back again here live three o'clock in the afternoon that class in Nineteen eighty four documents more rock and roll classic more Seventy just your mental Apollo one hundred will be standing by\nOlder you get these through the mid sixties you know the good stuff\nI'm Jim Bunning to join me for the oldies zone Sunday yeah six ...\nTwo hours of some of the best music ever recorded\nWho simply right here on your own source\n\n[noise]\n\n\n\n\nA problem with the\nHomeowner\n[noise]\nDi di di\n[noise] yes I\nThat's the numbers that record their\nJob or Nineteen eighty three their line Ritchie there was all night long in addition to the best of October ... seventies instrumental\nDon't they may\nThey may\nOh gosh\n\nBaby\n[noise]\nThey say oh\nNo\nThink [noise]\nDi\nDi\nDi\n\nDa da da da da\nDa da\nDa da da da da da\nJob or Nineteen eighty three it's devotees rate instrumental to invest for men and let's see me go stand by your Nineteen\nSeventy seven songs are all over the radio during your car or a\nStar Wars theme for you [noise]\n\n\nThat's my job and actually treat their record for one thing leads to another there is rock and roll classic drop off your\nWith your Sunday afternoon here because the best of rock pop and so it's every Sunday afternoon here we get together seventies and eighties collapse of kids Seventy four three by seven WIP somebody want to hear Saturday let's recap the top Seventy instrumental to your point\nThis afternoon and number ten she's sixteen Seventeen at the stray cats a number nine telephone she ... eastern uh delirious from Princeton number eight all night long from Weiner Ritchie and watching just heard your number or\nI don't know the star wars thing skews me I get that screwed up a little bit ... three that we've been Star Wars theme from a Nineteen Seventy seven and then uh this when you're\nComing back you're just a couple of minutes right now we have some Billy precedent here for you bottles to step knew from the NFL and I think it's weeks six in the NFL Steelers over the bangles this afternoon in Cincinnati at all brown stadium twenty eight to Twenty one then run they lost this afternoon thirty eight to fourteen so\nSteelers or at three and two in one right now bangles at foreign too and I'm not sure about the ravens they're playing this afternoon or when they're playing off to take a book that there will take a look some more final year in the NFL here coming up in the next hour of the program so that's good news here so ...\nFootball play a game show host father\nAnd all around big do I'm also an expert on drama I Know all kinds of drama that's a good car\nOf like season in injury necessary kind of like having an agent in Hollywood and there's still a drama like the drama around my current get labeled tour and then there's the drama you could skip the\nDrama that comes with not having your high school diploma or equivalent to the point three adult education classes near you know and to finish high school diploma miniature diploma data\nOr taking the moments in nine seven seven seven now ... replied down there on the phone when the nine seven seven seven now\nAnd leave the drama I was like my ... by the dollar general literacy foundation and the ad council for\nAid coming out of your radio this afternoon it's rock and roll classic withdraw butts on Ninety One at than [noise]\n\n\n[laughter]\n\nAt\nAnd all\n\nThat\n\n\n\n\n\n\n[laughter]\n\n\n... ...\n...\nAnd\n\nThe other\nBig issue about like the program that's been the rest of the name was added they\nBreak glad to get anybody any larger Dolly Parton I got the ball David worry and Gary Wayne your love is alive\n\nYeah to rock and roll classic what's your best\nYou know\nThere you go touched me there ... Jim Morrison the doors are the best route puppets do it every Sunday afternoon here we get together seventies and eighties lots of kids here for you to step in the program we have got October of eighty three and seventies great instrumental to avoid and\nBluegrass born and bred in America at now popular all over the world\nI'm Jim Rogers and I invite you to take us roll through bluegrass country with the bluegrass ramble Sunday mornings from seven to eight right here on W. I. U. P. F. bam [noise]\n\n\n\nThey'll be there for a minute that read their mother brother sister whether\nMm\nNot get things done\nBut a da da\nDa da da da\n\nDa\n\n\n\nI guess [noise] by the\nWay\n\n\nDa da da\nDa\nAll ... much\nWhat his wife is often called there in Ninety Seventy wonder it's rock and roll classic drop out your with\nYour something that you'd like to hear you be called seven ... seven WBAI you'd be the best route so it's up to Seventy Seventy in the program\nWe got to go with your for your October Nineteen eighty three and Seventy instrumental next Sunday afternoon back again here a lot of the three o'clock in the afternoon I Will do the class in Nineteen eighty four where are you going to get back 'cause none of my job or maybe three bendel ballets in a bar\n\nAlong with some occasional blues both genders these countries tune into vital tracks\nI'm Jim inviting you to join me this Saturday at ... pm on your alternative shorts W. I. U. P. F. M. Indiana\n\n\n\n\n\n\n\n\n\n\nIt's a great Seventy this for mental through this every the program\nThat's her Belvedere with right not only that we played some of the back to back favorites your brain seventies late\nAlong Alabama okay well\n\n\nJohnny Rivers there is a remake the old you eat the Adam Smith's um\nRocking ammonia to boogie woogie flu it's rock and roll slapstick being the home stretch in the program this afternoon talk about you but it's something that you'd like\nTo hear give me a call Seventy four three by seven WB classic yet or the seventies and eighties you're definitely in the program we're doing October Nineteen eighty three and Seventy ... medals rate and beach Don period this one here in the late ... when the your main ... ...\n... ... ... ... ... ... ... ... ... ... ... ... ...\nYou know the same and\n... ...\nWhen\nMan they love the show and then the dog in the world that you know it's not as ...\nDa\n\nQueen their Freddy Mercury company there we will rock you of course they had the other side of that goes with a dare we are the champions we some trouble play that now we have a little bit more time there of course they have a movie coming out also for Freddie Mac I think it's coming out November\n... should be an interesting when they're it's rocket will plastics about forty minutes left their gyms ... becoming in at six o'clock tonight uh mid fifties through mid sixties you're forty some great stuff coming up here at\nUh six o'clock tonight finals in the NFL for weeks six course the Steelers this afternoon they beat the bangles twenty eight Twenty one a jets over the coals forty two to three\nTwenty to Thirteen this afternoon dolphins over the bears this afternoon or thirty one twenty eight and the Vikings over the cardinals twenty seven to Seventeen buccaneers\nUh losing to the falcons thirty four to twenty nine of course the Sunday games and I should be interesting is achieved at the patriots about eight or twenty tonight on NBC TV channel eleven\nA joy at that time south in the program as I said a Nineteen eighty three October of H ... seventies instrumental as I got another one good standard by here from October of eighty three from air supply\nWalking through the farmers' market with you what could be better everything sounds fresh pick of the season are likely to the farmers\nThese days we're hearing a lot of conversations like this\nIt's great walking to the restaurant with a new sidewalks it's easier not to drive that's because more communities are becoming sustaining places places where shopping schools recreation and public transportation or close to where people live there are places where people share a concern for land use air and water quality places planned for future generations\nI'm Glad we planted the rain garden beautiful and we're doing our part B American planning association once you to know that sustaining places like these don't just happen they take planning urban community and regional planning plus\nPersonal responsibility I think I'll catch the bus to work today there's a lot each one of us can do and there's a website where you can learn more goods planning doubt or that's planning dot org a message from the American planning association and this station\nThe best of the seventies and eighties it's rock and roll classic with Tom pot\nDo the right thing\n...\nNow does he\nThree\nAnd I know when they're ...\n\nNa na na na\n\nKnow how they do\n...\nAnd I don't know how to\n\nA\n\nDa\nDa da da\nDa and\nI can read there that there are these are the biggest Mickey nothing at all they're great\nClassic gets in the ... to ... ... ... now years with that [noise]\n[noise]\n[noise]\nLet's\nNo I'm I'm In a little\nKnow what\nRight on right now\nGlad that you're there you go out to the old man they're coming from the get sued every word that bracket stuff\nSo I guess we are ready for that holiday season you're up all will be coming up here just a couple of weeks right now anyway to step in the program we presented October Nineteen eighty three and I got the number one song for your record it\nAnd write music from the pet the present in the great music you know great music you don't know yet more more since Sunday simpler what's that but\n... I think you can\nHere on W. R. U. P. F. L. Sunday spent way more more of your\nStory\nWe know they're not getting what they know and you never\nEver\nKnow man I gave you the down like\nYou hear every now and that ban the use of gone back every now and then you get your\n\n\n\nNo no no no\nNo the bowling\nNothing I can do\n... ... one well no no\nNo no there's no\nLet the the uh [noise]\n\nNah nah nah\n\n...\n...\nWhat do you know they don't they love and\nNot [noise]\n\nOne each other's big number was like you need to read\nThe letter to the heart or is that just go kind of like ... mixed version of that there were can wind up late for you\nKnow the ... during the summer\nWell\n\n\n\n\n\n\n\n[noise]\n\n\nLow\nDa\nDa\nSo I started out to say they're Donna Summer McArthur park a little bit of a nasal thing going on here throat here this afternoon McArthur park to Don and some of the rich rock and roll classic ... with you a couple of more minutes you're left ear\nGyms oldies there'll be company that's a lot but I don't forget ... ... to collect the Sunday sampler and Matthew Humphrey with the end of radio from eleven to one and then he all cafe promote one AM to step in the morning I'll be back here next Sunday afternoon here live three o'clock in the afternoon with the class in Nineteen eighty four\nLaws just really just\nWait\nAt Disney or\nAt least to lose my\nWhole Larry funny it it's like\n\nMy\n\n\n\nBarry Bonds\nRed berets\nBack\n\nThey made\nThen pottery\nButter as well\nAnd that and that pretty\nYou're in there and they\nSaid it didn't matter to me\nGot him in and try\n\nMore\nLike fast [noise]\nAnd fatty\nConcern [noise]\nThe early ...\nFrom a WFL UPS themselves studio welcome to the oldies zone I'm Jim the late night radio guy and I have a about two hours worth of a great music in the mid fifties through the mid sixties just ready to go tonight we let off with the stroke that was done by the diamonds and the royal guardsmen\nThere are a big hit Snoopy versus the red Baron\n... well let's get right into mowed down here Smokey Robinson and the miracles [noise]\n... ... ...\n... ... was\nThat were greed the ...\nShe used to run [noise]\nWhile a staff were\nBy ... [noise] why are you today we're\nPart of that\nA state law we worry about the other\nPlayers who strove who through\nGrief TV\nSchool\nGreasy fails are gone down\n...\n... we found the body swap renters used to run\nA when a caller on the way\nA sweat then to by law to draw on what the loggers\nWho led their injury is the power to wire\nThat's just the audience with Jim in the late nights radio guy knew whining and no bagpipes [noise]\nMm\nWell we'll know everybody has a popular Bert\nErnie\nAnd Bert\n\n\nVery very very very very\n\nFirst thing that is really scary\n[noise]\nVery very\nDa da da da\n\nDa da da\nDa da\n... ... tells me no one can take place man\nIn the paper\nTo bomb pall over\n... I'm low for a\nMan oh ho hum\nTo the young\nA\nNa\n...\n... ... ...\n\nTo ...\nDo the\nJob just one kids from your speed limit I Will tell me that you love Israel that ...\nCan be to ...\nWe were about one in the ... you know we all know who are you all for me\nTo ...\nDo um low low\nMan\nOh man\nI'm\nLow you know a na\n\nSo more music let's talk\nAbout things\nThat we many\nThings in the ... in the eye\nWas no\nI don't know some of\nNew York pol\nNever let a small\n... billion dollars that they may want\nLot of uh\nHave been on the way\nDa da da\nDa da dum\nLa la la la\nDa dum la ... by Sonny James\nAnd the birds the word the Remington did that song for us and this is the ... on your alternative source there'll be why UPS than Indiana I think it's time to go back in and hit another uh do a song or two here are the duck\n...\n...\nThe\nHow our lauro\n\nWe\nWho knew\nLa la la la\nLa la la la la la\nBrea [laughter] but I\nHave\n\n\nLaw\nGood\n\nMy\n\nW. I. Ninety One up in Indiana [noise]\n\nThe best in progressive and psychedelic rock along with some occasional blues ... countries tune into vital tracks\nI'm Jim inviting you to join me this Saturday at six PM on your old Trudeau sorts W. I. U. P. F. M. Indiana\n\nHe works in the oldies\nSays five and then the more you\nDo you feel [noise]\n\nAnd da da\nDa da da\nNot one to a mixture of all a\nDream to me you\nKnow alone\nLie God have now had a\nChild\nFor a ... hour work now dream\nThe number of him to\nA jam in\nTo call\nIt and the some very\nSir Dan by an honor name in the tree is a\nHero to go for a trick dry sees on short term back yard one ones\nI I got\n\n\nYoung anyway as we can only\nYou load lake in the um on start to bloom\nA lot to say these are the boom\nGuy\n\n[noise]\n\n[laughter]\nYeah [laughter] [laughter]\nHey\n\n\n[laughter]\n\n[laughter] [laughter]\n[noise] [noise]\nThe\n[noise]\n[laughter]\n[noise]\nNo there's an instrumental you ... you know along with it was gold yeah it was done by Dwayne daddy and before that the revered did their classic song moonlight cocktails\nThis is the only zone on your alternative source W. R. UPS them Indiana again I remind you that if you'd like to a request a song for next week's program send an email to like like radio guy and Gmail dot oh\nHere's Joey Powers me\nMe it may not\nMe maybe men nine\nAnd don't\nSo we can only\nBuy me to\nMeet me it just\nMeet me man died\nWe\nAnd you may have\nEngaged\n\nMay have been nice\nThey did\nFor me\n\nI\nKnow\nBut I Do\nThings\nKnow\n\nHow\n\nMonths now\nKnow\nI\n\nHe\n\nO da da da da da da da da\n\nDa da\nDa da\n\nDa\n\nJohn how are you going to come\n\nGet a get a\n\nBetter\nThan that in the way you can\nDo the\n[noise]\n\nPlan to\nGet out and\n\n\n\nGet a get out\nAnd\nGet out there\nWhen you\nFor a\nMan to round\nMean he may have been done about it with me but\n\nFor\nSome W. I. E. at them out to you in the early June\nAs Daniel just told you were coming to you from the wind the FM studios\nLed you're with us tonight\nI mean I just turned ... by Judy Yung the starlight and we also heard get up now\nThat was done by Coney James Sean does in may to love that once the everybody brothers are saying that that was I think the first track from what I considered\nMe one of the three or four greatest hope he's ever made a ... ... what\n... and that you love me\nYou located are you not\nAnd that you mind me um\nOh what can I Do I'm\nMan but he loaned me\nA man\nYou know uh not being up by\nA man they\nYou and a no\nPrize or\nA or a\nPlane\n\n\n...\nYou sign\nWhile on me or you ...\nThat you may as well\n\n\n... ... ...\nIt's ... ... ... they made a ... and\nThen they make you do lose weight forget us you know I mean Lee you can't be making phone calls me ... and ... with a dream that made you get the\nHang on the streets and my I mean we have to say let's see what you want in a\nMan or a week later they can't be ...\nThan I Am the wedding and one house right now there's plenty to where you live a good father than they do\nStart carefully through the day in and see how they ... they sign the dream as you say\n... is lousy ratings from above you can't do the ... the the survey that generous gave me the ... or you can't be the the ... the\nOne hand but I don't want to do it one way you rely on\nMay ... reading the NATO they can we do we get the ... or using all made up the\nThat's how they\nAnd they'll be in vain and made over the women\nRegarding John maybe he\nGo go go\nLove\n\nDown and go go\nWill be a man and you will be the maid or do a big old man and me and they have a permanent from mount around\nJohnny be good that was done by Chuck Berry and we also heard memories are made of this that was recorded back in Nineteen fifty bucks by dean Martin everybody brothers did a pretty good job on that song as well we'll play their version one of these days let's go slow things down a little bit here's Brendan [noise]\n\n\nThis down town\nBring the um [noise]\nWhen I only\nPlay like [noise]\nIt's crazy hon\nA brand name [noise]\nJeez you\nEat the name\nI made the\nTo do\nAnd ... and\nI don't let\nA huge [noise]\n[noise]\n\n[noise]\nNo bother girls off ... go ahead please try [noise]\nKnow that um I\nMaybe they don't\nSo you\nCan have\n[noise]\nThey pay\nThey will do\nThey just don't think he\nOh\nYou are Donald in to W. I. U. P. S. then Indiana\n\nGod\nThe uh ... ... and\nOr your ...\nJoe ... can we do um telling him all the law\nWhere you are I'm\nNo\nLonger\nHe\nSaying where he got up by\n\nHe's ... to ... ...\nWe could get ... to night to run would be so role\nWhere you are\nLot of\nThe\nBang\nWhen it got up on my\n\n\nNo\nNo no no I'm\nI'm\n\nNo no oh\nWe\n\n\n\n\nKnow no one really\nYou know\nThis is the only them keeping that you need to walk in\nKnow\nI'm\nI'm\n\nThe\nThe\nHill\nI'm\nA\nWell oh\nThe\nOh wow\nWow\nOoh\nOnce in a while that was performed by the Chinese we also heard was spring bills that was done by the Pittsburgh group the dough Vikings and don't Shannon let off that's a song called Kelly kind of difficult to find a dumped ... song is a great song but I digress\nMost repetition today with the dimensions to name the men do [noise] and uh\nYou know what to [noise]\n\n\nThat went\nMy God\nYeah\n\n\nMy bank was\n\n\nAm I going\nTo read and that\n\nWell that makes sense now\n\nThey\nDo I'm\n\nDo that you", "year": "2018", "show_name": "no_show", "city": "Indiana", "day": "14"}