{"month": "10", "state": "PA", "station": "WIUP", "content": "Did you know for every five miles you go over sixty five miles per hour about twenty cents more\nAlso if you're shopping for a new car\nFor the smart way certification mark you the most should vehicle meets your knees\nJust one of these we'd get more miles for money and\n\nMore and more efficient vehicles visit to slash smart way\n\n\nMark Morris on\nAnd I'm In my ... and ...\nDa da da\n\n\n\nGreensburg alternative source noble you argue the Indian\n\nMm\nAnd then they would\n\n\nMan and and do\nThe ... and ...\nAnd then there\nTo [laughter]\n\n\n\n\nYou can go and do\nDo do\n\nHave\n\nAny problem\nHearing\nOn the way I Am [laughter]\n[noise]\n\nThey\n[noise] you\n\nWe want you\nIn my\nEmail\nEh\n\n\nEh\n\n\nPeople\n\n[noise]\n\n[noise]\n[noise] [noise]\n\nMan see\nGod or\nYou're not sure\nDa da da da\nDa da\nDa\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\nEither way [noise] [noise] [noise] ...\n...\n[noise]\n[noise] we get what you are you ... get them to be in\n... ...\n...\n\n\n\n[noise]\nThe\n\n\nSomething on a\nAnd then and then and then and then and then again and again and again and\nAgain and again and again and they would have been married a man and a\nNeighbor and being able to\nIn my\nRoom\n\nReally do you want to know\n\nAnd to be\nTo\n\n\n\n\nLayoffs\n\n...\nNicki\nThe [noise]\n\nThey don't need to do that but now the kids that she became\nThe latest\nUPS and this is mark Morris and on the Sunday sampler with you till eleven PM tonight\nBeginning the second hour of tonight's program with some music from the film first men which opened this week I Do believe I haven't seen it yet planning on see it but I read that there's a little bit of social commentary that was a current\nBack in Nineteen sixty nine of other people's viewpoints but landing on the moon and how well things are relative you'll Scott here in after the id [noise]\nYou're listening to W. I. Ninety five one Indiana, Pennsylvania [noise]\nReform here it's called Whitey on the moon [laughter] [noise]\nAnd um [noise] it was inspired it was inspired by\nSome white is on the moon [noise]\nSo I Want to give credit where credit's due [noise]\nIt's a\n\n[noise]\nLot rather than the masses and now we're fighting on the moon thought Saddam began to swell and white is on the moon I Can't pay no doctor bills but why does on the moon [noise] ten years from now I'll be fans do why why it is on the moon you know the man\nThat's not my rent last night because white is on the moon blow hot water no toilets no lights but why does on the moon [noise] I Wonder why he was helping me why they do in the mood while I was already given him fifty a week and now why it is on the moon [noise] taxes taken my whole damn check\nThe male would why they're on the moon base it on the gas as well and white is holding the ... with all that money may last for why they own the mood how come I got no money here ... white is on the moon\nYou not just about had my real why they own the moon I'll play golf and then the doctor bill to pay a male special [noise]\n\nTo Whitey on the moon\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n\nTo do it because I'm\nAnd they didn't do it better\nThey do that or\nThat they\nEither that or\nYou know we learned that the bill\nAnd you will find the news media they use the money out of date\nBack in order to do\nA\nNot\nOn the line is\nWould they want they again\nThey do that do that\n[laughter] I Know that the guy that [laughter]\n[laughter]\n\n[laughter] [noise] [laughter]\n\nMy Bill Murray we share your mind when\nLook at it but I Know you've\nGotta you\nKnow driven\nBringing\nMuch of a drug addict\nWants to go out on the test and I\n[laughter] see I got a heroin\n\n\n\n\n[noise] late nineties music from black grape\nHaving a little fun with running Nancy Reagan do in the cutting pasting remember them songs go get higher on W. I. U. P. F. M. mark Morris and in the Sunday sampler with you until eleven PM tonight music from the Gary Douglas man before that new music called open my own my\nFrom out of England once again a bad sounds new music from them called the wages not be ... ball whom I also think happens to be from England and zone one to six thousand we heard face to face with under the gun Nineteen eighties vintage and you'll Scott heron at the top of tonight's second hour of the program\nWaiting on the moon\nRight here on WIP FM Ninety point one\nNew music from gorillas featuring George Benson right now it's called humility\n[laughter]\nFrom Russia [noise]\nTry [noise]\n\n[noise]\nWay to run\nTrack now the wildly\nShow no oh\n\nThe best and progressive and psychedelic rock along with some occasional blues low blue jays these countries tune in to bite on friends\nI'm Jim inviting you to join me this Saturday at six PM on your alternative sources W. I. U. P. F. M. Indiana\n\nTwenty seven and Indiana, Pennsylvania the weather forecast tonight some drizzle or light rain likely tonight cloudy skies with Lowes in the upper forties rain likely as well for Monday mainly in the afternoon hours behind new sixty two degrees\nFor Tuesday mostly sunny with a high near fifty degrees are meeting fairly cold for Wednesday mostly sunny with eyes in the mid forties\n[noise]\nPrevious continues or unintentionally killed or injured by loaded unlocked gotten [noise]\n\nLearn how to make your own home safer at and family fire dot org [noise] brought to you by the ad council an end family fire\nToday singer songwriters speak their mind sometimes it's love and peace sometimes it's concern and frustration no matter what it's always relevant it's ... it's electric it's modern dribble doors Saturday morning nine to eleven right here on your alternative source W. I. UP [noise]\nThe W. I. U. P. F. M. community calendar\nThe five PM both states potter's throughout Indiana county will open their studio workshops giving visitors the opportunity to see how these masters create unique pieces of ceramic art\nEleven studios will participate with the work of twenty five potter's on display you'll have the opportunity to tour the studios meet the artist watch demos and suffer unique creations for yourself or for holiday gift giving a map showing the location of all the studios along with additional information is available by visiting\nPotter's tour dot com simple potter's tour dot com\nCatches Saturday spot every week here in Ninety One W. I. UPS them from eight to ten PM your host the holiday will play all sorts of punk rock a rock and roll\nAnything I really want to dump out there on the airwaves pretty much it would be my hard drive and I see my head\nAnd if you are listening and you'll receive awards so check me out every week she says the em [noise] find me on Facebook a faceless oncologist last Saturday sought of you are you face as always listen to any other public radio station ready for one W I used to be a family of the great you know\n\n[noise]\n\n[noise]\n\n\n\n\n\nNa\n\n[noise] [noise]\n\nYou're going\n\nYour alternative source for Indiana county and beyond we are W. I. U. P. F. M. streaming live at W. I. U. P. F. M. dot O. R. G. mark Morris in here with you on the Sunday sampler each week at this time eight until eleven PM and thank you for being here\nMusic from the early part of the career of John Mellencamp early Nineteen eighties music ain't even done with the night one of his first big hits a before that we heard or the seeds\nNineteen sixty stuff with Mr farmer I guess I just put that on because I think yesterday was national farmer day something is silly is that\nGood song though the dismembered ... plan from emergency and I and back and forth all winter and the winter concert before that was son will from a couple of years ago ... Washington\nSaxophonist musician extraordinary was seven prayers ex tc before that with another satellite that is from ... from Nineteen eighty six and the band cults\nFrom the first CD they made as a do a\nSong called the rave on back in a moment you are listening to\n\nNinety point one dabbling the Y. U. P. F. ... in Indiana, Pennsylvania this is this Sunday sampler\nFor everyone she won't know it's been W. R. U. P. [noise]\n\nI found it on the beach\nYou could die and\nNo bomb di\nDi di di di\nDi di\n\nDi\n\nD or a man and re\nDi di di da de\n\n\nDa da di da\nDa da\nDa da da\nDa\nDa\nDa\nO da di\nDi\nDi\nDi di di di di di\nDi\nDi di\nDi di\nGreat day\nThe the\nLeast three\n[noise] [noise]\n\n\n\n\n\n\n\nBut ... eleven bill signifies that it's now time for eleven to eleven eleven songs with something in common to tickets to the end of the program tonight is a a perennial seem it's a good one to pull up from time to talk of the just the bears so much fruit\nIt's called question period that means all of the titles into nights a last segment of the program are actually questions\nAnd I decided to pluck from the Nineteen sixties specifically from around the same time periods of fifty years ago on the billboard hot one hundred and this is what I did you know me I like to do a kind of exposed the more obscure stuff some of the stuff uh was unfamiliar to me\nSixty eight and I said the first eleven questioned songs I'm going to play and that's what I'm going to do tonight\nSo first here's a band that featured juice sampling who would later make his mark\nIn country music but in Nineteen sixty eight he was with a band called the unique this is called how lucky can one man be you're hearing it on your alternative source Ninety point one W. R. U. P. S. fan\nI surely you [noise]\nMm it's making me feel so\nMean can they do that oh dear [noise]\nYou'll do best thing\nLove ...\nCan one man being\nVolcano man Mm you're right about that\nWould you want to\nAll the bad\nYour man thing too [noise]\nI Love ...\n... mile away\n\n\nWhere do I\nWhere do I go\nWhere do I do\nWhere do I do\n\n\n[noise]\n\n\n\n\nAnd the sun drenched chancellor ... illegal what were you know movies are trying to divide\nMusic you know that just doesn't make a great music you don't know yet I talk\nAbout with Martin Lawrence on W. I. UPN man\nBeen a battle\nThey've been going to be\nThe point\nW.\nDuring\nBeen a [noise]\nNa na na na na\nNa na\nNa\nNa\nNa na\nNa\n\n[laughter]\n\nDo you know with\nWe use me all through\nThey do the do you all the the\nSell me a\nSay they\nSay they do a lot of that and\n[noise]\n[noise]\n\nWell\n\nBy law and\nYour nose in a while and then\nKnow [noise]\n\nDo you draw the\nWell [noise]\nYour very\n[noise]\nA lot of guys love your when you\nIn\nWay they they don't have to tell you or do you\n\nKnow if you're going to get to do it for no\nMore than a book with Don and bring it to\nKnow where ... why don't\nWe just don't want\nLet's do that I knew them and then again when you're not know where to look on a ... year\nRound them up\nAnd [noise] [laughter]\n[noise] [laughter]\nNot holding on to talk about it but I'm dominant figure in front of a new\nHave been there done that I don't know\nA bomb down like that\n[noise]\n\n\n[noise]\n\n[noise] and it it's now time for the and the radio on W. I. U. P. F. M. how's everybody during the night\nA little bit late here getting into the station but uh I'm excited to be here as always and I like to thank mark for queuing up a song for me uh the theme tonight is going to be all would double related [laughter]\nOr ah you know\nEvil double not just got to be like the past few weeks but uh yeah just keeping with the season it's to see them to be devilish [laughter]\nI suppose uh yeah that's ah but yeah that was on there was run that double run by Paul McCartney and moving into a the rest of the devil rays of the evening specific song is across the road by Robert Johnson and you're listening to the end of radio on W. R. U. P. F. M.\n\n[noise] Mm Mm Mm Mm\nNo mom he he\n[noise] [noise] [noise]\n[noise]\n\nDo\nYou go\n[noise] being in\nThe ... the black or ah [noise]\n\nYou know even only ever bought it for me\nTo do the can\nDown the judge me um\n[noise] [noise]\nAnd\nJeremy Lin [noise]\nMm [noise] Mm they can\nNo longer than that mark a new news\nIn\nGeneral and then they let them around [noise]\nAnd [noise]\nIt can be done in my late ...\nMeaning they knew who they are\nNot at a crossroads moms back you know\nIn the [noise]\n\n\nOr\nAll was looking at them that way again\n\nReal good\n\nWith budget grave Neal feeling you know I'm the driver man is saying you\n\nKnow my dog rattling much started round and round [noise]\n\nMy daughter now there's rattling\nMy gym is good and round and round\n[noise] Mm\nI get your veins poisonous\nNo body can be violent\n[noise] now\nMy real big problem and she died bottle yeah\n\nNot a betting man\nDied about a year ago\n\nAnd ever since you die I hated every well ride go\nBy and then [noise]\n\nEverybody around what did I wouldn't be able to make me go nuts\n[noise] no not\nToo high low on the bus read to raise my hand [noise]\n\nRandall Harlow on them\nLike a man a man\nWhen she was die I tell people what you read your main\nWhen she was dying\nI'll tell you what you said to me\n\nThe town where you're going to have within an hour and I will stay in the all male marine\n\n\n\n\nStabbing correctly number forty\nSix\n...\nSpanish\nBryan di di di\nDi di di di di things you can still remember ...\n... you saw\nYou really really bad and just land on he kept one\nWhen you\nChallenge really worthy\nMove into everyone's buckled up on what you want to hear that quick [noise] never give up until they must go on a message from the national Highway Traffic Safety Administration and the more information or is it safe or car dot Gov slash kids buckle up\nBack here on the end of radio for a special night of doubles every ... uh last couple of songs they're worth sympathy for the double by the Rolling Stones the number of the beast by iron maiden and which in our blues by tamper red\n... going deep double stuff and you know it's going to be fun it's fun it's all in good fun so if you're out there and you're like oh no no [laughter] moving on to the next song here ah\nThis is Lupe suffer over Lanka sure by the fall and you're listening to the end of radio on W. I. U. P. FM\n\n\n\n\n\nI have to disagree I don't have that I tried it at all of that so [noise]\n[noise]\nMm [noise]\n\n\n\n\n\nIt\nThe Beatles\nAnd then they\nThing that I didn't\nThat they can and everything\nDa da\nDa\nDa da da da da\nDa de da\n... ... maybe it will be\nThe\nThe the big\n\nAnd [laughter] and\nI spent on shows and da da da da\nDa da\nDa da da da\n\nThen I was\n\nYou know there is a\nAnd now that her stand up and then she\nSaid that that\n[laughter] got to cut\nToo much\nA role model\n[noise]\n[laughter]\n\n[noise]\n[noise]\nAlone you just have to you [noise]\nI'm ... I'm not Rob your fans but\n\n\nIf you are you here in Ninety One Indian or Pennsylvania\n\n[laughter]\n\n\n[laughter] me\nConquer\n\n[laughter] do you\nDog right now that I'm I'm\n\n\n\n\nThing about\nUm\n[noise]\n\n\n\n\nBack here on the end of radio that last song there was a black Sabbath by black Sabbath and just before that with square hammer by ghost love that song become one of my favorites uh recently that being in general is just just incredible uh\nJust a just a ton of fun I [laughter] I've played them on a whim may a few weeks ago a week ago two weeks ago whatever it was and uh just gone down the rabbit hole with them a lot of what they do it's all good stuff\nHighly recommend the check out of everything there is if you get the chance actually playing one more song by them in a little bit here uh for the covers segment of the show but for now we're going to jump over to John Lee hooker with graveyard blues here on the end of radio on W. I. U. P. F. M.\n[noise]\n[noise]\n[noise]\nYou know that's\nA\n\nGood if\nYou know it's a\n\nVery [noise]\n[noise] [noise]\nMm why don't date in my baby say\nI ... by way of um [noise]\nWhy don't they didn't even say no\nMost of the three big\nWhy you want to check my baby weight ... [noise]\nI ... if I\nAdd ...\nLetting it down a\nLittle diner on\nLetting her down you mhm\n\nOh I'm going to fly\nRage and they they\nWould go to Rachel\nOnly Decoration Day [noise]\n...\n\nMe for me for me\n\n\nI'm all over the place tonight we're I'm just mentioning the covers segment of the show that was actually next so let me introduce it it's a it's a sin the original song by the pet shop boys and the cover by ghost both versions are incredible songs uh\nI Hope you enjoy them as much as I Do it they're they're really really nice work or again next long as it was ... by the pet shop boys and this is Matthew when you're listening to the and the radio on W. R. U. P. F. M.\n[noise]\n\nYou're listening to W. I. UPS and Ninety point one\nPennsylvania [noise]\nBack here on the end of radio that last last that last song there of course was the devil went down to Georgia by the Charlie's Angels band classic of course then if you don't agree I mean what are you really just what are you doing what do you what are you thinking\nWho doesn't like that song but when I've been out like that song\nMaybe maybe I don't know if you don't like it you got some problems because it is a classic and it is real good anyway if you're just tuning in now with the ... top of the hour for our second hour of the show and it's actually now Monday\nOr the theme of the evening is all a devil related and evil and you know all all that fun stuff [laughter] uh the first song for the second hour of the show is ... father ... son by but he makes\nI'm going to get a little metal Ian here this is Matthew you're listening to the radio on W. I. U. P. F. M.\n\n\n\n\n\n[noise]\n\nThere is\n\n\n\nTo say I am ready to die\n\nIn Congress and medical\nCenter and um [noise]\nIs\n\n\n\n\n\n\n\nAll right everybody in the car let's go [noise]\nWhat are we going to do first when we get the ... go for a hike sure if you want what about doing it would go canoeing to\nSee what might a bike right\nNo I wasn't fish oh I've never been fishing honey reach him do it all how long does it take to get to the forest it's not is it going to be long known that it takes forever [laughter] it's not that far\nWe're here oh really no\n\nThe short drive from your neighborhood to your nature how does it discovered the fourth dot org to find a neighborhood park or green space near you also find fun activities to do like boating and biking or camping and hiking last much more it's All right in your neighborhood\nBack here on the on the radio that last song there was a double in disguise by the dam and just before that was speak up a double by the misfits and Mr Crowley by Ozzie Osborne from the album the blizzard of odds continuing with the uh\nThe devil related in a dark go scary stuff theme of the nights are are moving on to the rubber ... worked in heat with the devil chasing me it's a good ... hope you enjoy it to this is Matthew when you were listening to the and the radio on W. I. U. P.\nF. M. had to switch up there you know every once in a while\n[noise]\n\n\n\n\nReally [noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\nMm [noise] Mm [noise]\nMm\n[noise]\n\nThe long run\nMe on\n[noise] [noise]\n\n\n\n\n\nYears there remain he needs to complain or did he grow but it was determined to start a hell of his own where he could torment the soles of men without\nBeing chained in a prison than\nSo ask the lord if they had on hand anything left when he made this land the lord said yes there's plenty on hand but it left a down but the Rio Grande\nThe fact is a little more of this stuff is so poor I don't think you\nCould use it as a hill anymore but the devil went down to look at the\nTruck and said if he took it as a gift it was a\nBar after looking at over carefully and well\nHe said those places to drive her tail\nBut in order to get it off as planned the lord promise of the devil go water bill and\nSoul Train was closed indeed was given the lord going back to his home in heaven and the devil says now got all of us need\nTo make a good hill and he succeeded he began by putting farms all over the streams\nYou mix except the slammed with millions of leaves the scattered tarantulas along\nThe road for ... like from the horns of the Texas\nThere but in addition to the rabbit series put a little devil in the Broncos\nThe in laws in the in the sun to be\nThe rattlesnakes by to the scorpions things some is needed the lights you with this buzzing wings the San ... there and saw the ads and if you sit down you need to have sold on your fans\n\nDa\nDa da\n\nDa\nDa\n\nDa da da da da\nDa\nDa da da da\n\nBut [noise]\n\n\nI'm Amy Goodman says democracy now your daily grassroots level I didn't met in international independent news hour\nW. I. B. M. band now airing democracy now from the week Monday to friday than my pm on your own WPN Ninety point one\nTune it you won't forget [noise]\n\nRock and roll I haven't\nNurse in in in the early Nineteen fifty it was called rhythm and blues\nYou couldn't hear those jumping sounds on the too far from you had to go to the in the bag I like to join the each week point is just listen to show that came before rock and roll using the\nCatch on the all night cafe Monday Mornings at one point why W I use the FM\nHere on the radio that last song there was I put a spell on you by screaming Jay Hawkins it just before that was evil by Howlin' Wolf\nBoth great great songs I'm a sucker for the blues and uh if you are also a sucker for the blues you should do in a to the show that's up next at one o'clock is Judy in the back or by Matt the cat tremendous Joe dude puts a lot of hard work into his program\nPromote things that are that are good you know that's why I play the music I play 'cause I 'cause I like it\nAlthough I was joking ones that maybe I'll do a show in play nothing but really really bad music or just to make fun of at the entire time but I might end up losing in my mind if it's just me might have to have a guest to do that we'll see we'll look into it\nAlso uh look for a promo for the show to be hitting the airwaves soon almost finished with it and a\nHope you'll enjoy it it it it's a fun little thirty second from you know\nSelf promotion of what we do have just actually won last track tonight going to be hitting the host rock realm you know I Love it I play it all the time or just by ... by the Scottish post rock band they are incredible if you like post rock oh you should definitely check them out and you check them out anyway 'cause they're great\nAgain the song or both the band is McGuire and the song is called ... fear Satan\nAnd are gonna be the last song for the devil is evening it'll be all had a lot of fun ah tuning in I Will see you next week at the same time eleven PM here on W. I. U. P. F. M. and as I always liked to say at the end of the night goodnight and good luck\nThis is Matthew and you were listening to the end of radio on at W. O. U. P.\nOr refer to them I don't know what that was enjoy the devil music\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\nAnd you were locked onto Ninety point one W. I. bam Indiana, Pennsylvania [noise]\n[noise]\nYou know what goes on and do you find in the\n[noise]\nThe cat's gonna show you want but it's not an issue in the back\nOr have cast incurring kittens I'm at the cat and your jukebox operator and this week the old rock ... boxes jumping with Nineteen forties and fifties rhythm and blues it's just so that came before rock and roll\nWelcome to the shooting in the back\nThis week I'm proud to dedicate the entire show just some great rhythm and blues looking looking late by one of America's suddenly heroines Camille how hard is it is often thought of as oil range handle the man she was a great recording artist in her own right\nWe'll explore some of her early records with boy\nDidn't jump job well with Camille our [noise]\nShe was born Camille Agnew rounding on march twenty nine Nineteen fourteen in Galveston, Texas\nShe stayed in Galveston working on your piano technique until the middle of World War two when she headed out west to make it in Los Angeles [noise] at that time there was a great migration of Texas started cutting out west because\nPeople in Los Angeles area recently found more money to spend on night clubbing thanks to the moon cause by World War two after playing around town for a bit she hooked up with drummer oil Camille Howard\nRoy Milton and Jose is\nMade up the ... the tree that played trumpet [noise]\nThey recorded a couple of times for Lionel Hampton\nThe fall of Nineteen forty five\nGoes looking to start his own label jukebox read\nThe label launched in early forty six\nAnd a newly re names sex that boy Milton and his knowledge centers was the fourth release on your thoughts record their first recording sessions for our group which held on December twenty second\nNineteen forty five at radio recorders in Hollywood, California [noise] boy melting play drums saying leave Jose it's apples on trumpet earls Denver played out says that well buddy Floyd is on tenor sax David Robin plays bass and this week speech or a Jew combat\nCamille Howard is typical in those hybrids and man just dig the licks she's laying down\nOn our end blues would hit number two on the race record charts and put Roy\nMilton and his solid Sanders at the forefront of rhythm and blues but on record and onstage it could be argued that the real star of the show was\nOur and blue Mm\nAnd [noise]\n\n[noise]\n\n\n[noise] um\nYou know\nRather\nMm\n...\nNow I go to [noise] do do that [noise]\nI find that now\n[noise]\nReally saw the\nReally want to be\nSomething bad will send you know you ought to\nKnow I Know well the thing is that\nMe and all that\n[noise]\n\n[noise]\n\nThat was the beside of drew ... which was only ... third release for our troops newly renamed specialty records\nAnd at this early date it's obvious that they knew there was something special about our feature Camille Howard they name that zone cooked meals boogie board as it jumped\nUp next to the tune that would be a game changer for Camille Howard thrill me in Camille is singing the lead on this one as well as playing\nIt was recorded on August first Nineteen forty seven at universal recorders in Hollywood\nFor lap cat is laying them learn to send them back\n\nSpan and new\nTo new I Wish she knew the movie that I mean\nI can have you know why can't I Do I Am still\nDraw you all do who wants to\nKnow why would get\nNow man you know happy he died of sand and\nWhy during kissing you know\nWhy this new law cannot do who\nYou can have you\nToday we're rainy and every\nOne of her and I\nLove his carry oh\nHi there my chances\nAre you oh I don't\nKnow if I didn't know you know by the king and how it began and there's no time in and says\nHave no strengthening this can't be bringing in the mood I mean\n\n\nNo body oh no ... by\nKay how again ... you can't I have\nNo friends you just can't you mean the nude I mean\n[noise]\n\nIt's weeks feature on the joke in the back\nCamille Howard\nSounding as comfortable singing a valid as she does playing that up temple boogie woogie piano\nThat's the mood I'm In released by specialty records in April of Nineteen forty nine\nI'm at the cat and I hope you're enjoying this week's Jews in the back\nFeaturing Nineteen forties and fifties rhythm and blues spotlight ing Camille how\nWe began the program by showcasing her work with Roy Milton and his solid centers but even now as a solo artist she still playing with Roy milk\nAnd it's the solid Sanders backing her up on all of these records up next we have Camille Howard's second charting record\nSurge hurting song\nI say third charting song because on her first single both sides charges\nThis one was caught on January twenty six Nineteen forty nine and features Camille Howard on piano Roy Milton on drums and Dallas smartly on base [noise]\nSpecialty records issue the single in July\nTo an old Mexico [laughter]\nWay you what do you do if you're not just that you'll see the last July now\nTo die do you see I Know that you can go now Han do understand like do you go\nWhen he makes you feel like you know start to have you don't like getting in his during the day he total and you'll do love to do with the way I Do not as though do you live you\nKnow and plus the Dutch deserted street is dying and they do they know who he falls to the moon no any job will like need to know them and you do what we call the big no no no he told\nLong long term [noise]\n[noise]\n\nBy like they do they know what man he helped to develop a\nDoll but you know we dig up but stay in your body does do people really need the money if they asked if he can't get\n... ... ... ... ... just to get in any in the news is ... ... ... [noise]\nAnd\nAnd the manner in which the\n\n[noise]\n[noise] ... ... ... ... ... ...\nVery nice man what a great instrumental that's\nOwes sold a meal Camille Howard trio\nNineteen fifty that's right around the time that real Howard\nRolling hills and and it's solid Sanders for a brief period\nSo on this record for a trio consists of Winston Williams on base and Walter burden on drums\nAlso I Believe on that record the trio was actually a quartet with ... Cohen on guitar\nLikewise for that short time apart Roy Milton would hire Willard McDaniel to\nVery solid sender [noise]\nBefore you move on with this week's shooting the backseat shrunk Camille how I'd like to tell you about a great opportunity coming up on a future Juke in the back show I'm planning on doing an all request a Jew in the back\nI've set up a joke in the back hotline that you can call at any time with your request and comments or the show just called eight one two Jew MTC\nFor most of her solo period though she was still recording with the solid centers and most of the time Roy melting was backing her up on her solo records as well that's the case in this one from early Nineteen fifty we have Roy Milton playing drums and Dallas Bartley playing bass\nAre stark Camille Howard is of course handling the vocals and the piano specialty issued this record in August of Nineteen fifty and it's this week's great Seventy eight\nTo Camille Howard trio with I'm blue [noise]\n\nUm do [noise] uh who are in oh\nYes you have to [noise]\nGod anyone can do lose [noise]\n[noise] I tell them no kids to share\nMy eyes that she was a cat I Do\nI Want\nTo add\nDid they say\nWhen you lose two mile\nA even it\nTo shreds\n[noise] because I was oh\nNo [noise] I\nI\nWant to do a ball\nDid he do they say [noise]\nSo my I\nHave it\nMan yes um\n[noise] well\nThat was red blue\nJobs you know oh I Love this would well can I Do\nLove you\nThe da da da da da da\nDa da du ... when men decay\n\nExcite me dead or\nThan they\nIn on the\nDay to day I don't\n\n\nLike\n\n\nMight say they say\n\nDon't know why but\nYour body and\nThat you know why don't\nKnow\nUh when you're all gold he could be\nYour town and she made me about\nDa na na na na na na na realm\nHave to do to my op ed ran a nice neat and around dawn on me the theme\nHave been the country I Move\nAround and beat you to watch\nChange way without lack clowns\nBaseball bat Iran you are a lot of bad\nKnow\nFive new Camille Howard spinning off the\nMale voice is on their record but I talked to believe era and he thinks it might be Dallas Bartley is the only cat on that session who was also a singer and since Camille in Dallas hadn't worked together before there's a chance he might have been the male voice on that song\nCamille left art group and specialty records in March of Nineteen fifty three and signed with federal records\nFederal only released three Camille Howard single the one you just heard are you losing your mind was her third and final singles single label the song you heard before that excite me daddy which sounds to me like a takeoff on Ruth Brown daddy daddy was issued in April of fifty three\nNow even though Camille Howard was gone from specialty records she was still touring and packing them in with Roy Milton and his solid centers\nHer records were really selling but she was still able to sell out live show you can definitely hear the different direction Camille Howard is taking on these federal [noise] and I guess that speaks more to the overall shift in the sound of rhythm and blues music during this time\nAfter the three federal blobs she continued to or in the Nineteen fifty six she released one solo single\nThis song businesswoman was written by Percy Mayfield who of course wrote many great to instill Ray Charles like hit the road Jack and two years of torture\nPerson he was also started his own right scoring a number\nOne hit Nineteen fifty would please send me someone who loves\nHer specialty it turns out business woman has won a Camille Howard's losing his record it but that however sounds like a cop out\n[noise]\n\nMan [noise] boy outcome I made you Marshall [noise]\nThe past is like a funeral gone by the future comes like an unwelcome guest\nImpenetrable impact and global future as the song says\nWho knows what tomorrow will bring [noise] would\nYou like to know the rest of your life has not been printed however if you like to ask I sort of publication preview the purpose of the next hours to make you think about it are you sorry you're married me\nWhat kind of a Christian and ... and Jen how here at any given time\nI feel most of the time\nThe time I ... tell me\nWhy don't you do something about\nWhat you mean to me\nDidn't ... you want to talk about divorce now I've got to\nPay Gretchen\nYou should know have to burn the [noise]\n\nYou know ... drama tomorrow's murder was written especially for the ... theater by Sam than many stars Robert\nDryden is sponsored in part by sign off the scientists medicines and Derek motor division I'll be back shortly with that one [noise]\n\nNow the suffocated cities cry for Greenfield\nTall trees and how few\nOr the lush and certain places\nWell do you do have more than the city memorial park which quite frankly is a cemetery\nWhen it was laid out ... years ago it was on the outskirts of town ... grew up to around and\nMore and it is now surrounded by officers shops homes apartment people go for walks along this broad pathways restaurant you mentioned and why not Mm shouldn't it\nPlease the dead played host held\nCase star bright usually has a relaxed and leisure they strolled memorial park right after much and as he walks along a rather\nDressed gentleman speaks to beg your pardon me I'd probably were like oh I don't think I have one because I stopped smoking I Oh yes yes here [noise]\nPizza Hut Oh thank God for really kind of would have refused you're what you're doing after\nAll there is I Know I Know\nI'm afraid I don't have enough character to break that habit I'm Sorry I shouldn't have said anything after all an a perfect stranger as much as he only strangers can be perfect friend was we know all too well [noise]\nTo come here often yes yes my office is right across the street [noise] delightful place for a bit of\nFresh air is one of my favorite holiday too [laughter] or is that a proper word I don't believe I've ever seen me before I have a hobby so I don't suppose you could call it a hobby exactly what is it symmetry sculpture\nCall tonight the type of thing you want to collect so for that matter cemeteries sculpture has [noise]\nLet me think about it it's the most troubling form a sculpture there is yes I suppose that it's an odd for them not to be just fine\nNow that you mention it I [noise]\nI've never really noticed is at all not money much noticed the release\nMeans Chris you've opened my eyes or an entirely new thing not all of it of course there's no boy they do their you encounter a gym is what I'm doing human huh this tombstone cars and the proportion\nOf simple shops cook stove what\nPerfect balance the delicate cool a long list side top [noise] almost to the green light and others and yes I think so precise queen slowly [noise] tell me who seems to ... Gerald ... lions\nBorn April twentieth Nineteen Seventeen died\nJune fourth Nineteen sixty nine years and look [noise] where [noise] just a few feet over this way and almost a decade ago still needs even better obviously the work at the same stuff at the same delicate line was the same human foolishly name\nThe dignity name on the tombstone is kid reads [noise] star bright [noise] that's minor [noise] that's me [noise] you go to the vet\nSaid that's my name is Harold Kenneth Starr bright [noise]\nThat's who I Am with obviously is used to go into the tennis star bright born July first Nineteen thirty seven [noise] as I say well died [noise]\n\nInteresting [noise] died march Fifteen Nineteen Seventy eight Fifteen\nScientists who have [noise] I [noise] I don't understand much his teeth Nineteen Seventy eight\nIt was presumed mistake\nMy name my exact date of birth [noise] to the day my dad [noise] five Fifteen sizes [noise] ... yeah I'm going to die\nOver there must be some explanation why are [noise] are you All right that's my [noise] I chose to stop [noise] it was ... somebody go look good ones [noise]\n[noise] yeah it's neat questions for Dr ... at the hospital and get to ... to stand with my parents insane to a lawyer pot was\nHigh ... [noise] because I was terribly frightened well honey you're saying [noise] [noise] I was walking along and memorial park such a lovely day what good frightened tunes stone [noise] ... [noise]\nMy [noise] I saw my um tombstone how\nHow do you know a great deal I can still\nHad my name on it Herald cannot stop right oh that could be more than ... had the date of my birth and the date of my death how could it have the date of ... gas you know it's ... it's the day [noise]\nHave tennis star bright guy march Fifteen [noise]\nNineteen Seventy eight how'd you need wrap conceit catch some sleep\nIn a year I'll be dead diving wider range of a nice ring and tell her I'm leaning that I'm taking you to that cemetery and I'm going to show you that ... you're not well I'm perfectly All right it's just that I'm I'm scared to death you'll feel better tomorrow morning\n... oh I'm getting dressed I'm taking you to that cemetery hunting there something wrong with you that's why you have to see that who was telling that will convince you that there's nothing wrong with me All right\nLet's wait till ... stone and had to look at you know I don't want to see him what happened between you and ... why they sat in his skin I never liked him you never know but you get together you fully together for me I like it now I Know something's wrong\nThen continue against tank I don't know why use so worried about France all of a sudden why don't you onto my question\nI have more important things to do right now all the most important thing you have to do right now Israel right I'm ... Harold I watched this the residents been telling me you got upset over some tombstone\nWhy why because it's mind\nOh did you order one night some folks do you know he's not laugh track what's bothering her own\nPark you'll see your tombstone\n\nIs that he got in a I'm not hungry now France says you have to have a head and several die [noise] new in the eye and Fred Wehrey kids together [noise]\nSorry I didn't marry Fred Fred never asked me well that's reply that raises more questions than answers [noise]\nWould you have married friends [noise] I marry new\nBecause he never asked you must pose he had asked you a student not for your answer then\nHow do I know my answer was banned all I Know what I might have been feeling or thinking or dreaming about it that exist law how is it too much to expect a simple answer you suspecting fat and me I've had in fact one of us had that to what is the purpose of this inquisition\nI only ask you a very simple question no lack of very complicated question a loaded question a question no man should ever ask of his right to know why should ever after her husband why not\nFor you ask if I was sorry I didn't marry fed what you really meant\n[noise] would I Do all you\nCan print it out of time and time just as there are times when you're ... you're married me in that way with many married people put all on us married people [noise] why don't you have your breakfast and go to your [noise]\n\n[noise] oh yeah sure didn't shy becoming [noise]\nAre you are wanting to see me Mr Johns sheer joy ... average share his shift you know and actually read no no thank you know just write your smoke as you go\nWell I have a good day is a bad day joy oh Gretchen\nSo you will have to fire fire man [noise] I watched ...\nFire five men [noise]\nI Can't cover the territory no man you know the rule you pay five percent for say ocean our sales volume down show we ingest\nI'll tell you why I sales volume is Don we took for quality out of the products are what we did wish to invest a certain amount of manufacturing money and promotion what we did was try to fool the public and unfortunately\nWe are and who pays for it\nNot the big wheels who stupidity as responsible about five little guy around the world wars than ever to shut you understand you're going to need these guys will have to make more calls on the news just to put more fire just give me five names how can I run my department\nI'm short hand is now I was totally French Way to savings or Seventy five thousand dollars but you can't do it\nYou can't destroy the sales department this company will go out of business narrow you are becoming a fanatic whatever you want to call me I built up the best sales force in the industry unfortunately our volume doesn't support that statement if every other department put out the way we do All right\nYou've made your state\nFor that is usually become ... where we are now\nHave you give me the list the names pretty [noise]\nYou want to fire five men [noise]\nI'll give you one name and that's all [noise] it would start with Harold Kenneth Starr bright but thank you I was hoping you do that\n[noise]\n[noise] you know\nWhy you you\nAnd I [noise] All right\nI'm hockey was designed to stay\n[noise] is uh [noise] that [noise] but I was doing [noise]\n[noise] [noise] [noise]\nUh [noise] uh I'm I'm I'm All right\nSure yeah [noise]\nYou're very kind a just a minute man I I Wonder if you could do something for me this tombstone right over here [noise] would you read what's written on it\n[noise] [noise] [noise]\n[noise] [noise] I'm curious to know what to do as much [noise] Nineteen [noise] to me here\nThat's what it said [noise]\nShe\nDoesn't something strike is a bit strange\n[noise] no [noise] I don't see how that\nDate march fifteenth Nineteen Seventy eight who pointed that [noise] it hasn't happened yet and won't be march fifteenth Nineteen Seventy eight for more than a year\nPlease excuse me coming out now how many [noise]\nAnd [noise] one friend told me what time is right [noise] third time I have a tense situation with Jones\nI see my two stuff [noise] and that's what it is [noise] that's all it is [noise]\nI'm not going to panic [noise] just not going to panic\nA little bit later now a loose and but number the gentleman Harold encountered at the beginning of our story the one who caught his attention to the tombstone in the first place at the end of that one I said I Will tell you more about him and I\nToo well I just didn't get the chance we will definitely hear from them again enact three which actually bring you in just a few moments\nYou've never had a really exciting car Eddie on because you've always felt that she needed something a little more down to earth\nBut you still want that exotic car don't you know what you need to do it the guy on small these six powers you got a hatchback that down to earth\nBut with things like buckets seemed to have an above five speed nine year old transmission and laid back a lowdown style like man it's not exactly plain vanilla sky how are you need an item born\n\nToday then Seville Kentucky died wiped out by a devastating claim that breaks down immunity to any disease tomorrow will be diminished in central California only the deadly messiah knows why Lee\nThe messiah from Avon paperbacks one novel you will be this year is that we are like depended on it and maybe maybe it does [noise]\n[noise] [noise]\n[noise] [noise] [noise] oh my God [noise]\n\n[noise] on\nThe phone to infiltrate everything else in the army is for him for information about opportunities in infantry contact your local army representative listed in the yellow pages I'm rooting [noise]\n\nSeeing they say is believing\nWhat you see an oath to pair of eyes ever see the exact same image and the first place we see what we want to see it in the second we can only see what we can physically register on our own more or less been perfect guy side the situation as you can appreciate is that\nTalk with possibilities how bad was it but Jones\nHad was the maximum the ultimate I'm Out ...\nI'm Sorry I had to leave place was destroying may may may doubt my wife and my best friend and they believe my life was finished its not Harold costs that\nI didn't find a better job tomorrow the way to talk now I'm sure if you go back to the cemetery now you will see the tombstone either well [noise] I might I'm\nThan parents [noise]\nWhy does he read it to you and not to us because he knows how broad you are with ... here postcards why did you talk show so spooky to that total ... because because\nBecause [noise] it wouldn't believe it [noise]\n\nAnd I\nThought you shoot we should be doing his name drone [noise]\n\nOr hang out here you go out [noise] parents parishes can chicken [noise] much around there's a haircut on last than\nAny well Simon too much long [laughter]\n[noise] I have found\nDarling I Am as Dr I'll sign the death certificate who's gonna find anything are you in your ... ... ... ... [noise] well first give Freddie yellow drink\n[noise] I don't know we now\nKnow that I get each of you know a little shot [noise] [noise]\n[noise] [noise]\n\nMorning officer during the day\nAcross the stove or work about Harold case star bright born July first Nineteen Seventy seven on march ... Nineteen Seventy eight days I was involved with those\nMurders because in the papers [noise] it's been dumped ever since he lost his job must be over here one day he does have fears is ex boss when they come home and shoots his wife and her boyfriend\nSo tragic thing going on at chess and that would extend it was dying and there's some kind of disease nobody could figure out just to watch what to do it because [noise] it was just as well as long as you're right about just go down in Denver get noticed\nNoticed this kind of thing before with its ability is\nThe one just over here to the left of it that's even K ... pressurized magnificent assure his fish [noise] Richard ... the bar November pundits Nineteen forty diet\n[noise] hey\nThat's my that's my ... the water is probably a coincidence died of study Nineteen eighty [noise] found out\nAbout this country and the nature [noise] almost two years from now\nMy tombstone officer officer or you want ... I was told\nI told you we hear from that gentleman again and that perhaps I'd been able to perform mobile service for all to be able to do ever find yourself in a cemetery for any reason other than the old\nRadio mystery theater was sponsored in part by Billy ...\nIs the Moscow inviting you to return to a mistake\nOr another adventure in the ...\nOn to like [noise]\n\nHow's the young teenage boy I didn't even know what I see them like how do you even spell\nA few years later I heard that are friends cousin's son had been diagnosed with autism I still\nWasn't sure what that really meant when I went to college my roommates brother had autism when I moved to the city for work my best friend called me and told me his son had been diagnosed with autism we were both in shock\nI still remember the day I walked into the house and salt that look at my white space I knew something was wrong\nI'll never forget how I felt when she said our son has autism\nAutism is getting closer to home\nToday one in a hundred and ten children is diagnosed with autism that's a six hundred percent increase in the last Twenty years learned the signs and autism speaks to die to work\nEarly diagnosis can make a lifetime of difference Rajiv by autism speaks and the ad counts\n\nI haven't seen in my\nKnow all these guys are standing\nDo you know the the the cheese\nIn trends maybe\nWould tell them to read you\nYeah the\nLast mission to living in misery in\nYeah\n\n\nOh but why\nDo in the long term I don't know why John and by the whole ball of\nWe do go by\nDon't really know what they make me on my bed regard no I Love Ben Ben\nRead that you know that there is\nI mean I'm a little joke will come along well\n\n[noise]\nUm\n\nUm I don't get me wrong he's serving Allegheny Armstrong\nBay Indiana Somerset in West more than ... we are the regions alternative so\nThere'll be you'd be up in India\nYour to your drills wind old trying switch jobs in the late nineties radio guy ...\nFrom a WFL UPS themselves studio we'll we'll do vital traction ... hours a lot of progressive rock a lot of psychedelic rock and a few other things thrown in as well I Hope you'll stick with us during the second hour we're going to have a small many tribute to Marty balance\nOne of the Jefferson Airplane foundation passed away a week or so ago up put on about six or seven songs that he wrote and saying you're pushing their money\nIf you are a big fan of rainbows end if you were a big fan of cowbell\nYou're going to love this next\nYear is mountain\n\n\n\n[noise]\n\n\n\n... ...\n... ...\n... ... ... the ... the bull dog would do in that case the issue\n...\nNew ...\nShe's a\nReally in the book\nIt's just so that they know where that is\nJust the way to the\n[noise] but you know the the changes [noise] the main [noise]\nWas [noise] a new\nStore ...\nAnd then\nThe wind\nBlows up the little girl that's what they say it's\n[noise]\nAnd I\n[noise]\nHe\n\n\n\n[noise]\n[noise] [noise] Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm\n\n\n[laughter]\n\n\nNo [laughter]\n\n[laughter]\n\n[laughter]\nMm Mm Mm Mm Mm\n\n\n\n\n\nRobot ramble\nA bird\nSo\nFind a lot of rain\nDreamer in Maine\nAnd answer\nWarm days\nMore than one\nMain thing that they\nWait a minute\nFrame or da\nDa da da de\nAnd then the bird\nWind day [noise]\nIs that is leading\nMine a while and then\n[noise] Iran\n\nAnd that rubs upset number one here on vital tracks we heard Kermit the frog finish out that said with rainbow connection before that a band known as rainbow or get you can call it Ritchie black Moore's rainbow did a song called catch the rainbow\nRainbows all over your blues that was done by John Sebastian\nShe's a rainbow that was done by the Rolling Stones neon rainbow a box tops did that song force and to lead off the program today we had mountain from the L. P. climbing and they performed a song called sitting on a rainbow [noise]\nThis is vital tracks on your alternative source W. I. U. P. F. M. Indiana if you'd like to get in contact with us for any reason the best way to do it is to send an email too late night radio guy and Gmail\nDot com I'll be right back with yes Campbell and the moody blues\n\nI Know my I think ... are getting bigger\nAnd have you on the\nOut of every character start burning\nThe families you just mentioned great\n... that that the America got to get\nOn your local say thankfully heavy jelly you generally have survived that in their second like struggling\nFeeding their ... year by getting ... and I can't\nFight hunger and sound western Pennsylvania and you'll find your local food bank ... visit leading America dot org that's Feeding America dot org\n\nYou work do did track on [noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\nYou\nYou're\nIn\n[laughter]\n\n\n\n\n[laughter]\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\nDe\nA\nAnd\nStory and you're right that was done by the movie\nPerform their only song that ever made number one on the church it was called owner of a lonely or\nA take time out now so that I can put on some promos or some other programs that can be heard here in W. I. U. P. when I come back oh had the Jimi Hendrix experience renaissance and Jackson Browne\nW. I. U. P. F. M. continues its tradition of unique programming with the musical bucks every Saturday from ten pm until midnight tune in as David resents any ... mix of down tempo depots\nElectronic a trip off and war that's the musical bottles Saturday at ten pm [noise]\nJoined me every Sunday afternoon for rock and roll classic with the best in the seventies and eighties rock pop in the Sunday afternoon between three and six year old girl further [noise] W. I. U. P. up in [noise]\nMm\nHolding these through the mid sixties you know the good stuff [noise]\nI'm Jim and finding new joined me for the oldies zone Sunday at six PM [noise] two hours of some of the best music ever recorded verdict who simply right here on your alternative source W. I. U. C. F. M. Indiana [noise]\nVital tracks free form where you live [noise]\nAnd in\nIn there they are going\nMy brain\n\nThey\n[laughter]\nSure they\nDon't know whether\n\nMother\nCan't\n\nYour Dell then to W. I. U. P. F. them Indiana\nAnd then and then you know and I'm going to learn from them come back and ... ... [laughter] ...\nStranger he may run in mind the grid do\nHas not wearing a\nThey are and [noise]\nThat would allow the main guy dog\nOn a lake and I may not do\nSome um [noise]\n... no\nMy when I\nTo the sign the role\nAnd down that guy my dad and be down the law guy will be shot\nGood [laughter] [laughter] there was a lot of things I Do\nA lot of things about saying di da\nDa da\nDa de ... maybe [laughter] [noise]\n\n[noise]\nYou know putting the game not da\n\nDa da\nDa\nDa da da da da\nThat\n\n\nThat was Jackson Browne with a song called black and white that was taken from is lives in the balance LPN if you can only get one Jackson and brown lp that is the one to get excellent the whole way through we also heard renaissance from their turn of the car job easy track was titled things I don't understand\nAnd the Jimi Hendrix experience foxy lady that of course taken from the are you experienced all the\nWe're going to take a break it this time and when I come back I have a son that last a little bit over half an hour it's done by the flower kings it's called the truth will set you free after that track is complete\nWe will of course to take time for a break and then we'll come back with several songs by Jefferson Airplane that featured Marty Belanger his singer and writer\n[laughter]\nYou're listening to your alternative sources W. I. E. P. F. ... Indiana and everything [noise] it's I don't you [laughter]\n[noise] [laughter]\n\nNa\nNa\nNa\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\nAnd\n\n\n[noise] you\nKnow when\nI Know\nSend them\nThe guy\nLooked a little bit on the\nWord no no no\nNo change in a in a in\n\n[noise]\n[noise]\n[noise]\n[noise] [laughter]\n[laughter]\n\n\nMan\nI'm\n\n\nLayer na na na na na na\n\nNa na na na na\nNa na na [laughter]\nKnows\nA\n\n\nCD [noise] [laughter]\n[noise]\n[noise]\n\n\n\n[laughter]\n[noise]\n[laughter]\n[laughter] [noise]\n\nAnd there\nWill\n\n\nAm [laughter]\n\n\n\nTo do\nA\nAround\nTo me no\nMm Mm\n\n[noise] bang\nBang Amy [noise] [noise]\nGo to\nMy love is going to have you [noise]\nYou know\nHeard about\nThe [noise] [noise]\n[noise]\nWhen my dream\nSee\nJob not bad guys\n\nAsked the guy\n\nThe\nJob\n\nAs I get older\nThey say well you have\nTo\nAnswer that long ago I feel that's long been through the\n... and they\nWent on a clear lead to draw a line of this or\nYou\nKnow no and you wanted your dog got\nMe maybe they just you know\n\nI got a job right off\nThe chart\n\nKnow a\nDog\nWhat I\nHave another dog I saw\n\nYou in the\n[laughter] [noise]\nMm\n[noise] Mm [noise] ... [noise] really a brand new\n... has been with me no I thought that he'd been the breeze\nWhen I heard a lot of the load is a bundle no\nIs that he just let\nTo the shared their little job with a world\nDo you have to come\n\nCan I get on the job by the allied you know\nTimes\n\n\nGet away from them in the evenings I'm ...\nThem or wherever things again I think we are you're getting a ... hour long journey I'll walk of life would be but I mean they share a little you with a word\n\nI'm never kept\n[noise]\n[noise]\n\nRight right you have to see the heavy girl you know you were in the morning maniac music but we we yeah it's a new dog\n\nOn\n\n\nYou're a prisoner blame several songs that Marty going wrote and sang you've heard the song called volunteers that was the live version\nAlso share a little joke it's no secret and coming back to me will take a quick break says you can you hear about some of the programs that are available if we're listening pleasure hear W. I. U. V. and then we will continue with some more music from the Jefferson Airplane due to\nBreak from the ... the president and the union [noise]\nGreat music you know great music you don't know yet more more since Sunday simpler what's that what you believe that I think you can do a great deal of the old they knew nothing really are and the forgotten I went to ... all about thirty eight o'clock PM\n\n\n\n\n\nWe are the regions alternative source W. I. UPS them Indiana\nSix months from now I'm going to be a [noise] so there's one thing I Want to change about me right now\nI've tried before but\nI'll do it for me and the baby\nMost people don't succeed at first it often takes several tries the important thing is to never quit on yourself as a credit rating you dot org or call one eight hundred lung usa for tools in tips from the American lung association we support the quarter ...\nI. U. P. F. M. presents White House chronicle with low balling king Atlantic Esperanto Monday morning offering a discussion of current events and issues in the nation's capital and beyond from the political to the personal it's news and commentary\nJoin ... willing king and Linda gas ... for White House chronicle Mondays at seven AM Ninety point one W. I. U. P. F. at your alternative sort [noise]\nTo the old I guess that\nPlug your alternative store [laughter]\nWhat what W. I. easier than you did yeah they\n\nNinety One W. I. U. P. F. M. India\n[noise]\nBut W. I. B. M. Sunday Sam\n...\n\n[laughter] a trainer and a half an hour [laughter]\nAnd and you know\n\nRead [laughter] um\n[laughter]\n[noise] [laughter]\nNah nah nah\nNah\n[laughter]\n[laughter]\n[noise]\n[laughter]\n\n[laughter] [noise]\nWell that's a that's a group\n...\n\nWhen I was little boy was\nThe devil call my name but by\nWho do you have a little\nGet\nThe you know in the middle name\nA new mom let\nMe she no she\nThe doctor\nRead on the nuts\nAnd she's now\nDa da\nPay them you know [laughter]\nAnd [noise]\nYou see the bad\n\nWoman and\nNevada law yeah\nDa da da\nDa da da da da da da da da da\nDa da da da da da da\nDa da da da\nDa da da da da da da\nDa da\n\nW. I. U. P. S. and Indiana\nThe news\nI\n... and they knew\nI\nDoes this change in the long chain\nDo\nWell no no no no no and a gene\n...\n[noise]\nNinety but one W. I. U. P. F. M. this is the Sunday sampler you are listening to you right now I'm Mark Morris and thanks so much for being here it's old new familiar and forgotten all mixed together in one sweet cake or something like that\nSomebody's ... blog spot dot com it's where you can find some nights playlist new music you just heard from Amy man from her charmer L. P. featuring James Mercer additions and other assorted projects lately living a lie\nOr for that Katie tons stall suddenly I see the river and Peyton big damn bad before that with can't pay the bill\nWe heard a track from the kids soundtrack from the Nineteen nineties early starring future for Chloe Seventy\nAnd a Rosario Dawson the song nothing gonna stop from folk implosion Gomez with if I ask you nicely Paul Simon from there goes arriving Simon loves me like a rock and at the top of tonight's Sundays helper to co picky family banned some new music from them\nIt's called my way mark Morris and once again here with you until ten pm thanks for being here [noise]\nI'm any good and the host of democracy now your daily grassroots global and imbedded international independent newly sour W. I. UPS and is now airing democracy now across the week\nMonday through friday that five pm on your alternative sources W. I. Ninety point one FM tune it you won't forget\n[noise]\nAre moments when you think about what defines you mine lives in a moment when the doctor's office there is no game plan no one tells you what do you expect to have all the answers but when your child to have on this and they're few and says to the ad that's my family's across the country have come to\nThe project I Am\nDied or [noise]\nDuring the Nineteen fifties you couldn't hear rhythm and blues on the ... box in the Bronx [noise] did you hear all that down and dirty black who's the rock and roll you had to go to the ...\nIn for an hour each week will go back in time to the old I came before rock and roll World War two with them and lose that led the rock and rollers implosion\nOf the mid nineties [noise] you don't want\nTo lose Harris professor long half maybe Joe Turner burn Baker well in all the other heroes of early on in the back of the establishment where there's ... lore\nAnd the whiskey pillows like why joined me for the combat\nCatch juice on the all night cafe Monday Mornings at what a nice point one W. I. C. F. them [noise]\nThe Keystone repertory theater present Jesus Christ superstar the groundbreaking rock opera which tells the story of the last week of Christ life\nThrough the eyes of Judas scary at this event will begin June thirteenth at eight o'clock in the end of June sixteenth at two o'clock Jesus Christ superstar will take place in while their whole main stage and for tickets in advance you can contact the hub box office for further general information please call the ... theater department at Seventy four three five seven\nAnswer to\n\n\n\nTo be a\nTo be or [noise]\n\nThe\nOnly the land of\nAnd\n\nI'm not\nA\nA\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\nHe sees me [noise]\n\n[noise]\n[noise] [noise]\n\nDo\nThey\nHe did he still\nTo do this don't do\nOne thing to\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\nA big musical peace one listener at a time this Sunday's sampler with ... W O U [noise]\n[laughter]\n\n\n\nThe ... the need to pull\nThe leader there\nWas a\nWere you play\nYou know\nWhat I'm\n\nGoing to be your only again you can do\n... [noise] Mm\nMm\nMm Mm [noise]\nMm\n\n\n[noise]\n[noise]\n\n\nFor\n\n\nAll we can make\n...\n\nSo you might remember that at the end of October I UP hosted tend Tibetan monks who created and then destroyed a than mine to la and around that same time a man known as the walking ... also came through town\nI got a chance to talk to both the walking monk and head of the Tibetan monks that were here and as I said the latest podcast episode features so many monks\nThe walking monk ... ... talk and the episode among many other things about running into some hunters here in Pennsylvania\nSo it's just so happens that I was speaking of over the horizon a couple of a pickup truck ma'am\nThey pulled over and ... were just out here from being I'm Sorry we read about you in the paper and I take a picture of a civil or just or maybe you were intending to find a deer\nAnd what destroying it means after spending so much time creating it\nThat just to bring home the message of hope in prominence that not standing the beauty and the appeal of a sudden than it has to change it has to end someday\nAnd as mark with say you'll hear some real authentic lung sounds like that\nWho who\nWho for war or blue\nOr the British news ... ...\nNo ... no ... no ...\nWho's the\n... ... ...\nTo\n... um the movie\nIf you want to hear more head on over to a small town pod cast dot com you can also find me on Facebook by searching small towns pot cats and on Twitter with the handle at small town cats I Brittany their host at ... ...\n...\nMen pay towns are playing that battery down ...\nThink that the\n... man\nAge and\nSomething for everyone [noise] that sort of knew any leading to recover\nYou talk about these guys really made a lot of them when\nThe rally in downtown new change from a red either\n\n\nThey should do\nDie during the famous Dave\nNeeds\nFor the ... they made it a little ... when you're ...\n... ... ... ... ... ... ... ... ... ... road\n\nA male role\nJames\n\n\n\nDonald\nNice to see\n\n\nThey said they knew that I\nSee that he didn't do that at all\nLike ...\n... ...\nDi di di di di ... been going on\n\n\n\nRight\nIt would be a good old\n\nHave a favorite\nShe says he says oh\nDon't\nAnd he he he was\nHe will be [noise]\n... she wanted to bring in\n... and ... says back then\nBut\nYou know when the garage to mine which is\nAn ashtray and\nCan use\nUm you know you\nAnd gene oh\nOh\n\n\nLike to dedicate this on these two fellow sitting right here in the front row this is just for you I'm Still I thought I did the oldest one just about two years\nThe Holocaust humor strict new age you know and when I wrote the song I think I'd lead to more literally than I Do now although I still believe politically that deserving people will be buried alive added some ... some notes that would make it sound more like a cartoon\n... machine\nHas all of my gospel next and I learned when I was the church organist in reform school\nLike the truth I Swear\nThe only one I had their you know [noise]\nMm\n[noise]\nMm\nMm\nKnow ... or maybe just maybe you're\nFor\nA job for me to\nThe street and just the way they're going to be done I Would maybe make me not\nOn a show about guns and\nWe learn ... private ... ...\n...\n... the baby in England and\nWhile we\nWere getting a strong memorizing\nBut every day for\nAh you\nBe showing\nThe ... ... go to jail for\nAnd\nReal a real men a match\nThe line\nWait to speak on the\n\nSaw laundry all they have a ... chance his\nAt the gym or the ...\nTime and she joined the gym or ...\n\n[noise]\n\nPhone\nNo no\nHave any of the\nNo\nA call but on the phone call or\nBecause you know but I Do know trial\nTo row row row row\n\n\n\n\n\n\nWe do is just so used\nThe only\nPeople who\nGood like the news\nAnd\nThey\nDo\nMake them do do\n\n[noise]\n[noise] reading\nYou know and great music you don't know yet the Monday sampler when Martin Lawrence\nNo I\nWe\nThey don't find them no games mailed them them again that Jeannie [noise]\n[noise]\nGood morning could only\nBe mourning mourning germane\nOrders beginning\nYou're listening to your alternative stores ... won W by UPS bend in Indiana [noise]\n[noise]\nHello I'm what I'm getting the host the White House run at all or do they were going to look at the\nTry to in the United states\nAnd there's some sense that once we will more mentally months we'll and ... once we treated each other better whether this is true or not it's something we've gotten to examine I can say bugs me that I went through the divisions of the Vietnam War and we will not to civil in that period\nI have had to a seminar at a panel of experts old them marvelously well mounted I can tell you\nWe had joined the caused by the co host of the program then the ... well ... yeah welcome to the world ... and I'm very glad for the first time to have on the broadcast but I Hope not for the last time a\nEllen Rosenberg who's the executive editor of the Providence Journal\nWhich is half the leading in fact the only state wide newspaper in Rhode Island with an influence in all of New England the Providence Journal very respected regional newspaper\nAnd I'm also delighted to have Steve cast abroad cost her a lot of experience talk show host a man about the world traveled why is thoughtful or I Hope you're on your game today and very part\nAbsolutely oh romantic it's caused a mountain as hot\nLet me ask you then Allan or do you think that way rooted than we have been using the current political situation is affecting us on how we speak country ... ... well\nI think it runs in cycles I I think as you said in the sixties things were pretty harsh I think uh in the civil war we weren't too polite to each other in this country I think if you go\nSome are precedents for a\nLot of times to stifle speech a harsh speech that President wanted to outlaw [noise] ah but I think over the last several years the cycle has swung back\nTowards a polarization towards instability\nA and you see this in the political world you see this\nUh in the way people talk to each other online a ... and it's of course so easy to talk to people online as though they're not really people because often you don't actually know them often they're just faces at the other end and people say the harshest most awful things\nTo people they don't even think of as actual human beings so I think that there where we're at a point in the cycle where there is a difficulty for people to talk to one another and more importantly a difficulty for people to listen to one another\n... or ... ... ... using those and ugliness and the public schools that was not say ten or Fifteen Years ago\nAlso think that um civility and civility run in cycles where one of the cycles of incivility and I think for a lot of the reasons that Alan cited and one of the things is we've had [noise]\nYou know we've had to see how your way I mean college the Burger King I should [laughter] a society where\nEverybody wants to have it their way everything is me me my stuff I hear about my stuff all the time I don't hear that we anymore I don't hear people talking to each other I hear people trying to avoid talking to each other whether they're\nThey will call back if you call them or they will return emails people\nWe use guns you know settling scores but you know a lot of this is that we've lost the sense of the common we'll on I don't how we got that sense back sometimes it's in a jarring event that will bring us all back together like nine eleven I Hope something like that does not happen\nHere but but we've lost the sense that the common will\nI I think the current moment has sort of inverted the old principal or you know if you have friends don't talk to about them\nAh about religion or politics or with them because it might divide you now you want to talk religion and politics but only to people who will agree with you and so the people that you know who don't agree with you a friend of\nA mute them I don't listen to them so you can build yourself this world in which uh you can talk about it all day long because everyone is saying the same thing Steve ... how much of this if it's true it's a reflection of national politics and the president in particular\nWell that's that's a multifaceted question of there's no question to me that this whole electronic age we live in for you talked to one another where the keyboard rather than face to face is you know I mean it's just so we personal and\nIt's so easy to offend someone or if you don't say it quite right with the keyboard and that's not always easy people may take it a different way as opposed to looking at someone or or millennials are not communicating a at all of with anybody shouldn't have loved to sit home and watch binge movies for\nHer a weekend uh everything they buy seems to be online and even food now being delivered the by supermarkets so resenting already died\nAt the features President Trump because he has a tiger nice people he's castigated them he's used to the streets to denigrate them and the most unpleasant way\nAnd this is sort of given people had these thoughts and they feel liberated to express them to join in this\nUgly a snow do scores but this ugly vending if you will\nI personally think that man has a terribly important news they make things work and a lot of the truly great political leaders have used man has in fact John Cho was terribly upset when his son who Randolph castigated a member of the opposition party\nJudge will sit around and all he said but that man has been my friend for ... hosts he didn't agree with him and we have celebrated in history people who don't agree on\nI I'm I'm very fond of a very conservative\nCommentator Craig Shirley also a ... of them are here and I don't disagree but we certainly have a lot of respect for each other and a really good friends close friends and indeed and that was part of the system ones that you embrace people\nOne didn't agree with but it's a you had\nMade it let let Allan speak ... chimed at first and then all the time in on that\nIsn't isn't the wait for that matter man has food streets yeah how about when times are kept refined [laughter]\nIsn't the way President Trump communicates the logical extension of trends that were in place long before he ran for public office going back to Lyndon Johnson with the ad about how Barry Goldwater\nHalf of George Bush or Newt Gingrich throwing bombs in Washington to become speaker of the house and the more this kind of tactic works the more it's used a more it enters\nThe political realm so that you find ultimately an expression maybe not ultimately maybe it gets more extreme later on in the way Donald Trump communicates with\nAh and whatnot in dollars and the time to denigrate should not be as enemies that we have seen\nA recently are we going to get over this how are we going to get to ... Winston Churchill called the ...\nWell the pendulum swings and then it swings back I think at some point we will get over this but the question I think more immediately as ... will it get worse before it gets better ah and I think in the short term\nI don't see a lot of reason to think it won't ah the fight over judge Kavanaugh a is an example I wanted wanted vantage of a newspaper as we can put four or five things on the front page and not just ... judge Kavanaugh [noise]\nBut uh I think the uh you know the idea that are now one side will whip up its voters over judge Kavanaugh the other side whip up its photos of a judge Kavanaugh and they'll say that the other side is not just wrong but evil demonic\nMust be stamped out I think in the short term it's going to get a it's going to get worse Linda is not the case\nAnd Paul Newman's around the world we referred to be mostly honorable\nWho's who's an attempt should respect and that's what his level in\nSt remind everybody or are we going\nTo see some are joined respects the relation Trump said during\nA as you mentioned the drink to better Neal or or um uh uh some presidents and uh and the media or even\nWell under now and and I do remember in Nineteen Ninety seven there was\nActually a comical thing that happened up in Congress on and it was comical as an end sad that in the house they tried a bipartisan civility retreat they tried it a couple of times\nIt was really lightly attended a after Ninety four\nNobody really wanted this bipartisanship everybody was out at two went out to win for their side on and then after that\nIt was just a stream of worse and worse Ninety eight we had the answer is made of Bill Clinton\nWas the high point was probably to bone Neal and Ronald\nExactly what I said it was the Nineteen eighties where we really saw and it was founded on respect it was founded on ... but they respect you found that what it was about also is that you know partisanship is always been in politics\nBut it can coexist facility on that civility is something that it's it's got to return to the Congress somehow there's been some Congress members of Congress singer tried to bring that back there\nActually is something called the civility and respect caucus that was formed in January of this year on it was formed by to Ohioans a one Democrat\nGo to high school for instance and talking about civility and then take it sort of civility pledge and promised to do what they taught high school students they're going to do and I think it's their only three members Everett right now out of four hundred and thirty five you know in the house but it could be growing I mean things are really that bad\nBut we can't make\nRespect when I mean if people are not respectful themselves they Benjamin Franklin said that Congress should be a mirror\nOf the American people will make any sense we are very divided we are not respectful to each other and therefore Congress is is just in the mirror of that and there's no attempt by them really at this point except for these small towns to change it because there's no good for them and changing it\nIsn't it a situation where the live above ... drunk to know that ... but not today\nI think they're again they're intoxicated with with what incivility has gained them on and the thing is that\nIt could be it can be even worse I mean you look at people who might be a primary or if their primary because of gerrymandering or whatever it day it's something more extreme could come in so it could get worse\nIsn't to some of it to do in Congress should it was a decline of which\nThe ability to to to which leads to each other and to attach each other but humor as a\nAs a bird dog she was a monster that he was a great speech um remember the one of the floors Congress owns Oh yes or no February and somehow better communication through through so we call was CSPAN I shouldn't in life and I like to watch the news but nobody goes in the ...\nAnd those empty room or as really a ... it's very discouraging we don't have the sense that this is an important place where people come with great issues all being decided until we get\nTo some hearing which is highly controversial highly on representative of the of the protests of legislation\nI I I think that the whole boiled surround respect because what are multi racial multi cultural society we need respect we don't have to buy into and bodies opinion that we don't agree with that we need to respect that right to have that opinion\nAnd if we don't have that at the highest levels were no I think it's too much to expect her to the lowest levels\nAnd one of the things are important to them I was attracted to people who are very conservative and like the president they watch Fox News people who don't like the president watch CNN or MSNBC or whatever and I get three or four different newspapers every day\nBecause I Want to see the different perspectives from those newspapers and if you look for New York times in the morning the Washington Post then you look at the wall Street Journal you think you're living in two different countries\nWell I I was very interesting because you can gain from ... well that's true and if you tried to play it down the middle which is what we do at the Providence Journal do a great job with that program\nYou Steve I'm you hear it from both sides uh why did this headline said that senator white ... Senator Whitehouse is witness ah I'm Kevin should be believed and should get an apology well a headline quoted Senator Whitehouse\nNow now you're in favor of senator whites and I've got another one this morning why did you take the G O P tack in your headline today well that was\nAnd they think you're in the ... the highest I've been writing in newspapers for very long time and certainly and you also write because of the emails that you're more abusive\nMay people how to type a letter to you it's probably ... and they they did respect that you were trying to do something bad now it's just strange abuse\nAnd if they assume that George ... shooting the joke on seven um and I've been a ... and being both on the regular basis which gives me hope for myself\nI'm sampling that are that are you are among the star of the rights were among the left I tell the story and a short period of time I interviewed a for the dictator and she'll lay at the time I'm a ... and then a very shortly afterwards\nYou know ... in Poland\nAnd it could have been the same interview ... doing great job with the media has gone wrong the\nMajor is the problem ah we we we have to crack down on the ... do you have to get all worked out et cetera it's ludicrous about each true\nAnd I think one of the great tragedies has been the disappearance of mainstream media but also in lines generally as sort of planes to general concession of excellence and and and worthwhile but here's\nWhere I find help I write back to these people\nAnd I sometimes they listen sometimes you can get into an actual dialogue where you're hearing what they say and they're hearing what you say and you come out of it with somebody who says maybe you really are playing it down in the middle and maybe that's a good thing\nSo right I when I have the time drive back to them and I had to endure a little ...\nFollowed that seem you may be having the last word yeah so go ahead I get a kick out of the discussion about manners or do some government programs they're going to help parents teach their children manners\nAnd I'd have to look at this stuff or just shake my head because when we when we were parents and children what first thing we ever do thank you please all the you know all the right things to do\nWhere's that going I mean what's happening apparently this contracts right that is created this nightmare and made it worse right idea where all the time you saw I have to be rude and one of the law that your language like to\nSay is the audience thank you for watching and thank you for listening and please come back next week you can see us on Facebook and I teach at a little while and king to all the best shows [noise]\nWe've got to do something about this\nLater on the Allegheny Front when love turns into activism eighty five years on the river stay with on\n\n\nA new documentary Wade into the issues around the pollution and protection of Pennsylvania's water the film from point park university's environmental journalism program and WKBD multimedia and Pittsburgh is called downstream\nI was fascinated by the fact that Pennsylvania has more running water than any other state in the country except Alaska and that statistic eighty three thousand miles of rivers and streams and trust\nThrough some of the threats to clean water in a state\nLike acid mine drainage seeping from a band in coal mines industrial pollution along rivers\nSewage overflow when it rains and the lead in old pipes so as mine drainage as it was like a long term problem a lot of us who grow up in western Pennsylvania pretty familiar with those orange streams what did you learn about how these problems are being addressed in the process of making this documentary\nWe worked a lot with trout unlimited Pennsylvania has one of the most robust trout unlimited organizations in the country\nEven if you are not a very odd and fishermen you know you don't have a ... year drought\nYou should care about this research because the impacts of losing our child population is a signal that and there are impairments happening in our watersheds\nThey said something that struck me as profound they said when we talk about reclaiming streams are cleaning water we talk about success in terms of feet not mouse\nAnd I really had a respect for how hard it is to ensure that these impacts wherever they're coming from if it's industry if it's how we treat our own back lawns and the chemicals that we put on them I kept thinking the challenge of ensuring that that one foot\nIs going to be cleaned and then what we do to make sure that all of the other feet are cleaned\nSo a lot of us have heard about some of these issues like sewage overflow into rivers but seeing it as people are talking about it in the film really adds another layer of understanding even for someone like me who covers these issues regularly can you talk a little bit about environmental filmmaking as a medium\nIt's very difficult to make a film that's about the environment and our interaction with it because we don't want to stage anything we know information that we know a body of evidence exists but where do you find it and sometimes how long are you willing to wait\nFrench poisoning that we're basically experiencing with all the human waste with all the agricultural waste maybe I see one sure overflowing but was that a one off or how do I convey that this happens over time and I think the biggest problem on when you're trying to convey a long term impact\nIs we're not shooting long term so what is\nAccurate visual storytelling that will be accepted by an audience how can they believe what they're seeing\nI was actually thinking of it the opposite way that it seems like proof to me like you know you hear about sewage overflow but you don't really like know exactly where it goes or what it looks like you know that it just goes right into the river like you can actually see the portals in the film and you're like oh yeah it it's like a becomes a reality\nIt does become a reality and one of the things that I think it's hardest about environmental things is um\nThere's a smell to sewage overflow that we can't capture there's a vibrancy to being on the water that doesn't always translate to this show shooting it feels very different we were with a woman who swimming in the river's\nEven though our rivers are perfect we have problems you can still get in and enjoy the rivers and I wish more people knew that [noise]\nSo we made the choice to to be on the water with her but how could we be on the water with her and not have the motor boats\nObscuring our audio or and so we said okay how about a kayak well my camera guys going to ... how about a canoe so we had to Qunu operator so I felt that it was really important to be right next to her she swam in this water that people have such a fear of being and\nWe hear from researchers environmentalist citizen scientists and the phone and each of them have their own piece of the story you know each has a sort of call to action whether it's saving trout or inviting people\nJournalism tells people information that is reliable and has heart to it so we can understand the emotion not just the data\nBut at the end it will let them make their own decision and so if the call to action is learn more about when the water's clean and when it's not clean don't just write it off then I feel like that's a good thing that they could take away but I Hope that people become advocates for the water and realize that\nMy vote will matter in policies that affect the water and while I said in the documentary one of the old adage as the kept coming through my mind is no single raindrops ever takes responsibility for the flood\nAnd I think that we are that you know one person ever things what difference could my actions make with the water but every action is cumulative\nBecause unless your homes from the moment [noise]\n\nThe question that's posed by the narrator in the beginning of the film is well Pennsylvania serve as a clean water model for the rest of the country where will it settles for being a cautionary tale do you feel like you have an answer for that now or a better idea of the way things are going\nI met people who want us to be a success story and at the same time I am from the keys rocks I live right above\nNovel island ... has a lot of industry and a lot of old industry and infrastructure and I see a lot of people who think that there are short term financial benefits and the water can be sacrificed for them so I don't know if we'll be a cautionary tale that really relies on policy\nAnd putting those policies into practice and even coming up with stiffer penalties and laws that are a little bit more current because a lot of these\nClean stream laws and policies that were made around them for\nEven that step so they feel more like a tax for doing business than a deterrent for doing it again so I Hope that were a success story but you know I don't want to sound like the glass half empty person every time I met somebody who's doing something great you turn around and you see somebody his you know polluting the water that\nIf they just fought so hard to claim thank you very much for talking with me I really appreciate it I appreciate any attention people\nCould bring to the waters because it's it's what's sustained\nGina contends or ride is the writer and producer of downstream there's a link to watch it at Allegheny Front Don Oregon the film was funded by the Heinz and down in which all the ... the Allegheny Front\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\nIn water as a problem in Pennsylvania cities and communities and in many other places in America but we didn't talk about it much before Flint\nThe city of Flint, Michigan has become a symbol for environmental injustice largely poor majority black city where the public water supply became poisoned by lead after Michigan officials changed its water source to save money\nThe Allegheny Front Reid Frazier was ... recently at the society of environmental journalist annual conference and it got a firsthand look at the lead crisis there high rate\nJoining with water so Flint changed its water supply back to its original supply from Detroit\nThat had been using before the crisis and its replaced a lot of lead service lines those are the lines that go from the street to the house and frequently like in Pittsburgh in Flint they're they're made out of lead the lead levels in water have returned to below the EPA standards so that's the good news\nBut the bad news is even though the city's water is now technically clean many people still aren't using it they don't trust it a state of Michigan stopped providing bottled water earlier this year um they had been providing bottled water in these drop offs in sort of church parking lots around the city\nBut there are still these pick up location scattered around the city and when I we were driving by I saw one of them I'm with people just uh handing out cases of water and those are being provided through private donations\nWe heard from one resident of Flint tia ivory she said she takes a very quick showers because the water still gives her rashes and another problem she says there's a stigma for people like her when folks find out she's from Flint\n\n\nAlternative stories and Ninety point one W I use the Afghan Indiana\n[noise]\nNinety point one W while UPS them Indiana\n\n[noise] Mm\nMm Mm [noise] ... [noise]\nYou know the dangers in Ninety nine days on the day\nThe\nSuzie [laughter]\nCheck it out let go their\nDog ... does that\nIn the city on either side right on to city on\nA Monday and some\nOf the\nNa\nNa na na\nNa na na na na na na na\nNa na\nSide to drag on\nLine three and a lot\nOf money and pay the dad in the city\nDon't know how they draw the line rang on the on the eye to eye on the on\nThe right All right All right on the other day\nA dog\nHas\nCan\nNa\n\nYeah I Do and this is Joel speaking on behalf of Iraq\nIs so good around general right but don't drive home during the drug problem yeah I have a limo coming\nGetting an\nCommitted for them to see that the party came to the national association of broadcasters the council\nMan you know\nThe cops around\nBlock the\nThat you might be on\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\nMy name is Maria and I'm Alive today because I was given CPR last year by ...\nTook a class with the red cross after ever see blood from Jamal who gave blood after being encouraged by Margaret\nAngela who helped him all the whole family get the help and support they need and after leaving their home ...\nWhen we come together we become part of something bigger than a show like getting a bowl the red cross you never know how many people your actions will look back to get involved visit Red Cross dot org and the American Red Cross together we can stabilize\n\n[noise] [noise]\n\nLike saying\n\nArea\nAnd they don't die\nCould\n\nLot better than they have a\nAnd then\nAnd\n[noise]\n\n\nYou're listening to Ninety point one of them do what you are you be in Indiana, Pennsylvania\nA ... [laughter]\nDaughter is diamond\nDrama [laughter] than I Am I Am [laughter]\nI don't\nAbout you know about Rwanda\n... [laughter] problem dining hands and in our time out and buy [laughter] but do they\nShow\nA child and Bryan Thompson [laughter] rather than John I got a job [laughter]\n[laughter] I'm a\nCow and all that right away and you're just having\nA job [laughter]\n[noise] [laughter]\n\n[laughter]\n\n\n\nAnd do the one she's a\nDid he say they use the the they don't understand\nAnd I get the a\nMan don't say bad\nThe man when\nBe here and\nThey have they\nTry to I mean I read about in your own you know what you're saying you know you buy a\nTime to get a job but last year and certainly a try [laughter] do they have that and you know a guy\nNamed mile and a new mom let alone\n\nDiscovered they\nDiscovered the joy\nThe government's real\nRecovery bluegrass\nCheck out the bluegrass ramble Sunday Morning about seven o'clock right here on your I turned it appears to W. R. U. P. F. ...\n\nMom man yeah all my life long long\nLong man is rooted into running and I'm so I'm going\nOh my God yeah you\nKnow oh\nHey\nIs a man down from the gather that John\nReally is oh\nThey\nHad in my case\n\n[noise]\n[noise]\nThe man or a law\n\n\nAnd they end up in the day by day by day by day not alone\nWill\n\nDo\nThat [noise]\n[noise]\n\nOlder they will [noise] worrying and [laughter] you know\nA lot\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\nAnd\nDo the job but like Mad Men to\nInto bloom the brass\nOn to the ball John blew a\nAnd down the rule and the dad or\nThe brain\nDuring a mom and dad's garage\n... a new one\nThe details and my\nAnd by the\nWoman and it is bad and\nMad and have been\nYeah\n[noise]\nUm\nHear that the ...\nAnd the all the time when a\nGot in the bomb bomb\nLanded on your head yeah\nOf them that they want\nHave a ...\nTop ...\n\n\n\n...\n...\n... the curator bugs\nNa\nNa\nNa\nNa na\n\nA\n\n\nNa\nNa na na\nNa\nNa\nNa na na [laughter] [noise]\n\n\n[noise] a\n... a year but then\nAgain\nIn\n\n\nI had\nNa na\n\nNa na na\nIndiana's only public radio station this is Ninety point one W. R. UPS them\n... na na\n\n... ... ... ... ... ...\nKnow\nBad idea [laughter] I'm\nMan named\nThat the mayor\nHalf\n... ...\nS\n\nS\n\n\n[noise]\n[laughter] [noise]\nWhat do\nThink that oh\nEarlier high rule ha ha ha ha ha ha ha ha ha ha ha ha ha\nIndiana, Pennsylvania Ninety point one W. I. U. P. F. ...\nMy God you\nKnow I I\nDon't buy into\n\nAnd badminton during\nA man or a\n\n...\nToday\nAnd a\nOn that I'm\n... ... my ...\nName is June and everything but\nWe're all we\nDon't [noise]\nWanted to try to kill\nMy new\nNa\nNa\nNa na\nOn the\nBall\nThat\nHa ha\nHa you\n\nKnow\nI hear the ... go to nine\nYears so for me was first\nMoon that brings research\nTo me I'm just saying\nBoy that's\n\nAnd then that assignment man on a\nFaster rate is down\n\n\nAs big room but most of\nThere was running the show has given them enjoy a robot as\nYou watch the sun\nThe Braves down and\nDo they\n\nNa na na na na na\nNa na na na na na na na na na\nNa na na\nNa na na na na na\n\n\n\n\n\n... ...\n\n\n[noise]\n\n[noise]\n\nDuring the day [laughter] and now now now now that ah\nHow\n[noise]\nHang on hang in there and then it'll\nCamera\nAnd then and there has to be\nBit longer and then\nNow I'm I'm On\nOn\nNew\nYorker and move\nOn and on and uh\nNa na na\nNa na na na na\n\nNa\n\n\nNa\nNa\nNa na\nNa\n\n\nNo\n\nDiverse than commercial free you're listening to Ninety point one FM W. I. U. P. N. Indiana, Pennsylvania\n[noise]\nIf you long for their free form radio format of early FM radio we had the show for you it's called vital tracks the main focus is on progressive and psych raw\nBut you also hear a little bit of jazz folk country and blues I'm Jim I'm inviting you to join me for vital track every Saturday yet six PM and Sunday\nEditor Lebanon PM hurt only on W. I. U. P. F. M. Indiana your alternative ... [noise]\n[noise]\n\nThe amount of it yeah on the role\nThey could you imagine the station on [noise] when in my mouth out he began shall be ... [noise] it's against the law\nWas against the law I wasn't in my um [noise] it was against the law [noise] to nominate down as they don't look\nAt the time and they get to that John [noise]\nThey are taking my time but I\nThere to clean up the road with a million or earlier down by the yard and the man who\nAre now ... yards\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] well\nIn the coming days to come and take me away but the ... you know wasn't radical reach ... means all of them ... and I'm On\nOf doing all\nWhen I'm On my way in which they will take a hard time but I\nNo immediate holier down by the school yard which will be the man who we are ... yards the man who\nBy the issue a bitch [laughter] to make it\n\n\n\n\n\nMan [laughter] you know\nWhere to go\nIn line in their lifetime\nAnd and and\nWe were trying to do like a Herman will sit there you\n\nAh Bush and and and [laughter]\nLeave for a week or\nSyrian na ve brown ... um\n[laughter] dancing with the\n[noise]\nYou are locked onto your alternative source Ninety point one W. M. India\nYou're listening to you and you point won't W ... FM in Indiana\n\n\n\n\nAnd um [noise]\nWith those things that go on ... and\n... and John fine and dandy and saw the same Jang man being done and should make sure they treat [laughter] [noise] [laughter]\nWhy da da\nDa da da da da da\nDa da da da da da da da da\nDa da da da\nDa da da da da da da da da da da da da da da da da da da da da di di di di\nDi di ... and then in\nThe middle of the shows and movies and on and on and then to know ... ...\n[noise]\n\n\n\n\n\n\n\n\n\n\nSomething for everyone listening to your tentative stores are you from Indiana\nI Am a mother I Am I going to where I Am I'm an educator grandmother an advocate a leader I Am of friends I Am I Am I Am I Am I Am I\nAm I on line a more than a million people living in any in the rain right now\nI'm\nGetting in getting involved when we go to W. W. W. dot against aids on war for more information\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nYeah and you can ask three they run\nAround common now where I'm\nFrom Nashville\nNamed James Caan I Can't\n...\nLady told me that back in ... in order to be your best to watch and grabbing thing I\nReally do unto\n\nStop\nWatkins travel\nShops chanting anti\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n[noise]\nThis you know\nA ...\nYou\nKnow knows all too well\nKnow the jailers\nBeing\nDone in\n\n\nLike ... ... and all my daughter gave\nIt to\nChange news phone today from\n\nAnd\nDo\n\nYou know there's nothing to do with the mall\n\nAnd\nWe lost three\nLittle girls and back again and let it go on\nAnd a\nAnd get them to a nearly\n...\nA\n\nShe's been going\n\nNear and\nMan man\n\n\n\n\n...\nUm do you\n... a\nMm\n\n\n... na\n\nNa na na\nNa\n\n\n\n\n\n\nLounge in and\n\nThere was a non\nAnd hours and\nA ...\nAre now ...\n[noise]\n\n\n\n\nSee [noise] what you're told\nCoast time time against Iran do my job\n[noise] what you heard that made on\nNo no no no\nNo\n\nWell\nJust all the way\n\nO O our right oh ... oh no no our\nBank and a little bit more\nThe well oh because oh\n\n\n\n\n\n[noise]\nAn hour or ... or ... or ...\nYou don't have enough you know how to react to their asthma attacks here's how to prevent them visit WWW dot no attacks dot org or call your doctor because even one attack is one too many parents are Fisher no art brought to you by the EPA in the ad council\n[noise]\nMm\n[noise]\n[noise]\n[noise]\n[noise]\n\nDown\nHere and many many many leading and dance and\n[noise]\n\n[noise] [noise] [noise]\n[laughter]\nAnd [noise]\n\nThe\n\nIn the news media is\nLong and you know and and maybe ...\n\nBody will do the world\nDo they have they been doing and she\nStanding out\nShe had in the back beat the now because you don't go\nPlace and they pay you called up the bundled up now wait to get the media message back to get by judging by though in the light but just like he didn't really want to keep your mouth ... well not bio help out your\nLook at it and I'll never get bogged down\n\n[noise]\n[noise]\nIndiana filtered its doors Ninety point one at the [noise]\nToday it's going to be the day that the gun and throw it back to you\nWe buy now he showed us some how realize Buddy Guy do\nI don't believe that their body feel the way I Do about Jim now\n[noise] [laughter]\nAnd beyond this is W. I. UPS them\n\nFolks the ones that workshop series prevented by presented by the counseling center continues October seventeenth with sleep it does the body good this event takes place in sweets on may police and ruin gee sixty from five to six PM\nFor more information contact the counseling center at seven to for three five seven to six to one orbit that I ... to use last counseling center again that seven to for three five seven to six to one or visit I di di di di you slash counseling center\n\nYou know when\nYou look at the check in with the plastic ball spray paint supposed to talk of the things even getting any of those\nReal dot com blaming\nLiquor from maybe to Reno and finally the capital and cast you leave on the monthly still in\nMan\nBook the little people do bang man bringing all the all the gas because one guy on a legal and others got a black one on the polls show the other end up back we're\nEnergy to cap it can't roll a trade the cat the pain but like body heat and my time in a piece of wire on\nMy joke among the splinters\nMan\nMan though\nTry to\nYou know there\nGoing to change I could feel it\nActually I Am so\nActually I Am so\n\nSaying\n\n... ... ... ... ... ... ... ...\nThere's been drinking I mean but it's nothing to do with the news [noise]\nInstead\nThe new the new ... you can\nThe extent that ends\nUp in the Arab League is based on the east in may\nJust saw this interesting\nThey start\nThey saw them\n\n\n\n\n\nI\nSaw a guy\nIn time I get a job online all the while ha ha ha ha ha ha ha ha ha [laughter] [noise]\n\n\nYou were locked on Ninety we want W. I. yup them you know since ... [laughter]\n\nThey\nThey both\nMan named\nMe\n\n[noise] [laughter]\n[noise] [laughter]\nKnow\nThat I'm the mother in law in general\nDrawl a at a game of being\nSo would\nYou go [noise] life which do you tell me you know the time machine\n[laughter] put up with the oil is good or bad [noise] I'm the guy with the girl was\nNinety One of the art you know throw leave that got [noise]\nLike they can always\n\n[noise]\n\nWith the best variety this is Ninety point one W. I. P. F. M.\nFolks October twenty second the six o'clock series continues with escalation of film and discussion on dating violence in recognition of domestic violence awareness month\nThere'll be a viewing of the short film escalation which has been described as I opening and seeks to recognize to learn warning signs of unhealthy relationships what you can do about them\nIs event takes place in the hubs Ohio room from six PM to seven thirty PM more information visit WWW dot ... dot edu slash six o'clock series that's WWW dot ... dot edu slashed six o'clock series\nSaturday\nDon't they they made it\n[noise] [noise]\n\n\nI took a whole\n\nDon't\nA\n\nGod\nO ... o\nTo say\nWell you\nThat\n\nWe're not going to bomb it don't\nThe red\nIn a baby or ma'am Montana\nThe name of the day\nI Know that it would be the man\n\n\nThis guy you may you may\nOne ear and I mean I can read them again\n[laughter]\n\nYeah I Am a\nAnd my\n\n[laughter]\n\n[laughter]\n\n\nWhen we got one last\nWe we\nYou get to more quarters and after that most people never play this game again largely [noise]\nJoin us for all the unforgettable moments in sports here one Ninety point one W. I. UPS than Indiana, Pennsylvania for sports talk live every Monday Wednesday and friday I'm forty five PM where we talk all sports all the time\nAnd it's like nobody except you know\n\n\nNa\n\nNa\n[noise]\nNa\n[noise]\n\n\n[noise] you're listening to W. uh you know it'd be it'd be Ninety point one\n\n\nA game and well\nWhen that's going to want to go\nNow\nAnd you know what to do\n[noise] na\nCan go\n[laughter] want\nYou know landed a dollar\nMe\nMad Mad Men bass\nTo be\nBack back back back back\nBam bam bam bam\nBam\nBam [laughter]\nAh\n\n\nOh\nVery rural\nNa\nNa na\n\nMom\nBeing here\n\nYou're listening to after ... di di di di Jay bark is on Ninety point one W. I. U. P. F. M.\n\nV. [laughter]\n\nDo do\n\n[laughter]\nI Know\n[laughter]\nYou know\n[laughter] so\n[laughter] you know\n[laughter]\nBut you\n\nKnow\n\n\n\n[laughter]\n[laughter] [noise]\n\nMore than twenty three million of our children and adolescents are overweight or obese putting them at higher risk for serious health problems [noise]\nHi I'm Pennsylvania state senator Judy ... women in government and organization of women state legislators isn't working to promote policies that make it easier for\nChildren and families healthy and be more physically\nActive to learn more visit women in government dot org [noise]\n\nMore music west talk this is your alternative source W. I. U. P. F. M.\nFlute today is forecast is currently sixty four degrees and Indiana Ninety percent chance of showers high sixty four throughout the day a range likely and there'll be partly cloudy sixty percent chance of showers lower thirty for\nA tomorrow it's sunny with a high near forty eight winds blowing west to ten miles an hour and then Tuesday night it's partly cloudy with a lower on thirty nine when southwest around nine miles an hour\n\n\n[noise]\n\nUm\n[noise] good scout at all\nI'm\nA man a man a man\n\n[noise]\nOh\nMen and women who\n[noise]\nWhen when when when when [noise] when\nYou're going in and out\n\nOr or [noise]\n\n\n\nJust off the record than rocket back in time with us on the afternoon guy [noise]\nTickets through history greatest rock tunes up yesterday [noise]\nYou're listening to your alternative source not point one W. I. U. P. at that\n[noise] [noise]\nGosh [noise]\n\n...\nBad on that highway\nLook good for their child\n\nMm\n\n[noise] you're listening to Ninety point one W. I. U. P. F. ... what do ... D J bark is\n\nFolks the evergreen conservancy will sponsor program detailing the work of critter cat a licensed wildfire rehabilitation facility on friday October nineteenth seven PM or the blue spruce logic was Bruce park\nThis is Dan Van Dyke so over thirty five years of sending the injured wildlife you will learn what to do if you encounter distress creature while in the woods\nSix zero to zero that seven to four or seven one sixty twenty\n\n[noise] [noise] [noise] [noise] [noise] [noise]\nThis law Tabitha aid\nA bad habit these\nIndustry\nLanguage I'm babbling the\n\n\n\nThan [noise]\nYou need from\n\nAnd\n\nGood\nDa na na\n\n\n[noise]\n[noise]\n\n[noise]\n\n[laughter]\n\n[noise]\n[noise]\nShe saw\n[noise]\n\n\n\n\n[noise]\n[noise]\nThe guy and and\n\n\nNinety point one WBAI UPS them Indiana catches Saturday spot\nEvery week here in Ninety One W. I. UPS them from eight to ten PM your host the holiday will play all sorts of punk rock a rock and roll\nAnything I really want to dump out there on the airwaves pretty much it would be my hard drive and I see my head and if you are listening you will resort so check me out every week she says the M find me on Facebook at Facebook dot com slash Saturday spot of you are you ... as always listen to Indiana Public radio station starting point one W. I. U. C. F. femininity\nAll right everybody in the car but\nYou first let me get their mouth go for a hike so what am I can do\nWhere the guys from the neighborhood teenager had to find that hard to find a neighborhood park or green paint the new law temperament us part of that\nYou are locked onto your alternative source Ninety point one W. I. U. P. F. M. Indiana\n\nThe best in progressive and psychedelic rock along with some occasional blues vocal Jay ... countries\nTune in to fight on track\nI'm Jim inviting you to join me this Saturday at ... pm on your alternative source W. I. U. P. F. M. Indiana\nThis is Terry Crews actor former football player and father I'm also an expert on drama that's a good kind of comes from having a house and the Philly drama like the drama around my perk your legs and then there's the drama you can skip skip the\nTrauma that comes from not having your high school diploma or political mine free adult education classes near you and then as you were deployed miniature development that's finished your diploma died or\nAt least the drama an actor's like me to you by the dollar general literacy foundation and the council\nDon't this is where the music matters and you're listening to W. argue the F ... Indiana your alternative source [noise]\nIt is two o'clock here on the east coast and you're listening to W. I. UPS and Ninety point one I'm your host here for Monday's meeting mix bringing onto that worked issue Jake's football Nick thank you all again for tuning in this week so glad and happy for you to be here today on this coast\nSo far show that we've got some cats they're going to tell us about Detroit rock steady here I'm a median mixed raking all through the workday\n\n[noise]\nThe\n[noise]\nHeard that\n\n\n[noise] again kissed starting off our show to a seven\nHere in the east coast and thank you everyone for tuning in today hopefully I can make your Monday work day or grind a little bit faster or if you're just sending your dorm or an apartment doing homework I Hope I can bring some light to your afternoon because if you look outside it is terrible outside overcast no sun insight\nHowever it is bringing light on this great day so\nWe are going to do before we get some more music as we're gonna take a look at our accurate weather forecast brought to you by the national weather service\nCurrently in Indiana is sixty three degrees Fahrenheit Seventeen degrees Celsius when speed blowing southwest of twelve miles per hour you can see up at three mile so if you are driving please be careful if not then\nPlease be careful you walk or whatever means of transportation you like to take your throughout your a drag your Monday\nLooking ahead this afternoon still Ninety percent chance of showers in the Knight sixty percent chance it decreases than by our we are going to reach thirty four degrees in the low this at this evening I must say I missed the summer weather already however I enjoy wearing hoodies um\nKimberlin boots and in jeans I Will say I'll miss that already however tomorrow it's looking to be great sunny but the high forty eight Wednesday partly sunny with high forty eight is well Thursday and friday mostly sunny both days and then we're going to range from the fifty five to forty seven degree arranged so the rest of the week is looking All right just a bit cold so bundle up\nHowever you will not need the boots to charge through the rain or snow\nBecause you know ... the Pennsylvania any whether it could happen here in Indiana, Pennsylvania and I don't know how many of you are listening but I bet you all you can can attest to that actually\nSo yeah we're going to get back to those back to the music here for a little bit coming up here we got some cheap trick fall by ... by cc are are first you got some cheap trick with I Want you want me this is median mixed breaking onto the workday with me Jake slip on it\n\nOr Altman park would and west Lebanon this is your alternative source Ninety point one FM W. I. U. P. Indiana [noise]\n\n\nAnd then I Know not really a game and they get right down the\n\nHim down and read it on a\nWay they lay o\nDa da da\nTo ...\nPercent per mile walk\nThan than the average man\nBut he did it\nA younger kid in my\nThey they may I\nAnd da\nDa da\nDa\n\nDa\nDa da\n\n\nDa da\nDa da\nNa na na na na\nOf the ground in brain of a girl\nThey may have\n\nLive in\nA room with\nNot [laughter]\n[noise]\nTrying to think about it they're going after\nYou're on the na\nY [noise]\nYeah I'm not making\nTook all the time [noise]\n\n[noise]\nOr or are they going to say I want to hear [noise]\n[noise]\n[noise]\nMy uh\nJihad or with paradise city here on media may break I'll do the work that we are a half hour in the city to the show and thank you all for joining me\nNinety point one W. R. U. P. F. M. Indian Mm\nHolding these through the mid sixties you know the good stuff [noise]\nI'm Jim and Bunning to join me for the ... zone Sunday at six ...\nTwo hours of some of the best music ever recorded\nWho simply right here on your own sauce\nSix months from now\nSo there's one thing I Want to change about me right now\nI tried before but\nI'll do it for me and the baby\nMost people don't succeed at first it often takes several tries the important thing is to never quit on yourself visit quit or in you dot org or call one eight hundred lung usa for tools in tips from the American lung association we support the quarter in you\nKnow one W. I. U. P. and then\nThen India oh\nI'm any good and the host of democracy now your daily grassroots global I didn't let in international independent news hour\nWINZ invented now airing democracy now from the week Monday to friday that by the end on your alternative W. I. P. Ninety point one\nYou won't forget [noise]\n\nHi this is Terry Crews actor former football player and father I'm also an expert on drawbacks that's a good kind that comes with having a house and there's still a drama like the drama around my particular tour and then there's the drama you can skip the drama that counts\nFinish your diploma and lead to dramatize actors right man brought to you by the dollar general literacy foundation and the ad council\nFor Altman park would end west Lebanon this is your alternative source Ninety point one F. M. W. I. U. P. Indiana\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n... riots with mental health thing your head here on median mixed Ninety One W. I. V. FM's\nOnly after the show where we hear absolutely amazing ... quite right one of the best uh here in the eighties uh introduced them by my parents and I want to thank them for that you know they have a lot hidden gems\nRobert Fifteen after we hear some rat with round and round [laughter]\n\nAnd I I\nAgree with me [laughter] and now it's down and\n\nI Know\nWhen I called and a half an hour from me [laughter] I Know right from um [noise]\nOh my God I Am and [noise]\nWhat do you want [laughter] to look at what made you\nKnow I I like\nUh [noise]\nI Know from like you know I Know from a restaurant and narrow\nBomb that was one oh one thing that sometimes\nI thought oh my gosh prior to jog around and go on and [noise]\n\nI'm like oh [noise]\n\n[noise]\n\nYou know the name of the things I I I only found\nA way to honor\nAnd our around a lot of wind down time around\n[laughter] [noise] um [noise]\n\nI disagree with them ever so much because you know it yeah it's true I think there are good banned\nBy God I mean a lot of really good actually worried about the music here's British Springfield with Jesse's Girl only on medium ... tune in\nSunday point one W. R. U. P. F. M. Indiana\n[noise]\n... friend [noise]\nFriends in my\nLate ... something's changed any heart and mind you got the girl and I'm Alone on\n\n[laughter]\n\n\n[noise] something and I'm like this year I'm ray [noise] to be a reason to change you\nKnow I feel when they start talking to you don't want to town\nThe phone from\nLike a you\n\nI was\nCan't find them\nAll the gym\nAnd just you know\nThey can find\nCannot find\nWhen I was\nThe in the\nAnd and and and and and\nIn any in Germany and one\nAnd [noise]\nAnd I don't want\n\n\nA passion for years\nWent on\nAnd on\nAnd on and\nAbout\n\nYou're through the Ninety point one W. I. U. P. S. down your alternative north right here in Indiana, Pennsylvania\nA\n[noise] a liar\nAnd\n[noise] and da\nDa da\nDa da da\nDa da\n\nDa da\nDa da\nDa da da da\nDa da da\nDa da\nDa da\nDa da da\nDa da\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nI go back in\n[noise]\n\n\n\n\nStarting Allegheny Armstrong glare free bay Indiana commerce that and what's more than we are the regions alternative so there'll be you'll be up in India [noise] [noise] [noise]\nBehind the clue why\nNo one knows why that's why\nWe need\nTo be made and\nOn my knees you say oh damn\nI'm sure you've seen to be\nHave a little\nKnown me ...\n... you\nKnow that there ever Rudy\nNo one no fly\nKnee man\nA on there and\nLab teams will\nTo ease a damn name\nMe is to be\nHave um\nOh they do when we\nBought a brand here in\nThat span of a brewery\n[noise]\nTrying to\nThan I Am\nAm\nBy\n\n\nThis is Ninety point one W. I. U. P. F. M. Indiana alternative source\nHoldings fifties through the mid sixties you know the good stuff [noise]\nI'm Jim and running and joined me for the oldies zone this Sunday at six PM [noise]\nTwo hours of some of the best music ever recorded\nExclusively right here on your alternative source\n\nSix months from now I'm going to be\nSo there's one thing I Want to change about me right now\nI've tried before but\nThis time I'll do it for me and the baby\nMost people don't succeed at first it often takes several tries the important thing is to never quit on yourself visit quit or a new dot org or call one eight hundred lung usa for tools in tips from the American lung association we support the quit or in you\nAnd now they're ... than staying alive stance anger time [noise]\nWhat do what it does what it did every body welcome into sports talk last Monday edition I'm your host Jake Taylor here are not important one W. I. U. P. F. M. it's gonna be a great show we got the whole\nWe got the whole radio loaded up today with ... Smith rather ... an Nicholas ... how you guys doing today\nAnd we'll be postseason and be a tip off starts tomorrow and they'd show is in full swing right now and obviously the national football league is as hectic as it's ever been so we'll probably start here with um I'll be because why not I mean there's not too much to talk about\nUh both the L. C. S. and uh I Know\nThat I see as or tied one the one where you got started in the first four games but the series so far\nIt's been it's been a crazy started for me honestly because like I came in last week thinking OK brewers can easily see the Dodgers but it's been both game so far for the you know the ads have been real real really close a closely contested\nUm I thought the second game should've went in in favor of the brewers but in the same way I think the Dodgers should've easily kept a hold of the first game too I Do I feel like there was just a big mistakes made in both games\nWell we knew coming into this one that the daughters had I had a chip on their shoulder suffering that I'm horrible off to the to the asteroids last year in the world series so um do you count them out or to get swept by the brewers I was definitely a bold production but hey both teams are huge contenders along with the ... the U.S I mean the Astros and the red Sox\nTo the toughest teams the and the scale you know both over one hundred wins in season a great pitching staffs absolute monsters at the plate so I'm I'm I'm really excited for will be seen so far and you know will be\nDon't I don't feel like that's fully true though because like even if like if you look at like the A. O. C. S. right now you can you can see that the red Sox are letting up five seven runs they they've been doing that the entire it to the playoffs been given up high amounts of run but they've just been relying on their offense to to get that back\nAnd if you look at like game one of the of the ... Red Sox scored two runs that was the first time that they're often says where they've been shut down for the for the most part in Indian almost the entirety of the playoffs so far uh and they were they were able to bounce back again to but you got to start thinking okay so\nThen you kind of have to have a more consistent offense\nAnd if you're if you're the Astros pitching and you're doing a good job of shutting down the red socks off and see if you're doing a good job of shutting down ... have you done a good job of shutting down brought quote then then that's how you're going to win the house he has and I feel like\nThat's something that the the Astros really focused in on in game one 'cause if you're looking at just how they did pitching wise in how they how they play defensively\nThat was probably one of the Astros best games not just in like the postseason but in the entire season combined defensively that was the best most they've made\nA statistically trying to put pictures up against the right batters trying to do the shift at the right time trying to pitch outside do the right calls and and I think that's kind of what we started to see now in game two we did see the red Sox make the shift we did see the red Sox\nStarts to focus in on what the Astros were going to do but I feel like now if you're the Astros you have to continue to mix things up and that's something that the Astros where they didn't do any game too and that's why it was still a seven five game\nUm and so I feel like the Astros how in the right spot right now to take it out in the red Sox are just trying to play defensively and try and just to hold them off\nHis man Brett you really just\nDidn't really have to have you ever see those are my two things are all very defeated right [laughter] I just I've just like oh yeah oh\nAll right I'll just listen and I love the olive they're saying everyone else I'm going to take away from that will be I Know uh it's not my something my forte I Know I'm supposed to be the man talking about everything but I don't even know if there's much to talk about I mean I'm just a ... brother looks like Brad got it all [laughter] rather than any of those who did\nI Will say that I I'm pretty sure that by this time next week or we're gonna see brewers versus a Astros World Series just because I feel like the brewers are going to finish off in the next three games I agree with the ... to go with the red Sox okay okay\nUsa [laughter] and leave it at a news of ... I guess quick little thing that Brad really wrap that up\nKilled it on their mobile switch over to the NBA preseason preview tip off is tomorrow in Philadelphia Seventy Sixers\nAgainst the Boston Celtics a boss subjects really trying to wipe their butts was last year in the playoffs the Sixers were on that on strike at the end of the year what sixteen games they want in a row everyone was high on Philadelphia I Know everyone in the studio here last year was all Philadelphia sports fan so\nIt's a change of pace this year we're all kinds of Pittsburgh based but\nUh because we don't have an NBA team so I mean everyone's saying oh Philadelphia root for them because they're the closest so what are your thoughts on Philadelphia to start you know as\nI think I think it's going to be an interesting year I just because they feel like now that you're going to have been Simmons coming back for his technically sophomore season uh 'cause I really didn't consider him a rookie last year but\nThen you also have like return is John John beat but then I'm also really interesting to see how they're going to fit mark how far into the Mexicans really didn't see that much last year or in trying to play him and with guys coming to an\nEye and try and get them start in time as well as like what they are and all that kind of stuff just trying to share the spotlight I I feel like that's going to be an issue for them\nI went to fix this year I think uh I think obviously the eastern conferences anyone's conference to take this year with Ron going west LA I'm\nAs you said bin Salman to sophomore year I think he's ready to lead the Sixers do the playoff run I think can be it's going to be there most valuable player definitely um yeah like they like you said Marco folks working on his route all summer a storage depot X factor coming off the bench they got a lot of lot of nice components are for the playoff rounds with the Sixers\nYeah I Would definitely say these two teams though I think are the favorite on the east was between Boston Philadelphia am I\nI'm I like throw Toronto in there too because I mean what they want sixty eight games last year and then they I mean your place to martyr Rosen with ... ... ... best defense\nThe infamous for that that's I think that's why they got rid of the one case because they saw that even though he want to go to the year last year they saw that he can't get it done in the\nSame thing with the Marta rose and to like you got you got to get out everything from like you knew from the beginning and the ... the murder Rosen in the playoffs hasn't really spotty he'd go put a fifty points in the game and the next time he he's barely hitting double digits so I mean you can't really have that kind of inconsistency when you're trying to win a best of seven\nSeries in ... he knows what it takes to win an MBA championship he beat the Miami Heat you want finals on Sunday against them he has experienced the raptors looking for the the front the front office was looking for it and they also have a nice off for general call our due to match them up with a ... so I think they go they can make a real deeply over him\nIn and that's the biggest thing is I feel like if you're gonna compared to murder Rosen just straight up to ... Leonard Cohen Leonard wins every single time not only because of his office of efficiency but he is by far the ... the best defensive player in the entire league\nWhen when he lost a dream on green for defensive player of the year I think he was he was robbed hundred present you should it be easily won it or that year as well as the year before he already did win\nAnd I feel like that's the type of why they were going to see this year there's always an issue of whether we're going to get the same guy because last year obviously a lot of struggles with injuries as well as a lot of struggles with the organization\nAnd I know he really doesn't want to be in Toronto um so it whether they can change his mind on that fact and really get him\nA like invested in the system is going to be an issue an interesting story line to watch\nObviously teams like you said it's anyone's conference over in the east you have any ... anyone of any sleepers in the eastern conference here to to maybe in some ... yeah I've got to forget about the Indiana Pacers one because just because of ...\nTo an already stacked or author of they decided today mile to turn to for your eight eighty million dollar expansion\nUm so yeah I'm really like and then come out of the U.S I think they'll shock a lot of people also like the the Milwaukee box and that's because I mean they have this guy called the Greek freak up there a ... row addict Chris Middleton ad Malcolm brogden Eric Bledsoe that team is absolutely\nWhen are they the heat were nothing they were ... they were just a an average team in the east at that point when a Kevin the rent joined the Golden State warriors they were a Seventy three\nPredicts out there right now but I mean really ... joined a Seventy three when theme\nAnd if I'm OK so first off I'm not I'm not fully agree with you about the whole Katie thing I'm a personal I'm personally a Katie fan but I Will agree with you on the fact that\nI feel like LeBron's LeBron James decision at that televised event which that should not have been televised though but no matter where he shows that was going to become a super team because his or if you remember his runner up at that point was the New York Knicks with Carmelo Anthony\nAnd if you put him on that team I feel like they would have also been in the exact same spot the Miami Heat bread and Chris Bosh would've ended up going there because they feel like Chris Bosh was just following the brown wherever he was going because Chris Bosh knew at that point that that's where the championships or going to be that's who was going to lead to leak\nIn them but then with that the uh what's that like I\nStill he's not joining us I must number my number one and I think it was like a liberal or\nGet out we have a lot to talk about today this time is flying here because in the first half of the show we'll take a break around for thirty because I Need to get some some technical ... things together because we will be accepting phone calls I'll be best if you want to call in\nHere the phone number is seven to for three five seven nine for eight seven that is seven to for three five seven nine for eight seven I'll repeat again\nAh when we come back before we go to break\nIn here in about ten minutes or so\nBut the pre season coming around so obviously it's time for some hot hot takes such so we can brag to each other if we were right at the end of the year which we won't even be here in schools are really doesn't even matter but ... a MBP productions from all around everyone anyone MBP who's who's gonna win\nFeel like this is going to be honest on the ... year I feel like the Greek freak if taken it he he was he was solid last year the only person that I feel like might be giving him at a like a kind of like a ... in contention with that would be LeBron James\nAll the pieces that around him with the press bono yet ... like are you going to be dropping way more social mellow when the team I think this year and I think it's a I think it's another another I mean the season for James Ord\nGiuliani superstars anyone flip a coin picking Kyrie Irving Boston Celtics reason why I just I mean hey\nI like a mother a check an underdog out there and I think Donovan metro is going to play ... or season we saw that at the end of last year and if he can play that consistently there's no reason you shouldn't be in the running I'm also going to go to James Harden\nSo [laughter]\nI'll go I'm going to go back and say step courage going to have one of those years where he just doesn't miss and he's making behind the back no look shots with his eyes closed and do whatever that God does because it's exciting to watch and I hope he does because it will make the season way better and the highlights way more fun to watch what I'm sitting in my bed\nWatching YouTube highlights there you go so that's where I'm going to say Steph Curry for MVP\nI said for the NBA a preseason preview\nRushed here will go over the NHL as it's in full swing here the Toronto maple leafs face off tonight against the Los Angeles kings the maple leaves I think or the story of the year so far undoubtedly\nAwesome ... Johnson theirs is living up to expectations where are you guys just thoughts on the straw maple leaf team it's a long season do you think they can keep going or do you think that they're going to come to a screeching halt ... ah towards the end of the season and just fall off and not do anything the play\nOff I think the run hot streaks going almost five goals per game or something you don't really see much hockey I think I think this year the maple leaves\nYeah yeah honestly the middle east for you know you have John ... says the addition without matters which is a great duo um now you can't forget about ... which is also one of the top of that child he's kind of like under covers per se because he's also not ...\nBut I'm also ... I think they can I think\nThey can drag this out now the only problem is though you don't they don't have the debts and defense like San jose or other teams and you know they're often so I can I can tell you right now yeah one of the best often in there and show and I think they can keep it going ... yes but they're going to have to you know there are laws in her office there defending is not bad but\nYou know I'm just gonna say um yeah and you know what they're going to be a top three team the Atlantic I'm ... and there's gonna be a tough team to play in the playoffs\nI Will say that I I definitely think we're going to be a top team but I feel like they are so like there are so heavily based on on star players and so many certain players because\nTheir their defense is struggling like if you look at like their their record and see that other doing really really well only won last but they're still twenty third in goes against yeah and so that that's just because they're only winning games right now because there first and goal scoring and so I feel like there are one injury away from their entire house of cards grow up right I mean like\nYou said it's like you know there are often says the powerhouse right now and like you're not you don't have a they don't have a defense San jose with you know air Carlson rep burns is probably the best defense of doing it shell\nYeah um yeah you know I I guess it yeah it's only gonna take like one like you know I guess I'm\nOne or one mistake I don't know one and I think they're gonna stay pretty healthy though honestly so um yeah\nWell to on that note I Do think that Toronto could be a\nScrewed when it comes to defense however teams that seems succession went championships or all offensive heavy we see the west usually has the better the defense of\nThe matter is that in defense like Nashville Predators did in the Pittsburgh Penguins obviously expose them last year I Would of Vegas are no deaths whatsoever that team was stinky cheese that seem really grants my ears they made it that far because then they turn and she and I was thinking she's trying to keep it here I guess there's something going on in the ...\nBut um yeah so that note Toronto is not as that's on defense however I don't think that really matters I think that it's a and it shows becoming a high scoring league now I think that's what the NHL once I think that's what they need I think we need these teams with electrifying goals and these players like awesome math is where young and tearing it up\nI think Tampa Bay was very deep and very deep and defense last year and you saw way deeper than the Washington Capitals and they still blows through the two leading the eastern conference finals in a Washington Capitals went on to win the Stanley Cup\nVery easily against that stinky cheese Vegas Golden knights team\nWell may also being like a high school and you know just in league in general also you know I don't know if you've gotten this but now the goal is back a while ago you know they\nHad more equipment on and the pads I seen regulation size have gotten smaller and I'm so\nNot saying that makes a huge difference but I'm just saying that you know the equipment changed a little bit too um yeah and also you know you have these guys have ... ... for their shots yeah and and that sticks these days to a you know how much technology having this composite on peace sticks I mean it's just insane so\nYeah I agree I think that I chose to go to a good direction obviously there are so been so many sweet goals I think however the something and it sure does not want to see it as the admittedly Oilers stinking up the joint because\nWhy wouldn't they they are not good and they ... they just decided to sign karma David and we don't drive settled to the biggest contracts all huge huge contracts and just dumped their whole franchise on the shoulders of those two men after one good year of course make David always wins appoint race but that's because he's probably the most\nIs the fastest player in a natural history and right now the youngest most talented player but if you have no pieces around them you're not going to do anything and I think Toronto has obviously learn that and they put a great coach with Mike\nYoung players coming up here Calgary joining a droves doing well uh\nTeams like Arizona I don't know that can catch a break\nBut after all this was said and done I still think it's the veterans in the show who are still going to come out on top you guys like the ... election Crosby Ovechkin\nPlayers like that the Boston Bruins Patrice birds are on a marsh and a ... a Tampa Bay was stand because I think these teams are still the ones that are still on top I don't think these young does he come up and do it like Crosby once did\nI I think crosses the only player and I show his ... and ... come up recently and tear it up at a young age and actually when I was a young age I think now it's still an old man's game\nI agree with that but I feel like that's slowly starting to change I feel like they had been to an others are going to actually be a good team by the end of the season I feel like they've got kings they're working through right now um and I don't know if you watch the rangers game or the other day but I feel like\nYou can see some of those can start to play out because uh they they had a terrible opening to that game but then they slowly started to adjust and those adjustments were made I feel like this is just on the coaching staff becoming more familiar with the players and the players\nAre growing in maturity because there there is the bulk of that of the that Edmond to another team is young that they are very young the bulk of them are under the age of twenty five\nAnd if you've got that many players under twenty five tried them by together it's going to be hard to create that team chemistry and to really build and I feel like with with them just continuing to grow in continuing to play together throughout the throughout the season they're going to eventually hit that point and hit that point of experience at the actually go to play well we're approaching and a half\nZero touchdowns one week to shutting out a team Twenty one nothing looking halfway decent the defense is living up to potential but then they looked at the Cleveland Browns Becker Mayfield not necessarily have is way with them but do enough to win the game you know I I I Can't I Can't read any team right now except only team that I can\nUh honestly say that I'm confident in what they're coming down to ... keep coming in producing or the ... I think the saints the patriots\nSo the Kansas City chiefs on that list just because they're often has been consistent defense has been lackluster I Will admit like and I feel like the the defense by up and down to the opponents but you have to even look at like the game against the patriots that I was like in July stadium yeah like you might you know in New England Sunday Night Football yeah ...\n... homes they put up a good fight too it's not like they were shut out or anything but the patriots eat\nMy name is ... played the last how many weeks of the ... and he still through four touchdown yeah with the fact that we are even saying still through for touchdowns shows you how good the chiefs\nHave been this season right bread and honestly I think we are I think the NFC there's one more to describe the NFC fc this year it's a interesting I mean yeah really I mean the rams everyone coming to the seasons like oh my God the NFC everyone comes up you know seasonal winters\nAnd she has been I'm gonna bluntly say it off they've been awful this year I mean the NFC eat I don't think there's a winning was not the Redskins are winning team I don't think\nOf the cat was when the not too well now it's a Redskins yet on any do you have it all yeah they'll they'll look like hog garbage this year if they do an entire division looks like hog garbage or\nThey see that it was quite interesting with the bangles sporting out this year the or the ravens are on fire a modest that a week five lost the browns or the Steelers look awesome the cheese like Austin the patriots all famous goal yeah let's put the dolphins\nI might go rock also I look at like ... when he played for the Texans an ad rightly looked like he deserved the contracts or does that mean he should get ... he'll know I I think I think so I feel like you play the hot hand I feel kind of over the line with what the buccaneers and fits magic dropped off\nAnd people started to like exposes tracks then all of a sudden that's when they made the switch to James wants than I Do not start\nWere uh I go back to the end he'll just ... I mean he has a winning record brothers clear Miami yeah like he's not even close to having a losing record in Miami a I think he he came out on the first three games of the season for them um but what has tannahill done for that organization that does get hurt\nUm that's what I was honestly decision that I'm Glad I don't have to make if I didn't have to make it I'd probably ship ... ship some\n\nAFC I feel like I feel like the New York jets are better than the dolphins honestly right now because if you're looking at the way that the jets have been plane they haven't they haven't been as putting up the numbers on a consistent basis they haven't been winning on a consistent basis but like even when they are winning they're winning by usually a good margin\nAnd that's not something that we're used to seeing from the jets because they are pretty much a a young team this is I'm pretty much a brand new team but now we're on a two game winning streak meeting the Broncos thirty four and a sixteen and now just beating the called forty two or thirty four as they go towards the Vikings and the Vikings have been struggling and I feel like the jets easily beat the Vikings right and I\nRead I I think the Vikings are have looked absolutely awful modest a godsend that we call her cousin [laughter] outta the on this year uh besides has I mean they're the ... and the rest of that ah that Minnesota off off Ensign defense honest with the day that is a\nSurprises come out of the season and personally that's one of my biggest surprise is is the Vikings struggling to get it done defensively ... honestly just although there are lines looking looking terrible but defensively it's nothing like last year there defense was top notch no one\nIt was hard to do anything it's that defense\nWe even saw it I mean they are last year ... the only player to shut down Antonio Brown they actually shut him down and have it in Tony brown not have an tonia brown like game I mean yesterday on the five perceptions but he had a what a hundred and five yards and the game when he touched down so\nI I don't know what's what the Vikings I just can't tell I Hope they get their\nHope to get their stuff together because I Want to see them succeed are cousins\nIf I could do it I Would ask for the ring on his finger I Will not talking about us\nThere is at the top of that division because this is something completely different for that entire division because you you always saw Green Bay those up Aaron Rodgers always leading the pack then Minnesota always number to always in the high and especially like last year always in the lead\nBut not seen like that that division be a lot more competitive seen Chicago at the top three into and even the bottom team Detroit is that two and three that's literally anybody's division right now that's my only agree with fifty percent of what you sat next because\nI think that that the entire NFC as plain awful but that's why I think it's interesting because you have no idea at this point who is coming out other than probably the rent\nYeah everything's coming as a surprise in the NFC I said ... are pretty much the instance does come out on top but I like that division you mentioned that I like seeing the bears on top and granted I knew like the Vikings team I'm it would be much more it'd be much more fit into the bears on top a they got a young team full of people who really people don't really talk about I mean you know you have a three going\nOr Jordan Howard and Mr ... but I mean other than that\nWho else do they really have I mean I mean okay I\nI I Will say this yeah you can you can make an argument that it's interesting because all those to the NFC North in the inner cities there they are very close divisions that then it's up in the earth's anyone a vision\nBut then again when you watch that you sit there and watch NFL resident on Sundays if you don't see any highlights from the games there ... I ... I watched a but there's no magic between the eagles and the giants was I mean the English came out and absolute dominant the giants but I mean back to what I've been watching the eagles the eagles have been awful you know yeah I think that in ...\nBut all kinds of lackluster it best ...\nI praised Doug Peterson lush I praised Doug Peterson last year because I don't [noise]\nShe was a perfect coach I think he was a perfect couch last year and do you really is losing well Frank Reich or was it was he the mastermind behind everything or is this course and once just sucking after the ... century I don't know what it is but something is missing and they need to fix it fast ...\nI don't think we'll ever be the same way he is an awesome I'm Sorry I Know you're a huge factor but like I don't I mean I don't think they're looking as strong as they possibly and they probably won't look the strong are probably won't won't look as strong as they did last season for a long time I mean I went there\nI mean I can agree there they're looking like I could say crap right now this year I mean is lucky that we're in this division right now 'cause the giants purely just you know trash right now they've been tried for the past would would every couple of years um\nWhere one reason behind the UN and\nA lot to think jai stands out there but I ... still up in Africa as well as anybody but it's still it's really you know not being able to say but I still think he was gonna be on top of the agencies that after and I as I have to say I don't\nFeel like this is like something that Carson once they're just coming off an injury I think this is just kind of like a grace period for them because they're coming still off of the high of winning the super bright however through that and then they also had to go through the entire quarterback battle of ... do you pull out the guy that won the super bowl to put in the guy that got you there\nOr do you go back to the guy that got you there and then just shock the super bowl MVP under the rug\nYeah hell or he'd really improve his word I beginning yeah I don't know why\nThere is even a debate at the beginning of the season just goes I mean if you go back and look in the fall season last year a it was pretty awful until the super bowl I'm I think once he played well on every single game he was in last year um I don't know how there was any debate regarding about car someone's Nichols distorting\nSo the topic of like quarterbacks and we're talking about obviously we mentioned this last week to it's been amazing that no matter what I mean Tom braid they get injured but no matter what the last Fifteen Years no matter if they made the soup bowl won the super bowl last the super bowl last and they actually championship no matter what\nThe New England patriots or civil contenders every year no matter how much they succeed there is no hanging over for them there's nothing and I'm thinking about this question when I started last year was going to ... I mean ... on the civil slumps and cost so much is going to leave at least when one or two more Super Bowls with this\nThe spring or early in his career he was consistent he got injured he was just and he kept playing he won the super bowl the law she lost heartbreaking loss he had a terrible season but then he kept winning he lost it and then he lost or broken but consistency is key I think in these elite elite elite quarterbacks and I don't see what Carson one says\nMaybe it's going to come back maybe it's way too early to say this but\n... after what we saw from him last year he looked like the face of the NFL and Patrick my home's religious crumbled him up and threw him in the recycling bin because\nI I I think ... might be the next question which I don't I Can't see how Carson wants to bounce back\nI Want to go back real quick something she said about New England being a contender every year I don't feel like that's going to be the case this year I think\nIf New England makes the playoff I'm going to say at first oh if they make the playoffs they're getting knocked out that have been around like it [laughter] because if you're looking at them the only place that they're winning is at home and then when they're on the road they lost thirty one twenty twenty six ten\nAnd if you can't play outside of your own stadium and then you you're not going to be to get home field advantage and then you ought to be able to succeed because that you're not you're not winning and that's I think on the defensive\nAmong the one yard line to get 'em all down there no other I haven't seen a catch like that in a while so I'm going to say Jews you Smith\nAfter a after those are big games big yards and clutch plays he's been having we're here at the top of the our democracy now\nDemocracy in this room says it can wait a few minutes because we got one more pick a ... weeks six uh\nBest the best looking Super Bowl winning team and I mean you can say the rams but obviously they're not going to go on to feed it so I don't really think how hard they are and what do you think the best team right now as best suited to go deep in when the super bowl I'm going to go with a\nA part of you know a pretty cheap [laughter] [laughter] I really like the Baltimore Ravens if your number one defense for the league it's really hard not to like them I mean I was hanging on the early in the season I think they had in them but I mean they just they beat the titans I I really like the ...\nI'm going with the chiefs I despite that loss I agree with Brad said well Brad said earlier I mean you're\nThe season yeah I'm going to have a ... game chiefs I mean there's the my opinion of the best teams right now and I fell and\nYeah so that's about homes in pretty good in any better and cars and was now I guess so yeah\nYeah jeeps I'm sticking with my theme for today or I'm going to Chicago Bears all the way of really ... their defense Howard been playing so consistently well their defense is probably there is by far the best thing and I think it's only a matter of time over there often can step up to the plate and start to start hitting home runs there\nAnd so I feel like ones that comes around there's no stopping them I say that the the bears easily make make the super bowl I mean the the bears have the office to do so I think they do is just hasn't stepped up yet mhm\nYeah and I think that I'm going to go the Los Angeles charges I think felt rivers most underrated player in the league right now that often just rolling Melvin Gordon three touchdowns last week or will wrap it up real quick there's two minutes or too much overtime so we're not gonna plug anything we're looking up to do a thanks to everyone for tuning in here to sports talk live\nA bath everyone in this room right now for the hard work and we're going to come back next week with a bunch more things were going to really get together we're gonna have a meeting and try to come up with some fun skit ideas and come up with just talking sports can do some debates if everyone has any uh suggestions on what to do with the talk about please or the Emmy on Twitter text me\nUh obviously thinks everyone for listening this has been another edition of sports talk live sit down shut up and listen to democracy now\nThis is Ninety point one W. I. U. P. F. M. Indiana's alternative source\nSix months from now I'm going to be [noise]\nSo there's one thing I Want to change about me right now\nI've tried before but\nThis time I'll do it for me and the baby\nOut quit smoking for\nOr or call one eight hundred lung usa for tools in tips from the American lung association we support the quarter in you\nYou are locked onto your alternative source Ninety point one W. R. U. P. F. M. India\n[noise] be\nFrom the fact that this is democracy now just jumping really terrible and disgusting about that because that was the case so we're gonna have to say we're going to go to the bottom of it and it will be severe punishment [noise]\nJournalist ... entered the Saudi Arabian consulate in Istanbul, Turkey nearly two weeks ago and it was never seen again despite the fish and he was murdered inside President Trump says he still opposed to sending billions in weapons sales to the kingdom\nWill get response from longtime Saudi dissident Ali all met\nWith a political president\nPrisoner and Saudi Arabia when he was fourteen years old he's now director of the Institute for Gulf affairs and Washington DC [noise]\nThen Amnesty International says immigration officials forcibly separated as many as six thousand migrant families\nAt the U.S Mexico border far more than previously estimated now it's thousands continue to play violence and seek asylum Trump said she may resume that family separation policy will get an update from the ACLU lawyer legal learn\nMinister's plan was to stop people from coming over here because the word would you know you'll lose your children but if you actually get your even if you of a legitimate asylum claim they want you to do with them because you\n... of archbishop Oscar Romero\nA champion for the poor and oppressed who was murdered by us back right wing death squads\nIn El Salvador in Nineteen eighty [noise]\nHuman is wonderful but the other was full poll six of the other new seats short Russia Romero and look through the security of the world and even his own safety in order to give is was poured into the Gulf Coast to the poor and she was with a heart for all to Jesus and his brothers and sisters and\nThe phone was speaking at the Vatican we'll speak with human rights lawyer not Tyson brand author of assassination of a sane plot to murder Oscar Romero and the quest to bring his killers to just [noise] all that and more coming up [noise]\n\nWelcome to democracy now democracy now\n... or the war and peace report I'm Amy Goodman\nSaudi Arabia will allow turkey to search its consulate in Istanbul Monday afternoon nearly two weeks after the prominent journalist and Washington Post columnist Janelle ... entered the consulate in October October second that has not been seen since\nThis news comes amidst mounting international\nDemands that Saudi Arabia explain the shocking disappearance after Turkish officials accuse the Saudis of assassinating ... this membrane him and smuggling body parts out of the consulate\nIn an interview with CBS is sixty minutes President Trump said Saudi Arabia which suffer severe consequences if ... they were found responsible but Trump repeatedly said over the weekend she opposes sending us weapon sales to the kingdom which he claims are worth a hundred ten billion dollars to U.S companies\nHurts our workers that hurts our factories that are full of our company is you're you're talking about five hundred thousand jobs so we do that we're really are going through a lot for the wording Saudi Arabia\nOver the weekend Dick Durbin the Senate's number two Democrat called on Trump to cancel the U.S arms deal with Saudi Arabia some Republicans appear open to the idea this was Republican Senator Marco Rubio of Florida speaking on NBC's Meet the press\nIs this is proven to be true\nThere is going to be a response from Congress it's going to be nearly unanimous what's going to be swift and it's going to go pretty far not quote unquote arm so but it could include a bunch of other things as well\nTop executives at J. P. Morgan Chase Ford Hoover Viacom\nThe New York times and other companies have pulled out of a plan to investors conference in Saudi Arabia next week nicknamed Davos in the desert\nU.S Treasury secretary Steven Mnuchin whose department and forces us sanctions still plans to attend despite criticism from Congress members on senators of both parties will have more on the disappearance of Jim ... after headlines\nIn Yemen at least Nineteen people were killed and another thirty injured Saturday as a U.S back Saudi led airstrikes struck a convoy of buses full of civilians fleeing an assault on Yemen's port city of her data\nAmong the dead women and children including five members of the same family\nA similar us backed assault on Yemen August killed fifty one people including forty schoolchildren the United nations has warned the Saudi led bombing campaign has brought Thirteen million people to the brink of starvation at Yemen's food crisis could soon become the world's worst famine\nStation left behind after hurricane Michael hit the Florida Panhandle last week as one of the most powerful storms ever to strike the U.S mainland the hurricane left Thirteen people dead in Central America\nThe death toll in the U.S has reached Nineteen with another forty six people missing and an accounted for and Mexico Beach Florida\nWhere entire blocks of houses were flattened by the storm\nOn Sunday President Trump once again questioned the overwhelming scientific consensus that human activity is driving global temperatures higher and leading to more powerful storms this is Trump being questioned by Leslie stall in his city BS sixty minutes interview\nDo you still think that climate change is a hoax\nAnd in Washington DC ...\nChurch leaders have entered the ashes\nOf gay college student Matthew Shepard and the national cathedral in Nineteen Ninety eight shepherd was just Twenty one years old was lured from Laramie, Wyoming bar Rob for twenty dollars cash lash to a fence bludgeoned and the head with a pistol and left to die on the prairie\nIs killing shocks the conscience of the nation and ... rights movement in two thousand nine Congress passed the Matthew Shepard act which expanded hate crimes laws to cover those targeted over their sexual orientation\nAnd those are some of the headlines this is democracy now democracy no doubt or the war and peace report I'm Amy Goodman\nSaudi Arabia will allow turkey they say to search us consulate in Istanbul Monday afternoon nearly two weeks after prominent journalist Washington Post columnist Jim ...\nThis news conference and MIT's mounting international outcry\nThat Saudi Arabia explain ... shocking disappearance after Turkish officials accuse the Saudis of assassinating ... this memo bring him and smuggling his body parts out of the conflict\nAnd an interview with CBS is sixty minutes Trump said Saudi Arabia would suffer severe consequences if it was found responsible but he has repeatedly said he opposes ending us weapons sales to the kingdom which he claims are worth one hundred ten billion dollars to us weapons manufacturers\nAnd there's a lot of sick and maybe especially\nSo because this man was a reporter to something we should pursue me say this is something really terrible and disgusting about that if that were the case so we're going to have to see we're going to get to the bottom of it and it will be severe punishment\nThe Saudi foreign ministry has responded to Trump's threat saying if it quote received any action at will respond with greater action the Saudis Tonight Show she was killed and their consulate over the weekend Dick Durbin the Senate's number two ranking Democrat\nCalled on Trump to cancel the U.S arms deal with Saudi Arabia some Republicans appear open to the idea this is Republican Senator Marco Rubio a Florida speaking on NBC's Meet the press\nWould I Do think the shocking because in fact he was lured into a diplomatic facility murder the body chopped up and that they sent a group of people down there to carry this out that would be an outrage it would be an atrocity than there would be sort of response certainly from Congress\nExecutives at J. P. Morgan Chase forward over Viacom the New York times and now they're major companies have pulled out of a planned\nWho's department and forces us sanctions has not announced plans to pull out\nThis comes as the United nations reports Yemen could face the worst famine and a hundred years if the U.S back Saudi led coalition does not halt airstrikes three quarters of Yemeni some twenty two million people are dependent on international aid\nWith an estimated eight point four million people on the brink of starvation\nFor more we go to Washington DC where we're joined by Ali Ahmed uh Saudi dissident he's the founder and director of the Institute for Gulf affairs was a political prisoner himself in Saudi Arabia when he was just fourteen years old the youngest political prisoner at that time\nWe welcome you back to democracy now can you start off by talking about um\nWhat we know at this point I mean what is public knowledge um what Washington Post New York times I'll just share of the Turkish government has talked about so far\nIs that on October second to a gym out push show she goes in to the Turkish constant goes into the Saudi consulate in Istanbul\nOn heat originally gone into the\nSaudi ... uh embassy in Washington DC he was told to go to the one in Turkey he was applying for marriage papers his\nFiance is Turkish she waited outside for him in Istanbul he went to the Turkish consulate they told him to come back a week later he flew out went to a meeting a conference in London flew back\nAnd it was then in October second as she waited outside and would wait for many many hours a day outside the consulate he walked inside that is the last time we have seen video closed circuit TV of Janelle ...\nTaken out of the country as well so you are looking at a very convincing evidence of this happening inside inside the Saudi conflict\nWith the knowledge of the counselor and ... and uh those Fifteen or Saudis who flew in on so did you hear the jets to ah to to to cut their work and they did not cover their tracks everybody you know uh they didn't try they wanted this message\nOr to be known they wanted to uh uh uh the world and there are followers of specifically given that ... was a loyalist and continue to be a supporter of the monarchy he was only ... think of the er the confidence\nThey wanted to send us a gruesome message that if you oppose us if you criticize us\nAh we will do this to you in public\nEnemy number in Saudi Arabia every week or the Saudi Government can resolve this public executions that they don't need to do in the streets but to cut people a and B had them in the street\nIs intended to spread fear among the population and what's happened to Mr ... it's just another example it's an old was the public\nUh be heading over over over loyalists turned critic\nTo scare or those loyalists in the palace from doing the same and that message is intended to end premeditated murder of ... is intended to do that effect and uh that was\nAnd then the humidity in general has enabled this by a supporting this dictatorship for sixteen years and that did this and that is what you have to do what you\nCan go to the specifics of what you were saying the Washington Post's reporting the Turkish government told U.S officials had asked audio and video evidence that construction in English Janelle ...\nCome from a Saudi security team detained quiz show chance he walked into the consul October second before killing him and just remembering his body the full audio and video recordings have not yet been released one person with knowledge of the audio recordings told the Washington Post you can hear his voice and the voices of men speaking Arabic you can hear\nHow he was interrogated tortured and murdered the Washington Post is also report it based on U.S intelligence intercept the crown prince had directly ordered an operation to Lorca show cheap that to Saudi Arabia the Turkish government has a king of Saudi Arabia flying to planes into turkey carrying a Fifteen men assassination\nSquads to carry out the murder one of the Saudi men were pointedly forensic expert known for pioneering rapid and mobile autopsies Turkish officials say the menus to bones saw dismembered showcased body before smuggling body parts out of the consulate\nAccording to the Washington Post at least seven of the other Fifteen Saudi men have ties to the Saudi military the planes and leftist stumble within eight hours of ... entering the consulate one isn't going through Egypt back to Saudi Arabia the significance of this highly\nYou know the the new one flew sort of Egypt and ... through the ... ... that's sort of member in the region ... each of\nThe ... uh goes up by an ad in Turkey a sort of a\nSides of the story so the the these ... bought the ... has a problem with turkey turkey host the dissidents from these countries uh\nEspecially from Egypt where they even have the TV stations and so on the this has happened after the the glue in Egypt to an end to those instead of putting uh\nA new report by Amnesty International suggest immigration officials separated some six thousand families between April in August a far higher number of children and parents torn apart than previously thought\nOn friday the Washington Post reported senior White house adviser Stephen Miller is advocating for tougher measures in response to thousands of parents with children who continued to seek asylum in the United states after playing violence in Honduras Guatemala El Salvador\nMilitia the separations were an effective deterrent\nOn Saturday President Trump said he agreed\nTo build the separation in many cases they don't dumb but also in many cases you have really bad people jumping in using children\nDo not surge older they don't even know the children\nThat are known the children for one in Minnesota ... children as they use them to go to George George with us a really bad people out there we're doing it a credible job but the ones that I Will say the ... well economically and every other was that more people want a government that ever before\nTrump Administration officials are now considering plans to detain asylum seeking families together for up to twenty days enforced parents to choose to either stay detained together for months or years while their immigration case proceeds or allow their children to be taken to a government shelter where their relatives or others can state custody\nThis comes as an Associated Press investigation has revealed parents were deported from the U.S after being separated from their children\nMay lose their children to adoption without their knowledge the a P found holes in the system that allow for state judges to put children of deported Central American immigrants in the custody of us families without notifying the parents\nMeanwhile a tent city in the desert outside El Paso Texas that what's\nFour thousand beds\nFor more we're joined by legal ... deputy director of the ACLU immigrants' Rights Project the lead lawyer on the ACLU is national challenge to the Trump administration's family separation practice also presented the first challenge to President Trump's travel ban order known as a Muslim ban\nHis argument resulted in a nationwide injunction welcome back to democracy now so it's great to have you with us we've been trying for a while I Know you've been traveling back and forth around the country particularly in California where you were intimately involved when the negotiations\nUm around getting these kids back together with their parents to meet the judges deadline right but many were not brought back we\nHaven't got them all back what are the numbers you know the numbers are shifting because the government's numbers are shifting we believe there is somewhere between a hundred and two hundred kids who still needs to be reunited and that the crazy thing about it is that they're talking about a new family separation policy haven't even got\nAll the children are together from the first separation policy\nThese kids are so traumatized little children are going to be in touch with permanently traumatized\nAnd now they're talking about it having new family separation there is going to be such an outcry just likes to was the first time may be bigger we'll be back in court I mean I cannot believe that they're actually talking about another family\nSo impossible to do it I mean after you have the judge's ruling they have to be reunited isn't is defying the courts\nSlow so what they're going to do is we get a little bit and say this is different whatever they want to call it will be back in court\nAnd what about honesty is number saying ... six thousand families right afraid\nWe have been concerned for a while that there may have been more families separated then the government was really I don't know whether I Am the ...\nFor categorically denying an accurate we need more specifics and we will keep pressing the government on on those specifics and and wait to see I have no reason to distrust amnesty is numbers but we'd like to see the government respond specifically to them\nSo you talk about for example the hundreds several hundred children right now so where are they\nThey are in government facilities in the U.S the biggest political we've been fighting now for about eight weeks is they deported roughly four hundred parents without their children to those parents are all over the world largely in Central America so we have been trying to track those parents to find them to ask them\nWhat do you want to do these are your legal options and I was in Guatemala a few weeks ago talking to some of the parents it's an agonizing decision because the government's saying we will bring the parents back we're going to still try and get the parents back\nBut if they can't come back they're having to make this brutal decision do I leave my child in the U.S to pursue asylum\nAnd keep them safe or do I bring them back and reunite them at about two thirds of the parents are leaving their children in the u._s. which goes to show you just how dangerous it is there and conservatives are saying well look these parents don't even care about their children or abandoning\nNothing could be further from the truth when I looked in these parents eyes they're such agony making this decision but they say to me I Can't bring my child back here it's just too dangerous I'm old my life's over farm killed 'em killed but I Can't bring my child back here\nWant to go to top health and Human Services official told lawmakers that the Senate Judiciary committee hearing that he repeatedly warned the Trump Administration against separating immigrant families at the bar to this is Jonathan white commander\nAs a public health service conditioned car a branch of ha chess white or for oil R O R R which stands for the office of refugee resettlement\nAnd your program about uh any policy which would result in family separation at ... due to a concern so we had about the best interest of the child as well as about whether that will be operationally supporter bowl with a bed capacity we had\nDuring the hearing Connecticut democratic Senator Richard Blumenthal also question China than white about the psychological impact of separating children from their parents'\nSeparation of children from their parents entails significant risk of harm to children\nWell it's traumatic for any child separated from his or her parents am I correct I say that as a parent of four children\nThere's no question there's no question that separation of children from parents until significant potential for traumatic psychological injury to the child\nDespite Jonathan whites testimony a top official ... immigration and Customs Enforcement agency try to defend the Trump administration's practices separating kids from their parents comparing the child detention facilities to summer camp and this is not all that had been forced men and removal operations for ice\nI think the best way to describe them is to be more like a summer camp these individuals have access to twenty four seven food and water\nThey have educational opportunities they have recreational opportunities bill structured as well as a unstructured there's basketball courts there's exercise classes or soccer fields that we put in there\nA veritable summer camp right I\nThink when we see the administration's own kids\nGoing to the summer camps will know that they're really several kinds but I'm so glad you played\nThat clip of commander was talking about the trauma because in some ways it's just starting the or the next phase is just starting these kids are so badly and the government's doing nothing to provide trauma relief we're going to try to get doctors to see all these children pro bono\nTake me away again I mean that's the vulnerability that's set in for all these children\nThe government's trying to stop the torch spend twenty day limit on parents and friends that are in prison right\nSo what they're they're basically saying oh you have a choice you can keep your child with you essentially immigration jail\nOr you can lose your child let your child go out I mean that's no choice at All right and so the government knows very well they have another choice which is to release the family under supervision even if they want to take the step of putting an ankle bracelets on the Trump Administration are better than the ... the Obama administration's\nUse of a program that was Ninety seven percent effective in assuring appearance and now they're saying the only choice we have is to keep them in immigration jail or to separate that's absolutely wrong they can release these asylum seeking families under supervision\nWhat do they say you are in Guatemala what are these kids and families face and why apparently make the excruciating decision to remain separated from their child um because they fear for their child yeah\nI mean absolutely so take this one father we went to see we said we want to come see you will see any time during the day that I Can't get off work we said fine will come at night\nHe said no the gangs closed down the town have a curfew I'm not a lot out of my house you certainly can't come here I mean that's the kind of danger these families are in what what parent would willingly give up their child they're making the kind of decision that know parents should ever have to face\nYou were in San Diego a lot of negotiating with the government at in court right and and in court trying to meet this make the government meet this deadline to release than shelter in the first set under five and then the other is going up and to their teen years\nI'm watching the government giving you and what have they even admitted\nSkiing in Washington D. C. and it's also important to note that um that the death squad that that ... headed in other death squads in El Salvador\nUm occurred as a result of U.S policy starting back in the Nineteen sixties of of training or Latin American militaries and so\nThere there is you know us responsibility in terms of building up that structure that that led to the death squad I'm In the in the just horrific violence that occurred and I'll solve or at that time\nAnd that I can ... your response to the talk at making ... ... and what this means stylish celebrated in El Salvador\nIt's tremendously important moment for El Salvador and and for\nYou know this ... took decades um and forward it to finally happened in for him to be declared a saint\nIs I I it cannot be overstated how important this is for El Salvador and and just really a tremendous a tremendous moment not it wouldn't be regardless of for El Salvador but especially after decades of resistance to him being declared a saint\nUh both in the Vatican and in El Salvador for\nFor his cause to finally overcome all of these challenges is is tremendously important um but I also do make the note that as as big an achievement and is important in a day as it was yesterday for El Salvador there's still a second piece which is justice for his killers and to this point\nOr other than the civil lawsuit that I was involved in in the United states against one of his killers\nNobody has been held accountable for his killing a and no one has has gone to jail and I'll ...\nThat has to be achieved after all these years\nWe're gonna do part two of this discussion posted it ... democracy now dot org so Iceland Brent please stay with us author of assassination of St I'll be speaking at the metro graph theater in New York tonight and in Florida in Gainesville uh as well as other places this weekend I'm Amy Goodman thanks for joining us\n[noise] [noise]\nThirty points one W. R. U. P. F. M. India will\n\nTurn the engine\nAlthough when I'm done\nWell ill the gold ... ...\nOh\nMy and my way through the\nWell mixed bag you ... you know\nI ...\nIf you're you know\n\n\n\n... ...\nYou know ...\n... ... make them the the only you know\nGo oh my hand to make the way through that\nI had laid\nBack yard ... how long are we going to have a lot and then during the day\nNot far\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\nYou know and the beautiful\nThe only\nThrough the\nIn this job is number three in the middle of this thing done on the street do you\n\n\nYoung people everywhere or making a difference\nRussia all along that has changed my life so dramatically it's helped me a lot to be fairly you know and the real world to\nMy friends I made their special what they are the best people ever met in my life\nI realize that what I'm doing is for a great art\nGet involved in that Special Olympics Donald\n\nYou are listening to W. I. UPN Ninety point one and you are locked onto progression thank you so so much for tuning in we are going to pull a job by what does speak up next and so keep tuning in we really appreciate you listening\n[laughter]\n\nYeah [laughter]\n[laughter]\n[laughter]\nYeah [laughter]\nMm\nNa na\nNa na\n\n\nNa na na\nNa\n\n[noise]\n\n\nI Do a\nAnd and it's sad that when I'm\nJob they didn't know about\nYou know\nAnd uh\nAnd a ... by\nLot of the blood and all\nTime we go\nTo the middle of the\nNavy or\nIs you know\nTwo or\nPig and thrown into\nFamily and yeah\nAs a as\nAs a\nYou may uh when I\nA a guy\nMan on\nAnd ah\nMan you know I I'm Around\nOf time in\nIn a\nWhen a\nWell\nThe the\nThe man and one to two\n\nAnd and\nBut\nOf the things that we're in the mail and the fact that\nMade was I\nTo ...\n\n\n[noise]\n\n[noise]\n... in\n\nThe\n\n...\nAnd ...\n... de da\nDe da\nDe da da\nDa da da da da na na na na na\nChange during that period and\n\nI\nKnow\n\nMaybe\n\n\nEvery\nDay\n\nAfter day after\n\nAfter\nDay every ... every day\n\n\n\n\n\nAnd you have any any day\n\n\n[noise]\n\n[noise]\n\n[noise] to ditch the shame show she ... she was just ... ... ...\nShowing that they would be in the shop so shy away from them that you're just saying\nThe middle between both versions\nThing is just not in\nTake big big but the notion of a big big big\nOfficial church crappy show certain share your main thing that we dated all day and they show it she said no shelter and being the medieval Bush taxi Russian\nShow you're going to do is talk shows they\nShe should be fine and ...\nThat in the billions of dollars\n\n\n\n[noise]\n[noise]\nI don't\n\nRemember or an elder to him and ... this is your alternative source Ninety boy one up at W. R. UP Indiana [noise]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\nYou're just you\nNo they're not there the day so I don't\nThat I've been able to\nDo a little piece of blood\nAnd\nRead some\nAnd being met John during\nAnd\n\nOh I don't know\nIn\n\nAnd then and then the the big bang all those things\nThey didn't they didn't have to do\nAway and he even because\nThe big\nBang bang bang\n\nI could be\nGoing to do with\nThe ...\nGod and some things\nAffects you and me\n\nNew Jersey say\nDarn shame they been\nStuff do you know\nThe by\nAnd nice and then in the man\nMan the games are made by the next day my dad [noise] to be in the next she won a bag of Jane and Jane\nThe\nDog doesn't seem to be the last decade in combat and game shows and then the new thing in the\n[noise]\n\n\nImagine a time when no one person\nTo be able to buy milk family tragedy of all\nThe best minds in America\nAre doing more can imagine\nThe American brand foundations seeking to find a cure for life without brain diseases and just something we can imagine [noise]\nJoy ... brand\n\nKnow about the John\n... should not\nDo anything bad or as soon\n\nMe and\nTo be able to change me me me\n[noise]\n\n\n\n\n\n[noise] oh why\nWhoa\nWhoa\n\n\n\n\nWho broke the\n\n[noise] [noise]\nAnd\nAnd\nAnd I think the dining on you know clean and to me and my understanding and no and counting on thinking that they can go and maybe they're all in the morning and go\nDown down down\nDown down and go\nOn to planes go ...\n\nTo a game show people\nThat you know why\nYou know\nAnd\nI think they know ... and ... and ...\nAnd have you on a bigger audience on\nLock down down down down and he was in\nWorld around them all down ... ...\nI don't know why I\n\nDo you know\nSo why make the\nScience\nAnd take a bunch of the nice why\nMy wind surfing\n\n\n\n[noise]\nCome\nReally are made I mean\n\n[noise]\n\n\n[noise]\nA song and thank God\n\nGod it's a dog thing [noise]\nAnd you want a take a cab\nWhen a shower\n", "year": "2018", "show_name": "no_show", "city": "Indiana", "day": "15"}