{"month": "10", "state": "PA", "station": "WIUP", "content": "Diverse in commercial free you're listening to Ninety point one F. M. W. I. U. P. in Indiana, Pennsylvania Mm\nSing out magazine was founded over sixty years ago by a group of folks who loved roots music [noise]\nToday it's vital an entertaining resource for anyone who loves folk music world over on your host Tom ... joined me each week trip ended a fascinating world with folks and roots music I'm missing out radio magazine [noise]\nListen to this thing up radio magazines Sundays at noon right here on W. I. U. P. F. ... [noise]\nYeah I Do and this is Joe Walsh speaking on behalf of red fish so wrong general right but don't drive home you're drawing says you drove Tommy a\nI have a limo coming get [noise]\n\nYou know the national association of broadcasters on the council\nOne game if we played um ten times they might one night\nWe stay with and we shut down because we can [noise]\nWhat's real so\nYou got two more quarters that they're\nThe most of even playing this game for ten years\nYou get to more water after that most study will never played this game again largely [noise]\nSports talk live every Monday Wednesday and friday\nFortified ... where we talk all sports all the time\nAnd it might be one of the nobody except you know\nHere on your alternative source [laughter]\nThis is Terry Crews actor former football player and father I'm also an expert on drama that's a good kind that comes with having a house with a kid and the Philly drama like the drama around my particular tour and then there's the drama you can skip\nAnd skip the drama that comes to not having your high school diploma or politically in my free adult education classes near you and then as your diploma and then as you did was on the door to the dentist finished your diploma dead or lead the drama an actor's like me to you by the dollar general literacy foundation and the ad council\nI'm Amy Goodman says democracy now your daily\nGrassroots political I did that in international independent dollar\nW. I. B. M. than now airing democracy now from the week Monday to friday that might be an alternative to W. I. P. Ninety point why not have\nTo know you won't forget [noise]\n\nOther than the W. I. P. F. of radio ... my best to\nEvening everyone and welcome to the award winning show here on WIP FM your alternative source the jukebox nobody know welcome everybody\nNever again you interrupt me [laughter] I I haven't had to do them sorry is okay I'd rather hear me shut up anyway it's either three here on the east coast and you're tuned in to of course to again the award winning show are you ... you know we play all the oldies all the classics and um yeah that's what we do so you don't say anything else\nIntroduce your first of all\nYou know you've got to be on the spot I forgot I honestly forgot what are my first I Want to hear all help you out with that yeah please help me out because I live with Warren Warren swore that would have ever go there we got okay I was like I was trying to figure it out and like I Know it's it's one of the two\nBut um this song warrants usually know but there's some she's my cherry pie but I did this is if not my favorite Tom by war it's on the same album but this is Michael Tom's cabin\nBoo\n\n\nBoo Boo Boo Boo boo\n\n\n[noise]\n[noise]\n[noise]\n\n\nBond that you know\nDown there and\nThen later on down\nThe down it\nDown and say here's\nNo legs let down another\n\nThere are a little while\n\nWe\n\nPhone call\nOut\nYou know\nNo but\nNot down in your job\nAnd I'm not going to\nDon't know that goes down it was on a mountain guy [noise]\n\n[noise]\n\n[noise]\n[noise]\n\nAnd that was uncle Tom's cabin by Warren a song that you know like I said before the show even started I was like Jake what are we starting with restarted within you know there's a great way to start a quick way to kick things off it was under the knife take off but you know it's only ... exactly\nSay those are ... by ... by a warrant I almost read the entire label on the album called warrant cherry pie and I was like that is not\n... there'll be artists that is artist slash label I run a move it up a little bit and I'm going to steal a little bit of limbs thunder normally he's the one who played a lot of Billy Joel on the show dominance deal tonight\nUm I don't know I've been getting into um recently a um you know good duty so good you know that's why like trigger phrase in if you're a listener you hear me say oh I've been getting into them recently and then like for the next six weeks I'll play\nThem you there's nothing wrong and there's really nothing rain they have all the doors happened with ... with nerve on it still going on actually so ... it's funny because usually influenced me with music now I'm kind of influence and ... it's a good trade off I mean definitely it doesn't matter but yeah here comes Billy Joel with one of his most notable hits\nA no reason for ... for me choosing this then it's just a great song altogether this is up down girl [noise]\n\n\n\n\n\nThe last show\n[noise]\n\n\nCaroline some by Elvis Presley the original song was by Neil Diamond but I mean Elvis is covered what what does he ever screw up I honestly do I don't know any single sons your goal I Love all those\nI mean I I'm a little by some huge Elvis fan but yeah I mean it doesn't matter to him and he became a rock and roll for a reason you mean if it's good plate and brag about it ... exactly what I did\nBut that don't definitely it's catchy and this kind of leads onto the next on that um that definitely catchy for me um there's a bagel are used to be wagging I don't really know a whole lot about them immediately but this one song I Know almost by heart and every time it comes on the radio or on my platelets I Can't stop seeing it in the car because you know obviously either five hours away and I drive a lot to come here\nAnd we want ... location Liam I live in Philadelphia oh my\nKeep on Libya but are you the leg up\nBe a man and a bunch\nWas into it and then he said he said well\nAnd [noise] you know why\nI meant and maybe I don't\nIt\nRenee we're due\nAnd everything you know man community and never were\nSad when I went\nTo the man that I don't know her and I know\nNa na na\nI don't\n[noise]\n\n[noise]\n\n\nKeep on love you but are you a speed wagon or ... ... dragging ... yeah\n[laughter] she will be will be able to go in and saw it's ... it's called me trying to make a joke and then ultimately failing in the end it's fungi always do it is fun\nBut yeah that was even loving you buy a ... I Can't get who need to blow up your mind I Want to say it's like ... by them all the time yeah but we're getting ... who loves to go to Ben is understandable I mean yeah you're right uh we're in transition to clean credence Clearwater revival and we're going to go with one of their hand\nBeginning of that whenever I get into something I Will I Will play it forever\nOr see this down in the corner by um CPR\n\nTo\nAnd I guess a tablet they\nIs valid advocate\nA rabbit days has been\nIt's pretty\nUm [noise]\n\nI listen to W. I. V. FM radio hovering over the mother of\nThe I don't remember last week we played that and you really were like oh this is where random boy we found gold\nI just I just the one that's called ID bath tub I'm like okay this is most interesting so let's try and we did and it was the best light decision we\nLooked at each other like we found gold flick that will be equipment like ... or like\nSomeone in the Eighteen hundreds or Nineteen hundreds or what a nice and Eighteen hundreds Nineteen hundred like striking gold like what California listen you know there's there's anything guaranteed with you and I chose um like ID and PSA what it's going to be Joe Walsh Terry Crews and ... the ... that's ... that's always the tradition it always does and if you ain't download that\nThen okay and hopefully I don't want to spoil anything but our new promo that comes out soon\nWe I'm a huge spoil want to say anything else but like oh you're not going to say I'm not going to do anything else like if you're listening\nTo him coming at you do a radio near you or women I make an idiot of ourselves on a pre recorded track ... a son\nAnywhere you want with our website and with you know shooting it up and they're going to lead joined Exxon by journey who plays with uh the last one that I'm going to play and then uh they just under their tour and this song is anywhere you want it by journey\n[noise]\n\n\n\n[noise]\n\n\n\nThe chain by Fleetwood Mac you know Stevie Nicks um I had that one person's head\nBut I don't know like I Know they're coming to play in a November and I'm super jealous for anyone who swear that I Know they're they're coming to Pittsburgh in November well yeah I saw on ...\nOr heart radio on uh the cw the other day it was pretty cool Islam new channels and I hear I see Stevie Nicks and I'm like whoa yeah for the ... member and I'm not sure he's like I I'm envious for whoever is going to see that concert I Wish I could afford tickets that but they're charging\nExorbitant amount of money for that yeah unreal him in the town and I'm very upset about and I mean\nI don't know but yeah that was a chain by Fleetwood Mac I'm a forty two here on the east coast you and you buck Ninety point one W. I. D. F. M. Europe's unity sure with me and you know fun time we did have someone call in over the over the ... song you did and it was amazing I Love fan interaction um\nBut the ... unfortunately the song that they were quite a week for some reason could not find we couldn't find it so we apologize I thank you for your call your request um if we find something like that will play it we definitely will please don't go on your toes\nWe're sorry yeah ... it's like we are just like yeah but if anything like\nYou know definitely call and we love to talk to you guys yeah and you know\nYeah and when they get into also if you want to like requests as long as well yeah you want to shout you out show ya you know why would you make a request and not give us your name I mean I can you know your full name I can understand or even a first name or nickname or something like that um but yeah I'm again toll free number seven to for three five seven nine for eight seven\nAgainst Seventy four three five seven nine eight seven to request the song from mainland to play 'em if we get enough request NATO\nThis one in ... I think you've got some pretty big news for the ... yes I Do about yesterday when I was playing morning mixed rock and roll hysteria ah which when I ... from eight to ten am on Tuesday\nJake had checked me although I should have known prior to him he said dude death leopard just got nominated for the rock and Roll Hall of fame and I was super excited I had to look it up to make sure that my you know my eyes seeing that tax or not the feeding me\nAnd it turns out they were and I am definitely you know I'm going to vote for them they are my favorite band of all the time we were just stop you right there I actually forgot something I I'm a member apologize for stopping you but yeah of course something I forgot to mention Stevie Nicks is also being is also good\nThere's also a person on the ballot for the hall of fame rock and Roll Hall of fame that along with what Britain that amazing I Know but you know I'm voting for all right Lynn gets yeah let's get to this one sounds good and this is gonna be\nThe biggest that the song is amazing by far and it's what my show is actually named after the stereotype that [noise]\nA\n... [noise]\n[noise] I don't know if the\nNine or\nAround\n[noise]\n\nAll\nOver\n\nAnd ah you\nA\nDa\n\nDa da\nDa da da da\nDa da\n\nDa\n\n\n\nVinci ... Ninety point one W. I. UPS then Indiana's alternative\nYou know that they did not like the about the day\nTry to hide the light on the\nSide of the rank of New Jersey I'm not a bad thing to do that you know\nWhat church not black good dogs right now that I'm\nBy the ... really I live in a way to fill in the last\nMinute and\n\n\nA\n\n\nLot\nA guy with a ...\nSide right on\nLine and running on a lot of\nMoney in the\nDon't know I Know\nI think we're ... we're going to have you\nDone for\n\n... ... ... ...\n... to ... to do and where and how you know and\nThen and then\nWhen\nI go down on the\nThat I Am in\nOf the band you\nKnow Mad Men and oh\n[laughter] na na na na na na da da\nDa da na na na na na na na da da\nDa da da\nDa\nDa da da da da da da da da\nDa da da da da da da da da da da da da da da da da da\nDa da da da da\nI'm not that I'm\nAnd do a survey so na na na na na na na na na na\n... years ago [noise]\n[laughter]\n[noise] [noise]\nAnd and the new news shows\nUp in the in\nThe new one he made a\nLump in my mouth by now but I have done a lot and all that that there is\nDoubt that a bad and that that was what\nWas that long and guidelines that di\nDa da da da\nI Know you know I Am [noise]\n\n[noise]\nHandy earlier and earlier and I am a little earlier than\nI Am and I am angry and\n[noise] [noise]\n\n\n[noise] ... during the honor waiver harder dollar doggy occur there were you know\n... even see me again never again for the other end up ...\nNo no no no\nNo no no no they don't [laughter] rain down our we bailed out to be a mom I Know\nGuy that sad that I\nOn on on me\nNow and I believe the mother and my old she really da da da da da da da da da da da de ... main\nAnd\n\n[noise] [noise]\n\n\n\nWell\n\n\nDo they do they may be maintained they may be\nMaybe\nAround a\nA\nIn the school\nThe\nToday they own a\nBaby and you\nOff the uh\nAnd\nAnd a year and that made things a little\nDay the beneficial\nFor them and bring\nThe back of the day\nThe only thing\n\n\n\n[noise]\n\n\n\n\nYou while you're here in Nineteen forty one in the end up to a survey [noise]\n\nWe got some more science vision on the way coming out just soon folks it's the future of music you get tuned in just getting everybody [noise] but [laughter]\nGood for the sound effects next week we're bringing in twenty sound boring yeah we're bringing all of a sudden I'm going to be ...\nBeen in just a straight our sounds and\nExplosions and other walkie affects we've been checking off his performance hot off the presses yes this is science vision on W. R. C. T. two days ago let's see that must have been that must have been a Monday\nSo they got there and how they got their local music situation on a Monday we got ours on a Wednesday so beautifully that works out for us it's a beautiful music is and the Internet I mean couldn't have gotten is that a lot like wild yeah that\nWe that a band like this performed on a radio show and where are another radio show in playing that same\nFor me yeah I mean it's it's just like and it's just ...\nThere are a production on their albums you want to check them out on bank camp just check out science vision all one word\nGot plethora of albums some very heavily you know produced some very barebones some real psychedelic like Chris Rock stuff some more just like rock band received on the guitars but they've been around for a long time and they're making some cool music up for this performance they brought in our friend Paul Malik\nAnd ah he was jumping on that last song and Jay's on the on the ... synthesizer given us those cool dreamy stint\nTextures I Love the little ... was different\nFor sure really like to be sure different you know I like to keep it as big as possible on the show you got to leave it at all but now that that texture it's that it offers something different from you know your typical just guitarists or something along those lines you know sure does\nBut it's an excellent up it's called endless safety from science vision check it out\n[noise]\nSo [noise]\n\n\nOr a\n[noise]\n\nWhere to go right into the next one folks what is it called G the names and titles and other factors good eating in ...\n\n\n...\n... [noise]\n\nAll right that was Jim grand caravan we played a couple of tracks Frisbee at either Louis new ocean then we had situations last but not least is Pepsi okay the seminal anthem of open Mike night thank you Joe ... for the years of great music and great open makes that you've landed us we're trying to carry on your tradition of\nHaving a great little open welcome spot if anybody wants to check it out you're listening and you're in Indiana area particularly if you're in the age group of Nineteen twenty five would love to see you opened like night on the on Mondays at eight in the hub Ohio room it's a great time\nSam their sands DJ she's up next so stay tuned for that the underground is coming up\nSo I'm going to Sam Sam what are you got for us to know what what what are you got queued up you got anything good\nAll right you heard it from Arafat to stick\nAround for the underground this has been local limelight we've been bringing some great local tunes\nAnd or obscene you up to hear from you next week those phone lines should be open wide open ladies ingest\nIf you want to give them a call ... she'll be here for two hours seven to for three five seven nine for eight seven please be time to be respectful we'll take your call off the air and are just starting the garbage so I have a great ...\nAnd uh we uh can't wait to hear from your next on to an extent folks getting\nDog [noise]\nOr all things\nCrowd was killing mind in the middle\nNow of course\nSaid if I get there someday his car parked outside\nYou out here in Nineteen forty one Indian or Pennsylvania [noise]\n[noise]\nTo consider or\nIts way to go next week they buy election address and I\nYou know I think to\nGet your phone losing\nSome of them not gay should go to the home\nWhere we were\nYou know the only\nBack to\nThe games you know how bad\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nDone on the air but I Want to be taught me\nTo beat them you can jump in\nAir bag\nSomebody's name somebody's yelling\nAnybody airbag gotta ... it's like why didn't get to do that and then but then press body cameras in the ... and I'm not the type of guy did he bought it for one thing I've written by them more change when the men that\nMy right and the split the yeah\nThe reds games I take the kids and trying to make the monopoly data that have been many ... I got my age group I'm this is great you know they were there at the gym too and I got I got to do what I tell them that they don't mean Malone leading bone I Would do\nNothing but a little money but I'm Glad you and it's like\nEverybody's got an idea and\nIn the air but I won't be done\nLead them jumping in\nAs bad gotta know somebody bad bad guy to somebody's I ended up somebody does anybody ever by ... that was my down and said that they can build a purple developed is preparing making them feel red light on the job the brain and in the job\nBecause you're taking Rob the\nThey didn't really understand what you have\nBeen born in the wind blowing in this world that you may go low co world media but the thing that I Would hope that the danger\nIn my life be gave up a new gamer gaming Denise ... which really kind of stuff to complain when you do you want to not really the Monday Night the king and local ... got to be\nFound anything by war and\nLeading the young man\n... and I'm ... and my dad on Monday and known somebody down and you buy the onion\nAnd by God and man or [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] All right everybody in the car let's go\nFirst to get their mom go for hiking or wherever they can do can we go canoeing to see why on does it take to get to the force it's not that fire sweetie\nWe're here oh\nWell you ... the U.S for a survey\n\n[noise] neither one\nOf their own making\nMe\nThere to keep you play [noise] tell me they were making you\nKnow made me made me believe me\nTo be the only good for me you know more than they probably\nThing that we do\nNot want to give me any\nAnd they let I gotta do to even put games [noise] do they keep you mean by that and then they\nWill\nBe me me me\nWhen they\nWere they did you\nIn New\nGuinea\nMean one of the one or the ... are now\nMight be going to be the one that you know when my mother in law would do\nOrder to be the only good if you want and need only tell you why you can't do that\nAgain\n\n\nClarity marrying the\nSnake eroded she's out I'm gonna take charity marry me marry me and he wants to shake and blended damn rain ...\nI Know I Love your wind channel that does worse lead piano lessons or live\nA no no we were staying together when there's\nA a\n\nFast way where it's you know\nWhen every single movie makers fashioning gravitate\nTowards anything that gives a sense\nLoves to act as I Know my love for girls got some good that\nFall when she was four\nOh five what you were reading\nLove your enemies wish from English\nNot about a no way to make this me mad\nAll right to call\n\nEverybody who we know it was not a ground shop were down\n... name can you tell me now to over ...\nToriana as bad as it would seem to be living during\nThat show that shape but I Can't tell you what it means to me [noise]\n\nYou take away the pain and\n[laughter]\n\n[noise] 'cause I don't need to know that but I find them much fine\nNo wonder why do I do I buy the diapers let me put it that ...\n[noise] but at that\nI think it's a gift from God you\nKnow you do need to get it get a job I'm a direct not only on gay son\nStill going to set my own story snakes I'm excited\nBecause I don't like Gucci suit in a town like you said this is just kind of bringing some rich like and what about you know you have these uh Bob during the campaign but the but good luck it because now\nI like Debbie and it's not a game they may not be I'll be\nHow did you see a little bit the men in black\nBut I looked buying them much at the time no one knew what\nDo I do I know I don't want to [noise] put an ad that the lead in New Hampshire [noise] put it that that\n[noise] but that that\nBroke through or they can't can't do go do what they do go back to what they want that will get so close to gauge the inner strength I'm a bully in the bed only found that only have one I used to be [laughter]\nBut I get ... to find good it's not going to be cutting bargain in stock and they spent ... and you don't have any idea what I Want I never been to me all your films download all can really go to sleep in\nSex don't read he just blew put it on an airplane so none of those calls come here do words to money ladies don't you get these give these you know they can make you rich and they can make a comment\nOh\nLet me down and out on that but that but I find them much fine no one knew\nWhat do I grew up with what I Do [noise] but I like the lead in New York [noise] but in that that\nDo it either [noise] but it\nStill [noise]\n[noise] [noise] [noise]\n[noise]\nMm [noise]\nSome uh some I don't think of a lineup me me I'm a I'm a I'm\nA\nA I'm\n\nGoing\nTo talk of the new games will not be saying that\nLike no one me\nSome uh some uh some\nMe some uh some\nSome\nSome uh some\nWas mainly about maybe how much time they just like the about one\nOh\nYou know\nI Need to know what did you get to get out of my father was like oh wow that's scary as well you know and I want what I really really wanting to buy\nTicket to go for\nMachine that then I go so\nScary and what I Would I really don't know\nWhy do you own it by its okay on me but I always say your time other women donors when I'm off work and you know it's been turned down at school\nThat I was going away from the no no\nI never like I don't want to do it when we get to the you didn't like being able to know\nI Need right now it gets to get my father was like oh wow that's Gabby and I know what I what I really really want to buy\nTicket to God God my\nFather was it that then I go every day when I read every they won the\nBritish got into in the Bush will come on let's say you got it from getting blaming the pony on camera\nThey just need\nTo put the late ... when they leave and never did it\nCame in and I wanted to make my own and no\nAnd the thing\nThan I Am name\nKnow what they can to get out of my father was like oh wow that's Gaby ... low and I want whatever they really wanted to buy\nScary thought what whatever it is really bonded\nIs I Need is by ...\n[noise] right [noise]\nThe thinking ... got it you know I had they might have ... the same by hand why me why me why the ... the ... and I do\nOut for a job where do I try to do much\nPart of your friends do much better so the only things trained they won't get all your ...\nGot you know we're going to hide\nOut here I miss a pound lump in your mind\nBond with a little rough patch thank God I'm never\nMoment deep abject showed flash that bomb plot\nFor people that love and when you penetrate in my mind to penetrate that must be ... billion a chemistry limit diminishing unique utility greater than the number\nOf years I got that would be better than I might I doubt\nI did I might add our data all ... you know I had a ... ... [noise] see my wife she\nIn my ... [noise] see my ... and I do\nDirty on\n\n... when\nAt it when you sign\nThem feel better than the ... green with cameras now is the protection\nThey can make them a bay\nCity a couple\nMaterial ... ...\n... ... different\nAnother one and she brought it down on me I put a number of the\nShe's Twenty one no case she owned in\nLook for in the low on them\nAnd of course I let you know when I got ... we went in and yellow ... come out with a cat or something you really I got married and I might I doubt\nThan I might add out [laughter] ... you know I had they had that ... scene [laughter]\nSee my wife I see [noise] see\nMy wife ... the [noise]\nSee my ... and I do a lot of time for a while\nNeeds to know in\n\nHold a job was shown a set of\nDiverse buffer no talk shape Panetta\nGirl do too much but has\nThing but I can get there and do you ...\n\n[noise] [noise] [noise]\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da da\nDa da da\nDa da da\nDa da da di di\nDi di\n... what do you mean by blaming the season for playing a little more about what people say what you want me to see the game I play\nRole model and homeless animals\nPublic people\nAnd go you go you know I'm loving mood just like you wouldn't serve it\nMay be magnate earning show me the way you were telling me what is your afraid of about my favorite bird just let\nIt go take a breath out one at every ounce of love that you are my drug in love to feel free to follow you are a good job or not I mean your dream so were you there I mean she\nIs the only one that go way up known as wherever number for this thing yeah\n[noise]\nThing on line\nIs who calm and collected I knew that you would be one when I mean you're leaving me breathless they okay I Need a second they did they give me a tangent I Want to take care of you marry you something I'm prepared to do there can't be do you would hear from you\nLike I Do I Do not mean do\nRain right games of hide and seek my no\nI'm Still trying to show I'm looking for a day\nFinancial sunshine right and\n[noise] [noise]\nYeah the actual stained glass average\nDominant behind you know about every last march skip a beat and I guess ... CD red skins metlife butterscotch in your lives may psyche away let's take a plane to\nFiji make a day let's take it easy [noise] love is power sweater something better to make me nervous and her Mother Earth and gave us so if you made your perfect peace them and go do this or do you go you know I'm loving mood just like you wouldn't serve it\nMay be back me Ernie show me the way you can tell me what is your friend of ours which you may remember this led [noise]\nJust go take a breath I Want it every ounce of love that you've got to have you are my drug in love to feel free to follow you are a charming or a mentor dream so were you there I mean she\nIs the only one that got away of known as where I Am or never have a saying yeah\nI'm In new\nAnd she is who comic elected I knew that you would be one when you leave me trapped let's say OK I Need a second they did they give me a transition I\nWant to take care of you marry you something I'm prepared to do there can't be do you would hear from you get to take that step but now that I\nAm ready you will not you up and let me hope your new may make you laugh like I Do I Do not know wherever you are my obsession that just going to be ... um tonight\nAnd I had to pay that price\nEverything I knew his from everything we do is try and start a family loaded onto wherever baby you're itself to have that in your head it's crazy\nThat bombing detonating look at this measure making I M nicotine you order going look at the chance we're playing [noise]\nOh we had a love they love was backer reggae singer boy in New\nYork is not\nThing among\n[noise] um\nYeah I'm a you know I mean right now which I\nYeah yeah yeah yeah yeah [noise]\nYeah yeah yeah it was really round [noise]\n[noise] yes yes [noise]\nYes yes\n\n[noise] [noise]\nThat look old before you roll smile\n\nOther one\nOnly drawn into the team to team in\nThey just said the same\nEither change how they\nOn his way home and like like an old man\nDrama game to\nCannot change people\nMay be like a McCain jumping up and they pay\nA\n\n\n[noise] yeah probably na na na I agree\n\nFeel oh that's\nBe on for ten\nNow why can't every day we like to smoke a cheese and the beach like staying at the beach like based on the conversation ... ... with a big country like this the demand like I Am like around like that around me in his life\n[noise] [noise]\n\n\nWell you don't you're going to turn on W. R. U. P. Roger\n\n... one\nIsn't that hey\nWe\nWant to vote shot down in the nineties\nIs really shift and she says will give you one of mine and he will eat them she says the ... century\nMore than they shy GM come from all\nFemale ... what have\nPeople on the other hand if you're the one hand\nTo tell me things\n[laughter]\nI'm sure if he can't get to know when she died she made\nMe much\n\nThe one thing and\nYour hands\n\nSome kind of shocked me\n[noise]\n[noise]\n[noise]\nOh\nA\n\nRural\n[noise]\n\n\n\n\nOh I Know we're\nStill having\nA wind up\nOn\n\nThe phone\nBills on\nTime\nFrom time to really and\nYou find that I'm not even know how to live for NASA and things like a\nCommon name\nOh now that's not one of those\n\n\n[noise]\nWhy do you do on the ground\n...\n[noise]\nOh yeah I'm\nGoing to be a\nGood thing [noise]\n\n[noise]\nThey said we'll wait to get the job we read in the meantime inspired by\nA giant ever\nGoing to be a good even though [noise]\n\nHe did and [noise] that\nThey bring down a mango\nAnd um [noise] not too many [laughter]\nBack in time to spend on other than that\nNo no no no no no no no no not God\nAnd the way the\nDa da da da da da da da da da\nDa da da da da da\nDa da da da da da da\nDa da da da da da da da da da da da\nDa da da da da da da da da\nDa da da\nDa\nDa da da\nDa da da da da da\nDa da da di di di di di di di di\n[noise]\n[noise]\n\n[noise]\n[noise] oh it's just like to go into the movie oh no God\nBut God right now my mind when I went up to\nDay and not only am I right\nAgain\nAnd what we\nCall a God and to come\nHere I Am [noise]\n\n[noise]\n[laughter] no\nTo go there on your job\nIs like whoa whoa\nWhoa [laughter] you\nKnow get all of them but there's one\nDo we believe right now my my only know what we're doing with the judge and when I read it\nThat they want to comment on our on our talkline around go dark oh\nI'm Talking about here I come\nTry\nDo\nThat but I\nKnow\nOn that\nOne would be like oh my God how can I come in and we were talking to him they're like\nOh my God\nTurned\nAgain\nInto [laughter]\nWhoa whoa whoa\n\nWhoa whoa\n\n\n[noise]\n\n\nTheir\nOn to actually affect the baggage often and try to do a\n...\nGiving a God and pay and then by you know what I'm saying I go back and indeed you are and\nAnd they can be a\nWeek and a and B and ... and our\n[noise]\n\n\n[noise]\n\nNot going to draw a\n[noise] but a\nDuring the day I die and now I'm In a\n[noise] a\nOr do you live in the audience\nThat I Know that there are and da\nDa da\nDa da\nDa da di di\nDi di di di\n\n...\nMe the\nHe shouldn't be shouldn't be she can be conceived in the ... job\n... all\nThe people where you live here say shall be old dog\nNot do that [laughter] you know she said\nAnd to me that\nTV and I and some you know and it seems to me you know\nThe way by ... I don't know falling\nAnd I was you know all these years ago and then you're going to be run by ... by all the all the wide open all the jobs that have already\nCenter and risk by oh what\nI was you know in\nThe last year on the dot com and died\nAnd\nThe news and bad I Will say that I mean there there's no\nSense of the year and he died\nMean you know\nThere was no no no no no no question or news you know\nHer\nReally the way it was it was really rely\n...\n...\nWorries that those\nAre all\nAlong [noise]\nUm\nI ... yeah it's an\nMan died or been set up an office\nAnd I\nOften say the name of God\n... in\nIn them and then came back\nAnd change it and say that either and you know which is the died or hang in there and do something and you\nI mean there are no\nThe answer to die by any means that you know\nThe here and da\n\n\n\nDa da da\nDa da\nDa da da\nDa da da\nTo stand in front of the [noise]\n\nCan\nA chain and da da da\nDa\nDa da\nDa na\n\nCan learn to do\n\nThe ... [noise]\nIt's been about\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nOh\n\n\nVery nice man\nIs free you know what I mean when\nThey lose your next grade book a new\nA bunch of ... do you mean the real world ...\n\n\nNow\nIn\n\n\n\n\nOh no no\nNo no no no\nLow ball idols there would\nOh my lord\nMy\nOh\nAnd not say the\nOther day every other day every other day on the Reagan ah the yeah\nBy whatever among the God oh my God\n\nBad not\nBe there when maybe [noise]\n\nEvery other day and every other day every other day on the way you get by\nI never going to find me cry and I'm\nA\nMom live on the uh I don't do drugs that they uh uh uh well new\nModern day John\nNo no no no mom\n\n\nYou are listening to morning mix not only on WPN Ninety point one\nWow wow\n\n\n\nI'm Donny Don and there's a big advantage parents can give their kids making sure they get activists sixty minutes each day [noise] studies show that physical activity not only helps kids stay healthy\nIt can enhance important skills like concentration on problem solving which can improve academic performance [noise]\nHealthier kids in the most important game of all [noise]\nLearn more and fitness dot Gov brought you ...\n\nThat was Ann Marie with snow bird and before that we had meatloaf with two or three a bad Mary Lee rushed with angel in the morning\nWe had\nMonday by mom was in the ... everyday people by flying the family stone\nHeading heart to wear don't dream is over and we started off with Rhiannon by Fleetwood Mac the weather right now is Seventy degrees very humid and also kind of rainy so be aware of that it is not good whether it's going to be a low forty on\nThe next few days are going to be actually cool because they're only going to be in the forties and fifties tomorrow and Saturday being forty nine and ... in Sunday being fifty nine so\nIt's looking like fall again for the for the past week it's looked pretty pretty much like summer it's been in the eighties but we're getting back to the phones what our weather so if you're\nOne of those people who are more into that I'm happy if you're someone who likes the warm weather I'm Sorry I also like warm weather but I'm kind of excited to how\nIf you then you might want\n\nAnd ...\nOh yeah\nAnd you know in my hand and laying on the phone rang again like I really can't read it on other than that oh well then no bend in every way around and\nGo oh\nJohn Donne invited on God da da da da da da da da da da da da da da and thank you thank\nThey knew\nThen and then also you know we cannot be three in the drawing you\nSaying that saying that they they got new di di di\nDi di da da da da da da da da da da da da da da da da da da da ding\nDing\nDing if you you\nI'm\n\n[noise] mhm\nA\n\n\nSomething for everyone you're listening to your alternative source W. R. U. P. F. M. Indiana\n\nHe\nDown there that is not\nYou and I gave me a new place [noise] how do you think about a ... way\nOne man you don't need to know me\nWhen we go on the ceiling along [noise]\n... know\nWe [noise] means you may know oh okay\nSo excuse me I'm Sorry Seventy four three point nine four five zero zero zero for an official\nCraft or vendor application in additional information again the un is in Indiana social central healthy for crafting vendor chauffeur Donny into three PM Saturday October twenty at at the Centre located at\nAfter a vendor conduct Amy phone at Seventy four three point nine four five zero zero for unofficial crafting vendor application in additional information again I Apologize for the first part something happened and I was very unprofessional but it won't happen again\nThank you for listening to the idea than Ninety point one next up we have sunshine in your pocket by militants\nHere a WPN\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nMy God we have now that I Want to me I don't get anything out of my God I think I don't want to be in\nThe NBA and um\nDay to\nOh my gosh\nAnd ... and ... and\nAnd then they\nThe big news or\nThe way that they gave me the\nName of the same thing I Do I\nYou know while\nThey when she said to me oh\nAnd I just\nLast year\n... driven three that's been to the\nI gave the engine and they and they said oh by\nTo ... and\nA last year\nLast year\n[noise] I mean when you hear\nThat he really although although no man isn't that what they do\n\n\n... I'm\nLast\nLast year or\nYeah Jo Bonner job\nMy\nGod oh\n\nLonely man no\nNo no\n[laughter]\nToday in the top and rock and roll from them\nWe're quit laughing like seriously folks senior should be listening to this home part you walk in classical radio program every Sunday for three to six pm regularly direct target store go up and\nNot only did they choose our dog but boy that on our channel we had sunshine in your pocket by a lot\nOf my head\nUp next climate chameleon by culture club here in Ninety point\n\nIn in in in [noise] in [noise]\n\nIn your community fires in the city [noise] um it\nUm\nDay\nOn the show\n\n\nYou weren't walked onto your alternative source Ninety point ... W\n[noise]\nWe live in a\nWritten [noise]\nHere's what you mean you\nKnow\nWill\nBe will be the\nTop people choose not to the gate sat on\nWhat will be will be [noise]\nWhen I grew up\nDay here's what\nThey know\n\nThey will leave the future is not the\nCase that um that um [noise]\nWhat will be will be [noise]\nNow I have to really my thing was when I\n\nWhen I [noise]\nBe will be in the future is not\nThe case that um\nWhy will be will be\nCase that [noise]\n\n\nJust don't do a business in the ... and I don't know what are the do during the ... been\nEnough and they really\n\nAll came to want to go into the bin\n\nWas\nMad Men and women\nThe band on\n\nDone\nIn the\n\n\n\nIn any [noise]\nToday [noise]\n\n\n[noise] I'm starting to dread the weekends because of my husband's drinking he doesn't stop drinking into he's out of control and passes out\nA counselor told me to try Allen them family groups I didn't think we can drinking was dead serious\nBut I'm Glad I went or you troubled by someone's drinking you might be surprised at what he could learn in the ... family group from people just like you to call one eight eight eight more on and on er visits Alamo family groups dot org\n... let's dance by Christmas contests and before that we had\nJames Taylor with how sweet it is time Richards with indoctrination\nLa la la la what's copycat mini ... with when they flare\nShared with if I could turn back time George David case Iran and last child by Aerosmith\nUp we're going to have ... with humility but first um the weather outside is still rainy and it is Seventy degrees and it's going to be a higher Seventy one and a low forty four so it's not great weather and as I've said in last hour\nIt's going to be very cold weekend because it's only going to be in the forties and fifties so be ready to get out\nHere it's really fun\n[laughter]\n\n\nA little bit [laughter]\nThat a\nA show [noise]\n\n[noise]\nNah\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\nI'm just so rich don't\nDo\nSo\n[laughter]\n\n[laughter]\n[laughter]\nYeah I think\nThey\nHear\n\nThey\n\nThat [laughter]\n[noise] [noise]\n\n\n[noise]\n\n\nDo that you\n\n\nA\n\n\n\n[noise]\n[noise]\nDa da da da\nDa da da\n\nDa da da\nDoing random number a pod reading drowned\nGuy\nThey should read\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nOrganizing operated by a group of carrying in committed volunteers the evergreen concert\n... served in the works to raise the quality of life for citizens of our area by monitoring stream quality in conserving wildlife habitat scenic feast does industry and access\nPleased to ... percent every by becoming a member today monetary donation or tax deductible indirect\nHelps their hands on support and it's also greatly appreciated information on projects already completed and those being planned for the future is available at W. W. W. dot\n... conservancy dot org were by calling Cindy project at seven to for three four nine for three three three before that short PSA we had David belly\nBefore that we had we had Francesco by near long night\nBy the aesthetic rubber band men by the spinner prince with kids in our lives with humility the last the sun's going to play\nThis our electric light orchestra with Mr blue sky\nAnd Eric humble hungry go hungry hungry I I'm Sorry I Can't see today but first we're going to play Ringo Starr with it don't come easy here in the morning makes on WIP than Ninety One\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\nThe same way\nGo go\n\nGo\n\nThe dog a\nThe good about cancer and you know there was no\nWhere you will the baby but now I'm a\nA I'm In the Bible but I'm\nYou know I'm a they\nDo they do they have a lot\nAnything they can do\nJohnny ... the main\nThe line that are being made\nWhat you're saying yeah and then there was a ... dream and like maybe ... maybe a\nDay and then they're not\nBe saying that\nMe that there was a\nYear in\n\nThe\n\n\n\n[noise]\n[laughter]\nDa da da da\n\n\nDi do do do\nLot in\nCan do\n\nYou are I live here\nNo but you know but I'm like whoa whoa whoa whoa whoa whoa\nWhoa whoa\nStrap on how\nFast track and show on how they are\nTrying\n\n\nTo ... she said she said\nShe and she she ... she said she said she should be making the game and she\nShe keeps saying they may have to the to the game and he needed a\nNew the new ...\nSmall car while\nWe're waiting\nLiving room on in our\n[noise] wow [noise] [laughter]\n[laughter]\n[laughter]\n\n[laughter]\n[laughter]\n\n[laughter] oh God\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] you know maybe we should be [noise]\nChange in the meantime you just can't get [noise]\nAnd you know by the U.S [noise]\nYou know make a change in the\n... and she said she shares\n\n... [noise]\n[noise] [noise]\nDon't own a ... year old Model T Dingell long and read you know the one in the ... men and women tucked\nAway you know the old\nAnd they watch in the book that you know\n...\n\n\nAnd and and\nThe city\n... ... ... ...\n... ... ... ... ... ...\n[noise] [noise]\nI don't know when you go on this ... um [noise]\n[noise]\nHe was and you know\n\nShooting changing washing your\nHands and and and and and\nAnd ... and ...\nAnd\nThe live news over the last\nBale hay or the\nAnd the issue here are the days without you know which you know we'll we'll blow\nAway or in this new show dogs\n...\nA well away or you\nLeave or gay or even a woman to\nWay and have\nThis while the strong\nNews Mae Sai in the long side money on a much\n... I\nAttended ... read from the di\n... about\nFor\nDown ...\nI'm a mother I Am entrepreneur where I Am a singer I'm an artist I'm a journalist a businesswoman and educator a grandmother an advocate a leader I have a friend I Am\nI Am I Am I Am I Am I Am I wind up more than a million people living in one of the HIV and the U.S we are in Iowa oh let's stop HIV together\nYou get the facts get tested getting ready to go to W. W. W. dot act against H. dot org for more information\n\n[noise]\n[noise]\nIs it good and bad news today\nWill make you need you know and\nWhen it's going to do in the\nTo ...\nA world\nIn your head and the\nNa\n\nIn\nYou do ... do you think that George ...\n[noise] I\nDon't like it Bob\nSay that\nWe should be ...\n... and\nYou stay in\n\n[noise]\nEveryone you are listening to W. I. U. P. Ninety point one F. M. your alternative source for music I'm Claire and you're listening to the fusion\nThe Indian it's social center will host a fall craft and vendors show from Ninety into three PM on Saturday October ... at the Centre located at one zero zero one oak street Indiana\nWho will be available for purchase on site\nIf you are interested in participating in the show as a craft or or vendor contact Amy song at Seventy four three for nine four or five zero zero for unofficial craft or and or vendor application and additional information again if you're interested in participating please contact any song at seven to for three four nine\nFour five zero zero and you'll get an official application\nComing up next we have el ... and one of my favorite songs by her ... and uh\nHe wants to be they\nHe's paying\nOf may\nThing they ever seen one\nCome in\nRun back and be our [noise]\n... you're\nWe do a good\nBeen three\nNa na\nNa\nNa da da\n\nAnd\n\nGet your Saturday brought every week here on Ninety point one W. I. UPS ... eight to ten PM your hosts the holiday will play all sorts of punk rock rock and roll\nAnything I really want to jump out there on the airwaves pretty much it would be my hard drive and it'd be my head\nAnd if you are listening as you all racial wards show check me out every week she says the em [noise] find me on Facebook at Facebook dot com ... W are you as always looked at me in a public radio station for one of your family\nWhen I Try\nA\nHad\nBeen\nIt was really\n\n[noise]\n\n\n\n...\n[noise]\nFrom and all that great religions of the crowd there shouldn't be a little\nTo get a little friends or just\nYou know they go to school\nMeans no one should they\n...\nThey really\nWant to be the guy is Jay and they don't\nDown the next big\n\nI don't share\nThem that you're born in ...\nAnd I don't\nKnow but they don't\nThe way in that way I'm not as well and my God man this dog around\n\n\nAnd\n\n\n... [noise] ...\nRead [noise] you know\nYou know\n[noise]\n\n\n\nKnown at all\nThat was used some money by kings of Leon welcome everyone to W. I. V. Ninety ... one of them your alternative sources for music I'm Claire and urine\nMad\nMen who were ... you know\nI was ... little recording moral rock ... roll that you're willing to the doctor or ... oh oh oh oh\nOh I don't know your lawn care a lot of the show [noise]\nAnd [noise]\n\n\nAnd then he or she would\nDown the men do we do have a rainy\nMaybe Donnie ...\nGoing to do what you want\n...\n... ... ... ... ... ...\n[noise] your mom's dog\nShe saw the\n\n\nGroup\n\nAnd how do\nOlder\nThan I Do I\nTurn around and say I'm\nNot going to be bringing them\nIn the same\nI mean I I don't\n[noise] [noise] [noise] [noise]\n\n\n\n\nDi do\n...\n\nYou know\nAnd then getting on\nIn a in the\nMe a\nWhile\nDo it but on the wrong\nNa\nNa na\nNa na na na na\nNa na na na\nNa na da\n\nDe read\nThem killed ... ... email\nAll the way you\n\nI don't I don't know why I'm I'm\n\n\nMan\nTime la di da da da da\nDa\nDa\nDa da da da da da da da\n[noise]\n[noise] [noise]\n\n\n[noise] what's up every one this is Clare on the fusion and you are listening to W. I. UP Ninety point one F. M. your alternative sorcery music\nThe Indiana community garden that next park brings a wide range of benefits to many people while promoting health education enjoyment in a sense of community\nThe project is led by a group of volunteers connected to a number of local organizations such as I UP Penn State extension garden clubs anti Indiana art association among many others\nPhotos of past projects and listings of projects and offense to come can be seen by visiting Indiana community gardens dot org donations of seeds plants gardening tools into quip men are always welcome\nInformation on how to become involved is also available at Indiana community gardens dot org don't know about you guys but that sounds like a lot of fun to me coming up next we have probably one of my favorite songs of all time in the end by Lincoln Park\n[noise]\nWere blaming God oh by\nNew\nThe\nRemind myself why try to do\nIn a way you were watching me back\nMorning and I didn't\nNot to\nAny and none of the name\nOf the\nOne of the new shows\nOh I wouldn't match\n\n\nMean\n\n...\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\nMm [noise]\nMm sing out magazine was founded over sixty years ago by a group of folks who loved roots music [noise] today it's a vital and entertaining resource for anyone who loves folk music world over\nOn your host Tom ... joined me each week for a trip into the fascinating world with folks and roots music I'm missing out radio magazine [noise]\nListen to this thing up radio magazines Sundays at new right here on W. I. U. P. F. ...\n[noise]\nSome [noise] some [noise]\nThe dramas like me to you by the dollar general literacy foundation counsel\nWhen we played um ten times when\nWe we we\n\nGet to more\nThan most of you for ten years\nAfter that [noise]\nJoin us for all the unforgettable moments in Ninety One WPN than Indiana, Pennsylvania for sports talk live every Monday Wednesday and friday forty five ... where we talk all sports all the time\nHere on your alternative source\n\nWe had it all wrong huh Jan alternative brand hip hop R U P sport and we are definitely in the end than Indiana [noise]\n\n\n\nMade my dream\nMean by by us\n\n\nKnow\n\n\n\n[noise] [noise] [noise] because it's more\nLike you're going to be able to get to be in the in the main thing that I'm going to be in bad when you do\nNeed a place where you know what you're saying I'm\nTo go on trial again but you don't know if you're not\nGoing to do and what\nDo we\n\n\nNeed\nTo be given to you\n\n[noise] what do you would give you the way you\nCan\nDo\n\nYou mean by the German government's the problem with the\nIn the\nBeginning\nNow you're listening to the snow you're drawing you never know when the ... do\nYou what do you do you want to give it away you know you could give it away you know what do you do\nAny of\nThem and given how can you buy a young man\nYou know what the paradox down the line from one time when I got beat up by a team member no one will never\nKnown a number of\nThe way out in the journal when you\nKnow when the you know even if even if [noise] um [noise] you\nKnow government minimum\nWage now you know\nYou wouldn't know how she [noise]\nUm [noise]\nAm I now I'm\nGoing to do your sense of what you have a ... ...\n... ...\nPeople\n\n... ... ...\n...\nFirst of all the people she just needed to be able\nTo sit in the piece was\nSupposed to be good to have [noise]\nTo see if I have a eight page and she she she\nSays he says he says\nHe says he says\nLove who plays that role will be a little on\nThe ballot Britain would become president and the dog would went down to the rebels shepherd bin Laden and Robert de Los ...\nOr [noise]\n... no one that we're both from the ... the number one\nThe job of John is on the\nMood in the in\nThe job by the la la la la la la la la la la la la la la la la\nLa\n... de dum de ... blue and people jumping jaw down the road and\nTo blow to love\nThem around the bottle\nAnd make your body will be more than you know you don't\nDu Bois the rod how\nDo\nYou enjoy the games in\nIn a la la la\nLa la la la la\nLa la la la la la la la la\n\n\n[noise]\n[noise]\nOoh they write in Gray's de da de da\nDum la da dum la da dum la la la la la la la la\n...\nI'm\nA love around your job I don't know ... is a lie about it um\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n... ... million on God and I know in ... new panic during the during the managing editor at the minimum ... Gerald ...\nFrom New Delhi when you're doing on the other ... pound ... depending\nOn the news [noise] I've got you know and that [noise] and she went and I can do [noise]\n[noise]\nBut it's still live down in June after a while that may or may not know where\nI came\nTo pass a\nBill that can be done at the time and again on Monday and I've got a\nNew one than the game that you know one of the law and [noise]\nThe games\nOn them and you don't have any news about ... to give them a little bit about\nIt in the ... about the mid ... ... pounds the balance of power movies\nAll the time because usually me and you\nKnow in the middle of the time and even the ...\nTo ... and you know the new the new law I got to know how she [noise] you know try to be a ... year old woman [laughter]\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n... for ... and stay in Maine in ... and the same the same name\nThrough a normal a little a little more ...\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\nPlenty of room for a long\nWays away in New York in ... for all of our ally or ... or the other\nDay one was willing to die in war you know one of ...\nBruce Lee ... you know the real borderline animal ... for what\nThey've done it and if you let them know how to spend it and I were maybe we have now is that is where the gas and ... and where they live near the surface to\nRate the way they did they have in the bank may have been\nThe most people\nDon't get really don't\nI don't know metal and oh the poor little metal band\nYo yo yo you gave me a better make the\n... not going to\nBe on them in the home in ... we would now that would be\n... ... ... ...\nPounds landowners and Pamela ... would be\nBetter off you know when we're we're in a blue\nMoon and I don't know why they learn to live no matter how long this is where they allow him when he\nOf introducing the YMCA sure you know the wife or a swear word game of who who were more than that we recall\nWe usually jumps out at the Y. someone else is getting jobs during practice yoga as we've seen practices or leadership skills\nWe give people of all ages incomes and backgrounds a chance to learn grow and thrive so well you might\nThink why the place to look that way and also about lifting fires in unity that for why we're\nSo much more visit YMCA dot net Wes Moore [noise]\nUm Drew Brees being a dad means the world to me one of the most important things any parent can do is make sure their kids get active at least sixty minutes each day\nStudies show that physical activity not only helps kids stay healthy it can enhance important skills like concentration and problem solving which can improve academic performance this means physical activity can help your kids in the most important game of all\nLearn more about fitness dot Gov brought you buy ha chess\n[laughter]\n\n[noise]\n\n\nDo you plan to be mean you've been\nIn that who owns the team but I Do believe that people do not\nLike you're\nAlways be in the da da da da da\nDa da da\nDa\nDa da da da da da da da da da da da\nDa da da\nDa da da da da da da\n\nDa\nDa da da da\n\n\nDa da da da da da da\n\nDa da da da da\nThey keep [laughter] now I can see the kind of keep\nA TV in the in the bank and now I'm trying to come to mind when they can be made in ...\nAnd you know I mean I Know when you get ... and a few minutes\nAnd then when you get in on the news and [noise]\nIn in in in in in your\nMouth and then [noise]\n\n\n\n\n\n[noise] [noise] [noise] [noise]\nBeep beep beep beep\nBeep beep\nBread\nOn the as\nThe number that you would you do you use your real or not it\nWas a um\n\nThe by the\nTime [noise]\nAnd\nHe was in the\nClassroom size was used in the middle you know watch you in the world series all those goals you rise when there was some way\nOr the other\nHand you are not go maybe\nAnd the child in the jolly ... job all the teams that have been working in journalism get any other than the\nRest of the whole\nRather than the average IQ\nIn college you know\nIt was a little dog\nA dog [noise]\nFirst through the wall\nOr but you know the\nGovernment [noise]\n\nYou live by the world\n[noise]\nDogs are younger\nThan I have a job in the\n\nYou know they're going to\nBe in a moment of and oh\nAnd\nI Know that uh\n[noise]\n\n[noise]\n\nTime they don't\nWe know there have\n\nMarried and the young\nDo\n\nWere trying\n\n[noise] you're listening to W. I. U. P. Indiana PA Ninety point more\n\n[noise] we like to say something nice about on Fox is radio program can't think of anything at the moment\nWe're quit laughing you know seriously folks you shouldn't be listening to the song much rock and roll classic radio program every Sunday from three to six PM right there on your own turtles to double you are you in the\n\nThe best is progressive and psychedelic rock along with some occasional blues ... is these countries tune into vital friends I'm Jim inviting you to join me this Saturday at six PM\nOn your alternative source W. I. U. P. F. M. Indiana\n\nThis is Mike ... on afternoon archives only on Ninety point one W. I. P. F. M. your alternative stores and you know\nThat whole first hour even age stuff was for the new wave next generation well let's go back maybe further later on but\nStay in the same error right now and go to stuff that's even better than that one was very underrated\nGroovy song that does get you on the dance floor every time and even more and the next one\nIs another song about never going to give someone up but except this is\nVery very underrated 'cause that's the only hit he ever had\nAs the next long\nMy show only on afternoon or God what did only on Ninety point one WIP up in your alternative stores stay tuned for great stuff and more\n\n\n[noise] and\n[noise]\n\nI'm a ... I mean I'm I'm ... I'm I'm I I don't get me\nOh\nHer and to me I'm a I'm\nIn\nNo dog yeah common way\nI'm a convert highway and me\nA\nLot harder than than\n[noise] [noise]\n[noise]\n[noise]\nUm\nFor\nA lot\nBetter [noise]\nGood to have you on the body\nAnd stuff so I'm On\nA you know\n[laughter] but at the\nStage in life\n\n[noise] [noise] [noise]\n[noise] Mm Mm\n\nI\nBet a body of milk right no\nMan look we can't stop that but just\nDay\nThat um\nOh I see\nThe snow on the when the kids and I never knew how bad is really a myth and\nNo number making way\n[noise]\n\n\n\n\nThat didn't work for all\nI Do\nDo do do\n[noise] you\nKnow ...\n... ... in one\nCorner and he ... he had a very nice [noise]\nI don't have the officers do you think [noise] I don't know\nWant to\nAsk\nWe don't have to be a major should be in\nA way to be they may be in the front page of\nThe world when I was like well [noise]\n[noise]\n[noise] [noise] [noise]\n\nI mean he's been ...\nAnd I don't know why he's the guy on the\n\nLine a lot\nOf them by now you know\nAn only child slow in\nComing from Nineteen eighty may be a teenager you know what I mean do you think you know\n\n\n\n\n\n\n\nThis is W. I. P. F. them your alternative stores and and you know just by that lasts longer to tip the beep square but it's also hip\nTo not have so much rain in our area which means I have to do to ... or cat the long range weather forecast and what do you know more rain\nWater shocker huh more rain anyway this afternoon\nOn October eleventh twenty Eighteen we get a forty percent chance of shares which I got ... coming here today\nSo we'll probably get wet walking out to as the night we got a twenty percent chance of showers it's slowly but you know it will all down from the clouds it's friday we mostly cloudy and then friday night another chance\nI heard that forty percent for that huge I UP Korean game at noon let's see if it rains there like cats and dogs again like last week but Saturday Night read that got partly cloudy\nGetting colder do what below thirty eight Sunday mostly sunny what do you know the sun shows up but then it goes away as we get more showers and more clouds pouring down rain as you start off the week\nMonday you get a fifty percent chance of charge of a high of it before so it is it the beef square but it's also hip to go out to the west\nThe get warmer climate and warmer weather stay tuned to find out what I mean as you are listening to afternoon or cause I'm throwback Thursday's only on Ninety point on W. I. U. P. F. them\nIn Indiana your alternative source\nStay with me for a while folk says I'll be back after these few minutes to\n\nTheir many sounds in your day to day life their sounds that wake you up [noise]\nSounds that make you smile [noise]\nSounds that energize here [noise]\n\nAnd sounds that help you relax [noise]\nBut there are some sounds that can alert you to danger and can help save lives [noise]\nEmergency alert now on many mobile devices use a unique sound and vibration to bring you information about their weather events amber alerts or other emergencies in your area with critical information\nBrought to you by FEMA and the ad council\n\nI wasn't prepared to be a caregiver to mom but a little over a year ago we realized she couldn't take care of herself without our help\nI have no idea how hard it would be and just what I Would need to know\nThings I never thought of like how to improve your mood and even for me ways to stay positive\nLuckily I found the caregiving resource center from a A R B\nHad articles about the basics that got me started\nBut also for me a turtle room\nI could even connect with expert in here from others who am I Believe you\nKnow this road Ron isn't an easy one\nReally happy to have the extra help for her\nCaregiving resource center in AARP dot org slash caregiving articles tips and tools to help you care for your loved one Medicare for yourself this message is brought to buy a A R P and the idea\nOf expect to reintroduce too smart for an adult decisions Dubai feed the big ...\nWell I finally did it my student loan is totally paid off I Can't believe it I Can't believe it either I paid more than the minimum each month and soon enough it was gone so you're just giving up giving up on what the life of luxury it keeps you know why they are there\nIs Dave designer everything\nWhat are you talking about I don't know what happened to winning the lottery and\nMastering the art of the perfect my most hosting gala wearing enough you'll raider acquire a bodyguard vacationing in the French Riviera and then by in yeah I just thought maybe it was time to prepare for my future you know set some financial\nGold makes them smart investments open a four O. one K. goals and\nRight now listening at winning the lottery where everyone but when it comes to financial stability\nCouncil\nLife after military services different many veterans who only transitioning difficult feeling lost an uncertain about the future these feelings don't take away from a veteran strength courage or sense of duty if you're a veteran in crisis or no one who is\nThe power of one person one connection one act of compassion can make a difference for free twenty four seven confidential support called the veterans crisis line one eight hundred two seven three to five five and press one for a visit veterans crisis line dot net\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] no way down in flames by way of Big Jim Green Bay the bass\nDo that in ...\nNa na na\nNa na na na\nDa da da da\nDa da da da da da da da\n\nAgain\nAnd um\nYes yes Josh Iraq's\nThat I Know no\n\nIran and\nTo do\nJob well then the\nJobs\nAnd they did a shutdown downtown\nHe sat down\nTV [laughter] yeah [noise]\nYeah\nYou know on a boat um [noise]\n\n\nThey're going to be in deep doo doo doo doo doo doo ... move in a letter to old can ride\nAnd do it a lot higher to move in the middle\nOf the [noise]\nTo make the most basic [noise]\nThose doctors and hospitals will be able to be on top of the\nPeople in power [noise]\nFor you know to drive a truck driver is a little of both those in the middle of the things I\n... goal was to do all those other teams do they move in and for those [noise] those teams from\nThose voted [noise] does drive\nVery busy street a bit of the voters are looking to try\nBe on the basis of those and groups [noise] do you do something [noise]\n[noise] ... [noise] um [noise]\nSo it was a a day\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] um [noise]\nGo go go go go go\n[noise]\n[laughter] [noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\nOh don't do that\nLot that followed by a lot\nThat involved a small do that we\nAll\nLot of that oh no\nIn the day that day and a half an\nHour and then ... and do their jobs and jobs and da da da da da\nDa da da da da\n\nDa da da da\n\nDa da da da da\n\nDa da da da da\n\nDa da\nDa da da da\nDa da da da da\n[noise]\nDuring the Nineteen fifties you couldn't hear rhythm and blues ... box in the front [noise] did you hear all that down and dirty black who's the rock and roll you had to go to the ... [noise]\nOn your whole amount of the cat in for an hour each week will go back in times of the old I came up or rock and roll World War two where the blues that led the rock and rollers delusions\nOf the mid nineties [noise] your your ... Harris professor long hair ... burn bankers swell and all the other heroes of early on in the back of the establishment where there's da da da and the season like why\nJoined me for the few that catch\nYou going to be all night cafe Monday Mornings at what a nice point [noise] W I use EFL [noise]\n\n\n[noise] Ninety point one W. R. U. P. F. M. Indiana\n\n[noise] um [noise]\nKnow dangerous\nTo try and [noise]\n\nWhich raises an all black dog\n\nRight on the on the\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise] um [noise]\n\n\n\n\nMan\nA\nJust so\nSad\n\nNo\n\nYeah I Do and this is Joe Walsh speaking on behalf of Red Dead so good around general right but don't drive on the door on the drug problem yeah I have a limo coming\nYeah [noise]\nDid it for the phone company came to the national association of broadcasters to me I'd count public\n\nRadio\nThe\n\n\nYou may be on\nThe mic\n\nWhoa\n\n\nYeah yeah yeah yeah\n[noise]\n\nAround\nIn the\nName of God oh I bet you mean\nAbout during\nThe\n\n\n[noise] [noise]\n\n\n\nYeah people\n\n[noise]\nThey\n\nBe\nLike saying we're\n\n\nYear\nThen they they don't die\nThat\n\nAnd then\nPeople go\nOne of\nThe\n\nThe dying is\nGood\nThe last show that there's a whole\nJob in Miami and ... they got on my way and that's\nWhat we're [laughter] Mm Mm Mm\nNo matter where you know how well\nDrama that you're going to get on their way or they don't want to ask [laughter]\n[noise] [noise] [noise]\nThere there was somebody else down down down there [laughter]\nOh wow [laughter] oh [noise]\nOh\nThe the big thing in the media and they don't let the down\nMan by the way that they\nWhen they get a\nMen do and that bag I doubt\nYears we'd love to do with\nThe wee man when\nNever be here and do all\nBy five and then the day\nTo day\n\nKnees ... peas they\nWill be to be ...\n\nBad\nKnees [noise]\n\n\n\n\nUh-huh ... from the ... the president [noise]\nGreat music you know great music you don't know yet if mark Morris than Sunday simpler squeeze what's happened in ... I think you can prove to a great deal of the old the new nothing really are and the forgotten what the Sunday the blood all about for eight o'clock pm for\nIran W. R. U. P. F. ... Sunday sample with mark Morris [noise]\nRight so [noise] [noise]\n\n\n\n[noise]\nAnd there are a\n\n\nBig issue is that they\nNeed to\n\n\nDo [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\nThe\n\nDo the job was the man that is\nThe brass\nOn the ball John Lewis a\nRule and the dad in the brain and\nDuring the ...\nSandwich saying\nDo much top dog show\nThe\nThe the details and John\nThey want to buy one\nWoman and this bad and\nMad and have been going on\nThe\nHas shown now saying they don't want\nThem\nOn the bed\nAnd then you\n\n\n\n...\nHow\nDo you do and I play ball\nAnd the all the time when\nGot him by the bomb\nAmazon and yeah ...\nThat and they want\nA\nNot have ...\nMuch top\n[noise]\nDuring the Nineteen fifties you couldn't hear rhythm and blues round the jukebox in the ... did you hear all that down and dirty black here's the rock and roll you had to go to the ... [noise]\nI'm your whole amount of the cat in for an hour each week will go back in times of the cable or rock and roll World War two rhythm and blues that led the rock and roll explosion\nOf the mid nineties [noise] you're you're wanting to Beijing Harris professor long hair maybe shows urine or maybe a burn\nAnd he's learning like long joined me for the cheap enough to catch juice going to be all night Jeff Beck Monday Mornings at what a nice point do you are you a CFL [noise]\n\nYou are locked onto your alternative source Ninety point one W. R. U. P. F. M. India\nAnd the same thing in\nOrder\nTo be\nYou know\nShe was a day in basketball\nIn order to get rid of the\nIn the world a show that the government and I'm a ...\n\n\n\n\nNa\nNa\nNa na\nVe\n[noise]\nEm [noise] em\n[noise]\nNow you can find a\nBam bam bam bam\nBam bam bam\nBam bam a giant\nSwap na\nNa\nNa na na na\nNa na na na\nNa na na da\nDa\nDa da\n\nDa da da da da da na point one W. I. UPS\nThe next day\nDog's a\nMm Mm Mm\n... ... ...\nDog gets out a\n... ...\n\n\n\nGreen yeah\n... the um\n\nAnd uh yeah yeah I'm married to a\nGame and you\nThe way that the\n[noise] and you're\nListening to talk to you know and I'm ... and ... ...\n\n\nOne a day that\nWhen I'm\nThat general\nNo way and\nThe one thing that I Am\n\n\n\n\n[noise]\n[noise]\n[noise] [noise] um [noise] so [noise] thank\nGod for\nDa\nDa\nDa da da da da da da\nDa da da da da da da\nDa da da da da da da da\n\n[noise] [noise]\nAnyway [noise] [noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\nThat Chad\n\n\n\n\n\nYour job will be to not to use the whispers job so why\nOne day we read\n\nDrew me just say\nThat's\n\n\n\n[noise]\n\n\n... not\nAs big room but most of\nMust do what's right to mature a skill than the robot is\nNo\n\nMan on a\nDown to do that [noise]\n\n\nMan on\nA down and read guy down and\nDown and [noise] the way down and down [noise] trying to make\nThings\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\nYou don't\nNeed you\nKnow a\nUm\n[noise]\n\n[noise]\n\nMm\n[noise]\n\nWell I wouldn't be the first job\nLast few years and\n\nThen\nWas in a long time now that the ...\n\nJacks die for you\nDown and write a song about New Orleans [noise]\nHog my three year old my fingers\n\n\nDa da de ... the vitamin ...\nDinah we never knew we could walk all of that I live\nWhen you're when he was Bill Bolling study in the summer of a say in the Bible they signed by the Indians in July and I remember the great the when do you do that too much they\nAll the time I Do live in\nUm no I Know\n...\nAnd [noise] and [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nDiverse than commercial free you're listening to Ninety point one FM W. I. U. P. in Indiana, Pennsylvania\n[noise]\nIf you long for their free form radio format of early FM radio we\nHad the chauffeur you which called vital tracks the main focus is on progressive and psych right but you also hear a little bit of jazz folk country and blues I'm Jim and inviting you to join me for vital tracks every Saturday yet six PM and Sunday\nAnd Lebanon PM hurt only on W. I. U. P. FM Indiana\nYour alternative short [noise]\n[noise]\n\n\n\nYeah well you may have been booming station earned [noise] winning abound\nAll of the amount of law it was against the law [noise]\nMom looked down at spit on the ground every time a name dismiss journey the bombs that oh if I get that ball and moments stick them in the how did his job you know when I'm On the way I don't know\nThey are taking my time but I don't know where that\nThere to clean up the road with a CD and only about ... yards multimedia who they\nAre now nobody told yard\n[noise]\n\nBeen covering the day to take me away with the British historian and just knowing the radical breached ... means all of them come in little league and um all ... I don't normally\nThe blizzard come on my way in which they can take almost done but I don't\nA ... yard to give it to you man who is your body schoolyard during the day is the man who wrote down by these Juilliard is too big for me\n\n\n\n\n\n\nMhm mhm mhm\nWhere are you know I don't\n... ...\nAnd and\nReally really ... to ...\n[laughter]\n... and ... ... Mm mhm\nMhm uh ...\n\nThe answer the phone\nLost in a ...\nI'm the same movie\n[noise] and she wants\nTo bring in a system\nYou know the video [laughter]\nNah nah nah [noise]\n\nNeither am I see a show you you know over the years that they can use to do with that [laughter] I'm In San ...\nUh I'm In the same time there too\n[noise]\n\n\n\n...\nIt was a\nSee a movie you know they say that\nThe\nAnd they often\n\nAnd ...\nAnd ... and ... and ...\nIt's been a little ball\nBy not I'm not that I'm a I'm\nA I'm\nThat might be able\nDown down down down down down down onto the chatter how do you feel about that\n\nHave you have a nice a nice day here in ...\n\nAnd [noise]\n\nAnd on and don't\nA new movie and I'm Talking about bringing them\n... you can feel\nRogers our jobs\nThen my dad and my dad marry the fallout\nDo\nThey have and you\nA little older now more with yeah\nNa\nAnd AA has been going on around and all that I Know I'm a\n... and\nYou\nI Do I think that\nThat when we were having said that I Know there are any other way yeah wow yeah no no I'm\nAnd demand any bad\nAnd mad dog you have to remain\nThat way or are you doing All right yeah my age\nMaybe\n\n... ... ... ... ... ...\nYou know the\nThe main goal here then they read like a Thin Man very\nDry ...\nWell yeah yeah yeah and\nShe has no God\n\nStraight yeah yeah\nYeah so they say oh\nNo not me a\nLittle dull\nUp and we'd been she became the blood stream really time to be that bad yeah I feel sorry for them by Karen\nI'm In the middle [laughter]\nUm but I Know it doesn't mean that go to you know why I Know how to find a ... to ... to change\n[laughter] [noise]\n\nName of the day you\nThe\nThe mhm\n\nMm\nMm\nNo\nNo the last\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise] did she you know three [noise] maybe no\n[noise]\n\nAnd [noise]\nThan [noise]\nAnd\n\n\nTake a look into your bad points to go further there what about John ... no no check your basement there is a parable broke that overall you're not so into anymore a perfectly good laptops that hadn't seen her last month's do you do\nWhat I Do know job well you really have the stuff is defined as household article considered as a group sometimes their stuff is no longer needed wait no longer needed that can't be right because remember those jobs you were looking for those\nJobs and it starts when you don't eat yourself to your local good well here's how are we doing when you do need to good well we sell your stuff to provide job training for people right here in your community to just by teaming up with good will\nYou help create jobs and isn't there were partying with the leftover key tower from your emails cover band good will donate stuff create jobs find your ears donation center at goodwill dot org a message from goodwill in the ad council\n\n\n\nShare\nSwing dancing\nThe change\nMan is she the bill\n\n[noise]\n\n[noise] Mm\nDa da\nDa da da da da\nDa da da da da\nDa da\nDa da da da\nDa\nDa da\nDa\nDa da da\nDa da da da da da da da da da\nDa da da da da da\nDa da da de\n\nLa la la ...\nThat when you go\nOn the line not de de died\nNo no no no no medical profession and over and over and over and over there and then\nThat a\nLittle\n...\nAnd ...\n... these men\nA\nDa da da\nDa and\nAnd when you\nA new day\n\n\nA\nMan or da\n\nDa da\nDa da\nBen and and\nHalf an hour and\nDe da\nDa da da\nDa\nDa da\nDa da\nDa da da da da da da\nDa da da da da\n\n\nDa da\nAnd\n\n\n\n\n\n\n\n\nOh great music from the ... the president of the great music you know great music you don't know yet more more since Sunday simpler he's what's happened is wonderful\nI think you can prove to a great deal of the older they knew nothing really are and the forgotten what the Sunday stabilized although now from eight eleven and then one day\nWhere Iran W. R. U. P. F. M. gets the Sunday simply with mark Morris or\n[noise] so [noise] [noise]\nIt's been\n\nIn ...\nThe wind\nDo you\n\nTo be\nThe main the main\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\nNah nah nah nah nah\nHas risen to over two thousand dead with over five thousand people still missing\nA new United Nations report says the damages caused by stream weather events and other so called natural disasters\nHave cost two point nine trillion dollars in economic losses over the last Twenty years this is professor ... who is a contributor to the report\nWe really need to have some\nDisaster reduction and desire to ... to ... for this show them for five to ten year period for people in poor countries do not have twenty is such a use for two years most of the children's would be dead\nJust as well to some up and I do they're going to be done because of the catastrophe could so\nThis is our loews Monday's report by the Nobel Peace prize winning United Nations Intergovernmental Panel on climate change which found humanity has only a judge in years to mitigate global warming and limit the scope of global catastrophe we'll have more on climate change in hurricane Michael after headlines\nThe Washington Post is reporting based on U.S intelligence intercept that the crown prince of Saudi Arabia Mohammad bin ... and the s ordered an operation to lure Washington Post columnist Jim ... an Arabic Jim ... back\nTo Saudi Arabia from his home in Virginia\nHas showed Jay disappeared last week after entering the Saudi consulate in Istanbul one Turkish official told the New York times she could show she was assassinated inside the conflict by a team that Fifteen Saudi operatives\nWho used a bone sought to dismembered his body before smuggling body parts out of the building the U.S intelligence intercepted or the latest piece of evidence implicate the Saudi Government directly in ... death\nWhich has sparked a diplomatic crisis for the Trump Administration particularly for President Trump and his son in law senior advisor Jared Kushner\nQuestionnaire is actively cultivated Mohammed bin Salman is a key ally praising the young leader dining with him in Washington in Riyadh and hosting one on one phone calls with him outside of normal diplomatic channels\nOn Wednesday President Trump also praise Mohammad bill signed on calling him a fine man as Trump answered reporters' questions about who within the Saudi Government have spoken to about ... disappearance\nOr listeners livers is\nTo be on the relationship you're both of us really to see what is what we have to see what happens or whatever you know over\nBut ... is a situation where they can use your fingers\nHill thousands of people took to the streets of Sao paolo to protest\nAgainst far right wing presidential candidate John ... who won first place in Sunday's presidential election but will face a runoff against the second place candidates Fernando had dodgy of the leftist workers' party on October twenty eighth these are two of the protesters in Sao paolo\nThe average [noise]\nThings that I mean I Am very scared that there's a chance at most in our will become president our mission is to me nor answer and I think we have eight and ... to do it and try to fill the says\nWednesday's protest came as the wall Street Journal in door ... NATO despite has long history of making racist homophobic and massage ... comments as well as openly praising Brazil's military dictatorship\nUsing language that mirror President Trump's campaign slogan make America great again the wall Street Journal's editorial board wrote quote both NATO was best understood as conservative populists who promises to make Brazil great for the first time he's attracted support from the middle class\nBy pledging to reduce corruption crackdown on Brazil's rampant crime and liberate entrepreneur is from government control\nAt least eight people died and another twenty five are missing after a boat carrying refugees capsized off the coast of turkey the United nations says over Seventeen hundred refugees have died trying to cross the Mediterranean so far this year\nMeanwhile Moroccan navy officers open fire on a boat carrying Moroccan refugees towards Europe injuring ...\nIn Burma authorities have arrested three journalist after they wrote a piece criticizing the government the journalist from eleven media group who wrote about the funding of a city bus system could face up to two years in prison is found guilty of quote fear or alarm to the public unquote\nIn two thousand sixteen editors from the same paper went to jail over peace accusing the government official of bribery the arrest come just a month after a Burmese court sentenced to Reuters journalist to seven years in prison for violating Burma as colonial era official secrets act\nCausing international condemnation at the time of their arrest the Reuters journalists jaw soul and while loan we're investigating a massacre committed by the Burmese military targeting Rohingya Muslims\nIn Peru ... the leader of the opposition and daughter of former dictator precedent to bear tofu jewelry was arrested Wednesday over allegations of money laundering and accepting illegal campaign contributions\nLast week a Peruvian judge overturned a port enough her father Roberto food you more who's now expected to return to prison for crimes including kidnapping\nBribery and ordering massacres by death squads in the Nineteen nineties during his presidential role\nIn financial news the Dow Jones industrial average plunged more than eight hundred points Wednesday stocks of tech companies Facebook Netflix and Twitter all tumbled sharply\nEconomists say the market drop was sparked by the Fed's decision to raise interest rates after having propped up the economy for years following the to assassinate economic crisis by holding interest rates near zero levels\nIn more financial news the Justice Department has approved a sixty nine billion dollar merger between CBS health at now one of the nation's lowest\nWhich experts say could leave patience with less control over their medical care and prescription drugs\nIn Canada and enraged gas pipeline ruptured sparking a massive fire forcing about one hundred members of the deadly ten at first nation to evacuate their homes in British Columbia\nAnd bridges behind a series of controversial pipelines including the line three oil pipeline which would carry tar sands oil from Alberta, Canada to a terminal in superior Wisconsin and has proposed construction has sparked massive resistance from indigenous communities on both sides of the U.S Canada border\nAt the U.S Mexico border\nThe family as has Antonio Rodrigues march Wednesday tomorrow six years since the sixteen year old Mexican boy was fatally shot in the head by a U.S border patrol agent who fired through the border fence and kill the teenager as he was walking on a sidewalk in Nogales Mexico\nThis is his mother or sell a Rodrigues\nSaving ... and my mother looked in the\n... name is Shelley Rodriguez the mother of Jose Antonio we're here because today marks six years since the assassinated my son were marching and we're demanding justice so that's why we're here because we're demanding justice in six years after the assassination of my son so there's still no justice\nIn Kazakhstan two astronauts from the U.S and Russia safely made an emergency landing this morning after the failure of a booster rocket as they were headed to the international space station\nAnd activists turned the website Brett Kavanaugh dot com and to a resource for survivors of sexual assaults the site to his URL was secured by a judicial reform grew back in two thousand Fifteen now shows\nStation seeking to end rape and sexual violence and those are some of the headlines that says democracy now democracy now dot org the Warren Fisher porch I'm any good men\nAnd I mean Shay welcome to our listeners and viewers around the country and around the world\nAt least two people have died since hurricane Michael made landfall in Florida and Georgia on Wednesday it was the third most powerful storm to ever hit the U.S mainland\nThe storm landed near Mexico beach about twenty miles south east of Panama City it came ashore as a category for storm with top sustained when\nReaching a hundred and fifty five miles per hour the powerful storm remained the hurricane has moved further inland despite this advocacy groups reported that the Florida department of corrections had not evacuated at least a dozen prisons in mandatory evacuation zones as a Wednesday\n\n\nReally really\nA grown as your by the stereo lab this democracy now I mean he couldn't with Herman shaped\nWe turn now to look at how the limousine crash that killed twenty people Saturday in upstate New York is linked to a man who is an FBI informant long accused of lying to the government\nAnd getting away with it the crash and the town of school hiring was the deadliest us transportation disaster since two thousand nine the limousine had failed and inspection last month and was not license to be on the road\nThe New York times reports that shortly before the crash one of the victims sent a text message to a friend saying she was worried about the levels condition\nIt has since been revealed the company that owned the car had a record of repeated safety violations earlier this year it was issued written violations off the vehicle inspections by the New York state police\nAnd the department of transportation on Wednesday state officials arrested the operator of prestige limousine show for service and ...\nNamed mug shot his son who is the company's owner and also an FBI agent informant\nIn two thousand one ... Hussein was arrested for helping people cheat on driver's license tests in exchange for avoiding deportation he took a job\nAs an FBI confidential informant posing as a radical arms dealer and FBI sting operations saying was that key figure in the FBI's case against the so called Newberg for\nFor black Muslim men sentenced to twenty five year prison terms after they were convicted for placing what they thought were bombs in New York synagogue in two thousand ten defense attorney said the men were in trapped by Hussein we turn\nTo Pittsburgh men who was trapped by Hussein his name is ... ... he just finished serving nearly eight years in federal prison and was released September twenty fifth than a moment we're going to speak to him directly he's in a halfway house but first we want to turn to a clip from the documentary terror\nThat's tea in parentheses and the word era terror where police ... describes how Hussein then working as an FBI informant in Pittsburgh under the name of Mohammed tried to recruit him for terror plot\nIt was so clear that I didn't want to meet these guys like seriously like literally made up excuse after ... after ...\nThis morning walk up to her for the poor and that's when the you know quote unquote come in from around the corner [noise]\nYou know just appeared out of nowhere you know he had his hotel downtown Vicksburg and yet he was here woken bird\nNine thirty in the morning what I'll know Cornel vehicle you just so happened\n[noise]\n\nThe morning and uh\nWe all came in here [noise]\nWe actually sat as is the first move for here and that's whenever you begin to talk about his people being involved in your head and whatnot and fighting and\n... I like Kelly joins us now on the telephone from Pittsburgh Khalifa welcome to democracy now congratulations on getting out of person after almost eight years when you heard about this new isn't the worst us traffic\nAccident and almost a decade and that the limousine that was used to that was illegally on the road um which owned by um\nThe FBI informant who led to you or in person it can you talk about your response and exactly who are shot Hussein is\nYeah good morning or ... I was completely devastated by this news the fact that this man\nIs allowed to continue to to to live a bomb\nA you know citizens and and and to be out here when this guy is he's a road and you know he he's a liar and he's the he's a criminal who he is a scam artist and he and he's a danger to society\nAnd and the fact that this took place in in more than likely that the money that was used to to build this company was money that was paid to him by our government I mean this is ridiculous\nOf because he's an asset to our government and he's bringing them manufactured cases of terrorism or this is why he's allowed to continue to stay in this country and to flourish in the run these illegal businesses and which have constantly cutting corners and and and it's it's just sad twenty people die as a result\nYeah I I met him um to the other and former that was involved in in in the case I'm not sure if he told me one day said man my brothers coming in from out of town and then I really want you to meet him he's a a a real source will die you know and I think you guys will get along the relate\nAnd so that's how the initial um introduction was made I only met this guy a once or twice on two different occasions and uh you know I didn't want\nTo meet him from the very beginning with already knew that he he was going to form and I knew that\nHe was trying to attract me and when he was very aggressive in trying to pursue me and and and the sit down with me to talk with me and\nIt's just sad man to hear this news you know it really is\nCan you talk about where you're speaking to us from and how his actions leg cheering personally meant\nYeah sure I'm I'm I'm speaking from Vicksburg I'm I'm In a halfway house I'm I'm right now I'm just focused on trying to uh you know my transition back into society to reunite with my family\nAnd in this guy's actions have let it led to mind president because of his\nAttempts to attract me and then after I publicly exposed them then the government came in with a two year old picture of me and some friends having having fun at a gun range and use that to indict me and and give me a rack of years in federal prison and yet this guy's responsible for\nA directly or indirectly for the for the uh the homicide of of twenty people and he's not going to do all day in jail\nHow did you figure out he was an FBI informant\n[noise] there I knew because I knew this was an FBI informants so the fact that this guy was in ... introducing me to to another guy uh I just I knew immediately\nMhm [noise] well I don't want you to get\nIt's ... Kelly joining us talking about how he was ... head Hussein\nWho is the man who owns the prestige limousine service the limousine that was a legally on the road a number of his cars um had a\nFailed inspection and yet this limousine carried a twenty people the driver and Seventeen friends between the ages I think twenty four and thirty four we're all going to a thirtieth birthday party\nTwo of the couples in the car had just gotten married\nI'm the driver of course killed two bystanders we're joined now by two other guests who can talk about the man who owns the service not exactly clear where he is right now his son has been arrested on manslaughter charges as a result of the accident\nHere in New York San bravery and joined us an attorney who represented one of the new bore Newberg for who are convicted after shot Hussein led the rope an organized this game he'll tell us about that\nAnd in Los Angeles lyric ... with us co director of the film terror\nThat's tea in parentheses and the word ever Tara a documentary that follows undercover FBI informant say ... ... has a who I'm a college that was just talking about another FBI informant um\nLyric we met you at the Sundance Film festival this astounding film a few years ago if you can finish um\nKhalifa story for us how he figured out who shot had was in the significance I mean he not only was involved in the jailing of men in Pittsburgh but also as well talk about with sand braver men the men in New York who were then in ...\nPittsburgh and he was going by the name Mohammed\nUm and he had been assigned there presumably to investigate ... um but because of the new bird for case because that was such a publicly critique the example of entrapment\nUm during that trial shy had Hussein was photographed and was exposed um her photograph with placed on actually it was the front cover of the New York times\nThis isn't there a question of who he first came to the United states from Pakistan ... murder\nCharge show he was right we don't even have proof of that but he absolutely said that he was a victim of a law for rushed and all these are the first we have no proof that the truth and the FBI never offered flu so that was true the only thing we know the FBI who said about the foreign to trial\nThey said in a letter in the journal memory so we know these guys are totally incapable but operation with out are informed well\nI Want to go to a comments that have been made a statement that's been issued by a Muslim groups in the U.S or the Muslim solidarity committee projects Saddam and the coalition for civil Sweden issued a statement about her than saying quote\nThe limousine company is the latest heads on this road of calamity\nShy sense of debt to justice has not been paid\nThe years spent in prison and the years still to serve for the phone and crimes that has an engineer for the FBI cannot be recovered for the men he put away and the terrible the irony of a felon\nConvicted this part of a DMV scan who's now responsible for the faulty operation of a vehicle that killed ... twenty innocent people\nIs not lost on us so a lyric\n... could you up responded to that and to also say um what you call from her sense testimony ah you said that in fact you thought he was taking a direction from the FBI\nThough one of the things that's\nThe and the fraud um you know the FBI always says the FBI's argument is that it needs a criminal to catch a criminal but going back to that actual ads which was in the I Believe it was in ... in the early two thousand uh my question is why did the FBI choose to hire this individual because that very act\nUm which for which they could've prosecuting him and put him in jail\nIs ultimately what killed these people on the fraud getting vehicles actually the ... what he was convicted of what he should have been convicted of what the FBI knew that he was doing was helping people to receive driver's licenses illegally and his son in this accident than not have a license to drive the vehicle so my I\nI have not heard much scrutiny around the FBI 'em to date I've not heard of the bureau make a statement\nIts informant but I actually question the bureau round and why why they chose to employ this individual after knowing he his capability around these for the\nLyric I'm you spoke to the mother of David Williams' one of the new birth for I think they're in jail what for twenty five years when she learned if that's terrific car crash that involves the men who ended up getting her son and prison what did she tell you\nI'm Elizabeth ... Williams was just horrified um you know she legally she was just wondering like any mother would she still trying to get her son out of jail um she understands that in the spot that injustice occurred so I think her first response was a legal one\nI'm going back to sort of the point that I spoke on um is there any way that the FBI can be held accountable for this man now that it's clear um that the original crime when they hired him is what killed these people also mentally so she's wondering how this current event\nMight impact her son shards might impact David I'm freedom\nAnd the last ten seconds your response and brave I'm sure when you heard what happened in ... you\nIt's more the same for this young man who say does whatever he wants to do throughout his life and it's not\nThe governor and Florida would tolerate the nonsense let's duck ... Heiden said if you hadn't said about the environment to be hard to understand about justice if you're hiring soon about all the issues are important to us\nWhy do we think we should we put her to get the bottom line is big they wrap their arms around a lawyer and here's the IRS would reproduce\nAnd as Michael German said in a remarkable film or by David how Brunner a the HBO film the ah the Newberg staying quoting Michael German an FBI agent uh\nNine one one after nine eleven uh his colleagues at the FBI were saying you know the rules no longer apply and he was walking around saying what are you talking about the rules\nOr will he says the rules you mean the constitution I actually will start with Michael ... he's a good doctor\n... San braver men lawyer for one of the new verb for lyrics ... co director of the award winning\nDocumentary terror which is now on Netflix and we want to thank ... who joined us from the halfway house in Pittsburgh we thank you so much a ... a ... a foreign lightening I says we continue to try to find out what has taken place on the roads of upstate New York and where I\nAt this point a showerhead um Hussein is his son is in jail [noise] this is democracy now when we come back yet yet how fascism works a new book by Yale professor relations Stanley stay with us\n\n\n[noise]\n[noise]\n\n\nWinter\n\n\n\n\n\n\nChild performed by ... democracy now I'm any good and then with near me straight\nEntered a show with a remarkable new book titled how fascism walks the politics of us and them which focuses in particular on current trends under the Trump Administration arguing that the president is not as much of an anomaly in American history as we often think\nThe book's author Yale professor Jason Stanley whose parents were both Holocaust survivors who came to the U.S as refugees shows instead that quote in its own history the United states can find a legacy of the best of liberal democracy as well as the ...\nLevi he also wants of the dangers of normalizing fascist politics saying quote what normalization does its transform the morally extraordinary\nAnd to the ordinary it makes us able to tolerate what was once intolerable by making it seem as if this is the way things have always been\nWe're joined right now by Jason Stanley philosophy professor at Yale University his new book is just out\nIts title how fascism works the politics of us and then his previous books how propaganda works welcome to democracy now professor it's great to have you with us why now why are you releasing this book how fascism works now\nWell we have a global ultra nationalist far right movements crossing many countries both in our Owen Brazil we've just seen and they feed off each other\nSo I think right now it's very important to make people aware of the features of fascism in historical features and to alert people to the fact that\nThe United states has always been vulnerable to this kind of politics\nWill explain what fascism defined what it means the is\nSo fascism is an ideology based on power liberal democracy is based on liberty and equality liberty and equality require truth because you need troops to speak truth to power\nAnd a free of if if you ever lied to you're not free no one thinks that people of North Korea are free they've been lied to\nSo if you're going to attack liberal democracy you replace it with power to smash truth so fascism is an ideology based on power and loyalty\nIt uh it it creates it's based on hyper nationalism so one group loyalty to one group and one person the leader represents that group it's hyper masculine\n\nYou live stream and she\n... me\nMake the ...\nSure they're all home you\nWe we um [noise] oh\n[noise]\nHe\n\nHe uh\n\n\nHe\nHe\n\n... ...\n... [noise]\n[noise]\n\n[noise]\nThis is oh\nI don't oh\nWhen I'm On the floor\nI met a man\n[noise]\n\n[noise]\nDegrees\nOh I didn't need to [noise]\nWow\n\n\nWell ... are treated water all do long war we are the people I knew the ability to be a ... year old sort of the school district I don't\n\n[noise]\n\n\n\nI haven't\nBeen to my ... been trying to do that and\nThen they do is kind of in the very end\nAnd ...\nThere is no God and and [noise]\n[noise] and\n\n\n\n\n\nA little\nThing called the ...\nDon't you don't fill my line in little one\nThis and then they on my\nMind when the bomb rods advertise a a\nBankruptcy or somewhere\nThe way you do that and try to bring up in ... I'm I'm\nSingle woman was saying about\nCan do anything for why\nDon't know how to use a\nDidn't know about all\nAgain I'm In a\nWhile ago is on the program key brand magic campaign than we do\nAnd I don't well\nThem what do\nBelieve that in real life and there's no memory is well known your mom don't\nWhy\nDo they know what\n\nDo\n[noise] to do anything and they may have been and and ...\n...\nDown they can do while\nThey're on land put\n\nThe gay\nDo\n\nThey do they\nReally bad in real life story and\nDay as I Am a\nPiece of meat and things like well\n\nKnow\n\nKnow and\nAnd usually\n[noise]\n\n[noise]\n\nI'm I'm a plan they trade with\nJust the\nAnd on the uh the dream\n[noise]\nWay John was she was a bad day or\nA a good\nAt the [noise] [noise]\n[noise] [noise]\n[noise]\nTo crawl\nAround us up Iran [noise] anybody\nIf we're\nOn the day\n[noise]\nUh about a new\nKind of care what you are or are they are um [noise] a novice Carly er [noise] for a\nCab driver stay close to\nA place called her to\nBe\nA little bit of both of them are [noise] are going to\nBe\nA little a little bit about [noise] [noise]\n[noise]\nUh\n[noise]\n\n\nWell\nIt may not be that there were no no no\nThe\nUm the people here in the military they latch on then Mary\nGuys can yeah\nBig deal well right yeah yeah and\nShe has no\n\nStraight down in my hair or there was a\nKid only learning you\nKnow we were all\nThere was no\n... no no she does get a jury you know the can down the way they feel that\nYou know I'm I'm you know [laughter] no way to find a\nDemand\nA ... day you know I Know\nAnd you\nKnow\n\nA Bowl Sunday news on\n\nI'm any good to have democracy now your daily grassroots liberal international independent news hour W I use the family\nNow airing democracy now crossing the week Monday to friday that ... on your alternative W. I. P. Ninety point one tune it you won't forget\n[noise]\n[noise]\n\n\n\n... needs\n\nIn the\nGame but not to be in the in the ... and [noise] the\nYou\nAnd\nThe people\nLet's go next ... Bush and going you know we we don't jibe you know when\nYou're going to be\nFamily\nPeople\nWhatever\nAnd [noise] and then\nYou that they would have just been released the ...\nWhen\nShut down\n\nHere and\nAnd and and and the ...\n[noise] Mm [noise]\n\nOh\nMy God I mean talk about\nJohn Elway and I can and I'm like they were\nThey can now buy his name in the back into the\nAnd they knew the straggling gone bad and then my son just saying that it's all on\nCan't tell you the same thing I'm\nKnow what I Do on the phone [noise] Hi you're on channel two and a man animals\nThat are saying\nIn the morning and say well\n\nMm\n\nBushel during spring\nWith all the stuff that they should\nAnd I [noise]\n[noise]\n\n\nThe class [noise]\nUh\nShe\n\n\nDa da na na\nNa na\nNa ...\nThe you\nMy mind\nThan we do\n\nMind some of my mind\nAnd\nUs we have\nI didn't really want to be a\nWith\nMy\nMe oh\n\n[noise]\nAnd I don't know\nBrain\n\n\n\n\nShe far she's ... she's a butcher with just caught me farther\n\n[noise] [noise]\n[noise]\nThey do\nIn the right\nThing\n[noise] [noise]\n[noise]\nRichard\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nCollege radio [noise]\nRocks right here on WBFO from Ninety point one\nBe you\nI Know but we\nRead in by\nWhat's your name in the\nAnd then oh\nBeen meaning\nCan tell me no snow dream\nDo you\nMean to be the\nThing\nKnew nothing we um\n\nMm Mm Mm Mm Mm Mm\n\n\nGood how are you guys in the ...\nIn the movie that we don't do the the last year were you know\nYour Mother Jones\nDa da da da da ... laugh and then one day I think the only thing I've been around a\nIn a row\nAnd oh\nThe way down to the the the ... and a\nAnd I knew when they look through the metal reading\nAnd the time but no one no\nAnd\nDad\n\n[noise] Mm [noise]\nTo me you know who\nI Know what I\nCall [noise]\n\n\n[noise]\n[noise]\n\nDuring the Nineteen fifties you couldn't hear rhythm and blues on the ... box or the brush did you hear all that down and dirty\nThe rock and roll you had to go to that you can look bad\nWar to where the blues that led to the rock and roll explosion\nMidnight [noise] why he shares professor lawyer shows ... well you know the other heroes as early on\nTo the tragedy where there's just on the floor and it is likely to cheat\nCatch juice all night cafe Monday morning at one point [noise] W. I. G. S. [noise]\n\n\n\nA\n...\n...\n... ...\n\n\n[noise]\n[noise]\n\nAnd\nYou should\nTry\nTo I guess [noise] [noise] like maybe\n...\nDay die and I do [noise]\n[noise]\nAnd on and [noise]\n[noise]\n\nAnd um I Am da da da da da da da da\nDa da da da da da\nDa da\nDa de\nDe ... and\nThat I that was the [noise]\nYou know one of my\n\nHe he\nHe he he [noise]\nYou been to new yeah there you go to a certain age age range in age and by giving them any way\nTo live in Charlotte and she said I Am in Florida\n\n\n\n\n\n\n\nAh ...\n...\n\n...", "year": "2018", "show_name": "no_show", "city": "Indiana", "day": "11"}