{"month": "10", "state": "PA", "station": "WIUP", "content": "[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise] oh no\n[noise] [noise]\nYeah\n[noise]\n[noise] [noise]\n\n\n\nOh no no\n[noise] um\n[noise] um [noise]\n[noise]\nOkay [noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\nDi\n\nDi\nDi di\nDi di di di di di di di di di da da da da\nDa da da da da da da da da da da\nDa da\nDa da da da\nDa da\nDa\nDi di di di di di di da da da\nDa da da da da da da da\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\nGosh di di di di di di di di di di di di\nDi di di di di di di di\nDi di di di\nDi\nDi\nDi di ... [laughter]\nI Wish I knew\n\n\nShe knew she weighed\nIn on the table\nShe knew this game do\nSay it is that really was new\n\nShe ain't got no no they will [noise]\n\nWait a\nMinute you\n\n\nReally good in my opinion\n[noise]\n\n... ... ... ... ... you know we've been we knew how to do when\nAnd in\nOur family law\nSchool\n\nAnd [noise] and then you\nThat this was not just that would leave the ...\nTo know when\nShe ran\n\nNew\nAnd\nAnd and and and\nAnd the ... and ...\n[noise]\n\n\n[noise]\n\n\n\nYou\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\nHang do\nNot believe we've been [noise]\nYou know you said Neal that when you touch the bad news\n\n\n\n\n\n\n[noise] [noise]\n[noise]\nYou say [noise] [noise]\n[noise]\nOh [laughter]\n[laughter]\nAnd you can and [noise]\n\n\nYou choose to use his shoulder\nCry you know\nJohn my longest you John [laughter]\nWas a cell phone is misery she still has maintained a really\nStrong along with your guest and things that come along if you\nDo not do that on my\nKnees you rely on for a man should have\nBeen around a hundred dollars you know where she was on\nA\n\n\n[noise]\n\nNamed ... ... ... and ... and ... [noise] and then they\n\nCome out last year I don't know [laughter] something\nLike that she saw\nWhen I was living on the line now from time to read a little line on the banks\n[noise]\n\n\nMm Mm Mm Mm Mm Mm yeah mom\nBirds ... name you know with the ... they have a plan for the wrong thing that in the sand or you may even\nDi di di\nA bad thing but I\n\n\n\nAre you among the millions of Americans living with chronic pain if so you may think prescription opioids are the solution the truth is the benefits of opioids are limited opioids only mask the pain\nOpioids also come with serious side effects ranging from Natasha withdrawal symptoms to overdose\nAs many as twenty five percent of people who are prescribed opioids struggle with addiction and those who are addicted to opioids are forty times more likely to move on to heroin\nNo one wants to leave in pain\nBut no one should put their health risk to be pain free\nThere is another choice physical therapy\nPhysical therapists treat pain through movement and exercising no warning labels required and do you get to be an active participant in your care\nChoose to treat your pain safely\nJews physical therapy visit move forward P. T. dot com to find a physical therapist near you\nThis public service announcement is brought to you by the American physical therapy association\n\nLa\nLa la la\nLa\n\n...\nMurder you\nKnow what's going on with the war at the edge of a joke that joke that Roger Dodger pitcher catcher in the ...\n\n[noise]\n\n[laughter]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\nHave you got ...\nWe'll let you guys she lived in London you seen some of the obviously again well why do you are in terms of Jews in the\nSee again he does this you may miss some way at all over in the\nIs really drink then\n\nYou know you may you may everything that you guys today Myron\nYou've got the book\nIn the long run it yeah I Do know that there's still no one that I make\nSure they're mine down a little girl\nUm salaries were just you know constantly um look up to\nAnd do they say that that\n... we just read the yellow\nYou want to say well\nTuesday\nI'm a\nNeeds to go to Roger move\nMom mind when John ... died the\nLakers or\nAlong the way it is as bad in track and field like I've been looking for a job\nSingle why would they value\nMan and we can do without\n[noise] a\n[noise]\nThey don't need these ... magic and need than we do\nWe don't\nWay they do you draw the line every time an online and why\nDo we do and\nBelieve\nEven well three three hundred and I'm\nSure they don't know\nIt was a a value ma\n... thing and you know\nYou\n\nThe cage and many may and June and and\nAnd then she really is\nDownloading they can use while\n\nIn a\n\nThat's\nUsing the\nLaundry is that you feel like I just don't really know\nMillion dollars a\n\nW you read and then in Indiana, Pennsylvania is now [noise] W. I. UPS by\nIndiana University of Pennsylvania I just read in line now you can do\nAnd retired I mean what are you going members and unity\nW. I. U. T. M. M. operate on on this one is the only one way or the Ukrainian power\nBy the Federal Communications\nW. O. U. P. M. M. officers are located at our friends\nThat were Indian town are located on\nTranslator studio equipment for some of them are provided communications media department\nHow are you all the good knowledge is an equal opportunity or getting from all of us here like you were listening to UT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\nIn the U.S will be radio dot\nO. R. G. broadcasting live from historic Allegheny square in the children's museum was Pittsburgh along with the ... this is Larry burger and this is the show that gets your weekend off to a good start the Saturday like brigade\nSaturday morning said eighty eight point three do where you are cheap cheap Pittsburgh Ninety point one W. R. U. P. F. M. Indiana\nNinety point seven WM CEO new Concord Ninety One point one double usa Jacob city Ninety One point seven WN JR Washington Ninety One point seven WC UC clarion Ninety six points free W H M\nCharleston and a great group of Internet radio stations and streaming services including our own SOB radio dot O. R. G. [noise]\nNot as a\nMap home a lot of trouble and\nThe ... strong\nThe [noise]\nDave apple and the ...\nHere at the Saturday light brigade good morning the norm in upper St Clair\nIs do you know they show\nThe good place\nI've been been watching the good place which\nStars had dancing and a great ensemble\nAfter death is like with a good place being have another bad place being the other place\nThere's also a medium place or\nTwo that is one of well written and\nClever show and we don't have too many other people\nAnd it's a really enjoyable I Hope\nI I have a feeling you would enjoy it if if you\nSaturday mornings I think you'd enjoy\nThe tone of that show coming up in a moment a chance for you to earn a Saturday light brigade charge with our crossword puzzle here a few things that I Need to catch up on [noise]\nI mentioned earlier that [noise]\nAh Tom made me smile or it stalls out he suggested germane IOM from the root word germane if you fell asleep and chemistry class you could uh\nAbby EMs who are answer of our brigade trade puzzled germane the um [noise]\nA nice a puzzle answered [noise]\nAnd I mentioned that knew Fred Rogers album\nThat is out or an album of\nSongs so Fred Rogers interpreted in a jazz style will play a song at the bottom of the hour from that album and I think you'll enjoy getting a chance to take a listen [noise]\nTerror networks joins us in supporting the Saturday light brigade headquartered in Pittsburgh pair networks provides website posting and domain registration to people from around the world more information is available at ... dot com that's P. A. I. R. dot com now it's time to\nTurn a Saturday light brigade charge [noise]\nLet's see if you are able\nThe forest ladder is view\nAnd the second letter is she ate letters altogether the\nFourth letter is you and the second letter is see and the clue is border\nRecuse auditing by work now\nFor one to two hundred\nFive nine seven five that I get the number right for one to two hundred and five seven five or ... triple eight seven five to seven she'd free for if you can come up with the word that fits a\nDoes clues again the clue is border\nThere are eight letters\nThe fourth letter is you\nAnd the seven letters see an Ricky give set up thumbs up you can talk with her or me if you call right now it for one to two hundred\nFive died seven five\n\nIt's not going to have to do some on spring and the bell so it's not going to have to do some listening and the bell\nOh don't drink and the bad\nSo I'm On my cell\nPhone ringing a bell\nSister just using\n... the ... the\nMom dilute the bill and I'm\nOn the other day\nAt the gym number one with a bill\n\n[noise]\n\n\nYeah I mean there are no matter what no looming at night when he does need\nI Know we [noise]\n[noise]\n[noise]\nWell we now know that our puzzle is solvable Craig Macon Georgia just got the correct answer said the margin Brookline morning Marge Sharon in Apollo words or hurts thing according to Iran\nShe got the correct answer so did and she and Mars and marry brown about the correct answer as well [noise]\n\n\n\nAn Dan in North for sale has the correct answer hot Dan Hi Larry how you doing good thanks for checking in it's good to hear your voice\nYou if it figured it out did this one take a while [noise] little bed why I'm always putting things in order so I usually put them in sequential order I must I must have that kind of the sequence sequence it is [noise]\nYeah I tend to want to do that too [noise]\nI have a grandson that does about the same thing he he puts like simple things are to order a if he doesn't have a number twelve and ten and\nEleven Thirteen I tend to do that you know here's a question do you tend to add numbers into your head if you see a oh yeah I I Do that at some time in Atlanta you that that's just so\nBefore I get there oh there you go a couple of dollars off and Ricky used to play that game she would try to see how she could be\nYou know very very close to the total today the cashier would come up with a right right [noise] pretty good\nI tend to do that a lot and when I'm working with folks it it was one thing when I worked with a lot of engineers or other engineers do seem to do that I'm here working with a lot of folks uh who aren't\nAs summer comfortable with math but they're just not used to dealing that outlook it right numbers now just start adding things in my head because I I don't want to lose the ability to do that so they have to rely on a ... calculator but I've learned to say\nJust bear would be for a minute you don't you don't follow log let me do this because some folks are will look at me like\nWhy are you doing this [laughter] how old is your grandson\nI he's actually half of a pair of twins have well\nWe were with them last weekend and we were hoping for some good puzzles I think we last year we're on our way to hire\nA but yeah that\nWell we'll get I'll get on the list and then again next time\nOr why we have a well it's good to hear from you Dan thanks for calling and sharing your one of the few that came up with sequence that was a tough one to have a\nPretty good ... any facts thanks very much I\nTalk to your letters thank you\n... in North for sale [noise]\nAnd congratulations if you came up with the Clintons that's the word we were looking for [noise]\nWe gave you the clue order [noise]\nWe have a minute our year end campaign will be starting on November first that's when we [noise]\nSaturday light brigade broadcasts weekend and we count if you enjoy the puzzle games here you can consider and I hope make a year end donation at SOB radio dot O. R. G. slashed donate\nOr by using a link that you will find across her Facebook page is too she ended with all of the puzzles we have this morning so please consider making a donation even a ... it's amazing you can make very quickly of five or a ten dollar donation or does donations to add up\nAnd make a big difference so look at us will be radio dot O. R. G. slashed donate\nOr you'll find a place anywhere on our Facebook page where you can do so the URL some Lester have become a terrific bluegrass group that so many people enjoy listening to here's a song from their debut album [noise]\nNews [noise]\nMy mom told me\n[noise]\nI\nDon't\nKnow [noise]\n[noise]\nI'll let you go down\nAnd why don't you go down and we're still\nIn my living room to try\nPay my bills\nBe you know like the only\nYou go down\nTo shoot the ball down\nAlong the same area\nOn that\nMayor\nGame but then the older I found them\nNaive jam\nDominated by gang me I'm\nNow it's time for it\nAnswers bees to clues gathering of people\nUsually for fun or a person to give the same treatment to everyone a gathering of people usually for fun or a person who gets the same treatment to everyone\nFor one to two hundred five seven five [noise]\nDo you know the word that\nAnswers to those two clues has the same words spelled the same way for one to two hundred\nFive nine seven five\nFor one to two hundred five nine seven five\n[noise] Linda Thompson [noise]\n[noise]\n[noise] [noise]\nI Am but um [noise] my misfortunes that\n[noise]\nMany months dive in court saying [noise]\nYoung say nah [noise]\nI've courtship game the [noise]\nMy nights and I do [noise]\n\nMuch now for insurance for [noise]\nHe's gone far\n\nSee I Would say [noise] I wouldn't mind my love tale [noise]\nWhile still ring\nAnd a lot on my mom's mom is really widespread\nIf I was\n\nMy last taller than I Am so um\n[noise] what's that every year degree\nTo my parents are just I Am\nBecause he loves me\n\nAnd say well they ...\nMile dive breaths and my body\nI Love my last\nOh my God\nWas so I'd say I love that you know my true or they'll say\nWell I'll let Tom again\nI Would say no when ...\nLove\nWas\n... it was a little\nSee you again maybe\nWhen he sails rounds\nThey they are all the kids\nAnd I say to me\nI Love is a threat\n... well I mean\nWhy why\nAnd then\nI Want my I'm not so true\nWhile still looked up ... and\nI Would say no way ...\nDi di di di\nDi\n\n\nVe yeah no\nHe's been then you know\nThey say that we\nFind real show\nIt is saying the\nIt's a terrible thing\nOkay\nSo you're\nSaying [noise]\nMy my um you know in my shoes off now [noise]\nLast child rearing [noise]\nI Would say no when\nI die when\nI'm On the water\n\n[noise]\nYes I Do [noise]\nLinda Thompson at the Saturday's like brigade and the other day or not\nBlue birds they are blue birds and that would be the [noise]\nBluebirds that like I say our bluebirds but [noise]\nWe had a bunch of uh I I think given the go bumping should other a\nBlue birds are but we had a number of you know the\nBackyard bluebirds\nHundred ... the other day there were five of them are eating grapes\nAnd squawk and away and it was fun to see I don't think I've ever seen that many\nAt once the result whole family of blue Jay is what I meant to say that not blue birds but blue jays\nSo far we've had a number of interesting guesses\nTwo are one of a kind of wonder word\nLarry and ban in ... city\nMatched us as did any\nIn the Philadelphia area and Melissa and might as well\nOur puzzle ... is a gathering of people usually for fun or a person who gives the same treatment to every one\nI did want to mention the alternative answer because I think that's the one Brian has good morning brought in\nEh what's up Larry how are you in my bed I'm fine thanks where are you this morning\nA me I'm actually in the Boston area is a hole in the little bit of snow for\nOh my goodness what you what did you come up with is your answer it takes you\nI thought it was a party for gathering of\nYeah a gathering of people for fun as a party and a person who gives the same treatment to every one of I guess could be a party\nOr you know the party of the first part of the party of the second part but we actually had a different one in mind [noise]\nI might be able to help you if I said an outdoor gathering of people\n... or a gathering a gathering of people usually outdoors and for ...\nCelebrating on the twenty fourth as well as Stephanie north hills and eight of us are St Clair from Norman ... urban\nJulie and Becca\nRandomly show on the twenty fifth way of pan [noise] we mentioned\nCc earlier it's Ken's birthday on October twenty fifth\nTied to subscribe cities celebrates that day as the map you obscene Leno bull Lisa Amanda and it's an anniversary for bath and Kevin finally on friday it's Christopher Brentwood creation of group city Julie of Hampton Olivia of Peters township pick you know come out\nAnd happy anniversary to Katie in clay you're listening to the show that gets your weekend off to a good start the Saturday light brigade Saturday mornings on community radio [noise]\nWe ... I used to be [noise]\nIn a very good Saturday morning and welcome to modern tribute orders on W. I. U. P. I'm Jim Rogers your host for the next two hours [noise]\nFeaturing contemporary singer songwriters little bit of blues today [noise]\nA couple of themes that [noise] stuff like that\nWintry Saturday\nToday we'll keep you advised\nWith what's in our community calendar\nI Hope you'll stick around for the next two hours going to start off the music today with Heather messy\nShe's one of the members of the Waylon Jennings\nSolo release it is the title song\nIt's called birds\n\nTo choose a K A lot\nTo think that that's not\nA\nNo well\nI'm not ... the u._s.\nDo to change\nThe that ... that she\nHas to\nBe slow and they\nMay ...\n\nA lot to see\nChange\nThe the\nTo you know\nTo\nChanging again\nWhen spring comes to me to\nThere's really no way to get a caller\nAbout three then\nMe to breathe in the\nAnd you know some of them like the double some some rain\nThere have been recruited and\nNot with the Cuban then and\nThese people come\nThat bad\nNot bringing the beginning\nI invoked ... well I don't think there\nBurned and stuff but I Do agree that\nBringing these other states maybe we\nYoung and the big\nWere\nIt's just W. I. U. P. F. M. Ninety point one Indiana\n... ... ... ... ...\nFor just ... I Hope you are listening closely and you will ... can you read that in every but I Do want to do and where to go with the answer to your question you\n... you can blame you live\nOn every bus load load IEDs in stone building ... what do you think you will ... somewhere in your heart you know who you're more than what you see\nGood\nCould live my brain ...\nYou know by the traps and slow down the brain you know down the chain none but when things to be my friend\nDo they showed a good a widow the bad times just made the good times good or his food of course railroaded do but also being dragged him away back be bought for being track about my way back in [noise]\nThink we've had a glass of milk at the corner bar ...\nDon't matter if the cat's black or white to get you to miles in the night\nMr boo Radley she was right Mr Bean Radley\nHead in the rain and then came back bullet good and the thing for you\nWhile loves living outside the law one quarter for\nMe to pay the rent and they\nLove and that is the MEK does not as Jordan do their thing and the tweet meet and greet the makers Dobbs show we when we were just brandy\nYou'd never made\nMe my bill\nThat you love almost ... knock you know we're going to lead from out here in Burbank\nWant the money in June ... show to get ready now do cats do\n\n...\n... ...\n... ... ... ...\n... ... ...\nJohn Wayne bird ...\n... I'm ... and\n...\nBrother the blood ... you\nKnow it's like a dream\nThing is some man the\n\nLee\nWait and see the\nAre really change\nAnd no one\nNo no no\nNo no flier blessing to buy\n\nWhen ...\nMom lenders sign a\n[noise]\nNew ...\nThe isn't going to be\nHit to send the same time and\nNow in my home\nShe's ...\nThe sun none no\nNo no\nNo no fun you\n\n\n[noise]\nMm Mm Mm Mm\nMm Mm Mm Mm Mm not\nDo more now as far as I Am\nNot a black and I'm the one I\nSpoke in Eugene Oregon I'm\nDrawn woman she iron\nMy legs came running I Know we can turn\nBack the old doors within the last\n... or drop over the world but I can tell\nWe bought a way\nThat room for\nA way the\nOther blood was warm and red\nRounded acting\nBlessed with key ... was it a\nLot of drew\nSounds those who\nWalk up the road with middle\nSilver and sweet but Bill Maher\nComing go as\nAs the rest of the shows some say\nLot of the other children say ...\nTo borrow way\nYeah broom ball\nWhere the\nJokes on the status by [noise]\nDollars from ... to my\nLeft ... one of the time and time for\nAnd um my mom's been lining\nThe blinds in the habit though\nStart a group that was that a big baby but it got to keep\nOn ... kinda don't want to\nThough that is you know\nAnd it's All right and you know and you know I'm a ... a man yeah I mean is the land you know\nThere's been\nRise do you play\nSome banner signs you was the man I got there we were at all their\nThere's ... markets where she's standing in the way\n\nKiller Williams along with Larry and Jenny keel and a little Masha both Tom Petty's Mary Jane's last dance and breakdown\nJon Shane before that time to move\nThe wheel and Jenny's with wildflowers on this\nBirth anniversary Mr Betty [noise]\nThis is modern ... Ninety point one F. M. W. U. P.\nStick around later on today start off your evening with this great program [noise]\n\nThe progressive and psychedelic rock along with some occasional blues vote ... country tune into vinyl tracks and I'm Jim\nFor vital ...\nAnd then at ten o'clock this evening check out the musical box\n[noise]\nW. I. U. P. S. M. continues its tradition of unique programming with the musical bucks every Saturday from ten pm until midnight tune in as David resents any collected mix of down tempo deep house get electronic a trip up in war\nAgainst the musical last Saturday at ten pm [noise]\n\nFrom the community calendars something else going on this weekend you will enjoy it's the annual potters studio tour\nIs taking place today and tomorrow from ten AM to five pm each day potter's throughout Indiana county will open their studio workshops giving visitors the opportunity to see how these masters create unique pieces of ceramic ...\nEleven studios are participating you get to see the work of twenty five potter's on display\nYou'll have the opportunity to torture studios meet the artist watch the demos\nAnd shop for unique creations for yourself or for holiday gift giving a map showing the location of all the studios along with additional information is available by visiting potter's tour\nRobert Earl keen from his album the rose hotel [noise]\n\n... ... one of my personal favorites affected by the boom from his album\nAffected by it\nWill get to see it or we're wrapping up to a full moon are not going to see it and I might get some glimpses of it tomorrow night\nAs a forecast is for partly cloudy Scott\nAs a loon from fair and square Robert Wilkie something\nThat I Do\nFrom his album the ribs hotel this is modern tribute doors Ninety point one F. M. W. I. U. P. [noise]\nSomething to do later on this afternoon yellow creek state park invites you to decide whether or not\nOwls are guilty of murder [noise]\nIt's the ALS outlaw in our program\nBeginning at six Fifteen PM\nAllies have been accused of many crimes in Pennsylvania history but are the accusations true you will be the judge and jury as you head out on a hike to gather the evidence\nYou'll meet at the environmental learning center and be sure to dress for the weather\nYeah we're good hiking shoes and bring a flashlight its best suited for those ages seven through adult\nPlease let Lisa meadows no you're coming by pre registering\nEmail her at L. I. meadows at P. A. dot Gov\nToo it's Saturday evening mystery for [noise]\nFrom the squirrel hill section of Pittsburgh [noise]\nThis is the squirrel hillbillies on modern troop adored [noise]\nMan their lives on the western land guy John Maher Ghana mountain range\nRomney cab around hers the lady who was ...\n...\nPlays into this\nRaised by the wind and above and below move\nThings real slow ... does he rode with all the ...\n\n...\nThat some drinks without a net\nSites like the devil ... wherever you know ... ... men mangy dog is only ...\n...\n\nMangy dog in a\n...\n\nMainly dog in a ...\nDrinks is way down the dancing all had to be the answer to the mall\nGet shot 'em then in ... ...\n...\nNothing left to this ...\n... ...\n... ...\n... Mm\nMm Mm Mm Mm\nMm\nI don't know a ...\nProblem real\nIn for my\nShe said and\n... who never saw Karl\nDone no ha and I do have the advantage dot\nA big guy guy de\nKnows God and\nLa Brea or\nEarly ... day\nThe Lone Star state\nMy for\n... yeah\n\n\n\n\n\n\nKnow a hand\nFrom a real\nGone to a\nSome golf ball and know\nKnow my radio oh\n...\n\nYou're listening to Ninety point on W. I. U. P. F. bend in Indiana\n\nHe ... cattle\nWell he is the biggest dollar loan and he goes on and on about little rodeo\nIs here to ask\nThey can do all the girls are these carbide\nHe jumps don't tell them that it's only\nIn his dream would be good too because I was dating beget strong\nLiberal wrong nose to nose all\nDie every time he thinks\nHe looks a little like James Dean and yeah he's a cowboy would only in his dream [noise]\nDo you read and [noise]\nFor one guy the guy who was just one line I don't know\nWhat loaded the may ... mile and a one man of the women are drawing their main one\nMan and bomb them to do with being met them the late ... moderate\nYeah I'm a moderate\nDoberman made on the bed and made all the ...\nThere's kind of a new mother then Jane my right now and ... and on Monday and I am right now\nWhich one you know like\nLaura admitted well then I don't really get to run a moderate\nModerate don't\nMade I don't know when you don't have been made um\nA vote ... the roll my eyes they overly zealous rude or is it is better than\nSaying what they mean you know what they want to hear\nGuys are going to get the legs you know we're going to win the lottery\nIn may down ... down the\nAnd a and\nI tend to dismiss\nIn and do a better look got on the road\nHand level the rovers neo their hold my\nKnow look recalls I bought on Winston Churchill in my early\n... for all the other guy says\nAn ... million dollars man made a\nMay down to the bank made um\n[noise]\nWe live in our Ricci in brown\nOpinions from it you know\nIt a new one a\nMinded ...\n... ...\nThey convert all about it all around the ...\nAnd then they're easy chair\nDrinking in theory\nMaking them out\nMan in the\nStream on them when they're by going on right and in some sense you know their own way\nAnd me either the devil man guys on their side in plain Abu nose or their pay\n\nCheck with your friend\nOf mine and people\nWho did the\nThe boom\nAssertiveness there in the know\nKnew what would you pay them the New Year's day to day here on the radio\nIt really was the bunny with those people\nThey jump in\nBlue man the people who\nWere there are so I'm not over\nHave a land guys on their side is ... knows there may\nBother and yeah but\nReject this man your brain\nNa\nDead animal man be\nAnd it be\nJefferson Ross from his album dog would get\nOne called closed minded people\nStill Marcus who's a member of gathering time\nOut with the solo album couple of years ago called welcome to Sunday Nassau parentheses county Long Island do did one called the moderate\nWith a little uh\nBorrowing from the on duty and Steve Goodman from his first self titled recording election Iraq this is\nMonitoring the doors on Ninety point on FM W. I. U. P.\nI'm Tom ... your host or the sink out radio magazine this week we feature the mighty mandolin and we'll hear new music from Roanoke white black Patty David Benedict in many more the mighty mandolin and the next edition of missing out radio magazine\nCheck that out you can hear the same now radio magazine Sundays at noon right here on they'll be fine you paint [noise]\nBreak from the patch the president [noise]\nI think you can prove to a great deal of\nThe old the new nothing really are and the forgotten what the Sunday stable at all let out from eight he'll lemon and he is on the\nRadio or on W. R. U. P. F. him it was Sunday simply with mark Morris you [laughter] [noise] ... [noise] yet\nAnother fine program you can do your own W. I. UPS and we are loaded with them\nFrom his album haven't got the blues yet\nIs vital truck plowed and when I left there\nNo Mm\nMm Mm\nGot the blues yet but I Am somewhat depressed\nI also hope there's issues and she said that she began to\nNice dog\nAll my wallet and ... and the cleaning lady and the\nYeah but I just do the downfall of the law damage yeah they can that model the dirtiest club\nMen I'm In the middle and everyone else is terrible came I got a bad and the Asians and grow\nUp and my mom all the you know rather\nThan as well my composure and\nKind of low mild though that make the ... the average out the blue is you know the experience mostly na\nBob Dylan covers Jimmy ... this is on his similar on manifesto C. D.\nExcuse me skip one Christmas her down in the flood\nMm\nNot do you think I'm ...\nAnd you know\n\n[noise] no\nNo no no\nThis ...\nRural new\nYou learn English so ...\n... ...\nYou got to go see\nSome didn't he\nThe any ...\n...\nWhat did you mean the minute the\nSkill no major\nI never said\n... ... ...\nShe wrote up so\nShe put down in ...\nI don't see\nI should even do\nIt no no yeah\nNo real world\nDo say\n\nNo no no no kids\n...\nNever no no they\nI don't mean remember what it was ...\nDon't even\nKnow me\n[noise] [noise] [noise] [noise]\nThe more provided by hybrids spring water makes copy the staff of believer feeder and Johnny curry nose in Lexington\nOur shirts produced witness for the visit like dot com Kentucky tourism travel has magazine as big as bank of the need to really grasp how do you say the Asian and the clarion hotel conference center south in Lexington, Kentucky visitors from all over the world to Lexington, Kentucky\nWhich zones in the woods so similar registered trademarks of Rachel lumber new car she was distributed worldwide by the which owns radio network NPR rex thanks for listening I'm joke on grade\nFor Michael Johnson and the entire with thoughts create this is Dorothy had words we hope you'll join us again next week for the wrong time radio hour\n\n[noise]\nAnd this is where the music mattered since you're listening to W. R. U. P. F. M. Indiana your alternative source [noise]\n\n\nNa\nNow though\n\nThat the\n\nThen\n\n\n\nThen maybe\nThe\n\n\n\n[noise]\n\nBlanche you oh\nMy name\nIs ... I made it to\nThe both of you\nAnd your story and\nI wait times\nTo my mind the cold so you know\nNo\nThat's not a I'm a\nI'm not saying well I'm\nAh\nYou can see you and your\n\nWas going to see you know\nFor tonight\n[noise] thanks to you\nYou'll do wrong time I think\nThat's by\nMy ...\nTry to do\nThat it was just\nThat should he do\nNews you\nUh\n[noise]\nFrom my body [noise] and my lips\nOh\n... [noise]\n\nThe ... well\nYou know the\nA what I Know [noise]\nAnd we do in\nAnd well party\n\n... that\nThe\nGame to keep me and my\nOwn there's oh we're\nWe me and\nA child by\n... to\nWatch oh\nI'm a\n\nIn a in\nLuck ...\nGreen and man ...\nWhereas they play golf ball\nLeaves re\nPlace because I Know\nSt Louis\n\nAh last dude all\nShit I'm a\nGirl again don't we all\nTo be wrong\nNah no ...\nReally know\nTo the ... you know and ... get a was\nGo and do we all have\nTo be around now\nThey there was a little ...\nAgain don't\nWeigh a ball has\nTo be wrong now\n[noise]\nWe all have\n\n[noise]\nMm [noise] Mm\nWhen ... when they do not my ears rang drums that stuff [noise]\nNike my rearview mirror and if it's going to\nThen ... will not know what\nThey were ... you know so you\nKnow I was on loan and download\nTheir own and raise\n\nDo stand up [noise]\n[noise]\n[noise] [noise] Mm\n... to\n... be [noise]\nTo the gym and doing the girls go with me [noise]\nI saw that I go through the birds meet ...\n... ... ... by putting them with me I'm fat and ah\nTheir own eyes you mom misery ... heard\nAbout change right\nInto\nThe birds\nBe better\n\n\nFor Indiana county and all of that country dishes W. I. E. S. and Indiana, Pennsylvania [laughter]\n\nOh\n\nHungry on oh my God\nWhoa hold up ... I\n\nSo do you do your letter on the no new moms\nBlack when you\n\nBreed um did you ever been in ...\n\n\nLong\n[noise]\nUh\n\nRead things you've been\nUm [noise] I\nYou\nKnow\nI think you know while I'm much more um [noise]\nI\n\n\nThey\nReading very sure thing\nDo you go about it and\nWhen I bought it ball you darling\nIt seemed to be jokes raw\nGood you\nDiary\nDid you enjoy your family life and I hear a\nAlong with my\nOwn steam mile a fish and I'm so don't don't lose [noise] our own law law even minor\n[noise] I'm On a strike you know I Can't talk\nAnd then maybe my\nHeart and let me look a little\nBit the polls on right are you in your\nOwn mom known by\nAnd large up try I Try not my job paying high\n... mind all the flu shot up around\n... got to pay 'em in our own ... by\n[laughter] I'll go on a\nTeam again there are lot came on it saying all in the last marine a guy named ... there\nHas\nBeen awesome Brian for you you were on mom wrong but ah\n\n\n\nYou mean you can't assume that the [noise] ... you\nWish your family\nLine about down the the big rage pain to stop and they don't want to make the yard overlook it do they say about Islam\nAnd standing in the door was waiting to me and you have a great place to you and then after a while he was leaving again any shit to lie to\nGive me up for their stand the heat that Waterloo Johnny and say that again that bigger reason now that I'm In\nThe whole thing with the Marines all the grueling lobbying back gifts and muggy [noise]\nAbout eight hours on down the road I waste all these old well [noise] I got in\nBig bad role in the last two men Michelle [noise] would you gauge ... Johnny ... and ... which has a jailer live in a lock and dam she thought he was tired and you\nGive me the sand in the modeling Johnny saying I got to give that being\nOr whatever and [noise] any older to the bar which really then\nI'll be buying back yard just saying in the ... [noise] I'll be the law brings back is saying and muggy\n\nSaturday mornings listen to what the modern dribble doors have to say they're writing and singing songs about the lives we live the people we meet in the experiences we share songs about where we bend\nAlternative source Ninety One FM W. I. U. P.\n[noise]\n... which is why you see is meant to be in a sense what they knew when you suggest matters [noise]\nAnd relate\nAnd I ordered called the N word you know\nThen you start by on your way sometimes later many we rent\nTo be that ...\nLive maybe an ID the right time\n... and ... and you could get really briefly jak budget on line and we'll right away and the time\nSome staying married\nBuy a book by either way down and listen\nThe bone blame or cats\nDo reading what'd you threw me a loan or\nDid you take mine [noise]\nYou have a baby ratty the rabbi\nNo no it and you could get a breeze a real\nJob well then we All right away\nThe fact\nMy house while you were\nOnly\nWay while your time to time with world leaders let alone a lonely bike lanes [noise]\nHe ah they they ride ease the right time\nHave been really briefly\nWas a real right away\nJohn my job well ... right away a\n\n[noise] Mm\nEvery time you got in a\nJob\nI\nWhen you see 'em well\nTo me you know\n\n[noise]\nMm\nToo many um ...\nBe can be first thing would be [noise] [noise] [noise] [noise]\n\n[noise] Mm\nMy own business to down at the Kogan took me a\nHappy hour's ... been around a silver bullet and all hey oh there was breaking a man and nearly all the lottery and became a moon throwing chairs dry and our ...\nHer that overwork bartenders saying how to use\nMy Louisville sluggers this way\nOf suck it up for the job\nA kid or\nA painter you are no jobs here have an unfair\nTo ... how\nCan you come down guy Donald ball though\nRainiest dodgy it'll rain\nMm am name\nDown on the patio and guidelines are rolling in and buy up and you write\nA song came out from a long time ago\nWhen I was carefree ... ...\n... lives in the past\nWhen a cell phone rang\nBy ... by a red\nWent to grab them bone in Roanoke straight out in the ...\nThen she whispered to leave it to me she told and suck it up\nAs a kid over in\n... Maine are you a hard not to die you're having an affair usually badly\nThis guy going to bomb\nRainiest Dodger Stadium\nDrawn\nIt happens to was in the\nBook\nCalled the true paradigm is not my luggage yards up but\nThen you read a map that bad but now that she said we got close but they'll call they live\nPalm trees and all\nLand in Missouri where the jobs that are made\nShe let me mother's servers that they had live teachers they love this program paired with me so uh\nGet it over a\nNew thing in a ... a million dollars a year and a bit of a\nI'm damn guy Donald ... no\n... on\nIt happens to us\nMm\n\nMm [noise]\nJust don't bother me\nA little dogs they go and\nOf these days that's especially when\nAgain after their me for the\nWhen I\nA good way to me this ...\nNo longer see much you\n\nW. I. U. T. S. and Ninety points when Indiana girl her somewhere [laughter]\nMm\nI don't want to hear the\nOn the\nDid a lot of\nThey don't know the real not one of the new\nTo be is now\nAnd then they say the new ... dream dino presumably [noise]\nThat is a guy will only follow my tears behind go ... pi sun shining\nBack to that really blew team or the\nUh\n[noise]\nMom\nBetty sue\nThe company in any way in um new\nMcCain someone needs to be done to sneeze\nThey need that yeah\nNo\nWhen you ... you get older\n... ... ... she knew the wizard district\nDating game in may need\nA little bit of rain\nDog minimum salary\nThe ...\nWhen they were today\nWhen you're ...\nGeneral rule\nKnow the game\nKnow keep\nGoing\n\n\n\nA ... ... do\nOne for eighty by attorney\nBar man I'm\nGee\nHow long we\nDole Rene\n\nThe time other crucifixions\nThe dog would have changed the size of the ocean and other sports drink\nAnd Jesus let's sit and ...\nBecause of your regret in Haiti for myself\nCan tell the dog would grow enough to be you know four grown\nAs the Shelby slender and then with any luck to them shall be in the form of a grown too long pedals and\nIn the center of the outer edge of each pedal\nThere'll be than that you'll rent around with Ron Dane was\nOf the flowers will be an image on the ground them\nThat it was up on the do what\nAs a reminder of my ...\nMake sure jeez\nThe tender age\nDo grow\nTreat [noise]\n\nYou know\nMy leg in\nKnow I'm ...\n... and\nYou know would you say in\nIt for the men were in ...\nA in a in a\nNa na\nNa na na\nDo man\nI mean do they call the ...\nIt would be nobody but\nMaybe that explains the land\nBy a big day\nShe'd be there and I'm Glad that\nUse this data\nAnd we were we were mild way I mean it's a new mom you know they'll say why\nDo you what\nYou do mine and not willing to stand in line may find nobody\nTo buy a day\nShe began\n\nAnd then there you\nOr name\nThan me and you\n\n...\nDid you say the new\nPlace you know\n...\nMm\nI don't know what do you know no\nFor for him and he's ...\nHere we are\n[noise]\nUsed in your knee and you know\nDo you know needing\nThe ball and you\n\nThe area\nAnd he told me\n\n... the uh\nDa\nAnd we\n...\n[noise]\nMore music lesson taught [noise] this is your alternative source W argue the FM Indiana don't touch ... do you\nShows it to a\n... ... ... during the ...\n[noise] stupid but rather rule in the summer really proud of drugs I said as soon as she procedures and give me your money go for walks tolerance\nBrother to me and I should say my son who's over there both and I don't know where the plane image to ... miles from\nShould build the penny ...\nNashville Babylonian they begin to stash the metal on it may be a mental ... alone it may just below the goal\nOr get harassed saw\nDon guy for a lot sooner shown as they grow [noise] so so long to turn them around here to go\nTo the national debt Obama's name in the national battle on this day ... day is Nashville metal on a main\nStreet\nI never have but you saw in the cupboard in the public billboard magazine\nHad Jim thousand screaming fans never lived that are gonna rule Greece bowl that three star says\nNever to dilute style\nDo what I hear so road is shut down and I'm face forever is on\nNational gentle on its name to Nashville settled on a day\n... nah Spanish national metal on it said no sir\n[noise]\n\n[noise]\nWell now the ... says the purge shall be in the last in the last show pay for me personally been ... been a blessing and be served on the line with us today is mystery and make those\n... name\nThrown out along with me\nOn them along that stadium national metal on\nMetal on a bang bang\nAlong with the troops on the line but it died there that do that on a day [noise]\n\n\n[noise] [noise] [noise]\nAnd\n... ...\nOr Seventy or right after\n... ... the badgers blow\nThrough here and ... the blew\nUp the locks burger in June but the wild roles ...\nWhy around\n... their brains\nWhile on a real job\nThe rain will never be Chuck Schumer hinted leads Shane\nLon ... the plane the\nBlonde\nThe Green Bay\nWhile on road\nRange there Shannon never be\nThe main saying\n[noise]\nYou're listening to the station that has it all the ... century remote or Rob ... more than we are W argued the Advil Indiana your alternative sources I\nWho\n\nThanks for tuning in you are listening to Bob and be obese means best a bluegrass\nI'm Bob Michel your homes and this is the program that supply is your minimum daily required dose of vitamin B that blue grass state\nAnd you are in the city of New Orleans\n... that does yeah the ...\nNeeded and when I came home\nAnd the team being Green Zone\nBe made known Gary Coleman\nStaying in the middle ...\nThey may be pulling\n\nTo\nBe a day\nDay by day\nBy day by day they would\nThey need to\n\nThe day\nTreat them being given a debate\nToday on\nThan the ...\n\nAnd there's a\n\n\nForty years these new\nTo use the\nRun me more than ...\nTrying to make the\nThem with the rising sun\nStill the day is a\n\n[noise]\nThey're tired of being\nBreathe you log am shit all\nThe way he plays and\nAnd opening the set the alec leach band with Martha Spencer on the lead vocal with last old shovel\nI'm Bob Michel thanks so much for tuning you hope you stay around a little later in the program junior ... going to call in and we will have an interview with junior and I don't think you'd want to miss that\nAs we continue on who do we have special consensus and travelling shoes\nThat common knocking at my mother's story ... ... ... to go\nAnd get more to say yes well I'm\nOther been down in the book of the issues and then she shot it how you begin to move and then she moved down to the the dirty stream shot\nIn Moscow and redeem because I don't know not do that got on my travelling shoes\nYou got them\nAll day is\nNot in Baton my father I heard him say come on father made you ready to go\nHe said yes and he said yes yes\nWell my father being down in the shooting and he ... he began to move and the moon down by the the dirty streaming shattered Hannah Hannah\nSteam because I don't do that\nDid she\nCome knocking at the theater man do\nRoute heard him say come on man made you ready to\nGo where the ... the water started weapon up up up around his knees and then I heard him say\nOr to die in the ... the prince signed on what you can you do that in the water started ... around has really been\nRather than they should really ... know lord knows I\nDon't want to go back pain than I Do\nThink that might rattle their shoes long\nAin't got my traveling is huge\n... you know [noise]\nMan [noise]\nWe have some fun\nHi oh this is Greg Cahill special consensus and you're listening to Bob Michel thanks for tuning in B. O. B. means best of blue grass state with Bob for more great music he won't steer you wrong\n\n\nMy goodness was that some kind of picking your what else that was real motive church on the banjo in Jordan was dressed in that\nHunting the with the river of tears\nList is Ninety point one W. I. UPS in Indiana alternative source [noise]\nMy name is Bob Michel and you are listening to best the bluegrass thanks so much for tuning in\nWe still have one and one half hours left I Hope you can stay with me juniors this will be phoning into the studio and about thirty minutes so stick around to that as we continue down this bluegrass highway how about something from the bluegrass outlaws here they are with\nNo regrets\nName is making more money in the word of mouth when they blame\nMe to read I paint dry\nWorrying about being married to don't\nAround and I'm\nLike oh I\nDidn't hear you\nThe news you know [noise]\nLater thing these dogs for me\nSaying then you're not a grand you know my brain but now I'm older\nBut it's not only\nAround and they they did anything\nOh\nI\nName's Jamie another day in and then\nThe where the only magnolia blood\nGotten to\nMom and dad read don't they don't get\nFound them all the way they are more\nWomen than men way though the Joe\n'em\nDan Rather and then and then a man\nI Would say and\nMommy and daddy\nDon't hang around dogs can dunk\nBall a ball boy they're often the best way to do\nThe other day and then down again\nAll the men\nAnd\nOpening the with mom and all their friends\nDon't hang around and said oh\nCome on you know the way they there\nWas a ...\n... ... ... and now the\nDe de de de\nDe\nDe de de\nDe later and then then\n\n[noise]\nMano when\nThat you can show\nYou know which are three main barriers be\nThey\n... the\nDark greet me and they're not they're\nThey they don't start during the ... see\nOther way\nYou're on any of these ... years being\nA dog treats me really but there and\nA way we're\nThat you can show\nA bit over ... treat me bad ear see\nGoing to do\nAway with\nIt [noise]\nMove back your Pancho\nStart treating me mad is the\nWith me\nIs the way\n[noise]\n\nTravelers always will be and the Wilson banjo company with catfish John that was Sarah Logan on the lead vocal [noise]\nStay tuned I've got a little plan here I'm going to play three songs in a row and after that third some nut junior says uh I Will call in and uh we have him on the line for an interesting conversation hope you'll stick around for that\nThe shows that you're going to hear will be the him some girls with who needs to you Ellen ... grass down with Governor rising sun and the grad schools with an instrumental cold Lynchburg chicken ruin\nKnow\nThey\nMe and to me I\n\n[noise] I don't know where the music matters you are listening W. I. UPS family in Indiana your alternative sources [noise]\n\nI'm Bob Michel your host for our best to blue gray and it is always nice to have your company share this great bluegrass music\nWe still have one hour left I Hope you can stay with me for the phone interview with junior Sisk if you were listening last week you heard part one of that phone interview so today you will hear the remaining portion of our conversation\nAnd that is rejoining that phone call in progress\nWhen you go into a studio like this last one did it go easy are where there are a lot of takes on some of these songs\nOh it was really ... comedy and Nashville's will ever recorded this and all the\nGuys come in the studio there right outside of Nashville and we recorded it pretty much ... I mean all these guys are are top notch anyway on this show is is really about first solar project I've ever done it's kind of a transitional project\nOver into my new style what are you\nAnd I'm planning on bring it back some old country music and ... and some old obscure bluegrass times it hadn't been done it a long long time a lot of like some Charlie more stuff Reno smiley and\nJim ... out it'd be like\nNew songs to a lot of folks are they just stopped by that anymore they just look forward to doing what I Want to do for for the rest of my career and\nThis is what I was raised on a traditional bluegrass music and that's that's all I can do well I I was straying away a little bit so that's why I decided to make this change regroup\nAnd I'm aware of that and try to like the jobs mountain boys don't have much in the early eighties ... style I Want to do yeah er here\nWell I certainly applaud your your efforts in your dream and your goal I I can guarantee you that I'll play a lot of it I I was raised on traditional country too I mean uh I remember seeing ... Williams in concert\nNot not I am I saw daddy wow\nI was in grade school and he came to baseball park here in Louisville, Kentucky\nAnd uh wow the uh\nThere was no cost to it you know the cost was a box top\nThere was some kind of cough syrup or some kind of medicine show that he was associated with and if you were a kid it was one box stop if you were an adult it was to box tops and I saw a cousin of mine and the going with me and talk to my mom into buy a box and that's that's what we call it a blessing when ... Hank Williams\nWhy it was great off yeah I mean I've met\nEver I can remember dad telling me about going to stay in the Stanley Brothers to drive in theater on top of the little ... built in there and play and have I Would love to I wouldn't have anything to save it\nStanley Brothers are met flattened Scruggs but I I never got to hear the Stanley Brothers but Yeah John ... a little Jimmy Dickens all those folks right is that what you're talking about that that era\nYes absolutely I think I don't know whether it's particularly right or not but old country is pretty much bluegrass today in my opinion that new country is a different genre altogether\nI well yeah there's just the way I think about it so that's what I'm gonna try to carry the torch for a little while for traditional licorice music as long as I can 'cause I don't want that to happen to what's happened the country to Africa bluegrass\nNo I certainly don't either and speaking of great bluegrass let's get back to your CD in and let's listen to another track how about picking one for the audience\nAll right let's do one one of my favorites on the air to as written about a former bandmates with a with a wet Russia Santa Cruz and also the original ramblers choice Elmer burchett it's called a honey do list\n[laughter] that's a cute one okay so sit back at it [laughter]\nI think we all do\nHere is juniors says and a honey do list\nLine\n\nAnd then the minute change on me\nThe money I don't\nCamus put things in\nOur ... let me\nGet paid that much better in the\nLiver may be another way is also made a mile\nYou really learn\nMood again\nAnd then maybe the\nBond change on day\nThan it is the money there that\nThey were\nMen one\nMom Rhonda and lay\nOff ... settle the lander remote reach\nAnybody law then by Don\nThen the one you got room\nWas his name but\nReally learned in Iraq\nAnd made me want to change they\nNeeded the money the lab and how\nHe was born in Virginia and began performing at the age of sixteen he played bass in a local band but eventually he switched to guitar in Nineteen Ninety five he worked with why at rice in Santa Cruz along with his cousin Tim Massey\nFrom Nineteen Ninety eight through two thousand and one junior was lead singer with ramblers choice a band he farmed with Massey Elmer burchett Jimmy van cleave and Alan ... do\n... and Blue Ridge than two thousand seven he reformed the ramblers choice and made for recordings in two thousand twelve e won the ... word for the some of the year with a far cry from less true Earl and for the album of the year with the heart of a song\nIn two thousand and Thirteen he won the Abbey a Mayo word for meals vocalist of the year\nAnd then again in two thousand and sixteen he won the Abbey a male ward for the record the event of the year for long neck blues with Ronnie Bowman\nIn two thousand and Eighteen he disbanded reemerged choice and embarked on a solo career I Believe that's about enough talking let's get back to one more song from his new CD\nHere's a track that he mentioned in our interview the whiskey and the guitar [noise]\n\n[noise]\n[noise]\nMe\nWay for me and so the early\nThe main risk my body\nAnd the music we married\nThere on a stage in the whole world years waiting we can see the game for me\nTo name all they\nWhen you're not hanging with me\nWhen it comes to me is a game\nAnd they're\nTo be two years ago [noise]\nAny signs of being prepared me\nOn my kid in the last man on the lake\nDo you think well here we are you\nThere shouldn't be\nHave a name all ...\n\n\n\n\nThe\n\nAnd and\nMan that's the rate than\n\nWere\n\n\nWhoa been in the\n\nThen he will not do it when\n\n\nThey\nDo\n\n\n\n\nHi everybody that's his role in white and you're listening to Bob Michel thanks ... to ... be obey means that's still bluegrass so stay with Bob Bob ... music he wants new you will\n\n[noise]\n\n\nThe only\nReason that men around nine is by no radio thing in\nThe\nAnd then they'd be wrong then\nMom back into grandma\nI said\nDaddy would tune in that you know\nWe all\nWas a high\n\nMen da da da da da\n\nDa da da dum\nLa la\nLa la di yeah mom can bully thank God for that day and\nDo\nAll of the law and everybody\n\nShe's not coming home to know a\nNew law should and willing to\nLittle town\nYou ready to\nRoll band for two years you'll never\nDeal really want to\nUrging wager spend the money\nThan I have great Michelle where we're\nDry and\nI'm a I'm I'm Alone in Vancouver and\nLike a lab bench someone that you know\nI bring big can be just down\nIndustry are saying\nBad straying back then there's some way\n... moving\nLook for ... oh\nMy God I bet some bad\n\nI didn't know where they say they a\nThings that were banned\nGlass right AJ somewhere\nAnd dry and\nAt lower some long alone and better [noise]\nThank God and that still live in an old\nI ... a long way or\nAll right I mean I'm\nI'm I'm I'm Better and\nOf like a lab bench some old\nGot on my cell phone right now\nNew the new boom\nBoom boom\nBoom\nOver by X ray somewhere\nStrain on moving\n[noise] stony Greek bluegrass bandwidth fast train in that that you also heard from Valerie Smith liberty pike with a little bit of bluegrass swing dancing by the river\nAnd in the middle North Country with afraid to say goodbye as we continue along and after the home stretch here comes the men to cook and you were mine\nI Hope you'll tell a friend about the show and come back next week\nDeal then keep a stone in your heart and do something nice for some more [noise]\n\n[noise]\n\n\n[noise]\n[noise]\nDo you feel\nWelcome to Ninety point one W why UPS bam the rush Indiana so worth of the latest and greatest plastic something new every week only on Ninety point one [laughter]\n\nHand there are going\nKnow\nA\nThen they\nA new law\nThe the ...\nAll we all\nA little\nBusload ...\n\nBe\nBe\n\nIn a\n\nThe venue that way\nBut we didn't know the the the day they were buying like the\n\nLet's take a step\nBack a little ...\nAnd ... and did you go\nWe do this\nI'm only men\nThey got jak\nRain\n\nChances are you or someone you know as age related macular degeneration or AMD millions of people who are losing their site to do and I'm One of them getting the diagnosis was terrifying with knowledge is power even if it doesn't ruin your family you could still get the\nCall the ... blindness that one eight hundred six three two two zero zero five four three kids about preventing it managing the disease that's one eight hundred six three two two zero zero five\nIt was good maybe this is now the boy won W I you'd be FM's Raasch the gay guys so much for joining in another\nA really quick though that lasts zone that was said with the middle featuring the musical group gray\nExcellent song excellent son what else can I say more anyway folks again we have some weather for years let's break it down for your real quick here mostly cloudy skies right now fifty seven degrees Fahrenheit outside where they hire fifty four and a low thirty four today today is a proper fall day with showers\nVery likely Seventy percent throughout the rest of this afternoon leading into tonight and here's the curve ball folks there isn't forty percent chance of snow showers\nDepended who knows I have no idea of Christmas seems to want to come especially early this year\nAs it does every year but we'll wait and see any way of spin on Sunday or getting forty percent chance of snow showers leading into that day with a higher forty one and a low thirty three so I mean it's not out of the realm of possibility it is chilling enough for snow it's just not right [laughter]\nBut moving on a leading into Monday than it warms up a little bit higher fifty two low forty two mostly sunny skies and then on Tuesday I Do love thirty eight or with partly sunny skies and it stays that way pretty much all the way into Wednesday\nHigh a forty seven so you're on the lookout for some fairly consistent guys where the possibility of snow tonight\nI have no idea it will probably not as soon as it hits the ground anyway let's take our time let's wait for things to get spooky first and then we'll get really thankful and then we'll all do Black Friday shopping and hate each other and then we'll forgive each other for the holidays but that's beside the point anyway bumps\nOr let's get back to the music last up\nWe had in the middle featuring the band gray with that and next up folks we've got a song that goes a little bit harder maybe a little bit faster than just a little bit stronger hit a death bunk\n[noise]\n\n\nIt'd be\nYou and\n\nYou and your work\n\nIn the late ... thanks for\nThe\n\nBest of my\n\nLaw in power now or never reach\n\nOut there where again my older [noise]\n\nBy the lake it may\nBe\nBetter\n[laughter]\n\n[noise]\n\n\nTo be\n\nIn the past a shot\nIn a lifetime thing\nAgain\nGet them back in\n\nOne\n\nIn a way to make\n\nIn\n\n\nMakes\nHim over\nIn the sunshine going ... wearing\nHats but a lot of\nThe gap too close to ... in the world trying to find me a better way in\nWhich a novel or will be gay ban a lot of them where the blue sky brain that don't think there were in the world is a tad donor ph my chair\nDown around there the fire and the guy that would ban so happy to have a bell so high\nA big amount of bound me and my own ...\nDo the boat and sailed up and it don't think anybody doing them in any way to\nBone up\nWell let me take it\nBe well\nTennis beyond that I Can't get\nShow was good maybe this is Ninety point one W. I. U. P. F. them do Raasch hosted by your friendly neighborhood DJ grizzly boats were back again that was just remembering myself by the artist David\nJust the artist known as Steven\nKnows but anyway ... we have some announcing story but it's part of the hour we'll get things to it the Indiana free libraries and you will evening or the ... event will be held on friday October twenty six from six to eight thirty PM at the Indiana fire associations white township station\nAt one by by by the Indian springs road Indiana PA joint\nIn Indiana native local restaurants in eateries will provide a bevy of hors d'oeuvres plus copy from commonplace coffee beer from Lebanon brewing and wine two\nDesserts will be prepared by the award winning students from the ... the Academy of canary arts\nGrist for the ... will entertain with their special brand of back porch swing and there will also be basket raffle sell for more information on ticket prices or to make a reservation call seven sue for for six five eight eight for one again that spur ticket prices in reservation please call seven to for\nFor six five eight four one\nAlready folks the next up a little bit of a story for you I told you all that I went on my bachelor party last week just a little bit because I Know a couple of weeks ago I talked about\nThe movie venom coming out in theaters came out at the beginning of October and if you've been out of the loop in terms of movie news recently you know the critics did not like it let me just give you my short and sweet version right here right now\nI'm a huge vitamin fan I Love the character venom I enjoyed the heck out of that movie it was hilarious actually I consider the movie almost more of a comedy than a superhero film but I mean hey [noise] like what are you going to do as\nLong as it's a good movie at the end of the day I feel like I actually saw it twice by the way I saw it with my fiance and then my boys during my bachelor party it was worth every single minute and worth every single cent of my ticket price is a perfect now but it's hilarious it's a great time\nYou'll have a lot of fun and it's PG Thirteen so deep that in mind folks anyway let's move back to the music last up we had Steven with remembering myself and\nI understand man but the past few songs here we've gotten really down and really really just dark right well\nI think we don't need to look any further I think we need to look I don't know south east that the south eastern\nHemisphere of of the world and and ... and plus\nWas it was the straight guys you know who would it do to\nHere the drone who painted nine\nDown and na\nDog ... him\nAs ... as long\nDown and\nDown at na\nNa na\nNa na na na\nNa na Rick\nDown and I don't\n\n... in the way for me to be\nTo do the urge here's the\nNinety One W ... and then then India\nHe\nStruck by\nSounds pretty frightening but you know the chances are so small town\nTo get out get out there the Buddha man\nBy ... dream draft and then they're going\nName sounds pretty frightening but you know the chances are so small body dream grasping them their plane better chance he going to buy it\nVoted for twenty three a border wall and the ... by boat and nobody is going to get 'em down\nYou\n\n\nMm were you in\nEvery one of them and gave it up and giving them and and this sounds from a ... not the ... going to tell me what this down the\nThey may or will it was wrong with the way they could this have the money and then thrown back the broad you\nAny\n\n\nAnd we found her back and she was only ... but I gave 'em a time to three nights in their own boat until the moment is wrapped up in a way\nMonths trying to trust again she told me I Would never vote for friends maybe you could swing mama roam around in the baby brings them and then about a love Jim Beam between ... and they need if you wanted me then you should have just said she sang in\nA lot don't win\nHer Shane\nCouple of weeks or only want to see her we drink away the days with the take away pizza before with that committed with the only way to reach a strategy staying up late the not the way ... ... ... you know Aretha pulled over the ... ...\nAnd do show the never be more about maybe we'll go together a bunch of figure out a ... on a film with the with the on the couch we should get on a plane or will be ... than it was shot and we're in a way that things played out when she would get them out with them to use the Batman figure out what that is getting in\nTo do that when\nSharing\nAre most hotel though I don't even know if she knows what she was crying much old already ... sect is what we do this call friends I never intended to be next to last but you didn't need to take him to bed that over\nAnd the number is a threat and so you disappear into that 'cause it's not like we were both going to we were saying the same hotel\nA promise they'll commit made but it was that but just for fun and you would have prevented the way you realize what you wanted it to a bit too much too late\nTime ... know what I'm saying\nWere you born from Nineteen forty five to Nineteen sixty five\nPeople born during these years or five times more likely to have hepatitis C so even if you try to eat right to exercise and take care of yourself you could still have hepatitis C a serious disease that the leading cause of liver cancer\nIf you were born from Nineteen forty five sixty fired you should get a blood test for hepatitis C treatments can cure this disease doctor your doctor about getting tested a message from the CDC\nWas good I mean this was Ninety point one W. I. U. P. FM's rush hosted by your friendly neighborhood DJ grizzly ... you're just tuning in with Ed Sheeran with jumps and bring it back to the music just a moment here folks I just do have a short weather forecast for all of you and I missed it in the last hour\nSo not much is necessarily changed mostly cloudy skies fifty five degrees out Seventy percent chance of showers likely tonight highest fifty for low thirty four there is a slight chance no showers about forty percent Seventy percent leading into Sunday a high a forty one then and then a loaf thirty three so\nProbably very chilly to start out the day on Sunday possibly snow possibly I doubt it but\nPossibly a moving on Monday than uh the ... the clients will clear up mostly sunny skies highest fifty two low forty two partly sunny leading into Tuesday highest fifty two low thirty eight and then finally or it will conclude throughout the rest of the week with partly sunny skies starting on Wednesday with a high a forty seven so feeling\nLook out again for some fairly consistent skies after Sunday but apparently we've got a snow storm coming tonight I doubt it but\nApparently we got one smokes let's get back to the music for you\nSun comes from an ... the artist known as John genes and has been shaped ship there's the song is called American hearts and it\nIs so sweet so simple and still peace but we still think down here for yeah let's just ... minutes kick back\nRelax and enjoy\nWe buy all ...\nWe are still ... then we landed up strong ... alone\nStaff say in a\nTo go or no ...\nCan do a\nFather's knee\nWin the peace ... is made by a man with a black is my\nAnd above the damn last dying breed ... na\n... for the ... and under the\nTree on me but I Am\nYou know I was ... when ... ... ...\nAnd ... ...\nOr\n[noise]\n[noise]\n\n\nKnow ... to\n\nAnd\nAnd\n... a year\nAll you must try\nAnd\n\n\n\nDo a sharp\n\n\n\n\nSure\n...\nYellow only Iran Ninety point one W E s M rush hosted by your friendly neighborhood DJ rigidly\nFor the stacks event will be held this Friday October twenty six from six to eight thirty PM at the Indiana fire associations white township station at one five five five Indian springs road Indiana PA join us for an evening\nOf support and fun if you're a fun and funny evening and support for your local\nLibrary I Apologize for that let's try one more time join us for a funny thing and support your local library that's much better\nThe honorary chair person is Chris ... New York times best selling author in Indiana native local restaurants in eateries will provide a bevy of or d'oeuvres plus coffee from commonplace copy beer from Lebanon brewing and wind two\nDesserts will be prepared by the award winning students from the ... Academy of a bee pollen airy arts grist for the mill will entertain with their special brand of back porch swing and they will be basket raffles as well\nSo for more information on the ticket prices or to make a reservation you can call seven to for for six five eight four one again this is for ticket prices ants to make a reservation call Seventy four four six five eight four one [noise] and folks we are almost at the end of the show today we\nGot a lot of stuff to get through in this last part of the hour so I've I brought my buddy John Denver in with me into the station and he's going to take a ... year\nCountry roads it's going to take us home to the country roads in West Virginia are probably going to be mountain mama right certainly hope so I take it away John\n...\n\nOf ... bureau\nThey didn't or\nPlayers get\nA\nAnd yo la\nThey hold\nWhole law ...\nLeading a stranger to\n\nAnd the oh\nAnd driving down the\nA de\nLayer\nYeah\nOh\n\nOh what is your mom\nIt in such bad news now it's like no no nothing bad and the Tom appeal\nTo\nAnd we will but you know like we were the trend drinking for them and then\nI got to\nDone\nWell Easter [noise]\n[noise]\nYeah we\n\n...\nAnd it when I did\n\nDa da da da da\n\nDa\nDa\nDa da da dum or said\n[noise] [noise]\nYour two girls went on trial was Joe Miller Leighton on radio guy [noise]\nFrom but W. R. UP up in South studio my gym late night radio guy and I have two hours of a little bit of this is a little bit of that\nBut a whole lot of progressive rock and a whole lot of like a dollar for you this evening [noise] will a kick off the show today with a group called itself the who\nAnd this was their first big hit here in the state what's called I can see four miles\n[noise]\n\nI Know you just see how it\nI didn't know\nThat she had a says we let\n\n\n\n\nIs the\nWhen\n[noise]\n\nDo all the while\n[noise]\n\nI'm\n\nI'm telling you took advantage of much of the new one my\nDone and they can but\nBut you got to stand trial\nI can only do you go oh my goodness you know\n\nAnd and and I\nWas just too much and\nI Know you're busy and you know you were a\nThings that I\nThat you had the magic even\nNa\nNa na na na\nNa na na\nNa\nI deal payer day in and day\nThe job and I knew smile\n[noise]\n[noise]\n\n\n\n\nAnd um\n[noise]\nMm [noise]\nSure you go to the\n\nNine one one\nThat we\nSome\nSpring ...\nAnd ...\nAnd the\nStudy\nTo\nBe [noise] um\n... yeah\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\nTrek was titled the light from the darkness that was done by utilize that was taken from their voting they'll be\nThe when Christ Mary was performed by the Jimi Hendrix experience to lead off the show today we had the ... I can see for miles\nIf you'd like to get in contact with us for any reason send an email the late night radio guy ... ... email ... home I'll be right back with David Sinclair\nAlso at the faces and steely Dan street\nTo every single one of his medical bills and everything is just all taken care of\n'em up a nominal research are studying clinical care and the general public which allows to treat patients regardless of what\nAt age ... families never received a bill for treatment travel lousy those who did the the only thing that family should worry about\nTown at your school or where you work is suffering to Crohn's disease or ... ... you're dealing with excruciating pain engage when they can't even get out of debt chances are someone you know is critical layers someone like me\nI'm Amy Brennan and I'm asking you to support the ... to help millions of us come in to\nFind cures or did you see the essay dot or today to learn more helps him win you know get back to their lives and CCF they died or\nYou are tuned in to ... W or you'd be a bit in Indiana, Pennsylvania\n[noise]\n\n\nNa\nNa na\nLittle\nBringing\nMy name\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nOh my gosh that was taken from the ... age ... and of course was done by steely\nDan faces the a track was titled that's all you need Dan sad eyes was performed by David Sinclair with special guest Andrew Latimer on a guitar\nLet's take a break so that I can play some of the best programs you can find anywhere but they all happen to uh be broadcast from right here at W. I. U. P. S. M.\nToday singer songwriters speak their mind sometimes it's loving beach sometimes it's concern and frustration\nNo matter what it's always relevant it's ... it's electric it's modern troop adores Saturday morning nine to eleven right here on your alternative source W. I. UP\nVoting get these through the mid sixties you know the good stuff\nI'm Jim Bunning to join me for the oldies zone this Sunday at six PM\nAh two hours of some of the best music ever recorded her to conclusively right here on your own sauce W. I. B. M. Indiana\nWho\nYou are do did you buy dull drag on WBAI Yulia them\nA\nRock and roll I\n[laughter]\nTo make sure that I'm I'm\n[noise] what state when Mary thousand men and women in the year\nAnd then all\nOf it and find the [noise] the data bomb but they\nHim today and it's just been assigned [noise]\nBeen a sea wall tended to dial the [noise] the I guess you can man the threats\nSay these are good\nThink in\nNow\nSaying\nFrom ... to\nDo things to\nDo well when they want to be the\nThing to\nDo the grid and oh\nMan [noise]\nAnd that was caused\nMay be able to get the right to remain calm and try\nDi di di\nDown\n\nLeno [noise]\nNow\nOne\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nBoom boom boom\nCare\n\nWant to collect your number\nBig push ups in the\nThen back but\n\n\nNo my mom's house [noise] you know and they and they do what they read the\nBook or turn around her and her for her\n[laughter] or not\nWe\nDont we he and the and the oh\nYou did a\nLike any good [noise]\nUm [noise]\n[noise]\nAnd [noise] um\n[noise] our our our family and a and a and a very interesting show\nNo [noise] no I mean they they they want you to [noise] [noise]\n\nUm [noise] the [noise] the thing\nThat may be that\nBad [noise]\nUm [noise] in\nThere for a murder or um [noise]\nI'm\nA hunger or a ... [noise]\nTucson on\n\n\nYou\nIn\n... the uh was trying to three weeks ago\n... ah the ah to to\nAre really hard to\nOn the front\nSearch the ...\nTo\nShow up in the bay and Rick\nI'm One\nYou were a child in to W. I. U. P. F. than Indiana [noise]\n[noise]\n\n[noise]\n\n\nDon't you\nGo about your\nWe don't\n[noise]\nWhen you have big giant\n\nNow with\nReally\nEasy\nHe sees\nA\n\nAnd age\nAm\nA need\nMm\nMm\n...\nUh no time to water\n...\nRisk if they come and gone\nRogue and Carlos ... daughter\n... laying around\nHe graveyard that all along job\nIn a bar they always bring deer in the evening and but yeah the way they Rob Maine in the middle of the job to do their\nMemory the jam ball\nWe\nCan't be why ... ...\nWell let me\nGive those\n\nAnd then\n\nThe\nBroken heart the dirty windows\nAnd may live there because the ...\nThat's why last night and ...\nAll in the same in Maine\nAnd he ... no love letters\n\nBar they are aware spring day here\nBut yeah the way they Rob me\nAnd\nI'm ... and they\n\nNever read the jam ball\nCan be one car free\nMm well let me hear you\nGet those who they are and don't know how to slip away from me\nIt was a group known as area on the track was titled amazing light\nWe also heard souvenirs that was a John Prine and life and death\nWas performed by wicked lady no the last set we're going to mix it up quite a bit of hope you enjoy this will have a little bit of a whole the old psychedelic rock a little bit of progressive rock a little bit of jazz in a little bit of a country oh and one set state to\n[noise]\nW. R. U. P. F. M. continues its tradition of unique programming with the musical box every Saturday from ten pm until midnight tune in as David resents any collected mix of down tempo depots electronic a trip off and ...\nThat's the musical bought Saturday ten pm [noise]\n\nBreak music from the ... the president [noise]\nGreat music you know great music you don't know yet more more since Sunday simpler for travelling [noise] when I think you can prove to a great deal of the old they knew nothing really are and the forgotten what the Sunday sample it's all laid out for eight o'clock pm Sunday\nIran W. R. U. P. F. M. if the Sunday sampling with mark Morris or\n[noise] or a shot [noise] vital try some ... year old on line [noise]\n\nThey are\nThe fan dog\nWherever you need me way oh\nThen you have do you get it don't\nKnee and on the whole\nWorld is made by a man or a headline\nI'm not a law\nThe\n[noise] [noise] and I know\nBy\nJeez you know\nThan a than a\nIn Maine so\nAnd then me and ... and she don't\n\n\n\nCheese\nWe all love this but we will look let's just say the ... the doctors so they were like the ... which I really do let's bring the\n\nMoney issue to begin with\nThe\n\n\n[noise]\n\n\n\nThe beginning you're\n... the guy\n\n\n[noise] [noise] [noise]\n[noise]\nTo be the end and da di ... back to the um well above the Georgia by being a good\nDo they um well what I learned in\nNa na\nBy the ... the\nBelieve in a\nWhile and I am on the the\nI got a\nRight now we\nGet along with the wrong guy around the kids in a small talk\nThere every day on the\nDidn't do anything\n[noise] damn [noise]\nI mean I Know that I dont were paying on me I have not been that I've done everything on me no ... no", "year": "2018", "show_name": "no_show", "city": "Indiana", "day": "20"}