{"month": "10", "state": "NY", "station": "WRUR", "content": "And I just wanted to make sure he always had a piece of that even if I wasn't around ... does he know no I haven't told him [laughter]\nTalking about this sort of thing isn't easy not even for the person who wrote the song when\nI get depressed I tend to turn inward and kind of shut off from the outside world much my own detriment\nLiquidity to mark ... Adam song when he was at a professional high but a personal low\nYou know it feels ridiculous thing or parents do really good but personally I'm just not feel like I'm conducting and I don't know it's it's just it felt like a I had too much good fortune to complain about anything\nSo even though ... couldn't talk about his feelings to his bandmates or manager or friends he had his fans I feel like they are helping me\nShare the difficult time that I went through so I'm Talking about my personal darkest times and they're talking about their personal darkest times that we're we're coming together about this song the kind of help those both get through that [noise]\n\n\nAdam song became an anthem of sorts for for any Berlin she's a wellness blogger who lives in Brooklyn who's ... suicide herself she suffered depression attempted to take her own life and then had to deal with the suicide of a friend to happen to be named Adam and the song helped\nIt connected me with Adam and it also just like helped me feel everything it can feel so many different emotions all at once and then you feel bad for the motions to some of them are really really just ugly harsher um\nBut that song to kind of felt like it was for Adam [laughter] I mean it was ten\nEveryone relates to the song and their own ways has Liz Friedlander she directed the music video for Adam song which was a hit on MTV her vision for the video wasn't to just focus on the musicians but the people around them and what they might be going through the couple of having a fight backstage the person on the pay phone by the gas station\nWe never know what's going on in other people's lives in people who have relationships with we don't always know what's going on but also in the people who you sit next to you at a concert or pass on the street or these humans that you brush up again\nWe all are dealing with our own staff and sometimes we don't look and we don't see and so then we don't notice\nThe song got a different kind of attention in the year two thousand when national news media covered the death of Columbine High school student Greg ...\nA year after the mass shooting at his school he took his own life the stories at the time reporter that Adam song was playing on repeat when his parents found him but pending suicide to one event or one cause oversimplified a very complex issue and Adam song certainly isn't just wanting to its fans\nWhen I posted on that blink when eighty two message board I got stories about bullying breakups\nAll sorts of issues but what nearly everyone mentioned was the turn the song takes after the bridge the bridge and the last course is the reduction of the song blink when eighty to mark hottest stop singing about dining alone and how great being sixteen was and start singing about being alive tomorrow\nTime was linked when he did you didn't play Adam ... concert a friend of theirs Adam ... better known as DJ am had died from an overdose ... says he couldn't bring himself to sing it now though after nearly a decade the band is playing it again I think of it\nMore now is almost a celebration of hardships gone through and and friends lost and it's a celebration that means a lot to a lot of people sure it's not an end them in the usual sense of the word it's more of a reminder remember that too that Kennedy was going to get at the beginning of the story he never actually\nGot it that shoppers too busy to walk and now he's working with the artist and they can even better one song says tomorrow Saturday Angela among engineering [noise]\nAnd if you or someone you know may be considering suicide help is available online at suicide prevention lifeline dot ORG [noise]\nFor American Anthem comes from visiting angel [noise] professional caregivers assisting adults at home and bathing dressing meals and light housework nationwide visiting angel America's choices senior homes can learn more one eight hundred three by\nNine [noise]\n\nYou're listening to all things considered from NPR News\nSupport for NPR comes from this station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilient cities at Iraq founded dot org [noise]\nFrom the main office of tourism offering travel there was an opportunity to explore and discover their very own main thing to be inspired be original and be yourself and visit main dot com\nAnd from T. I. A. T. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirements learn more at T. I. A. dot org\nThis was only ... am Rochester W ... Rochester ... F. M. H. D. to Rochester W are you are as a broadcast partnership with the University of Rochester and all the ...\nPublic broadcasting is going to be rock rewind ... things considered\nComing up on an searching Seventy and if and when I was seven but we're looking at ... guys tonight and falling temperatures around fifty by the lake mid forties and the city in some areas south through the through I could get them into the thirties overnight a mix of some and clubs for friday much cooler where the north westerly breeze\nEyes right around sixty even cooler lakeside punish guys and it's sixty three degrees Rochester\nSupport for your public radio station comes from our members and from turning stone resort in casino offering getaways including lodging entertainment and golf detailed and event information available online at turning stone dot com [noise]\nIn the labor market at the moment there are more jobs than people who can still the\nEmployers are really looking for the talent they need wherever they're from so visas immigration is obviously required in that situation in many cases\nI'm caught result strong economy in what limits on legal immigration might mean that's next a marketplace [noise]\nJoined us tonight at six thirty for the next marketplace year and double helix accent [noise]\nAnd it's all things considered from WXXI giant NPR News or the senator received the FBI's new background check Brett Kavanaugh and Democrats or prank phone\nIt looks to be a product of an incomplete investigation\nMeanwhile Republicans are calling it thorough and you have the latest from Capitol Hill coming up as all things considered continues\nLive from NPR News in Washington I'm ...\nThe top Republican on the Senate Judiciary committee says the FBI has turned up nothing to cooperate allegations that Supreme Court nominee Brett Kavanaugh committed sexual assaults decades ago NPR's Brian Naylor shows the FBI report is being held behind closed doors being viewed individually by senators\nRepublican Senator Chuck Grassley says in his words there is nothing in it that we didn't already know that neither the Judiciary Committee nor the FBI could locate any third parties who can attest to any of the allegations\nCapital has been accused of sexual misconduct by several women including Christine Blasey Ford testify under oath last week that Kavanaugh assaulted her well both were in high school the FBI was ordered to investigate that accusation and others\nThe bureau interviewed nine individuals the White House source tells NPR the Senate could begin voting on the cabinet nomination as soon as friday Brian Naylor NPR News Washington Democrats on the other side of the cabinet\nConfirmation issue are taking the opposite tack Democrat Cory Booker a member of the Senate Judiciary committee says contrary to the Germans assessment he thinks the FBI's report is plenty of gaps\nVery frustrating because we do a thorough investigation will be more relevant wouldn't reveal your more Central High ... interview folder cooperating witnesses I'm I'm actually shot\nAnd even as the FBI wrapped up its background check much of what it did remain shrouded in mystery including decisions about who was interviewed among those apparently not interviewed in the latest probe judge Kavanaugh ... for the woman who accused the nominee of sexually assaulting her while the two were in high school\nDrop administration today on build a new strategic plan for combating terrorism NPR's Scott Horsley reports is the first major rewrite of the planet seven years the plan calls for ...\nBeefed up border security a culture of preparedness and international cooperation to fight with the White House says is an increasingly complex and diffused terrorist threat national security adviser John Bolton who oversaw the planning process says one big change from the previous blueprint as the focus on what he calls a radical Islam is ideology\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\nA ...\nA year or a lawyer\nAll alone or\n[noise] [noise] [noise] [noise]\n... to\n...\n... ...\nAnd you know\n\nThe on the\nAnd\nIn the [noise]\n[noise] the [noise] in the navy and brutal\n[noise] [noise] [noise] [noise]\n[noise]\nDo you do [noise]\nAnd um [noise]\n\n[noise]\n\n[noise] [noise]\n\n\nHow do you do the little the boy\nOr\n\n\nA wrong direction and where are all\nThat\nAnd [laughter]\n\nHe\nHe didn't\n\n[noise]\n[noise]\n[noise]\n\nOn the night in there and [noise]\nAnd\nTo\n\nBe back here\nA half\nThree years later on in there that [laughter] do you go to a game and just so why are you going to be the\nOnly way to\nWander they're jumping I care about your job to do because\nYou were to leave feedback they bombed the ways that\nYou need [laughter] Mm Bush Bush\n\nAnd and and I think it would be and then the teacher\nWas doing anything and and you can eat and they tend to be in\n[laughter] [noise]\n\n\n[noise]\n[noise]\n[laughter] [noise]\n[noise]\n\nSupport for different radio comes from a member and from point a blonde's been your don't you go lake resenting Daniel ponder and the moral people as part of its new concert at one of the blog series\nWas correct one beer insider Saturday October sick from noon to buy more at one of the ... been your dot com\nAnd that was Emerson lake Palmer with our guests here at ... dot W. R. U. R. N. W. I. T. H. uh definitely makes for\nSome interesting listening I'm like some of the as Jim pointed out as we were getting ready to talk here but like some of the the longer prog rock pieces we wait on that show that would really keeps you on your feet\nYou're switching and it really keeps your mind going\nYeah no it's not like you know I like close to the edge or something where next thing you know twenty minutes have passed over\nYeah just when you notice every second of it yes indeed\nWell getting back to the music here on rock re why we've got something a little different\nOf course because that's where we do here we swing the pendulum will swing the pendulum and we break the clock here in Studio pinball yeah something along those lines [laughter] so what do exactly that with journey ... back\n[noise]\n[laughter]\nI Love\nYou have to admit that already in\n\n[laughter]\n[laughter] [laughter] [laughter] I don't know\nKnow [laughter]\nMind that we're in a\nHouse to house [laughter]\n[laughter] um\n\n[noise] [noise]\n\n[noise]\n\n\nGet to\nI found\nBig thing\nTo do that either\n[noise]\nNo I don't\nI'm not\nNa na na na\n\nWe\nKnew the\n...\nRight\nNow in the\nNight at the\nRight in\nNot at all you know and [noise]\nAge and I\nIn the back but\n\nTrying\n\nIt down\n\n\n\n\n[noise]\n[noise]\n\n[noise] um [noise]\n\n\n[noise]\n\n\n\n... ... ... ... [noise] [noise] [noise] [noise] [noise] well [noise]\n... ...\n... ... ... ... ... ...\n... ... in the market with a quarter of cargo was easier to argue that you get to see a\n... or ... the water the quarter ... ...\n... ... ... ... ... ... the\nOn our water ... by the next\nHi the only thing that there's\n[noise] the only and the poor and he's a quarter of a\n... gallery\n... and ... and the fact that you're in\nA lot of them in the cage but he's re run it gets to your name's Bonnie\n\nBloody open water bottle of water\nTo\nBan it\n\nOr\n... ... ... ... ...\n... ... ... ...\nAnd ... ... ... and ... and ... ... ... ... and ... ... ...\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n...\n\n\nPages\n\nCan be in the mail in the\nGot me a little ... years\n[noise] um\n[noise]\n\nWas\nLead them to crack\nDown\nOn me\n\nI'm I'm from um [noise]\n[noise] [laughter]\n[noise]\n\nMm [noise]\nThe um minimum wage is is a little things that he's in a number of mental age when he ran a he\nWhen we're in the long\nName de dum dum da da da\nDa da na na na na\nNa [noise] [noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n\n\nYou're listening to eighty eight point five W are you are a ... D Rochester in Ninety One W. I. T. H. ... do you want it to different radio and this is rock rewind a bad job and that was passed by the car\nWith all fired up in the sense that boy that's one of the pit and told me about three different directions yep like I said studio but\nYeah he said that ... you send it out the one side of the ... you said that okay you sort of one side the clock yeah you said the pendulum across the walking outside you didn't send it out the front of the ... that's about what we did\nOh yeah because yeah we're trying to do\nIn the middle there for us we had David literally with a quarter of a man and we started the set with yeah whoa and fire on high exactly\nAbout how many different directions I I think that's about as many different directions as you can send us an exact number one in one block somebody why have pretty much you have to expensive and you know what we're going to do we're going to ...\nWell we'll keep ... pretty close to where we had maybe swing it a little bit ... not really what the next dog from Tom Petty you're based in the correct\n\n\n\n\nIn\nA\nAnd he rode on and on and on and a\nOn no none of those\n\nWas da\nDa\nNa na\n\n\n\n\nDa da da da da and you're ... you might be what we are\nIt was very positive and encourage that there has been encouraging spotlight for the evening around me or you aren't W. I. D. H. rock\nRewind the course that was a live with their the white that never goes out exactly\nIt's very possible grudging yeah we do\nYeah yeah yeah if you have a sense of humor you got to the middle there we had some try we had a world of fantasy and we started off that that was Tom Petty ... bay in crown\nWell coming up next year Iraq re why we've got a ah we were introduced to while back that the one of those when they're when they're little hidden gem\nSo let's get right to it here I mean ... that's ...\n\n... ... ...\n\nEnd up in the mid ... no ...\nOn the you\nKnow in the mail [noise]\n\n\nYeah and I'm\nRenee let me tell you about you\n\nAnd you\nAnd\n[noise] um\n[noise]\n... ... ... well\nAnd and\nAnd and and and and\nAnd\n[noise]\n\nA lot\n\n\n[noise]\n\nAnd there goes [laughter]\nThe police with mother here on rock relied on W. R. U. R. W. I. T. H. twisted favorite of ours yes indeed knew what some people some people would I some people potentially including ... including us\nOkay I haven't done it yet but I might well do it um I Would love to use that as a ring tone\nI Know somebody who does actually\nSomebody used to work with [laughter] well that she has it as a ring tone are so [laughter]\nShe was taking it for me one day and it was hysterical\nShe was really doing a good job of it [laughter] I'm Serious\nOh gee I I'm just kind of visualizing this right now [laughter] you know she was into it\nOf course in the middle there we had yes with changes nine to one to five and we started that set with iron maiden and passion Dale there you go\nWell coming up here in just a second here on rock rewind we've got some ... that one for you well because what would a classic rock show be without ... that one you got it so stay tuned for that coming up in just a second\nSupport for different radio comes from our members\nUpper ... college art center presenting velvet caravan with Jessica and bats playing tunes from around the world blending gypsy jazz an low country swing October Thirteen in the new Glazer music performance center art center dot ... dot edu\nNa\n\n\n[noise]\n[noise]\nAnd it bothers me out side you\nAround a\nA ... by ... by\nLet's all\nYou begin to me I have a dream that\nDay about the ban ban di di di\nDi di di di di da da da da da da da\nDa\nDa da da\nKnow in the", "show_name": "Rock Rewind", "year": "2018", "city": "Rochester", "day": "04"}