{"month": "10", "state": "AZ", "station": "KJZK", "content": "And\nYou're listening to the Arizona community radio network in eighty nine point five FM K Jay Z a Drake Ninety point one F. M. K. J. C. P. Prescott and Ninety point seven F. M. K. J. C. K. Kingman\nJust amazed that over a hundred thousand children go to bed every night\nThey're afraid to go to school\nAnd they're afraid to go to school because they're being bullied too many of these children are so afraid that they considered suicide in too many ... consider\nBut fortunately bowling occurs at all levels of\nAll like [noise] this was born\nWay to stop killing us to talk to your kids\nThe importance of creating other kids\nHow to stand up and be heard and the experience or witness bowling\nAnti bullying mafia and if our awareness can save the life of one child\nUs out and the kindness revolution dot net\nSupport for the Arizona community radio network is provided by came in regional medical center\nFall means cooler temperatures football and the flu this flu season get vaccinated help protect yourself and the most vulnerable members of our community asked you Karen see provider if the flu vaccine is right for U. K. R. M. C. support for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of Williams on interstate forty welcome any deer feeding him right out of your hand the hundreds of animals that cause elk buffalo pearls camels collecting Mindy kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\nBy the public radio programs you enjoy that and for middle aged editor Tate logo due June in radio dot com that George ... at the Arizona humidity radio network that listen any time on your smartphone\nPresident Trump has described it sounds to the manager of the Saturday journalist you show G. as the worst cover up in history but did you come to reporters there must be some kind of retribution against Saudi Arabia for the killing but didn't specify port more from our security ... storm didn't thank God that\nPresident Trump's position is roller hauled to divine to to to work at exactly where it is because he's been hot and cold between saying that will be serious consequences if Saudi Arabia at the state is behind this but at the same time saying well we shouldn't really comes along the ... billion dollar on steel and\nThe U.S jobs at risk kids plus Saudi Arabia is a big important strategic ally ... which is true about European nations specific to Britain France and Germany as saying sorry this just isn't good enough to study explanation does not hold water kind of do likewise is saying this and that we don't want to let this west\n[noise] the b._b._c. is new evidence that China is building a network of detention camps in its western region of shame Jang it's almost cleans as many as a million ... are being held indefinitely without trial the Chinese government denies the allegations he jumps up with China\nCools the vocational training centers but they don't look much like\nWe visited was surrounded by tools steel rules with guards on the gates on satellite images watched towers can be seen\nThe detailed analysis of the publicly available but you've seen by the BBC shows that ... for the secure facilities identified across ... in the past decade moving Hoff is being built in the past two years\nPresident Trump's national security adviser John Bolton is on Russia not to interfere with us elections\nSpeaking in Moscow after talks as President Clinton he said ... interference by Russian hackers was objectionable suicide new building on the result is to boot tune as in most schools just before the November us midterm elections\n... obviously thought uttering potential foreign interference in our elections across the board very closely so\nWe have two weeks ago until the election uh\nThere is any meddling at all\nThat the president signed an executive order\nFrom the director of national intelligence within forty five days after the election on\nThe super bowl from doing for the two presidents we'll meet a few days off to the vote\nThe tumors the British Government will urge ferry and free companies to Plano turns you root for medicines and vital supplies into the key to the new deal Brexit block or slow traffic from from the proposals are part of the government's contingency planning in peace negotiations we see you feel\nWell news from the BBC\n... double duty news in Yuma I moved from Arizona attorney general mark Burnett which has withdrawn his filing with the Arizona Supreme Court that push to declare ... extracts of marijuana illegal for medical marijuana users Bernard which told the justices to ignore his legal brief case double UCs Jasmine arenas reports\nThe filing comes in the case of Rodney Jones a medical marijuana user convicted of a felony or possession of a point zero five ounces of has sheesh\nBurn adventures now concern with the way his agency's filing was worded he says the last thing he wants to do is denying medicine she those patients and may ingested their marijuana extract or to ensure form spokesmen for burn of Andrew Ryan ... noted there are children who under interpretations of the law\nAre now getting the drug in liquid form to treat their seizures he spoke to Capitol media services\nRegardless individual onions on marijuana Arizona voter recognize there is this little valleys to medical marijuana I think our office recognizes that you can adjust their medical marijuana and a number of course\nThe Supreme Court will now decide whether Jones' conviction will stand ... adjust Arizona lawmakers could also clarify the law and the next legislative session for Kaine WC News I'm Jasmine I did not\nBig orange sheep are thriving in the Santa Catalina mountains near Tucson state wildlife officials say I ... in the area have reported the sheep something officials hoped would happen\nWhen they reintroduce the animals recently surveyed taken this month estimates sixty six bighorn sheep living on the range according to the Arizona Daily Star cheaper relocated from other parts of Arizona between two thousand Thirteen and two thousand sixteen\nThat's all the good news for key WC news in Yuma I'm Luca\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nName on a long time\n\n[laughter]\n\n[laughter] [noise]\nAnd [noise]\nMan\nCome a long long time [noise]\n[noise]\n\nForgot and then there was\nAnd then God\nRight on\n\nHa\nHa [laughter]\nOr you know the [laughter]\n\nSame here and here he can say that [laughter]\n\n[noise]\n[noise] [noise]\n[laughter] ...\n...\nNa\nNa na\nNa\nHey [noise]\n\nHa ha ha\n\n\nHa ha\nHa ha [noise]\nCannibal cop to run around the na\nNa\nNa na na na na na na na na\nNa na na\nNa na na na na\nNa na\n\nThe crossing borders am Thirteen twenty ... pei and men would agree that was a little piece of the soil sounds a bet Smith with her song shocked when chain\nWe say there are sent off just a few minutes ago with the song ... but at the pump project you must girls and this is off the newest album in a poem unlimited released earlier this year\nAnd just after that you heard three am Lola by a brand new song by the alternative rock band hotel near ah don't go anywhere will be picking a quick one minute break and come right back to the music starting off with the group new choir\nBorder radio which supported by the historic Goran auto hotel located close to the Colorado River and historic cultural sites in ... Arizona\nOnly minutes from California and Mexico the historic or an auto continues to serve travelers since opening in Nineteen thirty eight information online ... corn auto motor hotel dot com\nThanks for listening to border radio Thirteen twenty am and you and border radio easy don't work we have been a service of Arizona western college for more than forty five years\nNear normal temperatures expected this week where they warming trend forecast for the weekend but there is the weather disturbances bringing a chance for some showers two parts of Arizona\nAnd sixty percent chance for some showers in Flagstaff any forty percent chance for some showers in Prescott high temperatures today will reach from Ninety degrees in you up to Seventy degrees in Kingman Prescott I should be sixty seven degrees today and in Flagstaff expect to hide this afternoon of fifty a degree\n[noise]\n\n\nKnow at the\nThe gay na\nNa na na na\nNa na [laughter]\nNa\n\nThat is in my\n\nOkay [laughter]\nNa\nNa na na na\nNa na na na na na\nNa na na na na na\nNa na [laughter]\n\n[noise]\nNo new\n\nAnd our near a fine man oh they don't talk though is that it but we let it go on\nTrash killer here go count that as you go oh\nGod I don't know but what do you say oh I'm\nGoing to go around me back in the world where we can see that because it's all being concrete I Want you to go out with a man\nDo they call you\nCold is calling me calling go\nThink I Would\nEarly\nOr don't bother they go about where I go on\nTrash bag and I can't ... the key to our\nBeers in the western coast either department will be presenting ... probably falls on the other mystery mixed with social commentary\nThere'll be putting up since Friday and Saturday at seven thirty and somebody at two thirty PM at the end we see the there on the human capping it'd be like more information you can reach us at nights a week three or four Seventy six nine zero\n...\n\nAll the birds singing\nA policy\nDown\nMe myself I'm a man\nI Will lay there\nTo the radio and I think they know\nSing lead Sweden sleep see men\nBees\nWas song and Romania no\nMom I'm I'm a man\n\nA little uh about a\nDo so they need to you know\n[noise]\nOn to play the ... to ... pounds on the\nBank to the green [noise]\n\nA while to\n...\nNa\nNa\nMan who hum\nKey\n\nThe news is changing for a long time to be\nCreated I'm\nSure\n\nGave\nMay\nYou're listening to the Arizona community radio network an eighty nine points\nYou see a trick Ninety point one F. M. K. J. C. P. Prescott and Ninety point seven FM cages e K Kingman [noise]\nYou know I enjoy social media\nLike Facebook and Twitter and I find myself keeping up with friends and family in the news\nI'm like most when it comes to the attitude is today so I mean\nThere's just too much anger too much rudeness and way too much hiding behind anonymity\nThere also a lot of careers and future relationships being affected by fault was this pen reckless posting the pictures and comments that might be better left unsaid or even not shared at all\nSo maybe we should think a little before we follow our instinct that pose a like Las Vegas what goes on the Internet stays on the Internet [noise]\nSo here's a call for a little social media thoughtful is make an effort to think before we share online\nWe might be glad later that we have a little far today far more check\nUs out at the kindness revolution dot net\nSupport for the Arizona humidity radio network is provided by cable one providing local and long distance phone service for your home with standard phone receive caller i._d. blocking goal forwarded again more\nKeep your ... phone number talk as long as you like anytime anywhere in the continental United States for details go on line to cable one dot net cable one and yellow by county support for the Arizona community radio network is provided\nBy forty walk among the deer feeding him right out of your hand the hundreds of animals that club elk buffalo pearls camels collecting Mindy kangaroo llamas Rainier and more the Grand Canyon their farm near Williams\nFind a public radio programs you enjoy that inform enlightened editor to log on to June in radio dot com and church for ... and the Arizona humidity radio network that lives in any time on your smartphone\nThe b._b._c. is new evidence that China is building a network of detention comes in its western region of shame Jang they told us claims as many as ... million Muslim leaders are being held indefinitely without trial the Chinese government denies the allegations more details from John southwest\nChina colds the vocational training centers but they don't look much like schools we visited was surrounded by tools steel walls with guards on the gate on satellite images watched how it can be said\nThat detailed analysis of the publicly available and then she'd seen by the BBC shows that ... for the secure facilities identify to cross ... in the past decade more than ... Fifteen built in the past two years\nExperts tell us that one of the news sites that we will stop from visiting with sixteen watched towers could hold eleven thousand people\nPresident Trump has described event south to the manager of the Saudi journalist Jamal ... G as the worst cover up in history speaking it ties Mr Trump to reporters there must be some kind of retribution against Saudi Arabia for the killing\n... Saudi Arabian investment was important to the U.S us secretary of state Mike Pompeo and then some of the measures that would be taken\nWe've identified at least some of the individuals responsible including those in the intelligence services the royal court the foreign ministry and other Saudi ministries who we suspect to have been involved in Mr ... show you that\nWe're taking appropriate actions which include revoking basis entering visa lookouts and other measures\n[noise] President Trump's national security adviser John Bolton has warned Russia not to interfere with us elections speaking in Moscow after talks as President Clinton he said cost interference by Russian hackers was objectionable though it had no bearing on the result\nIs they're both in his in Moscow just before the U.S in mid term elections in November [noise]\nIs it matters the British Government urge ferry and treat companies to plant alternative route for medicines and vital supplies into the gay shoot a new deal Brexit block or slow traffic from France\nTo propose who's present it to ministers on Tuesday no prior to the government's contingency planning in case the ... you feel this report from Alex for size\nThe cabinet was briefed on plans to ensure that vice school supplies including food medicine continue to reach the u._k.\nInsult ministers were told capacity on the to the county which could be seriously limited if checks introduce them a French fight style the cool thing by logs senior ... said that the government wasn't planning to charge extra ships that would encourage the use of alternative ports such as those in Belgium\n[noise] exercise world news from the BBC [noise]\nThe international news tonight to relax\nLabs and\n[noise]\nStreet was\n\nThanks for joining us on crossing borders am Thirteen twenty ... pay my name is mark ... who's our you research can't run buck a brand new song by the plain folk rock singer and guitarist Paul Simon\nWe'll stick around with this because we have a great line up for you on the seat that thinning featuring artists such as Wilder Calexico problem ... and many more but first up next we have a great song for you by the break and repair met a\nNa na\n\nNa na\nBy the\nAnd\nAnd I'm a I'm On a\nA law\nWell\n\nGlad to our\nNa\nNa\nNa\nNa na na na\nNa\nNa na na\nNa na na\nNa\n\nNa na na\nNa\nNa na na na\nNa\nNa\nNa na na na\nNa\nThis is crossing borders am Thirteen twenty ... you just are charity by the Australian indie rock singer and musician Courtney Barnett dissolve her newest album tell me how you really feel released earlier this year\nWe started our set off just a little while ago with the song won't get worse but the rock band the brick and repair method which is a science project of matchbox ... drummer Paul do set\nAfter that you heard California a brand new single by the folk rock band Wilder\nAnd just following that you've heard of beans who said that it finally happened by the Argentinean rock singer and guitarist Gustavo said I'd be don't go anywhere will be picking a quick one minute break and come right back to the music starting off with the finger coral wall anger and ruled already\nToday is border radio days sponsor is Jim Anderson celebrating the day that Alice Paris became the first Chinese baby ... born in beaver dam Wisconsin Alex celebrates her birthday in Warsaw, Poland today by training dozens of polish charities to better serve their communities around the world and here at home Alice brings kindness enjoy to each day happy birthday Alice\nThanks for listening to border radio Thirteen twenty or Yemen Yemen and border radio easy dot org we have been a service of Arizona was in college for more than forty five years\nWeather disturbances going to bring a chance for some showers two parts of Arizona today a sixty percent chance of showers in Flagstaff this afternoon any forty percent chance for showers in Prescott\nOtherwise you're expecting temperatures ranging from fifty eight and Flagstaff today to sixty seven in Prescott Kingman we mostly sunny with a high near Seventy eight and you will be sunny with a high near Ninety degrees today has a chance to experience a warming trend is we get into the weekend\n[noise]\n[noise]\n\nThe do\n...\nAnd again and Atlanta\nNa\nAfter that you heard voices in the field but the Latin rock band based in Tucson, Arizona Calexico this is off their album the thread that keeps us together we earlier this year\nAnd following that your heart I wrote walking by the indie rock singer and musician Caroline Rose we hope you stick around with this will be taking a quick one minute break and come right back to the music starting off with the rock band low cut Connie\nBorder radio is supported by visit him a present in Rio de surveys are Bruce fast October twenty seven from five to nine\nAt desert sun stadium a limited number of VIP tickets are available but include early entry to the id area a souvenir mug an opportunity to meet him these big D and Baba and more more information and tickets available at Rio de sir base a dot com\nThank you for listening to border radio at Thirteen twenty am and ... we also broadcast on the Arizona community radio network in Prescott Kingman Flagstaff and Williams\nBrochure first produced by the Arizona how we department in Nineteen twenty five Arizona highways evolved into one of the most respected and repair publications in the world\nDoing K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty\nWell cultural brand formation does it K. A. W. C. dot or there's been made possible in part by a grant from Arizona humanities\nNa na na na na na na\n\nNa\n... you know\n...\n\n... ... ... you know I Know\nMe you know\n... ... ...\nBe done that goes on\nSaid any you know\nThey still don't mean that ...\n\n...\n...\nTo me too movement again and\nNa ...\nBe so many new\nYou tell them any ...\nLet's go na\nNa\nNa cheese ...\n\nThan my reigning power\nThis guy fire", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Kingman", "day": "23"}