{"month": "10", "state": "AZ", "station": "KJZK", "content": "Ninety point wanted him in Ninety One point three of them get on the\nCommunity radio network on eighty nine point five K. J. TA drink ... belly Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven K. J. C. K. Kingman Boulder City Nevada and our translator came to one seven ... like ... park in Ninety One point three that Sam\nWelcome to the CD spotlight on jazz variations and this is where you get to cure brand new museum today all opening up the new release from two to ... this is called jazz bonded to it's on ... avenue records to shovel this composer and pianist and band leader loses his\nFirst album from ... records and he's revisiting the small group concept\nOf his Nineteen Seventy two Cuban album jazz botch new music from to chill ball does on jazz variations\nThe sun I Want the money and it gives you want your money\n[laughter]\n\n\n\n\n\n\n\nJazz variations [noise] [noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nThe streets you\nBelieve me I have the\n\nBaby\nAnd I\nYour mind about\n\nNa\nNa na na na\n\nMe\nHave\n\n\nNeed to be able\nTo do do do do do\nIn the journal from ... to begin with a\n\n\nJazz variations that his guitarist John ... times and his version of sugar to the Stanley tearing team tend to Dr John before that with the baby in a good to you and had a great horn section back in the ... written our starting things out by request and some called Pearl from his release\nA twist of rent it's tonia can you are tuned into jazz variations and don't forget to like Facebook and check it out it jazz variation dot com I'll be right back to wrap it up for this week jak variation [noise]\nSupport for this public radio station is provided by these Prescott underwriters support for ... public radio is provided by cable one providing local ed long distance phone service for your home with standard so and receive caller i._d. blocking goal forward they got more\nKeep your ... phone number talk as long as you like anytime anywhere in the continental United States\nFor details go on line to cable one dot net that's cable one in ... by county\nThe perfect press get public radio is provided by my entire wealth management fee only investment firm in downtown ... right by their brand new ... works for you to reach the retirement called my house is committed to helping you that's for income and plan for peace of mind you'll find more information on planning your future at WWW\nMontoya wealth dot com\nSupport for public radio has provided by\nThe frame and I and the arts do are celebrating over Thirty years of service in the heart of historic downtown Prescott the frame of diet to twenty nine west ... street provide high quality custom Madigan picture for a big ... photos to works of art\nYou'll also find of fine art gallery featuring local artist you know immediate stay\nArt store at five thirty seven north six street is a whole line art store offering a complete selection of our materials for visual artists in those two and three D. mediums art classes are offered that the art store in painting drawing sculpture ceramic kids are art classes and more\nKids will invite you to the frame and die and the art store in downtown Prescott signed up online at heart store dot ... dot com\nWelcome back to jazz variations here's a request for some old Brian Brown Burke\n[noise]\nDon't need to be able to go\nTo ...\nTo\nPeople die\nBy ...\nBy the by\n\nWho will be able\nGo blue blue bull in Bloomington [noise]\nEqual to pools for\nAre not going to\nAround\nThe world\n\n...\n...\n...\nMind [noise]\n[noise]\nYou know ... years will do the rules don't\n\n\nJak variation music from ... Eastwood song called how y'all doing a\nGirl and that was to nice John Kelly can be cool and a request for some old Brian Brown bird we heard these squared aim\nAnd that is jazz variations thanks so much for joining me today you know you can make request by visiting our website very simple gas variations dot com be should like us on Facebook really thrilled to see everybody doing that\nAnd of course the follow us on Twitter if you do all of that\nNext time another new release in the C. D. spotlight and until then I'm Tony a king thanks for joining me on jazz variation\n\nSupport for this public radio station is provided by these route sixty six underwriters support for profit Public Radio's provided by ... the drawing through wildlife adventure bark in Williams, Arizona view by should mountain goats bighorn sheep and black bear from the safety uncovered of your private vehicle\nOr troubled go watch playful barrack hubs up close at the end of your to Arizona like forty at highway sixty four in Williams, Arizona dog gum\nSupport for Prescott public radio is provided by Grand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feeding him right out of your hand the hundreds of animals up close elk buffalo girls camels co watching Monday kangaroo mama's Rainier and more the Grand Canyon deer farm near Williams\nSupport for\nPublic Radio's provided by keepers of the wild nature bark and animal sanctuary in Valentine, Arizona thirty miles east of ... historic route sixty six she over one number jeopardy by rescued exotic animals lions tigers\nCougars dancers leopards monkeys in more open every day not divided up Tuesday historic route sixty six\nEntertaining and lightening of farming in and involve public radio\n\n\nGuy named guy guy knew or not ... what they could but I if you'd know who should I made and boy and I got the diary for you\nAnd then make a show up at the blue for our list them I ... on a long time for them to come\nOut he's got his body parts\nOkay and they both rent some numbers racket\nA dollar a\nTo the you know the [noise]\nAnd then he read the tea get paid [noise]\nYou know ten years though\n[noise]\n[noise] anyway he might\nKnock the arrowhead ...\nYeah come on Humvees but no ... you need that club\n\n[noise]\nI don't even recall even econ\n... yeah you want me to read and go\nHalf\nHour I Can't wait [laughter]\nOh\nWhen I asked her\n\nYeah it's all through the that actually happened to me [noise]\n\nGuy knew our is presented drew a generous grants from readers radioactive chili reaches its Armageddon in a bowl try\nBreezes radio ... billion mortals\nAnd she just made them break you down again and then\nDon't you know that now does that mean\nReaders\nRadioactive Chilean turned your inside now\nIt'll be a meal out of them from\nDisease in that time and", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Kingman", "day": "21"}