{"month": "10", "state": "CT", "station": "WESU", "content": "\n\nThat only emerge evil middle ground [noise]\n\n... ... all over the world [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nDo do you ... do you remember [noise]\n\nOther than\nCell was great and who want to be gone forever\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] many would be the [noise] the next town\nOver the summer than will never do with what war\nThis bill was gray\nAnd to walk along the robber got back from\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [laughter] [noise] [noise] [noise]\n[noise] [laughter] who\nJust go to Greg\nThat\nShow and I would be on the on the\nJob so [laughter] and I will be [noise] [laughter]\n\n[noise] [laughter]\n[noise]\n[laughter]\n\n\n\nYou\n\n\n\nDo do do do do\nDo do do [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] and\nShe\nThe\n\n[noise]\nWell it comes it comes down to\n... you can get some some stuff\nOne\n[laughter]\n[laughter]\n\n\n\n\nSo\nSo\nGo\nGo do\nDo do\nDo do\nDo do\n\n[laughter]\n\n\n\n\n\n\n[noise]\n[laughter]\n[noise] [laughter] people don't [laughter]\n\n\nThink again I tell you that [laughter]\n\nYou mean by then and then and then and\nAnd then then then then then\n[laughter]\nAnd and and and the and it may be in the city and and the nice thing to do and and\nOh by the way\nI mean and and and people didn't know what\nAgain and again and again but the\nI'm going to do then is going to do that\nAnd then they\nDid that\n\nAnd and and\nAnd and again and again and again and again and again and again and again and again and again you know by the\nTime and again and again and again and\nAgain and again and again and again and again and and\nIt may be in deep and they didn't teach in a while\nAnd\n\n\nThing and and and the number\nAnd bringing the end and and and and and I didn't know what I mean and and [noise] you know by the time\nAnd and and the main problem\nAnd and and and and and and [noise] and\nAnd and and\nThen and didn't make anything and then you can teach named ding ding ding ding ding ding ding ding ding ding ding ding ding ding\nDing ding ding ding ding ding ding ding ding ding ding\n[laughter]\n\n\n\n[laughter]\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [laughter]\n\n[noise] [noise] [noise] [laughter] [noise] [laughter] [laughter] [laughter]\n[noise] [laughter]\n[laughter]\n[noise] eighty\nEight ... W E s few middle to though [noise] [noise] [noise] [noise]\n\n[noise] [noise]\n\n[laughter] [noise] [laughter]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\nBeep beep beep\nBeep beep\nBeep beep\nBeep beep\nBeep\nBeep\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise] [noise] ...\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nMm\n\n[noise]\n\n\n[laughter]\n\n\n\n[laughter]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] mhm\nWell\nThat's right you're listening to any temp ... right here on eighty eight point one W. E. S. C. U. Middletown\n[noise]\n[noise]\n\nWell that's where that sounds like it's coming way out on the right side of the bigger and yet we're W E s U Middletown where all the way left on your FM dial up all the way right on your speaker [noise] I'm going to have to fix that\n[noise] [noise]\nTo get to feed you and I ... I dug out just some random trade the where\nDon't go around the base tech stuff all in the same genre\nYeah I'm going to make up some Halloween Rikers tonight to keep it ... it's that time of year [noise]\n[noise] [noise] [noise] [noise]\nThis was driving me crazy I got to fix this I'm going to uh do a quick Mac onto the other side\nEven though this one that's cool kind of spooky tech crap going on\nBut I don't like the fact that it's only coming out of the rice speaker so [laughter]\nI'm going to fix that get back into the mix my name is ... you could call me DJ bird [noise] their show is any tempo [noise] as you will find out tonight [noise]\nShut out too well down at clay Colo he was asking me what the beef pm with tonight [noise]\nI said any tempo is going to be all over the place but currently [noise]\nI think we're in the uh\nProbably one Seventy beef PM range may be one Seventy five somewhere around there [noise]\nAlright DJ Burke any Tebow any tempo any of the second and fourth one day of the month from nine thirty until eleven PM [noise]\nAll right I see a break coming I'm going to switch out records get the stereo situation fix [noise]\nIf you want to give me a call eight six though six eight five seven seven zero zero eight six six eight five seven seven zero zero\n[noise]\n[noise]\n[noise]\n\n\n...\n...\n\n...\nPeach peach\n\n[laughter]\n[noise]\n[laughter]\n\n\n[noise]\n[noise]\n\n\n\nMuch can you be all and\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n[laughter]\n[laughter]\n\n[laughter]\n\n\n\n\n[noise]\n[laughter]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\nJust because he\nDidn't even know that becomes you know stuff kind of you know it's not just on some trouble [laughter]\n\n\n\nThirty one shot [laughter] you know the one side [laughter]\n[laughter] you\nYou can tell I'm too old [laughter] just because you need to know what we can no\nNo no\nNo\nDirty words that you can pretty one shot\n\n\n\n\n\nDirty word shocked he pretty one shot\nChannels you\n[noise] how\nLong ago\nBrilliant booms some\n[noise]\n\n[noise]\n[noise]\n\nNation in\n\n\n\n\n\n\n\n\n\n[laughter]\n\n\nThe\n[laughter] and it's\n\n\nI mean\n\nOff from the jungle and ... ... ... a little bit then go to ... ...\n... ... is there's a jungle [laughter] don't go through the jungle in\nThe jungle ... there's a jungle in the jungle it just came alive in [laughter]\n\nYeah [laughter]\nYeah [laughter] [noise] there's a\n... these things all the way he ... he was going to be that he sends a ...\n... ... [noise]\n\n[laughter]\nThey\nDon't go don't don't don't don't don't don't don't don't don't go\nGo go go go go go\n\nMm Mm Mm Mm stumbled upon\nHer arrival neck and neck [laughter]\n[noise]\n\n\n\n\n\n\n\n\nDon't give you\nAll know kinds [noise]\n\n\nDrunken thing you're putting me on\nIs pronounced Frankenstein\nDo all set aside for lick Frederick\nWell why you can get ... from ... it isn't just Frederick drunken state\nI say\nYou must be eager now it's pronounced ... but they told me it was legal ... bank\nYour son by here folks died weren't you yes\nMy grandfather used to it the old grandfather of calls the rights have come out\nOf course of course I'm sure we'll get along splendid Lee\nSorry I\nUh\nYou know I don't mean to embarrass you but I'm a rather brilliant surgeon perhaps I could help you with that how [noise]\nWhat how the\n\n[noise]\n\nThe minute the edge of the Fox poll degrading enraged at my speech resolved there for to make a creature of a gigantic stature\nNeed to get all kinds of it all has to be you have to\nGoing to be very popular boarded the plot and that leads me to write all features either late August push ups down\nOh la la la [laughter]\nWa\nWa\nWa wa\nWa\n\n\nThey will longest war in American\n[noise]\nAnyway [noise] [noise] [noise] [noise]\n\n\n\n[noise] they beep\nBeep beep [noise]\nLike an interview with Dr Doug used to advocate\nIt five four three seven as we've asked\nIt five or seven\nBuy the if you live [noise]\nBig bang\n\n\n\n\n[noise]\n\n\n\n\nAs I Am\nAnd no\nI'm going to play some yeah to a ball it\n\n\n\n[noise]\nMm\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] maybe [noise]\n\nCompany of the uh [noise]\nNow in your\n[noise] and when they\n\n\nOh so one and one so\n\nI'll throw one and one so\n\nOkay everything on nuts saying oh\nOh so one and one so\n\nOh for one and one so\n\nI'll throw one and one so\n\nOh so one and one so\n\nOh so one and one so\nOh for one and one so [noise] [noise] oh for one and one so [noise]\n\nOkay everything on ... [noise]\nWell for one and run so [noise]\nWell for one in mind so [noise]\nOh so and then run so [noise] [noise]\nOh so and then run so [noise]\n\nOh\nOkay\n...\n[noise]\n\n... [laughter]\n\n\n\nWell uh\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\nDa\nDa da da\nDa da da\nDa da da\n\n\n\n\n\n\n\nDa\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nUm [noise]\n\n\n[noise]\n\n\n\n\n\n[noise] they\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\nBy yourself or share information regarding your immigration citizenship status lying or giving false documents could result in legal consequences for any reason you are arrested you still have the right to remain silent speak with a lawyer\nFor more information on legal resources you can visit the immigrant legal resources on his Web site at W. W. W. dot I. R. L. C. dot org or call for one five to five five nine for nine nine\nAgain that's for one five to five five nine for nine nine or you can visit their Web site at W. W. W. dot I. R. L. C. dot org and click on the resource section for [noise]\nYou hear sirens in the flashing lights in your view mirror you all know that when police fire or ambulance crews are in a hurry\nSomeone's life can be at stake if you're driving pull over to the far right of the road and stay there until all emergency vehicles to pass for if there's no room to pull over from the middle ... stops and wait in emergency it's second can count we can all health I responding to emergency vehicles quickly and safely\n\nHello hello\nHello you are listening to eighty eight point one\nW E s U um Middletown and this is ladies' night hold on [noise] [laughter] I Am DJ ... and ... Jacobs is trying to figure this out right now I'm\nWith my I'm working on it you know\nA little bit of a mess right now we're going to not be there you go All right\nAnd what that really means is it's night time it is my time because I'm a Scorpio and so it's going to be an intense emotional journey for me and\nSo you know you also call us and tell us what year are signs are please and then maybe tell us about a song\nThat relates to that in some way like what is the song that makes you really feel like like it's only really makes me feel like I'm a Scorpio ooh I think I have one of those that could play later wow and the ... and a song that makes you feel like your uh\nWhat are you again oh I'm a Taurus tourists toward yeah ... died today that would be fun\nI don't know much about astrology but I Would love to learn more [laughter]\nYeah not from you know while we were just a you know on the topic of you know talking about things we do know about a quick disclaimer uh for the views expressed on this program are the views of the individual broadcaster and do not necessarily reflect the view of Wesleyan University\nOr the W E S U management\nFor that record also doesn't necessarily mean it's true we're just you know we're out here like the rest of yep\nUh also this program on her hand material not suitable for children or sensitive listeners\nIf you're offended by profanity pleased to doubt now if you have questions about the w._b. su and decency and obscenity policy pleased contact our board of directors at age six zero six eight five seven seven zero three or you can send email to W E s Q W E s U S M dot org\nThat's a quick reminder we are listening to W. S. U. eighty five FM Middletown ladies\nAnd night and um [noise] yeah it looks from Kate Bush yeah we want to placate bus\nAnd and before the first song I'm going to start off by saying please call it\nEat six zero six or seven seven zero zero I can say that I'm very much in the mood to talk to color so please call and I think did you really love it I'm so please call us and joy oh\n\n[noise]\nThe\nBe able to\nAll of you\nThe blue\n\n\nBe a\nModel or be able to pull up all\nThe ah\n[noise]\n\n\n\n\n... you said the\nBeep beep beep beep\nBeep beep beep beep beep\nBeep beep beep beep\nBeep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep\nBeep beep beep beep\nBeep beep\nTop down south now be my the kids themselves now to do with\nThe big it'd be easy to them they didn't\nLike about the rain was in the army or the piano\nStolen and try to maintain\nThe tick tick tick\nTick tick tick tick\nTick tick tick the the big\nTo eye\nYeah and you know what else you could do you call it and if you're like well I sure would like to but how do I do that\nWell let me give you the request line it's eight six zero\nIf you [laughter] you don't have to talk about the corporate you know the the or die or anything like that but that would be fun yeah but\nI mean do you do sense says that but like really want I Want you to or talk or\nYou can also talk about other live concert experience is always fun do you have any in mind\nUm any formative ones ...\nI'm trying to think you don't have to say now you can say later and yeah I I mean a whole yeah call and\nTell us about yours and then maybe some just songs from that experience you could live music we love it we loved it yeah okay I guess we're going to keep playing music to keep listening\nOut and you just sounds really wants to talk to are you really got to be ... because you see that I'm telling you it it is my time right now I'm going to be hurt I respected thank\nYou so much [laughter] [laughter] oh goodness [noise] All right what are you going to play next to Jacob surprising okay\n[noise]\nFamily looking like a prison [noise]\nYou know mom have the table time and she finally came up with a\nDisney movies to get time on on the evenings usually usually tell us on the line [noise] the secret is actually broke I tried to raise a healer kneeling pension from Patty somebody said it said was [noise] it was my and I think the last half\nThe priming back to England I Believe this holy cannot do\nOkay thank you say is\n[noise]\nSomebody at the end I think I Need 'em run his feathers and says the mom was caught on somebody's dancing day and night [noise]\n\nEveryone goes some kind of magic and they've sort of play but at the time I saw that he didn't learn all of them on the don't forget about them getting down to the computer [noise]\nEveryone goes on and on my buddies fragile\nGone through my eldest my mum and [noise] ... [noise] some people to get them\nTo [noise]\nGet down to the lady Jane daily staging the pretty confident that they will have to wait for Santa will not ugly and for my family is a company like it and I\nThink that they\n... I Hope that they [noise] let me think that I'm On my shoulder blades [noise] and I am and [noise] I Am [noise]\nOn the guy's name\nLast time on these guys\nMy mother um [noise]\nPretty much\nMany cats [noise]\n\n\n[noise]\nYeah like I'm On I'm doing well but\nJust one day in day\n[noise]\nBut if they do give froze to just like in the [noise]\n[noise]\nOh that is never good show promise June ... so I Know one ...\nDue to the to the drag\nPaying nine oh okay\nWell tell me to\nTell me on a bad guy\nI'm like yeah\nYou're on a on a bad guy saying yes\nKnow he on a bad guy\nI mean and if I get\nDon't want to\n[noise]\nYeah I like this\nDon't think for granted you bring in the last two years [noise]\nAnd so\nFrom June ...\n...\nPaying all\nOn the on the back\nThen I give\nAbout\nI mean when I get\nOn a diet\n\n\nOn a diet and say yes\nI mean I guess\nDon't know yet\n\n\n[laughter]\n[noise]\n[noise]\nWell we don't\nNeed a Jew who did\nIt so you know I\nDon't\nKnow [noise]\n\n\nI mean\nYou\nOn a\n\n\n\n\n\n\nIn the air and then now and\nThere and there was a big thing that did humans and\n\n... men\nBut\n\n\n\n\nDa\nDa da da\n[noise]\n\n\n\n\n\nMy God it's odd to me really cute cute and then when I tell you that and then go\nLay the I'm\nSure mum on the moon maybe\nA ... but I'm On a make you feel good ... ... ...\n[noise] [laughter] my good any law than you do\nMe in the bed and breaking the no good um\nWhat did they say oh I'm them with them but a lot better we\nWould get in\nThere\nAnd I brought me out on\nThe go to the theater you need to be in the ... do\nYou do you know you you know I don't want to be done\nLittle to no amazingly could lasted a burden to joke\nAbout a time in modern eastern [noise] I don't do it by men than\nBreak in the bed he decided to do damage but we're hearing live much better\nTo stand beside the can down the bottom diving\nChange your life was that\nA lot\n\nCame\n...\n\n...\nI mean did you\nThem but um [noise]\nWas already named him but um [noise]\n\n[noise]\n\n\n\nWhoa\nWelcome folks to W E s U eighty one one FM Middletown\nI'm DJ emptied then covering tonight this beautiful early Thursday morning\nThat first draft you heard there was Nico and the invisible girls a with a version of the velvet underground\nAll tomorrow's parties uh we got a great show for you tonight so we won't dilly dally or just the no the request line is eight six six eight five seven seven zero zero if you had anything to say or if you just want to check out\nOnce again I'm DJ empty spin you if you live until two in am so ah let's kick it\n\n\n[noise]\nMiddle East\n\n\n[noise] [noise] [noise] [noise] [laughter] [noise]\nA man\n\nMoney on the\n...\nNo\nFor that long\nOppression just never an easy one is even harder if you have no voice but animals held captive in circus like just a cramped cages shackles daily beat and there is no weeks gate they cannot demand their freedom image is like we bring only one word my my late\n... put me out please don't go to search for more information contact ... seven five seven six two to pita\nJames gives you the host of fusion radio here in Studio ... are you looking for the latest underground dance\nAt six thirty pm with me James fusion only on a date with one of them W E s U ... W E s you have ... or every Wednesday starting at six thirty pm every Wednesday mixed live only a few generations\n\nAre you interested in music and talk\nThat it is the weekly round of new music and memory some I don't\nEvery Saturday morning at seven on W E s U Middletown [noise]\nThe national Institute of mental health reports that one in four adult will experience a mental health disorder in a given year I Margery Mayer president and executive director of women in government your health care provider because serious mental illness can\nYou treat it between Seventy can Ninety percent of individual symptom really and improved quality of life to learn more women in government dot for [noise]\n... [noise]\nWelcome back to W. E. F. U. N. D. point one F Middletown I'm DJ and he's been covering tonight or from one to in a um we had a few tracks and row for yeah actually I Believe\nFour tracks in a row for you we have their quit the super stuff\nI'm first we'll cortex with with October a Nineteen Seventy one of ... blue than we are Stanley Clarke with we supply of rocks ...\nWe had Jackson Browne with late for this guy off of late for this guy so you are listening live on W E s few FM dot org or eighty eight point one F. M. on your dial\nW E s few yeah community and campus radio free form and\nWe're coming to you with some great tracks tonight I'm up next we have a hundred gr arrows Britain beer a off of the lift up the ante a soundtrack uh stay tuned for some great tracks with some good ones coming up\n[noise] [noise]\n\nYeah\nYeah [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nThem\nGoing\n\nIn\nLoyal to\nTV and be able to\n\n\n[noise]\nAnd [noise]\n\nDa da da da da\nDa da\nDa da da\nDa da da\n\nTo W E s U eighty point one F. M. Middletown I'm your host tier DJ empty spin covering tonight\n\nA bird and beer in from the from the around the followed by Fleetwood Mac with three in one of the beeping Nick authored tracks off their a self titled release\nNext we have men drill off of their album manned drill with symphonic revolutions\nAnd last tractor you heard there was a medley of because then come together off of George Benson great beetle cover record the other side of the road we have about Thirteen more minutes that means about twelve and a half more minutes of music for y'all\nStay tuned for some Adrian Young coming right up [noise]\n[noise] [noise] [noise] [noise]\n\nAny\n\nShe\nThe road [noise]\n[noise]\n\nDo you\nAnd\nThank God\nIf you\nThen\nNo nonsense\n\nFor\nI'm\nThey were [noise]\n... that was a new in the neighborhood brats navy ship\nOff of there seven inch on taken by surprise I'm ... and everybody loved the were reviewed in issues for twenty ... and ... when he's going to keep things off with the literati ah this is water is life\n[noise] eh [noise] and [noise]\n\n\n[laughter] [noise] [laughter] [noise] [laughter] [noise]\n\n\nAnd [noise] [noise]\n[noise] [noise]\n\n\n[noise] [laughter] [noise]\n\n\n\n\n\nWas all a serious\nCharge a lot of 'em [laughter] so ... says my sister\nSaid as a [noise]\nA bad guy [noise] [laughter] how about a ... a day [noise] [laughter]\nOh God yes [laughter]\n... [laughter] ... [laughter] ... [laughter]\nFor low ... says oh [noise]\nIn a in a in a\nWay that is a and B and have them\nThen they they made and made it a\nA\nWord\nIt can be\nA\nDay a day to day and\nA lot of the day to day on the day\nAnd then a down and\n...\n...\nA\nDay and a half\nA day and age and he joined a gym and a baby and\n\n\n\n\n\nLong\n\nLa\nDah dah dah\nWay around\n\nMaximum rock and roll radio that was ... or in our boys doing low tourist off the um the love tore seven inch on ... records or for that do a couple from a more troops\nDid how ...\nAnd a Sri ... her off\nIn ... there is that came out recently\nFor that a petite doing torches off of there seven inch on distort reality before that a material or doing the CEO offered their seven inch on drilling living\nAnd kick things off with a peer pressure doing that here in up here a pie or a pressure doing T. R. P. offered their seven inch on pain killer\n... and now I have some more stuff for you mystery girl wild and mean\n[noise]\n\nAnd that was\nTo have a bill that it\nAll day today so I guess I don't\nThere and I when I asked\nWhy are you from [noise] ... [noise] you know for them to come to a man who\nWas actually in school so\nThey have and and the\nDoes your eyes on learning to\nEvery single day\nYour ... to a winner [noise]\nSomething [noise]\nAnd ... you know actually in in a restaurant\nIn New York ... in the early ...\nAs a matter of a move to another area where you can join the conversation I [noise]\n\nI\nSo I'm going to play the boy's dream for the typical rules calm ... got sent ten and both are\nThe entire series is fantastic I'm I recommend getting all of them I'm ... I'm In a place who stuff off of all used three and four Mr things off when I'm rubber car from I Believe what is their final recording [noise]\n\n\n\n\n[noise]\n\n\nYou\n\n\n\n\nSo\n\n\n\n\n[noise]\n\n\n\n\n\nAnd I need the money I'm blind\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\nI'm\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nThere are other there were\nOur\nOur workers you know [noise]\n\nYou are listening to W E s you idiot point one up in Middletown, Connecticut\nListener supported for heart Connecticut thanks for your continued support to the radio station\n\n[laughter]\nYou're listening to noise in the attic for your path\nCome back to haunt you\n[noise]\n[noise]\n[noise]\n\nRenew Mr Big American Beauty from live in Milan Greg here\nBorn to hustle roses on the avenue of the dead broadcasting from thirty third and third and recorded and live in front of the studio in with another week of noise in the attic welcome welcome morning all get to see you get to be coming up I got two hours of hard rock and heavy metal\nAll the music you demand and includes new step I hit bully and you know maybe it's an old school bullet boys since passed away so let copyright to it we're going to reverse scout girl\nGetting beaten disturbed because we're back in this battle\n\nFor\n\n\n\n\n\n\nI\nKnow [noise] to\n\n\n\n\n\n\n\nAnd and and and and and and and then there was\nAll day\n\nWas on the\nUp and down the hill to\nOf the people in the\nOf the people\nDo not\nHave to be able\nLook at\nIt [noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nMy [noise]\nMy [noise]\n\n\n\n\n\n\nMy oh my\nI feel the\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nLittle ... micro shank or coming off the ... the jury ... and young to know and we also heard from being Hagar and mine all mine and uh hey this isn't a theme show or anything but we're going to dial up our map quest\nWe're heading now where it's the scorpion in Arizona right here on noise in the attic\nWe're past comes back to haunt you\n[noise]\n\n\nI\n\n\n\n[noise]\n[noise]\nOur [noise]\nOur\n[noise] our [noise]\nOur [noise]\n\nGetting all fired up with a little fast way in misunderstood and we heard the latest ... on green angry off of the record deal factory support your local union\nNow atom bomb had the Arab book called nine one one is disconnected I'm currently on volume to basically his tales of rock and roll debauchery areas off the record great new world big enough to rock the city so\n\n\n\n\nLegal way\nMy mom and a lot\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nBut\nThen the money to\n\nWhy [noise]\nThen\n\n[noise]\n[noise] [noise]\nPlays Peter Christian militias to do I should be out there\n\nAs long\n\n\n\nOr I can go to Muslim advocates dot org\nWhen I think it's so much for joining us thanks for having me have a great day you to Scott ten cent as a public advocacy director with a good Muslim advocates whipping discussing that report called running on hate I turn on equal cover online at ... dot com I can sign up friday newsletter subscribe to what are your cats are nice\nProduced by you know we go high on the buses producer\nTechnical director and Web and social media supervisor\nAre the music is by Grammy Award winning Ben\nLike us on Facebook dot com slash um argue with to know that the letters are you with the knowledge\nAnd follow us on Twitter dot com bloody argue with no\nOur website is rising up with all the dot com where you can find all our programs are\nLower video and audio file\nW. Middletown\n\nThe frog Hartford frog over frog cricket product to Greece Robert calling simultaneously W. E. F. U. middle ... [noise]\n\n\n\n[noise]\nFrom use the creation of a failed\nSystem and you can remove drum but if you don't address\nThe system it you know been especially I fear as we barreled towards both been eaten illogical and an economic crisis out that\nSwamp will rise big yours as frightening or more frightening than Trump demagogues who actually have any ideology\nCarson\nThat's Chris Hedges and this is alternative radio I'm David ... on this edition of a A R features Chris Hedges on root causes of a failed system\nWe live in an era where the one percent is raking it and we have a dog whistle politics bullying and disdain for science and facts\nSome saw this coming for example Neil Postman in his classic work amusing ourselves to death\nNailed it when he wrote where the population becomes distracted by trivia when cultural life is redefined as a perpetual round of entertainment's\nWhen serious public conversation becomes a form of baby talk when in short a people become an audience and their public business of vaudeville act\nThen a nation finds itself at risk culture death is it clear possibility postman wrote that in Nineteen eighty five\nOur political life today is like a reality show there's a fascination with celebrities from Kenya west to the conditions to the former host of the practice and the soundtrack in the background is permanent war\nTo talk about these issues is Chris Hedges is an award winning journalist who's reported from the Balkans the middle east and Central America\nHe writes a weekly column for truth dig dot com he's the author of many books including the world as it is wages of rebellion and America the farewell tour he spoke in Eugene Oregon and now\nHedges well is this where hope is right here in this room\nThe one that won't be easy\nOr that will require\nCommunal solidarity and self sacrifice because these corporate elites\nWon't go without a fight and they will play dirty and they will be vicious and I'm sure I'm not the only one in this room who wasn't Standing Rock\nA great heroic effort led by\nIndigenous communities [noise]\n\nWater protectors who understood that there are certain elements around us which are sacred which have an intrinsic value beyond a monetary value\nAnd which are worth fighting to protect and save\nThe last few years I have written several books that have attempted to diagnose the deep malaise within American society the failure of our democratic\nInstitutions the bankruptcy of our political elites including the Democratic party the collapse of our press in debris or less\nThe shift away from a print based culture one rooted in truth and verifiable fact\nInto a culture where\nFact is inner changed with opinion\nWhere\nElicit emotional responses to everything around us including manufactured political personalities\nAnd we confuse how we are made to feel\nWith knowledge\nThe problem in American society has been orchestrated by corporate forces by\nOf corporate coup d'etat in slow motion as John Ralston Saul points out which has transformed American society into a version\nOf the late Roman Republic\nThe facade of democratic process electoral politics civil liberties a court system that defends the rights of citizens remains but\nCorporations have seized all of the levers\nOf power and there was a great probably our greatest\nPolitical philosopher Sheldon wall and taught at Berkeley later at Princeton\nWho writes in his classic work democracy incorporated\nBut there are no\nInstitutions left with in American\nSociety that can authentic we be called\nDemocratic that\nWe live in what he describes as a system of inverted\nTotalitarianism and by that\nHe means it's not classical totalitarianism\nStill have the iconography and laying with\nEconomics the\n... of neo liberalism which calls on us too Neal before the dictates of the marketplace to structure\nOur society around the primacy of profit\nHas a centrally turn those institutions and the Democratic system\nInto a facade anytime\nA cabal seizes power whether it's from an article communist fascist or corporate\n\nAnd it read directs the institutions\nThat once made incremental and piecemeal reform possible towards accumulating a greater concentration of wealth among the elite\nAnd amassing ever greater systems of power it fosters\nIn essence political paralysis\n\nThe system works only for a tiny segment of the ruling oligarchy class and becomes increasingly oppressive\nAnd all of the writers of\nTotalitarianism including Hannah Arendt\nSee that societal despair as a starting point towards the destruction of the open society and\nWhat these mega pastors do almost all of whom are white men who cannot be questioned\nWho are con artists\nHis perpetuate the kind of magical thinking that lies at the core of any totalitarian movement anthropologists call it crisis cults that when a society to denigrate\nAnd throw us a certain segment aside\nThe only way people can cope is to retreat into magical thinking magical Jesus you saw an example of a crisis cult in Eighteen Ninety and wounded knee before\nThe seventh cavalry set up the ... guns and massacred those Native Americans were they believe that if they put on the white shirt it would stop the white man's bullets\nThat if they fell into this to be like hypnotic dance the buffalo herds would return\nThe warriors would rise up from the earth\nAnd the white euro Americans and Americans would disappear\nAnd that\nA centrally what the Christian right is it is a crisis ... the only way to break the back of this movement is to re integrate these people back into the economy and\nOf course the opposite has happened Trump has no ...\nIt's an idiot logical void but that vacuum is being filled rapidly by the Christian right the Christian fascists and as Noam Chomsky points out we may get rid of Trump\nBut Michael Pence will be worse\nWhich is the ... the social bonds the seizure of power by corporate forces\nAnd the deep lays an alienation that that is rippling across the United states we personalize our dilemma in a figure like from but this is a grave mistake\nAnd one of the saddest moments in contemporary American history has been the Democratic party's refusal to address the social inequality\nThat is driving us over a cliff [noise]\n\nBecause a figure like from did not a rise\nOut of this morass because of James Comey or the ... emails or Russian box\nBut the Democratic party is a creation of the corporate state there's one party it's the corporate party\nOn one hand you have the\nWith diets and the racist the ... and the Sheldon Adelson and the trumps and the Bannon's in the middle or in the cabinet laws\nAnd on the other you have the\nSegment of the ruling corporate oligarchy embodied in the polish Princeton graduates who work at Goldman Sachs I've taught at Princeton I see how they recruit who don't want to be down to fight as racist or homophobic or swam of foods\nBut never addressed the structures of power the Caesar of power\n\nWe suffered a severe financial dislocation\n\nAnd what was the response of the corporate elite\n\nThey created out of electronic ether according to researchers at the University of Missouri twin these six trillion dollars in fabricated money\nThink of what twin these six trillion dollars could have done in terms of putting people back to work making sure that the eight million families that were a victim from their homes had a place to live\nForgiving student debt creating a rational health system\n\nWhere parents were not forced by corporations to go bankrupt trying to save their six children\n\nAnd these speculators these global speculators they took this money they never created jobs they never buttress manufacturing\nThey bought back their own stock which is what they did with the money they got from the virtual tax boycott never forget that under Eisenhower the highest\nTax brackets for the wealthiest individuals and corporations was Ninety One percent Ninety One percent [noise]\n\nWe now live in a system whereby next year we'll be paying over three hundred and fifty\nAnd the gamble\nFracking industry aside from destroying the water on which we depend for life\nIs a money losing operation\nTwo hundred and eighty billion dollars because the fracking industry like the dot com industry has value not on the profit it produces but on projected profit\nAnd this money this twenty six trillion dollars of money marks calls it fictitious capital because it will evaporate\nIs borrowed it\nVirtually zero percent interest from the fed in Europe there were central banks that negative interest rates meaning they would pay to borrow money but it has to be paid back and since they're not producing anything of substance\nThey are imposing\nHarsher and harsher form of austerity and debt peonage on a beleaguered population that no longer has a voice within the society\nWhat we have done to our students\n\nCrippled by monthly payments in the hundreds if not in the thousands of dollars\n\nUnable to find meaningful work\n\nAmerican productivity since Nineteen Seventy three has increased by Seventy seven percent\n\nAnd if wages kept pace with productivity the minimum\nIn this country earn less than twelve dollars an hour\nThat's a third of the workforce and almost none of them have employee offered health insurance\nThat's by design\nThey are extracting it from us even if you have health insurance in this disastrous for profit system\nYour co pays what's not covered astronomical pharmaceutical\nAre draining you\nA million bankruptcy is a year\nAre caused\nBy people who can't pay medical bills and they had insurance\n\nI'm not the only person in this room to read the climate change studies each one more terrifying than the next and each one with the same thing which is it is happening far faster than we predicted\nUh it all goes to Monterrey, Mexico where they're paying workers three dollars an hour without benefits and they didn't just abandon the factories they bulldozed them so there are these gigantic massive we'd choked lots\nUh and\nThey voted for Sanders' most of them in the primaries but in the general election they voted for Trump\nAnd so\nThe process of these manufactured personalities remember ... supposedly not me but supposedly people wanted to have a beer with George W. Bush or not Al Gore I mean this kind of stuff\nSo it's these manufacturing Trump is a classic example of a personality that is manufactured by the media\nThe danger we face now under Trump yeah all all of those in power ally but with Trump we get what is characteristic of a totalitarian society and that is what Hannah Arendt calls the permanent lie so\nVerifiable fact physical reality no longer matters you can have pictures of his ...\nIt's further accelerates this division in to a world where facts are interchangeable with opinion that we honor information only based on how it makes us feel as Aaron points out\nIt creates the kind of schizophrenia within the culture because the facts or in front of you\nAnd yet they are denied denied and tonight\nAnd\nBlame these electronic hallucinations are I worry about the ... from a print based culture rooted and verifiable fact the books are still there it's Huxley I mean I used to wonder who's right Oxley or well\nWell it turns out they were both right 'cause first we got ... and now we're getting the iron Buddha or well\nBecause the ... ruling ideology of neo liberalism no longer has any credibility across the political spectrum so what happens when empires decline\nThere are familiar characteristics one of them is of course military fiasco such is\nNow the Seventeen years of warfare in the middle east so all late empires engage in military fiasco and the ancient Greeks invaded Sicily their entire fleet was sunk most of their soldiers were killed the umpire disintegrated\nThe danger is severe economic mismanagement which we already face but the day the dollar has dropped as the world's reserve currency than the dollar value plummets\nI'm not gonna play no stir dominance with dates but that it's coming is is a fact and the military machine has to contract and empires are always fragile entities because they depend for their well on the exploitation of foreign labor and the ... of\nThe tyranny that Athens imposed on others that finally imposed on itself\nAnd that's precisely what's happening and you use the harsher forms of controlling the outer reaches of empire a wholesale surveillance suspension of a basic civil liberties including due process militarized police militarized drones it all comes back into the heart of empire\nAnd and my fear and Cornel West and Rick Wilson I've been going around doing these series of talks based on great revolutionary thinkers Rosa election bird Antonio ... Carl Marx WABC to boys we did Thomas Paine for our first one because\nWe cannot sever ourselves from the wisdom of the past that is our patrimony that's our\nHeritage um you know you can go back to Aristotle and Aristotle understood that you can't have a democracy in an oligarchy system as Aristotle said once the oligarchy seizes power then you only have two options revolution or tyranny that's it\nAnd what I worry about this land of the eternal present and the land of images is that we're cutting ourselves off\nFrom our intellectual heritage at a moment that we desperately needed\n[noise]\nYou've spoken of the need for spiritual awakening since humankind can't agree on who are father that's not politically correct God is or even whether we have a father do you think it might be time to remember our well that's good or mother surely we all can agree that were children a mother as\nWell this is the guy or this is really the guy a theory by Lovelock um that the earth is is a living being every society has a concept of God\nParticular attributes depending on whatever religious system you come out of but they all know that there is something beyond us there is the eternal there is the sacred there are these forces that give life and on which we depend for life\nAnd that our time on earth is very brief\nI mean human civilization in quotes has only existed for ten thousand years since the end of the last ice age and the very peculiar elements of the biosphere that have made this possible polluting the Gulf Stream for most of the four point five\nBillion years the earth has been have not been exist it's cold house thing this moment bean now supplanted by the after a policy so it's about being in touch with the sacred it's about\nHonoring protecting the sources of life and understanding that our life with the life around us is intricately linked what do you see is the role of third parties can we afford to risk wasting our vote in twenty twenty [noise]\nTo quote the great Emma Goldman if voting was that effective it would be illegal [noise]\nIf we don't rebuild our movements it doesn't matter who we vote for\nPower is the problem I agree I'm In that sense an anarchist powers always the problem we are a terminal heretic of power we must remain organized hold power accountable as Ralph Nader has pointed out the last liberal president in America was\nThat's how we got oh show the mining safety act the clean water most of it written by Nader\nAnd there's a scene and Kissinger his memoirs\nWhere it's Nineteen Seventy one there are tens of thousands of anti war demonstrators Nixon has put in the city buses all\nAround the White House and he's standing at the window sane Henry they're going to break through the barricades and get us and that's precisely where we want people in power to be [noise]\n\nSo I vote\nBut without movements real movements and my problem with Bernie is that and I ... I Want and I were whiz Bernie before he announced\nAnd trauma was pushing him that he had to run as an independent not only are we not going to gain power through the Democratic party which doesn't function as a real political party and which stole the election from burning\nWe're not going to build an effective opposition within an election cycle it's going to take a long time it's going to begin in places like Eugene it's going to begin from the ground up\nSo race or ten years ago now the ruling party of Greece was pulling in four percent so\nYou know there does come a moment and we just have to stand up on principle because we don't begin to stand up nobody else will [noise]\n\nThat's a good question real solutions to homelessness but it raises the cruelty of what we have done to people with mental disabilities um we have thrown them out on the street or you can see them twenty five percent of the prison population severely mentally ill\nCan cope is by plying them was psychotropic drugs but it's just\nAnother example of the cruelty of unfettered capitalism the way this society one of the wealthiest society still\nOn the planet\nWe'll just guard people and treat them as if they're human refuse including of course children how many high school students are homeless how many college students I mean children living in shelters\nWell they [noise]\n\n\n\nMm\n\nMm\n\nOh\n[noise]\nA\n\n\n\nI'm\n\n\nYou're listening to the center for the arts review our ... W E s U today we welcome to the program the Grammy Award winning musician rubber Mira ... on the phone with us from New Mexico Hi Robert\n... do you guys how are you yeah how's the how's the weather out there today\nYou know a little bit tricky what you hear when people hear New Mexico I'm a little bit about the seven thousand elevation\nOh okay so you're up in the amount of already had a couple of snow storm [laughter] oh my goodness we haven't gotten snow quite yet but it just turned two like fall weather in the past week but it's beautiful\nYou know this kind of this time of the year the the big butt\nIt's a it's a beautiful community that I come from and I still live on the on the house Pueblo Indian reservation\nAnd into your Samaras well is there are there are certain crops you harvest there and\nYou know all all I've ever all I've ever done is um is um is to to take care of 'em traditional crops and I also do some small little like um domestic gardens like um like\nKale and and tomatoes and I dabble in different things that people give me\nSo it's I'm I'm just always earth work but this\nYear has been you know it's um it's been really interesting you can really feel the the the global changes here on the Pueblo now and this year we've been in a drought now that's going now um for the last two years two and a half years\nAnd so last year was really brutal because we didn't have was um we only had two snowstorms\nAnd so the earth up here needs to freeze it needs to create a permit for us all that so that the seats begin to um Germany in the springtime as a as the earth begins to get warmer in warmer and that didn't happen and so what did happen is um\nA lot of um beam lights a lot of grass Supreme for stations and and and so a lot of arch traditional crops were were stunted and we we got late um what we call the monsoons we've got the late season rainfall and the unusual thing is in September\nThe ... started blossom blooming well and then the now like\nWe're just walking outside and we're looking at the raspberry bushes and now the raspberries or or or\nIs it's it's really strange I mean and I'm living in a traditional life it it really is\nIs that isn't entanglement of what is what is what is true to what you've learned as a as a trip Ellen and were were brought up to be and then to what is actually happening in in our world now around around the world and it's it's it's intense\nIt's definitely affecting all parts of the country yeah\nAnd I think you know that's one of the reasons why I think the the show that that would that I'm collaborating with with the string quartet Nestle is um is is appropriate\nBecause it's a reminder I'm from the artist once again about how fragile our existence is and as much as we want that next cell phone as much as we want that next um\nElement of social media like we um we really don't need it 'cause we're forgetting who we actually are as human beings\nSo the the river is inspired by water and it's a central role in life on earth how did you land on that theme of water\nWell it was it was um we had we had been\nA show called music of the sun and then we'll take you to well why don't we do something you know ... what do you think we could do and then so we we had a we workshops some some piece of music some different pieces of music and you know I like to\nThink about the the the reverse of the of the world different rivers that that are that have affected us in our lives\nWhether it'd be from Mongolia whether it'd be from South America or or the river that flows through my village so we\nThat's great I Know you were talking about working with ... when he goes to hear it will be in for several years and so yeah I was really interested to hear more about when it was like Oregon anytime in the music that you did was on land that came out\nYou know it it that's when my collaboration started it is to really open up myself too I mean I I didn't even know what they were saying half of the time [laughter] and then they're like right now about ... ... oh okay okay yeah yeah yeah okay [laughter] it was crazy\nIt was it was it was um I was I was just in my early twenties and so I I saw that whole development of of how powerful music and dance and\nEnd the conversation of of music and dance developed 'cause I used to I was a dancer for many years when I was younger and so I was always intrigued with with um the different forms and styles of dance and\nWhen I met a coma they\nShowed me a discipline with my music that was it was insane it was they they had me please okay in the morning we get there we play the music straight through\nGay then we would we would we would do um technical rehearsals with with light and in form or you know everything from stage and to to light too weak you when things\nWould do the music again after lunch and then we would do a run through we do a whole run through and then sometimes\nWe would do that then we would do the show some times but it was like that continuously deal with a discipline claimed that piece of music\nFor days every single day you know it was just continuously some form of discipline so I I really enjoyed the that that that aspect of who in what they taught me how big respect for them\nAnd so you started playing the ... were you were Eighteen when you started what what drew you to that instrument\nWell you know the instrument that that I play is is it is\nWhether it with a group and I had heard stories of this instrument and but I never knew and I I kind of dabbled around with\nSome instruments from from Guatemala and from Ecuador but I just couldn't connect with them as much and so I was at this this real simple gathering the power in my community and\nThere was a flu that that\nThis man made that was from my grandpa society but he was\nReally old but he um hadn't made too many foods and just so happened that food that he made he made it to this organization and it just called me and that's what I Want to do that's what I Want to play but at the time I was um\nIt was into the mid eighties and you had to really actually do do some research and there wasn't a lot of music out\nThere that that corresponded to to that particular instrument and my biggest influences at the time was just you know yeah traditional music but at the same time it was rock and roll it was like\nLed Zeppelin was it was Jimmy hendrix it was I was really more fascinated with the the ... the rock by bugs fascinated with the with the story of\nOf um um you know that like the the Jamaican form of reggae and and all these things and so\nSo I I I was I was so far away from from what would be considered native flute music so I had to really trained myself how what the instrument actually did and I started looking for for music and what I found more with albums\nAlbums that were created by the southern\nI began to listen to and started to find find them different ideas that that beginning again to associate me but then I was of a different generation and so I was like OK what can I Do [laughter]\nI Know you've you've done this unique blending is\nTraditionally American music with popular music is zero thing in other music from around the world were there any musicians who's teaching was influential to you over the years or was it really is kind of self guided discovery that you're talking about\nWell at the beginning it was huge huge self guided discovery because I'm ... I mean I always tell people I'm house all roads lead to house and eventually\nYou have some buddy extremely well known and extremely crazy is going to end up here and so I've I've met some of them some really fascinating people here that have influenced the world\nWhether it be music or literature or to film and so\nI kinda just\nWaited around for things to happen as I started\nTo develop my musical um arsenal of of a song\nAnd then this this this um um um country music singer who had who was fairly well known in the in the in the early seventies in mid seventies\nMoved here and he took me under his wing and we and he would say you know I really liked is what you're doing and goes you want to be a gift in my tour\nSo I toured with him and that's when I Begin to understand that certain that that not all foods are in the in the same key and not all means and the same key\nSo that they are compatible with a ... scale because these are all kinds of tiny minor scale and so then I started to okay what is is why how can I Do this how can I cross\nThis instrument with this instrument with this song so it was it was for a long time it was trial and error because I didn't know what I was doing I knew what I was playing as a as a as just a solo artist and then in that time um there was um\nA really cool I'm comfortable um conductor who conducted the the Colorado Springs symphony orchestra and he also the San Antonio symphony as well as the Salt Lake city symphony he was going back and forth\nAs a as a conductor and he um created a couple of scores in a minor F sharp and she and I and I that was when I realized oh man this is going to be something way bigger than I can understand right now and it was with symphonies\nTo here on you know it was it was at a ski slope a thousand people in the audience and here's one flew with a symphony and I was like whoa whoa\n[laughter] this is going to have\nA I I was playing my flu but then here's this huge huge sound behind it and\nIt just elevated my interest in such a larger level and then I'm I'm I think you know I guess moving forward there's always been some some person that has had a gift didn't mean\nTo to teach me and so I'm always open but the best that I feel like I've been I've been I've done is just to stick with ASL because these guys have really\nIs is on his on I'm just today is with\nThis group that though you wanted them the unique things\nAbout this flu is and also working with a string quartets you string quartet doesn't have to take a breath\nRight so what I've learned throughout the years is um I I Do a circular breathing with my instruments and so I began to I can I hear melody\nBut if the if if if there's a place where I Need to take a breath and the and I'm constantly having to\nThat's what I think makes it different with native flu players is that they haven't learned to evolve a technique and so all the composition sound the same because they're taking their breath at the same places\nSo it becomes ... and so what I've learned is is do do um just practice is um I study with the aborigines with the did you reduce and so I Am\nI learned how to secure the breeze with my instruments and that that gives me the opportunity and the range for stronger compositions simply just simple\nInstead of saying you know instead of holding one two three four seven seven beat phrases I can I can hold thirty beat phrases and and stick and and lean myself more with the cello or the myself to the viola or the ensemble of the song\nDa da\nWith the with the with the with the with the with the well off in the world\nWould end up with all the all the all the all the with the ball to develop the can down the middle of the long\nRun a little bit about the development put up with the whole crowd of people don't know what to do\nWith the with the with the ... the the the [noise]\n\n[noise] [noise]\n\n\n\n[noise]\nGuy house [noise]\nKeep all the rain [noise]\nGuys are all their house [noise]\nOur calendar this guy with the rain [noise] when you want to know when [noise] guy will tell you [noise] do you plan\nTo go first go went to bed Quinton [noise] not too many guy watch you any more [noise]\nNot too many went to New York when [noise]\n\nWhen the last time I used to all the guys that night [noise]\n\nThe shoe bombers [noise] my love [noise]\n[noise] every once in a while you're star runner [noise] talking cost the nice guy [noise]\n\nTrick in the car the nice guy [noise] taking a method somewhere [noise] for someone who is watching the nice\nGuy [noise] not [noise]\n\n\n\n\nDo you watch the night I called [noise]\nEarly morning in the brain\nThree wonders will be the deer and the guy didn't used to read on the bright one and a bright one baby brother\nThen we know\nThe world who have guy but not many no that anymore [noise]\n\nLot [noise]\n\n\n\nAnd can't do that and then you get\nGetting in there with him\nWhen they when you get when you get when\nYou get when you when you do\nThey when they when they\nAnd and then you\nNew\nIn New York\nKnow in in\nYou\nAnd then and\nThen when the when\nYou when you're\nIn Yemen\nThe fact that they would\nTurn around and\n[noise]\n\nFilled ... takes me infinity all Hartford stage on friday and Saturday you can catch Quinn Sullivan young blues man mentored by some living legend\nSamantha Fish takes the infinity Norfolk stage on friday night\nYou can catch Gaelic Storm an unfunded Norfolk on Saturday and Sunday brings flamenco guitar master ... labor and ... are a five to nor folks\nHere in Middletown tonight the Middlesex drum circle invites you to bring a drama and meet them at the button with tree friday night the rock comedy group the coconuts returns to the button with stage\nSaturday Night I'll ... a jazz pianist a ranger and cofounder of a room full of blew the renowned Grammy nominated as American jumped band brings his solo act to the button with tree [noise]\nFriday night the ...\nFor the arts in Middletown presents the adventurous string quartet ESL\nTeeming with Grammy Award winning house published looted and Native American instrument maker Robert Mira ball to present the river [noise] also on friday night at the TSA visiting assistant professors Julie ... an joy of how present wrapped in an evening of multi disciplinary\nStreet station offers more heavy duty rock and roll just weak silicon genesis tourists take the cherry street stage tonight and Saturday brings attempt a new id fits Halloween show with special got details at W. W. W. dot ... dot com slash cherry street station\nOn Saturday the widely in RJ Julia bookstore in Middletown offers kids family story time at ten thirty AM Saturday Night is philosophy nights with an event starting at sixteen [noise]\nYou know here's a rundown and send them off the beaten track in central Connecticut [noise] through tonight [noise] real art with continues around them because I'm an infinity about the radical I worked with your your your summer [noise]\nAustin continuing his I'm not a witch a fable about as Ambien grow accused of witchcraft and all of that and you know a charge a comedy about a female comedians [noise] friday real art ways will screen five films including Leon us the ... the great buster a celebration Monrovia, Indiana and the wife\nDetails and screening times uh WWW dot real art ways dot org [noise]\nThrough tonight trinity college just in the studio in Hartford is now showing black klansmen Spike Lee's film telling the incredible true story of an American hero\nFriday they open to run a Juliet, Naked [noise]\nHere's a rundown of Nightline up here on W. E. S. two eighty eight point one FM Middletown [noise]\nRight after the driving five stick around for home grown with Rob ... playing Connecticut connected artists treating listeners to pre release material and to do interviews with artists as well as information about live shows in the area\nAt six thirty it's imagine with Karen stock offering Ninety minutes of peace through music from eight to nine thirty PM you can enjoy evening jobs with building are\nOffering a broad range of swing bebop an experimental down with a sprinkling of new releases wear hearing is the best experience at nine thirty let's get political with DJ\nThrough trivia\nFrom tend to eleven PM it's the American empire with yours truly to me [noise]\nAnd exploration of the influence of American cultural imperialism on foreign music [noise] such as ... Japanese jazz privy and from him so much more [noise] until midnight is this just end with DJ will EJ riding soundtracks in reaction to the most eye popping news stories of the week\nFrom midnight to one if jazz militias definition DJ stopped me Fox and and Mickey\nJeb Bush has traveled through the history of jobs I highly to get different\nArtists sub genre or time period each week from Monday to am DJ Jackson brings you the sonic our focusing on in Iraq Prague pop power pop indie pop et cetera the show we'll compare music from a previous generation with contemporary\nThing until three is what the phone with DJ jacket little thrill and do you do him or oh so he's boring George Clinton concept of the funk as it appears across genres and generations\nFrom three to four AM to the Arabs block rubber an ... thing for them to them commentary along with recorded material from all sub genius radio and said shows than ranchers media barrage collage artist and selections from the Indy audio underground greeted by various subjects and I and others [noise]\nRounding up the night from four to five AM is the b._b._c. World Report offering international news coverage\nAnd we kicked off each weekday at five AM with MORNING EDITION from NPR [noise] and that's offered a new job site joined us weekday that for fifty five for a daily rundown of area happening and a rundown of evening programming on WFSU Middletown thanks for listening not stay tuned for home grown with Rob dressed up next\n[noise]\n[noise]\nHey I'm Robyn\nAnd on your radio dial of course if you're on the computer you're well aware it's W E s U S M dot O. R. G. and on that you can find our schedule you can check out some swag and you could probably get yourself ready to find that button that says donate now because they won't be long before we're asking\nAre looking out the weather window it's sunny and beautiful little chilly but you definitely want to put on those shades today if you're getting in the car\nEither sneak back a couple of noxious crank up the tunes I got a car full of homegrown for you and well looks great right now but the weather people have been saying for days in every station right across the board\nThat this weekend it's going to be lousy it's gonna be a nor'easter a lot of wind a lot of rain and then the upper areas you might get a little snow\nI don't like the idea either but I guess you could say they were given up a storm warning this storm warning by the man dreams [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nNo\nNo\nNo\n\nGrandmother I a bio ...\nBy all round\nAll angry about\nA mile round a lot\nAbout body I Know\nIt really is a a lie All right\nI'm all and\nK\nI had\n\nLong run but\n\nThe rubble\nTaken down the\nMaybe they\n\nKnow\nThe red\nLive so long\nRed Bull\nFree\n\n\nHad to go down in la la la\n\nLa\nBrea Dan ... you have to read a\nRead a\nThing I read\nThey arrive\n\n\n\n\nA car\nUm\n\nWell that's enough novelty songs for today I'll have to say a that was\nA the TT's Jack the ripper it comes from a Connecticut compilation called a whiplash Halloween\nA recorded up that bone head studios in Cheshire where a lot of bands are moving into doing some serious recording up there a before that it was coke and the reason I played a Halloween so I Know it's not Halloween next week is Halloween however It's Wednesday next week and a lot of clubs and\nBars are doing their Halloween parties friday and Saturday and Sunday this week coconuts are playing one that ... you heard the coke and that's from their lower this my your standards CD I'm my own grandpa\nAnd bag would be for that I'm the best from a CD called Deadwood and the hemp studies from they aren't say on classic cars and the hamster that he's a plane would die without caffeine nine in New haven on friday night as a Halloween show\nAnd also they're playing at thirty three gold in in New London on Saturday as Halloween show but with different opening acts\nThe mentoring started off with storm warning from the one for all CD\nReleased like almost Twenty years ago\nIt's hard to believe additional guitar and that tracked by Hilton Valentine of the animals' lives in walling for it or in case you weren't aware of that\nNick ... friday on ... and then uh was uh American Idol he was in a band called beach avenue which won a contest that the Mohegan Sun a battle of the bands and two thousand and one\nAnd then on two thousand and fourteen the ban went on Americans got talent but they only made it up to the\nLike second to last round\nYeah and he's been touring around he's released a lot of records toured with the alternate routes and some other people but on Saturday Night yeah it's a ballroom and him the ... job and it was having a reunion show and this is from there something to believe in the D. that they're released\nAnd I think it was two thousand and\nFour five school really\nWoke up a cup of coffee in Miami and then a lot of the main things too well I'm coming to in a in the know\nHow to go for any piece on\nOr whatever then what do we believe in you made me\nMan no no no\nMad Men on Jane\nAnd so\n...\n... ... ... ...\n... ... ... ...\n... ... ...\n... ... ... ... ... ...\nNew ... foot\nYeah you're right\n\nYou're wrong you know ... and that in Iran and good no no no no no no\nI'm a record called true in the song is called baby alligator and of love is going to headline at the brand new a venue downtown in New haven in the ninth square called\nThe state house and it's a brand new run by artists and they're getting\nTheir feet on the ground right now from what I understand it's a lovely room you might want to check it out before ... it was Bronson rock Bronson rock motel creeping shoes from there then came Bronson CD and Bronson rocks going to be playing the happy hour cafe nine on friday night\nThat's down in New haven of course she might snow that cake Callahan before Bronson rock the lover from the greatest of ease ... of course being a past a state trooper door\nAnd a ... it's going to be a Mac Timothy on Sunday in New haven and that that a\nBrand new venue for acoustic style music\nDown in the east rock area of New Haven\nBefore Kate it was brown a beach avenue\nAnd a song called believe from the something to believe in eat pie\nAnd a beach avenues doing their reunion gig at the ballroom in Hamdan on Saturday\nAnd as I said that the next friday on the American idol winner of two thousand and Fifteen and a shoreline Connecticut guy\nAnd a nice guy and that so hey you got a minute I ... I just need a minute\nIt's your buddies ... W E s U and here to tell you that my friends at the community foundation of Middlesex county are hosting a conversation on understanding and supporting the transgender and gender non conforming community that takes place on\nOne hundred training the road right here in Middletown, Connecticut event kicks off at five thirty for more information\nAll my friend Lucy McMillan at age six oh three for three fifty three hundred and eighty six oh three for three fifty three hundred we'll see you there one day November fourteenth entrapment all Middlesex community college\nThanks for your time and a\nRacket ... Glen Ross they're playing tonight at that video on him that early yet you want to hear these to kill and make your mind to it sprang from the the the watch this time\n[noise]\n\nAre you going to\nChange a\nAnd out of\n\n[noise] [noise] [noise] well\nAnd in\n\n\nAnd angry\n\nNo no no\nNo\nNo no they\n\n... ... ... ... ... ... ... ... ... ... ... ... ... ...\n... he just way ... ...\n... ... ...\n... you and they do ... ... ... ...\n... again ... ... ... ... ... ... ... ...\n... ... ... ...\n... ... ... ... ... ...\nOr ...\n... ... the ... [noise]\nI Know my bad men do be a [noise] ...\nHave these were will keep me go to the ... ... na\nYeah and ... to ... ...\n... ... ... you can go to ...\nListening to homegrown ... W E s U Middletown eighty eight point one F. M. W. E. S. U. S. M. dot ORG\nThat was good night blue moon waiting for my ride from their brand new ... dream CD and good night blue moon is that caffeine nine for Halloween show on Saturday Night in New haven\nOverrun rose tell me all about the title track from their latest CD marvelous liars leather jacket from their marvelous wire CD [noise] they're going to be down in Norwich at the strange brew pub on Saturday Night\nSparkle Maddox before that sparked in the dirt it's brand new single thing that they just put out it was announced today so I thought I'd give it its spin re Hardman keyboards and vocal Glen rock full circle from into the unknown Glenn ths going to be playing this evening with Frank ...\nAt the best of video in Hampton, Connecticut and you heard watch the signs from Frank after the B. E. pi\nA lot of music right a lot of grants are playing out this week we're not done and I got a gym these in stone and dirty boots are playing at cafe nine on Sunday at the Sunday bugs do you want to catch a Sunday bugs gone down Frank retail we'd be the genial hosts\n... stone and dirty boots playing solo Sunday both believe it or not\nDa da da\nDe\nDa\n\n\n\n\n[noise] [noise]\nFrom the barometric pressure is on our side is the poorest there's Mr Naomi eagle book before that rhino cold heartbreak or from their newest she called rhinos playing a um cafe nine Halloween show on Saturday Night\nAnd I'm On Halloween Night I'm Sorry ... next Wednesday Halloween Night uh Balkan brothers devil on TV the title track from their latest but there are due to have another one any minute they're playing in Bridgeport at the acoustic on Halloween Night\nPat down south Adam before that push and pull deal tempered pride step as a couple of gigs this week and one of which is that the playwright with David keep keep on a friday night and that's in Hampton\nAnd pat stone in the dirty boots started off title cut long way home pets don't is that this Sunday buzz cafe nine New Haven I'm Robbie this has been home grown Connecticut connected music show W E s U Middletown I've been happy to be here I Hope you're better off like I did Jake cool like as a brand new brand new record out\nIt's called get faded and go that's what I'm going to do I'm getting faded and go\n[noise]\n\n\n\nKnow who they're\nCan be in a bad\nNo brainer than their own\nNa na\nNa na and\nAnd\n\n\n\n... gone by\nIt may not know\nA I'm\nA year on\n\n\nA\nAnd\n[laughter]\n\nNa\nNa\n\nNah\nNah\n[noise] [noise]\n...\n... ...\n...\nUntil the nineteenth century the movie's imported several thousand enslaved Africans to Jamaica and with the Africans came new languages religions new music different coaches bullies and ways of life\nThe British realized very early that African traditions especially singing dancing and drumming with vitamin retaining the spirit of freedom they were also\nFearful that these African rituals could be used as opposed to rebellion an uprising has a measure of control legislation was passed in sixteen Ninety six which forbade large gathering his praying singing drumming\nOr other forms of celebration\nDespite this the Africans how close to their traditions to learn how to secretly past traditions down through the generations interaction between Europeans and Africans created a new language which evolved into Jamaican krill patch walk this language was used in most\nFolks so to make a folk music is probably too early for much of it can it can be characterized different groups like ten minutes\nNice to have been such as Qatar banjo hand drawn at a room by far the Nineteen fifties\nWas golden age of Mentos which greatly influenced\nThat led to the development of Scott Scott combines elements of making Mentos with American jazz and rhythm and blues after World War two mini Jamaican sports radio frequently listen to American jazz and rhythm and blues that was brought to the island by American naval officer stationed there and also from Port so like New Orleans\nAnd the Nineteen fifties however Americans began listening to rock and\nRoll instead of rhythm and blues which that comes to love in an effort to recreate the music producer such as climate cops and died prince\nBust and to read more sound system operators began to produce the recording at the times scholar it's we're largely influenced by the Jamaican ... boy culture rude boys was the name given to the poor unemployed you making news for sometimes be hired by sound system\nOperators and promoted to crash the party some other promoters will be\nBoys started dancing a little slower to the music the tempo of the music change this was the birth of rock steady there's often said that the Alton Ellis was responsible for the music when he released his song rock steady rock steady however only lasted two years and when the temple at the music began to slow down again the music known as ... which created\nReggae emerged around Nineteen sixty eight and it's commonly used to refer to\nAll popular Jamaican music the world record with regards to music comes from the song do the right thing by the time\nDuring the seventies rickety international acclaim with the success of groups like the weather and movies like Jimmy ... the harder they come\n[noise] [laughter]\n[noise]\n[laughter]\nA new book Bob Marley a golden age of reggae provides a glimpse of some of the greatest years of Mali's career and charged the history of rigor in the music through portraits performers a person who shot photographer Kevin ... Walker provides a unique\nInsights into that era of Jamaican music captured in Jamaica in the Nineteen seventies for collection also beaches precaution bunny wheeler\nScratch Perry hook tone and a circular inject lower Jimmy clip junior emerging ... George Harrison burning spirits and third world country it's got to I Want to welcome Kim and her husband Jeff Walker to these radio airwaves working both thank you glad to be here comes a little bit about your back [noise]\nI started school at UC Berkeley when I went to college and the free speech movement happened in my freshman year so that was my first experience doing little photo journalism photographing all everything was going on on campus\nAnd I transferred down to UCLA because I was interested majoring in motion picture production and down there I started working with one of my teachers who used to do interviews for the underground threats and that led to made shooting\nAn entire variety of popular culture figures including a eventually well there was Jimmy hendrix who I photographed when I was Twenty years old and I didn't even realize he was flirting with me until I read it in a book about Thirty years later [noise] and ah Andy Warhol and uh\nJoan Baez and it just a wide variety of cultural\nFigures Woody Allen Cheech and Chong 'em Dan Ellsberg so um I had quite a portfolio of photos when Jeffrey and I finally met and we for music world and uh we had the opportunity to put all kinds of interesting people in the magazine that nobody had heard of before like Tom Waits and\nJesse calling young and we had the very first\nReggae cover story I think anywhere in the United states\nWe'll did Jeffrey and I were married we had our son Ryan\nAnd I'm Jeffrey got his dream job with island records and uh when Bob came up to Los Angeles for the first time\nJeffrey arranged for all the press interviews and I made sure that Bob was sitting in the chair facing the window so that that was beautiful light on him so that I could be unobtrusive and could just photograph his reactions as he spoke to the press he was very expressive\nUm it was very important to him to communicate about rectify and to communicate about [noise] the the message of the music and so it made for very expressive beautiful pictures\nRoad brings me to or you're logged on to [noise]\nThere are a lot of kinds of photographers there are um food photographers their art photographer as their paparazzi and I consider myself the opposite of a popper I'd say a ... takes a person's picture against their will\nMy philosophy is that photographing is giving process\nI give my skills and the subject gives me their trust and that resulted in the pictures that you see in this book it's an act of mutual love where the people trusted me and I gave them my best\nTo tell us why did you decide to do this book is [noise]\nWell for the past the thirty years or so I've been working in the entertainment industry so kept me pretty busy I worked on the early John Carpenter films I worked on cheers for nine years and family ties for five years or I represent still photographers on the national executive board of the cinematographer his guilt so it's\nIt's been very time consuming and now that I finally retired I had time to look back over my body of work\nAnd um it was time to to make a book and and these pictures just dying\nOr the uh the the sheets now that you hadn't seen probably in a very long time\nWell many of them I had never really taken a close look at at all\nOn some of the pictures had been used ... I guess at the time or for album mind\nIt's not as much as it was just on ... and I had never printed them\nI didn't even realize that some of them were principal because on appreciate things are all one likes to some things are dark something light so when I began to scan them and print it came as a revelation to see some of the really beautiful things I had the people I met down there\nAnd Jeff uh tell us your part into of course you are a husband and wife we should make that very clear I'd tell us about your reading of Kim and also how you began to collaborate\nWe actually met a I guess about a year and a half before all of this has started I was a editing a brand new music magazine called music world and uh\nI'm Kim was going to be the are the kind of the head photographer for the magazine and we were essentially set up by kind of a blind date to go to a cat Stevens concert and she shot at and I reviewed it and that was sort of the birth of both are the magazine and our relationship\nAnd I guess it is about a year later we had our son Ryan and I was working at United Artists records as their west coast of publicity a coordinator and um was on was sent on tour to to England to to to um\nBasically to tour the British Isles with a couple of groups that we were going to be bringing it over to the states shortly and while I was over there I managed to I had a very good friend who worked at island Brian Bull Evans who was the head of publicity over in the u._k.\nFor island records and uh he set up meeting with me and Chris Blackwell of who was just about to start up I have um and then to\nAs a publicist for for island I basically told Chris that and we had a nice meeting and about six months later I got a phone call offering me the job\nAnd I was over in Ireland for about four years and it was during the period ... essentially the Bob Marley live ... where the first two albums\nUh that I was working with when I began working island although as very familiar with Bob the Nobel as earlier work when islands was distributed by Capitol Records but I was there from that period through exodus\nNot know what was your when you did or of course Bob what were your even though I'm ... you were taking pictures of him what were your impressions of him as a person [noise]\nHe was um very dedicated to what he did he was very serious about his art and about communicating\nOr he was a perfectionist it was important to him that the journalists understood where the music was coming from and that it was more than just music that it was an expression of rush to far is that it was an expression of love and Brotherhood and unity and equality and justice and\nIt was very important to him to communicate those things and um and I think most of the journalists got that and if any of them were too dense and not getting it then he could easily slip into the pot why let them struggle with\nIt [laughter] ... or was there any time or the ... did give short shrift to those um journalists who didn't quite get it\n[noise] uh well yeah uh I was that was more likely to happen at a press conference and with more mainstream um you know most of the rock journalists were aware of of you know kind of knew going in\nWhat what what what Bob was about a new certainly done research in the rye suffering from and so forth so they were very open minded and listening to what Bob have to say um\nThat may be God short shrift I'm trying to see if I can come up with with any particular by the time of the show\nAnd I would say that that Bob was justifiably wary of Babylon but that you know from long experience that was probably a sensible point of view but he did trust Jeffrey and he trusted me and he was completely cooperative with us because he knew that we were working in his interest\nBob wanted to be successful with a lot you know there's no bones about that he was he wanted to music out there to be heard that was his main focus and your focus at that point for absolutely he jumped in with both feet there was no reticence on his part as far as that\nBasically what you're talking about the music and he talked about rocket foreigners him and he talked about or those were probably you know the three most important things on his mind and certainly those things are all things or rock writers could relate to\nThis is talk about one of the most interesting characters in regard to use it Peter Tosh\nOh I absolutely do or Peter I know that the public image of him is very military very angry and he had a lot of justification for being angry he had experienced a lot of injustice but he had such a sweet soul\nAnd so much humor and and so much exuberance it was it was such a pleasure to be with him and he was so cooperative an outgoing and expressive\nAnd so kind when we when we had our three year old son with us who was thrilled to meet him my son knew every cut on every reggae album that had ever been released by island in the United states\nAnd he was so excited to me Peter and Peter was helping and puts a needle in the forty five so that they can play the records to in the studio and um he was just as sweet as could be what is sweet so [noise]\n... ... ... of course of a joke for Peter didn't stay long\nUm I I I mean I'll be probably of the of the three the one I was closest to personally I I agree with Kevin totally in terms of just what a warm sweet so he was at heart\nAnd ... that was probably totally characterize my experiences with him I did was probably kind of revolutionary at the time in that because I had I had known Peter and have been talking to all of the uh you know the artist and went down there I was in the best position to help publicized Peter there was no one at\nAt Columbia at that time we really knew anything about it and I'm Christian Charlie nutrient the president of Ireland very graciously allowed and kind of loans me out\nSo that I could work on Peter's album um\nWhich was the only one of the whale ers and all the other groups at that point that was not on an island so it was a it was it ... I was I was very grateful to do it and I I Love doing it and this was during the period that he or she was joining with the stones and appeared on Saturday Night live and legalize it came out [noise]\nUm and uh [noise]\nJust the sense of of energy around Peter his his uh his intensity and I think you can tell from Kevin pictures when he broke out into a smile um you know it just it captivated everyone around him he was a remarkable remarkable man\nAnd he was still open you know he did something about this a little bit more guarded Peter Tosh so open your\nAreas laughter [laughter]\n[noise] [noise] [noise] [noise]\n\n\n\nPiece of\nThe few\n\nMay not have been willing to\nDie\nIn\nA row it'll be there\n\nTo listen to\n[noise]\nBall round for Ron Paul\nHarvey dog for a\nLong time or\nDo you happen to you got to\nPut down on your\nHas been\nAround for a long\nTime for ... for for all\nOf\nGun in the ... and and then you go around and\nUh\nLittle eighty eight points one of them [noise] and on the Web that WWW dot W. E. S. UFM dot ORG\nNoncommercial blisters deported community radio broadcasting Pacifica Radio program NPR local and National Community affairs music and more stay tuned for more great programming on this alternative radio station [noise]\nOver Thirteen million people are affected by famine war and drought in the horn of Africa unfortunately just listening to this commercial won't help them just listening won't give them their next meal or shelter you can't help but to actually get up to seven seven seven for for for\nTo donate ten dollars and go into us a dot Gov slash deaf WD for the facts\nTo buy the council on USA ... nations directly to consulting with the manager and when they form innovations diner Texan they'd already supply\nHarry features shows where it's changed the world with her anti slavery novel uncle Tom's cabin experience her life explore her impact tour her home to visit her garden\nHartford Harry features does center presenting seasonal and the tourist daily salons that do parlor conversations on Thursday evening come inspired to change your world join the discussion on our Facebook or Twitter pages for more information that Harriet Beecher stowed dot org for a call ... ...\nFive to nine to five eight that's five to nine to five eight [noise]\n... well what could the same be said about buddy buddy we of course everybody looking stern um or was there a market contrast between the\nPeople oh bunny when it was a really unique character bunny it it was said that money wasn't O'Bannon and that he had powers and uh\nWanting to talk to money they went to ... to do when they said Tommy how can we get a hold of money and he said well just call him and they said well but he doesn't have a telephone how do we call him and he said well just go outside under the tree in calling so Jeffrey you want to tell what happened\nAnd and even though we you know the kind of the difficulty in getting by played on black radio\nIs something that people are aware of and talk about and so forth but as I said earlier it's not like he was getting a whole lot of play on top forty mainstream radio either it was just a matter of the time it took for different audiences to embrace\nA wreck I Am particularly Bob\nAnd by the same token we had champions and the black community for Bob from the very beginning there was particularly writer the hamster damn news who was a crusader on Bob and Bob's behalf and we did get good coverage during his first tour in both the essence and jet magazine\nAnd the and the um media which was not really in my area I was in publicity so my responsibility was pressed for the most part radio was in the promotion department and there was a lot of\nEnergy put into getting Bob on black radio and a lot of resistance and that did have more to do with\nWith this go at that time being as popular as it was but it was a fad and and it was and Bob is recognized by many people by many certainly black artists are Lionel Richie Marvin Gaye I'm\nJohnny Cash there were you know many people that were in in that or who were also champions of Bob's music and did their best to get it played and had him open for them or play with them um\nIn in order to kind of expose them to a larger black audience and obviously that worked over the long run\nBut even during during this whole period and ... even though Bob did which was very popular in certain segments of the of the music you know markets did not really needed the sales were not all that strong until probably Nineteen eighty ... so you're you're still talking\nSay older are struggling for airplay we're struggling for recognition but we had champions in every markets segment\nSo even though there's there's a you know you know I kind of you know a lot of discussion and Bob was athletes earned about the unwillingness at that point or the difficulty of getting a music played on black radio it was just a matter of time and it was not just that I wouldn't make any more of it was\n... or you shut mostly black and white and you do some shots because that was about that a woman you're reading managed to hide behind that and [noise]\nWell I Love black and white it's it's a beautiful medium but also I couldn't afford to shoot colored film color film which makes sense that um I use very inexpensive color film and used it very judiciously a little bit of the time and I I was never one to shoot a whole roll of film in the hopes that one is that your would be good [noise]\nEvery single shot hadn't account 'cause I couldn't afford for it not so I Would spend a lot of time just waiting for those in those moments that really revealed a person's emotions the person's personality\nSo that was in Nineteen Seventy five now one year later you go back to Jamaica in Nineteen Seventy sixty two the two years that you went to Jamaica to actually shoot what happened on your signature\nOn the second trip and we took a whole gaggle of journalists feel that they could get the feeling of being televised and where all the music was coming from and then we took one more trip in Nineteen Seventy six our last trip where we took a young rock journalist with us who had worked for us on music world when he was Fifteen Years old\nDuring his almost famous period and\nThis was a camera crew was an Eighteen and he traveled with us and our three year old trying to Ryan and we traveled as a family unit around me\nPut this book together I contacted Kamron and I said would you consider\nAnd whatever you could remember just giving me a few captions for the book and instead he wrote this beautiful introduction where he talked about Jeffrey being the best editor we ever had and how he\nLooked at us with a Ryan as being an example of what a young family should be like and it was just the most beautiful introduction I could imagine anyone writing for me and it was so sweet of them\n... or ... or ... or ... or a group of photography overthrown breaking produce residents salmon arrive at this point as murder\nIt's true he wrote and directed a film it's called deemed Quixote and it but it's very funny is sort of a cross between Woody Allen and David Lynch it's very smart funny and a little bit surreal it doesn't have a distributor but it's a wonderful\nCreature [laughter] can tell us about the ... from ... is a foundation what is\nIt that it's an organization that's been created by Bob Marley family and they have a website That's going to be launching it's probably already up now so I encourage all of your listeners to go to the number one one love dot org because the gold leaders\nWon the ... all know number one love dot org and the goal\nIs to generate one million acts of loving kindness in the world\nAnd they want everyone to sign onto the website and let them know whenever one of these acts of loving kindness has happened that could be planted the garden it could be forgiving someone you could be contributing to charities it could be any anything that makes the world a better place\nAnd they want to keep track of it all so that they can log one million acts of love and kindness their partnered with the major charities including charity water to provide clean drinking water around the world\nAnd I'm a people who give large charity donations they're going to have the book is a premium and die if everyone participates in this and puts it on their Facebook pages and let's say friends know about it we can definitely changed the world for the better\nSince we are under the tyranny of the clock to want to thank you Jeff walking for a being a part of this program and Kim godly walk of course is be up and talked to said and author of a new book\nA Bob Marley the golden age of reggae and it's just provides a glimpse of some of the greatest stars or abet era a bed or including Bob Marley of course means ... prairie beauty Taj bunny will be three talked about\nJimmy Cliff and the whole school of other folks and again I Want to thank you both any last words\nIf you haven't heard black white men play that music [laughter]\n\nDon't care he\nKept in touch [noise]\nAlready to God [noise]\nI don't care who\nCan be bought [noise] Modi's or [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nIt well it must be nice to meet you in to just get up in the rain we bring this issue and then you can get [noise]\nIn and you're trying to make money\nAnd do you do that [noise]\nThat meant that\nThe\nYou're like man I think\nWe can get their own thing and ran for many years in young being thrown buggy [noise] Leo\nMaking you know we need to get a call ... ...\n[noise] brought in\nIf you want to\nEnjoy it you know\n\n[laughter] nah\nNah\nNah nah nah nah nah\nNah [laughter]\nGood [laughter] and\nWas a a\nA a a\n\nBut first quarter community\n[noise] [noise] in\nAfrica and I should do you\nKnow a A R T there's not a ...\nLittle uh\nManages to go away and so\nThe new words that are a gym no I'm a\n... a man and\nI was doing some saying no ... in\nA way to do some say and I grew up in ... and ...\nSays go up to do with a loved one so ... ...\n... ...\nAnd only the slugs gave me the plan\n... and the jazz man I shall\nDown the driveway and then they try to\n... the team to try to you was there and\nThen ... and and but I'm\nGoing to\nThe ... the ...\nAnd Saddam\n... Hussein ... through [noise]\n\nNow I mean on my windows to be the\nNext ... you know we do and I'm dreaming of a fun way\nFather was\nThere they use those existed these modern by\nAnd don't ... your ...\nThe news news well less\nThan\n... ... and he\nSays you know ... [noise]\n\n\n\nOh", "show_name": "no_show", "year": "2018", "city": "Middletown", "day": "25"}