{"month": "10", "state": "CT", "station": "WESU", "content": "[noise] [noise]\n[noise] [noise]\nMm Mm Mm\n[noise] that's Roy Moore for her rubbish\n[laughter] we're year governor is middle\nLadies and gentlemen welcome to most beautiful motors your view on this on the west side of wherever you are supposed to get you out here [noise]\nYou know you can't just kitty sitting up there what women jumping up and down is something the phone that put juice a much greater than it is well I Want to put a camera on you\nThat was the coolest swing and this is Dennis don't sweets winging your what you mean\nLord what was the velvet night what you get into a rubbish ... shall we you're listening to WFSU milk out eighty eight point one asset\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\nYou know I don't know how to do this in the new way\nA little better safe\nA bad day did you tell cascade\nThey don't make the bad\nDa\nDa\nDa\n[noise]\nOh oh oh\n\n[noise] we just heard a brand new one from the book how were the in the band played touch down from their new album\nDisturbing mouth before that number new one from lucky brown or played loan heart from his brand new album\nAnd starting to shut off was leclaire played cc left Bobby from their new album holy mood coming up next in the ... rule I gotta catch a fire\n\n\nBe done with the the due to a game that the I live in the beginning of the veterans are dry out that\nMuch but you know\nAnd how do you live with and you know being a little bit to get a job when I got the book and you know the only read the the the germs that have been around to interpret the\nSong that's been a little bit through hip hop in the mid ... gave it to be Frank came out to become even more bull for one another and this guy gets on the ground so both of them are bound\nTo not be that would be in the winter when a candidate for you to not be in the end of the games are God ready to read a few uh to\nYour own time coming to you know not in the nothing on the stand\nUp and yet we carrying the blame on the bottom and that's a little bit of my bed reading a poem John and he said that there's a bomb back to the new no special number if you don't know about this guy is always catch up by\nThe end of the weather in God\nChange it for you or not we can you do that\nTo be allowed to do a\nLittle\nBit so that people some people don't get\nTalk\nYour\n\nPin goes about ... you know you just don't know how many\nMonths because he was going\n\nTo go\nTo pick them up\nTo\n\nThem [laughter]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\nBetter\n\nThan\n\nAnd\nAnd better\nWell no that's\nWith it then\nThen they don't\nYoung\n[noise]\nI'm\n\nWell I'm just trying to play in the room so\nThe the\nYoung man and [noise] we may not be in the day the living\nThing again when you're reading a diary\nYeah the young children\nWrap them in a long and they give you a long time and good\nHere do while you're guilty you\nKnow and then went on over there and she does\nAnd she will he go to\nCertain age\nAnd by the time [noise]\nTo abuse the tree\n[noise]\n[noise]\n\nYou are to get into WFSU Middletown eighty eight point one after that\nWe just heard\nFrom him or ruin town I played around the fire from their brand new album freedom call before that the select or played\nDaylight which is the title track their album last year\nIt starting to shut off was the bamboo that played backfire for their new album like telling people just want to mention W E s use\nTwo thousand Eighteenth for community\nUber fourteen from eleven to four pm again that's Sunday October fourteenth\nFrom eleven to four pm and it's free and open to the public and it will be right here on the Wesleyan campus Beckham hall always a good time I'll be teaching me a hours sat around one PM\nSo come and say Hi\nAgain that W E s use ball community record fair taking please step back um hall Sunday October fourteen\nRight we're going to get right back into the rubbish room coming up next I have a new one from althea\n... [noise]\n\nOf day coming up next in the rub his room of a brand new one from Gerardo for ...\n[noise]\nInteresting [noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\nDid\n\n\n\nAbout\nLike to do\nAll of\nI\nThe end of the\n\n\n\n\n[noise]\n[laughter]\n\n[noise]\n[noise]\n\nOr [noise]\nThe ... [noise]\nI see we\nDon't we don't judge please go ... [noise]\nYou know\nA\nWho\nMore into the [noise]\n[laughter]\nIn\nYou know that you\nKnow the New York joined by you\nKnow\nShe she\n\nYou know she she loves\nIs your son should\nNot I don't know\n\n\n\n\n\nWe just heard from just sell mats I've played scared of something from her new album ruthless day before that was loose send this slim covering a classic northern stroll tune by to wander Barnes called you don't mean\nStarting the start off was Robert Walters twenties Congress are clean post human from his new album base to I'm going to leave\nYou with um tour track starting this next little mini set off and do well captain\n[noise]\nMm [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] Mm\n[noise] [noise] Mm [noise] [noise] [noise]\n[noise] no [noise]\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\nBut she's been getting that [noise] that ...\nThat was wrong with me [noise]\n[noise]\n[noise]\n[noise]\n[noise] that was due will cast in the name of the track signs tax that's actually coming from a great brand new compilation called roots garden showcase part three I thought it was going to have time for one more but I Do not\nDo that about does it for this edition of the rump is more Lewis officially signing off your tune ... W E s U Middletown eighty eight point one Afghan\n\nWhat's that I hear a record fair on what it means campus\nOh yeah why of course WBFO you eighty eight point one at them and you will fall record fair is happening Sunday October ... from a lemon I Am to four pm at Wesleyan back I'm home information about you can be found at WBFO UFM dot org\nOr on the w._b. SUVs count how many units are they filled vinyl memorabilia and cold or Jim how should I knew there not been kind of wizard I Can't turn back time\nWork why even hang out high alert [noise]\nHow many times in this happened to you and boy did they cycle keep all your friends and then get extremely popular with being a child [noise] go to U. S. N. dot org slash archived get information and all the ...\nThe [noise]\nThe mental health services [noise]\nConnecticut's department of mental health in addition to the website if you look at it or will public service down\nYou were a loved one is interested in learning more you can do that W. W.\nBack um hall fifty five will eat that when you go to our W E s UFM dot org website for more information\nPlease yeah\nThose models barricades broken hearted man let me know when you're in this world\n\n\nAnd they're going to run a ... you know more\n\nName you\nKnow when\nTo use\nPlease give\n\n\n\n\nNo\nNo not really that kind of my real name well it's going to be\nLine in the\nYear so to me\n\n\n\n\n\n\nDum la ... FM dial generally ESE Middletown\nShe should remember this was somebody armored learning all what Iran cruisers radio\nProgram maybe more than one em em nobody sees\nThe only way\nMe do you\nMay not know\nThe\n[noise]\n[noise] and I know\nThe cheese no\n\nThe auto\n\nMan I ain't no wrong she may have an air laughter and they are very hard to\nDo right Iraq cruises radio program let's go back to the early sixties and check out some sports season\nThe almost\nEvery man back and I think what's\nReally going to buy the air on the radio program do when you're in the middle now\nNot\n\n\nSo\nThey\nAllow\nMe\nWhy you got\nFind\nA\n\n\nWell he\n\nWas\n\nThe night the the Three Gorges dam\nEverybody likes to do the right\nI'm Donny Andrew how bright lifted up and down in the way he ... and saying Oh nice day\nWhy don't you want to hear my main selling ... yeah I'm In love with me now how\nDo you spend on food webs when I say a loud use uh\nA few maybe you believe maybe when I'm buying all the\nTime and selling you know and I know with them that beep or they may and I will be in your mind I Would do now and\nI'm selling you know\nI Am dining\nBad day on the line with food how\nDo you think ... when they are about um\nMaybe early days when I find\nThat I'm starting to know\nThat I Know that may or may man our yard\nI'm In love with you know I'm In love with you know I'm not only\nWe have some a great promotions coming up for some of the\nMind programming Iran W E as you and don't forget on Sunday October ... W E s you will hold its annual\nAll records where that is right from Lebanon am until more pm if you're a collector the vinyl you got to get there we have\nUm [noise] oh my goodness we must have fifty vendors and they're going to be thousands upon thousands\nRecords and CDs available from mall job [noise] severe collector the vinyl or if you just love music\nOctober for gene from Lebanon Amadou four pm at Beckham halls would revive willows avenue\nRight here in Middletown and now there's an early bird special if you want to call up an additional five bucks just what you get in an hour early\nSome of the vinyl you may just signed up\nBlind so check it out by going through our W E s U weapon dot org website\nAnd join us for the annual full records rare\nCourtesy of your friends that W E s boy I Want to have them a job or for the Sunday for eleven Amazon for the second of all the the Bible is that when you take a break come back and play some TV trivia TV trivia hats on [noise]\nWe'll be back after these messengers [noise]\n\n\n\n\n\nYou're listening to W. S. U. middle [noise]\n\n\n\nI'm Dr Linda ... the biomedical scientists supported by the American health assistance foundation I conduct research aimed at discovering new and effective treatments for all climbers to be\nCritical because more than a thousand Americans develop Alzheimer's everyday\nAt our website you can learn how to live with\nOr for free brochure on understanding all time is to say hey\nJohn what was that that was a pint of what a pain to comics\nThe radio show I W E s UFM in Middletown ... won\nThe great college radio station reform radio\nComic does a coach or radio show of everything and beyond today for greater some everything\nThat sounds awesome where the host search by myself and yourself me\nI every one this is Jim ... curator if you love the sound of rock and roll and rhythm and blues doo wop vocal group harmony be sure to tune into the wax museums show\nRight here I W E s U eighty eight point one FM in Middletown, Connecticut and W. W. W. dot W. E. S. U. S. dot org on the world Wide Web\nEvery Saturday from three to four thirty PM\nAnd this is Michael Benson hosted Seventy five percent folk we tune in on Monday evening between six thirty in eight to hear the best in contemporary folk music as well as blues jazz world music movie soundtrack\nDon't be fooled by the name is a lot more than just from\nRight here on listener supported W E s U eighty eight point one in Middletown, Connecticut [noise]\nCan take some good some American country blues bluegrass limit of Celtic cultural traditions\nBut it all together\nInto rebel a newcomer on Super Tuesday evenings here on WB is one of them in\nYou are now listening to any point one at the end W ... as your town your listener supported\nIndependent local public affairs and free form community radio\n... W E s you at the end dot org\nThanks for listening to your support that kept us going in Nineteen thirty nine\nStay tuned for more than unique programming you create [noise]\n\nOr a Jack of all of it alive in the studio how you doing October first I cannot believe that I even where it's summer dog and I just I just can't give up I think I wrote Australia deliver spring and summer out there you know I Can't take it here and we remote from out there no\nOil I guess I'll stay here and I will beret with all the rest of your short days and cold temperatures right and I just can't deal with a man\nOr we're gonna play some TV trivia I Want you to put on your trivia had now I'm going to answer your question if you know the answer you can make all they do sixty five Seventy seven or eight six six eight five Seventy seven hundred\nAnd you could win a beautiful cruisers\nRadio program coffee mug yeah you can enjoy it your coffee out of my ... every morning at\nOur our boys you were up ... [noise]\nFrom our W ran\nIn Middletown, Connecticut\nOn the on the trivia\nOr now here's a host of cruisers\nDonvan [noise] [noise] [noise] [noise] [noise] all\nJak building time to play some baby hey how ya doing\nIn the TV show green acres green acres right member that Joe\nOliver and Lisa Douglas who from New York City is a rural community what was the name of this ... this year is a town was hey Petticoat Junction\nBe mouthed pilot or street corner\nWhat was the name of the\nTown that I Love her and Lisa Douglas from the television show green acres moved to let it go junction mount pilots or\nWho are bill if you know the answer you may call it eight six six eight five Seventy seven hundred and you will wind up radio\nLa ... enjoy 'em term ... to ...\n...\n...\n... [noise]\nWell I'm On a\nOne year old ... ... oh\nNo just leaves no room\n\nLord Jim ...\n\n\nI'm a\n...\n... for for\nA dream Martin right here on\nLot of beautiful song that is we're way the greatest ads from the fifties sixties\nA lot of rare stuff as well right up until eleven yeah thanks for tuning in\nTo all my friends out there on the W. H. B. the Facebook page that\nListening right now all over the world on W. W. W. W. we asked us them dot org thank you very much we appreciate it give us a call at eight six six eight five Seventy seven hundred there's something you want to hear and I've got one of my favorites right now\nNa\nUh\nJordan the fascination once upon a time what a great song that is it can graduations do Linda who called in and play TV trivia and won a cruisers radio program coffee mug\nAnd let me repeat our question Linda got it right you did not want to come on the air and I'm okay with that\nIn the TV show green acres Oliver and least Douglas moved from New York City to this rural community what was the name of the big issues town was it\nThirty ... junction mount pilot or who's ... and Linda's jak it was ...\nAnd you are correct Linda you pick up a mug courtesy of cruisers radio program thank you so much for playing sixties TV trivia right here on cruisers radio program we appreciate it very much\nWhat we got the wrong one sitting this one out your window let's see if you remember it okay and we go\nI Want everybody to make the although it ready raising all I guess I came in New Orleans [laughter] I'm not here we go all the all of us we ... we knew me well I live in a way for me laugh\nNow a reason why he Manhattan is ...\nHow all the legal to go [noise]\n[noise]\n[noise]\nNot even in the ...\nYou are my wife Rena we do a job when\nHere is about a very good to be ... back in the bar\nLot a\nLot of my head and the\nYou um are you um are you a\nLike a\nYou are\nYou are my view\nWas a two or three but\nNo charge God I'm so glad\nMad and bring the money\nNow well below\nWere you um are you\nKnow that a a word or two a day no\nYou are you\nOne to the\nRam and guess what we got to do right now\nThat we've got to plug the record very yet again and why not it's a great event the W E S you fall community record fair takes place Sunday October for dean from eleven AM until four pm\nAnd this is one great event if you are a collector of vinyl or you just love music you can find all kinds of music every genre and believe me it is reasonably priced you'll get it for next to nothing\nIt's a matter of fact we almost give it away so you just got to get in there and dig into those piles of records and figure out what you want the oil you got to do now look if you're a collector\nAnd you're not a vendor there then you just pay us five bucks we'll let you in at ten AM and you can zip through everything else that zone\nThat sounds pretty good to me\nAll right it is October ... teams Sunday it's begins at eleven AM however if you want to cough up five bucks\nYou're getting in in our early at ten AM and again you're going to find the Mona Lisa of record well before somebody else gets their hands on and so it gives you a one\nHour to go through everything visit the vendors shakes demands we're going to have DJ spinning records it's just going to be a great event that Sunday October fourteenth the mega mall fifty five will use avenue right here in ... Connecticut\nFor more information go to our website ... W E s U S M dot org and man I tell ya if you love the vinyl this is a place where you\nThere are thousands and thousands of records I Know because I ... a lot of them down there in my truck as do many of the volunteers here a W E as you and there are\n... you know this sells out with vendors every year\nNew vendors want to create we just don't have the room for them that's how many records we have the all these huge you're going to be entertained it's just a great place to meet old friends and\nSnake I don't know where I'll be I'll be blowed around somewhere would come over and say Hi to me and um you never know you're going to find something you love believe me the only a few bucks in your pocket because\nAll the records are very reasonably priced especially the ones that the W E S U booth that's right\nSo check it out October ... Sunday Sunday Sunday at that come home\nFrom eleven AM until four pm\nIt's the whole community record where you're at W. B. S. or ...\nNa na na na\nStand on\nUm [noise]\n\n\nBang bang\nBang [noise]\nOh no\nNo I'm not at all yeah the\nGenie is from Long Beach Long Island and then we had a three year career by single broke up a soon after Nineteen fifty eight\nA\nGo home and then my then\nWhat we do one night and\nThe minute they leave and you know me I live in the lunchroom though man\nLater than men because they\nDo play a\nLot of women regulators are too job will be a happy man I'll tell you what there's so many people that\nNot happy with the jobs report the regulations revolve around always good news [noise] the excellent [noise]\n... ... ... ...\n\n...\nA\n\nDay\nMan oh man\nThings for the day\n\n...\nJobs a lot about you know my cat\nDa da\nPaying them you know\n\nNo not bringing\nMe and I know\nI'm\n\nI'm a little\nBony\nKnow my phone a bad\nKnow not only that\nThey might not\nBe\nAll right the excellence and you are my only I wouldn't next week Jimmy ... will be sitting in for ... ... ... and I'll be away on business but he'll be waiting the oldies fifth season sixty nine\nThose ... ...\n... oh well never mind\nKnow when I grew up on the radio program right but it was written by the way they\nAnd a really bad day you\nI Do they do that and I know a\nMan who claims\nBe\n\n\nA um di di di di di\nDi di di di di di di da da da da da\nThe model\nBy uh\nBy a man and I dont know run on the\nAnd I'm now\nNot\nAt all the liquor that's a nice ... isn't it or do they want to hear the bowl so\nYou are going on and on\nEvery time we me and every thing for me to enter the I'm\nThey can carry a\nDead or\nDuring the day\nKeep me in your car\nNever let a ...\n... in the mid ... you don't think they may\nThey give me a lot\nAnd you're a\nInjury or Libya\nR I or you know before you were saying they manage to stay\nAnd Dan my\nFriend and\n\nThen they'd be so ... ...\nI Know you'll be monitoring\nCan tell ya\nNa na na\n\n\nAll the bugs there no I got a call from Jim ... who said hey if you like that you're going to love the bows magic down on a request that won Nineteen sixty six I said okay I've never heard magic town ... right\nThey said\n\n\n\nTotal praise airs every second enforced Sundays from four to five thirty pm\nDr Linda ... a biomedical scientists supported by the American health assistance foundation I conduct research aimed at discovery new and effective treatments for all climbers disease\nIs critical because more than a thousand Americans develop Alzheimer's everyday\nAt our website you can learn how to live with or care for someone with the disease called one eight hundred for three seven to four to three or go to ha F dot org for free brochure on understanding all climbers to do [noise]\nI every one this is Jim new curator if you love the sound of rock and roll and rhythm and blues do our vocal group harmony ensured a tune into the museum show\nRight here I W E s U eighty eight point one of them in Middletown, Connecticut and W. W. W. dot W. E. S. U. of M. dot org on the world Wide Web [noise]\nEvery Saturday from three to four thirty PM [noise]\nFewer now listening to any point one at the end of you as you missed town the listener supported\nIndependent local public affairs and free form community radio\n... live at W. E. F. U. N. dot org\nThanks for listening to your support that kept them going in Nineteen thirty nine stay tuned for more than unique programming you create [noise]\nDelivered an oath to hear on the east coast good evening\nDirty and I was alive and kicking the guard things I Would hire and writer on eighty eight point one of them down\nYou know or even I\n\nWhether they\nCan go\nNow\nThey're made\n\n\n[noise]\n\n\nNo no no no\n\n[laughter]\n[noise]\n[noise]\nThe ladies and gentlemen jak Doberman has left the building\n\nWe\n\n\nOh\nLet's do a lot of\nNot\n[noise]\n\n\n\nThere's all this probably suspicious mind from Nineteen sixty nine with\nThe number one that's going to\nFix me are freaks me out or fix me already about fifty\nFive seconds from the end it starts to fade and you think it's over and then just picks up again in a vintage shoes off and they'd jot again you're listening to it to the sixties and seventies with Jimmy V. an eighty eight\nPoint one of them I'll be here till twelve thirty we're gonna play name that tune a happy October everybody\nWho's on well man windy road\nMan\nSeem to grow be for\n\nNa na\nHorrible in drought Carole King from Nineteen Seventy one here on hits to the sixties and seventies we just got a call\nFrom Harry from rocks fall who said she's a regular listener of the show here and the um the going tonight or name that too so on and uh she was correct that she got five o'clock world by the boat so Johnny what do we have\nAll right it's a nice winter picked up a beautiful turnout ceramic coffee market within Jimmy sees it to the sixties and seventies logo on it\nProvided without regret that at all\nYour friends that shouldn't be the tip of the sixties and seventies\nAnd W. S. U.\nBack to use the like Johnny in a congratulations for Terry from rock\nThank you for playing tonight and thank you for listening and here's the ... just on\nThe boat ... walked world I ... wandered\nThat they found in in my brain while\nThere by\nYeah yeah and my mind\nThere's any fans will be the drew Carey stick and the drew Carey show that was back in the nineties or one of the seasons of a sitcom that was the theme song and they the whole our cats choreographed a dance\nTo that so that's one of the first opening show the of the season that was the other team and they I thought they did a great job you can you can see it on YouTube if you put on five o'clock world drew Carey show\nYou're listening to hit to the sixties and seventies don't forget every Monday Night at nine thirty jak solid and with cruisers radio program right here on eighty eight point one of them\nIf you tune in next Monday Night however you'll get cruisers radio program but\nYou're going to get Jimmy V. filling them because jak nope\nThis climate I Know it takes a lot of vacations but this time he's on a business trip now yes the besides all the big box he makes your a W E su he does have another job so\nI guess he's a job is taking them away so I'll see you next Monday Night at nine thirty four cruisers followed by hit to the sixties and seventies with Jimmy zooming\nHere's Dave Clark five [noise]\nAm and\nIn [noise]\n\n\nThe\n[noise]\nThe G sci fi Rob Nineteen sixty four\nBits and pieces I W E s you hey they're hit wines are open if you want to call me in a request just dial or or eight six six eight five Seventy seven hundred and we will ... will play what you're saying right here at eighty eight point one at\nBat ears Glen Campbell try a little kindness nobody we have\nTo stop and say the\nBut you got to get a\nI'll Try and get\n... or ... or\nAnd the kind that show\nOn this\nA bad\nThirty\nProtest on\n\n\n... from Joe ah pet clerk and I couldn't live without your love a if you're up late listening to watch or listen to this it's October now and you know what that means\nOctober is the time for the W E S you record fairs so if you are you interested in records okay vinyl mainly but there's everything at this record or their CDs there's\nI think there's eight track tape there's cassette tapes there's help he's forty fives on vinyl there is a many many vendors idol there's got to be twenty five thirty vendors\nAuthors merchandise you can you can purchase a W E s U T shirts you can even purchase sixties and hit to the sixties and seventies coffee mugs okay so if you can't seem to win one you can purchase one at the record fear another record fair is\nAt Beckham hall right here on the west wing campus if a from a Lebanon am to four pm on October fourteenth mark that down\nA Lebanon am to ... pm and I think I'm OK pay 'em five bucks or something you can get in a tan and look over the selection is before the the crowd gets to 'em so uh\nThat's eleven to four October fourteenth the W E S you record fair right here on the Wesleyan campus that back um all don't miss that because it's only comes I don't know twice a year maybe\nI think so okay so you're listening to hit to the sixties and seventies with Jimmy Z and now here's Lesley Gore [noise]\nOf law bought one\n[noise]\n\n\n[noise]\n\n\n\n\nGet there early eighties [noise]\n\n[noise]\nThen then the na na\nNa na na\nWas regarding the look of love nobody we asked you hey I can tell by the clock on the wall\nIt's time for up to take a station break we got the message is coming up now if you'd like to hear something the request lines are open give us a call at eight six six big by Seventy seven hundred you can call during the break we'll take down your request and we'll\nGet it up for you soon but don't go away because coming up after the break we have the Mike Curb congregation mercy and Ronnie Dyson so don't go to sleep yeah I'm Sarah\nI got behind the wheel I got a cat or all ran across the road world ran across the road I sure did the worms I hit a guy the tabby jak guy I Wish I took a cab thank goodness I take a cab\nYou have the choice to save a life by driving is drunk driving brought to you by the department of transportation and the and\nAnd my name is Cindy ... we're retired and this is how we live United\nWe decided to volunteer with United Way at our community free health clinic\nUnited Way is how we contribute because we know our time and money are going to the right place\nJudging by the think he's we get at the clinic I'd say we're doing the right thing with our retirement to retirement Cindy Thornton we volunteer in our community free health clinic we don't just wearing the shirt we live in gift advocate volunteer live United ... by United Way in the ad council\nRanger station yeah I'd like to report it bears setting in the forest uh-huh one second I'm having a smoke next thing I Know a face to face with Smokey Bear and he told me it only takes one spark just started wildfire\nJoe nine out of ten wildfires are caused by human I had no idea why Smokey famous near and dear Smokey on if you see someone in danger of starting a wildfire step in and make a difference to you by the U.S Forest Service your state force during the ad council learned more Smokey Bear dot com I only you can prevent whoa\nThis is willy Nelson from normal for Thirty years no one has provided a voice for the millions of Americans who smoked marijuana responsible in Canada medicinal use of marijuana it's already legal now the Canadian government has announced that they will soon start arresting marijuana smokers [noise] we can learn much from her neighbors to\nLearn how you can contact normal W. W. W. dot O. R. dot org\nJohn what was that was a pint of mine on what part of the comics\nComic is a pop culture radio show of everything and beyond for greater everything\nThat sounds awesome were the host search on myself and yourself that you\nJak stolen from cruisers radio program heard here on W E s you idiot on FM every Monday Night between nine thirty thirty PM we've got great music TV trivia and this is what the critics are saying about our program\nIs now dumber\nWhy should you be the exception June in Monday Night nine thirty to thirty being poor cruisers radio program right here W. S. U.\n[noise]\nWe as you present America kind of music from Nashville and around the world I'm sure Boston host among focused much music known artist dog smile\nEmerging artists\nYour song\nAnd great songs yet to be discovered\nI'm focused about the second in Port Monday's of the month at ... pm on eighty eight point one W E s U little time [noise]\nFewer now listening to eighty eight point one at the end W. S. U. Middletown listener supported\nIndependent local public affairs and free form community radio\nAlso they'll live at W. E. S. U. at the end dot org\nThanks for listening to your support that kept us going in Nineteen thirty nine\nThey tuned for more of a unique programming you create [noise]\nNew Years just for you\n[noise]\nI\nMontana I\nThe bomb and they don't try to stay around me but I Am by then and my term on packages that are bad\nAnd I thought\nBrand that that I\nDa da da dum\nRented a bond that God\nSong to ...\n\n\nYou are listening to W. E. F. U. middle child\n[noise]\n[noise]\n[noise] oh\nJoe Millionaire and\n[noise] they're fun [noise]\nMan I\nWould not be\nLittle bit and\nUm my ...\n\n\n\nRain falling\nA\nDo and what you\nFather\n\nAnd raindrops hey you're staying up late with us give us a call will play what you want to hear it six oh six they buy\nWell polls radio hour with DJ ... DJ hope will they will be providing irresistible talk show content experimenting with music and most importantly\nHaving bonds but you don't want to miss that comes right up here at twelve thirty an eighty eight point one of them join them in their quest to happiness right here I W E s U [noise]\nI\nYou go when was the cause I Know is [noise]\nBecause you know the [noise]\nKnow broken the law because we love the ...\nWith a knife and try that could be no\nWhy\nYou know I mean I think you'll often he's sweet [noise] why because I Know\n\nSay I'm your special treat why it because you know the [noise]\n\nWe know the next year so that you know and [noise]\nThem too you know only a\nKnow he does you know we we\nFound a new topic last year so much you know and my ... I\nWe can do really well you\nDog called why by yet who Anthony newly right here on WBFO your where else are you going to hear a song by\nAnthony newly Raleigh here\nWhere the music you won't hear anywhere else nobody we asked you what eighty eight point one\nHere's Carol will you love me moral\nEighty eight ...\n\nYou and the na\n\n... ... ...\n... ...\nA\nBe me a ...\nWhere do you do yeah\nToo I'm\nThe blow up\nNa na na na na\nI meet them all\nThe\n\n\nReady in the dreamers are you are made for me I'm W we as you would get to the sixties and seventies with Jimmy V. I'll be here for a few more minutes and uh we got a couple of more strong\nYeah man it gets more narrow lanes taint got down to date of fair trade you know they go\nLot better than the man that uh\nI don't care how much money I gotta tell ya I got a big it drag you probably\nAll the ... man that\nUm [noise]\nBetter way\nTo get bored\nGot down to a big fan\nSo they go\nOff duty ... man did um [noise]\nTo get more now when\nI think they\nKnow they go\n\nBuck stops the letter on do you we asked us to the sixties and\nAnd I did and\nIn order to\nIs better than I\nBan on and on and on and [noise]\nOn and\nManner [noise]\nOn and on and on and on\nOn\n[noise]\nThat's el hurting job out here on W we ask you a like to thank everyone who called ...\nSolomon nine thirty and then followed by hits to the sixties and seventies right on the Web and so I'll see you next Monday Night they tune next\nFor DJ ... R and D J ... they will be providing irresistible talk show ... than experimenting with music and most importantly having fun so stick around don't go to sleep yet they're coming right up next on WB overnight everybody\nWow\nWow\n\n\nLesson dream was asking the black\nMy\nTo me a\nA while we\nWould you go\nJust one thing\n\nKnees or how\nDo you\nMean you know\nOh listen during ...\nMay die a\nYou know way in the V. now\nWho do you\nDo you know I'm ... oh please\nYou know do\nNot my\nDream and then sleep\nOr a\nTo ... the\n\nWell I think\n\nWhen you lose your\nTo ...\nAnd you're right\nTo carry those boys I Know I'm not going to lie to you know\nNo\nWhere are you calling from ... from\nBoom in the mid ... and they\nMe\nGive me some\nLending we don't know what the memory and bringing them back bring diamonds and\nWhen I'm there you know I don't buy the raid in\n...\n\nWork for three years older than I should go to the new\nUm oh\nNo I\nThem na\nMaking so many people\nMm Mm [noise]\n\nKnees\nGive me another you know\nKeeping me yeah [noise]\nDo the men\nDo roller rink made died\nStudy yeah [noise]\n\n\n\n[noise]\nI\nWas in the shade\nRight and so there is\nPiece of the people on there and be more about the money will\nA game but may not know where the ah the ah that can be done to blow\nThat uh but all the dog knew gay men\nOf the ... a ... inch and a a a bill or anything about it and they may\nDay and you know about the\nTo get in front of the story and a middle\nDid do good that he or she actually got a few\nThe one\nThing they do more than\nJosh about yeah about\nGuy that made it out and\nAdage that yeah Adam\nSandler I had\nChild now\nDad out\nOn down [laughter]\n[laughter]\n... [laughter]\nTo have any [laughter]\n\n\n[laughter] [laughter] how\n[laughter]\nDi di\nDi\nDi di di di alley cat\n[noise]\n\n\n[noise] [noise]\nMm [noise]\nAnd [noise]\n\n\n[noise]\n\n\nUh\n\nA little girl\n\n[noise]\n[noise]\n\n\n\nLa\n\n\n\n\n\n...\n\n\n\n\n\nGoing on and on\nLive\nIn order to get\nWhen\nTalking to\nUs and\nFrom ...\n\nI'm\nA\nOr not really\n[noise]\n[noise]\n\n\n\nHello\nHello\nWelcome back to WC middle ... one of them this is the tail end of our our ...\nWe thank you all nine of you know a very much for coming in for the ride ... thank you so he she they just you know PSA there but um we got a brand new ... ... ... and all set up a DJ that's pretty cool ...\n... I ever again because that was humorous song ... stay tuned for more on WBFO thank you for\nI mean and\nHe\n\n\n[noise] well the smaller breach streaming live W. W. W. W. dot joined free [noise]\n\n\nPraise airs every second worst Sunday from four to five thirty pm\nDr Linda ... a biomedical scientists supported by the American ... foundation I conduct research aimed at discovery new in a second\nWebsite you can learn how to live with or care for someone with the ... the call one eight hundred for three seven to four to three or go to AA J. F. dot org for free brochure on understanding all time has to do [noise]\nYo yo\nWhat's up L. V. C. W. S. U. ADA more laws\nOf the you know than\nYou know everybody there right now\nThose all those\nEverybody that won't do that\nEverybody on the no\nYou know that everybody on the person you know\nHuge red there'll be raised a\nRing February dog [noise]\nDone on the edge\nDanielle set out overnight you know and um\nWord out to everybody at all but\nEverybody act or a\nOn everybody out the red cross\nJ that just wherever you go and they [noise]\nYou were were hijacking the airwaves one with the music in the news [noise]\nNow read in the ... [noise]\nWhen you set up to ...\nTo bring it out there I'll watch the street you know and\nEverybody out there working there that you're not a bad shot up to the United way non profit organization winning all\nEverybody ought to market yourself to be a problem and we're going to be on the order [noise]\nThey wrote the book by\nMaybe that county [noise]\nYeah it is that what you may be you know up in a place man you know what I'm saying we are W E s you you know what I'm saying that I was out there a body out there you know even that everybody can see that on your own you know then I Want to shout out you know don't stay sabotage\nEach other out you know I'm I'm a big Ben you know and then the bird you know what I'm saying [noise]\nGet out right now it's raining but now you know like [noise]\nWhy don't you know we walked all the way over here from the main stream\nThe root cause or anything like the world was all [noise]\nYou know they go like the like [noise]\nEarly before\nA real a real\nLate night is\nThey set out to you or whatever you do and what you do to change all the bad\nMen would wake up\nYou have a good read so I have you hope you have a good day you know what are we going to the music is W E s U eighty eight point\nOne middle\n\n\n\nThat's right that's right whatever you're doing you know they do go away that you know what everybody else is taking you know they were you\nKnow go go go go watch you know go go go watch you know go go go go watch you know go go go go go\nGo for what I wanted to drag out the door when do we like to get done just but we usually do when they do several like its do tomorrow I'll be coming down the middle man asked me how to wage just break it down break it up\nGo go go to watch you know go go go go go go go go\nSee no doubt he applied to try that can either my belief that comes up in a place to be L. P. S.\nKnow to wake you up in a more time just like stuff like that you you got to have the sort of\nLittle even rape boil it down when you walk back but never have the bill Bolling never had the boiling stalling men like keep it moving in adult life getting like sometimes the bill that you have no body did she wants me to be the ultimate and the\n... W E s U non profit organization still\nGoing through like that do not even way go go go go watch you know go go go go watch you know go go go go go go go go for what\nE S U eighty eight white wine\nWhite women they don't\nGet it done they don't they they don't even try to do the sound of the games come back and then like\nAnd the other one real world or something like that I\nIn a bill you know they don't there\n[noise] no way we bomb\nI tried to get everything you pay for the teachers do got to do more\nOn science artist I'm about to well now\nGet to that like I was in a chair and stuff like that a person there I've got to go back years but my parents\nYears ahead of me and the games ... point one\nWay to the left you battered around\nAround to the they do have in your room\nWe do have your role strange job paying them you're wrong that pay do have a role that don't have them you're wrong and why we\nHave your rooms they don't have to do was\nDo we have in your role they don't have in your mind they\nDon't have your state do you do\nYou know well yeah they got to give the back of your love for the job every time you got this can have your own town to like get the bill and every time we go which can be thin and every time we don't really care about the hate us they don't really care we still put like ... but\nBaby yeah yeah yeah they'll spend all your money and Everytime getting caught up in the game and neglect everybody just by nature the commercial everybody want to do the latest they get caught up in the phone and they go understand don't get caught up in a non spinach and what not to get to it every time he got his whole family and balance the only way to me and if\nIn every time you got this bill and every time they can do like that and putting up a resistance Everytime I just moved back in ... would you be able to understand that but they've been real you got to just cut his door\nIt's been a building by the time she got against call friends\nThe non stop ... living in the past ... living in the past they move forward resident but the president would give the president but if the president and the\nPresident began the president but you're not living in the past I'm living in the past\nPresident of the getting the president but they're not going to hang up the president's budget that's all you're hanging out the president did not living in the past well living in the mentally spiritually mentally and Everytime you just get it on\nAnd if they feel like speaking about individual you don't understand me but up first on women's rights human rights\nTo be able to voice that they don't want to stand for children's shows they they don't understand yet brush them fight without its head up or do you watch that they don't understand the times parents got rather than the president but the president did get\nThe president would get the president to get the president did stop living in the past\nThe president if if the president of the bitter bitter about living in the past I've\nTaken the always blaming\nThe father figure it was not there and every time he just got it all the time the around with your own seek a defined that wasn't there and Everytime\nHe paid the person they don't understand the computer like that um there's like that but not but they don't understand me it how we just had many up every time we could do like that with the tip of design blindly blind to forget that now that go against the grain they don't understand me\nNow did you hear on the radio without one day and every\nAnd cheese that be on a low they don't understand it from them that bill for the fine art as comfortable like that puts you into it's not what they can be hard to the ... the only one that gets to be part chart song [noise] you'll\nSee the enemy heightened in the eighty eight points\nYeah it's not we bought it how we ... yeah you know what I'm doing is saying that not everybody I held them down over the provider for that everybody everybody that supported up the Afghan died out to put it that way to\nKnow love but the people that have um said it is so freighted that's right we made it inside out to put it that way no doubt but the people that have um said in the fate it [noise] yeah this is Chad all captured\nFrom ... to that being all the way now\nThan we do the last word and fall and for\nThe call came in ... all the ball in a\nWhile but chasing than but much change may be tipping map for keeping the tennis team that wherever I go people\nSpoke when do the same thing I just wonder how cheap it moved to ... dang man\nVote with I don't want to keep\nBody needs to go to\nHelp no doubt we would mean now we finally and it feels good to know that the dream was rare\nFor rare that I wrote that way no love for the people that hated I'm jaded to faded that's right yeah we made it down to put it that way no love for the people that hated I'm drunk yo I'm sue faded a [noise]\nW E is one\nThat does everybody on the no\nEverybody want to be you know what I'm saying you know what I'm saying that everybody would another\nTo make me then you know what I'm saying [noise]\n[noise]\nI'm I'm all over pool but\nYeah I\nGot up to the pilots records yeah now the item law got up to the moon rocket killing you know there can be you know\nKnocked boulevard\nBoating all day every body yet shut eye liberal\nPluck your beds out there you know what I'm saying so yeah all\nBaldwin three reports that'd be [noise]\nThat are gonna be a Allen el ... and the\nThe heavy TV where you\nWith a baby a\nYeah that that that Pepe as you know then we had to go out\nYou know what I'm saying how we got mad but maybe we're on the airwaves and I've been going on you know you can actually yells\nYoung man wants to buy my mom lives\nHad me pick it up my\nThe premise that would be\nGood enough but at the back almost ...\nAnd they don't understand you owe me an lp is on but it's like it's\nGot a bill over the negative energy you got to balance and every time you know sometimes you got to balance and lie down like balance I die down to ... ... ... ...\nBe in escrow Gen our loews down\nEverything happens for reading everything that's\nMost\nThe word out to be give me\n... all these great to be prepared for by the triple it don't matter has twice\nThe rate now latch them personally rip the magic that how does that\nIt now represents we're ready to be somebody that ... people maybe those rates because\nLearn to deal with getting rid of them represent them\nThey just want to get her by telling you they just want to get her by that time kept always want to try to ACT UP Everytime you don't want it got to be just making it more time the gang banging on bake a game and you know they can just take it over time you don't want to say anything to shine it every time trying to get like all\nMy life they don't understand what type of me now we got it on ... will get shooting them maybe kind of\nThey don't understand that a good thing to do a big big on the line and we just don't want to just get it\nOn being gone now you know it was a\nA a da da da da da da da\nDa da\nDa da da da da\nDa ding a man named a new I mean I'm you know I have\nI got the remedy they don't understand them when I'm at in the Senate he what else the ultimate and it gets that not enough they talk with a bucket college get sick when the last year we don't want to tell them that failed and every time we always speak for the way that they don't want to just sit down to deal with it\n\n\nYou're listening to eighty eight point one F. M. W. S. U. Middletown ... gr if you value reporting in coverage of current events rooted in racial and gender equality stay tuned for rising up with ... right here on WBFO you [noise]\nKPFK Pacifica Radio in Los Angeles this is rising up what's going on and I'm your host bono legal hunger or online or rising up with ... dot com and today's news headlines the New York times reported on Monday the White House has now expanded the school but the FBI probe into Supreme Court nominee Brett Kavanaugh all\nThe FBI investigation was initially defined as being very narrow scope and with a strict one week time limit while the time limit housing\nNicholas friends and classmates from judge Kavanaugh past provided ... portraits the nominee and his younger days I Do a good natured student incapable of the alleged behavior or stumbling drunk ooh could easily have blackout and forgotten inappropriate behavior\nAt alcohol stoked parties end of quote on Tuesday reports emerged at the FBI has already interviewed Kavanaugh's friend mark judge who was implicated in some of the allegations\nSenate majority leader Mitch McConnell got on Monday but the full Senate vote on Kavanaugh would proceed at the end of the week\nAnd so on and make it very clear or Tom are ... structure\nHas gone through a close\nJudge Carlos ... we're considering it here on the floor\nOr Richard program will be voting\nThis way\nThat Senate majority leader Mitch McConnell on Monday saying they will be a vote on Kavanaugh this week McConnell is focusing his effort on the three Republican senators most likely to vote against Kavanaugh Susan Collins of Maine Lisa Murkowski of Alaska and Jeff Flake of Arizona\nSenate minority leader Chuck Schumer relate the Democrats' strategy in the wake of Thursdays harrowing Senate Judiciary committee hearing\nAnyone who watch the Judiciary Committee hearing on Thursday\nShould have serious if not qualifying doubts about judge Kavanaugh its credibility in independence [noise] qualities we should expect in any Supreme Court justice\nThat Senate minority leader Chuck Schumer turning the cabinet lacks the temperament and character free Supreme Court justice\nSchumer is worried about three so called red state Democrats voting for Kavanaugh Heidi Heitkamp of North Dakota Joe Donnelly of Indiana and Joe Manchin of West Virginia all three are hoping capitals complete drops out meanwhile a new poll\nTwenty nine percent of American women think the cabin or should be confirmed NBC interview Julie sweat snake a third woman who was made allegations against Brett Kavanaugh here are some excerpts from her interview\nHe was very aggressive a very sloppy drawn very mean drunk or I saw him a go up to girls though paw on them try to you know get a little to hand they touching them in private part uh I saw him\nTry to shift clothing I saw him Push Girls against wall or he would pretend to stumbling stumble into them and knocking into a wall\nHe'd pushes body against their he would grow them and and your declaration you describe Brett Kavanaugh and his friend mark judge standing out diet paying them stand outside the door yet with other voice\nThat Julie sweat snack who says she was gang raped after being drugged at a party the cabin on his friend mark judge where at\nAfter today's news headlines we'll dig deep into what law enforcement agents could explore in the FBI probe including the lives of cabinet appears to have told last Thursday my guess will be Marjorie cone professor emeritus of the Thomas Jefferson school of law\nAnd other news on Monday evening President Trump gathered his cabinet for press conference outside the White House the lord of the new trade agreement that will be replacing the decades old north American free trade agreement\nThe new deal is to be called to the United states and Mexico Canada agreement or US MBA Trump said quote it's not NAFTA ... it's a brand new deal also at the press conference Trump mocked female journalists and then answer her question on the trade deal sure\nShe's shock that her picture letters to the show [laughter] I'm not thinking that that's over there and are you going to say\nLimiting the scope of the FBI investigation\nWhat is it has to do is read I don't mind to answer the question but you know what I'd like to do the tree had to do with the other headline in the news which is the candidate and I know but how about talking about trade and then we'll get to that will do that a little bit later think anybody ever or trade deal will pass through Congress or a I think so but you know if it does it we have lots of other alternatives but I Do think so I think if they're fair\nWhich is a big question but every spare on both sides are Republicans love it\nA industry loves that our country loves it or if it's fair\nIt will pass so I think it'll pass usually really usually because it's a great deal I mean they have to pass as one of the worst deals I've ever seen inconceivable that it was made fair question any other questions Hank right I'll get back to your earlier that I'd like it\nThat Trump speaking with the vagaries of ABC News at a press conference on Monday in a manner that shocked people he later we'll such sharp words for CNN reporter Caitlin Collins\nAccording to the guardian newspaper quotes somewhere in the Republican the nerve center strategist we're probably striking out several more deep that hinge on the support of suburban women\nAmazon made a surprise announcement on Tuesday Morning but it was raising its employees minimum wage to Fifteen dollars an hour\nI first yeah and and the change takes effect November first and applied to fulltime part-time and temporary workers Amazon says the Fifteen dollar minimum wage will benefit more than two hundred and fifty thousand Amazon employees plus a hundred thousand seasonal workers\nAmazon CEO and founder Jeff ... who is the world's richest man and who's been the target of fierce criticism for under paying his employees said quote we listened to our critics thought hard about what we wanted to do\nAnd decided we want to lead we're excited about the change and encourage our competitors and other large employers to join a [noise] a number of activists\nA plan to weaken fuel efficiency standards for vehicles by letting states write their own emission rules it looked to be the only such public carrying on the rule change the political ... played was organized by the group people action with activists wearing T shirt that read stop killing us they chanted onto the three EPA representatives doctor meeting left\nIn a statement the organization said we refused to passively while the Trump Administration is making decisions that will kill poor people and people of color\nIn immigration new federal lawmakers from both major parties are crafting a new bill banning the arrest of any undocumented immigrants that come forward to sponsor and undocumented child\nImmigration and Customs Enforcement agency was under fire for arresting dozens of parents and relatives who showed up to sponsor children in the pension\nAnd there have been ice raids happening in cities across the country in recent days from Madison, Wisconsin to San Diego and Los Angeles in California and in cities in North Texas Oklahoma Michigan and Ohio\nOne ice officials in San Diego claimed that the hundreds of people who have been rounded up and arrested are quote coincidental I'm not part of a coordinated effort\nIn international news the deadly total of Indonesia earthquake and tsunami is growing days after thousands of ... buildings collapsed from an Eighteen to twenty foot wave with a total of one thousand two hundred and thirty four deaths\nThe numbers expected to rise even further anger has built up along the coastal village of ... where the two nominees hit hard and where people are still waiting for the central government to respond with eight and rescue effort\nPresident joke or widowed has asked the international community to help and ten nations I'm already offered to do so but global aid maybe more long term than the short term help that are desperately needed\nThousands of people are still believed to be trapped under rubble five\nThat's the more than two hundred thousand people and that does it for our headlines today will be back with the rest of the show in just a moment W E s U Middletown\nUsed join us for the W E S U eighty eight point one FM two thousand Eighteen fall community record fair Sunday October fourteenth\nAt Wesleyan fair weather Beckham hall fifty five Willis avenue Middletown, Connecticut the fare free and open to the public\nFrom eleven AM to four pm dozens of vendors from across the northeast will be selling tens of thousands of new and used records CDs cassettes music memorabilia and more with the W E S U booth for one dollar records CDs and W E s U merchandise for sale\nThey're not limited if the White House is not micromanaging them they can presumably do ineffective investigation and wait Don McGahn um who is very partisan\nIs the point person for the Kavanaugh nomination and also is working with the Senate Republicans on the Judiciary Committee\nTo formulate the parameters of the FBI investigation but fortunately the Democrats\nWho have grown is fine and the last couple of weeks in my opinion um are pushing back\nAnd even at and saying look if this investigation is limited or circles scribes um it it is not going to be effective now Jeff Flake who is the senator Republican senator who turn the tide 'em by on friday\nBy saying that he would vote to send a Kavanaugh's nomination to the full Senate floor but he would not vote for ultimately to confirm Kavanaugh unless there was an FBI investigation lasting one week and that's because\nThe Democrats continues and they are questioning on the Judiciary Committee to talk about this FBI investigation to try to pin down Kavanaugh about whether he would support an FBI investigation and every time they ask Kevin ... he would support\nAn FBI investigation cabinet gays what we call a non responsive answers saying the for people who were\nAt the party or allegedly at the party all deny that had happened well that was missed\nStating the evidence because the evidence is shows that those four people said they had no recollection\nOf the assault not that they ... they they denied that it happened um a jet so Jeff Flake um was pressured he there was that uh that iconic view of him a captive\nAn elevator beans I'm being challenged by women who had been victims of sexual assault and he came out looking very pained a and I think he may be running for president as well he's stepping down from the Senate but he wants to look fair and so\nHe said that he would not vote for cap the Kavanaugh um confirmation unless there was this investigation now on Monday he was interviewed on television and he said there should not be any limitations on it it should be an effective investigations so that that to me that he is supporting the calls for\nA by the Democrats to make sure that this investigation is not short circuit it it's not\nJust stay perfunctory one week so that than the Democrats who were on the fence about the confirmation can have political cover saying all the FBI did an investigation um and then there was a piece in the New Yorker that talked about these three witnesses that I mentioned who have been trying to\nContact the FBI who are who have\nApparently very relevant testimony to get to the FBI who had been unable to contact the FBI hopefully that New Yorker article will I'm open up an avenue for them to actually be interviewed by the FBI\nMarjorie I Want to try to figure out um and get your opinion on whether the FBI inquiry you going to if they have been given free rein be able to push for showing or proving that\nWas asking to be investigated when he made his vote ... a conditional to to advance counted on to the full Senate but when somebody who is I'm interviewing for a job on the Supreme Court\nTestified under oath and ... lives not once or twice but apparently repeatedly several detailed investigative news reports have shown\nOne would imagine that law enforcement agency at the high level such with the FBI could prove those lies and one would imagine that that ought to disqualify Kavanaugh now Senator Bernie Sanders wrote a letter to Chuck Grassley asking\nWhether the FBI inquiry was going to address the veracity of Kavanaugh's testimony and Jeff Flake in the interview that you alluded to earlier was asked if it was shown that Kavanaugh was lying during his testimony just plain old mind but anything without disqualify him and flake said I Would think so\nShould we now be pushing for proving the cabin all said\nOf course of course absolutely and the FBI is not going to make credibility determinations or conclusions but they are going to present information presented with that information will become public because\nSo many people millions of people are focused on this so we should know what the results of the FBI investigation aren't even if the if the FBI doesn't connect the dots and say he's lying\nWe can we can come to that conclusion and so can the members of the Senate Judiciary committee but you're right so not only there were several instances where Kavanaugh\nLied not only on Thursday and his testimony after Dr Ford a testified but also at his two thousand and six\nCourt of appeals confirmation um testimony where he said he was not involved ... during his time in the Bush administration with rules on detention of combatants and in fact he told Dick Durban\nThe signing statement that Bush signed saying I'm not necessarily going to follow the part of the detainee treatment act that says that we can't use crew in human or degrading treatment the so called McCain amendment now during the Thursday hearing with after Dr Ford testified\nUm in in addition to saying to miss dating the testimony or the evidence I should say that these are four witnesses at the party or people at the party denied but in fact the cell capping when in fact they didn't deny it they said they had no recollection um\nHe he lied about the drinking age she sat in Maryland it was Eighteen and in fact\nThe summer may Nineteen eighty two when this incident that Dr Ford testified to occurred um the the drinking age was raised to Twenty one when he was asked about in your book entry about Renata alumnus which many people have said it refers to\nA boasting about having sex with her he said oh that was just a a you know just a a friendly we liked her which which doesn't pass a straight face test when he was asked what blue thing is um which is something else that he referred to\nHe said oh it's ... and in fact several people and said it refers to anal sex when he was asked about the devil's triangle another thing that he made reference to he said oh that was just to drinking game and in fact\nIt to other people said it was ... he says he never blacked\nOut the ... and that becomes really important that he drank so much that he blacked out and that he might have this all to the doctor for it and not recall um and\nSeveral people have come forward and said oh he was a sloppy drunk he got aggressive he got very belligerent and in fact he did blackout and there was an illusion to this and Martin judges book\nUm about ah okay oh bart oh Kavanaugh blacking out and then he said when he was ...\nUnresponsive answer Kevin again he said oh they're not admissible in federal court well we're not in federal court we're in a hearing a confirmation hearing and in fact um\nHe wrote an opinion cabinet wrote an opinion as a court of appeals justice affirming that polygraphs are very useful for background\nChecks and FBI investigations so there are several places where he has lied and if anything has to be done about it he could actually be charged with a crime for lying to a a a Senate committee under oath\nYou know in any other time we would have backed off from a candidate like the the candidate him go for the withdrawal and the president would have withdrawn the nomination but the Republican just seem to have changed the rules of the games so much\nThat they seem to be up to ... determined to keep cabin on all costs because they know that if they\nDon't push him through now they could very easily not have the votes after the midterm elections et cetera and so it just it seems like we have just dropped all pretense grow up all all old propriety\nNorms on basic ethical standards and um\nI Want to touch on the piece that you wrote on a cruise steak about Kavanaugh performance if you will be on on Thursday last week where you know first we heard from this woman who was clearly victimize nobody even disputes dot and then when it came time for Kavanaugh to testify\nHe acted angry and belligerent he acted like the victim what do you think he was doing there\nI think personally you saw the week before you saw him an unfair\nToo many it was a different Kavanaugh who came out\nWith guns blazing on Thursday or aggressive belligerent nasty I'm\nYelling at senators insulting senators I'm blaming left wing conspiracy with the Clintons um for for what's happening where is of course bloody for everybody agrees that she's very credible and had made these accusations in private long before he was he was even nominated um\n[noise]\nThe early teens she'd W you eat eat late one Middletown [noise]\n\n[noise] [noise]\nAll the time that is filled with inspiration we start out with Bob Bland and the president of the women's march about what happened in Washington DC this week what happens with the campaign to stop Kavanaugh from being seated on the Supreme Court if the United states of America and what you can do to help make sure that justice prevailed\nThen we move right into talking about the immigration disaster that's going on with Donald Trump pushing forward policy after policy that is hurting women children families and our economy\nAnd how you can take action there to to help make sure that those human rights abuses that are happening in the name of immigration enforcement are eventually stopped please stop yesterday but yes\nWe need your voice there too and we are having someone there to which we hear about it as well and then our next guest talked about her new book that everybody is loving rule makers rule breakers how tight and loose cultures why are our world and how that has to do with what's happening in Congress and tips you can use for negotiating from her book\nAnd we close this show by talking about voting\nWe're talking about voting people November ... election by not how you can get people near you voting to because every single vote is going to matter are going to jump right in with our first guest I'm delighted overwhelmed and hugging my bland across the radio field lines I don't know waves\nBecause she is on today he is the president of the women's march co president of the women's march and she had been in Washington D. C. getting arrested numerous times in order to stop the despicable Kavanaugh from getting on to go to the Supreme Court of the United states of America so she's here to give us the inside scoop welcome Bob\nHer Chris how're you doing I'm good\nMostly good picture on because you are my hero tell us first of all what happened this week but second of all for our listeners I Want everybody to know that we're seeing messages out of US Senate offices that the reason why the affirmation\nWomen's voices who had been calling who have been texting who had been in the hearing who'd been in the hallways in elevators and bubbly and is one of those women so stinky pop or what happened this week\nWell so we started to begin to leave to go there because actually our callers from a grassroots organizers from all around the country who literally women who some who I'd done activism before his son who is the very first time and then given a route who's one of our\nGot through a activist from North Carolina who's eighty eight years old and has been arrested more times than you can actually count or how all descended on Washington the ... because this is truly the fight and not just for our lives but\nFor our children live in our children's children live and so what we saw the ...\nIs um it was already a very limited ... unless it's to understand where uh up until the very close to Monday we did not even know whether I was about was going to err on Monday or not so when a boat was pushed so when they are taught us some time\nBut um there was still so many different senators\nThat we're not sure what they were going to do on went on to say on Wednesday and then finally on Thursday for\nThe actual earrings with Dr Christine Blasey Ford or American Hero and I'm a fan of course a Kavanaugh's but you know man clothes and from what we saw I don't even know what that was\nYou described it well men science tantrum I Want to say to me when I go outside before the allegations came out and by the way we do believe her um and hers and them we believe them um but\nIt was just such a mess\nInsurance Ninety to ... I just have to share that with you continue [laughter] okay yeah well I I mean I completely\nAgree with you we we are seeing even just the nights you for\nA um mourn statement from a woman you know as with attempted rape was not all read the qualifying for a lifetime appointment to the highest court in ... and\nWe're in now even seeing that uh you know judge Kavanaugh was also complicit in gang rape and I I just we every single day hundreds of women howling there's someone trying to gather\nOrganizing to gather fighting tirelessly most of us have been there for three and a half we we barely blast we have been just putting every single\nOf our bodies our minds are hard when you're on the line to stop this nomination than just the I ... I can see some come out and then you know the thing with the boat you know ... it was we were last fall and when we found on Wednesday that they had already\nHad I'm too old of boat or doctor just before that even been able to give her testimony which was me and said the testimony does not matter who the senators focused on the committee so um uh\nWe did not anticipate that but this morning on friday with the wind back committee vote was at nine thirty AM with when the committee meeting started and the vote was that one\nBut today to activists turn the tide on the other it just shows that we need hundreds and thousands of people\nUm sitcom and to use these simple accents of something called for talking with hot then and first talking as the ...\nA senators are actually in session and does your broccoli speak\nTo their senator speak truth to power in person wherever they are whether that eat\nIn a hallway or outside the office are coming out of the hearing or even on an elevator on what we saw today was absolutely inspiring for the entire nation have comedy uh uh the last of the the the accent\nAnd then a brand new activists ... Gallagher knew this was literally she just got to train those was her first time a telling her story on um they were both incredibly brave to approach and they're just like\nIn an elevator and tell their stories so courageously and hold him accountable for the fact we all know that there's only two things here either\nYou believe that Dr Christine Blasey Ford\nIs a liar and bus after is not very credible testimony you must believe that most survivors must be lying you know because I Know I could testify the way she said to my own survivor so he says does that mean I was like so either that is the case or\nYou do not believe that attempted rape and rape or disqualify from the highest positions of power and our nation and neither of those are about to both so\nWomen so I just see a senator just like start on that elevator as a yes on Kavanaugh's unapologetically\nAnd then get off of that elevator after hearing the survivors stories of two women and then telling him that women are watching all across the nation and that what we're going to get from this is that\nThat we are not protected we are not safe in this country and for him to ask for that thorough\nAnd it has brought us in a higher but we need people to stay reserve focused\nOn this because the fight is not over there is still a cloture vote tomorrow and it's important for people to understand that the the FBI investigation while Trump did announce this afternoon that he supports that and so it does seem that the FBI investigation was going to get\nOver the next week what it does not mean is that this is over because after the full Senate cloture but when I was supposed to spend that is in session tomorrow assuming he do all to keep on calling US Senators\nAnd particularly senators than manned senator Collins centers in Alaska Senator McCain has the senator Donnelly in Indiana we need you to\nCall senator hype can and then we um either either call in West Virginia senator Manchin because those senators are still the ones that were very concerned about and they have indicated\nThat they um do you support FBI investigations or at least some of them have\nBut they have not said that they are and now I have enough to this is very much still up in the air or we anticipate that there are they will try to Russia vote as soon as the FBI investigation to complete a but they're they're really there's no actual guarantee you\nSo what the normal process is is that people come to the border they're seeking asylum and they have a right to have their cases covered and so while their cases being heard it was a program called the family case management program where basically when families come to the border they typically have boxes to live in communities across the United states\nSo they will go and live with that sponsor who's been responsible for them and they will go to court and they will have their case heard the case management program allows families to stay together\nAnd it only costs around thirty to forty dollars um to a ... month to process\nTension cost hundreds hundreds of dollars a family so\nTrump Administration actually stop the family case management program just as it amped up family detention just as that are prosecuting upgrading families of putting more and more families the defense\nSo we get this money was coming from somewhere it's absolutely disgusting that it's coming from a central program thing that we all need but we knew it's coming from and where it's coming from our tax dollars right now\nThere is the highest number of children must Thirteen thousand children right now in detention and somebody study is was it because more children will coming into the United states it wasn't the case it wasn't that more children are coming into the United states it's because the government was taking time or\nAdding complications of processed in those cases\nSo this idea of um detaining families it really isn't because there's a crisis it isn't because\nIf the best way to do this it's expensive it's inhumane and it's because the Trump Administration is ignoring the best practices the way that\nUm [noise] the ah those processes in place that they could take take family case management to seek out the sponsors to make sure that the ... in cases as quickly as possible and all of this\nAll of the what this is doing is that it's putting more and more money into detention which is something I'm happy to talk about too\nYeah I'm so glad that you're on there is so much to cover an immigration and there's so many fall to Donald Trump in particular has been putting forward with a giant soap box that is called being treated as president and the White House\nAnd there's I mean I mean we can talk about just for hours literally for hours but I think it's\nIt is for our community is for our country and Donald Trump is not doing that you know his policies are hurting all of us and they're hurting our country and they're hurting moms and children and dad\nAnd I am appalled I'm just appalled and I'm appalled by the lives that he's putting out there for example and I like to repeat this because I think it's important for people to know we had that negative\nMigration at our southern border for over a decade that means more people are coming from the United states of America going south than coming south coming into the United states of America there is no flood like Donald Trump has said no that's not what's happening we have again more people coming from the United states going south\nAnd then also the other thing that a lot of people don't realize is that when you're\nReally looking at what's happening at our southern border the majority of people there who are women and children who are actually fleeing harm in places where they are completely unsafe and in fact I themselves when they did an analysis\nOf people's situations found that more than two thirds would qualify for asylum if they had access to an actual attorney which they should under national and international law\nSo all of what Trump promised is based on for this ridiculous horrible awful in humane policy that he's putting forward\nThe foundation that he stands on is wrong and it really makes me mad because he's wrong lives are being lost\nPeople are being hurt children are literally crying and it is horrifying and I just can't even believe it I just really can't so that's why let me just remind people vote no my birthday is November ... make a plan to vote\nMake sure you are ready to vote make sure you bring people with you to vote we really need to make sure that we ah\nHave some checks and balances going on in Washington DC\nCommunities against each other hurting children hurting women hurting families and it's wrong it's just absolutely wrong and yes I Am on a soapbox ... I feel the soap box right here I just have to share it with you\nThank you so much Chris and this is so important because we can't be fooled but it's very clear that the\n... president of the was brought upon us by people believing that he was going to stop 'em\nBad people from coming to United States but we saw we saw when the ... when America so what he was actually doing what he was actually at the border was casing middle children American you know\nVery loudly and clearly they said no this is not the are this is not only want to be\nI think most people can understand and emphasize that for a mother\nTo get up and leave the company that uh to leave home and bring a child across a dangerous crossing\nSomething must have gone horribly wrong and I think that the child separation crisis what it did is that it showed us those mothers that showed us those children and put a lie to everything that the Trump his business ration was saying about and like so I'm\nVery thankful that you bring this issue up because as we go to vote you will know that more and more will be hearing negative messaging around immigration because it's what has worked with the Trump Administration will be for a long time so there's two things that you brought up that I'd like to emphasize the get go civil\nThese attacks on on local women and children and then the second thing is is that these\nAttacks putting people in detention it's taking money away from tax payers and at the same time it's in reaching companies\nAnd this is not who we are this is not who we should aspire to be as a country that we have this opportunity in November\nTo the same way that we said no before and we stopped the majority of child separation that the border we have this other opportunities hey this is not who we are going to be as a country and say no\nAbsolutely absolutely and the place where people can take action related to immigration\nAbsolutely WWW moms rising dot org I Hope you follow what we've been trying to do on the immigration team is that we know there's so many things going on right now [noise]\nSo we put out a blog I Would say every two weeks every time there's a crisis point\nSo that we detail if you go to the\nMoms rising website\nAnd you click on the immigration tab what we do is that we keep a log and make sure that there's different action that people can take on different issues\nSo one of the issue one of the block that we have up is on Puerto Rico one of the blogs we have up is on family reunification efforts is still a hundred around a hundred and thirty six kids to still haven't been unified with their parents\nSo there's still ways that people that end to intervene and get them both to help the the corporate campaign that we're doing right now in ... on the immigration team where we're raising awareness that\nThey've Wells Fargo J. P. Morgan Chase a finance thing\nUh companies that are making big money off creating detention of building detention centers and so there's ways that you can take action to call attention to that yes the the reason I bring it up is that there's still if you there's still a lot of people who are who are taking action\nAnd has been saying that just has made them feel very empowered and very connect with the time where\nYou can take action on immigration\nThat that I you know that your voice powerful because it thank you so\nMuch for being on thank you for doing all the incredibly powerful words that you do think you can deja don't go away we're going to take a quick break we'll be right back with our next guest talking about her new book rule makers rule breakers which are you find out in just a minute\nYou're listening to ... or whatever do you use your middle gr alternative radio from Hartford, Connecticut\nWB issue was supported by Wesleyan University Center for the arch presenting the Connecticut from Europe trends after\n... one person show the themselves ... seven thirty and ten PM in the world musical in New York Times the reviews says ... will inspire the notion that gender truly exist on of the beholder Becca block will they themselves in ... friday or to ...\nSixty five three three five five or ... billion dot edu Bush the fate\nPluck a massive breaking through with me Christian wrapping finer powered by mom's driving on the we act radio network tuned in progressive voices network and on many other stations across the nation we have\nSome people that's right now that she thinks it's come [laughter] [laughter] well I think\nThat's right you know I write in the book that we need to use the power of social norms to better our planet and I think this is a good example that when we take for granted as a nation that we have this\nUnbelievable right to vote and I think that in the ironic sense that maybe what's happening in Washington right now will cause people to get out there and vote women and minorities other people who care about what's happened in this country\nI I I Would predict that that's going to really um that's going to be a result of what was happening in DC right now\nI'm going to join you in that production and I'm going to ask you what is your favorite thing about this book [laughter]\nYou know it's just such an important principle a very simple principle about how tight or lose or groups and you can apply it to nations to states to organizations you can apply it to your own household I use the principle to think about how do I negotiate\nCanada optimal level of of tight isn't loses in my own household with my kids my two teenagers you know I Know that from my wrist\nTo tighten that produces problems and even ... with kids so I think it's been go shovel I think we can use the power of social norms and our own household with our relationships in organizations to have her it'd be more effective and\nIt's exciting to me to use culture 'cause culture than physical around us all the time it's affecting us all the time and we don't recognize that it's like the ... to fish\nSwimming in water and when ... comes up and then it says how is the water boys and they swim away and then say what the hell is water [laughter] you know it's that's what culture is and it's ... and I think I Want to make this powerful principle that's invisible really visible for people and to really\nThink about it and I of course I'm obsessed with thinking about titan isn't loses and all aspects of our life and I hope that your listeners will find it useful\nAnd live through the book where\nThey can get it at Amazon and it's on line there you'll see reviews of the book you'll see I'm On my website which is Michele Gelfand dot com there's a tight loose\nQuiz that you could take about your own um titans mindset and how it might be affecting your life and um and and I hope that you can send me some tightened the stories on the website I give it plays to send me some stores have gotten a lot of stories from all over the\nCountry and the world about how this distinction is playing out in their own lives and how they see in the world today I Love what's your name [laughter]\nThat's a good question I Do I Do a lot of research in the middle east\nAnd I'm I Do a lot of work on negotiation and I'm really\nPassionate about teaching negotiation because it's such an incredibly important skill I talk about it somewhat in the book also real makers\nWere breakers and I think that I like other phenomena and like the way we negotiating United States networks doesn't necessarily work in other cultures and I've been studying many many people in the region for many years at and\nHave come up with a new model of how do we think about negotiating in the middle east though that might be like a new getting the U.S in the middle east book but maybe not so soon [laughter]\n[laughter]\nBecause you know teaching negotiation we learn that certain styles are effective in certain situations and I think his style as it is usually effective and very kind of simplistic negotiation situations that are one shot that I\nHave no choice but to be sure action and and he has a lot of issues with his style and I I plan to write them something about that for the general media because I think we can learn a lot about especially in other cultures what backfires it's certainly something his diagnostic elements backfire\nAnd he's a little bit over confident\nThat bad [laughter] negotiated style and so I think it's a really important thing culture and it's all around us it affects all of our lives\nAnd ... and including how we negotiate and and I think\nYou know it's critical that we learn these skills when we're going abroad we don't often think about cultural intelligence to think about like OK smartest someone when they go abroad but that can present operate in that culture effectively and that's what we study in my group and so um that well maybe the next ... next part of the next book to\nAn article I'm ready everybody should read everything Michel ... rule makers and rule breakers is\nJust out how tightened loose cultures where our world obviously had something to do with our current literal world here in the United states of America right now a lot\nTo learn thank you so much for being on\nTickets would bring the ... we're talking about I'm voting yes it is more fun than you think [noise]\nOne for me to\nSing ... my mom's rising on the we actually do now we're in the best of voices network and many other across the nation we are joined\nNow by the one and only super Donna Norton who is leading the way and making sure everybody each and\nEvery one of turns out to vote because why don't why will come down by the way but\nOh come quietly\nOverwhelmed by the events of the week um I Know that and out\nOf the women across the country has been\nSo [noise]\nI ... I've had people ... their\nUm you know talking about the things that went on with a with saying\nKnow people that are on his staff sharing their stories that sexual assault I think there's been this and that alone as a\nA collection of women with each other of a kind of\nSharing the trauma and I think coming out of the the way to uh\nAnd that will make our path forward out of this is for everybody to vote ... to show our power as such so our voice but married or to be her to be taken seriously\nAs our moment and we need to take it\nThis is our moment we need to take it we need to make sure we vote we saw the fine\nA hearing for the Supreme Court justice of the United states of America this week that I don't know about you listeners but I had to take two towns and four times after watching that I felt actually\nPhysically ill and I know many of you out there listening did too and\nWe need to make sure that we don't see pictures anymore on our televisions and or newspapers online movie the one woman and a whole row of only men making decisions about our lives than about things that are going to impact us into the future we need to make sure we have\nA representative democracy that mirrors us all and the way to get there\nIs boating Donald\nTo vote tool that's available on our moms by rising um moms and vote dot org website if you go to her mom so that or do you see both how to register to vote which is so important right now because I'm\nIn many states a while and some of the state the deadlines are coming up\nTo register to vote for some important to register to vote and you can go to a monster dot org to register to vote to check and make sure you're registered to vote I'm great of a change the name ... locations\nUm have kids who are in college but may not be at home when they're voting\nInto it and some states there's ability to get a a absentee ballots now and all that stuff we can find out on our website so a debt that I'm the same gets that fabulous tool\nUm the I Can't wait to vote panic button that you can\nActually use to a tweet out all the time like\nA day where you really cannot wait to vote because they see something in the news or something on TV that is so disturbing that you can't wait to vote you can go to our moms vote dot org website and get that as well and we're getting\nKind of amazing I'm quick from across the country which are important not only for their own\nPeace of mind and therapy to process the atrocities that we are saying but also to motivate everyone in your social media network to vote as well and we've got and things like you know I'm\nWorried about my\nPeople who care about this or a shoreline democracy to I Want a good life play outside I can relate to that and as a way a lot ways to vote\nYeah we all know it's going to wait till I Can't wait to vote people if you're out there and you're listening raise your hand please keep one hand on the steering wheel if you're driving but reader and if you can't wait to vote and make sure you're registered to vote a lot of states are still an opportunity to make sure you're registered to vote so you can just go\nRight here at W. E. S. two eighty eight point one offend middle time\n\nThe views expressed on this program or the views of the individual broadcaster and do not necessarily reflect the view of Wesleyan University or the W E S U management\nKeeping this thing a progressive minded radio show\nFrom Wesleyan University stubbornly you eighty we\nA few of them died during providing community radio that Matt I'm Maria junk [noise]\nWide ranging\nCody Mary\nMany dogs and cats been endless stays indoors staring at the wall living for the moment when you will come home and tell them you love them take them out and make a fuss over them\nDogs and cats need physical exercise in mental stimulation things to do and think about in order to be healthy and happy please set time aside for them and give them a real life and real love\nFor more information please contact people for the ethical treatment of animals at seven five seven six two to pita or helping animals dot com that's helping animals dot com\n\n[noise]\n[noise]\n\n\nWelcome Cody learn very thank you and I pronounce it right you go I Am Italian it would be shameful if I pronounced Iran so much to talk about but I have one thing pressing on my brain because it's of the moment as it were\nAnd I bet you can get it [laughter]\nIt's the Kavanaugh hearings and because you were a lawyer sure and you know how to side dumped the testimony I just can't resist asking you if you have any thought yeah\nIt's you know I I've ... I've heard a little bit of it I've watched a little bit of it and my impression purely from a legal is to point of view is that I think both parties are trying really hard\nTo shape the hearing just one thing or another\nI think that the Republicans are trying to suggest that the hearing is [noise] some kind of caused by judicial proceeding and they hired a prosecutor to act as kind of their own private lawyer\nAnd they want to suggest that there's some kind of burden that's necessary in order to hold judge Kavanaugh to a certain a kind of finding that they want to make\nAnd on the other side of the Democrats are suggesting that it's kind of like an employment interview and that he's asking for a job and that therefore anything is\nOr if those is right I think maybe somewhere in the middle is right yeah um but I think both sides kind of the show about what this is supposed to mean\nSo you don't have the hardy you're not talking about the individual involved so much as the political literally ... right yeah\nAnd you know it's a it it's inherently a difficult situation when there's a judge saying I didn't do these things are people saying I did do that he did do these things\nAnd I I don't think that through this process we're going to know uh the truth and you know I think it's important to give it a certain amount of weight and then the question becomes how much weight to give it and I think that that gets into\nWhat the political parties are doing and how they're trying to just the amount of weight that it that it should be given\nYeah but do you have a gut feeling that who's telling the truth I\nYou know it's almost like when people come to my office and tell me things\nI have no reason to believe anybody and their own um recollection and and you know recall of what happened to them and their lives you know I Know it couldn't have happened exactly the way that any one person is saying it did since there's such a divergence of what they're saying but\nUh I don't have an opinion as to\nWhat actually happened and you know the to the degree that it's actually going to impact the vote to approve him for the Supreme Court ah\nI'm I'm a I'm not\nOf the opinion it's going to make a significant difference but I suppose we'll see [laughter]\nYeah and maybe by the time this airs we will have already seen [laughter] yeah [laughter] it's like going on there and ... [laughter] right yeah moving rather quickly\nWell okay I never got that probably people are sick of it so\nWrite a column Iran uh mostly\nDied a personal injury medical malpractice cases\nAnd you work in Hartford I Do and not in this order as important that your Catholic I Am [laughter] and that is why you write a column for the Catholic transcript about the intersection of your faith and your profession yeah do you know anybody any other lawyer who does such a thing\nYou know I don't know I'm lawyers that are are writing but I think that there isn't a I Know lots of lawyers that are a ... in different ways maybe more conventional ways I was just talking to an attorney\nYesterday who's on the other side of a case of mine but I Would consider a friend um and credit yeah ... and he was just just became a permanent deacon in his for the archdiocese\nYou know and honestly since I've been writing for the transcript I've had lots of lawyers and prosecutors and judges um mentioned to me that they've read it or just odd which I thought was a which I was surprised by\nYeah um which was you know something of the impetus for us to put together kind of a group that we've done over the last six months to a year a group of columns [noise]\nNo actually it is a ... lawyers right we started something um with the approval of the archbishop of the the um the Catholic lawyers guild of the archdiocese Hartford\nWow yeah what will your group do you\nKnow we're still defining what our role will be a ... it's purely um intended to be a evangelists ... community service oriented it it's not intended to be a legal education kind of bar association group\nOr we held a panel in the spring where we had monsignor McCarthy from blast and bears\nLawyers what can and law is ... you know maybe one of the few groups on earth would interested in that top [laughter]\nAnd um you know we plan to have some community related event community service related event and we're doing an event around um the red mess that's planned for the archdiocese\nWhich you're being humble about I think you had a key role in in resurrecting that previously more a bond red map train all it is that right\nYeah so the red mask it is a vote of math for the Holy Spirit and it's essentially I'm asking the Holy Spirit intercede or in you know further and sort of truth and justice\nAnd so it's kind of culturally and historically\nDevoted in some sense made significant with the legal community judges lawyers [noise] um but generally it's for anybody that speaks justice um I didn't have that yeah I was not familiar with it previously I Know in in previous years there has been or read math and I believe it's been celebrated in Waterbury\nUm but we have worked with the archbishop who's going to be celebrating the mass um and had gotten permission from St Patrick's Day an Anthony to have it in Hartford because there's such an enormous uh community especially of lawyers in Hartford that happened to be there during regular working hours\nOr so it seems to be a good mix of circumstances that have allowed it to happen and hopefully we'll be successful\nWhy is it important to you it's a good question thank you [laughter] ... [laughter]\nYou know and I I had never thought about it in terms of why it is important to me personally um I just have looked at it as another opportunity to get the word out and to try to avenge allies within the\nAnything because it's a bigger space bigger space yes and we tend to go at eight in the morning on how to manage which is probably the most popular about alright\nSo that helps provide plenty of options for people that don't like a one year old and a four year old a that was not at all about\nOr to though and and I think you know St Patrick's Day an Anthony the preaching is unparalleled in our experience\nAnd I come from before that I'm being very active at eastern Connecticut State University and the chaplain there or who is also the priest for Connecticut College the gentleman named father Lawrence will point and he has got to have the best preaching west of Rome it's just incredible\nAnd and it appeals to the population\nAnd it it's the first time in when I was an eastern that I was hearing German that we're getting into you know such technical details about the scripture and how the text was written and the choice of words and\nThe you know the ah social historical context and and just this incredible\nLittle details about about how the picture all fits together and then you know this is how to apply it as a Nineteen year old on a college campus in Connecticut right um and so when we bought a house and you know started doing these things that we have to do to you know\nTo keep up in modern society you know we definitely found in St Patrick's Day Anthony a parallel of the great type of Germans that get into these very you know deep issues but also our show of of such general application that it's just incredible to hear\nGreat yeah let's forget my left her ... you know what I loved Hilo a lawyer goes to confess to\nTalk about that you talk about the kind of a ... which really say flight inner conflict yeah that arises for you and that well\nPart of the problem for me is that you know confession of St Patrick's Anthony's at eleven thirty Monday Wednesday and friday for anybody that's been a harbor area and so you know eleven o'clock will come around or ten thirty or even the maybe the day before and I'll start saying to myself you know I Want to go over a confession\nHow often do you go not often enough [laughter] but you know I I mean I'm I ...\nNumber of times a year okay I'm On my back and hit my mom's a listening yeah [laughter] I I Try my best before Easter yeah certainly\nAnd I start thinking about All right well I've got to I'm going to go to confession you know I don't know what you preach but that shouldn't matter and what do I what do I say to them what do I say to them you know I don't remember anything specific I don't remember what I have for breakfast two days ago\nYou know I can remember very distinct details about somebody's medical treatment from five years ago and when the doctor last came in but when my wife does bring the laundry upstairs I forget and so you know I Need some generalities about what to tell them and then I don't know there's the list to command a strange time which ones I'd violated and which ones\nI didn't but you know and then you start thinking All right I'll just I'll say this I'll say I violated this commitment and I commend and then you realize well I didn't really I didn't actually say anything I didn't actually commit to anything [laughter] any meaning\nUm and then I ... you didn't really a search your conscience yeah you were just looking at a list and going no no ... no right and then you know sometimes in the profession I you know the task is\nWhen you boil it down to its most basic is I Need to write a letter submitted a brief or something and say as little as I can in as many words as possible right\nAnd and sometimes that's just the nature or you know I have to have a client talk to somebody for some reason but I Want them to convey\nIt can fashion if you're [laughter] you're aware of yourself as kind of a quiz attaining right yeah right and and you know\nThe biggest problem I have is when I come to it and I say are at the door I'm going to say I say to myself and I say that that is totally void meaning\nPen and that you know maybe you should confess to this I Do I should [laughter] hopefully there there is a ... listening that will email me absolute afterwards if you go in peace my time [laughter] you're a lawyer yeah no jury would convict [laughter] you know I think it was\nPart of that struggle and I I started saying I was telling my wife about it and she often has lots of of good suggestions for me and you know I I think it was first adjusted to start the peace talk with you know All right we'll find out why don't you do it like you you are a lawyer and you've\nGot to read it yeah I I have it here so we read it sure is much\nI laugh\nOr the other thing I mean sure\nLets me father fry and while it technically has been more than a year since my last confession in violation of code of canon law ... your ... your after C. I. C. section Ninety nine\nThere are a number of mitigating factors related to the the way which will be detailed in separate confession mutually convenient time and date [laughter]\nWhat is to follow is a non exhaustive list mortal envy Neal since which I may have committed since my last confession [laughter]\nAs significant period of time has passed since my last confession this list is offered in the spirit of reconciliation and as a representation of the character and nature of some of my recollect it's been within the applicable timeframe after mentioned more over\nNothing contained in the list to follow is intended to be an admission of guilt except for the bowling limited purpose of admitting guilt as the patent seeking self Lisak remedy as reference since the icy section nine eight seven more over bikes\nAnd one interacting in good faith in the spirit of fair dealing throughout the course of a confession\nAwesome oh my God they trained you well do you have fun writing that that one was fun and it was on looking of the the a code for for these references\nAnd I'm sure you know for the code lawyers out there and the fathers did the panel would say that that is an absolute abused [laughter] of using that echoed like guys you have malpractice insurance you should find yeah I should be okay [laughter]\nOh I guess you know what another one that struck me because it's at an occasion that comes up for so many of us maybe all of this is what to do when you're approached by a panhandler ... you wrote a piece titled the beggar yeah yeah talking about that well\nAnd you know like a lot of the ... pretty much all the ones I right I think that one was one that came to me because I was sitting in front of the courthouse in Hartford\nAnd there's the same gentleman that I always see 'em and he's got kind of his Dick and you get you know for those of us who were around the court all the time they don't necessarily keep track of who they have asked them but this guy have kind of a more elaborate ruse\nAnd he had apparently not recall having gotten donations from me in the past on same are probably more than once\nBecause as your wife points out you're a soccer famous guy terrible\n[laughter] terrible yeah who think it's Jesus in disguise it you know you never know and and so it's tough because you know obviously nobody's got the means or the ability to to give money to\nPeople begging all the time and there's ordinances to to just allow it happening within municipalities and then you can start okay you know I gave him money but I should really given it was sandwich can get a substance abuse issues and I don't want to be\nYou know part of those ...\nJust hate just driving by especially when there's a stop light and then you're you know they're standing next year for forty five minutes and it's it's tough and you think\nNot only you know what if that was just what you think what if that was me you know what if I was that hard on my luck right and so it's it's definitely a difficult and maybe that's why I've always been such Tucker in this regard but\nYeah that that's a difficult issue\nI think Pope Francis actually took it up yeah vices give yeah no surprise somehow but yeah yeah yeah one time I\nI was approached at a supermarket right near the doors and I don't know why this struck me as somehow not cool yeah I don't know why should matter\nBut I just resented it and I didn't give anything to this person and I thought this is not cool yeah\nBut I happened to look behind me afterwards and I saw a woman opening up her wallet and handing over bills and I I felt so guilty\nI felt and then the next time I encountered a panhandler I totally over\nCompetition [laughter] like here and take my what\nA great playing baseball or or a dynamic a golf swing is that it's acting within the confines of these rules and that\nIf everybody on a baseball team went out and said I'm I'm going to do my thing you do your thing and let's let's win this game [laughter] going nowhere [laughter] and so I think that that's one\nYou know dynamic of the structure that that the church provide to the canon and to to the faith but the other aspect of it is that you know this wedding was clearly a symbol after symbol of the persistence of love and the beauty that inherent in it and uh\nOdd or the sense of of a being that is you know the mover I'm from the equation I think if anything these these attempts at\nA of symbolizing the marriage but in fact invite this kind of inquiry about what you really being represented ... and I think that you know ... when you boil it down to its most of the central\nYou know reality God is still as president there yeah I'm In in a in a real then and then they just you know unfortunately by virtue of our experience and in our\nBeliefs ... he's not being expressed in the way that you should be but yeah it's not void of his presence guy yeah\nThat was kind of my my thought process yeah\nYeah [noise] it makes me happy that you have this forum the column to express those kinds of thoughts\nYeah I've I've enjoyed writing a lot I've honestly been surprised that they have continued to\nPublish them [laughter] you know\n'cause I I've over the years have kind of struggled with my own voice and what things I Want to write about and I write professionally out on my website and things like that but\nI found that you know writing these which you know I had just randomly you know gratuitously contacted the transcript and said you know I've written some would would you take a look at them\nIt's it's something I Love to do is the website that you mentioned a kind of blog of writings like this or no that's the lawyer it says on his business right now\nI also teach English gr until maybe that's why I picked up on that kind of\nImpulse in your writing oh no no I well yeah you're right charging metaphors that are unusual\nYou've found resonance between that saying winter is coming yeah with Catholicism sure now and I thought oh this is really cool [laughter]\nWell I've highlighted the paragraph why don't you read that\nSure I find parallel between the words of how dark and one element of the Catholic experience all the world of West coast is preparing to weather the storm since scarcity of the coming winter\nThe followers of Christ drawn a perpetual journey in the wilderness the wilderness is not unlike the winter\nThis dark sworn of the wilderness as a place to this uncalled debated uninhabited and largely inhospitable to life if you can survive in the wilderness for an extended period of time and some have perished in the attempt\nBut along with the desolation of the wilderness there's also a sense of cleansing refocusing and renewal that occurs there in the wilderness all the distractions are stripped from us and the only the essential aspects of our existence seem important\nYeah kind of deep but yeah so beautiful no thank you yeah now how did that come to dispose you're watching day my son and you're like oh that's a spiritual here you know\nI I had read the game of Thrones book before this period TV series was out and then you know some family members or into the TV shows I watched it and of course we thought it was fantastic\nAnd I think that the inspiration was actually a biblical passages that I had read about the desert and wanting to incorporate that and I I think you know I was going through some kind of phase for myself that felt kind of like\nDesert issue and I think that that was just how the connection which was made and that that winters\nThe very front on line yeah it it's something that I've just you know attach to subconsciously\nAnd you know there's always this sense of\nPreparation and I you know and I I Love the uh the ... times of preparation I Love blend [laughter] and now I'm with you yeah I totally get that yeah and you know it almost feels like you didn't burn Easter if you didn't put in your lunch\nRight you know right now it's a spiritually nice tee time yeah very I'm very spiritually susceptible will yeah [laughter] right [laughter] yeah yeah\nAnd there's just something about um you know kind of a simplistic diminished approach to life during that time right that is just so appealing and you know part of my effort you know I don't even know if it's a concerted effort because I Am a millennial to to you know I just\nUh how old are you thirty one okay ... yeah All right I've I've been told is much yeah [laughter] I Can't keep the term straight yeah um yeah I was born in Nineteen eighty six okay I'm very wide oh I've tried my but we've always a thoughtful kid you\nKnow my my aunt was significantly older than my parents and she has since passed but I think it was she always told me I had an old soul uh I always assumed that means I was boring [laughter]\nI've always been an avid reader which was the most exciting thing as a child yeah\nGreat\nMore here I think we have time to talk about one more ... more let's see and it's about visiting prisoners ... and it struck me like I don't think it ever had before and it's so obvious I felt a little stupid\nThat I can hear you are you're a lawyer you are dealing with potential prisoners yeah you know and your real man or a prisoner and this has to be like you say for most in your mind yeah\nAnd this one might be a sneak peek because I don't think they've actually published that I think that that was that was I think the first one I had sent them and I don't think they published it but maybe they will okay and I you know I think that one of the things that has just been always really unnerving to me it's going to prison\nAnd I and what is it about like you know it's that sense that right now you can get up and we could we could just leave we could go out side yeah right\nWell you know and and it's almost like it virtually any time in your life you could crawl out of an MRI machine there's virtually nothing that can be done to you besides putting under the forces you to be somewhere\nRight ... I may be sanctioned by the court but I could walk out right in the middle of the judge talking to me\nAn NFL player who left it had right yeah I'm ... I'm done too over her entire yeah\nSo there's just something you know first trauma physical perspective that is just so incredibly depressing to think about not having that and not only not having that but you know cinder block painted walls and the artificial light and smell and everything so it it's just overwhelming that's then\nAnd then the other senses you know and and it's a price that people pay for things perhaps that they do or or things that they should have done\nBut you know there's always a question as to whether or not the collateral consequences of conviction you know from the title perspective from you know certain rights and freedoms that we all have our justified under the circumstances and and how the effect that those have on a person's life yeah I'm an artist\nVigilant you know the travel are poor and and it's harder and I think largely overlooked the staggering prison population we have in this country\nThat you know I think that they're they're scarier for people the process is more cumbersome you know there's no clear guidelines are directions where you know how to interact with them and what what to do to improve their situation\nAnd and it's just not as appealing as children and the poor and you know those kinds of things and so I I\nHad written thinking you know this is a a population that we're\nVery directly called to to help and and Jesus as much as you know we hear very often now Jesus was an immigrant absolutely true I'm an immigrant another one of those populations that is is do a impoverished an\nOn Thursday at seven and they've got that spells and arrowhead reduction plan and pressure\nPleasure beach that is on friday at seven artist for real peace in the eastern peak what tribal nation holder free native I clinic for local natives and their families\nSaturday and Sunday in Warwick details and registration information can be\nMiddlesex music academy in Middletown and budget to their monthly for court fiesta Saturday at four pm and their main street location and the only real for\nThe gym for court structure\nThat would be fun little towns recreation services open by two to a guy didn't take it hit the mountains Saturday ten am with the best leap in an email that's at healing nature of the T. dot com to get more information and joined the\nCounty Historical Society thirty third any will car show at flea market Sunday starting at eight thirty at polar field and Middletown where they'll be highlighting a Nineteen forty nine for custom convertible and Middletown recreation community services host or decorative and Sunday\nBarbecue Sunday for a conspiracy on main street in Middletown\nDot com slash city our office had all your details\nOdd fellows playhouse you theater Middletown hold the teen talent search Saturday at seven including cash prizes details odd fellows dot org [noise]\nNightfall and outdoor community performance celebrating seasonal change happening Saturday ... park in Hartford enjoy art music dance and giant puppets of artist and cover leave go to ... park dot org now he's a rundown to send them off the beaten track in central Connecticut tonight in Middletown the Wesleyan film series shows the third film\nTo cook day in which the Dominican filmmaker explores the lurking violence corruption and class conflicts in his homeland who the tail of a gardener Harvard real outweighs continue the run of ... Molina about blurred lines at a physical theater troupe and to pick up the litter documentary following puppies you become guide dogs for the blind date\nRodents of unusual size a documentary about swamp rats and Louisiana and includes opposed film discussion with director Jeff Springer at Fridays screening for details on all the films and activities go to real art wave dot org trinity college it's in a studio in Hartford continue to run\nA blind spot in history of friendship race and class at in Oakland through Wednesday Thursday they open three identical stranger about the reunion\nOf identical triplets separated at birth which started out as just enjoy full story that hit all those social media turns out to really dark underpinning you should really check that out\nThe Japanese film the third murder opens on Sunday check the website for offerings and time than its studio dot org Daniel Middletown international film festival starts in the evening with a screening of the insult film about war\nAnd its consequences Russell library seven including a documentary by Wesleyan University is Peter ...\nOf religion is run down tonight live up here on W E s U ADA point one FM Middletown as we roll out\nHe would wonderland DJ Cheshire Cat from ... Raj novelty to a new romantic punk to Prague wonderland the place to eighty to go to a blender with Bill rattled collected selection of new an older folk on a bluegrass blues\nAnd other music with their roots influence plus a concert lifting at seven and frequent concert and festival ticket getaway singer songwriters laid please we'll call it a chat with Bill on the program today at eight PM voice at the stadium Jay cherry a weekly show featuring alive and local Connecticut art and music\nAnd I tended to test pattern show bringing you the sound of things\nFalling down the stairs in so many other sounds is what\nTen at the audible underground DJ Josh in men come explore variety of underground music by independent or relatively unknown artist from many genres occasionally discussing current events neglected by the mainstream media from eleven to midnight the two different mix media DJ paying in the city and DJ magnanimous we can do it and we talked about\nAt midnight ALS bum reviews a DJ in the wind a DJ marginally in a music show that searches for interviews narratives musical teams in general continuity of album to show to let the collection of songs on and off the album and dig deeply into new album every\nOr wants to road trip with DJ Mick every show covers a different city feature new in rising artists from the same room town no gas money\nDue to forwards upfronts all from ... from us from the different ... that is known for today's job at five I'm Marianne O'Hare producer of conversations on health care her here Wednesday afternoons at four Thirty Ways of the top leaders in health innovation health policy health technology\nAnd the health care we're going to consume in the future now\nSays wonderland ... W E s Q Middletown\nS\nL\n... na na na\nAnd just you know\n\n\nHowdy Doody ... W E s humidity at any point one F. M. I. M. D. J. Cheshire Cat and I'm happy to be sharing an hour or so a free for music would you this fine grained Tuesday Afternoon\nOur show began today with Radiohead pop is dead originally released in Nineteen Ninety three other not album single it was included on the two thousand nine to luxury issue uh Pablo Honey\nAge even critique of the pop music industry the track itself has a number of detractors despite my not so secret love for it in fact guitars and O'Brian of Radiohead called the song a quote hideous mistake in Nineteen Ninety eight\nThey just want to talk about you're not going to throw Brian for\nBefore we get back to the music I wanted to make sure you knew about the W E S U boat record fair on Sunday October fourteenth W E s you be giving you the opportunity to bulk up your ... collection well being entertained by W E s U D jays spinning new classic trap\nThe record player is free for the general public between eleven AM in four pm but ... speakers can get an early bird our starting at ... am for a mere five dollars\nWill be at our usual location that compare weather hall at fifty five was out in Middletown, Connecticut you can learn more at W. E. F. U. M. O. R. G.\nAnd now the new music from the chill ... W E s U Middletown idiot point one of them [noise]\n\nIn the country you know\nYoung man\nFrom the mayor she saw them maybe\n[noise]", "show_name": "no_show", "year": "2018", "city": "Middletown", "day": "02"}