{"month": "10", "state": "CT", "station": "WESU", "content": "You are to to eighty when one W. E. F. U. S. and Middletown why why\nNot a man or woman\nAnd then be\n...\nYou know\nPeople and getting into the Pentagon and changing the kind of a new American indicated\nKnow again and again\nAnd again and again and\nI'm ready to go in and then I'm going to do not have been independent changing the\nAnd age you\nKnow when you\nKids to bed don't mean anything can be put to you know\nThe day to day in\nTo be here did enough\nAnd indeed and and\nThey could be\nPeople are going to be entertaining and you know and and and didn't win\nDo the job than it\nWe need to grow\nAnd energy independence\nSame way and you know\nMade many changes the\nOn the\nTo you in the city can be done machine there just seems to\nMe and said you\nYou can\nHalloween to guys band\nAnd that as Paul Simon asking the questions so beautiful or do what\nIs that a question well that's a question [noise] that's the title track\nFrom that two thousand eleven relief before that we heard from ... in hard times about Babylon the title track from her two thousand\nCD of the same name art and why before that from\nIn the reins song called prison on route forty one that's iron and wind and Calexico and we started out with the bar brothers and they're twenty Seventeen release queens of the breakers song that I heard\nI Am here and dying and I'm sitting in for Neal tonight I Will be continuing my imagine program right up until ten o'clock so if you like what you're hearing stick around and you like what you will continue to hear next up we're going to hear from fight here at W. E. F. U. F. M. Middletown\nConnecticut oh wait a minute do I have the right song queued up\nI think I Do here we go here's fight [noise]\n\n\n\n\nMm\n\nI'm trying\nTo ...\n...\nNo I didn't know\nHim come closer to shore times you\nKnow new here\nIn New\n\nAnd\n\nSad\nFor the\nPast two names\n... so you\nGet\nA pat on\nThe\nTrains run [noise]\n\n\nThe game\n\nOther day\nWith a number to begin or\n... or ...\n\n\nWhat do you\nBeing\nA ball\n\n\n\n\n\nGame\nOr do you\n\n\nWant to hang\n\nOh oh oh\n\n\n\nThey look at the edge\n\nThe three I think the same thing\nFrom the ... and her two thousand seven released and that featured Branford Marcellus from that sweet little horn so low there and Alicia Keys as well [noise] before that from a Paul Simon's Nineteen Ninety release the rhythm of the state's\nFurther to fly as where Paul Simon went\nTo Brazil and collected some sweets fountains and rhythms and feelings from that\nGreat country\nBefore that we heard from Joe Henry producers singer songwriter two thousand seven he put out a release called civilians and we heard the title track to that and we started out with the Canadian musician fight Leslie fight she calls herself fights\nAnd we heard a song called the park for a two thousand eight release\nThe run minder\nYou that you are tuned to W. E. S. U. F. M. eighty eight point one\nMiddletown, Connecticut ... no I Am not build ... I'm going to be here for his show feeling in will be here until nine thirty hope you can stick around I'm here from six thirty until eight every Thursday bringing you imagined radio and so I'm just going to continue that imagine thing\nWhere we go around the block and around the world next up we're going to go to Jamaica we're going to be hearing from a Jamaican artist called ... put out an album called talking dreads this year earlier this year\nWhere he covers talking heads songs and he got the improvement tour form a talking has musicians or Tina Weymouth and Chris friends [noise]\nSo you know they like him and you know I Do too 'cause I Love the talking heads so if they say it's okay I think they're right\nAfter that we are going to hear from a a song from talking heads album remain in light and after that I don't know where we're going to go but let's go to Jamaica right now in here from mystic\n[noise]\n[noise]\nNo no no no no this is this is what\nDown in my mind that you\nNot ready to go\nUp from Brandeis and oh by the way\nWe now know about\nDo I do\nSummer rom book guys and then the\nAnd they made a habit that included high\nAnd now being lied to\n\nDon't give up my eyes began\nYou popped up all your eyes\nWere going to\nMind your dog they live very\nWell give me a long time but now we\nThe role model\nOn\nTouch\nCan beat on\nOn that show\nUp\nThat that they\n\n\n\n\n\n\n\n\n\n\nMade\n\nRead on\nDo they know John that\nMay be bought by\nA\n\n[laughter]\n\n\n\n\nAnd it's turning right if you were to turn to to to\nA point one W. E. F. U. S. in Middletown, Connecticut\nI'm hearing died filling in for Bill dinner tonight\nUsually do a show on Thursdays preceding bill show called imagine\nBringing songs from around the block and around the world and that lasts that kind of covered it we were in Australia that last song with a ... D Nineteen Ninety three release called freedom so called world turning before that you use it\nTalking heads yes still one of my all time favorite groups and that's paying a lot because there are so many good groups out there but talking heads up didn't close to my heart for a long time [noise]\nRemain in light there just seminal Nineteen eighty release it does not get old\nBorn under punches the opening track for that and we started out with a Jamaican singer mystic ... covering talking heads songs and he calls this two thousand Eighteen release of his mystic ... talking dreads life during wartime from him [noise]\nYeah I'm here and sign up feeling in for for Bill tonight I Will be here for another forty five minutes\nSo going to get right back at it with more music this time from ... Copeland she is a daughter of the great blues singer Johnny Copeland and yeah the apple did not fall far from the tree she is very talented\nSinging a song for us next nice little tongue in cheek song called I feel it's been coming on and if you do well there goes on for you let's go [noise]\n\nHe just says man\nAnd no means [noise]\n\nI stayed with him\nJust not good to me\nI Want to go home\nDon't\n... ... ...\n...\nJust a you know [noise]\n... on\nEarly\nYou\nYears old\nFor lots of the ...\nDrawn to\nJust let it\nExtending the court that that'd be they acted slip and then they get on the dirty mattress you can join\nLand so Cleopatra's\nBombay me on the tool of empathy and be ready to take a stand\nTo the king human role which ever been to the answer is probably the menu is next we're\nAbout the negative and positive\n\nDid they\nSay oh\n\nWe\nCan we\n... na na na na na na na na\n\n... ... I\nBe the song is called those who\n... a man\nThose ...\n... ...\n... ... ... ... ... ... ...\nAnd you can follow up on a sweet on\nNo no\nUh to to make\nChanges plant a\n... [noise]\n\n\nOh okay so you go and go\nBut the point to the\n... [noise]\nMm I Know\n\nDry\nAll open my way into a\nBy that\nSo so\nSo long\nTo [noise] so [noise]\n[noise]\nSome of them [noise]\n...\n...\n...\nGo to Iraq [laughter] jumping\nOr you go [laughter]\nI Know [laughter] and and [laughter] you know [noise] just such jobs on the head\n[laughter] to do to you about it that they can get the job Chavez human brain [laughter]\nWhat he called me to death [laughter]\n\nIn Charlottesville\nThey were going to be better\n[laughter]\n[noise] [laughter] [noise] [laughter] [noise]\n\nShe is [noise] bird [noise] All right [noise] oh\n\n... ...\n... ...\nYou're\n\n\n\nA\n\n\n\n...\nThey came over to ...\n\n\nWhen this guy was ...\nCircle\n\nNeed\nTo ...\n\nWe knew\nHe\nNamed ... ...\n\nThe ball and\nSome gone now um\nKnow who the\nTake your time to be ...\n...\n\nWe can do\nThe I Know\nAnd go ...\nThe\nMaybe ...\n...\nShould I buy\n[noise]\nWhy do you are saying wait a minute on this thing [noise] with me all day\nMy piece to me I was born and raised more than a dog [noise] well you know\nWhen I was torn apart by my own time\nAnd not only the only thing to go home and leading\nScale to make a\nTo shy away\n...\n\n\nBy the last ... years in the car and drive for ...\n... ... ... ...\nOn the um Mm\nI knew the norm is your mom jobs are so many jobs\nHere and I'm David sixteen ... they are\nIn a ... little\n... these are the than the ... ... ...\n...\n\n\n\n\n... ...\n\n... ...\n\nYou're right\n\n...\n...\nYou\nNot sure\n\n\n[noise]\n\nShit\nAnd drank\nThen she should have\n\n\n[noise]\n\nAnd\n\n\nAnd everything and [noise]\n\nDo you remember in and you're listening to the middle\n... [noise]\n\nBe\n...\n\n\n\n\n\nGo\nMan named John\nThrough a\nPipeline\nA\nBad I I wrote\n\nThat lived in New York Times on line and it is and nine nine she\nI gave them racing I had\n... treated me so bad but I ain't going home ...\nIf you have trouble is that you need to drown\nYou can't do it by ...\nYou made that every night but you never know when the ... ...\n\nI Know that I have almost lost my\nAnd something tells me I had better stop\nAlong changing all my weight and get myself out of the day than I ain't going ...\nOr apps someday I Will find true love a girl that ... that we are the odds of\nThat you know out to be our life and really love me all my life and I won't go I'll get talk in any\nWay to do\nI've got a blizzard that blew that\nGame I've got ... ... ... ... ... feet Don King may be that the ... good my brain in a way\nTo do with it and eat it and when he let me let me get eighty eight months\nThen we use that money in black da da da da\nDa da\nDa\nDa da da da da da\n[noise] [noise] [noise]\n[noise] yup much use for good music dealing with the psychedelic by every Sunday night she\nJoined me for a musical tribute to the walls of New York San Francisco London Tokyo and beyond FM radio the way it used to be every Sunday night at nine o'clock following that air on WFSU middle [noise]\n\nIf you're over Eighteen in a written the Connecticut you can register to vote it's a quick and easy path that can be done on line\nWith a valid Connecticut driver's license you can go to the city of Middletown website fill out a form lifted under the important link section and register and minute if you don't have a DMV id there is a similar for me can fill out using your Social Security number\nPrinted out and mail it to your local registrars office where it'll be process the same day if you want to register here's some things you should know\nDifferent elections have different registration deadline the general election has the same day voter registration\nYou can go in person to city hall with an ID and piece of mail is prevented the and vote later that that other elections may require registering months in advance though if you're already registered registering Connecticut will mean that you're no longer registered in your previous state to vote in Connecticut primary you must be registered with the party\nThat just requires checking off boxes you fill out registration for it\nIf you want to vote don't the light register [noise]\nYou're listening to me ask you a point one Afghan Middletown, Connecticut number one college radio station\n\n\n\n\n\n\n[laughter]\n\n\n\n[laughter]\n\n\n\n\n\n\n[laughter]\n\n\nSpeak\n\nTo speak\nBeep\n\n\n\nCan do\n\n\n\n\n\nAble\nBang\nBeen I\n\nShould look\nFor\n\n\nAnd\nI go\n\nTo tie gosh\nI don't\nCan\n\n\n\n\n\n\n\n\n\n\n\n\n\nMovie\n\n\nI\n\nThe\n\nBring me\n\nDo it you will\n\nAnd\nYou know\n\n\n\nNa\nNa na\n\nNa\n\n\nNa\n\nNa\nNa na\nNa\nNa na\nAnd then\nThe\nBetter than men\n\nWomen\nIn the mid ... and\n\n\n\n\nWoman\nLady in them even though that needs to be greeted them\nAnd then and\nIn the Nineteen days\nAnd died vehicle\nLittle in the name\nFrom them\nIn the game you know good lead in the\nWhere do we have the right to be creative and innovative\nAnd some other should be limited to that in mind the wait a minute\n\nTrain a\nDown upon by\n\n\nOkay\nNo no\n\n\n\nNot\nReally [noise]\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n[noise] Mm\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\nOh\nNo medication you can register to vote it's a quick and easy process and can be done on line with a valid Connecticut driver's license you can go to the city of Middletown website\nFill out a form lifted under the important link section and register and minute if you don't have a DMV id there is a similar for me can fill out using your Social Security number printed out and mail it to your local registrars office where it'll be process the same day if you want to register here's some things you should know\nDifferent elections have different registration deadline the general election has the same day voter registration\nYou can go in person to city hall with his id and piece of mail is group of residents and vote later that day other elections may require registering months in advance though if you're already registered registering Connecticut will mean that you're no longer registered in your previous they\nTo vote in Connecticut primary you must be registered with the party that just requires checking off boxes you fill out registration for if you want to vote don't delay register [noise]\nYou're listening to ask you a point one Afghan Middletown, Connecticut number one college radio station [noise]\nSeven hundred and fifty five thousand vantage a big number to be sure but do you know what this number represents it signifies the total number of citizens in America arrested on marijuana chargers in two thousand and four vast right seven hundred\nOne of those arrested for possession only charges\nThe continuing marijuana prohibition makes sense to you it certainly does not to the national organization for the reform of marijuana laws and its members\nI'm real most executive director Allan St Peter interview to think that it is high time to end marijuana prohibition and replace it with the tax and regulatory policy please join and supporting almost thirty six year legislative efforts to reform our country's misguided marijuana laws\nYou can learn more about normal or become an active supporter by calling toll free eight eight eight six seven normal and O. R. M. L. or by visiting us on the Web as normal and R. M. L. dot org\nOkay that was hilarious um [laughter] you are listening you W E s U Middletown eighty eight point one F. M.\nI. M. D. J. O. areas and this is goats and kids where I'd Paris genre in a decade each week and examine the best that genre a decade now hit you some contemporary recommendations\nA night is going to be hold on let me make sure I can totally hear myself I'm\nPunk in the seventies which I'm very excited about definitely a different vibe than the previous shows will say for sure because\nReagan jazz pretty mellow and\nThere isn't any pretty end um so the first song is going to be blank generation by Richard hello who was I guess a big name in that like CBGB's seen this whole era of like which I'll be playing more of where it's going to be like a lot of\nYou know New York dog like hasn't Patti Smith queued up going to be it's gonna get\nOkay ah I you know what I Do\nAnd I I don't want to hear all of it and like really really hurt and it's really cold outside so I Hope everyone really warm oh no I was like all because he was\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[laughter] well now\nWe have to do with it yeah [laughter] but I'm\nSure they can say it\nLeave it in [laughter]\n\nYou get old name any but\nI didn't I didn't do we [laughter]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nSo that\nSong was off of like basically what happened was this guy was named Malcolm McLaren was living like went to New York and saw Richard Hell and like heard the song and basically went back to the u._k. and then\nHe with\nHis band diminished she went to these guys and he was managing and it's like ... I kind of want to create something like that\nAnd not saying that Malcolm McLaren had any hand and like the really into the Sex Pistols because that's like let's get let's get that straight\nThat's all Johnny Rotten like and obviously the other members but Johnny Rotten really like their their own thing but if you ever hear the song off of\nTheir one album I'm never mind the ... a pretty vacant is pretty ... to ... to ... generation\nOh by the Sex Pistols anarchy in the u._k. and then after that you know what I Do a more slowly but wow\n\nI I Am and I think\nThat I Know I\nAddress na\nNa na\n\n\n\n\nNa na na [laughter] mom\n... the phone\nYou know you got above\nLike going\nDo some ...\nTerms of what it is a long\nTime to be ready to go in and they're ready to go down the guys\nYou know what they're trying to do that on their break or related to one day or two here but it's not bad at all\nWe're ...\nAnd then they won't be as\nThe guy comes over and over again in the\nA new job in a in a\nNow and then I'll go running on a little more than just a\nAnd I don't know how long\nYou saying that I didn't want to be online\nChange in the long\nRun a na ...\nAbove\nIn after the\nOr na ...\n\nPeople in a\nThe change in the book\n\n\n\nIf you put on a radio there\nI Want to find him on any thoughts on it in New York I should say that all\nThese huge daughters began to that man by music you know that was a rock and roll\nJust buying all\nThe pain is just you know you could just go out and Dan Rather on stage and there was a\nRe a softball\nRe right oh\nJanet said would you just by\nIt so you know I'm not paying that go on the bus\nDo that to\nGet a car well you know way go down there at all\nNot just the giants do\nThey want an orange in New York City is you don't really watch is that all\nStarted\nDoing that you know what I meant by general\nThis oh the\nLast few children who are just days in general the main issue is that\nRight yeah yeah\nI was oh\nHey and I have huge now [noise]\n\n[noise]\nTo lead to them and she was just about five\nThat you know then the then tested at all\nThe radio you know there's nothing going on at all\nBut one of my own and she ended up\nWhat they did this one is that all\nBut she thought that they do that the music you know what I tell you what I hear your new\nBy the new change you know your ... then do a lot of the\n\n\n... and ... and then they wouldn't know all the way the same but the ...\nAge he come on and he lives in the ...\nDay with no\nI Would do\n[laughter] [laughter] no\nWay [laughter]\n[noise]\n\n[noise]\n\n[noise] sorry to cut that off a just want to say that that first song was rock and roll\n... underground and to remind gel that you are listening to W E s U Middletown eighty eight point one F. M. I. M. D. Jew Eris and this is goats and kids\nWhere I've been playing punk in the seventies and next we're going to go on to someone that was incredibly influential and just an absolute\nFreaking Mad Men and someone who I Do for the year and whose music I discovered from watching the\nE excellent movie called train spotting which is in it you know that opening scene with don't don't don't don't don't which I\nQueued up because I Do want to play search and destroy by the stooges unlike honestly the stooges in a pop although yes you pop business each like like a development so important that he'd like it's hard to do just but\nYou know what still two different times and he pops career [noise] grew I\nKnow I'm going to play that dog after this so you're going to get them back to back and you pop your research and destroy [noise]\n\n\n\nWow okay that was the hardest 'em by David Bowie which holy crap if you actually okay going to the bullied David ... like if you go to his catalog\nAnd you just look at\nHow much of that man\nReleased in to the world it's incredible because there's also just so much variety there as well like you went through the age do well and like he created so much different stuff you know there's just a lot to say like ... I didn't need it\nIt's not that it needs and isn't that are really the most current\nBut well sorry [laughter] my description says that it's like music that was also just by by this era\nAnd you know what these guys that about a play have cited a lot of the people in that I'd actually play tonight as like a big influence in their career and you know what college do freaking ... so I'm going to play replacement\n... ... ... ...\nAnd\n\n\n[noise]\n\n\n\nMm Mm\nNa na\nNa na na na\nNa na na na na na\n\nNa\nNa\n\nNa na\n\n\nAnd\nAnd that\nIs not that I'm not\nA man and then\nThey can be and then\n\nGoing to marry and\n\n\n\n\n\nIt's a dating [noise]\n\nAnd\n\n... na\nNa\nNa na na na na\nNa na na na na na\nNa na\nNa\n\n\nNa\nNa ...\nTV fans who want to hear the whole version of ... but fortunately not that much time and I want to get our current duck so you're in the ... which is banned that\nHave just one other song that I'm not going to get from the older album but still life is pretty dope as well as you want Iraq if you're interested if you like to solve the machine which still lives as well\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n... I'd like to report it bears citing Smokey Bear continue burning yard waiting he told me to remember that it's too hot you know nine out of ten wildfires are caused by humans I mean nine out of ten wildfires can be prevented I Know that now than it actually takes Okie\nGet your Smokey on always burn responsibly and contact your local fire department for open burning regulations brought to you by the U.S Forest Service your state or during the ac you learn more smoke ... only you can prevent wildfires\nMy name is Tom my name is Cindy we get to and volunteer with United Way at our community free health clinic we know our time and many are going to the right place since we don't just where the shirt we limit gift advocate volunteer Libby nine ... United Way an ad council and\nThis is willy Nelson from normal for Thirty years no one else has provided a divorce for the millions of Americans who smoked marijuana responsibility in Canada medicinal use of marijuana it's already legal now the Canadian government has announced that they will soon start arresting marijuana smokers altogether [noise] can learn much from our neighbors to\nLearn how you can contact normal at\nW. W. W. dot do or die or\n\nI'm Sarah and Allen one night I was at a bar one night I was at a bar I had one too many drinks I had one too many drinks I got behind the wheel I got a cat or all ran across\nI Wish I took a cab thank goodness I take a cab you have the choice to save a life bugs driving is drunk driving brought to you by the department of transportation and the council\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [laughter]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n\n\nGood evening everybody you are listening to W E s U middle Tony point one FM\nDouglas's definition thank you so much for tune in everybody for joining in this Thursday evening friday morning as per usual we've got an e muggy and he did talk and talk and in fact we're in the stock stock one night whoa although we'd do on brand of quiet\nYes um\nJust heard the theme from shaft by like a ... is that kicks off our theme of this week which is jazz in movies I didn't like the the the scores of movie yeah\nAnd that was the theme part of the score and we'll hear from other musicians who played in a composed\nThe score for other movies such as parents Blanchard and the new movie black klansmen directed by Spike Lee and even a strong from like panther as well from last year ... and in between that are going to throw some new song so we found\nRight now probably around mid term time so I think we said that for the\nPast three weeks it is it has in it has been like that I I'm feeling that I have just\nI'll be doing paper or writing a paper in between bricks I'm a social thoughts everybody stressful right\nNow who will be an stress because it hasn't been easily I mean given your my blessed full thought ... ... ... and everybody else has had a bit of a week\nAnd needs to kick back I say do so I say get some tea going get some other liquids if that's your thing wash your hands who may make wash your\nHands big wash your hands this is the season of coal and bacteria spreading around ...\n... like make sure they take care of yourself I think it's really important I've known a lot of people around me who have gotten sick a ten foot mouth to not\nThere is [laughter] for our listeners who don't go to ... billion or or don't go to school around in a\nIn Middletown um there's ... mouth but it's usually something that babies get I'm going around well then I also hurt here it's only around Gail and maybe darkness as well whoa it because college is a breeding grounds for now it is because people have terrible hygiene I think yeah\nDon't wash their hands ... so everybody washed their hands drink water kick back and\nEnjoy the rest of our show which is\nAs well just a knockout performance um\nShould I say something beforehand before we go yeah yeah the ... on this program the views of the individual broadcaster and do not necessarily reflect of youth Wesleyan University or the W E S U management\n\n... ... in which he real not suitable for children sensitive listeners if you were offended by profanity please peanut allergy few questions with a W E even teeth in the in the city policy please contact your board of directors that there are sixty five\nA that's a movie to see that you haven't seen it you should see it if you should be and you should do nothing going yet don't ask anybody about it I was gonna say if you've seen it don't ruin it for your friend I think for the full effect of the movie yeah I like you must for those who have seen it um\nOr critique away I think some people saw it as a this is a black comedy as a dark comedy yeah no no but I Would like studying their whole ... ... ... yeah\nUm which I think people do pick up on but definitely I think about\nAnd we'll say I'm a force anybody but think about that one that's an excellent at the end with an excellent John track to boot\nI'm interested in um tonight that's what we're playing plan some yeah in randomly idea it was like what I've seen some good movies with some cool music let's put that on the air I guess the up stuff that had ... ... jobs or jobs a jeep and\nNow the last two not so much we have a chapter I guess not really that much either um unless you're an ad argue for some fusion\nOf some form of some sort of however we do have more or less fun yeah yeah I'm a more funky um [noise] we do have later on in turn splintered what that might be more jazz yeah we're moving slowly more slowly slower\nThrough our music gets that high tempo at the beginning we liked that energy yeah we start off we start dancing in the studio ... and then we flew down to sit back down to deeper at\nThe end of the day that's all I Need some nice deep breath mix it in a couple of water a couple of speaking of which where's your water up\nRip the hydrogen out there um it's flu season like we said cold season um and even as even as it's even as getting colder here in the northeast and you should remind yourself that even though you might not be\nEven if you might not be Thursday drink water or tea I've been trained to do much got in the studio with me um\nYou're having a negative Allen's like Dallas leaders day three or four leaders three to four leaders\nFor announcing bottles I certainly don't do that but you know knowing that keeps you healthy you must have all the time yeah one day at a time to be where you know getting water by you don't have water bottle by a plastic one and reuse it the only ... yeah or they're not too expensive a target on the on line\nAnd get a\n... or ... or actually when I went to like buy like a glass that's important glass bottle like a a former lead snapple but not any more than ... some ... to ... ... and ... your ... your drink that fucking drink and then we use the glass because glass can be used\nAll the time or like if you have a pasta sauce and then the jar is a lot of glass and some of them are just like Mason jars like bam come up on a Mason jar with about\n[laughter] [laughter]\nI don't play with sound effects in the studio where would you do more effect stuff yeah we definitely should we had if you were voted you like to hear what would you like to hear sound affected behind that let us know at six or eight zero six eight five seven seven zero zero\nGot well wait wait ...\nI guess we get there a song about well while we're waiting for the rovers on\n... W E s U Middletown eighty eight point one F. M.\nOr line is eight six zero sixty five seven seven zero zero\nThis is Freddie debt\n\n\n\n[noise]\n\nThey do\n[noise]\n\nThings with the the first one the blood and soil we both said give us like a ... like on a limb we rode in a big\nYeah it was around like big sweeping strings maybe that kind of made a cinematic feel like you're sitting I mean I didn't see it in the theaters and thinking about ... about like how to listen to\nNPR it um but it does is a lot slower tempo sweeping instruments whereas electricity him to go more bebop\nStraight to the point like higher like fast tempo\nI'm so still owing a longer strong but then he goes to go back to the ... song about the ... from shaft and that was more kind of fun\nBrought back recurring themes of reoccurring um\nChoruses but not as consistent as being from shaft which also had vocal so that made it I mean in completely different vibe in the desert and before the\nTerence Blanchard pieces we heard friday dead seem super fly by Curtis Mayfield I'm going along with our theme this week ... ... jobs question mark\nMusic I guess it wasn't super job the obvious the laughter I guess it is a case before but I meant Christmas\nUm but yeah and then also interspersed with some slower tunes just ease\nMy and I found a place called ... June ... see a huge too but it's music\n... ... ...\nI Hope everyone staying warm tonight just quite chilly ... isn't quite as there's no ... out here in Middletown\nAnd or just want to wish everyone a or a warm evening maybe you've got a heater a space heater perhaps\nMaybe your base with heater do they have feeders in space\nHow warm yeah it's ... it's the the cabin it's got to be very and political or if they have the\nGreatest padding like in the studio they just released sound absorbent and cushy I'd love to fly into this while\nWhile no gravity [laughter] like the like the rain infant got like ...\nOut [laughter] yeah it's really ... you're on the ... worried about running into something I think if you're in an accident right you want to be bouncing off the walls [laughter] when they are a lot about how are they going to get into I don't know have you seen gravity\nJust get stranded out in space she has straight out and say she's like holy shit I'm running an auction I'm afraid to die in space who else dies space but no no no she like enters back into orbit and survives maybe she found a ... I don't remember how she got back to earth\nShe goes she goes to the other\nDidn't she go to like the germ of the Russian the Russia bay station one but that was also when it comes back it's right so that's gravity but that [laughter] replay or will tell you engine anyway a typical of jobs which has to be loved to chit chat ... um bring you in\nRight if you want to participate in the conversations eight six six eight five seven seven zero zero\nWould you take requests we do sometimes get people on their depending um\nStay tuned maybe we will have the one next week [laughter]\nWe will be on the radio I Will be on the radio tomorrow at six thirty with the Middletown Youth Radio projects every Friday everybody every Friday um we usually get organized drunk steaks at forty five Broad Street and then we go up and teach to get the basics about\nUm how to use the radio um gliders and everything and then also to like\nHave a half hour talking about things that they like and the lady like hear your own voice than like bring some contribute something to play like in public is really cool empowering for the year so I Wish yeah\nDuring the eight or nine or ten eleven twelve or Thirteen fourteen I'm I\nAm planning mean muggy at him planning on on doing it with stocks and talks later do you use your dealings are detaining so do you um\nCan uh contact me M. G. Brooks Wesleyan dot edu if you would like to be a ...\n... the kids and teens in the neighborhood would love to happy hour on 'em anyway yeah we'll be out here\nBut I'm planning on joining forces with a stock and starts here some weeks when I'm not sure about I'm a writer and we have more music\nMiddletown loving Middletown much let out those systems shout out yup I'm In the mood for shouts yep sat out the north and sat out their shot out you know neat north and action team mhm shout out\nPurgatory this new coffee shop in the north end purgatory purgatory right behind you lie cannons\nUm you got any shots\nUm it just was shot all the friends and family listening at home\nI'm shocked into my to my friends back in ... I'm ... thanks for listening and I'm with that we got we got a few more tunes for you this week um some good stuff I'd say I'm feeling\nI'm feeling like a more ... hill one I'm feeling\nYeah that's the next minute oh let's\nDo some mellow some metal yellow um I don't know if you guys know loyal corner be put 'em on the show before I think he's just he's very talented rapper new age out of London in the u._k.\nAnd with Jordan ... right out of Australia okay oh from Australia monster where does the and the owner and I thought he was from London to but I Know they called ... and right now currently like that's ... I think so they're like Lincoln at ... or something like ... excellent voice you'll hear him on\nAuto ... little corner of watching\nThe [noise]\n\nAnd you know ... the plate and found that that was starting to kind of felt ashamed\nOf it or not but a lot of good on a boat or mentioned the pause like about a joke a total of about what the\nBrain that the funding frozen club or whether you're sick enough and if it's a\nFought honeymooned a block of wood as soon as owning up there was a discussion about the comedy about nothing up and suffer video three days a remedy get lost on ... that might be the last rebel held you might be against would be the start she don't we don't need to be Frank with you know ... off the phone and\nPlayed this way a way\nTo make\nThey stay in\nThe sad thing and then yesterday [noise]\nA big occupy the Bible I was reading ... was misleading\nLike what the root of the way to get to keep it that they may not get sick a problem with changing with the the the shady food for free on and say what's called the ... the bin Laden opportunity was treatment fruit and filed but not one to see the images relief and not just with the lady could see that she was screaming\nIn part because you have done if mom's tickets to the public here this time it's in the moment so to but I'm afraid that you know and so what's the thoughts of wanted to follow up on the show because I wanted to put a hard look all over the last one to ... to round up a ton of fun to bomb on the games don't tell what part of the shooting up if we can step up with the mom\nWas born and\nMade the krona wave a new way\nTo we just have to say you know within\nThe sad thing and yet the day\n[noise]\nNo way they would be sad\nThing and yesterday\n[noise]\n\n\n[noise]\n\n\n\n\nI'm Sarah I'm Alan one night I was at a bar one night I was at a bar I had one too many drinks I\nHad one too many drank I got behind the wheel I got a cab or all ran across the road world ran across the road I Swear to the cat worms I hit a guy the caddy shack next to a guy I Wish I took a cab thank goodness I take a cab\nYou have the choice to save a life bugs driving is drunk driving brought to you by the department of transportation and the council\nIf you're over Eighteen and arrest live Connecticut you can register to vote it's a quick and easy process and can be done on line\nWith a valid Connecticut driver's license he can go to the city of Middletown website\nFill out a form lifted under the important link section and register and minutes if you don't have a DMV id there is a similar for me can fill out using your Social Security number printed out and mail it to your local registrars office where it'll be process the same day if you want to register here's some things you should know\nDifferent elections have different registration deadline the general election has the same day voter registration you can go in person to city hall with an idea and peace of mind\nRegistering Connecticut will mean that you're no longer registered in your previous state to vote in Connecticut primary you must be registered with the party to acquire checking off boxes he thought legislation for it if you want about something like that just [noise]\nMy name is Tom my name is Cindy forgive to volunteer with United Way at our community free health clinics we know our time and many are going to the right place and we don't just where the shirt we limit gift advocate volunteer living on a good living on a daughter were brought to the United way an ad council [noise]\nBoy [laughter] so you you you know Governor Cuomo recently announced that the groundwater in upstate New York got contaminated\nWith radioactive waste tweaking from the Indian point power plant\nOr to make matters worse the ... energy corporation is preparing to construct thirty five miles of new pipeline to transport practice gas running within Fifteen hundred feet from the nuclear plant the expansion project named the Algonquin pipeline appropriate indigenous people the linguistic group by perpetuating climate colonialism\nShould the pipeline burst the power plant could explode\nFor more info go to SAP twenty sixteen dot org\n[noise]\n\nThink frogs electric frog offer frogs\nCricket frog to face rah rah falling\nSimultaneously W. E. F. U. middle [noise]\nTo W. S. U. Middletown eighty eight point when I found in your host DJ monsoon views expressed in this program with the use of the individual roller coaster and do not necessarily reflect the view\nView was in university or the WTC management knew if you're a long time list as of this show you all know that I Love music that needs compound adjective\n[noise] they they Japanese ambient music\nNow today I have a duty fuel this is a Japanese ... ...\n... jazz bass stage dark ambient album I don't really have that much to save you I'm about this album because I only found it two days ago and I cannot stop listening to it it is an enigma to me and I hope I'm it uh you got enjoy it\nBecause I certainly has now I'm I'm going to dedicate this show to one of my best friend\nUm who is currently living in England\nAnd uh unfortunately right now she's asleep because it's six o'clock in the morning that but when she does listen to it um I just wanted to say happy birthday on yeah and ah I Hope you enjoy the to the track\n\n\nIn the evening and bringing the main thing that\n\nThen\n\nUh\n\n[noise] [noise]\n\n\nNa na na na na na na da da da\nDa da da da da da da\nDa da da da da da da da da da\nDa da da da da da da da\nDa da da da\n\nDa da da da\nLine or\nHand they're not really on\nNow now\nNow I don't\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nAnd\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[laughter]\n[laughter] [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nAnd that was quote by June ... much I Want to be playing to the song one of which I kind of get out of my head recently\nIt is a ... foot slash stunted by rule\nOf Roy ... groups from his album if you know 'cause ... sending you referred to two specific avenues in power and so I think this one has to be referring to perhaps a favorite aunt over we grow our group and I hope you enjoy\n[noise] [noise] [noise] [noise] [noise] [noise]\n\nTraining wild animals to do things they don't understand takes for routine discipline with a hook with with the heel of boat shows the animal exactly who's the boss don't patronize animal acts please contact people for the ethical treatment of animals seven five seven six to ... ... e T eh\n\nIt's a scorching hot day imagine being trapped\nComfortable it's dangerous if it's too hot for you it's far worse for him because unlike us he can't perspire to cool down and within minutes the temperature even with the windows down a little can exceed one hundred degrees so warm days please be kind of your dog Safeway at home\nFor more information contact pita seven five seven six two two PGA\n\nWilliam Shatner and this was Jimmy animals like Jimmy are often left behind but people fleeing hurricanes fires floods and earthquakes these abandoned animals cannot survive on their own you must evacuate your home please never leave an animal behind if you absolutely cannot take your animal with you I Believe I'm helplessly chained\nCaged many animals die because they cannot escape fires are rising waters animals need your help thank you\nCopied it today seven five seven six two to Peter\n... Hi I'm Sam Waterston more than six million Americans are losing their site to blinding diseases such as macular degeneration and written I just pick Mentos but there is hope\nThe foundation fighting blindness is leading the charge to find treatments and cures for these devastating diseases for free information on the latest treatments and research or to find out how you can help call the foundation and\nEight hundred eight for for one month something for\nThat's eight hundred eighty four four one one something for\n... you're listening to W E s U Middletown eighty point when offend\nThe butter fingers and it's a pretty cool and they hear in Middletown, Connecticut but hope too warm you up with all the tune tonight uh in the first song will be playing it's called ... by a Japanese jazz fusion band called ... square off of their album paradise\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\nYeah [laughter]\n\nThe\nMillions and millions will be a\nMaybe\nA ... billion when\n\nMany people all the time it was not the way you know being on\nShow you know [laughter]\n[noise] [laughter]\nNo they know they do [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\nThat they are going to get out to get up in\nA new thing is binding\nManning up there is going on and we need to be a new thing in my\nAnd the teachers\nDo that in the wild where you know I'm kind of you know you have\nTime to time\nYou\n[laughter]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nCan do that and I'm now demand\nKids you may be a given\n[noise]\n[noise]\nEnsure that go get married don't [noise] nice\n[noise]\n[noise] I can tell you that much [noise]\nI'll tell you that [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\nMm\n[noise]\n\nWithin [noise]\n\nTuesday\nMitigate jaded\nThey are not\nThe\nIn the in the\n\nThe [noise]\n\n\n\n\nNa na na\nNa na na na na na na na na na na na\nNa na na na na na na na na na and\nTime for\nIt I Am\nThat [noise]\n[noise]\n\nYou're listening W E s few Middletown eighty eight point when if I'm\nThat last track with cod Casio by jungle off of their brand new release\nFor ever um junk all the band from London england and the song right before that was caused quite style bike as general um get Johnny Was from Brazil or off the album Cuban so I'm In the next track is cod\nMama magma live I live up by ... uh the ban from its Sonia\nUm\nScenario momma momma blah blah blah\n\n\n[noise]\n\n[noise] mhm\n[noise] mhm\n[noise] mhm\nMhm\n\n... na na\nNa na na\nNa na\nNa na\n\n\n[laughter]\n\nNo\nWell calculated to keep you in oh\n\nAbout ... the ... [noise]\nShould scale set still don't have to show you\nDarling cigarettes and written especially by cigarettes and do you buy cigarettes [noise]\n\n\nOkay\n\n[noise]\n[noise]\nI\n\n\n[laughter] [laughter]\n\n\nCome\n\n\n\n\nContinuing sexual a treatment for an aggressive fifty five year old woman unable to come in Brussels today the Trump said Senator John McCain and attorney general Jeff Sessions will fleet their country to think well Russian collusion glue the Irish prime minister says\nI think uh uh but not a button that uh\nHe says he's glad this is NPR News I Do\n[noise]\n[noise]\n\n\nNation young lady she was ... and\nIt and\nOh\n\n\n[noise]\n[noise] man horse race mass [noise]\nBy money Schwartz project from the new album postal code for ham look it up\nOn anywhere diaper sometimes\nBecause of daddy flatulence any problem with the drinking liquor on Tuesday\nIs he still doing that because I'm not a I had why I was\nReferring to you but he ... our other friend he is definitely still doing that and I tried to stop them given me out of your child she should get to how they'll come back to many invited me over for food peaches and\nProperties and beer and stuff [noise] next thing you know I mean I made one small comment [noise]\nMaybe distracting pinch hitter needle or something\nThat you can't even flying in the inner tube language Oregon\nWho says I'm over here and tell me you don't want to watch me kill him I shall\nI in your area and watch me write songs than that just taking it lightly\nYeah Noone next thing you know we're talking about Irish revolution going back to\nStay one you know she eats\nSuddenly she learned academic knows all about all except worse life he doesn't do a single\nAbout anything except for ... she does like a box at the foreign sounding name but [noise]\nMy my very best friend turning\nActually he probably wouldn't have liked him anymore [noise]\nHanging around what I Do too much diversity actually that was just wondering as many problems or else well let's not talk about the dad [noise] although there sure are plenty that I could talk about God was lost a lot of friends and last year [noise]\nYeah definitely and they're now here around\nWill necessarily loud enough to be able to make say hey shut the beat up you know when we say thing we can even make up and say about people that aren't that either in large their fame or Dominique [noise]\nA long time ago days it was actually after our French has died and we we kinda regretted not [noise]\nTrying to take better care of him or something [noise] pay more attention when you say it'll never said what was wrong\nFor would never said that he had\nThe military has [noise] you never knew that [noise]\nWe would you said afterwards he said\nWe should we should try to treat our friends like they're already dead [noise]\nOh I heard that from a very firm strike a pathfinder oh but but he doesn't believe that any more he's the opposite of these pronouncements he like\nDoesn't show up a lot of times\nThat many calling out stuff like that [noise]\nRefuses to refund my laundry tickets that will like last week I had three hundred dollars to\nPut in some kind of falls funding in Argentina or something [noise]\nBut at least you have said geniuses to talk on my time I mean I if I\nActually do have have several sub being friends that live not far from the little\nTime I'm I'm In this [noise] it's not a big old empty house it's medium size house was one\nInstant I mean it really original and and are are really fun to read and [noise]\nA strange kind of a page Turner and sticks with you you you know you you put the book down after you're finished doing your business and the bathroom or eating or ex meditating\nOn it or whatever and you're [noise]\nAnd then but but you your\nMind keeps thinking the same a\nFuture vocabulary of the out of control and oh that's in your ...\nThat's that's cool to hear this very lovely to hear because I was hoping that that would happen once in a while because I noticed\nA shortage of is the issue rather than as a reality for two people actually kind of escape in this world scape into this world by reading it and stuff like that carried away never mind and I was so ...\nWell you know the problem is that I have um you don't have an agent and neither do I ah I Can't be your agent 'cause\nI don't know how to be an eye on you you know how you have to be an Asian as you have to know everybody\nWell it's a little late for that I don't have the right hair cut anyway I'm not going to Jim looks older people we know are all dead or well that's an agent who was really good Jane Jordan Brown in Chicago and she died\nAnd show you and uh\nThen I later I had an agent you did too but he was a sub genius say what he didn't stay in agent for long and he didn't really know everybody because he wasn't as old as sophisticated as her in fact he was just a sub genius from Houston\nA regret ban but anyway um [noise]\nThe the first thing it says in the in the first paragraph you read on the homepage says we're publishing again and we have a book out called neighbor road and you click on that and there you're buying it you know\nOr even reading a sample of it on the Amazon or whatever 'cause you can do that\nAnd read the first few pages I Can't\nSay this is wild and crazy it's like clockwork orange but how come Stanley Kubrick not making a movie I think we're actually maybe ... Snyder would make\nThe movie now yeah but um [noise]\nOr Terry Gilliam\nSeemed like that would be that way it is a lovely it's devolved to have\nAn ex python which is once again you said it's not a reptile right now the\n... and ... I mean in a Monty Python it sort of metaphor or something\nOr metaphors and snakes are often confused\nWell anyway tell young hairy alien going on so we assume\nThey're confused actually they had to hire a direct\nTerry Gilliam would be the ideal director of the movie of neighbor world but um that also risks being cursed a lot of his movies first although I understand he's finally gotten the getting to make his donkey hotel movie [noise]\nBut uh who else would be a good director for neighborhood gym jar Mitch Jim John [laughter] I'm clear on it yeah [noise]\nI might even do it in black and white you know just like that man did you see dead man\nOh yes several times which showed that it was it was the last what was the last movie shown by Dr ... before he died [noise]\nYet it left me with the strain\nString theory and the funny thing you know as he dressed up like a woman and all that that I enjoyed that that movie was shot\n... drills for Twenty years he he's the only guy who is that every single seven AM besides me\nUp until last year\nHe's quite a funny fellow yeah\nAnd and here he when he was a his main drive in fair was great bad films are not the same old ones that you've seen a million times like plan nine but a really unusual\nGreat bad films are\nAnd how that was the last day he was out I think he's suspected it might be him he's he he uh\nBrought a copy of every movie he had ever shown in those Twenty years ... days which is always like two or three a night and a\nOut of all of us bad films in different movies for the crowd really most wanted to see was the one real good movie in the stock which was a dead man but Jim ... is one of the most amazing westerns I've ever seen and uh [noise]\nIt's just bull daughter as hell yeah that all of the character senator right Johnny Depp is great and uh\nOur Crispin Glover is in it and there's just creepy thing a Billy Bob Thornton plays a transvestite\nA bandage that is just kill\nAnd a ... on there to Jared woman yeah ... I guess it was Robert ... last movie right it's it's really an amazing\nMovie maybe maybe\nA little uh\nI'm\nLike oh why\nOh\nThat's fantastic it's fantastic yeah I Would I Would have come over here but I was a I was stuck in traffic\nOh man how was it wasn't that traffic animal it was great how and why it was a great\nIt's great I mean we had the best traffic in ... everybody complains about it they're like you know I noticed is like running theme of people being like able to show animosity towards other drivers\nBecause of the bears\nShortcomings even though there are probably being judged by the drivers and other cars at the same\nTime like you know I I I always think of like when it comes to like ... in the horn if not me then who\nWho who who who would who would uh\nBombed the horn in traffic if it weren't for if if I don't you know kind of thing very very uh you\nKnow gone to quote un yeah gone I'm a conservative views of horn yeah so basically only when they really deserve it and do you have a car when when you have a car I also don't have very very conservative uses roared and see if you don't have a car I Do yell at drivers so and the place of a horn\nYeah and she's not the same as like while that's happening and you know put a you\nKnow that's actually more dangerous 'cause you don't have this false sense of security\nThat a very thin aluminum walls or whatever was that we drive around in the newspapers and walls of cars that they now make\nFiberglass yeah fiberglass and uh and uh I think plastic plastic\nIn the desert tears of foreign children yeah there are some of them\nWho used to be as like the weather nice there something probably well we should not and I don't like it is\nHere in Texas that's for sure [laughter] but anyway but I'm I was like the prosecutors few everybody complains\nAbout how awful the traffic is really to try it gets quite it's the best traffic there is compare our traffic to anybody else's maybe LA has better traffic but we do but I mean like the nights are pretty great travel that's the nature of traffic is traffic yeah it's like look at it it'd be in traffic is doing a great job you know not unfair\nTo bumper stop and go really eat just even just gridlock like you've done is that is amazing [noise] gridlock let's beautiful traffic one time I was in traffic with my friend and I couldn't read her weird map\nAnd so what's the point if you're not moving anywhere well it was stop and go on a highway but it was in New York so it was a lot of stop and go so what we did when I steered the car from the passengers me she operated the break and looked at the map and I basically told her when stop [noise] see and it's so much safer\nThat way than the way I did it when there was nobody else on the road so zero traffic which was horrible\nBecause it just right and I'm like I'm like eighty\nEighty miles an hour down the highways and Kansas granted there all straight lines you know one time I ...\nBecause their their papers and I'm sitting there reading I think it was Thomas pension\n... paperback or something to that effect at my friend's steering wheel\nYou like just this will be hilarious just you know kick your feet up if you feel like it sounded like he's Dr basically driving the band from the passenger\nSeat and I'm sitting there reading a book and then I realize how stupid that was but uh we\nStuck with it in a cave and for lack of anything better day he nurses and him back to health because they both have like ... bad when so when he can walk again the wolf can walk again they end up working together and it's you know of course what you're seeing is the big\nAnd it's you know since they're caveman uh there's not much dialogue and it's subtitled 'cause they're speaking\nIndo European or whatever and [noise] um\nDo you see the check it or anything to try and get closer huh they try to get close to a new European some kind of ...\nI don't know how how hard they try it I Know that are on on what was it not to\nThe audience and you know [noise]\n[noise] [noise] I think that's\nActually alarm that tells me and\nThe pit bull to take our pills [noise]\nI'm the I'm trying to re are anyway this movie al ... is a [noise] it's it's photographs\nIn Greenland and a similar in Canada\n[noise] it's just gorgeous ice age landscapes and [noise]\nHe absolutely the most realistic a\nPrehistoric large mammals I've ever seen and I go out of my white and see synthesized giant\nMammal some bully runoff sources and stuff like that saber toothed tigers ...\nReally really good movie [noise] um [noise] you don't have to be able to to hear [noise]\nUh to to enjoy it [noise] and\nIt's not about Indians and a lot of ... comment or seem to think this is Native Americans it's like oh he's stupid Anglos don't you have any idea where everybody used to be like that\n... that moving from place to place living outdoors in\nHide\nShe's been thrown in with people have been in jail a lot before [noise]\nAnd ah most of them are real nice people\nBut she can't leave the level of sheer\nIgnorance about\nEnvironmental thing science things plain ordinary you know every keep keep you know keeping your act together then yeah uh\nI'm going through a lot of that too right now I Can't believe how dumb well not gone\nUninformed it's like they're all they care about is a celebrities\nAnd they are my my sister was trying to get them not to waste water\nSo they would do courtesy flushes all the time and you know she's more of a if it's in our letter yellow she also worked as a a water test her so she really knows her water stuff and and my dad did it does have the water treatment plant named after him\n[noise] sounds like Chinatown where we had kind of as he was just thinking it has [laughter]\nHas\nThis talent like all other towns would you can't go on groundwater forever it's going to run out\nYou can we know it's running out or you're a lawyer Raj ... so they\nBuild and man he helped the town build a man made light anyway\nEnough of a the great we stand clan or\nAre we talking about\nHow great neighbor world is or how wonderful er jak says it and instead what we were talking about yeah neighbor world by a whole this Dave de Luca\nIs that's actually the name on there\nAnd I actually had to go fun we account now\nWhole name you had to find it by knowing the name of the guy that started\nIt yeah you don't have to do that any more or less to do long term cowboy day my name oh really\nYeah for like go find me and lonesome cowboy dies [noise]\nOr just have to say de Luca\nIs bad for her to have the\nShape both know it has to say the last thing that is correct but it has to make sure there's a capital D and the Capitol Hill\nLucrative that sounds like a foreign name hurt our flavors your planet but people are um wait I Mario ...\nBack that we knew Carson we knew Carson was of genomics do and\nWho is a large Carter was the more I thought he had pills are filthy acres\nSaddam my children I mean I [noise]\nWell I Know you're a some kind of a foreigner\nI'd I I'd I I I got ... Martians or there's lots of good Martians because the margins lawyer invented to their bases [noise]\nIf you if you cross that didn't you can grow up a whole measure stuff\nI served with a bunch of Martians they was just as David ... every day was just as much my friends is my own earth or sell us we're\nI didn't know your way Trish I thought you were a full blood drug drug in American Boy\nI was I was in the the the space waitress war is hell yeah I'm a veteran I get the party and it's better place you down by the tractor supply\n... next week's show you got a promise for your show everybody your um medals murky ... forget our guy\nShow show everybody your birth\nI'll show you my birth certificate ... take up big oh look at that ... out on the table\nA group ... it looks like I'd be rightly beef heart dodging it\nYes you know we wanted to give it away from me before it's dark vomiting usually\nYou know I should cut your captain beef parks are near I was listening to all real captain before for what Nineteen sixty seven\nMirror manned\nTwenty fifth century Quaker marriage rights\nTo do\nMe\nPay the pay isn't\nRight what would be the level of quality and dignity for the people who live in the future agreed upon solution and there was one absolutely incompatible future with their lives they shouldn't have those rights which is what we're living in the ones that reality does include within it a perpetual occupation\nWe're going to end it here and then we're going to continue in ... and posted online under went back to that democracy now dot org\nGuy an ad in the executive director of the human rights that line to fight for only the second time before the U.N Security council speaking in Gainesville, Florida it's nice Melbourne, Florida tomorrow ... or ... [noise] [noise]\n[noise]\n\n[laughter]\nFrom KPFK Pacifica Radio in Los Angeles this is rising up withdrawing Ali and on your whose son on equal have car where on line that rising up with on on the dot com in today's news headlines President Trump has announced that quote certainly looks\nLike Saudi Arabian journalist and Washington Post columnist Jamal ... is dead\nAnd that there will be a quote very severe response from the United states if it turns out that Saudi Arabia sorties were involved in his killing at the Saudi conflict in Istanbul, Turkey where he was locked in\nTurkish ... they they have what are your evidence and one Turkish stores says they played it for secretary of state Mike Pompeo during his visit this week and that he was given a transcript\nOf the audio recording upon has returned to the U.S pumps failed briefed the president on the matter\nAnd then spoke with reporters outside the White House\nMade clear to them so we take this matter with respect to Mr she'll be very seriously they made clear to me that they understand the serious nature of the disappearance of Mr ... Chevy or they also assured me that they will conduct a complete\nInvestigation of all of the facts surrounding restrict your show you that they will do so timely fashion and the fifth report itself will be transferred for everyone to ask questions about enter require ... and I told President Trump this morning that we ought to give him a few more days\nTo complete back so that we too have a complete understanding of the facts surrounding that which point we can make decisions about how the United states should respond to the incident surrounding Mr ...\nMore Saudi Arabia [noise] continue to be important German tourists are foreigners have custody of her to holy sites or they're unimportant retreated\nHawaiian of the United states and we need to be mindful of that as well\nThat secretary of state Mike Pompeo speaking with reporters after briefing President Trump on his trip to Saudi Arabia and turkey\nMeanwhile a surveillance photo was leaked to the press on Thursday showing a man who is part of Saudi crown prince Mohammed bin ... entourage\nPresent in Istanbul at the time of ... that the parents according to Associated Press the man identified by Turkish officials that ... has been photographed in the background of prince Mohammed stripped to the U.S France and Spain this year\nTurkish officials say he flew into his ... any private jet along with an autopsy expert October second I'm left that night\nThat was the same day that 'cause she'll get entered the Saudi consulate in Istanbul never to be seen again [noise]\nMeanwhile international business partners have continued to drop out of Saudi Arabia future investment initiative\nIn the wake of craft show gave it to the parents on Thursday Fox Business news which was the last remaining media outlet left auto pulled its participation earlier in the day U.S Treasury secretary Steven Mnuchin announced he would also not be attending [noise]\nPresident Trump on Thursday attended a rally in Missoula, Montana head of his appearance ... senior the former state a GOP chairman made a provocative statement on Facebook thing\nFor all the prospect of attendees to the Trump event come early both to all your protesters show up as well this is the field and open carry state and we know how to use them\nThere were protesters ready to greet the president in Montana as Airforce one was in the air ... might have applied some local landmarks\nOne of the state of Montana by twenty points in Tucson sixteen during his speech in Missoula on Thursday Trump continued his and his party's favorite theme of promoting violent like praising Montana Republican Greg Gianforte for voting a guardian newspaper reporter last year you're smart\nAnd by the way never wrestle him [noise]\n\nAnd the guy that your body slammed my [noise]\n\nI had heard that he body slammed a reporter [noise]\n\nAnd it was way up [noise]\nAnd he was way up and I said oh this was like they\nOpen the election or just before\nAnd I said oh this terrible he's going to lose the election then I said well wait a minute I Know Montana pretty well\nThink it might help him\nThat President Trump speaking in Missoula, Montana on Thursdays celebrating congressman Greg Gianforte the told a reporter last year mature John forte pled guilty to a misdemeanor assault last June and was sentenced to a hundred and eighty day deferred sentence and forty hours of community service among other penalties\nA defamation case that was brought by a woman who had accused Trump of sexual assault continues through court and on Thursday the question came up of weather in New York court could send the sitting president to jail for refusing to comply with an auto\nThe case brought by summers ... centers are on Trump calling her a liar after she revealed his actions against her to the public\nLawyers for the president are asking the court to dismiss the case or postpone it until after Trump believes the presidency according to a beat Thursday's court session focused on one of the Trump legal teams central arguments that he's sitting president\nLooking into the widespread sexual abuse of children by Catholic priests in Pennsylvania that took place over a decade\nThe Justice Department of the ... secret files and testimonies and what is apparently the first ever such investigation at the federal level earlier this year a grand jury report issued by the state revealed that more than three hundred pre cut abused more than a thousand children over Seventy years\nAnd that higher up in the church had covered up the abuse unprotected these predator priests\nUp until now only local and state authorities had investigated church sexual abuse\nAbused survivors have reacted with optimism about the possibility of a federal investigation\nThe state of California is considering the sentence of up to four thousand inmate some state prison who are serving twenty five year to life sentence for two years ago voters passed a ballot measure to approve parole\nFor non violent felons were sent them under the draconian three strikes law a peace side of the opinion if one expert on the lawn Michael Romano of Stanford University\nAmong the four thousand inmate he estimated will be eligible for parole\nOur clients serving life terms for stealing a bicycle but nothing less than half a gram of methamphetamine dealing two bottles of liquor or shoplifting shampoo they are disproportionately black disproportionately mentally ill and statistically among the least likely to commit additional crimes\nThe Trump Administration on Thursday issued an emergency filing to dump the progress of a lawsuit being brought by dozens of young people against the government over negligent on climate change\nThe unique case had made it past several court over the years and asserts that the federal government has violated the constitutional rights of young American by ... their futures and failing to stop global warming according to Bloomberg News quote older the Supreme Court rejected the ...\nThing it's Brett was striking since that order was issued the Senate confirmed justice Brett Kavanaugh to succeed the retired Justice Anthony Kennedy\nThe lawsuit began on to President Obama and the majority of the plaintiffs are teenagers and that does that for our headlines today\nAfter the break we'll examine a new report the details how the ... tax reform law worse than the existing racial wealth gap in the U.S my guest Emanuel and the other with prosperity now with the guts to report he is co authored\nBen Simon ... Smith will join us to examine the ... the Susan\nBut then I don't really want to take a DNA test\nWhat we find is that you know I'm white households tend to earn more of their income from investments\nUm business activities capital gains things that are taxed at a much lower rate than you know income that you earn in a traditional nine to five\nUm and the the the same is true in the opposite way for a black Latino and Asian American households where they are in a considerable amount of their income from traditional wages and less compared to white households from investments 'em and capital gains\nRight so will this law now make it even harder for households of color to catch up to their white peers right O D ready it was hard enough\nTo catch up as well to passed down from generation to generation does that make a African place that are continually benefiting lights over people of color these are of course by a season privileges\nNot Trump and had based just don't want to acknowledge but there there we know that their study after study shows that there does this tax reform law make it even harder to catch\nIt does so you know I'm a among the things that that the tax law did do was um lift the threshold uh for the estate tax and so families now wealthy families can now passed up to twenty two thousand\nTwenty two million dollars that's basically you know free pass to pass on wealth of the next generation at no cost a without paying you know a fair share into into our society our system um but really you know when you break it down by race um it it it definitely does make it harder for black and Latino households in particular but really households\nOf color more broadly 'em to catch up um and to reach parity with their white households or in terms of of of wealth and and and assets um and so you know when we break down the data by race we find that\nA a on a yearly basis white households on average get about two thousand dollars I'm from the tax law I'm black and Latino households get about half of that\nI'm given the disparities that we know involved you know whether it's with or without durable goods are worth durable goods\nThe gap is really you know it's large and so if you just keep compounding those dollars on top of the few that that folks have white households will always be ahead um while black and Latino households will be far behind and even you know to just kind of um uh to to to to put a point on this interreligious emphasized how how far behind these communities are [noise]\nUm you know we found that uh that if the wealth trends had continued over the last thirty three some odd years you know absent any other changes to to what has happened you know in terms of wealth or in terms of our country\nUm it would take a Latino households over two thousand years to just catch up to white well you know getting that same year over year return on their wealth\nUm and black households right now I'm as it stands accent this tax cutting jobs that\nI'm with the their median household wealth hit zero and saying you can imagine that a tax law of this size and um this cue to the very top and particularly you know a wealthy white households will only make I'm catching up harder if not him\nTo really make a have a level playing field to help those Americans who are consistent left behind because of their race um to help them catch up and instead we saw the oh\nYeah absolutely so you know we the Congress had a a really a tremendous opportunity you know a initially it was one point five trillion dollars\nEstimates more recently are are hanging the the law about two trillion dollars um you know with two trillion dollars you could have done a good deal of of of of work\nTo help um family ... like you have mentioned who have been left behind by the economy who are really not felt the gains that that I've gone you know that have gone to to producing record highs on Wall street um that have kind of boost it up the economy and and had gotten up to a point where we're in you know one of the longest most sustained recoveries in American history\nUm you know with those dollars we could have been proved the earned income tax credit I'm a providing additional dollars for for a low wage workers who have children those with al ... children early supplement that that that that the low incomes of make to help them you know get a little bit more slack and your budget to move up the economic ladder\nUm we could have provided support for household to um our cost burden by rent you know the the soaring prices are brands but also how tussle household you have that dream of becoming a homeowner\nI'm you know get a little bit more support to maybe get a down payment or start getting into that home\nRight 'cause ... building right you could pass that onto your children that is\nThat is absolutely well building and and yet so to me we absolutely missed\nA tremendous opportunity not only to help communities of color in particular that that would have helped me become really our household um because when you think about it across the board middle class households give out two dollars and twenty five cents a day from the tax law a while the wealthiest one percent of households um are getting ...\nOn average I'm a hundred dollars or so a year and the wealthiest households are getting that in one day I'm so it's really you know it it upside down and it was a missed opportunity and if\nYou know I think we need to go back to really reevaluating this law and and and correcting these things I'm a to be able to boost the economic outcomes of of low and moderate income families are really struggling to get by\nAnd of course the real uh go the one of the ultimate goals of the Republican Party pushing these tax\nCuts through was to be able to say oh look we are running such a big deficit a despot created by giving away so many tax revenues now we have to cut so called entitlement programs and of course that term very deliberately um designed it to generate\nA very particular approach or view of Social Security Medicare Medicaid or what do you make of Mitch McConnell claiming descent anything that the Republicans did um it's\nThese big entitlement programs they're sucking up all this money that we have to do something about\nI think you know that that ... well I think it was a it wasn't in a and expressed kind of um sentiment throughout the debate\nUm but but those who who work on on on tax policy here in DC and throughout the country\nUm understood that behind the price tag of the one point five trillion are the two trillion dollars was really kind of the end goal that we weren't kind of a ... we weren't privy to if you weren't paying attention to really end goal is\nAnd you mentioned um using um large I'm spending towards providing both building to those who don't need it um to to be able to kind of reduce the size of programs I really do help families not only make ends meet but uh\nSupport that they need to be able to move up the economic ladder\nAnd of course those who don't have those assets um do you know if the if there isn't it existing racial wealth gap\nPresumably communities of color households of color are really my thing on Medicare are relying on Medicaid are relying on Social Security in their retirement years to to make ends meet I mean our white poor white households of course\nYeah no absolutely and you know their houses of color are are more likely to be participating in some of these programs that um\nThat Mitch McConnell had mentioned in it are there is mentioned in terms of you know looking for deficit reduction um but proportionality and we have to remember also that that are the majority of the country\nOr is white and by extension this will impact all household um especially health of the color but white households won't you won't be spared in production to these critical programs as well\n... now are the Republicans want to make certain ... certain parts of the tax cuts on JOBS Act that were set to expire they want to make them permanent any new round tax or from two point oh and I'm Wondering if you have any opinions on on what's planned\nSo you know the house recently propose a number of bills and and ended up passing them before they went on recess um you know if those bills were to become law it would only it would intentionally fry and the disparities that we have here and there would inevitably\nLead to cuts in programs that we really do care it's unsustainable to you know it's unsustainable to have\nA the tax it up in jobs that are out there at the moment and in a ten year window but it's really you know it would become um almost mind boggling what we have to do or what to do to our\nOur deficit in our budget if we had these provisions permanently extended and even if you do currently extended you really just permanently extending inequality because those bills don't provide more ...\nWell for the most economic resources while riding very little if anything a household you really need\n... what needs to be done based on the report to that you co authored raised wealth in taxes how the tax cuts in job jobs not super charge of the racial wealth divide what advice would you give said you know the a few ... potentially future house speaker Nancy Pelosi or the you know in coming of\nAnd say something now but again this is just basic this is just this would be like like I said in my story if somebody in your crew has gone missing every time forgive me hits the fan what why do you think that it's okay then you show up now and it's that it's not it really is\nNow uh the uh you I understand you were a journalist with the Indian country to the media network at one point and you try to reach out to her for an interview\nWe did yeah every time something when uh you know every time we wanted to ask her a question about this parent it's playing you know she ignored us\nShe ignored us like an ex boyfriend or girlfriend and that bothered us like okay you claim to be a part of the ... the community or you claim to be native why are you wearing knowing is and why you ignore native journalist why not just answer the questions what are you hiding from that you have to hide from indigenous people\nThat was the problem and now she comes out with this DNA test and but that doesn't demonstrate that you're part of the community there's more to being native than what you see on some broad strokes DNA test you have to be a part of the community you are responsible\nTo to respond to issues that affect our communities and not just show up when it's convenient it or is it seems as\nThough a time and that this was a claim that she made at a time when she was obviously much younger that she you know just kind of stuck with and hoped it would go way\nBut of course Trump who has an attack dog mentality refused to let it go away and then in the dead of distant vowing it and saying you know what I should never claimed this she dug their heels in and try to run up Trump who is a master at manipulation and attacked tactics and it seems like\nHer play failed disastrously\nOh did it really did she doubled down\nSomebody said natives are being used as a football between the two these two white people are throwing us back and forth and just because somebody claims that their native I mean it it I understand finally learned don't disabuse people of their family lore but she's perpetuating this\nHorrific culture of taking from natives and I said this on Twitter that they take our land they take our water they take our kids they take our culture tradition spirituality and now they want to take her identity and\nI don't think she understands the repercussions of what we have to face with indigenous people when we go to apply for a job for example people will show up and claim to be a quarter Cherokee hopefully to get that job\nBut now people can go and that and instead of saying well they're going to follow what Elizabeth Warren has done and they're not going to claim to be Native American they're going to claim to have native heritage\n... these are issues that face our community with so many people wanting and we don't know maybe it's sending it started around you Kevin Costner dances with wolves all of a sudden we were cool that one point nobody wanted to be Native American we were demonized it was a bad thing to be Native American and now\nJust tons of people are trying to feel this ethnic bankruptcy which is claiming to be Native American for first selfish gain and now\nPeople say well she didn't claim it for selfish game she changed from white to Native American while she was at Penn in at Harvard but no you're feeling so you're filling some cultural or social capital there might claiming to be Native American but again it's more than just claiming you have to be part of the community\nYou have to say something when it affects our community just like standing roasted police brutality women and then murdered and missing indigenous women as she hasn't said anything only until this year\nWe did have mattered if the DNA tests had shown a much greater percentage of whatever I mean we're you know ... is that something that's not as relevant\nClaim as ... she's been claiming to be indigenous for a long time so my question is where the hell have you been why why claimed to be native and they just walk away and then right now it's the equivalent of she just walked in the room put the DNA test results on the table and walked out the door and let everybody bigger and fight amongst themselves\nShe has a responsibility here she has to say something is well she can step up and say you know what I wasn't there I should've said something I Will be there for you guys in the future she could say anything to that effect\nBut she won't and she has it why not why I think she didn't know what you did she did the DNA tests yeah\nWell she's running she we know that she's got to run for office that's clear\nReason she has to address indigenous people now she's a ... up to this point but she has her eye on the presidency she wants to lock that democratic nomination that she's going to need the stamp of approval of indigenous people\nNow I don't think she is falling into the the you know the nastiness of what Trump is adds that attack dog\nI think what she's trying to do is she knows that if she's going to claim to be indigenous and this is going to come up on the campaign trail she needs a stamp of approval from natives but this this just she shot herself in the foot with this I don't know if she has any Native Americans that are there\nCounseling her telling her maybe don't do that but\nThis was a stupid move on her pardon to think that Native Americans are just going to sit back and go okay you guys take her land culture water or whatever and yeah go ahead and take our identity just because you're a Democrat\nNo you you we have to hold them even our allies we have to check our allies out the door we had to check our allies out the door at Standing Rock we always have to check our allies and we have to hold her to the same standards as anybody else in your responsible and you are accountable for what you do don't do say and don't say I don't care who you are\n... what about the fact that the leading geneticist Carlos Bustamante has put his stamp of moving he's basically conducted the past and\nShe could have some sort of connection to an indigenous person is far far south as South America so her story is changing she went from Cherokee to native to now native heritage and we know this is a slippery language and that's the problem we know slippery language slippery language\nHow justified what they thought was the just taking of our land you know\nBut for us it was like wait a minute that's not that that's not what you said well you know we wrote it down is how it is and we're dealing with that again we're dealing with slippery used car salesman language was like whoa I didn't say Native American and said I said native\nHeritage I Am not saying I think that a lot not the kind of thing that Trump sounds all all the time right\nOh yeah no this is old and that's what people are missing as natives we you know we know that there's gonna we're gonna have slippery language from the government whether it's Democrats or Republicans but in this situation again through simulation through language manipulation we're supposed to just go okay and we're not we know this\nFor hundreds of years we had to deal with slippery language just like this and there's going to be negative repercussions because on the local level not just on the federal level not just the Trump Administration\nLocal people non native people around native territory's reservation areas sovereign nations are working diligently right now to dissolve are sovereign teachers make is just a race and not separate sovereign nations for their own selfish game and little do they know are a little does Elizabeth Warren though she's feeding them fodder\nThey're gonna that's that's their argument there saying that it's discriminatory for Native Americans to get special rights and they're just a race of people and should not be considered a political who was her statement right now that's what she's saying that by race she's native\nI see what I think some of them so it's essentially a reductionist approach to native communities um to identify them purely by DNA and genetic surrounded denounced\nOff determine who is a part of our community and who isn't and it's dangerous and I I really have to emphasize this a lot of people come into our communities and just take\nAnd not only do they just take our land and take our water and take our kids historically they take our cultures they take our language and they can modify it\nBut it's really dangerous a lot of people come into our communities and take our spirituality there was a situation about five years ago where a guy took ... ceremony which is a sweat lodge and killed a bunch of people because he didn't give them any water in it because he didn't get in that's not how we operate we have\nIn the ceremonies and there are things that we do traditionally so that nobody passes out\nAnd that's that's our sweat lodge and people take this and they can modify it they take our image and the amount of fight that's why you have the Washington football team that's why you have the Cleveland Indians is the the Kansas City chiefs we know that they take and they just keep taking and she's participating in a culture of taking away from natives and telling us that's it sorry\nNow or in your op ed time in use or identify as a democratic socialist um are you disappointed that somebody like Elizabeth Warren has seen edition too deeply insulting the digital community also we sabotage ... leading progressive Democrats\nWho have the potential to be a you know to beat Donald Trump\nOh yeah no I unfortunately that's that's the frustration for a lot of indigenous people because we look at her and we agreed with their politics center policy but the problem is it's like every time we turn around but no no no I I support your voice I support your community\nBut whatever regardless what you say I Am Native American you're kind of like to see that's where you're losing us that's kind of like anybody like your friend or your cousin where you agree with him but then you have to wait a minute now you took it a little too far dial that back and then they need and then they don't they doubled down so we're really disappointed that somebody that could probably knock\nFriday October twenty six in Middletown each six zero sixty five three three five five Wesleyan dot edu slashed the uh\n[noise] [noise]\n\n\nOkay welcome to another edition of carnival or radio critical lander of from a long absence back in Studio be along with Marty ... studio be and a curse I'm your Red Sox fan at all\nI Am not a Red Sox fan although I'm very happy they're going to the\nWorld Series I think that's tremendous and it would be well Red Sox Dodgers I think would be good for and they'll be probably more than Milwaukee I Would think although Milwaukee to big baseball town I think by ... feet with LA though yeah no doubt it'd be interesting um I don't know I don't know what the ratings and I have no idea\nHow 'bout you Marty you I I don't know about the ratings but uh [noise] you know if there are a west coast game that killed the on the east coast with all that's trivial up till one o'clock in the morning till the eighth inning so yeah 'cause then they'll start games or like ten ten thirty\nOr nine probably nine yeah still Chris what's on your mind says you haven't been here in a while\nMy goodness you know it's tough when I'm away from the show\nAll the time I'm like oh I Wish we could talk about that on air oh that'd be great and then when I'm not hearing you know there's so much happened in the news that is so\nInteresting to debate and talk about [noise] so hopefully we have some callers today but I was thinking maybe we could start with the mid term election and maybe kick around what we think is going to happen in this momentous\nElection and I was hoping maybe we could talk about\nThey are going to lose the house\nSo why don't we kick it off with you what do you think\nI think that the Senate is safe for the Republican Party and I think in light especially of how the Kavanaugh hearings played out I think the Republicans are likely to pick up to the beach would be my gas\nAnd they increase their majority nominally from fifty one fifty three and then in the house I'm going to bet my heart because this is what I also hope is that they narrowly hang onto the house and keep the majority with only three feet to the good\nAnd what happened to democratic leadership if that happens\nI think if that happened um polo see will be out as speaker but Schumer probably stay in are the minority leader position although that ship and then I predicted a few months back when I thought both of them would go\nBut uh the Democrats seem pretty United I don't think closely probably if they don't take the house will be replaced\nAnd Marty what do you think happened I think they become\nEven more irrelevant or even in their own party because we don't really know who wins\nUm\nI think that they started raised who's going to be really closed because I'm keeping a close eye on the one in Texas or because even the people in Texas are pushing back on cruise actually cruises expanding easily visit oh yeah\nI thought I Want to work or raised was something like nine billion dollars a month with amount of money at all and I also\nWas good at hiding who he was but over the last couple a debate you know yet so Cruz is like a nine point lead now\nOkay but that is the key Ted Cruz should fall dial that would be troublesome but\nI don't think it's going to happen I think um and there's also a chance to Scott\nSo yeah so I think they pick up and lead to see them already what do you think happens in Congress\nWell if those things come to fruition and I think the Democrats just to lose you know all of their mo Jo I think they're thrown all their eggs in this midterm election basket or what happened to Congress what happens to Congress becomes more conservative in the Trump within the play oh you're not\nListening ... what happens to Congress you think they the GOP still holds onto the Congress\nI mean that's what you guys just as well so we had who cares what that's what I agree I agree you know that uh uh although I Believe that the fact that there's so many women candidates and some of these swing states that I'm hoping this blue wave\nIt's kind of a pink wave a I don't know whether we're going to pick up enough seats to\nA ... switch the the vote count but I think we have enough votes maybe to switch the attitudes of some of the people who are are serving so uh I think the people that will be replaced being Republican\nOr you know will be replaced by women but I don't think it will be\nReplaced enough where it will be able to change the the direction of of the car I think if\nYou're I was a betting person I say pick up two seats in the Senate and might lose the house by a couple of scenes and Chris what would that look like if the Democrats actually took control of the house\nThink then it would look like a two year election cycle to the presidential election where you are largely get\n'em gridlock with a divided house and Senate added ... Trump or Trump\nI think it would hurt Trump then in the sense does his ability to govern and get through things approved through the house in the Senate throw that in that way yeah that's a negative and he has been able to accomplish\nBenefit to him not necessarily the party but to hand okay\nLet's see what Mr Cain and said well if the if the Democrats took over the ... the house or it's going to be one subpoena after another they're just going to go after him willing to do is an\nAwful strategy I agree with you because it's going to show what duct tape party the Democratic party\nIs going to be a little bunch of revenge factor either because and nothing will get done the capital the cabin on hearing did not help the Democrats two years of that because the Democratic\nParty of course I'm biased jerk Landrieu has gone up around\nIt it seems to win and a four Republican Donald Trump because of his many negative attribute\nActually with Dan that stuff's much better because he's a kind of a jerk to begin with um can I switch gears slightly I wanted to ask you because I think Jeff one on one of the things that\nMight become a big election issue is dead [noise]\nUm migrant trained you have all these people in South America that are making their way no how are they getting here and I'm not sure but there was\nAlready but who's funding it who's funding it just happened spontaneously to two thousand I Would have been going on for a decade\nI happen to be the next week I I read that there's four thousand but now that\nAnd it has been going on in the decade I think though what will vote out though is added right before the election it yet but it's getting a needless getting media attention and so now both sides are going to try and use that to advance their degree without so who's going to get the better of that\nAnd how it plays out if there's a let's say a children separated from their mothers which though the press will be gunning for could hurt Trump with women probably wouldn't have Trump with women\nAgent on our border and ah and then when they hear the Democratic embracing it and it was a these people are not\nSo do you think it's somewhat today October nineteenth do you think they do\nA big impact on the election or they get something that'll clash by and then you go\nTo all played out it is a funded operational move without any doubt you have any thoughts Martin you're related to fund it operation\nI think it is funded operation and I think both sides are gearing up for the battle I don't think either the Democrats and Republicans are anxious to see the issue go away they want to each side promoted and I\nDo you think the Democratic view Marty on open borders helps or hurts them I think it hurts them a little bit at this point because there's been so much shown on TV that you know the violence that's coming in but the the separation of the families I think is really been the the Achilles heel on the entire process so the fact that we've\nTaken these kids and now we don't even know who they're connected to the parents have been deported or that one time they were in some sort of foster care where they were able to go to school\nYou know that in the middle of the night there take it out and put into these tent cities out in Texas I'm where\nI'm so there's a lot of innuendo as to how you know what's happening and why it's happening and how are we going to reconnect and if I tell you a big mess there\nAnd and it's all a and it's actually obviously\nOrchestrated with the children so they can get that effect\nWell the Republicans that are moving it I mean the Democrats aren't running these camps\nDealt with it they're the Democratic operatives people like sorrows other groups are funding this operation purposely having young children there to get the effect is\nI also believe that as I've read a few times that there's some loophole in the law that certainly if we're going to have a Republican dominated Congress that they would have been able to close these loopholes relative to\nAnd unfortunately and a lot of community that there's there's a shortage of that and to advance to the point\nOften people that are really passionate lead against Donald Trump have a difficult time articulating anything intellectual policy wise that really bothers them let's see what my\nThe personal wise thing of power which I think Trump is personally are brought to an art form that now the world's leaders are actually doing\nA they're personalizing power\nSo when he goes out on the on the campaign trail when he says you know the referendum as it gets me against them so you know he's not even asking people to look at the particular issues at hand your support me so that that kind of takes the intellectualism out of it and and it keeps it that the emotional levels\nSo I think it's a good point because the color what do you think Marty's point about that a Trump make emotional by saying basically you know things like Pocahontas him saying like Marty was saying that it's me against them and the Democrats are um violent a little\nHe's he's he's not only not afraid of around the joy of people on the\nYou got ... percent\nReally upset but you know what it is that he does have horrible weeks and if you try to articulate core beliefs to people who just say I hate you I don't care what you have to say\nThen it kind of just the walls in that type of conversation I haven't no one really likes the proper safe no one like the lack of ability but you know try try to have a conversation like that I'm telling you over Thanksgiving dinner and it's going to get really really ugly\nBut what what is the earliest when you're in your in your bottom they don't want to hear it but in your estimation\nI mean you know Christian already brought up good points I've never and getting even with Reagan there was a little bit of that uh but does it mean you could get in a fist fight what what are you thinking you're learning opinion I mean because you haven't done anything to justify what is the emotion of the emotion analogy of this all about\nYou're asking me up yeah I think it's just it's just gotten to the point where it's\nA differing opinions about a really social issues weren't even on the main main brought up and it got down to like what's the best way to run this what's the best way to regulate regulate this those credit clever stations to argue with you on and then getting a you\nKnow go out for a beer later or they call a thank you for the call I think that's an by the way that's an excellent excellent boy that is the quintessential point the salient point and criticizes the thank you very much to it it's all about if they use to trim around the edges and they could go out and have a beer\nNow there's no trauma in one for open borders close borders ones for socialism the others for capitalism and I think with Jerry written a mentoring and other factors\nThere is no real incentive to get along I think it went from\n... with the gentleman lead disagreements today actually hate each other absolutely there's no beer no no there's no need to get\nThe White House after an hour ago and I think it's ... Ronald Reagan diametrically opposed but again I think the caller is really really really really corrected Tip O'Neill they were both feeding from the kind of staying there were nibbling around the edges you know they didn't\nTip O'Neill was freaking out and calling Reagan a Nazi before his tax cuts they were like this is you know he talked about putting things on your credit card someone who's a Tip O'Neill did at him might have had some good points about that but they went out for a beer I think Chuck Schumer and Donald Trump\nHate each other you know they hate each other\nSeems like it I bet when they were in New York they probably got along and pal around they just by each other yeah and and Chuck Schumer will do anything even if it's in the country's not in the country's best interest to take out Donald Trump and Donald Trump and do the same thing vice versa is that how it is Martin it is that I had really good for the country\nIt was rather than more of the partisan issues uh I I don't know where the hell we're going we\nHave another caller coming in and we have another call but let's just talk about that first caller one of the things I Love about doing the shell Marty is that we have great callers\nGenerally sometimes passions wrapped in we can get a little volatile but for the most part we have good constructive conversations whether the call is agree or disagree with that in a minute welcome part of my ... down here and\nWe got a caller speaking of that color you're talking about the debate which debate whether you're talking about like the one that happened on Wednesday which one you're the gubernatorial debate over ... you know something I Can't I Can't watch it because I'm going to throw up because Ned Lamont good and when I'm going to have to shoot myself\nCan you got to get another four years of an eight year disaster with the only the basically the worst governor ever oh my gosh can you believe what I mean how long is Connecticut's D. U. N. B. dumb then you're going to double down\nOn Django Pima Lloyd the men's the candidate of all governors it's discouraging that is amazing and you know what Ned Lamont he knows how to do it because you know something even a broken clock news right twice a day\nAnd I am right on this one today because I said that years ago Reagan even Clinton\nThe economy was the economy stupid now its identity politics are almost equal where basically you know food table concerns that is you know your livelihood and I think ... knows how to play you look at his website it\nSomething about guaranteeing equal pay for how to guarantee equal but still it all started basically discouraging meeting more businesses with that's possible\nTo ever really were located intended they don't want more regulation less so we're going\nTo nominate the only person that could lose to Ned Lamont thank you very much for a job right like gosh\nI mean my God I mean can you actually you're going to drive this poor woman to drink well we're going we're having right now we're having cocktails it's so bad I feel\nI feel the same way I'm I'm hoping that you know because it's been really quiet\nOn people are not really talking about the ... election they're talking about the election and how crucial it is you know nationally but I haven't really heard many people in Connecticut talking about their opinions as\nTo [noise] I don't know how a sane person could say you know the eight years of dental Pima lawyer looking you know pretty good because you know something I'm really for greener pastures so I Want more businesses to leave and Dan I'm a lawyer did a great job in medicine companies leave so let's doubled down\nI don't get how anyone could vote for Ned Lamont but he's unfortunately going to win I think\nI think that you know everyone it's all you know like a ... Williams highest Trump Trump Trump Trump and that's all people are hearing and you know we are a police state here\nWell and you know why they're getting most of the red people who are red Republicans are leaving the blues are staying\nAnd they're not going to get bluer end blower and we're going to get bluer in terms of starving of oxygen um yes so I knew before I let you go I took a nationally what do you think of the midterms um there was the blue wave now it looks pretty ... you know odds on the day of the Republicans might actually\nPick up a couple of days and then it what do you know they're going to do when they are Congress\nI think it's a trickle\nDown there because I think actually you're right I think if I was going to bet they they pick up a couple of feet in the Senate and they ... mayor the Democrats made tip the balance\nWork Monday and being fussy\nMan I don't think we're just so\nWell Kavanaugh hearings I mean that did not do well for you know when people see the craziness and the Democratic party I think it doesn't exactly um it doesn't exactly help\nBut you know people are just they're just getting to their side they're not like the previous caller you can't even\nTo a person on the far left you know hey Thumper Republican ideas are actually pretty good or you know what don't you like about this particular person here is the you know that here's this system here is the problem here what's being fix what's not they don't even want to hear that\nThey say I think it's all based on Marty Anchorage said that is it's all based on emotion and it doesn't go well as we close out thank you for the call I think it doesn't do well bode well for governance but we thank you for the call All right thank you very much she brings up a good point ah Chris\nCan you know you predicted it and by the way with\nTwo great callers we invite other callers to join in ... to zero\nSix eight five seven seven zero zero six eight five seven seven zero zero six eight five seven seven zero zero you listening to carnival or radio on W. years few eighty point one after him and Middletown the views of carnival or radio or not the views of Wu if you or was it mean university\nBut anyway the skyline besides that actually is decreased like they knocked down more there's has it changed since I was in high school to shame\nLosing the only thing that they've done positively which everybody was a little reluctant about was the yard goat stadium\nSo that northern end of hard for you know it started to develop a little bit will be extra to see if they follow through on knocking you and you're absolutely correct there was a good thing\nAnd it ... you still need this you do need but you know like I always wanted to make Hartford attractive ... landing all that time it goes to bring in Ukraine the river back yeah riverfront we all went for\nOr do they have the whole riverfront waterfront\nBut because people live in Philly\nYeah and people work in LA have know what does that in hard may have brand new skyscrapers in Philly yeah because they have economic growth they have they don't want to build ... than\nYou could actually do a strategic planning Philadelphia is actually a great place to locate because it's a little bit less expensive than New York you have an amazing not like Connecticut will use to you've actually ever great talent pool with other universities and a great place to do business anyway changing gears\nUm we've talked about Connecticut we still hold on the table for our callers eight six zero\nEight five seven seven zero zero six eight five seven seven zero zero\nIs it too early to play the funeral march or in the funeral business Marty your family is um do you think that they're the one big funeral home maybe for Connecticut or is it too early for that I think it might be a little bit of it is unlikely pre arrangements rearrange was yeah they're they're printing everything\nI'm now winners and losers of the cabinet here though it's funny I think I'm Richard Blumenthal they named Dick or Chris your hair he actually\nWalked on how to how did he lose on that though oh God Chris I'm surprised he got a lot of air time no lawyer because holier than thou liberal forgot what he said ten years ago when he\n... he had to Latin quote about once a liar always a liar gets what Richard you're a liar and an end and unscrupulous liar because you're talking about ...\nPeople that actually put their butts on the line I thought he was a big loser he came out\nAs part of this charade took us something about Richard Blumenthal even though he's a radical socialist he ... he can portray themselves as aerial died thinking you know we'll ... we'll measured person but he got lost he got swept up in the charade like the rest of the ... so what did he lose\nOh he's going to win well he'll he might face to the bartender again yeah a lot of the fifty shot anyway so let's talk about other losers I'm Elizabeth Warren big loser willpower to Marty first\nUh I think she might have rebounded a little bit with her DNA tests\nOver the last poll you if you watch MSNBC prompt or how do you think that the ... they already and I would take the ... the guy that you know she challenged Trump on his family is that if you prove\nThat you're Native American I'll give you a million bucks and she proved that she was in ... a Native American\nNative American it's like one one thousand ...\nI don't think I don't know what they do not like it's literally a generation ago but here's here's the question Marty respect no no you know if they could check\nTen generation right away but she went to Harvard and allowed Harvard to promote her as hiring minorities and the first Native American higher if let's say you take the average ... H generations away that that that's not an\nOn a generations away creates if you did your DNA you could be and you have like a billions Eskimo when you I mean it's so yeah it's a point right it's like a plane and if it's not like one tenth Native American\nIt's like I Am as much Native American or everyone wanted me to every person there ended have\nEither been guys done your DNA take I have not about twenty or so so that I think I don't think she proved it because it's even hard back yeah is it that far back and and you're never molding you're having your employer promoting you as a minority higher I think the quarterly wrong\nThat just how far back in the percentage correct there's the percentage basically if they skied obeyed her that bit of an eye or a Native American first that's how much bloodshed yeah okay\nAnd a little bit because now they're facing charges for yeah they got older the missions issues and think oh and then we'll stop\nShe opened up a can of worms because I'll do my DNA and I might have won the same amount of African American blood yeah right yeah\nBut but ... with the war in Africa I think different than you Marty now that she won't even run she won't even run for president they always do bad for her that she won't even one of the Democratic credit card it out and to add\nI mean I Know MSNBC that it was amazing and she'd be Trump no even democratic operatives\nSaid basically it's embarrassing\nThere really is though democratic candidate right now Cory really gone Cory Booker the United ... you know she's certainly not good and I think actually I\nUm you know Governor Cuomo is the probably real you know he even though he's a left wing gr\nHe can fake yes we can\nEven though with America was never imagined that a couple of weeks ago that health but he can pull off Cory Booker is a clown you bankrupt Newark he's he's a ...\nWhat the what the expression Marty I'm\nThat history doesn't repeat but it rhymes that is that the expression I I think that the next presidential candidate is going to be a governor from a a small and mid sized state that we're not aware of now which is how the Democratic party turn themselves around after the Reagan Era when they found Bill Clinton I had to do that\nBy the way it was but it wasn't in the atmosphere of sight of psychopaths isn't which I just made up how about another way to hold on to do it because Clinton came in you at a\nRelatively relatively moderate democratic ... yeah I mean I think they spit out their young now if you're not you know a lockstep with Chairman Mao you're finished in that party and\nI it does not look like clean old choice I agree you're not going to but Billy Bob from ah\nElection goes the way that I think you'd hope it does and the Republican retained both houses that the Democratic party is going do not all down and they're going to go find some way actually I agree\nWith that Chris your great point if they win even hold on to some victory like the house then they'll go upon their their their path of destruction if they lose the house and Senate then there's going to have to be a um a come to Jesus moment\nBut already is right do you look at Kamala Harris Booker I'm Elizabeth Warren I'm Michael ... start to look at the names going around it hard to envision them\nHaving the shop\nTo put a price on it now and then they'll get eaten up speaking of presidential candidate how about ... guys if these which is part out not that\nThat that's more likely to me than the labor or and good\nThinking yes ... switches parties and as big sermon on them out I've been a Republican for sixty years\nAnd you know as far as they bring back the party versus the personal I like that it's now speaking of presidential candidate to look like and you know that one [laughter]\nI think the um I think um what do you think actually Marty on this one that uh that uh Hillary Clinton there's operative thing that she's actually eyeing well\nShe can I all she wants to be crazy to get involved with that again I think she would I think she would relish the fight but I think she actually you know delusional at this point\nBut I'm I'm assuming you're a democratic I'm registered voter Marty and let's assume you are if you don't want to disclose it either way but if she was running in a primary how likely would it be that you would vote in a primary not against Donald Trump but in the primary how likely would you be to select Hillary Clinton\nAgain too I don't know you know so I mean if it was a primary there's always the other day that\nI think most Democrats I think all the time\nTo sweep out lots of people yeah and start to bring the American vision back to America what is the Americans and I don't think we have one any more I don't think we do you think we have um splinters of vision and and unfortunately\nWithout the behaviors internationally whereas before they might have been measured as to what America would think about it now everybody was looking Saudi Arabia now anybody well whatever they want to do because they know that can get away with about\n... what do you think the real quick before a buzz words and then what do you think the ramifications should be for Saudi Arabia assuming that I Would have to assume that it did take place right took place well I think\nThere should be some sort of sanctions economic sanctions that that's what I don't want to I don't want to lose them as an ally in the ... and I like\nThat yeah 'cause 'cause they're big bulwark against Iran what do you think should happen Chris\n... it's a tough question because we we need Saudi Arabia with all of their fault\nAnd it's the cherry street throw down starting at eight pm with okay and the night crew heavy neck or thunder funk and hard luxury they're twenty Eighteen Halloween bashes on for Saturday Night with plague of serpent kill the Straggler and more\nYou can catch poppy car ... and a mean minute Sunday night details at WWW dot Facebook dot com slash cherry street station\nThe city of Middletown holds its annual ... festival in downtown trick or treat Saturday from eleven named for pm enjoy pony rides games food vendors face painting in a magic show costume contest and more\nFull detail that WWW dot Middletown the T. dot Gov slashed recreation\nNow here's a run down and send them off the beaten track in central Connecticut's\nHartford surreal outweighs continue the run of ... about an artifacts heist in medical in Mexico city and three or six Hollywood the documentary of two filmmakers exploring the home of their dead grandmother\nAlso ... continuing is Cassandra infinity about the radical artwork of ...\nThey also open all about Nina a tragic comedy about a female comedian check the website for details and screening times at W. W. W. dot real art whiz dot ORG\nAnd trinity college is in the studio in Hartford continues the run of the captain historical doc you drama about a ... a World War two German Army desert or this evening they open eighth grade about an inch reverted girl surviving her last year in middle school\nAnd there's a one time screening of the Nineteen eighty eight comedy fantasy classic bill juice Saturday Night at ten pm check the website for all offerings in times of WWW dot in the studio dot ORG\nAnd now here's a rundown of tonight's line up here on WBFO you idiot point one after ... Middletown\nRight after the driving five stick around for a wild wild lot with ... stomach that Wesleyan music scene\nAt six thirty in the middle and Youth Radio project weekly radio program featuring the thoughts voices creativity in town at the kids in the w._b. su neighborhood from seven to eight thirty to universal sound wave with just the queen T a wide range of music including African reggae gospel R. and B. Latin and blues\nPlus health nutrition and stress reduction debts\nEight thirty to ten thirty feature Grand Central station with DJ Jenny do\nTravel travel back in time in the Nineteen forties and fifties with the swinging upbeat show filled with big band jazz swinging rockabilly anthem new releases\nUntil eleven thirty DJ cocoa motion and the music ... mix outages present strictly out the head alive mix showdown to fly or freestyle no pre planned play with mixes or blends R. and B. old school hip hop rapping house\nFrom eleven thirty to twelve thirty it's an anti B with DJ in every band hesitates animals into the unknown hidden gems songs played for band\nLike seventies to to thousands rock\nSeat to highlight the academy\nRounding out the night for three to five AM it's Louisiana barn dance with classic country western swing hillbilly rockabilly and Americana\nAnd that's all for today's job at five during the weekdays for fifty five for daily run down to very happenings in a rundown of evening programming a W E s U Middletown thanks for listening now stay tuned for wild wild life\n\n[noise] [noise]\nI'm Alec Baldwin with people for the ethical treatment of animals I grew up loving circuses and other travelling animal shows but it never occurred to me what life might be like for the animal\nTraining wild animals to do things they don't understand takes for routine discipline with a hook whip with the heel of a boot shows the animal exactly who's the boss [noise] don't patronize animal\nActs please contact people for the ethical treatment of animals seven five standing sticks to to the tea a\nScorching hot day\nThe temperature inside is rising now imagine\nThat you're wearing a fur coat\nLeaving your dog in a hot car is not only uncomfortable it's dangerous if it's too hot for you it's far worse for him because unlike us he can't perspire to cool down and within minutes the temperature even with the windows down a little can exceed one hundred degrees so warm days please be kind of your dog safely at home\nFor more information contact Peter seven five seven six two two PGA\n[laughter] would you ever sat there and this is Jimmy animals like Jimmy are often left behind but people flee\nPlease never leave an animal will hide if you absolutely cannot take your animal with you that really doesn't help just the chain key many animals die because the cameras skate flyers for rising waters animals knee jerk so thank you\nCopied it today seven five seven six to ... to ...\n... ... ...\nA\nDay\n\n\nNo no no\nTo ah\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n\nBunny ears but I'll go see\n\nThe light better way than it\nDollars when I first wrote a song on the base but I\nI've ... I've been doing um like singing and I'm a court for my entire childhood and high school and\nThat kind of where I'm coming from right choral music [laughter] and yeah and I didn't think I could write a song on my own at all that seemed to like really really impossible for very long time but\nSort of like a challenge it was it oh yeah show it was terrifying as an idea because I also like many of my closest friend\nAt Wesleyan are musicians and are like really impressive musicians who are like really trained and I really like so creative and really really good at what they do when\nIn making side so I just like it didn't really think of what I Would make would be\nUm up to par so I didn't do it and then the summer I just started I realized that I didn't have to like sit down with an instrument and write a song I could just like record little things on garage band and then cut and paste them a while and like start earlier in different things on top of each other\nAnd that made it just like way easier and they did that actually feasible process also I just don't like yeah I it's hard to not thinking layers so so being able to like like work on a loop and build up players over it and then like\nThe whole thing and now we're going to like [noise] absolutely I\nWas there a lot of time before where you worked in ... but like the execute like the software knowledge or whatever the execution wasn't there like it was something that was in your head and it was just a matter of putting it not a paper on on binary code or\nI think I'd probably still ... well there's probably like way more that I could do if I had much more saw her knowledge at this point\nAnd it's like it's a it's fun to like\nGet to know those things and then you can expand it but I don't really like um I I only use garage band and it's just like so it's actually just super easy to yeah to its way easier than you would think\nAbsolutely relationship because of drugs man yeah oh yeah on the diet that Ted tell ya [laughter]\nWait for that and I should [laughter]\nWell that's what that's really fascinating I was wondering I feel like your music um Israeli Polly phonic there's a lot going on there's a lot of really interesting town and I want and what I'm Wondering how you make those it's they're all kind of layer together into one of the whole thing but I Want to know a little bit more about the individual stuff you've put him\n... um I I uh let's see at the ...\nUm [laughter] I collect a lot of\nPhone recording the some of those have just have made it into some some songs\nI'm just sort of like different found sounds in different places but then also just like I'm recording\nRecording just on my laptop just creates like this funny like I ... I never in a secluded based also like only like recording in my bedroom when there's like this summer I was recording in my bedroom and my family was in the house and like would walk through my room sometimes\nRight middle or like my like mom would be like folding laundry and the other room and you can hear her like ...\nYeah yeah so all of those things come into and then just\nWas a really big [laughter] oh yeah ... yeah just like\nLittle like yeah just experimenting yeah I Wonder if that again to itself but the home I don't really\nI feel like it's really fun to hear your song writing process because [noise] it's almost like a lot more like a collection then that a lot of different\nUm I feel like people that we've interviewed here it seems like um what your occupied with it more of like the process you come up with something that you're satisfied with rather than\nUm you know thinking about kind of telling you already want to create and how you add to it which I think it's really refreshing and really awesome\nYeah I think it's a it's a much easier way for me to think about it absolutely and that also you can just like you can collect lots of little loop that just get thrown away also threat like that it's all sort of patched together and really great and it's not as much of a distinction\nConcept that we'd love to play another one of your stock there one that you would like us to to turn on right now\n[noise] um yeah do you want to play maybe like well but\nThe songs that I put out and do you want to play just like the first two sons\nCraig from the from dressing my best as one of them is only a minute and the other ... All right\nFor the ground or going to talk a little more with owner after this break and it's a these are the first detracts from her ... her the [laughter]\nThe Iraq go ... ...\nOh\nOh oh oh\nOh ... ...\n...\nThan the ...\nAnd do that [noise] ... ...\n\n... ... [noise]\n\n[noise]\n\n\nHello we are back with oh now on wild wild live I'm EJ ball sonic around to dip it in the city and you're listening to W. E. F. U. Middletown um we took them into two tracks from on a newly released ... what are the two long title\nThat a dressing my best and throwing up on them wonderful yeah\nThe bugs flow into each other so well I'm Wondering if like the creation of one of those songs like when you're making one or I don't know yeah process was when you're working on one in thinking about in relation to the others or the more you're working on one large thing and you drop it\n[noise] um yeah I think I Would I I wrote um\nThose two things are the first two times I've ever written and the first one I kind of like I spent a little bit of time at the beginning of the summer just like writing about a bunch of songs and there was\nThe first one was to just around it had a whole second half to it which I ended up just cutting\nUm and so I cut that second half and kind of like sort of just one site I cut it like once I had the other songs and realized that like\nI could make like a really nice arc between them if I like in the second to didn't really feel like doing that much so then like having that cut into\nTotally yeah and also thrown up seemed like it'd be good second time and yeah\nI thought how do you get the sound you use like an on line one or do you have something\nYou know I have like a little um I yeah so that's how I started doing\nNice that has like a built in suitcase to it but it's really like just like a toy keyboard essentially that that those are ...\nSo that that's actually really interesting that you got that instrument you have any intention when you got the sentiment to write songs on it or was it like you have so much fun that\nI'm at the for audience you are listening to you wild wild live a W E s U Middletown and we are here in the station with own\nWho has been self really thinks I'm really really amazing um tracked lately um and you can find them on SoundCloud under oh not dressing my best on SoundCloud and apparently she has a music video which is on YouTube and\nBut I'm ... I'm going to check it out right now we have so I asked yeah certainly uh we'd love to share with you of course but this being radio but the thing ready exactly um anything else I'm a ...\nYou can keep on listing on friday from five until six or five or something thirty thirty\nNext week actually yeah\nWe're going to be with I Believe ... safer absolutely um who are who is a great a social justice or in music organization from Chicago but are are are coming to campus so we're going to have them\nBefore they're on the middle Tennessee through your project but for now we're here with ... and she's going to share a yet on released song I Believe so um consider yourself lucky and a cigarette is [noise] [noise]\n\n[noise] [noise]\n[noise]\nDon't know I don't know and nobody I Know I don't know I don't know now I Know they\nDon't and I don't know\n[noise] [noise]\n\n[noise]\n[noise]\nWhat about the wild wild live on WB if you if you point one Middletown um did you begin to city and I am DJ both on it and we're so lucky to be here\nToday with on a music you have been hearing interest or what does that track that's called by ears rang I renewable yeah I really really love that one I was really wonderful they are you excited about it you feel I Am excited about it I\nYeah I like that when you um are you going to put it out or is it is I'm not exchange yeah that's sort of CBD I don't know what form it like yes eventually right oh you got to be like a multi media yeah oh yeah well it's yeah it's hard to say because they're already it's\nOh there's also a video for this one so then I don't know yet that DVD how that will be arranged but yeah eventually right\nSo can you explain the process of making this was this song was based on\nIn the spring of last year and give it to me and I just like sort of like that with it for a long time and eventually that were just like a few things in the ... like there's a there's some sounds of um like ...\nWhile walking yeah\nAnd and then like different like association that I had with it about like being like like\nLike when you're like running through water at the beach and you can't run very fast that was like before the similar and and the so then there were just like a couple of things like that and I was not really thinking that I was going to make a song at first I was thinking that it's going to try to make\nAn image of some kind and then it just I'm\nJust sort of a bird that that was I started thinking about different things and first was like oh I think I might do a video of some kind and then I I\nThe video of this like deer or like running around in on the each like running into the like I don't know I I found it on YouTube I don't know how someone recorded that or how that even happens we just um but I like messed with it and bring them to like\nDifferent um overlay things with it and yeah that's what\nIt just sort of came together I have not really I Can't really say but it was very much like I think I think I can hear a relationship between that and the other side so\nIt's inspired by that\nYeah that's great yeah how do you make your videos when you make the like the video that he made for the other song and yeah that how do you animate them or is\nUh no well I I've done that before but I did a not for that for the other thing was um it was just that um there's like a there's a website called archive dot org where they have all of this\nLike old but it did like media of different kinds that like a open access so a lot of it's really weird and a lot of it's really old or ... different so I I Want\nOn that website and I found one that just like a high school synchronized some tea but we are up some ... and the whole video at like recorded underwater you don't see like the above ... or I like that so that that's what it is\nAnd then I just like um like layered on top of it self because it looks like there's like multiple set the bodies were kind of like wild interact with each other yeah\nSixty line yeah [laughter] yeah I was on the line [laughter] yeah and\nAnd it's fun because when you do that and you get like really shitty quality ... in a really nice way like when you do too many layers that like it ends up exporting though we are looking right there's like these little like pixel twin goals and stuff like that and really\nDue due to that now that I'm thinking about the the visual component there are like a lot of sort of fate not vague but hard to\nDefine like some patients these are really been stationed all songs ... um are when you're how does that work like do you find that after you're in the song or are you thinking of images\nWhen you're when you're putting it together and um I think definitely after but\nI'm thinking in images I like I owe these songs\nI made this summer while I was trying to be working on my my visual art pieces and like that was what I was supposed to be working on but in dead\nI found myself like making dog felt more natural so I think it's like happening in parallel but then it starts to and I'm like at the same time that I'm collecting sounds I'm also collecting videos right so then it just starts to be like okay like it feels like there's an association between these are like there's some sort of common sense station\nLike you're saying like yeah I think that what ends up right like tying it together like if there's like a sensory detail that can sink up or a tone or\nSo compelling about your music and also you know knowing you\nUm how like there's so much texture and your music and a lot of um\nA lot of different tones and everything and it kind of you can tell that knowing that you are a visual artist as well do you have with all the music you find kind of like the mixing of the arts and the different media kind of a part of your own writing process more up to the kind of ... happened separately in our coincidentally kind of link\nHow I got to work that you're involved in so many different kinds of art form\nYeah I I think they do like the way that I think about them linking is like I like thinking about my songs as like ... and like like playing with like panning of different things in different places like really exciting and\nUm and like thinking about like different\nLayers of like taking it also like a lot of my yeah I think the process sees that I'm following are like really really parallel to the way that I make visual art because I'm so like all my work or a lot of my work in print\nSwitches than like kind of like built up through layering of different right like blocks on top of each other\nAnd and also just like a lot of my work is like it's pretty like concerned with like layers and just like different ways of exploring the I visually um and and so then that being\nLike the main way of like experimenting with I felt like feels like a natural um feels like a pretty natural progression totally I think\nUm yeah I don't know yeah\nThat's a great that's that's a really good though if it absolutely yeah um\n\n[noise]\n\n[noise]\n\n\nAt the judge said that I was wrong\nReally do was ...\nWas no no no no saying they don't feel as though and it was done to hold on ...\nAnd we're\nA big ...\nDo too she deserves to do ...\nDo I mean most of his ball\nYou know when you know the news you know going to be a blow to do a lot of Islam and ... ...\n... they were black and\nWith their bombs I can see are known to\nAround you understand ... ... ...\n[noise] [noise]\nMm Mm Mm Mm Mm Mm\nMm ...\n... ... ... ... ...\n... Mm\nMm Mm\nThen\nAh\nNo no no no\nNa na na na na\n\nNo no no\nAt\nA\n\n\nNa na\n[noise]\n\n\n[noise]\n[noise] ...\n... ... ... ... ... ... ...\n... ... ...\n... ... ...\n\nDo you do\n...\n... ... ... ... ...\nIn ...\nThe county ... county\nIn\nThe movie theater near the ... ... ... we do things here and not be the ...\nThe\nNa\nNa\n\n\n\n[noise]\n\nOh that's the way in\nAnd around the rich\nHim this come all the\n\nOh my\nDo you think\nTV screen [noise]\n\nWell\n\n[laughter] [noise]\n\n[noise]\n\nSeen\nMe nasty\nBlow to be seen\nOne on me\nShe kind to me anymore\nI don't it is\n\n\n\n\nI'm In the [noise]\nYour town your listener supported\nIndependent local public affairs and free form community radio\nThey tuned for more than unique programming you create [noise]\nThe memo and your neighbors down his name and get in the car and the times the mouth or action got kicked out of the park slip ski in the dark I gave you ... the dog is also in the butt to smell smoke you when you\nTo give you didn't give up on that don't give up on birth control if there are more method then you think they did that tighter dot org compare all the choices rod in my bed tighter and the sounds dumb met tighter dot org\n[noise]\nWith me these are your most of the gods ... Brooks the idea\nGospel music music from Jeremy in Africa or the right here on it it was one or you can listen on\nOn the legs and\nEven made me like a\n\nI'm Sarah I'm Alan one night I was at a bar one night I was at a bar I had one too many drinks I\nHad one too many drinks I got behind the wheel I got a cab or all ran across the road world ran across the road I swerve to the cats were I hit a guy the caddy shack next to a guy I Wish I took a cab thank goodness I'd take a cab\nYou have the choice to save a life ... driving is drunk driving brought to you by the department of transportation and the ad council\nAlec Baldwin with people for the ethical treatment of animals I grew up loving circuses another traveling animal shows but it never occurred to me what life might be like for the animals training wild animals to do things they don't understand takes for routine discipline with a hook or whip the heel of a boot shows the animal\nFive seven six to to the G A\nScorching hot day imagine being trapped\nThe temperature inside is rising now imagine\nThat you're wearing a fur coat\nLeaving your dog in a hot car is not only uncomfortable it's dangerous if it's too hot for you it's far worse for him because unlike us he can't perspire to cool down and within minutes the temperature even with the windows down a little can exceed one hundred degrees so warm days please be kind of your dog safely at home\nFor more information contact pita seven five seven six two two PETA\nWilliam Shatner and this is Jimmy\nAnimals like Jimmy are often left behind but people fleeing hurricanes fires floods and earthquakes these abandoned animals cannot survive on their own you must have back your weight your home please never leave an animal behind if you absolutely cannot take your animal with you I Believe I'm helplessly chained\nCaged many animals die because they cannot escape fires or rising waters animals need your help thank you\nTo buy more of their products and then when you lose that little do ... you have to go buy another one because there was no all too you're all like alternative\nYou could have a Bluetooth speaker but I Do isn't like Saddam is with everything I Can't play believes you off the radio that would be hectic now I've got to play vinyl now because apple has changed their style I should just brought my computer which is usually what I Do but\nIt's whenever I'm at I'm not mad apple\nApple I see what you're doing everyone knows what you're doing you're just trying to make money off of the people who are already like locked in and it's so hard to get out it though are all my information is on the cloud now they own all of it I pay them for my storage\nCheese they really are just capitalizing on this market that wasn't a market before literally there was no market of technology in computers before the two thousands isn't that crazy wasn't that long ago I mean it was basically in my lifetime I've\nNew we come to this anyway they're changing the game but in a very negative way if you work for Apple try to change something\nOr we get boycott apple but that's hard to do 'em\nAnyway this DJ document doctor you're on the Middletown Youth Radio project\nWithout you this week\nWe'll bummed about that I Love the middle kind of get their super fun they're really funny or just before the the show we were in the square 'em up his neighborhood and I was just that's just chatting with the kids and they were doing the dance moves like the the shooter or the the shoe or something like that where you like hop on one foot and\nWave your fish at the same time that you kick your leg really funny and I did it and they laughed at me because I don't know how to do it and then I did the the floss which is when you like I don't know do die just died like hip rests with altering get faster and faster and that really being that\nUm yeah I think I just I like you know\nI Love Middletown and mental tempted awesome place and I love getting back to the community that has been my home for the past three years\nUm and I would love to meet more people in the military community so if you're a tune in and now remember you can give me a call eight six zero six eight five seven seven zero zero\nThat's eight six zero six eight five seven seven zero zero you can also find this on line W. E. S. U. F. M. dot org that's W E s U\nS andme dot org thanks so much of a tune in any all\nThis is DJ stocked stocked than we will be playing music for you tonight a previously you heard a real pain another weekend\nUp next we got a song from uh the avalanches I don't know which ...\nSo you\nCan ... can get it\nDone it's on some sense dot com second\nYeah my name is DJ talking Dr hill from San Francisco California\nI'm a middle pound loved the radio in the great\nPlace to be what's your name out there right on the airwaves W E s U Middletown point one that's been\nWell I don't want\n\n\n\n\n\nYeah black bats do [noise]\n[noise]\n... yeah\n\nYeah back back to your\n... you know this is my mom said\nIt's a scorching but I knew or knew would argue and\nI ... I I mean\nWe are what are the new Iraqi ... D E\nF ... will do any uh Ghana dining Dina ... donkey\n\nThey ... him are you to my door will be on anything more than ... bald and\nMaybe\nIn the name of a law most gracious [noise] most merciful\nPraised me too I'm On the ... and the ... of the world's most gracious [noise] most commercial master of the day of judgment and seed we worship and dine aid we seek\nShow us the street way the way of those on one though has to be to die agrees [noise] those whose portion is not raft and who go not as straight\n\nThis is\nWhere were you do\nFor a hundred ...\nListen\nTo what he has\nThis is the one who's here called ...\nYou can be tried over ...\nThey call it the the he he\nBe when\nDown in ...\n\nWhere are all my with my family man and a little bit\n\nBehind that I\nYou know\nTo be come why [noise] old story\nAs an excuse to move\nTo a baby or on a on a day for Syria and the guy too low to our seems\nTo\nMe this great man look under stop or were there any ...\nHummers\nNow the man [noise]\nNothing nuts in Arkansas oh we now can grow\nOh he\nHas given me the only way you\nKnow\n... ... who were from ... to ... to ...\nFive times a day\nWhen you were taught us to\nOperate\nIn the news in the Iran nuclear deal I don't know who\nI Am a I'm a ... I was missing [noise]\nBeen great man bought a house or the girl\n\nThe Las Vegas in my bag\nGet something about oh\nI mean he's he's a\nSweetie you having one\nAnd then we use them in their unit we see\nDuring the on the\nKnow more than\n... or ... need to know\nWe can hand\nGiven an F ... star search engine though you knew or knew best Bye bye\n... year here that I have an\nHour and a man who do\nYou what do you live\nKnow\n\n\nAre you\nA real real your\n\nCalls can never be too great\nNew laws that he he\nHe\nWas a a we'll\nHave to\n\nBe able\nTo do that you read ... where are those who\n\nFor you\nTo a ... year on who\nYou are giving you do\n\n\n\nAnd\nJay\nZ\nOh\n[noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\nAnd you do you wait ... points one at a medal I Am your rebel held the heat and [noise]\nForget you find your top ... books and other you\nKnow you need to live you\nDon't love your work to pull you out\nNew\nAbout what happened single page and bother\n\n\nWe don't know\n... ...\n\nThe news\nThe\n\n\nDream can\nIn and you know we didn't know\n...\nYou can\nAdd to the dread\nTo play pin you\nHow strong is the man I Know that's\nAll they do that on\nThe whole you know\n\nHe you\nDo I\nDo\nKnow that you're holding on to\nYeah\nWe're here in the ... ... there's not I don't\nYou know\n\nOut in the house and I\nDon't\nKnow I Want\nTo you may\nYou\nYou didn't see any you know\nOh no big drop\nYour\nBut you're trying to do that then then you'll never\nYou have to deal with all kinds of today don't patterns\nRegret\nOr even dealing with their up alcohol badly pregnant air pressure by I don't know you may be dealing with this well you can do about it but I Want to say no you don't believe in yourself oh well no\nToo far\n\nGood to be\nYou\nKnow no\nOh that's\n\nYou\nKnow oh no oh no\n\nFor\nMan\nThat goes mom you're the\nThe way we don't want to remind me of family I Am a rebel those to be the [noise] ahah [noise] and I just wanted to wish you all out there well on the wonderful and great\nFriday that weekend actually testify of [laughter]\nToday okay I just wanted to send you out them really positive energy tonight some good vibration to help vibrate [noise] help you to vibrate on to bend the nature energy to\nElevate your frequency\nRight in his time so I just want to say to those out there who have something to do [noise]\nThere's no better time than now\nSo [noise]\nAhead and do what you would have been born to do\nRight now there's so many people waiting for you to get yourself in position so [noise]\nNo longer Teri and I'm Linda\nAnd I'm taking this my my own it by [noise]\nRight so let's get busy let's go to work and do what we have\nBeen put on this earth to do because at this point nothing can really stop us [laughter]\nIt's a done deal right now the universe is supporting what is good and what is right so you have everything in your favor say for right now okay so I'm going to spend his last went out to you if you listen in this is going out\nDon't [noise] [noise]\n[noise] [noise]\nTen minutes\nTo\nDo\nWith me\nAnd\nThe the\nLord of the oh All right\nThis is all those shot to your soul right\nNow yes yes yes [noise] [noise] [noise] [noise]\nEver since I can\n\nDo\nThat to me\nKnow and\nMade me mad\nMe and\n\n\n[noise] you\n\nKnow\nGoing on\n\nThat can\nDo\n\nFor me\n\nAnd\nMe feel\nBad about me being\n\n\n\nKnow\nWhen\nYou get the bill and we'll get\nThe B. and B. B. B.\nAnd build\nMe you know\nThe the\n[noise] I've been the day or\nOr\n[noise]\n\n\n\nGetting\n\nNa na\nNa\n\nNa na\nYet yet no matter what the optical no matter how dark no matter how hot it no matter how how many barriers in front of you know up in a way\n\n\n\nBut I Know\n\n[noise]\nYou know\n\nBut then\n\n\nWhen\nIt's better\n", "year": "2018", "show_name": "no_show", "city": "Middletown", "day": "19"}