{"month": "10", "state": "CT", "station": "WESU", "content": "\n[noise] [noise]\nMhm mhm mhm [noise] that's Roy\n... year old Maria middle [noise]\nLadies and gentlemen welcome to most beautiful motors your view [noise] [noise] so what side of wherever you are stupid you are here [laughter]\nNo you can't see the kid is sitting up there what women jumping up and down is something to fall and put my point is well I Want to put a camera on you\nThat was the coolest swinging is ms than ever\nDone this week swinging fit\nYou must mean lord what was the velvet night\nLet's get into the rubbish ... shall we you're listening to WFSU Middletown eighty eight point one asset\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\n\nWe got na\n\nNa na\nIn the\nWay\nThey\n\nYeah\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise] [laughter]\n[noise]\nExperiment [noise]\nAgain I Know not being able to do in my\nPiece is going to do and I don't know the\nOther than to be able to gather\nAnd\nAnd then\nI'm losing\n\nDa da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da da and\nNo\nNo no no no no no\nNo no no no no no no no\n\nMe to be calling me and\nGo in and\nDo it all in\nThe [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\nThen\nThen\n\n\n\n\nMm\n\n[noise]\nMm\nMm\n\n[noise] [noise] [noise] [noise] [noise]\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\nYour tune in to see a little town you wouldn't want to say we're in a rupture which was a great amazing scene\nBy mid line in his recent album that was a professor at midnight\nWas no more cool sound system replayed you're my a from a very new album for a way to go up next in the ... I have a new one from a group called the ghetto [noise]\n[noise]\n[noise]\n[noise] no\n\n\n\n\n[noise] are\nWill do\nOn the inside outside trouble mind and read why me\nIt's only one with Donald J\nSee them all the wrong and have friends like dang or trying to lay down Iran's they know the rent money or\nLet's go to the we were able to do well let me\nTo see who can claim would be ... will they\nGreen\n\n\nWe just heard a brand new one from ... in the ... jumpers\nI played trumpet so Denmark from their forthcoming album magic Polaroid before that the unbelievable to\nPlaying a track called the unbelievable to from their new album power plant and starting to set off was to get up and I played take the cake which is the title track of their new album remember\nYou can access past rump this room shows if you had on over to mix cloud\nJust search for lord Lewis in theory you will find previous rump this room shows up there to dream whenever you want\nAlso you can keep in touch and follow me on Facebook\nJust search for lord Lewis the velvet night\nAnyhow we are going\nTo get right back into the rump is room\nComing up next and got another new one from cooking on three burners\n\nTo change\nSo much is one thing her no wedding to see\nWe knew\nWe\nHe\n\n[noise]\n\n[noise]\n\nKnow\nRead and you\nPeople\n\nNew thing\n\n\n[noise]\n\n\n\n\n\n\nYour tuned into the rope is room right here on WFSU or do we sure hope we just heard from Kiev garnering the battle sonics I played be good from their new self titled album before that another new one from junior Thomas in the volcano\nI played for I played a truck called forever and that's from\nTheir new forthcoming album rock stone starting to set off with the boss I played riot from their new album ourselves coming up next in the room and we have a new one from the biggest Seventy\n[noise]\n\nEating\nShe\n[noise]\n[noise]\n\nWe just heard from the ... rhythm and the band played rockets bee bookie from their new album the strip him mouth before that another new one from Gerardo for the dino\nOr what the name of the track and that's from his new album ... conversations starting to set off was busy gets Seventy would attract called for candles softer brand new album ... believe translate a puzzle\n[noise] coming up next I Hope to fit in to more lost track starting off his rocker\n\nFor state [noise]\nDoing to me [noise]\nDown in the state house than we\nWhere do we do\nDo we\nYou\nSaid how animal\nUp in the house John\nBoehner said that they\nDon't go up and\nBack your lips dumb battle\nThat this would\nBe it\nCan\nMake it to me what you want\nWhy do\nWhy do\nWe do we\nDo\n[noise]\n[noise]\nThat you all along the\nBig visual and live\nStray\nIn July\n... said this is the good the bad you know the nuts out but I still believe that the ...\nWe do do\nDo do\nDo do\nWe do we do\n\n[noise] [noise] he he he he\nJust didn't even catch to catch them just just searched and judgment conventional\nAnd\nThe thing is\nJust an everything that's been that's been mentioned just to get that has been judged\nAnd da da\nDa da\nDa da da da da\nDa da da da\n[noise] [noise]\n\nAnd just you know there's just there's just too\n\n\n\n\n\n\nRump is coming to a close this week in the background was named to ruin town rock name of the track from the album freedom\nCall\nFor that was a single\nMother slackers name of that truck was wrongful suspicion\nThat about does it work this traditional for breakfast room door sufficiently signing off your two ... W E s U Middletown ... ... one of them [noise]\n\nGot a request from Laura here in Middletown for a little ...\nAnd we got\n\nAngels\nI think they should\nTheir the and the more money and\nThen I Know and I\nLine and I I mean and the girl\nAnd and\nAnd\nDown the road or her mom\nNot live in the game is what\nNow and then\nAnd\nAnd then\nAnd they said a hundred and sixty nine Seventy seven hundred jak nobody alive in the studio ... not going to get our elders to take a long long pay Elvis has left the building buddy here on a cruise and radio program\nCaught me\nWhen they become part of you\nElvis Presley man you got your little Elvis you're doing a fifty sixty show you gotta have Elvis represented right land a raining outside let's go to Johnny Ray let people do it and the other one is\nLaw ... get your umbrella\n[noise]\nThe job\nWalk ...\n[noise] so alone and ...\nWant to change\nTheir attitude interest on our own\nWell man\nBe oh just\nWalk in and re [noise]\n\nLinks good Shane\nA lot during the ... [noise]\nWell not re [noise]\nLast year in in ...\nWell yeah man and\nHe\nThey owe\nThan ... well then she goes there\nBand you\nKnow and he sees job too long but he got a ... ... you\nThat she won it in\nHouse I gathered all gathered that either right now the red ... radio program in the past three years [noise]\nThat was Johnny Ray I'm a little Herman term is right now\nBecause I've done a little bit of good for the last three years Iran W we asked you won't be able to get a way to do to\nReach out to go in\nAnd tell them that I'm\n\nAlready got Firebird little step by step that\nWay you know that\n\nDa da\n\nWell I'm I'm a\nWe had to say\nThat we got\nWell I don't know\n[laughter]\n[laughter]\nJak those a lot of the studios the cruises radio program right\nI just love that song\nAbsolutely love it\nI got another one coming up or you haven't heard this\nOne in a long long time it's not a coed label it's from the deep cows remember them D. E. B. A.\nL. S. but the town\nAnd it's called a wonderful day and I don't think that you're not going to hear this kind of music anywhere\nElse anywhere else on the ... on\nJune in here on Saturday mornings at eleven am removed automatic now and then again at three PM\nOr the ... museum show\nThe details check this one\n\nAre ... ... ... ... a\n\nA\nAh yeah the\nTowns in a wonderful day right here on cruisers radio program jak Sullivan taking your right up until eleven PM tomorrow night one of the big hello to all of our friends out there I Know we've got the listeners\nExcuse me out in West Haven Connecticut west haven in Connecticut and they tune in every week and we're so happy you do now for the rest of you I've got to tell you something we've got three shows left that's right three shows is all we're going to be doing here and then we are going to pack up\nOur CDs and our music\nWill leave the talent behind because ah [laughter] oh there's not much on this show but anyway I just want you to remember that there are some great programs here on W E s U eighty eight point what FM I my fellow DJ's they put a lot of time with the programming here\nAnd if you love the oldies and tune in every morning every Saturday morning every Saturday morning at ... am for moon dog matinee man these\nEvery Saturday and I'll tell you this show has been on for over Thirty years and is the hallmark the hallmark of programming here at W. E. S. U. another show\nAnd I love this show at three PM it's the wax museums show with my good buddy gyms Santa Barbara focuses on doo wop\nAnd Jimmy he's got some great old do up from time to time he's going to bring in the artist either on the phone or in the studio and I'll tell you what if you love doo wop well then you got to tune in to the wax museums show here on W we asked you\nEvery Saturday afternoon\nAt three PM every Saturday afternoon at three PM I tell you what if you asked me one of them is most when I leave in three weeks it's going to be the DJ's here at W. E. S. U. the dedicated DJ's the student DJ's\nBut I'm also going to miss you that's right I'm going to miss you all locked\nAnd that's why on the twenty ninth or we're gonna make it a very very special show and it's gonna be just me and you and I promise it'll be an intimate little setting and you could feel free to give me a call let me know what you thought about the last three years Iran W E s U\nAnd playing all these great oldies that you just don't hear any where else only here on W. E. S. U. and I got to think the the gray board of directors here W we actually over putting up with me the last three years it's been a gas\nThese are just wonderful young people on the board\nAnd uh I'll tell you what these are the future leaders of America I Am so impressed with all of them each one of them are far or their wives were beyond their years believe it or not but ah they run a good station here W we asked you\nAnd uh you again if you tune in your regular listener to W E s you then you know I don't have to tell you\nAll the great program here W E s you it's\nAnother's dog that we're going to take a break we'll come back I Want to hear from you tonight eight six six eight five Seventy seven hundred\nEight six six eight five Seventy seven hundred give me a call there's something you want to hear let me know you just want to call up you want to be on the radio maybe you listen and you said jeez you know I'd love to talk to Jack on the year I'll do that to tonight for the next two weeks after you wouldn't be okay you and me\nAll right let's play a little music here that the Springfield and guess what I only want to be with you that's why I'm here\n\nA\n\nAh\n... a great\nDog might be on the New Jersey and the\nDoo wop kings and those members were Joe Neary Jimmy Gallagher the passions and beyond cousin\n... D on and to do a kings of course that was released much later and has a great be do it and I'll tell you what you go down to um New York city and you go to the Bronx and you go down\nTo um what's the what's what's the avenue we go down there James I don't remember now oh my goodness what's the matter with me here\nAre the revenue and you will see beyond way there is a street sign up there that's beyond name on it because that's where the Belmont started right\nBe no I haven't heard from pistol beaten while this'll be meals from New Britain and Pete I don't know where you've been my friend but I miss you give me call you get a chance at eight six six eight five Seventy seven hundred let me know your ... okay because it's been three or four weeks and you used to call me twice three times a show\nAnd I'm just wondering if you are okay my friend I Would have still went out to you this is on the Herald label it was cut by the ... and it's called darling going out to\nBe a little bit in ...\nNo no no I'm\nKnow no no no really\nDon't know ... na na na\nVoted\nDon't know ... and I'm new to\nHelp them to know\nKnow ... ... ... I go out to you but it's the ... will be like that one the man I Know I did darling by the debonair\nOn the Herald record label jak solving lived with this new you know eight six six eight five Seventy seven hundred is number eight six six eight five Seventy seven hundred tell me something do you remember yes\nThere's a whole dumping Knoxville lens both been inside the country can chime in Harlem my number ... ... ... there's an outdoor show that child's mind online courses\n[noise]\n\nThere's\nA whole dumped in the Bronx zoo lens both been insights that traffic jam in Harlem magnum jak tightened up there that's got to show that child's resent the cars fifties\nTo get a little over there and ... where am I ready\nAround your neck and\nThem see who\nBig ...\nOh yeah it was roughly ... around your neck\nYeah somebody as somebody to do the robbers stop but he just ... right hey how about a little bit\nGo there and now everybody's learning how\nThat area maintain some wind you enjoy the purpose\nGo there and now everybody there and how\nServants have already sending out through our good friend rights no God Seymour or\nWherever he is I Jimmy told me that has been sitting in rocky hill I don't\nI don't know where he is he's in a man living in a van down by the river the old Saturday Night live a comedy about goes right jak snow than going to take your right up until eleven PM we got to to counting down to cruise or radio programs\nFive they're going to be opening up for the Elvis show on friday November sixteenth at the cost of media at all thorn in and he'll be here to tell us all about his band and he told me Jerry told me Jim that he would be here with his band but unfortunately they practice on Monday\nAnd uh it's just impossible logistically to get here with the equipment early in a plug it in and ... you know a tune everything up and get ready so we're going to bring Jerry in and maybe some members of his band and uh\nWe'll talk to them and we'll get an idea how we started and uh it seems like he loves the music I talk to them on the phone and I just as the first time I talk to them we changed emails\nAnd it's like I I've known this guy for Thirty years obviously\nSo Jerry fan for really here next week and then on the twenty ninth Johnny Rogers coming in and we're gonna bring out anybody who wants to come in as welcome to come in and say hello and goodbye as we sign up for the last time on October twenty nine\nSo you don't want to miss those two shows the final two shows of cruisers radio program here a W E as you\nAnd the reason why I'm going well why not I've won eight Marconi easier three Peabody Awards and uh what's the other big award gym\nYou know do you you have no clue do you you can't think let's say oh I got seven Tonys I just got so many awards I don't know what to do with them\nAnd the last one is ah let's see I got a fuel it's there\nAre there is all I just got so I I just got to go I've done everything I can do here and uh I got no more room or Laura wards [laughter] yeah and if you believe that one I'll sell you a bridge right All right what else we got going on here well you know what I got here I got um\nA song that I I really loved to play it's a song that is a one of those ah big hitters from the fifties\nYeah the elegance of or\n\nThe allegations\n\n[noise]\n\n\nWhat you say\nThere was a barn in my day\nMan but I Do my little\nI'm not really a\nYes Josh\nPardon me ball\nIs that what you do\nIn ...\n[noise] give up\nA new uh jak no\nBuy the magazine and then you around Bob I'm\n\nGoing to have your\nWhen you hear the ... will blow and they do\nMan you know that that would be it's not very\nOut on\nBlue jacket and then a\nThey're going to be a third party at the stage\nI use the money\nThere were\n\nNo object well ju ju ju me home\nAnd do the jet new guys know na na na na na na na na\nJudges well ju ju ju me oh\n\nOh it's bad at the end the Glenn Miller orchestra I'd love that song\nDrunk I like this one is a diamond on cruises radio program\nNew Orleans throws\nThere when he was the one that I Know about a\nAlso they'll live at W. E. F. U. N. dot org\nThanks for listening is your support that kept them going since Nineteen thirty nine they tuned for more of a unique programming you create\nIt's eleven o'clock here on the east coast good evening everybody [noise] Germany me my mother's very rich leave J boy in the seventies where you are right up until twelve thirty were going to start out with three jeez I garden and\nI started you know he mentioned on it oh\nCrying\nBut I did a\nLive show ... lonely you know\nI ... I\nNot end up oh\nWhy\nDon't need a\nBali bombing me oh\n\nNah nah\nA bad\nI had\n... I\nThey\n\n\nHey\nI ... I\n\nLadies and gentlemen jak no that that's what the building\n... role ... a ... I don't know\nI'm all she'll go\n... ...\nMy hand shouldn't depend but maybe we\nCan things but no my own ...\nWho do you do when you're ...\n\nI'm sure\nOwners make one ... one must be one one of nearly ... ... but I think as\nWe know\nWas just in the July\n... ... ... ... does she want to come up\nAmong shoo Mm\nA\nBut I'm not one of the trial is ... unbelievable I mean\nI don't want him on cue ball this party a minor stuff\nHow that girl and a long\nTime to the gym a lot but it was a lot of them will drain on non profit distinguishing money come from you know among she'll go Mm\nYeah a gay\nIn a mall she'll come\nOver from all shook up I'm W yeah you're you're listening to hit the sixties and seventies with Jimmy V. we're gonna play name that tune in just a few minutes but right\nBefore that we have Brian Stone cowboy is Glen\nThe street to\nStaying in the movie I saw\nIn the dirt is a ...\nA soldier name of the game\nIn why do we know when to rain\nGoing to be\nOn shot at on main street\nAnd bullets governmental\nDream up those things don't\nThen but I'm going to be where the\nOn shot in the\nThere's a link Campbell Ryan Stone cowboy you are listening to eighty eight point one at Venice is Jimmy V. with hits in the sixties and seventies and it's time to play name that tune\nOf [noise]\nRun our W E s used in Middletown, Connecticut it's time to play\nThat and here's the host of the name [noise]\nYou thank you [noise]\nThank you everybody [noise] okay [noise]\nWe are going to give you a chance to win a beautiful ceramic coffee mug courtesy of your friends here to do with the UN to hit to the sixties and seventies or Jimmy V. [noise]\nStudios telephone number [noise]\nEight six six big five Seventy seven hundred so mark that Johnny six oh sixty five Seventy seven hundred because you're going to need to dial tone [noise]\nThat you want to win now what we're going to do is we are going to play a\nShort section of a popular song from the sixties or seventies we're not going to tell you which one just yet and if you can identify who sang that song and the name of it all rides\nEach winter [laughter] okay [laughter]\nI think it takes it takes ten to Fifteen weeks no only kidding [laughter] we're going to get it out too soon so if you stay on the line and I got to get some information from you okay\nOkay well congratulations\nAnd thanks for listening here's the song cinnamon\n...\n[noise] [noise]\nAnd I ended up going\nThan that [noise]\n[noise] [noise]\nKnock knock them you can now\nI'm going to be that they do all day [noise]\n\n[noise]\n[noise] many\n\n\n\n[noise]\nMany now that\n\nMay not change the way\nYou had a\nA comment and what\nTo add that a lot of that\n[noise]\n\nIn our man in [noise]\n[noise] [noise]\n\nOh a lot lot cinnamon\nCongratulations to tailor from heart bruise on her way home from work listening to watch\nIn her car on eighty eight point one half empty the winter or name that tune contest the night\nA ceramic mugs German was from Nineteen sixty nine a one hit wonder by Derek went to number eleven on the billboard charts you're listening to hit to the sixties and seventies with Jimmy Dean I W E a few years\nAgo to\nFamilies sham in the pharaoh\nOr the NBA point\n\n[noise]\n\n\nAnd why\n... banned the administration was a song ends quick so anyway [laughter]\nYou're listening to hit to the sixties and seventies we're going to give you another chance to win among her going to try to give away too much next half hour we're going to play our TV trivia slash music\nIt's the question is going to be from a song from Nineteen eighty four that was used in a TV commercial and we're going to see if you know commercial what product there were you that's coming up a little bit later\nRight here on the next half hour here on hit to the sixties and seventies with Jimmy Dean\nHere's Brett right now everything I own\nEighty eight point one of them you\nCan\nGet a\n\n\nDuring\nDa da da\nDa\nThat\nDo\nAll the way left on your app I'm dial W E s U Middletown\nYou'll be all\nOut and all they can tell you\nThe one that I never know when I turned around and\nDollars you know\n\n[noise]\n\nTo Judy and\nName is\n[noise] um [noise]\n\nPeople wearing your\n[noise] um\nWhen\nWay ...\n\nDa\nNa na\nNa\nAnd adding ...\nIn [noise]\n\nDay John\nAnd\nUs [laughter]\nBeauty in there and watch all\nThem to do it made me laugh at it and\nYes the\nBlack Sea\nAnd this guy going out a request\nHe's with Jimmy V. and uh we have to take a break right now a man we're going to do some announcements and we're going to come back and get to one more request we have to play and then continue on with our music TV music slashed TV trivia it's the norm from Nineteen eighty four so we're going to skip ahead to the eighties\nAnd if you can tell me when you hear this song what clothing product there was a commercial for back in Nineteen eighty four you can win a mug tonight we're going to give away to hopefully so stay tuned right after this\n[noise] ... have been from cruisers radio program heard here on W E s\nU of the eight point on FM every Monday Night between nine thirty ... thirty PM we've got great music TV trivia\nAnd this is what the critics are saying about our program\nIs mount Dahmer perhaps\nWhy should you be the exception to name Monday Night nine thirty to thirty beyond poor cruisers radio program right near a W E s U [noise]\n\nMetric of the digital\nAge will sit ins were [noise] is broken all barriers and it's time to get it cuts through the differences of race age in class it's universal themes about peace loving Salvation Army jury and lasting is adored by the world today I'm your hopes out Robin thing please join me uncovering vetoes as more of the world without forced out on\nSunny here has to be viewed as few Middletown, Connecticut\nEvery one this is Jim the curator if you love the sound of rock and roll and rhythm\nEighty eight point one FM in Middletown, Connecticut and W. W. W. dot\nW. E. S. U. of M. died or on the world Wide Web [noise]\nEvery Saturday from three to four thirty PM [noise]\nI'm Sarah I'm Alan one night I was at a bar one night I was at a bar I had one too many drinks I\nHad one too many during I got behind the wheel I got a cab or all ran across the road world ran across the road I worked in the cab worms I hit a guy the caddy shack next to a guy I Wish I took a cab thank goodness I'd take a cab\nYou have the choice to save a life budge driving is drunk driving brought to you by the department of transportation and the ad council\nHi this is willy Nelson from normal for Thirty years no one has provided a voice for the millions of Americans who smoked marijuana responsibility in Canada medicinal use of marijuana is already now the Canadian government has announced that they will soon start arresting marijuana smokers together we can learn much from our neighbors to [noise]\nTo learn how you can contact normal at\nW. W. W. dot ... or ... or\n... writers Asian writer speaking high reporter bears citing Smokey Bear continue was burning yard waist he told me to remember that if it's touchy too hot to leave you know nine out of ten wildfires are caused by humans I mean nine out of ten wildfires can be prevented I Know that now thanks to me actually thanks to\nGet your Smokey on always burn responsibly and contact your local fire department for open burning regulations brought to you by the U.S Forest Service your state or during the ... learn more Smokey Bear dot com only you can prevent wild\nLand aim is retreating and the town I live in I did I read to children it part of the United way educational program you can create link between ...\nMy name is retreat the I have kids prepared to succeed in school so I don't just where they shared I'm being\nGift advocate volunteer Libyan aren't good living on a daughter were brought cheaper United Way in the ad council\n... want to do what do you eat and she middle\nA ... go\nJust loan or a motor that go\nUh do do on a typical\nRelied rather a ... to go to\nI don't alone and\nJust walking around don't remember who loved\nThere was only loans same right\nAnd I no longer\nAround a mom who\nDo a brand name my\nI Am a mom\nTime\nMom\nYeah man not been ...\nI've been to all these are all they they stay out of Washington and he was ... down the Monterey embarrassing to celebrate dollar boosted Glenn Ron black Rob ... spirit legrand linked up with a ...\nWay man wrong business or the upbringing the mount\nShare I've been\nMinute and Louisville Nashville notch below the blockage ever built Jacksonville water bill goes\nIn this race do you agree more than ... bond like that but\nMum about being a Catalina leave me eat on\nMuch yeah man I've been a very ...\nI've been ... Robert Colorado is ... ... ... like a jazz in Nebraska lab Joel ...\nAre you going to get through the street as soon as you got to\nRead the mountain\nMet in every way\nJohnny Cash I'd been everywhere\nFew more in later years to uh I saw a show called million dollar quartet and my daughter actually it was stage managing the show up in a in West in Vermont and I saw that about back in August and it was a\nThe storyline was the true story of course it was you know rendition of the true story of the one day\nBack in December and the fifties and I forget what year it was when Johnny Cash and I'm Carl Perkins Elvis Presley and Jerry Lee Lewis all met up at the at the recording studios I'm for a by accident\nActually and had a big session there that day and uh some of that got recorded and written down and there was such a good show and a four great artists that was the only time that they were all together at their at a recording studio so that was a if you get a chance to see that show it's it's\nIt's been all around um on Broadway it's been on in small theaters around I'd highly recommend it\nBecause if you like this music and if you like those singers you will love that show okay so you're listening to it to the sixties\nAnd seventies with Jimmy Dean and eighty eight point one F ... [noise] [noise]\nJohnny Russian running and running\nAnd these young Indians [noise] on the\nOther side of the man [noise] lovely\n[noise] in in may wind\nWas her name [noise] that just died [noise] but they're trying to each other and so there's a [noise] na na\nNa na\nGood things about the raid in ... cars that river that was why the good rate for the little white down\nIn the way they know the the other guy\nIn the middle line the beacon theater and drawing characters on the wrong way they are living on the beat it back waiting there and the re\nRod and ban law little wide uh he was a big na\nNa na na\nA\nDown the road in the building the water and the man or white or the ... the pay the bills and the right hand out to the job\nTo do this we're going to be a net gain the as the ... and ... and the little man better raging river on the move them down the street but now there are a long way to beat I gather in that had the time in the ground\nRunning back a\nSo that's a big of\nAnd no\nAs\n\nAlive today\n\nAh just leave last nine years there really\nI Love the show and I'm a little\nA\nBack in a\nSaying a best friend\nWhat street\nAnd Marines your box to Syria\n\n\nMorning girl but me I'm Still harmonic from Nineteen\nSixty nine here on hit to the sixties and seventies and W E s U Jimmy's he now the next song I have\nBecause you want to keep a a you know in tune with the music you won't hear anywhere else saw this on your mind or heard it back in Nineteen sixty six when I went to number fifty nine and it wasn't really a big hit and it never got a lot of airplay\nAs a oldie or an old ... and it was done by the group called pills I think it was a one hit wonder because of the song was called one eats a banana\nAnd the group's name was appeals probably directly related to the banana but here it is one meet a banana or by the pills from Nineteen sixty\nSolve the Mexican border\nShe long just seeing the ...\nFather alive and made fun\nI Want to eat or seeing each day in the fields\nMaybe pay no mine\nSays lag\nAm I loved that dog W.\nK. R. P. and Cincinnati theme song from the television show that was on during Seventy eight but it became a hit on the extended version a few years later now if you're if you're a watch cartoons shows in the sixties course when I was watching them and I was just a kid\nAnd we used to get channel five in New York and to be bailed out of the show and I love the soupy sale shall we got white fang and black tools were as some of his characters are not used to watch it all the time the funny thing about to be bailed there's\nThere was a little bit of adult humor a mix them with the kids stopped so the adults were laughing at one thing and the kids were laughing at the other thing and it was a pretty interesting show of course I was a kid back then so I didn't realize about the adult humor to later on soupy came up with this dance called the mouse\nWhat's your teeth so over your bottom lip and nearly a hit song with that but we don't have that one up tonight but we have the flip side of the mouth and it was called ... Africa so here's two piece sales singing ... an eighty eight point one of them\nThem up a lock them up a new law law voted to hurt him talk for a while I Love a\nGood job so romantic and turkey [noise]\nCall one that will make real always reminds you of lives the way\nSure that\nOne a jerky Turkish me [noise] [noise] no I won't say is modeled on board or\nThe interest is what I'm really [noise] getting married or rather the door with Joan ... to be why the league [noise] but I'm not no\nLonger there by the way you mentioned the\nDesert reunions on this is the weirdest thing still do the ... going way back on what those are both from Maine\nThe you know sharing that with you the question\nWhat kind of go by um [noise]\nGive me baby\nMind bender is on a groovy kind of love to hear on the sixties and seventies W we asked you thanks for joining in thanks to all the callers\nThey are\n... up much they don't go away\n\nLesson dream ... the\nBlack my low\nAnd drew me oh and\nA while while we\nWere you know go\n\nJust one man\nLast you know a\nMeans how\nDo you\nAnd you know to me ...\nThe nine month low blessing during ...\nDied about a\nNo I mean he he he\nBeing\nYou know do\nNeither my\nMother and sleep\nA\nThe\nNew\nHeart jumped show hosted the Broadway radio our joined me every ... seconds before Sunday of the month from five thirty six thirty PM or the teacher the best of the Broadway from old classics too much ...\n\nYou're listening to W. E. F. U. middle\nHuge age hurting too\nBunch of Rutgers you're going to play to\nPledge not to be a life and I think that's a good indicator those you know that go\n[noise]\nChange soon creation\nTo be you\nKnow things\nHe and\nAnd\n\n[noise]\nAnd\nAnd I\n\n\n[noise]\n[noise]\n\n[noise]\nNo no\n\n[noise] [noise]\nUm they said that he will\nLonger be dying\nI'm going to be fought out\nAnd then I'm Glad it I'll say that anybody\nWith all the time [noise]\nDo that again\nDi di di\n\nOur county around the world\n[noise]\n\n\n[noise]\n\n\nInto the next thing to\nNumber\nThere\nOf the\n\nYou're listening to W E s U middle ten it a point when FM I'm DJ catalogs\nI'm DJ oh ball\nAnd this is a log into pools radio our um you just heard a whole bunch of find music and now we're gonna play even more find music but from a different format\nWe're going to our record it from I honestly I think this is named record it the album covers by one of my favorite artists Raman petty bomb and I think it's a compilation album it says life is beautiful so why not eat health food and had\nThe hippie do taking acted on it [laughter] it's pretty thick looking I'm never going to start with the song MIA and just go down the line too ill will and then the song germs\nAre also it's worth noting that this program may contain material not suitable for children or sense of listeners so if you're offended by profanity please do not now and if you have questions about the WTC even decency and obscenity policy please contact a board of directors at eight six six eight five seven seven zero\nThree or you can send an email to W. E. S. U. at W. E. S. UFM dead or please enjoy the record\n\n\n[noise]\n\n\n\n\n\nKnow man\nDa\nMhm\n\n\n\n\nDi di\nDa\n\n\n\n\n\n\n\n\n\nAnd [noise]\n\n\n\nNow\n\nYou're listening ... W E you any one of them Middletown, Connecticut\nBy the time is up for the week a week after next I\nA new favorite uh bars\nHim Garrett not a guy see that is an incredible album we just randomly found on the floor the station so such a good time anyway I Begin to enjoy the rest of the unite and we'll see you later more [noise]\n\n[noise]\n\n[noise] ... di\nDi di di di di di di\nDi di di di di\nDi di\n\n\nDi\n\n\nBoy [laughter] [noise]\nWell I guess they weren't on my\nMind and I think that the bread and you\nDi da da da da da da da da da da da da\nDa da da da da da da\nDa\nDa da da da da da di di di di\nMan\nI'm I'm\nAt the bottom\nThan scientists tell them about it and how\nMany hours a day to day politics than that and I thought you know under the couch and an outside buildings are mad cow country but I've got a job as a [noise]\n\n\n\n\nThat is California tree mean one of my favorite songs in that movie and\nI remember\nThat that Tom was repeated um\nSeveral times in the movie and a one time that um they um you you just when the um wanted to go to California and to have to do\nThat is one of her dreams and um I Do remember the um who you are a flight attendant in that movie return to Hong Kong and she found that the man has\nBrought the dock bar any converting into a restaurant he asked her to stay for the grand opening and ask her to send him a post to car if she has to be about to leave he presents a boarding pass raincoat and that was her stand and she writes team a new\nOne so that's how the movie and so why do we jump to the second stop which is what a what a difference that they make things in life and the\nBlue blue beard enjoy\n[noise]\n\nWhy are they spend\nI mean [noise] I'm twenty four oh he made some\nAnd blah blah\n\n\n[noise]\nMy day to day\nYou\nOn their de\nLa\nNon well there's been a day late [noise]\nTheir brain vote for the\n\nAmong can reach Don\nWe\nNow that's [noise]\n[noise]\nOn your menu [noise]\nWant to live in\nA day to make the\nRent\nIs yeah oh\n\n\n\n\n[noise] my da da da da da\nDing\nAbout too much to say\n[noise]\nYou not every day dawn on me the same way [noise]\nMemorial Day for\nA couple of the day Robb at\nSchool that I knew\nWhen to fill up the state for why\nDo you go see the or for that happened\n[noise] the\nThe three last\nMonth or two day\nTo mom and dad to prove that that in the\n... every day for the\nMemorial Day ah\nDon't think so I was in the state to new\nJersey for them to\nDo\nShould be careful when\n... she ... we\nTo work the ...\nThe ... but I'd probably go down all you\nNeed\nHe lives oh yeah you\nKnow in the latter every day we're going to be with them would be no no no no ma deejay waiting for\nA while back that\nWould have been in the capital of the day he didn't do well you'll lose hours\nYou know\nWhen they made the guy\n\n\n\n\n\nThat's just the art and enjoy the trips they show\nYou the whole dream so the two so actually ... a law though I think they're all about\nAnd um I think I really like those two down because it reminds me freedom he reminds me I'm care to it reminds me I'm of youth and everything and desire\nUm and I have to say one cow way ready have an eye for soundtrack for picking up music like GOOD Music for his field and you can always feel something in the contract of fields\nAnd the for the dream dream is Tom ... Irish rock band the cranberries illustrated the Ninety Ninety two at the ban the Butte bingo\nLater appearing on the studio album everybody else is doing it\nSo I Can't wait a ... version which really that I read I only in the summer of that year they raised the top forty how the U.S how one hundred air pay and the top thirty on the U.S on the ... thing goes chart in early Nineteen Ninety four\nAnd they don't it's quite popular and the four moons ... I really have to emphasize\nOr the town composer and the finger both uh are wealthy and while the herself is also acting in ... and her character is definitely my favorite character in ...\nAnd uh that character is so strong root it's very um [noise] interesting character\nAnd I want to mention a little bit more about ... ... is a Chinese singer songwriter an action over race\nFrom that you're already they won't face definitely ... a very important figure in Chinese or speaking world\nAnd uh her down are very unique and she had her own interpretation of down and you can never find anything similar to her down\nEarly in her career she briefly used to they name surety wall because her original name is while long when while I'm In one born in Beijing she moved to British Hong Kong in Nineteen eighty seven\nAnd came to public attention in the early Nineteen nineties ... intent on the\nOpen combining alternative music waste immense dream Chinese pop\nSince Nineteen Ninety seven she had recorded most the her native men during into a thousand she was re colonize the by world records genius world record as the best selling can tone pop female\nFollowing her second marriage into it than the five she withdrew from the limelight\nBy return to the stage in Ninety ten among him immersed in it so I'm getting a pay more down rating and Tom ... fate the first one is gonna be a which means chest English\nAnd the second one ... way a third one ... to me the fourth one inch the faith while hope we can get that there is showing your shows on the news um\nWhich means uh the woman who are easy to be rather adult so page piece enjoy it\nEnjoy\n\n\nTo go to the\n\nChose to\nTime when he goes no\nMaybe give\nMoney to me now\nShe\nWhen she sang\n\n\n\nYeah me too\nBe\nThey do I tell you ... you\nIt do you need\nName is not the\nThe lego you'll need those\n\n\n\n\n\n\nMe too\n\n[noise]\n\nIn\n\nThey don't do you meet ... ADA ... FM you're listening to eat the Asians do mean and thanks for listening today that's all we have for you and stay tuned for next to wait\n\nBecause I Would also a lump in my life\nWill provide the bull by the\n\nHe up there on the buying dollar maybe not the not just do not documents on one job\nI think that\nAnd\nThey're going to be a lot of pressure on me that the only way more than I did see not that we don't\nGet a shot at la la\nDown a\nMinimum and I'm Wondering what on hold on\nA shot on\nSay [noise]\nWell a trek we just heard it was called ... comes from an album called ... by the Guatemalan artist\nDoctrine the TiVo the elm is our pick for music of the month for January two thousand and Eighteen and you can find out more about that on our website is W. W. W. dot rich world dot O. R. G.\nMichael Dunn writes in his review of the album ... it's a play on the country's name appointed assertion of the indigenous president but long proceeded to Spanish conquest lyrics through the opening track feature a Mayan rapper and speak to the political core of this project\nIt helps to appreciate the historical context and the cultural and spiritual significance of coal Paul the rather than a tree and the same name that's burned ceremonial years instead since pre Columbian times\nWhat's your that title track that just go out to my uh my doctor and achievable\n[noise]\nBomb bomb bomb bomb bomb bomb bomb bomb bomb bomb on the line\nI Know my mind I bought the ... you know that\nThey might be fun to be done and you know I should not\nIt might not know what I\nFind Bobby\nBlah blah blah blah blah blah blah\nBlah blah and\nMy ... got to get money wasn't ... and\nGet like a da da da da da da da\n\n\n\nAnd I\nBothered me the only by the modern\nDay by the time to be on the\n[noise] [noise] [noise]\nMm Mm\nI\n\n\n\nDon't need them on the one with Johnny die in a bubble gum now\nDo you do have a duty to me or you know I just do one thing that I mean I knew nowadays when you may be a\n...\nAnd uh I mean yeah the guarantee but there are big and uh\nI knew was why people voted for it and I know what's going on and people do do do\nA I mean yeah they got me but to me and a guy down and eat in [noise]\nDay [noise]\n\n\n[noise]\n[noise] [noise]\n\nWe started that set off with rod yeah for her new album road that was followed by both country international triple musicians from Europe the Americas and Africa\nGoodbye Jules luckily we heard was called the fun a woman and we started off with I N trio but by composer an ... player boggles like aid\nViolinist lay off the deep\nEnd cellist not seem I'll throw their album together is simply called\nMusic of boggles I eat a trio run here another piece from this one it's a piece called but I Know who won the competition by boggles I read and performed by the iron trio\nMm Mm Mm\n\n\nMm\nMm\nMm\n[noise]\nMm [noise] Mm\n[noise]\nMm [noise]\nMm\n\n\n[noise]\n[noise]\n\n\n[noise] well now you\nKnow when we do\n...\nUm\nThat was the brand new setting of of via let a pot a poem called volt veer off last ESPN day returning to Seventeen\nWhich were formed by ... and the Brooklyn Rider court chat from New York City this is from their new album dreamers and next up some music from Latvia a very different nature\nThis is the vocal group with a an instrumental backing called talk to me I just the people's daughters is the best translation I can get a bit from the lottery and\nThey make folk tradition with a rather contemporary outlook piece we're going to hear a piece called sudden they yummy we're talking about\nMothers shoes fit me well so does her shoulder blanket but I have no time to get married why should I read we early in the morning I have the whole day for that why should I get married now I have my whole life for that\n\n\n\n\n\nOh\nLike a little bit like on the line me\nLike a little bit like I'm not going to be ...\n... like maybe if they see it though the government not Dick\nVan Dyke maybe if they did the guy next to me it's just that I mean yeah you need like at least ... do you like do\nYou need like um oh yeah they don't [noise]\nYou\nA guardian of the study\nWhat else to be the\nIt may be you know it seems\nTo be a it seems like you\nKnow a little bit\nYou know I mean you know the\nThat you know the guy that yeah yeah the yeah the idea that that guy yeah yeah see\nWe\n[noise]\nA music lover yeah\nRich old magazine and I want to thank you for listening today you want to find out more about how you could support this radio program you can find information and links to review it all on our website at W. W.\nW. dot rich world dot O. R. G. relieve your with one more piece from Finland from the ensemble didn't do their brand new album is called you learn a little bit of Moscow music to finish up to show that are listening I'll see you again soon [noise]\n\n\n\n\n\n[noise] [noise] yep you down\n\nOh yeah\nA cool ... who who are the people over there\nOver there by the open door on the elevator oh they're the ones who stay here by choice or they feel guilty for some reason or another and I just can't seem to get through those doors that don't dad [laughter]\nUh told me about it and the\nDevil really wants them to go because we're running our room down here\nOh oh wait oh no\nWell\nUm I think I'm supposed to be here\nYour whole way of saying what do you think you did deserve space around here\nSo is James\nYour from Connecticut I promise you you did nothing interesting ever\nWhat one night in my hotel room I I I\nOh one of these hang up he has gone\nI or you see they had all these movie choices right and but then uh then another menu there was another set of movies or do you get it or other movies not the regular one\nYeah no I get it you don't have to say here for that\nYou don't understand because these weren't the regular movies that you'd find in theater right I mean these were you\nKnow I get it we hear it all the time he was guilty for a little ridiculous reasons and they never feel guilty for the really juicy one\nOn the entertainment I mean let's call\nYour skills how how do you not pay for the movies or something that might work here\nYou know I pay my bill obviously I mean it was charged to the room but I mean I Do feel bad\nVery\nWell our birds it's more like this one aren't in the elevator and two minutes I Want you to pick them up and throw them in there we just don't have the faith anymore and I'm\nYou guys are you so boring now used to be a challenge to bring them here and I can't keep them out\nStory I mean I mean I pretended to be watching the superhero movie but I kept getting the button back to the other one and the ah the desk for probably knew any way but I pretended accident\nGross kids not keep talking trying a with access hand for Joe seriously who is this one here\nTo me well my story is I watch the movies in a hotel room to but I'm willing to get on that all the better now and give you more space around here [laughter]\nNo no no she's funny isn't she knows she's one of a poor soul to willingly participated in a multi level marketing game you know where she has to convince friends to keep buying products the\nWell fraud is little five I think a\nLevel aid so we get more and more customers were that level every day you know we were just heading there now but we got a little delayed because we have to let ... pass\nThrough through great isn't he a ... as it wasn't fraud with a legitimate marketing program\nRight I've\nHeard that all of us are real quick question ... up please please cui tickets Sophie because [noise]\nOut out out out out never mind he played to fill\nThan ... which one would\nI'd hate to add to the problem in any context Brazil\nFinish up then it's time for your performance review\nMan I'm In for no you're not going to get a good review [noise]\nOne guy gets good review nowadays oh let me get drew on look I'll be right back\nIn in ... ... oh oh oh oh yes oh why don't you step right in their car\nRight here Carl [noise]\nStep right in here with me and\nYou're with you you've been a close the door for expect blackout you got it virtually no I mean would you [noise]\n\nShe didn't even fill out a survey [noise]\n\n\nYou fell asleep we made it to our stock\nOh wow Becca listen I I think I'm going to give the conference a mess I think I Need to stand the trolley and head back home\nYou know\nYou want to miss that look like the free swag I mean if your boss didn't want me to pick up your is that I can do it\nFor you know no no I think I'll get home and correct the rest of the papers maybe do some reading\nNot Dante Inferno though that the worse\nIt might not be the worst after all Becca we'll talk after the conference okay feel better yes we'll talk after the conference we should\nSo we'll be new conductors as we head back to not make junction station or we're going to just go\nSay your name wouldn't happen to be through it [laughter] you know what I think just for today I'm going to take a cab [noise]\nWell I Hope that ending and shield through my too much like cockroaches through the apartment I'm gonna get\nMad new body has to be covered\nThe day the mistake [noise]\n\nMy I'm getting under my skin that getting [noise]\n\n\nWhich case\nNeeded torturing or with a view of mankind's most ... are being much real clear that\nThe other day I didn't dare lift dinner it's torture can come in is agony offering and\nA part of a threat to the opera view\nBut I suppose it is what it is [laughter]\n[noise]\nWe we just signed up and look at you\nYeah I'm a man junction [noise] I Can't I keep the train man [laughter]\n[noise]\n\nAnd now an encore presentation of Edgar Allan Poe in certain dip history part one\nDickens was not the only author for whom Washington Irving provided valuable town team thirty nine\nWashington Irving responded to the mission from a young writer from Baltimore named Edgar Allan Poe\nWhat is not commonly known it's up to two officers man a month later to do that pose work person in a moment of Darren did hit ... [noise]\nFrom KPFK Pacifica Radio in Los Angeles is rising up with ... on on equal hacker were on line up rising up with ... dot com in today's news headlines President Trump and first lady Melania Trump visited areas up the Florida Panhandle affected by hurricane Michael on Monday\nTrump told reporters he was going to ask Congress for disaster funding according to a pie Trump's visit didn't eat distribution center set up in a parking lot filled with boxes of diapers piles of clothes and bottled water he and the first lady handed out bottles of water to residents who came to see him\nAnd tell their stories about the storm\nThe powerful hurricane hits Florida on October tenth as a category ... storm with wins between a hundred and forty and a hundred and fifty five miles per hour in the span of a few hours the devastated whole towns and then moved to head to Georgia where there was also damage\nThe Trump touring and leading haven Florida governor Rick Scott I\nGot off first got my dog or a law enforcement richer while we were I'm not sure\nIf I were to everything we can go back to work I Want to thank you for taking my call showing up to about one of the\nPeople\nAre just want to say the governor of Florida we're\nAlready buddy were eating\nDo whatever you want to\nAnd I think we're doing a lot more than anybody would have ever done has probably [laughter]\nThat President Trump speaking to reporters during his visit to Florida devastated communities neither Trump north Florida governor Rick Scott who was standing right next to him we let Mitt the climate change causing rare and powerful storm to become the new normal\nIn news about the murder ... journalist Jamal ... secretary of state Mike Pompeo has arrived in the Gulf Arab kingdom on Tuesday ... but the Saudi king told mom as well as to fund the nation's de facto leader\nCrown prince Mohammed building tell them on the meeting is taking place at the same time as reports are emerging that Saudi Arabia will admit to the journalist chilling according to CNN quote Saudi Arabia will contend that the Washington Post columnist died when an interrogation winter rye\nTurkish officials inspected the Saudi conflict on Monday for nine hours the location where cars show give us last scene and where he is suspected to have been killed one journalist to observe that hours before the Turkish inspection a pie and Reuters cameras back so it cleaning crew entering the conflict with a large supply of\nCleaning materials early on Monday President Trump and an obvious effort to absolve the US's largest weapons buyers spoke to reporters say that the Saudi king denied responsibility for the killing Trump also speculated that Ruger killers may have murdered the\nFor the king of Saudi Arabia organized any knowledge of what\nAs you get it right [noise] [noise] [noise] [noise] I\nNot a regime firmly denied any knowledge of it you didn't really know [noise] [noise] [noise] maybe I don't want to get by but it sounded to me like a big role\nWe're going to get to the bottom of a very simple\n... Benjamin for discussion of whether it will impact us Saudi relations and particularly arms sales and other news the U.S government report the highest deficit in six years on Monday in a report released by the Treasury Department\nThe death the good of seven hundred and Seventy nine billion dollars include the amount that the government went into debt for the first full twelve month period the Trump president\nAccording to Reuters economists generally view the corporate an individual tax cuts passed by the Republican controlled Congress late last year and an increase in government spending agreed in early February as likely to balloon the nation's deficit\nBorrowing has increased over the past year protect partially to make up for slower growth in tax revenues because of the tax cuts well military spending has also risen end of quote\nRepublicans whoever reacted with hysteria to deficit under democratic administrations are silent on Trump's enormous deficit\nUnlike the U.S government trumps reelection campaign chest is bursting with cash on Monday the Washington Post reported that the president has already raised a whopping hundred million dollars for his reelection campaign for twenty twenty\nAccording to the post Trump pulled in Eighteen point one million last quarter through the campaign committee and to joint fundraising committees with the Republican National committee for a total of at least a hundred and six million dollars since January twenty Seventeen according to federal filing made public Monday evening\nThe campaign finance Institute remark that no other president dating back to at least Ronald Reagan had raised any money at this point for his own campaign committee\nTrump has appointed Mary ... to head to the national program on Medicaid may she was one of the programs strongest critic which is no surprise given the Trump has routinely appointed people to head department that he'd previously sorted of Troy box reported that make you previously served in the administration of Maine\nCourt orders that he do to make you has been outspoken in the past testifying in front of committees against the Medicaid expansion aspect of the Affordable CARE Act\nAnd other medical and use the federal government announced on Monday that it wants pharmaceutical companies to mention the prices of prescription medication in their ads but the industry wants to disclose prices only on their company Web site\nHealth and Human Services secretary Alex Azar introduced a proposal on Monday to require drug prices to be reviewed Fort Ord medication covered\nBy Medicare and Medicaid he said quote patients deserve to know what a given drug would cost when they were being pulled by the benefits and risks that may have they deserve to know if the drug company has pushed their prices to abusive level and they deserve to notice every time they see a drug advertise to them on TV [noise]\nMassachusetts Senator Elizabeth Warren is under attack for taking a DNA test in response to President Trump's repeated boating\nHer claims of Native American ethnicity\nThe potential presidential candidate on progressive Democrats unveiled in elaborate detailed a result of a DNA test that showed that she had Native American ancestry going back six stage generations\nAlthough she said she does not play membership and any tribe the Cherokee Nation spokesperson shot back thing using DNA tests to lay claim to any connection to the Cherokee Nation or any tribal nation even vaguely is inappropriate on wrong\nThe bookstore is not a Senator Warren is undermining tribal interest with her continued claims of tribal heritage\nPresident Trump who has repeatedly be little Warren calling her Pocahontas brags that he would give a million dollars to charity if she could prove our heritage on Monday Trump walk back that promise thing he never said he would do it\nWarren has also come under criticism for ardent from Democrats for potentially undermining the party's chances and the upcoming midterm elections but some\nNatural born US citizen and finally the U.S Supreme Court refused to hear an appeal brought by three paint manufacturers were being held liable for continue to lead based paint even after it was banned in twenty Seventeen lower courts have found the company is responsible for creating a public nuisance by selling lead based paint\nThe companies and questioner Sherman William con agra an an el industry is the Supreme Court sanctioned brings to a close a lawsuit that are dragged on for years\nAnd that they're good for our headlines today later on our show all sorts ... will join us to discuss her new book people like a new wave of Canada knocking app democracies store ... [noise]\nYou know with such impunity but here's the person who has the ear of the western media you know who's written and spoken out about the Saudi Government um you know being a as far as we knew that the Turkish government has said that there are taped that show that he was interrogated in the Saudi conflict in Istanbul\nAnd then murdered and dismembered I mean really you know disgusting brutal\nUm you know that he's the allegations of what he fees and and I'm Wondering if not also plays a role in the ... you know the the the kingdom of just gone one step too far\nWell that's right you know we're talking about a kingdom that has for many years\nUsed public beheadings instead of just having people in private put them out in the public for the public to view what happens when you go against this government we're talking about a government that does as done public lashing taking people out in the squares so that people can see them being beaten\nA and um and yet somehow this country of Saudi Arabia maintained a veneer of acceptability in the west a this indeed is going too far to have done this with in a conflict on NATO soil and I think just the thought of\nHim being interrogated tortured or killed\nWho wants to put the up profits of the weapons companies above a the morality of a or a morality of what occurred I Would think that you're already of Americans are ready to say enough\nWith this alliance with this kingdom of Saudi Arabia and I also think that inside Saudi Arabia right now there must be a lot of planning and plotting among the royal family\nAbout what to do with Mohammed bin Solomon who has gone too far the where the name of the kingdom causing tremendous economic damage just in the last two weeks\nAnd they're probably trying to figure out how did they do some kind of palace coup to blame it on him and put someone else in the throne now well how do you\nUse ... murder of being seen in Turkey um we mentioned that you know turkey is a NATO country\nI'm sure he was last seen all lived in Istanbul I understand his wife his Turkish and um he disappeared into the Saudi conflict in Istanbul never to be seen again um and I do quite a bit of outrage in Turkey isn't there\nYes it is a lot of outrage among among the public or the president is trying to play this cool because there is a an economic downturn in Turkey and he doesn't want to create more of a crisis\nOr he also wants to use this occasion to improve relations with the United states\nUh that's one of the reasons they released the U. S. past pastor a just a recently and there are sanctions the U.S has imposed on turkey I think the Turkish government is trying to get those sanctions lifted as part of this\nSo we can be sure there is lots of talk going on behind the scenes and the Turkish government\nBeen seen as a proxy foot soldier in the U.S to war against Iran and your leaders to kids about Iran um ... aside from the weapon sales um you you must also not beholden to Saudi Arabia on the situation on basically on Iran and\nAnd the U.S the desire to especially under Trump or maintain hostility with Iran\nThe U.S has built its whole Middle East policy according to the Saudis and the Israelis and the Saudis and Israelis have been working together against Iran\nOr if the U.S government is forced to retract it close relationship with Saudi Arabia or this would really change things in the middle east\nThe Iranian people are suffering from sanctions in reimpose when Trump pulled out of the nuclear deal and a new round of sanctions are scheduled to be implemented whatever for us which is going to cause a a shortage of oil on the market that Saudi Arabia was supposed to make up for\nSo this is coming in a very difficult time it's also the same time at a elections here in the United states\nSo there is going to have to be some juggling on the part of the Trump Administration if they are indeed going to try to stop Iran from being able to sell its oil at the same time having a crisis with Saudi Arabia\nThis could really affect the price of oil in the United states which would not be good for Donald Trump ...\nSo everything is pointing to the U.S maintaining relations with Saudi Arabia and sacrificing Jamal ... all the dissidents up for me to present\nThe the victims and Yemen off the Saudi war to maintaining the status school on which depends oil on which depends arms sales and the U.S\nFood um damage just relation because we should also to remind ourselves right media that the Trump didn't create any kind of cozy relationship with Saudi Arabia us Saudis have a long relationship President Obama maintained it and the president before him and and the one before him maintained\nRight yes but I think it is time that we started a campaign around boycotting Saudi Arabia and there are so many ties that the Saudis have now with U.S companies where we could name and shame them the most obvious ones are the two dozen PR firms\nThat get monthly paychecks from the Saudis there are the ivy league colleges that take Saudi money that think tanks in DC but now there are dozens and dozens of\nA tech firms for example from over to uh we work that have ah been taking actually billions of dollars in Saudi money\nThere are list and list of companies that were going to be involved in the future initiative a conference that was to take place also known as Davos in the desert\nAnd because of this they're pulling out but when you look at the list of companies that were involved it is a long list of some of the um most important a U.S companies both on Wall street than in the stock market a and I'm so there are\nWould be many targets for us to focus on in terms of trying to wean the U.S economy away from the Saudis and I think it's a good moment to start that ...\nUm ... you and many others have been engaged in such a campaign for a long time of groups that human rights watch along documented what Saudi Arabia has been doing and how um you know it to the country keep ignoring eat violence\nBe very disconnected more so than ever from U.S foreign policy and how critical to the to remind us that are and to make it an issue in the election\nThat us relations with ... are critical and that to maintain include the ties results in the sanctioning of ... of human rights violations and mud oh\nThat's right we can uh tell our elected officials to call for cutting off of\nMilitary sales to Saudi Arabia and military ties with the Saudi are at war in Yemen we can call for sanctions against the uh people in Saudi Arabia involved in this heinous act\nOut and we can call for U.S officials to stop taking money from the weapons industry because that's how we get into these kinds of relationships\nAre we at code pink have been involved in something called divest from the war machine where we are calling on our politicians to stop taking money from the weapons industry and this is another way to really separate U.S policy from the policies of the Saudi regime\nSo um what are places that people can find our resources I mean of course you'll book Saudi Arabia kingdom of the unjust is a great starting point um but ah what other resources are there's code pink I'm you know a organizing any actions around it that people can get involved in any online auction\nWe're doing online actions as several times a week now if people sign up at could think that or for example we've been pushing all the media companies\nTo draw from this Saudi I investment for um initiative we've been calling now on Steve Mnuchin U.S Treasury department to not go to a this Saudi summit uh we're calling on Fox Business channel the only media company left\nThe U.S weapons sales so there are lots of good actions to be involved in it and if you sign up on our website could think that or you'll get some good ideas of what you can do\nAll of us on Twitter dot com slash or you know\nA website ... dot com where you can find all our programs are\nVideo and audio for [laughter]\nYou're listening to ... one of them probably ... few middle term listener supported community radio [noise]\n\nWelcome to the ... that gives you staying without this is your house to market perhaps God today\nNewark New Jersey based active as attorney and author junior Williams on his book\nUnfinished agenda urban politics in the Arab black power we take an inside look at the evolution of the civil rights and black power movement their southern route and their application in northern cities like Newark New Jersey also the relationship between younger militants and the Reverend Dr Martin Luther king\nThe war on poverty as it began and income inequality today we live in a global world we're all interrelated so on so during the truth you work to bring directly to you news of use a local national and international policies and stories that affects us all\nHad to be drawn out how those with us most impacted women communities of color in other communities are responding to discuss the relationship between art and politics now for our news headline\nIMAX bring all what these headlines the state of Florida has officially acknowledged just to death so far associated with hurricane Michael\nSearch and rescue teams are continuing to look for victims and survivors the Associated Press says but the overall death toll at Seventeen so far including one death in Mexico beach confirmed by a search and rescue team and six others confirmed by local officials in Florida\nAnd other states there are ten confirmed or right after the storm hit the chief of the federal emerged\nTo evacuate before Michael's landfall\nBoth long and governor Rick Scott sidestepped questions late Sunday after they return from an all day trip but some of the hardest hit communities right after the storm state officials that thousands of calls inquiring about missing people who came into authorities and nonprofit groups\nFEMA did announced Monday that search and rescue teams along with the coast guard the national guard had rescued or assisted more than four thousand people in storm impacted areas\nAnd that they had checked on thousands of homes and buildings secretary of state Mike Pompeo met today with Saudi crown prince Mohammed bin ... over the disappearance and alleged slang of Saudi writer ...\n... thing to prince Mohammed for hosting him\n... two weeks after the disappearance of ... who went into a self imposed exile in the United states amid prince Mohammed arrives\nMaryland democratic Senator Ben Cardin told CNN that Congress is prepared to act of evidence shows been Solomon or any other high level of Saudi official was involved in the suspected torture and murder of the journalist\nIt's not up to the Saudis to determine who those sanctions applied to it's up to us and if our best to ... shows that it certain individuals are responsible\nFor this tragedy and the Saudis don't take action than they should be considered for the the sanctions that with the night and the use of our banking system and the right for a visa to visit America\nTurkish officials fear Saudi officials killed and dismembered the writer at the Saudi consulate in Istanbul\nSaudi Arabia previously called the allegations baseless but reports suggest they Meg knowledge ... he was killed their President Trump floated without any evidence that theory yesterday at a rogue Saudi element may have been responsible\nRivals control within their shared border under a peace agreement between the two countries the talks with pen when John border village mark the first meeting between the Koreas and the un command to discuss ways the demilitarized the villages joint security area\nSouth Korea's defense ministry said the military officials including US Army colonel Bert Hamilton and the secretary of the un command military armistice committee review the ongoing again lining operations at the joint security area and further plans to drive down\nThe Korean militaries began clearing lines from the area at the start of this month following a broad agreement meant to reduce military tensions that was forged between North Korean leader Kim Jong on and South Korean president Moon Jae in at their summit in September\nThe Korea U.S plan to withdraw guard posts and firearms from the joint security area once the de mining is complete British prime minister Theresa May has urged are divided cabinet tobacco or as Brexit negotiations with the European Union go down to the wire\nAt a marathon three hour cabinet meeting today may said the government must stand together and then from\nA day before a crucial in your stomach talks have hit a log jam or with a complex issue with the Irish border which will mark the only land friends here between the u._k. and the block after Britain leaves next year\nThe email was waiting for new proposals from Britain\nBut May's room for compromise is restricted by divisions within her conservative party and by her reliance on Northern Ireland is democratic ... party which opposes any compromise on the border\nA federal judge has just last adult film actress Stormy Daniels defamation lawsuit against President Trump us district judge asked James Oh tarot issued the order Monday in Los Angeles Daniels alleges that she had an affair with Trump in two thousand six\nEleven to keep quiet about the alleged affair\nHe called it a total con job and dismissing the to the judge said Trump's tweet was a hyperbolic statement against the political adversary Daniels' attorney Michael ... has said he will appeal the ruling IMAX Pringle you're listening to talk about truth on top of\nThat was our news headlines I'd like to welcome to the journal truth junius W Williams tea is an attorney an educator and advocate who is responsible for developing two thousand housing units and many community centers in Newark New Jersey\nHe has a graduate of both Amherst and Yale University he was elected the youngest president of the national bar association in Nineteen Seventy eight he ran for mayor of Newark in Nineteen eighty two\nAnd it's currently director of the Abbott leadership Institute at Rutgers University he's listed among ebony magazines one hundred most influential blacks in America genius Williams welcome the title unfinished agenda why that title\nBecause our quest for power in the United states of America is an unfinished agenda that we can look at that and to levels first my own personal journey a guy who\nIn the civil rights movement and I wasn't gonna let nobody turn me around\nAnd buy our power you mean the power of black people telling you I like\nPeople like people and that's been a ... that concept has been expanded overtime I'm I'm very much comfortable with the concept of progressive people but we started as black people in the journey and we've had some distinctive interest so that's the main purpose of it\nBut then the other portion portion of course as my own personal\nJourney whatever I learned what am I going to be to leave for my children and other people's children about how you get\nYou hail from Richmond, Virginia you about your family\nI grew up in the middle class family in Richmond ah I was born in Suffolk, Virginia peanut capital of the world [noise] ah my mother\nWas the first music black music teacher in Norfolk, Virginia and my father was for his high school a first black high school instrumental teacher in Richmond, Virginia\nSo uh they met he was a he was singing and somebody said do you need a good economy as though he is Bernice white so that's how they met\nSo I came from a a very musical family or they were both schoolteachers I grew up in a as I said middle class or Richmond middle class black Richmond and of course all was segregated\nI go for days and never see somebody white on my on my teachers were black or my friends were black I never had any white friends until I started leaving Richmond and going on some of the are going at some of the programs in the north that my mother had staked out for me\nWas actually for university then before before you let\nThe study yes this is this was but I grew up in the late fifties and the early sixties I left a I left Richmond when I was Seventeen and that was in Nineteen Seventy nine Nineteen sixty one to go to Amherst College\nMhm right and this was your first time then kind of going north then he went to the university or had you been before\nAnd the whole movement of the civil rights and the black power era\nSo and this is Margaret Prescott host of the journal truth\nSo junior Williams you're at Amherst you have this huge conference oddly David saves the day we're going to talk a little bit later on about the interaction with with Tom hating and and your ending up in in Newark but first I Want to find out\nAbout a year ago in South because your parents got you out of the south to the north\nAnd then you decided to go back and tell us about that what what what what point did that happen\nI just had to go ahead\nIt's a we had raised money just as after you were out of ... no no no this is why do you are in a hammer this is where I was in there and\nI had a allow people from\nThe civil rights movement to come and stay in my room if they wanted some downtime some rest and relaxation are getting away from the Klan and all the problems that were down in the movement there\nAnd I had done at all except the on the front line now I had\nAs I told you earlier I saw those kids being on the front lines all the way up to ... intensely who will you know probably in her sixties or seventies at that time\nI had seen pictures I had been to the march on Washington really truly by accident 'cause I was coming back from Africa I worked through cross worlds Africa thanks to married right elements so I came back on that day and my mother dropped my brother and I off\nAt the march on Washington and the people who were amazed me most with a snake kids just within ... Coordinating Committee yes coming Justin from uh from Danville, Virginia I Believe staying and all those songs\nAnd or had seen the the snake fetal freedom singers up at Smith College ... became friends with quarter Reagan who yeah who eventually married a friend of mine from from Smith marble Harrington\n[noise] and uh I just had to do it I\nIn thinking about that you know it's been a while since I wrote the book actually 'cause you know you write a book and then you would a dead and you try to get it published yeah so the publishing\nThing as a stirring it of itself so I've had about three or four years to think about it and the most I think that the common denominator that I always come back to is the songs\nYou know and the music industry yeah we were held in Portland so crucial in in the interest of being ...\nThe song for everybody you know if you didn't have a vision of what freedom was you know somebody would say I woke up this morning with my mind stayed on freedom and you begin to think about that ... you know and you you hear\nSo much in that song you hear African is on the call and response to embarrass other African elements that were in that music\nAnd then you you might get a little bit down ... but then you might say ain't\nGoing to let him know who bought it lowered\nTurn me 'round oh turn me 'round there that give you another boost you golf them face to Clinton I remember one time um and we haven't got to have gotten there yet but at at one point the first time I heard this uh I thought maybe I might die when somebody starts singing\nThis may be the last time it may be the last time I don't know so you just get ready\nYou get ready to face was that so it was a compelling nature of that music that just drew me right in and so we got in the van when they\nWent down to my ... my parents' house they start at rickety band that we were coming in my father said take my Gostin\nThat we had a he had a Buick station wagon and safer I'd be safer and it was interesting because on the way down to because we had been Ginia place in that in Massachusetts place\nWe got away with something that probably most of folks would not have any place in the springtime march in Nineteen sixty five march we were going through the Selma to Montgomery march yeah and a white guy was with us or ...\nAnd Fred was driving at that particular time\nDangerous driving through the battery Amos jobs or racial group\nInter racial group at the time of this struggle two of us to black that so the cops pulled us over and so uh\nMy companion and then I I don't remember his name now but we got under the covers in the back of the station wagon along with the bag so you head\nWe hit and just left it for whites in the front so Fred toll and we were going to Florida to you know at the general the general bash out\nDuring the spring break the law [laughter] [noise] and they are ... dies airway our ... our swerve him he said well I guess I might have just believe that a little bit of okay will you be careful now you hear the tone [laughter] [laughter]\nThat's how you got over and that's how we got over and we got down there with the Montgomery for you get to go to Montgomery before\nYou go to Selma and somebody said check in with the snake office\nYeah I wanted to I Want you to talk a little bit about that because they'll welcome you got was and they didn't exactly roll out the red carpet new\n[laughter] at all that's still pretty comical was upstairs on the second thing are Michael who was heading um snake at that time\nI don't think they ... well it was a Nineteen sixty five he yeah he probably was in charge but now you know maybe\nHe got elected in sixty six I'm not so sure but he was a main figure a main senior engineer at that point and they were in as I understand the book they were in the upper room on the corner of Jackson and high street so we go up then six or seven\nOf us I think I'm trying to be six or seven weeks into station where he said it was\nLike I have a right we have a right to work in the move to work\nIn the movement ... what you go do with us [laughter]\nJust like that they told us the ... that was ... later he became and er he sent us downstairs and we said OK we will we we we'll stay they ah gave us the place to stay in somebody's house and from that point on it was on\nYeah and and you have some pretty frightening experience since there with some races um tell us to tell us a bit about that because [noise] it was a it\nIt's hard for you know people today you know thinking back of what people went through mhm mhm [noise] but\nThe idea was to demonstrate in Montgomery\nTo back up or to even front up as a as a tea but it'd be the whole march from Selma to Montgomery which which had been taken over by Dr King ... ah first of all you got to understand that there's some rivalry amongst all people who work together so they ...\nThe civil rights there was ... and now is\nThat an absolutely so that was that aspect I didn't understand it until I got into it [noise] uh then the second thing was that they didn't trust that you see\nThe Southern Christian leadership was telling me which was Dr King's Oregon yeah ... yes yes yes\nBecause a snake didn't want\nA king and se Elsie to backslide on the whole question of voting rights and the voting polls voting rights act they wanted it as strong as it could be so they set up their own front in Montgomery\nWhich was a brilliant thing to do and it was amazing that they were able to do it but I think back about the expertise it took to maintain that kind of a of of a front and it stuck there is something that we can learn from ... so what did I\nAnd they had the regular police but they had also are empowered are actually the Ku Klux Klan from the countryside to come in on horses who had these great big long Carol sticks\nAnd every time we tried to march out they would beat us oh and the front of that group was the guys on horses 'cause they enjoyed it\nThey enjoyed it so they ... heads as often as they could I was quick enough to get out of the way that ah at one point as I said earlier they backed a several of us against the church was the black church the doors and that will open\nFor us and we're up against the church and we just got to start singing that song and miraculously it must have been about selling this German but the song [noise] oh yeah this may\nBe the last time may be the last time I don't know we were just there waiting for the orange or to come and they stopped they heard that that's when I really believe in God\nAgain our guest is Juliet Williams he joined me in Studio on Thursday January ninth just hours before the death of his friend the late great poet uh marry Veronica\nYou can listen to our special on a Mary ... was aired on Tuesday January fourteenth to get a genius Williams reaction to ... death\nRe now continue our conversation with activists attorney and author junius Williams\nJunius we've talked about you're going south about your experiences in the south and working with Nick a while you were there now we know that a lot of folks who was a lot of violence a lot of folks got beat a lot of folks also got arrested went to jail tell us about your experience where you are arrested in the south\n[noise] yes uh James form and ask a who would be willing to go to do and I said okay James from one of the leaders in both could use executive director of the\nStudent Nonviolent Coordinating Committee people who are just joining us mhm\nAre we marched down to the state capital\nFederal battle flag and the city cops said you can't march on the sidewalk\nSo we walked out into the street all the state's top said you can't march in the street so we saw where that was going so we just sat down and they had to pay their way and they came up\nA several hundred of us were arrested they put us in jail but see this was part of the genius of snake they had people rated to go to jail each day hundreds of people had to go each day to feel the the the jail and that's what happened because then the second day I was in jail\nThey said well we got to move you to stay prison\nSo whom they moved the and some others\nTo kill state Britain to this day I don't know where it is I Know is somewhere cold so it it got too many people were coming into the jail that\n... that they had the hyphen some off okay and this happened this went on for three days three days hundreds of people each day for three and remember that young people you just can't go out there and do one little thing with fifty people and expect that will be what you're going to do to make change\nNo huh ... Facebook all make a post on the line with us down it yes yes yes uh I get a whole lot of a men's and then nobody show up a so we went to Cuba state prison so why we were there what happened this happened or another reading from your book\nYes because there were so many of us the powers that be decided to move some of us to Cuban state prison after one night of singing and clapping and raising as much as possible I was among those transported to kill me\nFast forward you know a little bit there one hundred and fifty to two two hundred of us transferred to kill me they separated us by sex and put each group into two big hole in sales\nNo beds just mattress is on the floor with no sheet or blankets\nThat later became the coal lead guy\nAt some point in the early evening some guards appeared and threw in some blankets I have found a mattress away from the door and turned over to see a mad scramble for the few blankets they threw in the floor with dust flying all over the place\nNo way was I going to enter that free and so I resigned myself to being cold for the night then worth long to charge where if there's a short man with glasses he looked like a stereotypical political organizer from the book the character and ... you have to you\nI found out later that he had been in snake for some time and had been one of the seal secretaries working in Selma and the community the lounge County Alabama\nThey had a deeper involvement in Selma than did ask the healthy despite the headlines for king and the much\nWorse got up on one of the tables in the holding pin and got everybody's attention by yelling louder than the combatants for blankets on the floor\nWatch most of us who are listening he began I don't know about you but if I was a man I wouldn't take a blanket for myself unless there was a blanket for everybody ... paws and let that sink in\nThen he said it again establishing eye contact with everybody in the sale\nAnd we were as we who were without blankets waited one by one those would scramble for the ... prize came up in through their blanket into power the power group\nAnd the guards who had been standing outside the locked gate to watch the niggers fighting one another for blankets had to take a second look at the new black men that emerged from the struggle\nOne of the things that they do is make us fight among ourselves at worst explain if they can't get blankets for all of us than we were all just sleep cold in less than five minutes\nWhat a story\nI tell you that that monitor that has been my monitor ever since I heard that ... you know ever since I witnessed that I should say uh because you just can't do for yourself\nIf I can have a blanket\nThen you shouldn't have it like it you know\nI Can't be free unless you are free and vice versa so we all understand that we could do a whole lot\nAbsolutely we are now going to fast forward to back to the story earlier in our discussion you talked about meeting the young organized service students for a democratic society Tom eight and\nWho that invited you you had been south and you are now back in the north you have all of that experience including of the blanket in in the state prison\nAnd so you run into Tom have nannies invited you to go to Newark a whole different scene and or from Montgomery\n[noise] yeah I mean it was like I had suddenly gotten some credibility and some experience and Tom said we want you to come to new and I said where's new\nAnd so he explain and he said that ah the civil rights movement Newark in New Jersey Newark New Jersey and I'm Sorry I'm Glad you're bringing me back [laughter] that's [laughter] I said well I'm planning on going to Alabama I'm going to go was so clear understandings go in and announced county and ah\nSo Tom said the civil rights movement is over I said we want to arise movie say yeah this stage of the movement is over what we need is people who are going to come up north and fight the larger problems that have to do with class and race\nHe said we've got the Nineteen sixty four civil rights that we are going to get the Nineteen sixty four Ninety six\nHave to do with class and race and Newark is a majority black city and you are to come to\nVote or I've thought about it for a while or in into the mix came my parents' contention that out not to be in the movement anyway fooled time out to people aren't going to school\nAnd I said the only place I could possibly go to law school and they said alright alright alright go to law school do something with yourself so\nI played a very dangerous game with them I applied to to law school is one of them was Columbia one of them was yeah you\nGot into both of them and I decided with that announcement by the time that pronouncement about time that I could start in Newark and if I didn't like it I could go to law school and everybody would be happy so that's how I got the ... to to Newark and that's how I got into Yale Law school\nThe other thing is is that you also became one of the youngest I'm directors I think and the models to these programs I mean there were a whole set of ... I mean this is it is a fiftieth anniversary of the war on poverty\nRight model cities and a whole set of other programs came out I I'll have to say that at some point I work I was hired in in the model cities program\nAnd I'm In Brooklyn I Want you to talk a little bit also about what it was like than working from for models cities you also at some point you ran for mayor\nIn uh in Newark you had a taste of what can happen with the black political class when I was interested in your analysis around that because part of\nWhat happened on the heels of the the civil rights movement and then you had all these black mayors that were elected in in different cities and we also have a situation now today where you have poor black people today the most impoverished black people today\nAre actually poor than they were\nLike they just discovered inequality there since then the latest thing now that the Democrats and Republicans and president Barack Obama so I Want you to talk a little bit about what do you think\nTo me here we had this tremendous movement height of the movement lives were lost people back to prison or people dedicating their whole lives or to organizing and\nSome middle ground\n[noise]\nThe views expressed on this program or the views of the individual broadcaster and do not necessarily reflect the view of Wesleyan University or the W E S U management\nHello and welcome to reasonably Catholic\nKeeping the ... the progressive minded radio show about faith in action coming to you from Wesleyan University W yes you're eating\nE. F. U. S. M. dot org providing community radio that matter I'm Maria junk [noise]\nShe taught\nShe's been devoted to them\nAnd then we moved back home she's devoted to the needs of our own [noise]\nAnd then we'll check in with someone else\nThe final still making national walking every day\nHe'll tell us how we can join in one day this month\nIn a moment with Mary Lou\nMany dogs and cats been endless stays indoors staring at the wall living for the moment when you will come home and tell them you love them take them out and make a fuss over them\nDogs and cats need physical exercise in mental stimulation things to do and think about in order to be healthy and happy please set time aside for them and give them a real life and real love\nFor more information please contact people for the ethical treatment of animals at seven five seven six two to pita or helping out\nWelcome Mary Lou Connors thank you for the invitation and this opportunity to share our work such work and really you are retired [laughter] so what are you doing [laughter]\nYou're you're probably working harder now in various capacities then when you were a full time nurse\nYou know I did work for fifty years and I have absolutely no regrets\nAs a full time nurse [noise] um but now in retirement I've been retired for a little over a year I Am just amazed at how quickly the day goes by when you're doing your own timing\nAnd um but it's joy for its joyful there isn't a night where I go to bed and I start thinking about the day and I just can't go wow so retirement is also a blessing\nI'm looking at your beautiful face you really do see I don't know what you used to look like and you're working days but you were younger idiot [laughter] where we all [noise] so our mission today is to talk about your three ... your three pursue\nOne being Haiti helping in Haiti the other being helping refugees and finally the last your work at the ...\nHave you been helping in Haiti and what is the nature of you're helping I started going to Haiti um in Nineteen eighty three um by invitation of a a nursing professor when I was at St Joseph's college which is now University of St Joseph's\nAre and we spent two weeks in mountain village and had a a medical clinic I was greatly distressed when I realized there was no health care in this area\nAnd when we ran out of medicine there was nothing more we could do a and yet there are probably two hundred people still waiting and hoping\nAnd when I was I had to go into the midst of them and announced that we had no more medicine and I saw the dismay on their faces I saw hope turned to dismay\nAnd it just was a soldier very painful\nAnd yet I'm caused me to get the idea that maybe we could do more than maybe they need to continue in some way\nSo that that's how it started back then and I've been going since Nineteen eighty three every year on on but in the last six years we've been going twice a year and now we're going to a different area in the country\nAs a result of the earthquake in two thousand ten\nMany people left\nPort au prince where there was so much death and destruction and they went up to this a dry mountains side I'm up a car full up the mountain and it's called revere flawed\nUm which means cold river there is a compound up they're run by Catholic brothers Haitian Catholic brothers and they're and they're not a wealthy compound a group but they're trying really to help their own people\nTo try because where I had been going and Jeremy was well established and they had a good good outpatient public health facility they were doing lots of education and they were really doing very well\nAnd I knew that my friend there could be a consultant um if I could see a need and we could start to get some health care delivery accomplished a with the local health agents\nAnd I'm so with a medical team the other nurses and physicians are mostly from Long Island I was the only Connecticut gal but managed to fit in yeah [laughter] we go twice a year or two and have a medical clinic\nWhere in we'll be upwards to like two thousand people yeah over the course of how long over the course of about seven days now we're very limited we don't have X rays we don't have laboratory\nUm but we do work with the local village health agent we've had a local um the Haitian position with us so that we stay linked to what you know because as we leave you know who's going to follow up what kinds of health care and how can we send people for further care\nUm so what we're trying to do is help patients help patients\nI'm very good he uh were were jumping out of fish thing right exactly yeah and we're in an offshoot of a larger organization and that's called a fryer suppliers they started at least ten years ago\nAnd went and builders are from around the country but again mostly organized out of the Long Island area\nAnd these fires suppliers are the gentleman came to building well they started by building with\nYeah make was raging so in order to help stop the spread they started with latrines now Haitians would ... the whole and when I say dig holes twelve feet deep and rock uh I don't know how they do it it's all hands on\n'em but they want it and they want to help themselves so we wanted to help them of so we've done the fire suppliers over four hundred latrines in this area well we're proud that this is being done and that they've come off of the cholera lest\nYou were help is financial building supplies and at first you know where the uh the supervisors for how this can be done okay and done correctly but Haitian men are hired Haitian men are higher end to it as helpers\nAnd it's probably for most of them the only job they have all here and there are very capable they're very hardworking\nOh there aren't many Americans that can carry fifty pounds of cement on their head straight up a mountainside oh you know that's such an image oh\nIt's it's amazing to see it's amazing amazing [noise] um and they do with joy with joy because they know that they're helping each other and then and in return they'll probably get and they have gotten our workers have gotten a latrine or workers have also gotten homes\nAnd the homes that we have built up to now have been um plywood but with general that well and it's a single room it's usually a ten by twelve because previously they would have lived in what mostly broken down hot tarps ripped ... [noise]\nYou know ten like structures [noise] the best type of housing is there is to be cinder block because after a while with all the humidity in the woods will Raj cinder blocks\nAnd I showed her picture to one of the men that I Know there and he looked at it and looked at it and he said to me oh we're more more and I know you're talking about so I said no I didn't know so I started to another man 'cause it's not that clear and he's wrong well after four people telling me\nHi well when I asked the answer was she got sick and died you know there isn't really enough and what's to become of his family\nWell there is a dad in dad as part of the family and dad has a job and live which is rare and that's why I hadn't met him he was always working yes so two of the boys they went and they told dad and on the second to the last day of our clinic\nCategorize\nAnd all I was so happy to meet him and to give him the supplies and explain to him\nHow to you know how to mix the powder with the with the water the clean water et cetera et cetera go on and on and explain and and the other supplies that I had gotten for the rest of the family\nAnd she was he listened very carefully he could respond back but as he turned to leave he looked at me and he said in his own language\nI miss her and it\nWas such a you know it was bad but it was also an awakening guess we can't save everybody\nYou know but how do we help\nWell two of the children in this family cannot go to schools dad doesn't have the money\nMike He had to leave school and the older sister the only girl she was able dad kept her in school lesson yup but Mike He and his brother weren't able to finish school and take their final tests where they could move to the next level\nSo knowing this I was able to go to the school principal\nAnd give the necessary funds for these two children could finish their year and so they could advance with them with their friends or you'll find twelve year old children in third grade because you can only go to school\nReasonable good education\nAnd to the children there but they have to pay and they have to pay their teachers you know that's not public\nAnd because of the nutrition problem that I recognized I branched off from the building team and the medical team in the sense that I decided I Would try to get improved nutrition and food production so I started a fiber won the nonprofit\nAnd called it helping Haitian children\nIn addition I'm trying to listeners can't see me shaking my head\nIn astonishment\nWell I could only do this because others volunteered to help\nA former patient of mine who is a retired lawyer said uh you know I Will I'm not accustomed to doing this paperwork but I'll let me let me do it\nSo he did get that five on the the nonprofit status [noise] uh which was such a big uh help so that you know we could go people would like to have tax deduction if they're going to give and that's a very reasonable request you know so now we could provide that\nSo we started advertising a little bit more in the sense of telling people and and I I right thank you notes and they're on cards made by a Haitian gentleman um and they have a little boy with a fishing pole and the fish hanging off the end of it\nAnd of course we all know that teach the person to fish okay ah and my logo is is from a a Haiti staying and it goes like this to an empty stomach has no ears [noise] so when the children go to school\nThe principal of the school of the run by these Haitian brothers\nThe day so I said can we start a lunch program at the school and of course he said Oh yes Oh yes we can\nBut there are seven hundred students in the school so Mary Lou that was a the judge said well you know God provides if he wants this to happen and I said\nTo him you you you can you hear me now I did say when I first went to Haiti wow look at all these retired people in all the good work and they were doing\nSo I made a PACT I said God if you keep me healthy when I retire I'll go back well he kept his pack but guess what I Do laid my retirement because I knew what I was going to have to do [laughter] and I was scared [laughter]\nOh well I'm trusting me so [laughter]\nSo you've done a lunch program going in the lunch program going\nAgain when you're amazing and but we could all I could only afford to stretch myself for three days a week\nAnd that meant sending two thousand dollars a month and we send it through the summer so that they can do the principal does a program because there is nothing for the children to do on this mountain side there are no can't even\nPlay soccer on a mountainside there's one level area okay and if you get in the way of the soccer players you could get her [laughter] they're serious and you know they play soccer barefoot\nOh my goodness so have soccer sure but you know I learned you know I had to go through it to run real fast [laughter] you're something\nBut it's it's not just to me it's you know\nI Know but yeah I live and your love for these people have so plane [noise] you know how can we help I mean what's your website maybe we can go visit your website and see what we can do to help you\nAnders I have ten women that are ... grinding corn every day so that the older students that come later in the day can have a nutritionist it's either a porridge called August on or they can send it and make it into a drink and these women now when they see me they complain of their short arm [laughter]\nAnd this was all volunteer\nAnd I realized that these are moms\nThat having brought in from the area\nSo we started to pay the mom's a whopping\nTwenty dollars a month they were jumping with joy well now this year I Am so happy to say um that I have raised the anti we're now sending three thousand dollars a month and feeding the children four days a week\nAnd I've increased the women's salary to thirty dollars a month wow a dollar a day ... who they they they're sold thrills goes a long way goes a long way because they also get a we ship a lot of food we ship a lot of supplies and they are on the receiving list\nSo we make sure that our women who are so faithful and work so hard because you know what Haitians share a they will share with the neighbors who don't have\nIf you're just joining us this is the visit with Mary Lou Connors about her volunteerism in Haiti in the Connecticut women's prison and more this is reasonably Catholic keeping the faith coming to you from Wesleyan University is W E s few eighty eight point one FM Middletown back in a moment with more\nSo you know I'm a dog and I'm kinda near the family but I've noticed a trend among humans do this thing where they go around and did all my toys and hide them in the basket but it's always the same basket and employers ... shows\nA person in the best thing to happen to a shelter but be that person adopt brought you buy the ad council and the shelter pet project ... or\nSo and the cat and I just moved in with this new human and she got the little toy she always playing with all day long path to tap tap you can't put a down\nThere and get this she talked to last week she asked for Chinese and guess what ... showed up like magic humans have cool toy\nA person in the best thing to happen to a shelter but be that person adopt brought you buy the ad council and the shelter pet project dark\nYou know what I Know about Haiti and it's very little but I feel like I Know this much which is that their problems [noise]\nNatural disasters of course but also government corruption kind of complicates things and do you have any fear that the help the the money you spend is going to be intercepted\n[noise] you know\nHave been very fortunate over these years working with the uh ... the little brothers distinct treat them the infant Jesus [noise]\nAnd I knew it was my invitation and I said our God hit me over the head\nI if you put me here and I'll do what I can so how is it that you've done this for Fifteen Years what is it about the work you see you know that we you taste so little you taste so little\nAnd believe it or not I am not a person to many words [laughter] are we really hurts the women who commits a Christian women's ministry\nFor prayed with so many Christian sisters and have this it's been such an opening and it's been such it's such a beautiful way to expand my own prayer world\nAnd to go into the prison and meet these young they're mostly really young women\nWho have made wrong choice is mostly about drugs mostly about drugs and to hear their pain and and didn't hear them pray and that was another ten step shop in my prayer life what do you mean well their prayers were toasted here\nAnd so we're really from the depths of their hearts and their souls\nYou know one thing and and it being servants for God in an atmosphere that was that could be very negative that could be problematic but yet they chose\nAnd it's not easy to be a role model in in an area where there there's a lot of negativity\nBut these women they come we have an annual retreat which is three and a half days and then we go back every month every month for prayer and share time and they they come running down the hall to hell why NATO of the organization I Love the ...\nOur motto as we do is listen listen\nLove love\nI have driven to Nyhan tick and back and have said nothing while I'm sitting there and have been received with open arms and with gratitude you gave up your time to come to us thank you pleased to have a good safe drive home\nThere's always I mean fear you know to know the fear it does not enter it joy and sharing our joyous mother trees just said don't bring them they're your tears\nMary Lou that's so moving\nWhen I finally read that it got me to realize you ask God you cast me off as you gave me so much reason to have joy that I Am thrilled now to be able to pass it on\nA\nCanal that I think we're going to leave it there Mary Lou okay and I think I remember I Know\nWe're we're pushing the limit of our time together but there is one more thing you do that I'm going to prevail upon you to tell because I have a feeling it may be among the most important things you do um\nThank you this [noise] I'm I'm a minister of the Eucharist okay from my church and I bring\nThe whole EU crashed into the hospital and to St Francis hospital\nTwice a month and also to a convalescent home\nI'm an Avon and I have to tell you that kind of a lesson home I have been given communion there's one little lady there she was a hundred and two years old oh she doesn't really say much but when she sees me she opens her eyes [noise]\nShe makes the sign of the cross\nShe receives communion ICU bought communion yeah and when I leave she goes\nOh God God\nAnd I can tell you that brings me back every week that it is so amazing and talk about you know joy you know you know you always get back so it kinda keeps filling my my broke invest all because it pours out but it's got to get back in well\nYou read my mind I was going to do an intervention\nBecause we you should just go get yourself a regular massage and I'm Manny petty and I don't know what you do for fun which sounds like you're volunteer work is sustaining you quite nicely but do you do anything just for I mean do you have a margarita now and then helped me out [laughter]\nI'm allergic to wine [laughter]\nAnd I wish I was ... by the end if I drink like upper Iowa Priya who doesn't love why what are you doing in this profession I have to honestly say that I'm I'm like I Love to walk\nWhich means I Love to most of them on you know ... years you looked at me like I Know I'm weird you ... you know it's just mindless should go up down up down\nI mean it and you're out died and it you know that's the beauty again of being retired of digging feel to spend more time in the beautiful outside this world that we have I never knew we had so many wonderful days\nAnd just to to watch spring blossom you know and and the crowd you know this past couple of weeks we have had magnificent beautiful those fluffy gorgeous cloud and I can just watch them and just to get that grant\nAnd right now the rain that's feeding our trees that got very dry and desperate for the rain and I'm watching them pop back up and their leaves\nSo yes I Am I gonna things I'd like to make my leaves pop back up honest to God Mary Lou have you always been this way I don't know would always means but I Do know that I used to\nGo feed the chicken the neighbors chickens when I was little believe it or not I'm old growing up in Hartford we had chicken neighbors had chicken coops or a nice do you know you break the grass and you feed it to the chicken and then if I get tired I Would fall asleep\nSo more than once you know there were groups of friends running it\nIs for peace I think God Forbid I thank God for you you're thank you for coming to Middletown to tell us it's inspiring thank you thank you so much for having anything is a time flew it it did to thank you come back anytime\nThe county a garden full farmhouse concerts is scheduled in Durham for the weekend of October Nineteen through the twenty first at the gas\nSlur farm one fifty nine middle road term award winning pianist Timothy ... returns to the venue to perform works by Bach ... this show pen and rock modern off the friday concert begins at seven pm Saturday and Sunday concerts begin that for\nThe grounds open for picnicking two hours before each concerts and Tim gas\nAlert will lead a tour of its extensive gardens one hour before each county to county a garden music and arts foundation is in sixth year of offering\nChamber music concerts in an intimate farmhouse setting tickets at twenty five dollars are available on line and tell me a garden music and arts dot org or by calling two oh three two one five one nine four to\nGetting all of the United states [noise] I Love them all when Vega our eyes will do and I said to me as they do speak any English [noise]\nEveryone wants to have a higher education [noise]\nI Hope my mother's very fast and then my husband I thought I Can't honestly yes I thought it would be a chef and I saw the last thing they love they love\nThe integrated refugee and service is located\nIn New haven things to provide a warm welcome for refugees and they arrive at their new home here in the u._s.\nRefugees are language lessons employment training in place when and legal services you can also donate used furniture volunteer your time or higher refugee for more information please visit I our ISP T. dot org next up al ... and how we can take a stand for immigration reform\nAnd\n\nWell being that I'm at CERN\nAre on the\nJob or anything to do that and that sort of a\nMan in Maryland\n\nAnd many of them and then\nWalk in and [noise]\nNight I resent the double header Saturday with Arlen Godfrey banned in their early Godfrey that college drink automatic present dot com infinity hall brings you ten years and music featuring aid to the bar in Norfolk on Wednesday\nOn Thursday it's acoustic alchemy and on Saturday it's blues and folk with David Rhomberg quintet John Laws or the moody blues perform Saturday and on Sunday you can hear indie rock with Heather Maloney and stuff liar\nNow there have relocation it speak up story telling on friday night we'd walk of shame stories of embarrassment\nYou know it could really reveal them at the time I blew a bubble blogger Steve Martin really happen and you know what he told me it was the funniest thing you've ever seen that's no small achievement in my estimation worth ... on Sunday they bring you jethro told the Martin bar ban with an evening a blues rock and told infinity all dot com\nWesleyan Center for the arts in Middletown advise you to free lecture Wednesday at four thirty on the culture of Japanese aesthetics there's an artist lecture on Thursday for thirty by photographer writer Nicholas Milner all tides an island Wesleyan dot E. D. U.\nDo you ... festival in downtown trick or treat Saturday from eleven to for enjoy pony rides gains food vendors face painting a magic show a costume contest and more support our local church in Middletown\n... flash recreation where you go from ... now he's run down and send them off the beaten track in central Connecticut Hartford we'll outweighs continue the run abuse day or about a\nArtifact ties in Mexico city and three oh six Hollywood documentary or two filmmakers\nExploring the home of their dead grandmother also continuing its customer infinity about the radical artwork ... opening friday is I Am not a witch a fable about as Ambien girl accused of witchcraft and the lady about a Thirteen year old girl with a father in the military the also open\nAll about Nina tragic comedy about a female comedian check the website for details and screening times at our ways dot org trinity college it's in a studio in Hartford continues the run of the captain and historical documentary about the world war two German Army desert her\nOn Thursday the open eighth grade about an inch reverted girls surviving her last year in middle school there's a one time screening of the Nineteen eighty eight classic\nFantasy comedy beetle juice starring and Saturday Night rather at ten pm check the website for all offerings into but it's been a studio out or\nThe tent Middletown international film festival continues tonight with a screening of drunk towns finest three young people searching for love and the Navajo reservation at the end of the Wesleyan University Center for film studies go to Facebook dot com bust city or\nThe federal cultural center offers a free one time screening of things don't yet a story of generational trauma and the Holocaust Thursday at seven to their Hartford location go to charter oaks center dot org here's a rundown tonight's line up here on W E s you waiting for one FM Middletown as he wrote other new fault program season\nWe'll see the new romantic pumped Prague wonderland as a place for it and it always full of surprises\nFrom six to nine and ... with Bill rebel offers an eclectic collection of new and older folk Americana bluegrass losing other music with their roots influence plus a concert lifting and frequent ticket give away feels also going to be covering for D. J. J. cherry to speak [noise]\nNormally from eight to nine and he's going to be hosting a live studio appearance with the national recording artist monsters retreat\nFor the first hour because ... tune in for rare personal concert may just for you thank you bill from nine to ten of detest patterns show bringing you the sound of singing but I'm falling down the stairs\nAt ten pm it's the audible underground but DJ Josh invent comics floor of a variety of underground music by independent or relatively unknown artists from many genres while occasionally discussing current events they elected by the mainstream media from eleven no this is not Fox News other people\nApparently are using that phrase to from all over the midnight stay tuned for mixed media will DJ picking the city with an DJ magnanimous we can do and we talk about it you know it's\nFun that's my son like at midnight album reviews a DJ in the wind a DJ margarine music show that searches for interviews narratives musical themes in general continuity of albums that judge elects a collection of songs on and on the album to think deeply into a new album every week from one to\nRoad trip a DJ Vix every show covered a different city a new rising artist from that same home town and nobody had money\nYou don't have to spend a penny just tune into W E s U N from two to four it's upfronts old son ... from us from Pacifica I think I saw that any specialty section anyway that's all for today's ... stick around to go\nThis is wonderland party W E are cute in Middletown\nAnd\n[noise] [noise] [noise] [noise]\n[noise]\nAnd uh know without a plan [noise] uh the chain\nYou do\nWith all the time [noise] trying to try and learn and [noise] and that and saying [noise] [noise] ...\n[noise] I don't know I Know when when one why then that way and [noise] and\nI don't know I'm ...\nI'm ... [noise] where I live in I'm In no wind no no no no no one was from\nThe beach you know Germany to play a game\nRoom [noise] with time then Mm\n... ...\n... we learned from Dr germ then\nHolding\nOn to ... to\n\n[noise] [noise] [noise] [noise] [noise]\nOh the I'm going to change [noise] um [noise] oh I'm doing now in the room with a um [noise]\nThe way of law I'm not\nIn a way ... ...\n...\n\n\nUm and this is the uh [noise] uh [noise]\nThe ... and\nThen I'm sure [noise]\nUm um um\nMy\nMom raised\n\n\nDa da\n\n\n\nDa da\nDa\nDa\nDa\nWell ... ... ... ...\nA rich thirty a beat them\nA\nFlow\nBook the power to change my mind\n... mom ...\nCan't when do you when you know\nAre we now the bone\n\nOr\n\n\nOr or or or or\nNa ... [noise] [noise] [noise] well [noise]\nWell [noise] [noise] [noise]\n[noise] [noise]\n...\n... na\nNa na\n\nNa na\nAnd ... know that\nLike me now that\n... ...\n... ...\n... you know\n\n\n\n\n\n\n\n\nWhoa\nWhoa\n\nUm\n\n\nAre open\nAm\nTo do\nMean in in ...\nYou're\n\n\n\nMiddle school\nThe ground they charge like cells and meeting it gets\nYou nowhere near as the ...\nOf the story\n\n\n\nA lawyer but you need the quiet which\n... it's the only time money free\nRein member thoughts a treasure hall of fame used to be\n... I don't think about tomorrow\nA judge to think on where you are\n[noise] here's a song ... hard thing was\nI was just donors\nIn their ... yards of illness that green day\nToward me remembering shipped away\nBut loving sells minutes until it's don't reward\n... in the bureau's don't\n...\nTo ... this morning ... ...\nForward to mid June ...\nWhat will be fun too soon to\nBe with you once again\nTo your eyes told me all my heart and needed to know\nName alone across the night\nI didn't know much about the government\n\n\n\n\nWho\nWere timing solely to wonder why in the back next year among elites some time but it was just started as a funny it's\n... just between me even though you\nI Can't speak about tomorrow and\nI just think ... wherever you go on\nAnd here's a song\nThat my heart was part\nOf the summer [noise] which here and\nThis is known that led Mona hard to change the way I was just gone\nOr a\nNew and\n\n\nA good evening a welcome to will call a very special edition of the blender for starters it's a three hour show tonight we're going to collapse but we also have monsters or retreat studio that just for fun I got some public service not supposed to do first\nMicrosoft Roomba okay this is a test or\nGo to public service announcements and we'll be back to live with monsters retreat [noise]\nPerfect\nOr here's a couple some messages for you a Bible mustard secrete who are on the road and happened to buy into that but to the grocery store messages and that will that will move on to monsters of treats life here on the border um WVU if you [noise]\nHello this is Anne Marie from the button would tree located at six o five main street in a vibrant arts district Middletown, Connecticut\nFor over Twenty years about new would treat has been part of the movement to bring the art into our daily lives open seven days a week button would treat present great jazz folk and world music theater poetry and workshops something for the mind body and soul\nEmerging artists find is based on an aircraft\nWell world class musicians play the button when trees intimate room for great acoustics and attentive audiences\nButton with trees book store is open daily from ten am on the come on in for a cup of coffee and view this month art installation\nFor information on upcoming events or how you can help a great organization to become even better visit button and we'll dot org that button would dot O. R. G.\nOr call it sixty three four seven for nine five seven [noise]\nIt's just difficult they borrow drastically different than\nWhen the shooter finally gets into the classroom and we're going to pretend to be dead so that he doesn't think that\nIs expected to hold a press conference and offer thoughts and prayers\nWe will provide live updates\nPromise dot org [noise] [noise] do you know you can listen to W E s you on your smart speaker [noise] all you have to do to tell us to play W. E. S. U. and you'll be with us wherever you are on the planet [noise]\nHi this is George lay director of the Guthrie center coming to you from our loews church the actual church where it all happened over forty years ago on Thanksgiving Day\nThere's all kinds of folks here having a Thanksgiving dinner that can be [noise]\nThey're having a great time\nWe'd like to invite you to become a member and help support the wonderful things we do here at the Guthrie center so check us out at Guthrie centered died for can have a wonderful Thanksgiving [noise]\nOkay we're back here live in the studio and let's pull up studio be in the streets are still there hustle they left\nBecause hello bill can you hear I can hear you hear me it's amazing when this war that doesn't\nAlways believe me welcome mustard treats Libby Glover Michael Hoff David tumble of it's a\nNice to black you're in the neighborhood hello New England [laughter] you're on the road or I guess you're on the way the New Hampshire yeah sure Hampshire\nAnd three and a three in Massachusetts and then uh back to my mom's for dinner that can't be home next week or so\nYeah this is along to her for us usually a a good a good tour for us as like five gangs in three days and thousand miles in a cloud of dust and this is a little a little more gigs more days and more dust\nOr you're at the beginning of the tour yeah this guy you\nOur listeners first three or four minutes\nThat's right okay so this is a dress\nOh yeah that'd be fine\nIf you have that first album of ours I don't think he's I don't think of yourself and plus he doesn't have an all night and there are you okay that's the one cylinder no actually we had an eight track\nI bet you then we had we had forty five ... we had an eight track started off in Seventy fun with the picture the picture on the cover of hum\nOf the first album plus has got all three of us in Nineteen Seventy five you know all three of us and here we are still alive or dead even Ron\nLet's get another song David uh you're from Connecticut\nYes from Branford brand for just these New Haven so it's a totally delightful to be back in the state Michael lifting ... for ...\nYeah yeah when my dad was my dad was working there\nAnd a living is first time ever in Connecticut was this summer we play down my sister's maritime museum in London and then the New Bedford folk festival so this is only for a second time\nThat much about oh good well speaking of brand for a call about Branford I I'm not sure for a whole lot of songs out there about\nYou know it's you know so we got hired for the mystic see music festival and um\nMm\n\nWhere is it looks like it might be hard road I'm going to walk the you haven't seen the movie in\nMy head to head with that I can come to a\nGym when they push you know how to raise my voice and stand my ground looks like it might be a a ... I'm going to do well could\nWe use ... and it looks like it might be long nine but I Can't go nowhere handling no would go on\nI guess that our I Will say it's a bad day on the top ... looks like it by the bomb not again I go to ...\n... ... right right and the name I don't know how to bake I ... I was saying is a guy by a or\nWhatever that looks like it might be climb will fall into the\n... we're going to be a long time ago I asked one about the history\nWell a tight\nThey by your side I Will be with you or the whole damn right looks like it might be a terrible that's why I Will follow the Rio is the\nAnd it looks like it might be a hard road I'm going to walk we you\nAnd do my ... year old but I can guarantee them do lift you up when they put you down and I were raised by Dan my ground but like it might be a\nRole of [noise] um no no no well\nWe used to um go about it with you I don't know about ...\nA lot of crime shine my diet the whole night level\nBecause it looks like it might be a\nHard road to ...\n...\nNice message duck and a three part harmony [laughter]\nA very important and significant amount and most important things we might have just one more chance to have art I got a three weeks from today that's right that's right yeah it wasn't closing in most\nImportant election of our lives so in a whole just toss sudden a public service announcements handed out there and read out the vote in in three weeks to make sure you do go\nWell not only that I I've been making the same speech but I'll make it again quickly I've been I've been calling for every one of us to target five other people\nAnd bring those people along to the polls make sure they got properly registered make sure they have a way to get there and bring them yourself if you have to but let's every one of us bring five more don't have to tell anybody out to vote if you do that and I'm not telling anybody had to vote just bring five and high achievers among us must spring can\nTell you we're talking with mustard seed retreat right here ah Libby Glover Michael ... David symbol of itch huh so glad you came down here you are so glad or I guess the road to New Hampshire pass\nThrough middle so glad a whole roads passenger rail to you know and I like the ... and my mom\nLast night in Branford and tonight into you know she's listening in you know she's she's turning at Indian I gotta say high ... high seemed to go I'm I'm I\nDo have to do a ... ah [noise] I think it's time for another song\nWell good well we're talking about uh the election so um there's a song I wrote after the two thousand four presidential election I wasn't feeling too good about it as feeling to politics have gotten so ugly how's it going to get any worse\nOr how much side yes yes I have\nBut you know we find there's a whole lot more common ground among at least among our audiences you know and once you get past the talking heads are out there who are paid to live or just why because\nAnd do some people who you know and you know there's been a lot of lot of propaganda and you got to find the propaganda but this is gone attack had quite a quite a white man used in a lot of new jury churches around the country\nGot in a strong book the rise again so I'm always just simple\n\nAll the food to\nLie to the shore or\nMorality has the news you know one\nDay [noise]\nDrone ... make each one\nDuring the\n... you\nKnow it's hard for us to you know judge ... you're drawing\nEvery day and [noise]\nWhy not at\nWar and raise it above\nThe bank\nOf\nEvery day and\nSaid I'm a little baby while I like to write\nA man dressed play\nEvery man\nWoman said well we use them against federal law yeah well\nYou should open making you know I'm In Manhattan [noise] [noise] you know I Am\nEvery day I Am in the game a hard time when many of these streaming every day or two\nAgo\nStating why they show a na na\nNa na na na\nEvery day [laughter]\nWell there's no well we still making you well\n\nMayor\n[noise] that's where all your Unitarian seltzer and everyone else very nice includes this song well it is you know I wanted to go beyond politics and beyond religion to where there were there was common ground and and I think there is so\n[noise]\nWell this is from yes I Know you've got to throw a company that's generally the way of it or at least one and I am not tearing jokes now there's a bunch of folks that train a puppy and New Hampshire where's this tour take yeah\nWe're in Concord New Hampshire tomorrow and I'll take the Peterborough and then we go down to west rocks very upset or Boston April outside of Boston that we're doing the your church service on Sunday\nBack home and then a couple of weeks and then we had down south we're Louisiana and Texas so it's been a busy busy busy time but you know the album is doing well and\nWe you know we we tried to keep it to you know fifty to sixty shows a year which is which is still a lot of a lot of working well you know\nWe're being retired [laughter] ... [laughter]\nThey want to tell us about the album the new one what make your own luck my of my client I uh uh or none of us thought there should be any other title really once we get down to it it just kind of\nWe had a whole list the titles and that was the best one in the beginning and it was the best one right before the whole thing was done and we thought no there's no change in that\nYeah we feel like I was sort of really fits [laughter] who who we are at this point I mean really this is our fourteenth recording they've all done really well you know we we have is they ah\nTo return them a sumo\nOh the other\nAnd\n\nWho that is lovely what's the name of that song mother boat on Sunday up on the CD a home by the album in the morning but it's on the CD back to back\nActually early this new t._v. we've done it the first time movies actually done a CD with us she was on our first and second recording and mother will just one song she sang a song spin around\nI that's why I wanted to play it for you actually is because that's one of the ones that we've been playing since we started way back when that's one of the first ones I remember practicing as a trio\nWhat kind of a mini hit on the folk music circuit you know everybody that song because it was just so good and again who wrote the raiders Richard penny the Iran and you why a\nSinger songwriter from Milwaukee Does he still live in Milwaukee yep yeah\nWe'll probably see him in December with an up there on the road [noise] so yeah we'd like to do another one from the new album from Michael in I started back in the nineties and I only finished it up a couple of years ago sometimes it goes like that\nUm [noise] it's a it's called the rain it was just as a a\nJust a timely time wasting your time is thing to take a pause and think you know who who are you and what are you doing and why and especially taking a pause before this election you know just take type of thing\n\nWe turn near in winter chateau knowing spring is drawing the key thing faced with summers promise and the turning of the year and\nThey voted on my own bang for the sun St Bernard Shaw when there is a scene for a moment and thought about John saying well the July ... day is done\nA simple pleasure planting garden picking stone and proving we a space the ... the rush and caught her finding some things that we\nNeed and things but I'm I'm staying with us on straight and found the joy when they dont know saying well I'm I'm In the same San staying positive John Day is Don\nYou count was ... when then fire\nRainy then thing for a moment meetings\nSame father joy when day is bomb go who's been voted one moment thing John Wayne voter joy when they are\nGone and the whole didn't dust geo techno vision tell us how to think and you we ignore the corporate chatter\nI'd be right there are writing being wheeled thing for the phone rang on bank father John one day down on the phone with my mum saying non thing while they draw one day down\nKnowing that we have the power were each of us in our own way to make these moments some things better well\nRe train jets started that way and see for going along with James Van Allen St John when there is a thing called gumbo thing sign saying well the jar when they are done some return\nYour and he the problem is written river tone in their ... the harvest and remember\nWho we are and why we care and things for them being done sang pardon the joy when they had a thing or a no vote on saying well when they are uh\n\nSounds like it could be another church song [laughter] right but you know there there is a there is a lot\nHey what's your guess that may be considered this and um you know ... before we\nGot we got time for a couple of more well sure go force\nWell not Michael ... I think that's something I'm ...\nI live in the studio and up you know this is a song\nI I learned back in in like Nineteen Seventy from uh from Randy burns really brings with known in New York now he's still performing some are just the monster talent unbelievable songwriter and folklore\nAnd again I'm just be a just a mix of the traditional and and contemporary I always thought that um [noise]\nWho Shannon to our loan to see you\nWell away or you ... over well Shannon ...\n...\nOh\nI dont know where the\nCost so while you miss\nThe I have a president that why world\nA well the the ... or or the data in years I ...\nOh\nOkay I'm by no way\n... by miss him too\nHa ha ha\nHa ha or you are\nFor her I crossed the fire\nBlamed for it or\n...\nI'm a well paying in\nThe law so why men is due to\nThe well Shenandoah a loan gee you\nKnow the\nMan\nWho I'm Shannon I now I'm\n...\nI'm a I'm a white man\nRoss the why humans who\n\nThe\nLike to watch my level you're what you're doing one line you know we were red lining to me [laughter] but that was wonderful\nI think after a short oh okay I was going to do one I Would do short\nOkay so uh Michael's going through our um here's another obscure reference when this is from a new album is called from short future to Long Beach not short beach there's a part of Branford, Connecticut it's most eastern\nProvince of Frankfurt right on the east haven line and um the way Michael tell us that um he uh you know when we're ... I'm just like last night we were we traveled fourteen hours drove fourteen hours straight to get to\nRight yeah fourteen hours a day after the fish and like that for the last uh last actually before we get off my mom's exit what'd you see there's three\nOf his shirt ... so a few years ago Michael said you know I've got this idea from short beach to Long Beach and and to me it was like well I I don't I don't get that but but but they do with it so uh so and he uh he turned out really a nice new song Mm\n\nI mean it just gives you an example Michael before he met me was a member of the guard bonds of beans blues band [laughter] okay and\nHe might want to Yosemite than in the golden ... facts that they weren't having much of that so what do they know all nighter there you go online and they're not sure I'm I'm Wondering I warn you about the long half yeah now here's a short\nAnswer [laughter] the way I think of it is mustard retreat as a place\nAll right you go you go down there you go down the freeway get off of that you go down to two lane get off of that you go down to two track and you turn right at the red barn go up the to track in over the next ridge and on the other side of that read just muster\nRetreat\nOkay well I'm I'm totally often [laughter] mustard Theresa thanks for coming on Melville until much fun thank you so much you know next time you're through here and you're playing something you know keep up the mind flying the button with\nThree or anything up there [noise] it'd be great to have you on fang okay thank you thanks for having us my pleasure\n[noise] okay mustard street there okay we're really ran a little longer but uh\nIt's just too much fun to to send them on their way\nAnyway I'm OK got a couple of new song similar Loretta Lynn and will do will hit the concert listings maybe about ten after take a few minutes to a tidy up here so here's something brand new from ... her new album or wouldn't it be\nBall low\nLow got me down from\n... ... ...\nFor some well\nLet him know no more TV crying\nComment in this you\nFor someone to live for [noise]\nLove being alone no\nKnow I Can't do much\nMore someone tell me a long\n\nYou know middle\nThe man\nAnd you know time the two doors down\nAnd the main\nThing no time to do that\nDay with me and you know they would make it you can de with me a little bit longer\nAin't no time to go door they\nNo time at the door\nMay or may to live no rain in Maine in the game\nWouldn't be a little bit low\nDoor to they live in Maine and\nMan then they're going to\nA year at the low ... pretty easily\nDay with me and you know there's a day with me if the king day with me and then you know let me know to go door that\n\nWouldn't nip beep but if you could say love me you just want to\nDo with a slew ...\nWouldn't that be\nNow would that be the\nWouldn't it be great love for the bomb\nNow wouldn't that be gray and\nWouldn't that be great human\nWouldn't it be\nNear me\nNow would that be great\nIn the name of the men so bright thank skiing\nIn the name of the\nWater man he was\nKnow when toy\nWouldn't it be [noise]\nJuly\nNow wouldn't that be great he\nWouldn't it be\nJust to\nLord I Know you ...\n[noise]\n\n\nThem a little more mellow and\n\nDo\n... and\nThen they will do during the back door and then the ... the brutality thing to\nThat and we can and then I got it through the ... down in the in the last ... and\n... and all the time I got to the doctor Dr\nJune and turned into a mountain in there to protect the details and\nAnd no [laughter]\n\nWell\n\n... ... ... ... ... ... ...\n... ...\n... ... ... ... ... ... ... I've been\nWay no there were nine\n... ... ... ... and I'm\nWay the law alright\n... ... ... dancing and the answers are all wrong trouble now\nA warm ... uh\nWell my baby left me all alone and blue\n...\n... man do\nShe did tell me the only thing she did go to the mall\nBut Long Beach drove all along\nGoods by job oh well we live on\n... bought out and\nThat same struggle and with me and they\nKnow the the ... and then the\nDolls and now I'm struggling now they\nBought a loan me trouble in la\nThe fuse dream ... ... ... ... ...\nAnd I don't have much money for this\nThing I\nDo a damn the out my back instill that change is all go down\nTrouble now but our Long Beach trouble I'm\nReally worried man gotta worry stadium my\nBut he can hide it take a um\n[noise]\nDo you pick up and\nAll the jar and\nAnd then saw no trouble now but ah well the trouble is a\nTrouble for a mile away\nBought out at that\nSame struggle man with me today\n\nThat the ...\nAnd then in Maine a nominee rebels are now\nBought a loan so I'm I'm\nI'm ... down by a well ...\nOther go more than ten\nYou\n\nI was born in ... when\nI was born in ...\n\nRaging the\nRolling mountains are being very around the UT\nSee ...\n... ... ...\nHe wants to know well we know\nI'm On my\nRings ban them all\nI'm I'm\nNot Mac day\nYou know try\nTo run by my side\nWhy not yeah I\nKnow we live na\nRunning river raging the all the breeze died the around the the the of the state I call my all from the bird\nIs so\nNo I just want to break in here for just a moment I Believe I told you that rebel jak Eli is playing ... nature um Saturday That's not correct yes plant there friday show starts it's thirty so\nChange your calendar disrupt this Friday ... it's a roaring brook nature Centre okay one more from Paul Simon\nThat on\nThe on the morning\nDied yet\nFill out on the floor and\nWell a big fan of ran out that in mind the DOMA when the ... and in fact the old ... they were all a tailor a good\nView Mm\nBut your flag down won't get you and then they have an any more than\nYour dirty little war\nNow do the stone lack killer\nFlag that go along get you and they haven't maybe more\nThan Merle Haggard yellow\nAnd the cashier said to me\nIt it drawn Christmas well we'll give you ten of them playing for free\nAround a bit I took him up on what he said\nAnd done ... stickers all over my car and one of my wife for eight years\nBut your flag down don't get you in that and then any more there are already\nOvercrowded and I'm your dirty little warm\nNow either do my job\nEnd up having any more and\nMore of an airplane or we're going to dump it out\n[noise] oh that's bad part ever got a plan\nI got married when she used to build with black ... golden the dog ran a car that occur\nAnd I'll never understand why the man standing in the burn the gate and\nWell get you in a man any more\nWe're already over rally around me are dirty and low\nYeah well you\nHave any more [noise]\n\nWhere do we go [noise]\nYeah I get to heaven I'm a gay guy Dan thank you for more blessing one man can van dam or getting into\nThe rock and roll band checking do as well do they afterlife gray and men are more giving a\nBad good and you're right yeah I'm going to move the bigger the man ...\nThe British girl\nOh to to do well\nSo there's a real man [noise] ...\nThen it's guys met when\nI'm getting back into show business so I'm real grabbing that good go the tree of forgiveness\nAnd put give everybody a dummy any hot ... wow marriage even better future\nIn smother them with much\nGoes then I'm going to get a cat\nCameras dig around bad man I'm ...\nOnly kidding that Bernie girls on\nYeah just a little man\nYeah well yeah I get to heaven\nAnd we'll take that risk ... ... are\nWe going to do with him after your book the ... ...\nAnd then we'll go buy my mom and dad\nIn good old Robert de ... bad you couldn't Jackie cut ...\n... ...\n... that's where our lives I miss him oh great [noise]", "year": "2018", "show_name": "no_show", "city": "Middletown", "day": "16"}