{"month": "10", "state": "MA", "station": "WNNZ", "content": "Streaming of New England public radio is funded by you know the western mass coaching alliance offering personal and professional growth through its member coaches\nCoaches profiles available at western mass coaches dot com funded by un coaching caregivers L L C Jim ferry offering guidance and care management for elders the disabled and their caregivers coaching caregivers dot com\nFor news throughout the day stay with the enemy PR news network at ... am six forty but Ninety One seven FM in Franklin County and online at any P. R. dot net\nNews from National Public radio in the any PR newsroom is next on here and now\nThis is the PR news network WINZ am six forty in Westfield WINZ FM Ninety One Seventy airfield\nWFCR eighty eight five H. D. three Amherst W women you know in five great Barrington do you want to nine Ninety eight nine Adams W. A. I. C. Ninety One nine Springfield and W. A. M. H. U. nine three Amherst\nIn partnership with Amherst College and UMass Amherst it's twelve o'clock\n\nFunding for here and now comes from ... graders of mad at me like software accelerating the pace of engineering and ... million you learn more men were not come from NPR and W. B. U. R. Boston I'm ... I'm Peter O'Dowd\nIt's you know [noise]\nI mean I'm UN ambassador Nikki Haley is retiring at the end of the year but she won't be running for president in twenty twenty\nWholesome food shortages wildfires and rising temperatures scientists say the globe is headed for catastrophe what response can Americans expect from the federal government and who isn't thanks to you the British mystery man's done to the world with one of his paintings film disrupted moments after it was sold at auction\nDissatisfaction with why is it happening in and saying how how how could they get all the time they when they tried to them into the frame\nThese stories and the safety concerns around a fatal crash of a stretch limo in upstate New York coming up here in\nThe news is first\nLive from NPR News in Washington I'm Laurie London President Trump says US ambassador to the U.N Nikki Haley is leaving his administration at the end of the year Haley surprised many with her decision to leave\nBut as NPR's Michele Kelemen reports Trump is holding out the possibility that she may be back\nAnd she sat next to the president and the oval office Nikki Haley was playing down her political ambitions no I'm\nNot running for twenty twenty I promise you what are we doing is we're paying for this one so I'll look forward to supporting the front of him and vices like if\nShe was effusive into was Trump who calls Haley a quote very special person adding that she told them six months ago she wants to take some time off\nHe says he will name a successor in the next few weeks before being tapped by Trump to serve at the un Haley was governor of South Carolina Michele ... NPR News the state department\nEvacuation orders are underway as hurricane Michel heads toward Florida's Gulf Coast officials say it's expected to make landfall is a major category three storm FEMA associate administrator of Jeff ... says infrastructure damage and power outages can be expected\nOr a K. Mart who was going to be a devastating storm that's real part of Florida is not seeing a story of this magnitude in quite some time\nBuyer and says it is a fast moving high surge storm with very very powerful wins\nAnd it could also produce tornadoes he warns damage to the power structure could be more significant than Florence emergency officials across the Carolinas they're also warning residents to monitor hurricane Michael which is likely to move through the states after coming ashore\n[noise] the death toll from an earthquake and tsunami in central Indonesia has topped two thousand as NPR's Lauren Frayer reports from ... near the epicenter the government is ending the search for more bodies and ordering foreign aid agencies outs\nCharities have been ordered to leave the quake zone immediately from now on they'll only be allowed to distribute aid to local partners there's been a rash of foreign aid here and some groups have complained of having to get government ...\nStreaming of New England public radio is funded by un Franklin Community co-op offering organic produce baked goods groceries and prepared foods in Greenfield an Schober involves community grown and community own since Nineteen Seventy seven\nShe'll distress they have enough relief supplies within the country\nMeanwhile there is a rush to recover bodies before Thursday after which the government says up to five thousand missing people will be presumed dead prayers will be held in three piling neighborhoods emerged in mud which will be declared national memorials Lauren Frayer NPR News ... Indonesia\nOn Wall street stock indexes have been mixed in early trading as markets continue to absorb the shake out from last week's rapid rise in interest rates currently the Dow is up thirty points the S. and pay five hundred gained seven and ... it up\nForty four this is NPR News\nIn for a New England public radio news and carry Healy with just four weeks remaining before the election the two candidates for Massachusetts Governor meat head to head tonight in a televised debate WB wires Steve Browne has a preview\nThis'll be the first time incumbent Charlie Baker and democratic challenger Jay Gonzalez base each other since they each one of their respective primaries last month\nYou can expect both candidates continue their campaign strategies Baker will keep touting his record as governor over the past four years taking credit for closing a huge state budget gap and holding off imposing any broad new taxes\n... as expected to focus on bakers record saying the governor hasn't done enough to fix the MBTA restore confidence in the Massachusetts state police following in overtime pay scandal that has dogged the agency in recent years for New England public radio I'm Steve Brown in Boston\nNew Hampshire it's getting to point seven five million dollars over five years for programs aimed at helping young families at risk for child abuse and neglect\nThe department of health and Human Services said Monday it will use the federal money to help families with children under age nine get community based services such as mental health and substance misuse treatment home visits and educational programs\nLast night ... made major league playoff history well helping\nThe Boston Red Sox and blow out the Yankees and take it to one lead and the American league division series the red Sox infielder became the first player to hit first cycle and the post season game\nThe red Sox top the Yankees sixteen to one tonight they trying to wrap up the series first pitch just after eight this is the NPR News network it's twelve o five\nSupport for NPR comes from NPR stations other contributors include the law firm Cooley El Al pay with offices and the U.S Europe and China Cooley advises entrepreneur as investors financial institutions and established companies around the world where innovation made the law\nThat says the and a PR news network today's forecast mostly cloudy skies was clearing the Berkshires highs of the seventies\nSo mostly crowded with ... and the low sixties for Wednesday partly sunny and warm hearts of the low seventies to around\nEighty\nThe any PR news network is funded by you in the town of Deerfield, Massachusetts and historic place to grow since sixteen Seventy three and hosting information about the town's passed on President at Deerfield M. A. dot us from NPR\nAnd W. B. U. R. I'm ... I'm Peter O'Dowd this this year and now big news today at the White House Nikki Haley and now she is resigning as ambassador to the United nations at the end of the year she and President Trump made the announcement in the oval office thinking\nTo the United nations has been very special to me she's done an incredible job she is a fantastic person very importantly that also is somebody that gets it\nNPR's Scott Horsley joins us now it's got this felt like something of a surprise to quite a few people would've Haley say about why she was ...\nI think it surprised a lot of people both ah here in the U. S. and in the international community she didn't really offer an explanation for the timing except to say she she needs a break after six years of South Carolina governor and the last nearly two as UN ambassador or she is going to stay on 'til the end of the year\nStreaming of New England public radio is funded by you and valleys solar local ... design at installation helping household secure state or federal incentives and live carbon free and the four one three valleys solar dot solar\nTuesday Morning is a is a little little interesting\nI'm thinking back to the twenty sixteen election campaign Haley was a very vocal critic of the president's they've also disagree to time since she's joined his can over the past two years but if you read their body language today in the oval office listen to what they were saying um they were very cordial how's that relationship of all over the\nPast couple of years she has been a loyal soldier in the Trump Administration and in this case loyalty might sometimes mean telling the president things he doesn't want to hear areas where she disagrees with him\nWhen that anonymous op ed came out in the New York times the number of weeks ago from a administrative insider Haley was critical of that approach and said when she has a criticism she takes it directly to the president she doesn't necessarily air it out in public\nAnd that idea of keeping dirty laundry in the background extends to their their photo off in the oval office today\nLet's here's more from this morning Haley talking about some of the Trump administration's accomplishments\nWon't get one for the United states on foreign policy now\nThe United states different factories may\nI said\nIf we were going to do something we found that whether it was it the chemical weapons and whether we sang country have to pay their share Scott\nIncrease to prison sentences for repeat offenders and there were no disruptions in the courtroom and you're listening to him and now in\n\n\nThe any PR news network is funded by you and blue heron restaurant and catering located in a historic town hall in Sunderland now bookings seasonal holiday parties blue heron dining dot com slash catering\nAnd buys snap dragon engineering and East Hampton specializing in the design machining on fabrication of all medals for art science and industry snap dragon engineering dot com\n[noise] I'm Jonathan Capehart politics is your favorite reality show or if you're just trying to keep up with the forensic pace of the mid term elections we've got you covered joined me every Monday through Thursday for America on the line alive using college show\nWill have the latest political news analysis and your calls on the issues that will matter most to you when you cast your ballot\nAmerica on the line a national conversation\nThis evening it eight on the any PR news network and on line at any P. R. dot net\n\nFunding for here and now comes from the listeners of W. B. U. R. Boston and your NPR station and Geico offering motorcycle into RV insurance more information available on motorcycle an RV insurance\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit from an ... with a farm standard for sixteen bay road open six days a week through Thanksgiving small ones farm dot com\nBusiness here and now the twenty twenty cents is is at the center of a legal battle the Trump Administration wants to include a question on his about whether the resident answering the census is a U.S citizen opponents say that's unconstitutional and they won commerce secretary Wilbur Ross to answer questions about it under oath\nInternal documents show the secretary Ross pushed for that question even though he told Congress that the Justice Department had asked for it the White House wants to stop Ross from having to testify today a panel of judges reviewing that request NPR national correspondent ... long is following this story he joins us now Hansi\nHi Lisa you have to rent the thousands of government documents about this what did you learn from them about how the citizenship question came up out in the first place\n[noise] all these documents were part release in part as part of the lawsuits over the citizenship question and I really key document is an internal memo written by\nCommerce secretary Wilbur Ross who as commerce secretary oversees the Census Bureau and the twenty twenty cents is\nAnd it didn't he says that he initially thought about adding a citizenship question to twenty twenty cents is as soon as shortly after he became ... the Senate confirmed him as the commerce secretary so this would be late February of twenty Seventeen\nAnd then a over those months he\nWorked with his staff at the commerce secretary to find a way to get this question a citizenship question on to the census and this is a question that asks is this person a citizen of the United states\nIt's a topic that the Census Bureau has not asked all us households since the Nineteen fifty cents is although there have been a there's been a citizenship question on a smaller Census Bureau survey that's now known as the American Community Survey\nWhat reasons then does the administration give for why it doesn't want secretary Ross to testify about it at least what the thing about its reasons\n[noise] well the Justice Department or which is representing a commerce secretary Wilbur Ross and the Trump Administration these lawsuits their attorneys are saying that the judges should\nDecide these lawsuits based on the documents these internal documents that they're released as part of the lawsuits\nAnd not on depositions questioning of Wilbur Ross ah and trying to get into his intent is mindset but that's exactly what the plaintiffs in these lawsuits and you know dozens of states cities and other groups that want this question removed\nThey say they really want to better understand exactly why commerce secretary Wilbur Ross went to add this question because the Trump Administration has said\nThey wanted to add to because of the voting rights act and he wanted responses from a citizenship question to better and for section to the voting rights act which has protections against discrimination of racial\nAnd let language minorities are essentially took her to make sure that those groups have the right to vote 'em that the federal government has relied on other\nAnother kind of citizenship data from the American Community Survey of 'em and uh the tradition says that data is not enough that it is not accurate enough\nUm and it needs it on the descending on the twenty twenty census\nPlaintiffs are very skeptical of that and they're concerned that there are other other motives here involved or one of the internal memos or one of the emails released as part of the lawsuits include\nA communication between a Kris Kobach the current Republican gubernatorial candidate as well as a former vice chair of President Trump's now defunct\nCommission on voter fraud he wrote to Wilbur Ross are trying to lobby Wilbur Ross to add a citizenship question and his concern was that undocumented unauthorized immigrants are counted in census numbers used to divide up\nThe congressional seats are among the states after the census\nOr all of this comes at a really pivotal time for the Census Bureau itself or the Senate has not yet confirmed President Trump's new appointee to lead the agency\nOr the Twenty one twenty census is going to be the first to be conducted in part on line so with all of that going on how prepared is the Census Bureau for what is a massive undertaking\nStreaming of New England public radio is funded by you and they passed university graduate schools and as a creative non fiction writer enrolling no for August twenty seventh applications at bay past dot edu\nOr questioned that Wilbur Ross added will stay or will it go and where you probably won't find out until a few months\nAnd that's really pushing up against a deadline that the Census Bureau is facing of what exactly prints on the forms are this will be the first online centers but people will play important part for live households and may not be comfortable or don't have access to Internet and so they will be paper and so this is a really big question right now that hopefully the lawsuits will resolve\nA from the Census Bureau perspective another big question will they the sense of being able to hire enough workers to collective uh information from households around the country\nOkay thank you NPR national correspondent ... thanks a lot You're welcome\nThe anonymous British graffiti artist Banksy made headlines over the weekend by reading his own artwork to self destruct\nHis painting of a little girl letting go of a heart shaped balloon begin to shreds itself just after it was sold for nearly one point four million dollars it's southern ... in London this latest stunt has the art world ... and many more people wondering once again who is Banksy\nSophia ... has been exploring that question for the sun in London I said\nHey [laughter] and first your thoughts when you saw that painting slide down the picture frame in shreds the option\nOh my goodness isn't a steamy hot stuffing maintenance and the first question was why is it happening and and the second was how how is it happening because obviously at the time they wanted me that that was shredded built into the brain\nYou can imagine the shock and horror and not just in that ... everyone's eyes are not painting that time\nAnd for some people listening that was their first introduction to Banksy so tell us what we know about him because he's a a a man we think who is famous for being mysterious\nHe's absolutely famous for being mysterious and his name is Scott ... of the U.S wells\nAnd he basically he's an enormous English artist he's a street in graffiti artists that he kind of gets name as a political artist as well and you kind of shade I put in the in the nineties and\nAnd he's black originally highlights did a lot of corruption and inequality and society but he did it in a very humorous way nowadays it's humid it's slightly less and you take the most serious pain in his walk and I just say he's never been on mosques that there are\nHundreds of theories as to who he could be and and we still they may cause a big theory that he was in the ... when the painting the shredded\nWow so let's talk about some of the theories then what do you know 'cause there are people who who think they've seen him at work do we want have been installations on a wall somewhere or enlarged but you know we don't know who he is so um what are some of the theories about about who this ... this mysterious artist might be\nThey have ranged from him being a painter and decorate T another graffiti artist named king ... and people say he Damian Hess people even say that\nYou know banks he may well be a woman and that's another theory that he's and not just one pass any is a collection as artists [noise] it's just because he's such a ... and I kind of made history the the theories range from what could potentially be the tree to something very outrageous and I think there was a\nBond that they said he was the man if the barns and because every time that bad and performed in his late ... pop and the guy had to come out and say and it's definitely not me I guess as a creative fighting in my ...\n... what do you think he was trying to say bye shredding not painting\nIn my opinion and I think he's trying to say that his wife is not for sale it's not the fast time his what has gone up for sale and and it's something that has been done without his consent\nThis time I had to see I I this is just my past and opinion on the opinion that set in ... that the painting and the shutting if the painting was away at him saying my\n... not for one pass in it for everybody and because it's painting it shut it off to the wedding and it was\nStreaming of New England public radio is one that brought you in Franklin Community co op offering organic produce baked goods groceries and prepared foods in Greenfield on children falls community grown and community own since Nineteen Seventy seven\nThis is the and a PR news network today's forecasts most cloudy skies was clearing the Berkshires highs of the seventies today mostly crowded with Lowes and the low sixties for Wednesday partly sunny and warm hearts of the low seventies around\nEighty\nSo unique PR news network is funded by you in New England meeting house designed kitchen and bass design on sales of cabinet tree counter tops windows and doors New England meeting house design dot com\n[noise]\n\nI'm term ... host urges all the mode I write to jazz blog any PR do that than I host or ... to go to any viewer does to them low jazz for you enjoy the great musicians worlds of jazz and blues jazz at any T. R. dot net [noise]\n\nFunding for here and now comes from W. B. U. R. Boston and carbon night offering secure data protection solutions for growing businesses including automatic back up for servers and computers higher veil ability and disaster recovery solutions and automated data migration learn more at ... dot com\nAnd Geico offering car insurance as well as services for homeowners and renters insurance through the Geico insurance agency\nAdditional information can be found at Geico dot com or one eight hundred nine four seven\nAuto\nIt's here and now in Afghanistan today a suicide bomber killed a candidate running in this month's parliamentary election it's the latest in a series of attacks that have been carried out by the Taliban or ISIS fighters in the country this here\nThis week mark Seventeen years since the U.S launched the war in Afghanistan less than a month after the nine eleven attacks President George W. Bush announced the invasion on October seventh two thousand one\nOn my orders in the United states military has begun strikes against al ... terrorist training camps and military installations of the Taliban regime in Afghanistan\nFace carefully targeted actions are designed to disrupt the use of Afghanistan as a terrorist base of operations and to attack the military capability of the Taliban regime\nFighters were quickly toppled in two thousand one but today they're resurgent ...\nStreaming of New England public radio was funded by you it'll all energy solar helping homes businesses on farms in western New England save money and the environment with solar power all energy solar dot com this attack today\nIt happens in the south and and ... the city of Helmand Province where a candidates was ah addressing his opposes inside his campaign office when an attack cats\nOn foot broke into his office on detonated has explosives\nInside the crowds that gathered around this candidate killings the candidates are Saudi ... one of the youngest candidates food is a elections as well as seven also has\nA supportive and at least engineering another twelve\nHas there been a claim of responsibility as yet\nNot yet that's both the Taliban and the army's affiliate groups in Afghanistan have a a body parts of the the ... October ... elections however last week a similar\nAttack happened in ... on a campaign gathering killing at least ... people and wounding over with the tea and that is so that was claimed by the un ice affiliates\nGroups wouldn't buy the ice affiliate groups who we are talking here about both the Taliban and affiliates as of ISIS the Islamic state group yeah correct yes that's correct and and he does the Taliban want to govern Afghanistan again or does it simply want chaos\nThey want to show that this does that\nAnd whenever and wherever where they want to undermine the before the credibility of of on the security forces so they do these kinds of attacks\nUh although they do not say that they want to really take off on his phone and bring back their Islamic Emirates\nHowever they say this is a US puppets regime backed by the Americans and they will be fighting to show they exist on they can make headlines\nThey make headlines do they make games within the country how much of a tennis is controlled by the Taliban\nThey only control out around Fifteen one five districts of\nNearly four hundred districts on on the stump however they have prisons and nearly Seventy seven zero percent of African territory that means they can testing that they have good\nActive presidents on law if a is on the threat at various levels depending two locations across the country due to tolerate an open an active presence\nThere are right now ten thousand American troops that are on the ground in Afghanistan one of them was killed in Helmand Province as you know last week\nUm letting but Afghan security forces are doing the brunt of the fighting the mission of the American troops is supposedly a non combat mission could you tell us what they're doing\nThat they say they have to ... to uh to train and that's fine it's up on security forces and that is true I uh right now in the driving seats in the front line it's awful and security forces or\nIn fact very few sleeve fighting the Taliban but that\nComes to very high cost the number of casualties of hop on security forces is very very high two weeks ago I've one minister of defense themselves that at least five hundred security forces were killed on the in one month\nOn their worries that eats is an army almost bleeding to death yes they are fighting but how long they can continue fighting but this number of casualties so\nBring the United states to it\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit farm in Amherst with a farm standards for sixteen Bayh road open six days a week through Thanksgiving small ones farm dot com\nBolster the Afghan security forces another training them um I Know they're doing air strikes what what kind of force just the U. S. spring to what's happening there\nOn the ground that there to advise on support on security forces so you would not see American Soldiers fighting thoughts these security forces are highly dependent to\nAsk supports an ad about men on since two thousand and fourteen since secure American forces have less stuff on ... and a lot of them\nThey have increased have tripled or quadrupled the number of drones on just how many tests on this kind of honest on so that ... is the important elements on and boosting up one security forces in front lines when they fighting the Taliban\nWhen I'm the first American bomb was dropped Seventeen years ago um I Know that you were sitting not too far in Kabul, Afghanistan from where you are right now could you describe the country then under Taliban control and describe the country now\nSeventeen years back the first American intervention that started the bomb which I wasn't very far from ... heads and as we speak now the bombings continues and we didn't expect Seventeen years back that we will have\nMany many years ahead of us with fighting going on or only ... thousand bombs were dropped in on the sun and it said that only in the last six months\nIt has tripled so it shows how she is kennel of violence and threaten insecurities that ordinary people living in rural areas all are suffering from\nSeventeen years back when the Taliban ruining promised on including capital column for the call you have to cobble people was living with some feel threats and intimidation of the ... they may not be goal is not allowed to school\nUh but what we didn't have then and we have now is it fear\nOf a former lives because of\nInsecurity they had the harsh rules not very far from where I'm speaking is that the sports stadium where people were executed\nA botched what they had managed to insure was security across the country people were not worry that if we leave with homes we would be either\nKilled by a ... an explosion or will be kidnapped or we will be shot at that fear is living with every single citizen in the five million a city of ... on across the country\nIt is the world [noise]\nListen this afternoon at three and this evening at seven on the PR news network for the world\nThe any PR news network is funded by you and ... of Manchester, Connecticut local sales and service offering complimentary pickup delivery at the veil about loners Schiller ... dot com\nStay tuned for the second hour if you are now this is the PR news network WINZ am six forty Westfield WINZ FM Ninety One seven Deerfield\nWFCR eighty eight five HD three Amherst W and then you have you know in five great Barrington W and a nine Ninety nine Adams WAMC Ninety One nine Springfield and W. A. M. H. eighty nine three Amherst\nIn partnership with Amherst College and UMass Amherst streaming an on demand at any P. R. dot net it's one o'clock\nFor twenty four seven news stay with the PR news network that I Am six forty at Ninety One seven in Franklin County and on line at NPR dot net\n\nFunding for here and now comes from that word graders of that law to simulate software accelerating the pace of engineering and science you learn more and I imagine we're not come from NPR in ... I'm Peter O'Dowd\nIt's here in coming up mandatory evacuations were ordered across in northwest Florida in the head of hurricane Michael most of the Nobel laureate William ... says a carbon tax will curb the impact of climate change without damaging the economy\nThey may be radical ideas but they will lead to a lifestyle new radically who they were in a moment to help\nUs and the largest migrant camp in Greece is on the island of Lesbos life is hard for the migrants living there but also for the people trying to help them as a cascade of care that has to occur if people are going to take care of refugees to take care of themselves first these stories coming up here and now [noise]\n\nThe news is first\nLive from NPR News in Washington I'm Laurie London UN ambassador Nikki Haley is planning to leave the Trump Administration NPR's Windsor Johnston reports in a surprise decision Haley announced chill resigned by the end of the year\nSpeaking alongside President Trump that the White House Hayley said it's been in honor of a lifetime and blessing to serve in the position\nI in fact a lot of the girls have been able to leave the state that race and the and the center of our country I Love\nMuch Haley as strong defender of the administration's foreign policy agenda is receding said the dance outgoing praise from Trump\nShe's done a fantastic job but we've done a fantastic job together we've solved a lot of problems or one of the process of solving a lot of problems\nTrump isn't ruling out the possibility of Haley serving in another capacity he's expected to nominate her successor within the next several weeks winter Johnston NPR News Washington\nAs hurricane Michael approaches the Florida Gulf Coast governor Rick Scott is urging residents to take this one seriously\nDon't take a chat hundred and twenty mile an hour winds are going to have twelve inches of rain in some places but twelve feet potentially a storm surge do not take a chance\nHe says the impact will start to be felt as soon as tomorrow so residents really need to prepare now it's a massive storm that could bring total devastation to the state especially the panhandle hurricane Michael is forecast to be the most destructive storm to hit the Florida Panhandle in decades the storm will be life threatening\nAn extremely dangerous Michael is expected to make landfall as a category three storm with the potential for twelve foot storm surge from Tampa all the way to Pensacola journalists are protesting across\nStreaming of New England public radio was funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nThursday ahead deed reports from Islam about the protests come after a prominent columnist was forced to appear in court on charges of treason\nJournalists gathered outside the bad press club protests\nFellow growing concerns that journalists are engaging in self censorship because they or their media outlets have received threats to kind of reporting critical of Pakistan's security forces\nMost recently a lawyer demanded it investigation against a prominent Pakistani columnist he's seeking to having child she was edition activists say the case of sending a message to other reporters to behave the date NPR News Islamabad\nMeanwhile turkey is welcoming Saudi Arabia's decision to allow authorities to inspect the Saudi constantly and in in Istanbul as part of an investigation into the disappearance of Washington Post contributor to mount a shell game Turkish officials believe the show he was killed inside the consulate\nAnd had his body was later taken away Saudi officials adamantly denies this is NPR\nDeath row inmate in Tennessee says he'd rather die in an electric chair than the state's current method of lethal injection from member station WBUR ... an Blake Farmer reports that convicted murderer is scheduled to die Thursday night\nWithin hours of the Tennessee Supreme Court upholding the state's three drug method of lethal injection attorneys for Edmunds ... say they notified prison officials of his preference to die by electrocution\nThey call it the lesser of two evils describing the existing lethal injection process as tend to Eighteen minutes of drowning suffocation in chemical burning\nTennessee death row inmates have been unsuccessful enforcing mistake to adopt the one drug methods that they argue would be less painful\nIn the last Fifteen Years Virginia and South Carolina have also used electrocution as the backup to lethal injection Tennessee last electrocuted a prisoner in two thousand seven and afterward his attorney called the practice barbaric and said it should never be used again for NPR News I'm Blake Farmer in Nashville\nAdvocates of taxing fossil fuels are feeling emboldened by a dire un warning about the urgency of combating climate change and a Nobel Prize awarded to American economists to argue carbon taxes or the best way to address problems created by global warming\nCarbon taxes are designed to make users of fossil fuels such as coal oil and natural gas pay for the environmental damage they cause neither the warning\nNor the economists research is likely to break down the political resistance from Congress and the White House I'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million mostly users designed to connect people from anywhere in the world on any device learn more I'd go to meeting dot com\nVersus the and a PR news network today's forecast mostly cloudy skies with clearing the Berkshires highs of the seventies today mostly crowded with ... and the low sixties for Wednesday partly sunny and warm heart of the low seventies around\nEighty\nThe any PR news network is funded by you and by WFCR as partners Amherst Hampshire Mount Holyoke Smith colleges and the University of Massachusetts Amherst\n\nFrom NPR and W. B. U. R. I'm ... I'm Peter O'Dowd this is here and now\nPeople living along the Florida Panhandle are rushing to prepare today for hurricane Michael the storm is expected to make landfall tomorrow as a major hurricane with wind speeds of at least one hundred and ten miles per hour Jeff Hoffman is director and chief meteorologist of the Florida public radio emergency network\nHe's in Gainesville, Florida a hijab it's good to have you back again today\nOh good afternoon Peter I wish it was better circumstances that we're talking but good afternoon and\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit from in Amherst with a farm standard for sixteen bay road open six days a week through Thanksgiving small ones farm dot com\nThing this you know when we talk about hurricanes and we've talked a lot about several in the last two or three years\nAh we always prepare for what could be the reasonable worst case scenario this one more than Florence I think a potentially it could be a worst case scenario or it could achieve that status for some locations in the panhandle of Florida I say that with the the most\nA straightforward tone and my voice as possible uh this hurricane is continuing to strengthen ... could have winds of one hundred twenty five miles per hour at landfall near Panama City or just to the east\nAnd now we're talking about potentially a catastrophic storm surge event and some of the coastline that's the most vulnerable in Florida a to a storm surge stretching all the way through Appalachia ... the big band and all the way over to the nature coast\nA close to cedar key So Peter I Can't stress enough you know Harvey was an extreme event for in terms of its rain Florence was also an extreme event in terms of its rain this one has the potential to also be an extreme event for wind as it comes to shore tomorrow\nLet's talk about that storm surge you mentioned the geography of Florida and the Florida Panhandle they're local call it the Big Bend area what is the geography have to do with how bad that storm surge could be\nWell two things are really working against a are working to enhance the surge in that area but get shallow shelf waters so think of a\nA bath tub being pretty deep it's pretty hard to to you know splash water out of a bath tub because it's so deep but didn't think of a you know something that's a little more shallow or the water can easily move out of it and the winds are going to push and drive that water\nOr miles inland in some areas and then also the ... of the coastline\nKind of access to funnel to funnel that water especially up near uh the Big Bend region or so when you take that even if the store and ... maybe moved further to the west I spoke earlier just a few minutes ago actually the national Hurricane Center specialists there\n\n\nDo you any PR news network is funded by you and the common school in Amherst hosting their annual children's carnival on Saturday from town until two details that common school dot org\nAnd ... Fitch architecture and community design offering architectural services with an emphasis on sustainable design for institutions that homeowners as a CD architects dot com\n[noise] you know you can't listen to the radio all the time that's where the N. E. T. R. news now podcast comes after beating my head against the wall and asking why so many times I realized that this entire piece is meant to get at\nTime you know it was a very Americanized version Nigerian but Nigeria is very meaningful any PR news now the radio deliberate you phone computer whatever check it out wherever you get\nStreaming of New England public radio is funded by you other western mass coaching alliance offering personal and professional gross through its member coaches coaches profiles available at western mass coaches dot com\n\nFunding for here and now comes from the listeners or W. B. U. R. Boston and exact science is offering Colo guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information that coal to guard test dot com\n\nDoes this year and now a work of fiction that went from the stage to the page is in bookstores today Rob and young explains\nHere I've been out\nFirst it was a musical deer Evan hand since the story of a socially awkward will be going high school seniors who gets caught in a sense that spiraled out of control about being the best friend of a classmate he actually hardly knew\nWho takes his life and before you know it our dear Evan Hansen is leading a national movement against suicide\nIt was a huge hit when it debuted on Broadway twenty six [noise]\nAnd then all\nOf them [noise]\n[noise]\nHere haven't Hansen one sixth Tony Awards including best he civil so besides the national tour what could its creators bend you pass it can just in palm music and lyrics and book author Steven Levinson do for an encore\nHow about a young adult novel which captivated this adult as well author that ... wrote the new deer Evan Hansen book with input from the show's creators and all for joining us from the NPR studios in New York down and the key there yes R. M. K. bench plastic\nWe are all here yes yes Justin Paul hello there even lettuce and hello\nBench I understand that this is all based on something that happened in your high school\nIs not directly based on something that happened in my high school but there was a student who I didn't know particularly well and she passed away and everyone in the school community\nAfter his death really began to sort of claim that they were closer with him than they actually were a myself included and I was sort of struck by this and when I met Justin in college we began to talk about how similar phenomenon like\nGenerations response to nine eleven we knew a lot of people who would insert themselves in this tragedy or pretend that they knew people that passed away and they might not have um and we were so captivated and curious by why our generation in particular feels the need to kind of\nPublicly mourn and be a part of community by any means necessary and we wanted to explore that\nFurther well but in this case evidence in a he's a kid that just\nGets it every day trying to have a better day in fact he's in therapy and part of his um assignment in therapy has been to write a letter to himself deer Evan Hansen you know kind of telling themselves about how he's going to have a good day and what happens is that this young man Connor also a troubled classmate but he presented kind of a bully he\nFinds one of the letters takes it home after he killed himself his parents\nThink that it's a letter he's written to Evan Hansen your editor Hanson and so he's they think their best friends and for enhancing kind of gets caught in this said that spirals out of control and also kind of changes him Stevenson\nThis idea that he suddenly finding respect from people and an entree into school life because there's this fall's idea about him that's very compelling\nYeah well I think he makes that decision ultimately to just kind of keep going with this story because everything he's always wanted comes true but it's also about the people around him are ... by the story as well I um he feels as though he's giving something to them\nThe young man's family they want to embrace this ... you know best friend of their son who of course isn't I mean it's just heartbreaking\nStreaming of New England public radio is funded by you and they passed the university graduate schools MS and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nAnd when she finds out evidence been taken in by Congress family because she can't give him a lot of things you\n[noise]\n\nHow you were able to just feeling the news on\nWhat's it like now there's a ... novel you have music to get across these characters\nYou know it's true that we talked about at the beginning of the process with vowels which was you know how do you take the would become a sort of temple moments in the musical how do you take that in translated into a book\nIt is an interesting process of how do you get inside a character's head in the same way that a song does and that's why I think it does work so well as as a novel because the book\nUs to get inside these characters heads to really feel that they're feeling in the way to the song does so I think it does translate well and\nUh and same token we also felt like we wanted this to be a different experience from the musical and so we weren't slaves ... every time there's a huge song moments we have to have a big moment in the book and we have to capture that huge thing because we want this to be its own experience and to live on its own\nNow really any a sweaty palms this is very special to people all these characters and especially ... really means something to young people name he can your hands\nI'm Glad I didn't speak to you before beginning the novel [laughter] yes lots of sort of hands still sort of hands in fact it was the sweaty hand line I'm In Evin first monologue in the show that I was like this is me I can write this\nBecause we should say and then also had sweaty hands\nThat's right he's trying to will his hands not to be sweaty by by even thinking about them being what do you\nEver becoming more sweaty I've been through that rabbit hole before where I felt like I knew how to do this or emotion I knew how to do it at the same time I did think it was sort of an unfair challenge given the popularity and the intensity with\nWith which people had attached themselves to have and and the other characters\nWell talk more about this notion that you're writing about suicide you I got I'm imagining be careful not to romanticize that's\nFor sure um suicide is something um that I have experience with let's just say I know um was the other guys have stories of their own so I was definitely sensitive to that fact\nBut we all wanted to know more about Connor the guy's definitely that was a a um a goal of theirs and the and the mission they gave me tell us more about Connor we have these ideas of him can you make these work\nOkay can I think I can make some of this work really it started with just finding his voice at one point they said like we we want to give Congress some happiness in the show we're only seeing just this small glimpse of Connor and it's torture it's there's a him taking his life\nI'm In the book we get to know more about life before that and part of his life he did he did he ever experienced joy I'm or was it all you know I'm darkness\nThey don't want to give anything away but I have to say we actually find out is ... and we find out this crushing thing that happened to him yeah some people may not want to know that\nYeah this is Steven yeah I think that's definitely a a tension that we felt in the creative process was how much do we want to know obviously you leave the show wanting to know more about counter but do you really want to know more about countered you want to imagine more about Connor and\nI think what we found in the book um especially with vowels treatment of it\nIs that we learn many reasons why Connor goes the way he does and Evan goes the way he does and it was important to us that it not feel mano causal I'm like there's this one thing that that um you know is the reason Connor is the way he is or ...\nStreaming of New England public radio was funded by you at all the energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com accessible in that\nIt also feels like a cautionary tale for our times\nOf what it's like to suddenly get swept up in media ... and his friends become a you know since ... interviewed by everyone across the country it's a cautionary tale you know what can happen when suddenly or you don't even know what you're doing it and you're on a national stage there's that\n\nThis is the and a PR news network today's forecast mostly cloudy skies was clearing the Berkshires highs of the seventies today mostly crowded with ... and the low sixties for Wednesday partly sunny and warm hearts of the low seventies around eighty\nThe PR news network is funded by you unpleasant journey used cars and north Hampton offering free owned vehicles with a twelve month twelve thousand mile warranty inventory a pleasant journey dot com\nI'm Margo word on on the world we get an outside perspective I was born in Yemen so many people we than most people in South Africa because getting outside yourself and to be a good thing\nOnce you move to a different country using them out and you were able to you we're in the other person coming from\nIt is the world [noise]\nListen this afternoon at three and this evening at seven on the NPR News network for the world\n\nFunding for here and now comes from WVU are Boston and from fracture creating frame lists photo decor and gifts by printing digital photos directly on glass a fracture is image and mountain one available in a selection of ready to display sizes\nLearn more at fracture me dot com slash here and now and college fine where\nConsultants work with high school students to identifying achieved their goals in high school complete the college admissions process and negotiate merit scholarship awards more at college fine dot com\n\nHere and now the flood of refugees and migrants to Europe continues within eighty four thousand men women and children mostly from Syria Iraq and Africa\nHave arrived in Spain Italy and Greece this year every day more than one hundred people arrive on the Greek island of Lesbos the first places they see are those of humanitarian aid workers to help them reach the shore yeah clothing and food and health care and temporary shelter aid workers the trauma up close\nStraining of New England public radio is funded by you and the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com\nIn exhaustion and even pi TST that can last for years now the George Washington university global mental health program is drawn up a version of the Hippocratic Oath to address the problem\nThe ancient originated increase it calls for new physicians to swear to abide by ethical standards Philip can deal is is one of the doctor he's behind this new version\nIt's still the general principles of caring for patients first not doing mischief knowing one's limits keeping confidence is that continue to this day\n... professor of psychiatry and behavioral sciences at George Washington University School of medicine and health science he and his colleagues wrote the Hippocratic Oath for humanitarian workers based on what Nineteen agencies told them\nThe way we turned it to humanitarian ideals was by basing it on the resilience training that we were doing\nSo we were eager to that people take care of their team and take care of themselves recognizing that there's a cascade of care that has to occur if people are going to take care of refugees they have to take care of themselves first they have to take care of their teams\nThey have to make sure that they stay within their areas of expertise\nOne of our colleagues at George Washington tells the story of when she was working in Africa\nAnd as a psychiatrist she was asked to do a Syrian section on a pregnant refugees so the the temptation to go beyond one's expertise is really difficult uh in in desperate\nAs you're saying that in this Hippocratic Oath you're able to give her permission to have I Can't\nRight that's exactly right so defining the limits of one's expertise what one can do safely without the resources that one needs is one of the key principles of this work\nDo you think this is something that actually the humanitarian aid workers will really refer to or is it just kind of nice to have the guideline there\nIt's a it's a great point the our hope is that it can be kind of a unifying project for the folks that we work with uh we've had a translated into Greek already were making a gift of it to the groups that we're going back to work with a next month so we're hoping it'll have some traction\nOne of the things that you and your colleagues have noted is the potential culture clash as Muslim refugees and they are mostly Muslim enter a Christian region like the shores if Greece up pretty high margin is quite community\nHow has that caused problems and how are you dealing with that\nWe've been impressed that the people who work with the refugees have their own immigrant stories so there's a shared experience a shared humanity\nThat even those who are more western or European generate that they show when they're working with folks from North Africa I'm a Middle East\nSo we learned that many of them\nHad grandparents great grandparents who were part of the genocidal exchange with populations in the Nineteen twenties in the ah follows me or not they were refugees from Asia Minor\nEveryone seemed to have an immigrant story they had married someone from outside Greece these ... workers you talking about that's right that's right so there was a sense that we're all immigrants in one sense and therefore this kind of work takes on a a shared a humanitarian motivation\nJust have one more question um I have known for quite some time and I know you're as you said Greek American and you go to Greece quite often because of the refugee crisis\nBut I Wonder what it was like for you to be in one of the cradle of modern medicine implementing a very different kind of hypocritical for a very different reason from what the original one was drawn up for me personally what is this like for you\nIt's an opportunity to take the expertise that I've\nStreaming of New England public radio is funded by you and small ones from a certified naturally grown fruit farm in Amherst offering berries pairs and pies that their farms down small ones farm dot com\n[noise] you know my family's migration in the Nineteen fifties so my family left Greece after or during the civil unrest there after World War two to be able to go back\nAnd offer what our cat we were just there in September [noise]\nTalking to folks in so long ago and uh from above the work that we do and a recruiting help from the Greek psychiatric community so being able to collaborate in this way it's been both professionally I'm personally fulfilling Philip\nCan tell us thank you actually so That's Dr Phil ... who is part of the George Washington global mental health program that's drawn up the Hippocratic Oath for humanitarian aid workers\nBack to the U.S now and a story from the American west\nWalk through forests of that region and you're likely to see centuries old pine in Cedar trees that have had their bark peeled off in a special way as Kay UNC Israel and Michelle reports archaeologist don't know why ancient tribes peeled some of the bark away and they're running out of time to solve the mystery\nCassandra ten CEO since for tribes like the southern you southwest Colorado these ponderosa pines are housed important as cliff dwellings or picked a graph\n'cause we were we were in Italy where nomadic and we weren't like pillows and are are now all of these trees show that we were here\nAttention as a cultural representative for the southern you Indian tribe these special ponderosa pines are scattered across the Rocky Mountain region and they all have something in common a big chunk of bark missing from one side peeled away by people sometime in the last few hundred years\n... Israel\nAt places a footprint on the landscape\nAs people as a child\nThere are a bunch of them here on the edge of a meadow south of the San Juan mountains\n... right there\n... mark Mitchell walks up to in our old tree about as wide across as to people it's thick red bark is curling into reclaiming exposed area that looks a lot like a telephone pole\nWe're looking at a place where in the fast native peoples of a movie out or dark\nHe says they did it to get to a spongy white material inside called ...\nSome people describe it as little as stringent I think it tastes kind of coconut\nMitchell is a research director for a nonprofit archeology organization called the paleo cultural research group they teamed up with the forest service to study trees like this one volunteers start taking measurements sodas one person starts screwing a hollow kill and to the tree as thin as a drinking straw area\n\nThe sample will get a date for when the peel happened\nTo her but there are a lot of questions about these peeled trees yes there are a one of the biggest questions we have is what precisely was the purpose of the floor window it's edible\nBut he says where people eating it because it was a delicacy or because they were starving within medicine or part of a special occasion Julie Coleman wonders if these trees might reveal patterns about how tribes like the you were moving across the landscape she's an archaeologist with the San Juan national forest [noise]\nA GPS unit get quite pots and each tree and then hopefully we'll see a pattern and you might show trails in ways", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Westfield", "day": "09"}