{"month": "10", "state": "NY", "station": "WRUR", "content": "[noise]\n[noise]\nMay\n\n\n\nHave no matter how much it out right now you don't know what you might not even\n\nWhat you and that is now\nLame like me then they\nCome and bomb it up oh no\nNo we're not Birch Bayh even I Would do whatever money and I don't know\nAnd I don't know if they ever say that one mattered men\nAnd what do you need\nAnd I don't\nKnow not the mail\nI mean you have\nYou ever been caught up in Maine there\nBut in laying out doing some\nNear the um the\n[noise] you know the main way back\n\nWhen they return even back and remind\nIf you go well\nYou're not getting the ... men no matter\nWhat you know you're going oh he just\nThe way you know well\nI'm\nNot saying well you know\nWhat\nI meant when\nBut you're saying\nKnow\nNo just my own them in my late\n...\nWhen you\nKnow what makes a Jeff [noise] nah nah nah I didn't want to see the given all the bad [noise]\nNa\nNa na little\nAnd then you and then one day I didn't\nWant me to give it a\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nI Know when they leave\nI'm not\nWhat did he didn't know\nOf me right\n[laughter]\nThat amended before midnight drove to ... won by W are you are a problem and they the Rochester might be point one W. R. J. F. M. and ate the was it\nA dog ... on my way out the door at the end of another there's no like we want to be here and invite you back\nI'll be here next week at the same time it's like ... and ... were you what the next session of black though\nOh so\nThis is never supported public radio liberal is members supported public radio W. R. U. R. FM an HD Rochester you can also go public online at W. R. U. R. dot org\n\nFrom the concert hall to the joint from churches to festivals and welcome to another\nEpisode of Bild street here and then celebrating the sounds of Memphis and the Mississippi Delta for more than Twenty years heard around the globe on NPR worldwide major funding for history Caribbean is provided by the autism corporation in Memphis tours [noise] Hi\nI'm your count her out in the toilet and I'm Kevin other this week on the program we do to the first lady so handy said we'll hear a lot performance capture out Americana fashion and later in the program we get to sit down to catch up with Katie really nominated losing guy David to be with us delivered and stomach flus taller than an\nExploration of the lives of the pioneers an animator enshrined in the hall of fame right here in Memphis, Tennessee Rajiv audibly foundation that's all coming up right now on the street care of it [noise]\nHey pat hey Kevin I Am so excited that we get to feature Katie said on our show this the first lady of salt thirty albums to name for Grammy nominations and can be as a proud and duck the of the Christian music hall of fame for her brilliant work and the gospel genre everybody knows\nYoung hearts run free that's her big Denver which number one number so single charge in Nineteen Seventy six classic but candy story didn't start there no her vocal skills were recognized very very early on she received your first record deal as a teenager and she spent the formative years of her life touring the gospel circuit in the Nineteen fifties\nShe taught alongside such luminaries episode stirs Melia Jackson in Seattle frankly the all Franklin wants a minister here in Memphis, Tennessee is the legend in his own right many knowing better as the father of the greatest of all time to read the banquet candy began working with\nThe same producer Rick Hall down in Muscle Shoals in the sixties as yet Thirteen or and be as under his guidance including the Nineteen Seventy breakout hit a cover him he won it in by your man so like let that sink in for just a minute that really took major guts that time he wanted to send it to cut\nThat the salt and the one that will always be remembered for right\nRight so that's a real testament to recall creative genius and candies unique I mean the goal ability she knows how to connect with their list or she is the over the past couple of decades Kenya's recorded every once in a lamb chops Jason is\nShe's back now with a new studio effort aptly titled unstoppable it's a great collection of stone me the covers and the production really captures the spawning fingerprint\nBaby you know in the ...\n... ...\nAnd his mom ...\n... ...\nLittle longer in the end of the kids who\nEnd of the\nThe rubber worlds\n\nHungry new born and raised in the street as a grown man I'll look at\nThe end is how do\nWe do on the\nYou learn from the ... the learn how\nBuddy don't is bombs\nGathered around when they were young man made down in the dream with a gun and\nAsked her young man\nA cold and grace\nA little may reach\nAnd then mom raining\n[noise] thank you thank you I Love it they\nNot treated with\nBunch of Missouri the\nPage and they would be\nIn bad\nAbout the mom just apply the power [noise]\nTo come into your home\nTo prepare for him to\nOff your mortgage however Iraq\nSlid out an ice cube sheets world slide it over to the front table now singing her heart out\nAnd prove the ice cube at the laughing woman dinosaur world a gloved hand through the air and brought the number to close\nCovered by applause the pitfalls live there on stage yet copper colored hair slicked back and nightlife pale skin feedback in dining out of the spotlight and whisper it in her ... nice shot fry attack in someone who is married to the governor of California next time\nDiner a link at least ... back to the table she iced to apologize for all the pit Boston Dinah vow to the people see it at their\nDiamond looked at the woman I and said I thought for sure I had on the most expensive we gain here in\nThe governor's wife shot back you should see my ... diner replied you should see my white chauffeur who want you to sass the governor's wife the woman asked my donning diner said I Am the company\n[noise]\nMe\n... returned to the dressing room with her entourage scribbling from billboard magazine greeted her but that's not who Dinah was dying to see her one year old son was waiting for mama with his\nNanny Louis oh he's just about to walk Ella we said middle George stood on wildly legs holding a Louisiana I think he saw diner she knew down in her secret and gown and opened her arms wide she said come on be the\nLittle George release Ella wheezes bingo and granted Mm his ... little legs shook\nYou do know\nTo do um [noise]\nNeed for it to you know what ...\nThe young\nGive you\nAble\nMaking you know\nAt Pearl Harbor\nBig deal to buy a\nNo I'll be three you know how\nTo be a great and just do\nThe edge to them and\nThen by the bar thing or the da\nDi di\nDa de\nWith no nice\nMe the wrong but\nOh yeah\nI Would have been\nKnow\nWhat the law but\nHas the most well\nThink they're right there by your side\nOr the ...\n\nHour day when the\nWe know that\nJust up to the moon but\nWe do on your\nAny any\nWanted to be\nSome people don't even know what love me and [noise]\nYou never really been in\nWe get in relationships\nWe don't get in love you see\nThings\nIt's not there to receive it again you see if you hear what\nSomebody at all the Everytime you look around their own something\nAnd it's not real ma\nYou want to do things that you you know and making them happy\nRight over here tonight you can\nTell me she loved me she gave me the tonight to prove how much you really loaned me because I'm just thinking about you\nAnd I wanted to give these things you'd see\nNot mean you\n\nLove we\nDay through the hard drive\nTime to time\nAbout up tonight do you see the world many game\nGets only\n\nThere was a school them on ... avenue by the name of Joe macadam a I'm a Christian school and my sister in law", "year": "2018", "show_name": "Beale Street Caravan", "city": "Rochester", "day": "27"}