{"month": "10", "state": "AZ", "station": "KOFA", "content": "Elizabeth post auditorium which is located up four hundred west ... street in Yuma for more information you can reach us at night to wait three or four seven six nine zero\nBroadcasting from the campus of Arizona west in college this is border radio thirteenth twenty M. K. U. L. S. fake human and border radio easy dot org\nWe also broadcasts on the Arizona community radio network eighty nine point five FM McKay Jaycee a drink Williams Ninety One at ... Prescott Ninety point seven F. M. K. Jaycee taking in Ninety One point three of them Flagstaff\n... general manager at border radio I like to thank our guests DJ from the community who held during our recent pledge drive including Daniel core ... stop ... chocolate Perry junior Chris Wheeler my box built by\n\nEach member of the band at their own contribution to this collection of music by pianist McCoy tighter titled national rubber instruments did that that was between friends written by the master precautions to Jerry good with the ... the needle Gonzalez and bassist and she had ... ... s yet\nI'm John Hill welcome to another hour jacks\n[noise]\nMm [noise]\n\n... ...\n\n...\n... ... ... ...\n\n...\n... ...\n... ... [noise] [noise]\n\nThen it would have believed that they need they need to\nDo\n\n...\n\n...\n... ... [noise]\n\nMm\nMm\n\n\n[noise]\n\n... ...\n... and [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nYeah a lazy afternoon with dreams moody [laughter]\nLazy afternoon the name of the tune from movie\nCalled oh my gosh what's new marine either on Alto flute based food is was march Feldman on English corn Charles pillow and David hazel team at the piano\nWith bassist ... lotion ink and drummer Anthony ... CEO the\nWeird or too cold here my calls just ahead of that from Detroit bass guitarist Ron English\nHis album is called dance cry dance and that future ... ... on bass ... as if you know English horn player Paul on the chair\nAnd percussionist you well ... years and we kicked off the set with strawberry fields from an album titled coming home from pianist Justin Coughlin\nBasis to Chris Smith drummer Corey phone bill\nGuitarist Allen Parker Justin Coughlin most notably known by his appearance in a ward winning documentary keep on keep an eye on which was based on the mentorship in friendship of Justin and legendary trumpeter Clark Terry\nAward winning documentary keep on keep it on which was based on the mentorship and friendship Justin and legendary trumpeter court Terry\nJust in a was born with a rare degenerative eye disease and totally blocked by Gillette Ben started playing jazz professionally by\nAge Fifteen that is bound to write producer [laughter] group it was\nJust in Kaufman to start that said\nWe're listening to jazz I'm job he'll\nRun Flagstaff in Arizona Nordic village will be hosting their inaugural don't ponder Aspen five K. it'll be this Friday starting at six PM with post race games on a campfire starting at seven Fifteen this will be held up the Arizona in order to village eight miles past noble raid up highway one eighty\nThanks for listening to morning radio Thirteen twenty am a human we ought to broadcast on the Arizona community radio network in Prescott Kingman so accept and Williams\nMostly sunny today in Yuma highs reaching eighty eight degrees partly cloudy and evening but the Loeb around sixty six\nIn Kingman today there's a fifty percent chance of showers partly sunny hind you're Seventy three those chance of showers will continue into the evening with mostly cloudy skies and a low rent fifty five forty percent chance of showers throughout the day in Prescott with partly sunny skies hind you're sixty seven months equality in the evening with low around forty seven\nForty percent chance of showers in Flagstaff throughout the day mostly Claudia Hi near sixty mostly quiet in the evening with the low around forty\n... concert series we'll be presenting a performance by Scottish singer songwriter ... it'll be this Thursday evening at trinity Presbyterian Church which is located at six thirty Park Avenue in Prescott it'd be like more information you can contact us eight seven seven eight to five to nine to\n[noise]\n\nNot when you speak well Long Island some day we as a way to sue\nAnd when he comes\nHome and his wife was what\nWould you\nKnow the the long\n... [noise] my daughter to sue to\nSee\nA\nModerate Wednesday tomorrow with you as always two months [noise]\nSo that and still breathing\n... when they\nDid say everything has to choose to\nWait Don bidding lay low to me I mean to me\nI signed up for\nThat side\nYou're done with their mom died\nWill tell me when\n\n\n\n\n\n\nThe trumpet of John convert disease\nThe\nTrumpet of John Stewart [noise]\nDizzy Gillespie with tin tin deal from the album dizzy Gillespie and the United nations orchestra lie about\nThe royal festival hall\nIn London a star studded cast from both the Americans Cooper and where the Rico as well so ... ... and James movie along with trombone slide Hampton Steve tour a on base trombone or\nThe guest artist column jumpers Arturo son to wall and Claudia or beat the you Bonnie you don't go on Congress and percussion joining a year or two more euro\nAnd his wife Laura ... to ... the trucks here the cherry on guitar Ignacio better or was the drummer John me on base and then you know here is that the piano\nDizzy Gillespie and the United nations orchestra preceded by the Bob mentor big band along with the New York voices from the album meeting of minds we heard speak glow\nFeaturing Bob Sheppard on Alto sax and Jay ash beyond trombone\nWarren kidding of the voices adding some additional lyrics to speak low low there you go I'm John do you are listening to jazz\nJak I'm hoping [noise] jak among the not hate [noise] whether you know I was a big juicy usual jak I'm hoping that he\nJust saying you just have to move in a long time and\nJohn and John\nThe John and gum\n[noise]\n[noise]\nA\nMan\nDemand game day\n\nAnd [noise]\nShe said she didn't live long\n\n", "show_name": "Jazz with Dave Schwan", "year": "2018", "city": "Yuma", "day": "21"}