{"month": "10", "state": "MS", "station": "WMPN", "content": "Mm [noise]\nThis\n\n\n\n\n\n\n\n\nGearing up for Halloween this morning that was the Donald ... macabre by Camille since ... sitting arrangement there for a group the strings with piano ... is the name of the sample lead from the violin by how shall do though I must say I was like\n\nAt the globe is your home for the great American song\nEach week old showcase the best in local jazz in popular song Nineteen thirties do today from Frank Billy ... looks like Kurt Eli Dianne Reeves and Gregory Porter my mortgage eleven spent some time after glow Sundays had six months and be be music radio\n\n\nStations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. ... W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him Bebe on line or gee\n\nYou really have to stop and think that just before Erin Copeland wrote his three great bally's [noise]\nHe was experimenting with a twelve and eight tonality and all that kind of stuff\nNot that that wouldn't have been fine but I don't think he'd be a popular and famous as he was as he was when he discovered that isn't ... called Americana the Copeland voice [noise]\nAlso was inspired by some of the great choreographers of the day\nFor his ballets including Martha Graham and Agnes de mille\nAnd this ballet rodeo and Agnes de mille work kind of connected to Oklahoma and the dream ballet that you see in that show [noise]\n\nThis is the jubilee march from ... version of the sleeping beauty [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nWell no\nBoom\n\n\n\nBoom boom boom boom boom boom\n\n[noise]\n[noise]\n\nNo\nNo\n\n\n\n[laughter] no [laughter]\n[noise]\n[noise]\nWondering\n\n[laughter] [laughter]\n\n\n\n[noise] can Jennifer ... is an ass handles music was tough on music led by gene Lamont\nWell here's something entirely different as John Cleese might say now for something completely different\nThere was one time in Chicago when I was there in college a little ... little piano bar a guy named buddy Charles would\nHold court really really wonderful man he was he could play all kinds of piano but his favorite\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n", "show_name": "Season Pass", "year": "2018", "city": "Jackson", "day": "18"}