{"month": "10", "state": "ID", "station": "KRFA", "content": "At a lower rate fifty years she also hit hard what now or go to issue Republicans the confirmation battle of justice Brett Kavanaugh did he get treated badly and unfairly or\nRecent polling has shown that a big enthusiasm advantage of that\nAre more energized those Republicans\nThan ever I think every\nWas in Ohio's first congressional district home of longtime GOP congressman\nSteve shop but this is a district Trump carried by seven points Shabba Doo one two years ago by Eighteen normally it would be states GOP but\nPolls show democratic challenger Aftab Pureval out running a closer than expected re\nAnd congressman job it was slow to get behind Trump as a presidential candidate in twenty sixteen is now accepting the president's help even if it's not clear if it will help him or her to shop and took the stage thirty minutes into Trump's rally friday\nBut his\nParents was breed ... were barely a minute he made no direct pitch for votes instead leaving that to the president\nAround the district there was excitement about Trump's presents forty one year old Consuelo green works as a secretary for a local business\nShe supports Trump and says her vote next month will be cast in response to what she says was the Democrats appalling treatment of judge Kaplan I Would think that was the driving factor\nGratz for local office I normally not a Republican or Democrat\nI'm the only Republican town outside\nMoney has been pouring into the district the superPAC backing House Republicans have spent more than two million dollars renting attack ads and phone banking and knocking on doors still in the most recent quarter available Democrat Aftab Pureval\nSignificantly outrage Shabba he's getting help from high profile surrogates like Congressman John Lewis a veteran of civil rights struggles who spoke at a black church in Cincinnati yesterday\nYou know I gave all of blood for the right to vote almost died\nOn that bridge in Selma I'm not going to stand by and see the people take the votes ... we have to you\nEvery new\nIn the audience was in his case to as a pastor at another Cincinnati church on President Trump's visit peace at this\nI think it's always respect respect our president but Tate says he was troubled by the tone of the president's remarks broke my heart to see that he used his campaign strategy to further divide people I mean you're already in the office I don't think I'm too old\nIt will offer clues as to the president's ongoing strength when his name is not on the ballot in a place where he won easily less than two years ago Don Gonyea NPR News [noise]\n\nYou're listening to all things considered from NPR News\nFears has filed for bankruptcy the company which also owns Kmart hopes to keep the lights on through the holidays and reorganize its a new low for retailer that shaped the country's shopping culture NPR's Alina Selyukh has this look\nBack in the black and white photo that Gail read than to me she's about four years old it's Nineteen fifty five she's wearing a swing scourge with suspenders looking up shyly at Santa Claus at the hottest store in town here\nIt wasn't the store and we had feared pennies ... father John Daniel ... works for ... years for Twenty years\nStay in a strictly garments for all we had was down in that one here that were electronic centipede ease and clothing fabric and shoes and the department store\n... years was the reigning king of retail chain that grew out of a watch and jewelry catalog companies started in the nineteenth century it\nWas the shopping disrupt during the day it brought commerce to the doorstep of families living on farms and in remote communities paving the way for the mail order boom of the twentieth century and in a way the online shopping we know today here's an even credited with the idea of the department store parking lot\nIn the tradition at that point was street parking\nVicki Howard wrote a book on the rise of the American department store called from main street to mall\nBecause there's such a long lived from that their existence or paralleled a lot of different changes\nOver the centuries ears tried a lot of things it launched Kenmore Appliances craftsman tools all state insurance it bought stock broker dean Witter and real estate firm called will bankrupt it introduced the discover card but the most famous Sears creation was always the catalog\nAt the end of the summer we we get the giant Sears catalog and my mom would say go through and eat what you like and of course I Would start\nYears were very exciting\nI felt like we had just stopped on Madison Avenue [laughter] at that like a million bucks\nAround that time in the eighties ears wasn't known as the one stop shop for everything from stock to lawn mowers but then came the generation of the big box stores Walmart overtook the years is the largest retailer in the country Home Depot became the dominant place to shop for home improvement and appliances\nBad headlines kept coming for ...\nYears Roebuck and compromise announced ... showing off most of the financial ... try to build during the Nineteen eighties\nFears managers are selling the towers here's robot come company is going to shut down it's almost a century old catalog operation\nThe catalog was the dinosaur in the era of Amazon ears was actually one of the early stores to create a Web site but it didn't do well in two thousand four years was of all things bought by k-mart which had just survived it's owned bankruptcy\nAnd since then in a slow downward spiral ears became a showcase of the decline of the American mall\nI don't really think that there's too much they could have been done to believe that the current state it's been a long time coming\nCEO hedge fund manager Eddie Lambert has bailed out the or the few times with\nThe craftsman Brandt the company has not turned a profit since two thousand ten Gail read whose father worked for years in Texas in the fifties and sixties so she said that the company that she her childhood is dying but she also said she'd stopped shopping there herself about ten years ago I mean I tell you and\nYou're listening to all things considered from NPR\nNews mild weather this week with sunny clear skies through the next few days on the loose and in the loose clerk valley chili overnight lose mean morning frost is possible tonight pillows will be in the twenties and low thirties\nTomorrow will be another sunny day with slightly warmer temperatures hides in the sixties and a light breeze\nThere's always a lot going on at N. W. P. B. get the skinny and our monthly e newsletter you'll find out about upcoming programs and what's happening behind the scenes at northwest public broadcasting\nSign up for your free copy at N. W. P. B. dot org look for the link to sign up for our monthly newsletter [noise]\nThis is bill McLaughlin where you're joined us we're going to be something\nYou know if you think that just gives us a little familiar [noise] this is actually the\nTo join us we were born [noise]\nListen to exploring music with them a glock when it's coming up in just a few minutes at seven o'clock here on northwest Public Broadcasting's NPR and classical music service\nBut in the meantime you want to stay right here there's more from all things considered ahead if you'd like to see a complete schedule of our programs come to an W. P. B. dot org they're under three you\nTap\nThese\nDays you know that there are tons of places you could choose to get your news and entertainment things so much for choosing northwest public broadcasting where you can always find trustworthy journalism from reliable sources\n[noise]\n\nWell\nWell [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\nLooking to do that then\nThe ...\n\nThey had the Calif that read quintet with an arrangement of the variations on ... the Follies the St ... music by our ...\nArranged by one of the members of that Dutch Halifax read quintet yeah northwest public broadcasting and W. P. B. dot org I'm actually Jodie thanks so much for listening this afternoon and for your generation and loyal support music and programs on the station [noise]\nNow there's an important election coming up and I'm not talking about the mid term it's a great American read one hundred famous book titles and you're supposed to be your favorite yes you can vote more than one at N. W. P. B.\nTitles on the lead to one hundred best left books within Thursday beginning at nine AM were music in by by the great American beach you're on an W. P. B. S. cast your vote and W. P. B. dot org slash G. A. R.\n[noise] [noise]\n\nMm\n\n\n[noise] [noise]\n[noise]", "year": "2018", "show_name": "Marketplace", "city": "Moscow", "day": "16"}