{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise] [noise]\n\n\nComposed as a gift for a special daughter the deli sweet by real foray the piano ... sister and keyboard which was public broadcasting bringing you next door a complete string quartets in the hands of four guitarists music by Philip blast next\nTo the northwest everyday inspiring dialogue discourse and discovery if you also support these values you can find out more about becoming a program sponsor at N. W. P. B. dot org ... support\nFor the pollution St Louis Clark valley increasing clouds tonight as a weakening storm system moves through the region which may bring some light showers Wilson I'd be upper thirties forties\nWhen states sunny and dry ice and the upper fifties to mid sixties more widespread precipitation is likely on Thursdays a stronger system arrives peers have showers likely for the weekend\nNorthwest public broadcasting K. R. essay Ninety One point seven Moscow Pullman K. N. W. V. Ninety point five Clark St Louis ... can W O Ninety point one cotton wood Greenville NPR in classical music community service at the end would armor oh College of communication at Washington state university ah\n\nThe flu just Gary shocker the guitarists Jason V. O. in ... by fell so much ado on northwest Public Broadcasting's NPR in classical music service will come along to the Tuesday evening I'm Gigi Yellen with right now a quartet of guitarists\nWho met at conservatory in Dublin\nAnd decided to dedicate themselves to music of their own time it's the Dublin guitar quartets own arrangement for themselves\nOf music from the Nineteen eighty five film me Shima a life in for chapters music by Philip Glass here's glasses string quartet number three known as me she\n... boom boom boom boom boom\n\nBoom boom\nBoom\nBoom boom\nI\nTo me\n\nAnd I'm\nNot\n\nAnd\nThe and again during the campaign can you do you do in the\nDay to day and then they\nAnd they didn't know any day now I think they can do manning can and can't\nDo and they and they didn't have anything to do it in ... and ...\n\nThen they may or may not many many women and\nWomen and men and women and men and women and then and\nThey made\n\n\n... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... can beep beep beep beep beep beep beep beep beep beep beep beep beep\n... ... ... ... ... and the people who can come to town\n... ... ... you can do\n... ... ... in the in the\n... and ...\n\nAnd\n... ... ... ... [noise] [noise]\n[noise]\nAnd ... and ... and ...\n... ...\n... in in\nIn in the deep doo doo doo doo doo\nTo ... ... ...\n\n... ... ...\n... ... ...\n\n... ... ...\nOr\n...\n... people in\n... ... ...\n\n\nMusic by Philip Glass originally written for traditional string quartet their transcribed and performed by the Dublin guitar quartet\nPhilip glasses string quartet number three called me Shima\nOn northwest public broadcasting and W. P. B. dot org here on the NPR and classical music service you can hear guitar performances weekly on classical guitar alive Saturday is that one in the afternoon\nAnd Sunday mornings at night and\nThank you so much for making northwest public broadcasting a part of your Tuesday evening Olympian Tacoma listening at Ninety point nine FM Walla Walla at eighty nine point one golden Dale at Ninety point five\nThere is a math at N. W. P. B. dot org of all of the stations in the networks called northwest public broadcasting\nMozart here's the pianist Andre shifts to so low in the piano concerto number think teen by moved search [noise]\nThen\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\nAnd\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise]", "year": "2018", "show_name": "Innovation Hub", "city": "Moscow", "day": "24"}