[{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the Arizona community radio network at eighty nine twenty five I stand cage Jay Z they drink William Ninety One that same cage GDP Prescott Ninety seven percent kj easy to to men in Ninety One point three FM ...\nPartly sunny this Monday in ... heights reaching up to Ninety to some ... south when throughout the day partly cloudy and the evening a loaf around sixty six in Kingman mostly sunny today high switching to eighty degrees partly cloudy skies in the evening Loeb around fifty four\nIn Prescott partly sunny highs reaching up to Seventy one partly cloudy an evening a loaf around forty five degrees in Flagstaff partly sunny skies are expected to in the forecast with high switching to sixty four mostly quiet in the evening elope around thirty eight\n\n... coffee I crossed the line here with you for the next hour I picked out some great music which I think you'll really enjoy well Institute little feet\nConway woody and the light and let's get the ball rolling with being less slack and ... [noise]\nDo you\nThink you know what you\nBring that don't ask\nDon't bring you\nSo that's why my one\nConcern made certain days when he went down for a\nPretty good\nFor\nThe last thing\nThat was that brings\nTo hear from certain\nThings like that where you have somebody like south\nPark [noise]\nTo go\nTo the\n\n[noise] [laughter]\n\n[noise] 'cause I work\n\nThe things that\nWe can you tell\nMe that\nWe could just\nThink that they can do\nThings for the last time we make you glad they make me down down\nDown down\nNatural thing you can you bring them yeah but I Do not bring down\nEvery cancer will now three pounds\nReally down down down down down down down\nDown the street you can do that\n\n\nIn the\nBrain glory and the\nAnd then\nSay you're a is on the gear system\nCamera borough can\nOn the way the and Shane\nAnd you know we're always\n\nNo ...\nNo ...\nA small\nFor the ...\nNo\n\nA well\n\n... do the job bad no good\n[noise] [noise]\nGlad moms ain't nobody on a lot of me and how\nOn the Greek up with a lot a lot in the mountains and nobody noticed about a year after the trial\nDon't know what\nBe out in the shade [noise]\nGot\nA bank he died in Europe\nYou want to get them both John how can we talk about ... million others around and have\nMe about this we mentioned it coming home and\nI actually\nThat meant you know I should be allocated about\nTheir job you think\nThat you\nOut and how they've been saying about ... miles either going to stay\nWhile I ... I don't know but a la la la la la\n... about a jeep ha ha you know why they say a while you're in a a ...\n... they they have the ...\nA la la la la la la la la la la la\nLa la la la la la la la\nBridgette or you know why are you saying you're right I Am very na na na na you buy the\nYeah\nLa la la la la la la la la la la\nWho do you go about you where are you know you're in a minute\nOh I don't know\nHalf from G you\nAlready have a very very\nBy no yeah\nWe left them to go but up to ... go up on what's good about do you do\nYou know\nWhy am I right here say hey that's dry you know we're\nHearing and say hey\nNa na na na na na na\nNa ... are you a wire you say you're saying yeah why a painter and their value by\nYeah hey hey ding dong\nDoctor mom we ate who belong in a ... a young lawyer or a I die you blog\nAbout my God to teach you to know\nWhy I ask why are you a very fine\nYeah paying ...\nNa na na\nNa na na\nDa da da da da da da da da da da\nNa na na\nG. God are you there are wearing a wire saying hey yeah that's why you buy a ... year other na\nNa na na na\nNa na na na na na na na\nNa na gee you know why [noise] [noise]\n\nUm maybe\nShy\nThan any man they need to\nDay ...\nWell not rather young\nTo be spent on it uh\n\nThe the the\n... name three broke\nUp on\n\nPardon me\nIn some things\nHe did\nOn to be based on its way\nYou know [noise]\n[noise] no no no\nThey didn't do you like to go in with a kid I don't know\nHow long is the thing to get\n[noise]\nWhat do you\nDo you\nDo that\n\nCan you\nDo\nDo\n[laughter]\nTo go do you see my friends are in the bathroom getting tired and\nMay waiting for me to just across the bomb about ... minutes they give him a lot of someone asked him about God I Know I\nI Know you're trying to\nLearn the queen of the main\nYou know I'm trying to take in by\nThe bars close it and you feel like falling\nAll carry you\n[noise]\nA way along with my\nJeremy me\n[noise]\n\n\nWow what a great version of we are young featuring fun and the ... mice throws\nWhich is a star studded group of beautiful wonderful musicians with the distinctive rhythms and sounds of go by it's recorded by an all star cast of legendary musicians in fact\nIncluding when of is just social clubs but a buddy those daughters and I might eat the why did\nYou find is that the French singer Christine and the queens gave us damn what must a woman do\nWould end up ... critiqued our current administration with Tangerine man and it was Conway with woman you've been listening to undo currents and if you're just joining us welcome hears Patty Larkin on under current\nI Know\nDuring nine or\n... oh\nI'm the I'm On my\nWay\nMm oh ...\n...\nWho am I ...\n\nNa ...\n\nYeah\nLove can make huge um hold on\nI'm home again Mm\n[noise]\nYeah um let's see\nMm\nOh there you\n... ...\n... ah ... um\nI'm home again Mm\n\nMm\n[laughter]\nOh my God yeah yeah but so\n\nMany gay and I believe\nFor them to do that [noise] are\nThey going to say that\nMost see as many as ... [noise]\n\nYeah you really love God and interviewed on\nKnow\nDo you see that on on saying you\nCalled me on the news and then\nThey give you reason though is releasing\nNinety point seven FM J. D. C. K. king then in Ninety One point three FM Flagstaff\nPartly sunny this Monday in Yuma highest reaching up to Ninety to some ... south when throughout the day partly cloudy in the evening Loeb around sixty six in Kingman mostly sunny today highs reaching up to eighty degrees partly cloudy skies in the evening Loeb around fifty four\nIn Prescott partly sunny highs reaching up to Seventy one partly cloudy in the evening Loeb around forty five degrees in Flagstaff partly sunny skies are expected to in the forecast with hydrogen up to sixty four mostly Claudia in the evening elope around thirty eight\n\nIt's ... like I said I'm here with you for the next hour with some great tunes including ones from our low Hannigan\nThe boat deans van William and Elvis Costello and the postures\nLet's start out with one from jealous of the birds Naomi Hamilton bandleader from Belfast Ireland\nSays that this song plastic skeletons was written once she got back from South by south west in two thousand sixteen that was her first trip to America and she brought a journal and wrote a bunch of stuff in it\nWhen she got home she says she went through it and wrote that song in full it's a collection of little words and images that she picked up in the U.S here's plastic skeletons on into currents\n\nWhere money Danny\nMean by\nKnow some of the study\nReally or\nBecause that's the right by the ability to undercurrents ready\nShow ...\nYork law school\nRead the news\nHe did you get to\n\n...\nCity is you know the thing is this does go say what you said\nThey got sued the defendants\n... years old and\nSaying is brown\nHis own son\nPercent which is a little more business in\n...\n... mom I've gone to trial in my hand and I'm ready for a loan\nEven\n[noise]\nWe drive down the cellar higher were able to drive all the way down to\nWhen we get to our campsite\nThere's a bigger room there\nSo we got bored cross ...\nControl between both sorry\nThan we are always on the other side\nYou're there you're our fear of\nLike you can kill your little bit of\nBeach for\nYou learned back to when you wake up\nThe security for one another\nYou feel a lot more than what the\n[noise]\n\n\n\n[noise] so many um\n\nSo many well do you know\n... and\nYou\nOf money on\nOn\nA R I Want\nI just want\nKnow I don't really\nSee I\nIn a [noise]\nYeah I just saw\nA\nGuy on\n\n\nGuy on um\nOn\nGlad that they may\nUp\nWe don't lose when you got to\n\nYou\n\n\nThis Jackson Brown and you're listening to under courage\n\n\nDon't know I don't mean to me when\nCall ...\nThey got to be\n\nThat was Jackson Brown and ... cents on place with the dreamer\nIn front of that a new one for an Elvis Costello and the posture it's Mr and Mrs dash and it was a ... piece Jay Douglas gave us celebrate my love would ban William at the top of that sat with cosmic sign\nIt's under current I'm ... and if you're just joining us welcome here's a song designed to make you feel better hears southern avenue\n[noise]\n\nTo\n\n\nThing\nOr a\nDog\n\nUm ...\nYou\nHow\n[noise] I [noise]\nThis [noise]\nUm well they don't [noise]\nWe also want to catch on the Arizona community radio network at eighty nine point five FM cage Jay Z a Drake Williams Ninety point one from kj deep deep Prescott Ninety point seven FM cages eat cake Kingman and Ninety One point three FM black stuff\nMostly sunny skies in Kingman today highs reaching up to eighty degrees partly cloudy skies in the evening with Loeb around fifty four partly sunny in Prescott this Monday morning has reaching up to Seventy one partly cloudy this evening globe around forty five in Flagstaff partly sunny hydrogen to sixty four mostly\nQuality in the evening all over around thirty eight and you must partly sunny has written up to Ninety to some call themselves when throughout the day partly cloudy in the evening with low up around sixty six degrees\n\nIt's under ... like I said I'm here with us for the next hour hope you like the music that I picked out for you we've got some good ones from carrying more in age age and fleet Fox's and even Donovan first off mace\nWe've got some good ones from Kerry Moran age age and fleet boxes and even Donovan first stop Macy Gray from two thousand ten beauty in the world\nShe's\n[noise]\nInternet and\nThat um are\nHer and her parents\nHearing\n\nAnd the more than\nThey called me in\nDon't know\n[noise]\nHey this is Jay Jay thanks for listening to under current\nThe ocean German\nIn there\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n\nRight oh whoa whoa whoa\n\nWhoa back\nI'm going to die you\nHow this\nPrime locked in a\nRow row row\nQuestion what\nRole in\nOh whoa whoa whoa\nWhoa whoa whoa whoa\nThey do and I pray that\nWhoa whoa\nTen\nNine in all the\nOld old Opry I added row\nRow row\n\n\n\n\nIn the pouring rain\nAnd Robin\nLost my voice and I lost my clothes lack in Charlotte I knew I knew\nBut when I Will\n... ... leaves ... gone I Try not to panic as I'm\nFrom the south ...\nAt all then\nEverything is saying and I can now right [noise] [noise] [noise]\n[noise]\n\nMm\n... ...\n... ...\n... or\nDue the fear [noise] oh yeah man [noise]\nYou are much sunshine\nList on the show and\nYou never know\nClean things may\nMom mom I was told\n[noise]\nYousef cat Stevens gave us you are my sunshine when the two thousand fourteen release tell them I'm gone past the standards brought us as a treat it with the Donovan from Nineteen Ninety nine\nWith to Susan on the west coast waiting and fleet Fox has brought us aisle\nIt's under currents I'm gravity of that and if you're just joining us welcome here's a new one from Paul McCartney [laughter]\n\nJune ...\nWas driven days are over ...\nThe polish ... Vermont\nThe\nStreet\nTo the\nOne\nWay the\nPretty\n[noise]\nPeople\nThe TV [laughter]\nPeople [noise]\n\n\n\nYou shouldn't be jaded daughter\nAgain you know the big issue in ... new try\nYou got some fish the the\nEighty nine point five FM McKay Jay Z a drink Williams Ninety One F. M. K. cheesy Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three ...\nRadio easy dot org we also broadcast on the Arizona community radio network eighty nine point five FM McKay Jay Z a drink Williams Ninety One F. M. K. GDP Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three of them Flagstaff\nMostly sunny skies intimidate highs reaching up to eighty degrees partly cloudy skies in the evening with love around fifty four\nHardly sunny in Prescott this Monday morning hides reaching up to Seventy one partly cloudy this evening Loeb around forty five\nIn Flagstaff partly sunny high reaching up to sixty four mostly cutting the evening of low around thirty eight and you must partly sunny has reaching up to Ninety to ... south wind throughout the day partly cloudy in the evening with low up around sixty six degrees\n\nIt's ... like I said I'm here with you with some great teams coming up from St Vincent quota thing Richard tone and universal speakers first off here's Bruce Springsteen [laughter]\n\n[noise]\nShepherd\n...\nFor leach and Jews\n\nWe were ...\n\n\n\n\nThe\nMembers lived up to orange\nScreen do by eleven retreat he yeah he was a quick and\nAbove the lady in the book but you\nIt's going to be under the sun and she knows really\nThe Bronx fresh cut off the boat and so what are your memories for\nMay well it's not like he was quick in the day I\nYou want to know what happiness is it is a there's a ... some\nTo look forward to this cat is going to get the creek new skin mango is so smooth smoother than they do they do go to like jump up to the ...\nHello this is talk shows and you're listening to under current American music ... ... ... ...\n\nLady\n\nAnd\nAsked you\n\n[noise]\nJackie green with crazy comes easy and up tempo songs that offers and appreciate it not to the black crows whom Jackie laid lead guitar for during the bans two thousand Thirteen world tour\nRichard Thompson in front of that with the new one from these Thirteen rivers album no matter and it was put our faith with little girl dreaming\nIt's undercurrents I'm cap the well here in New one from universal speakers in just a minute\nYou can hear border radio Thirteen twenty am on the radio ethics download the app install it and so like kale I think as your favorite station\n... in the Arizona neurotic village will be hosting ... has been five K. it'll be this Friday starting at six PM with post race games on a campfire starting at seven Fifteen yeah this will be held at the Arizona Nordic village eight miles past ... up highway one eighty\nThis is folk singer Michael Jonathan inviting you to tune in to this week's broadcasting we have the Austin trio the trolls measures and the son of the legendary John McHugh and Jonathan McEwen his son\nHe both artists music in conversation on this week's broadcast\n\nConversations this week's broadcast\nUm\nTo the evening at seven on board or radio so he's twenty and\nYou're listening to under current coming to you with support from the corporation for public broadcasting and the friends under current thank you for your ongoing contribution here's a new interpretation of an old too from the reiki band universal speakers [noise]\n\nNa\nNa\nHey it's drawn more short it things will get in on the garbage American music or the fans\n\n... thankful that need to undo the coverage American music for the past ...\n[noise] [noise]\n[noise]\n\n\nWell we'll just you won't kill me again so I don't know\nWhat's happening in it then\nIt's going along guinea all show what did you want\nTo put your agenda [noise]\nBack and I'm like you know that\n\nDo you feel like I'm back\nAgainst on its own little\nYou can't just\nWhen you were kids and she the\n[noise]\nBe on your knees so\nOne may\n\nEat them go through all those slain all that money should be\nGiven something important maybe\nWhat was wrong to kill me again I've\n\nSeen rich change am I getting it wrong\nYou're listening ... ... am I getting it wrong laying on my way and I\nWhen it's not it\nDidn't do it well you even get a\n\n\nBetty live at with what was it you wanted featuring Trombone Shorty in front of that it was Sarah Borgias end the broken singles from the album loves middle name that was headed down\nThe record company gave us I'm getting better and I'm feeling it right now and universal speakers brought us that cover of the tide is high it's undercurrents I'm ... and if you're just joining us well here's the Reverend Shaun Amos\nShe moved to smooth the I'm In\nI'm ... I mean\nThe brain\nDo when\nLate ... when\n[noise]\nOr you\nTheater\nYou want to talk\n\nCan you do the ... press get Ninety point seven FM cage easy kicking met in Ninety One point three of them like staff in Kingman\nMostly sunny today I near eighty degrees south south west when seven to fourteen miles per hour tonight partly cloudy those around fifty four Prescott mostly sunny eyes near Seventy two today partly cloudy tonight loves around forty five\nBlack south mostly sunny eyes near sixty five today and tonight partly cloudy lows around thirty eight in Yuma mostly sunny with a high in eighty nine today it partly cloudy tonight with the lowest sixty four\n\n... ... across the line here with you for the next hour I think that some great music which I think you'll really enjoy well let's see two little feet\nConaway ... in the library and let's get the ball rolling with bailout flak and Abigail Washburn [noise]\nDon't you\nYou know no one is that it you\nYou don't bring 'em well\nNo no not bring you\nOnce you for that was the one that well\nSounds like you're not going to lead the way down down down down down\nPretty good\nGoing down down from the actual bring that\nAnd we're we're pretty good\nTeaching a fortune ...\nCompanies are paying to see a lot of food do you think\nThat was three and\nWoman in the city should teach sooner or later\nYou're still not very clear now something pretty time shoveling down down down springs bring\nTo ... [noise] [noise]\n[noise] [noise]\n\nWhere people can live with somebody that was the\nTo\nMe you know\nWe can you tell\nMe that\nWe could just\nThink that the guilt thing\nFor the last time we knew that they bring down down\nDown down\nDown or something you can you bring you down down down down down\nDown down down down down\nDown down down down down down down\nDown in the same\n\n\nThe\nFall prey to play the\nAnd then the\nOf sheer arrives on me gear system\nA line\nBorough can\nOn the way the and Shane\nAnd you know little you know way\n\nKnow the you\nKnow\nKnow Paul\nFor a ...\nNo\n\nA\n\nBill and do a little bit and you know good\n[noise] [noise]\nI'm Glad I don't even have more than a nobody on a lot of me and\nOn the hand picked up a lot and a lot in the mountains and you'll be known about a year in the day after the trial\nI'm looking at it that way\nBut you\nMaking sure the ball and these are joined Shane [noise]\n\nGot bank he died in Europe\nGet them both John how we're going to five years in the near with others around wouldn't have\nMe about this we mentioned to come and no doubt\nThat you\nKnow maybe you know I should be allocated about is how do you think\nThat you\nAnd hobbies or do you get about ... miles either go to Shea\n... bucks a call ... ... ... ... what a la la la de la ...\nAbout a boutique or you know why you know you're saying yeah well he uh\nA boutique that are you still are\nWhy if you're saying yeah well you have a a ... I Know\nThey say hey as\nNa na na na na na na na na na na na na na na na na\nBridgette guy you know why and say hey yeah I Am saying hey you know in\nThe\nHa ha ha ha ha ha ha ha ha ha ha ha but\nWe're going gee you\nAlready know you're very very\n... you know yeah\nWe are you left out to go but up to ... ... ... ... ...\nYou know why\nAm I a lawyer saying hey you know try you know\nAnd say hey\nA R I lost a loved one ha\nNa ... are you ... if I might have a\nValue by though yeah hey hey ding dong\nDoctor my we ate who belong in a ... a young lawyer to talk I die you law\nBut my God do you\nWant to if I were you a very very upset by\nThe same game as an attack but around\nNa na na\nNa na\nDa da da da da da da da da\nDa da da\nNa na na\nNa em Ali G. God or you saw Renee hey hey hey hey yeah that's why you buy 'em yeah yeah yeah\nHa ha ha\nHa ha ha ha well\nGee you know why [noise] [noise]\n[laughter] [noise]\nUm maybe\n\nThan any man you can they do need to do\nThat day ...\nRather\nI'd rather young man\nOne of the band on its way no um\n[laughter]\nThe scene that she had\nAbout these\nNames pretty well they can make a\nLiving on Sunday\nAnd some things\nHe\nTo be done and say\nOn the mean based on its way\nTo know\nDo that you do crowns just like the way\nThings then you know in may the kids don't know\nI tend to get\nWhat do you\nDo\nDo\nDo\nCan you\nDon't\n\n[laughter]\nTo go to ... do you see my friends are in the bathroom getting tired of\nWaiting for me just across\nAbout ... minutes said give him a lot of the song by asking a lot of God I Know I\nI Know you're trying to\nClean the gutters made\nYou know I'm trying to take you back\nThe bars close and you feel like falling\nOkay I mean you\n\nWhen Baltimore\nTo me\n[noise]\n\nWow what a great version of we are young featuring fun and the how Bonner maestro\nWhich is a star studded group of beautiful wonderful musicians with the distinctive rhythms and sounds of go by it's recorded by an all star cast of legendary musicians in fact including when of is just social clubs by buddy bill daughters and I might be filled by this\nYou can find is that the French singer Christine and the queens gave us damn what must a woman do\nWoody and the ... there's critiqued our current administration with Tangerine man and it was Conway with woman you've been listening to undo currents and if you're just joining us welcome here\nSure enough man and it was Conway with woman you've been listening to undercurrents than if you're just joining us welcome here Patty Larkin on under current I Know\nSweet lie\n...\nUm be on my\nWay\nHome I guess ...\n\nNa ...\n\nLove can make huge um hold on\nI'm home ...\n\nYeah um let's say\n\nI'm a huge\nMm Mm\nMm right yeah I ... I'm\nI'm home again um Mm\n\nMm\n\nOh my God yeah by so\n\nMany good elite force\n[noise]\nOh yeah that is\nMost see as many as ... [noise]\n\nYeah you know a lot of the road in ... [noise]\nKnow they\nDo you want to do that on on the new\nCalled me I mean you\nReally really seen you know\nOr eighty nine point five essay kj ... age ... Williams Ninety One that same cage ac peep Prescott Ninety eight point seven as than Jay Jay Z cake Keenan and Ninety One point do you ask them like staff\nIn Yuma mostly sunny in a high in eighty nine east within five miles per hour today tonight partly cloudy those around sixty four\nHuman has mostly sunny skies in a high near eighty today and tonight partly cloudy laws around fifty four\nPrescott mostly sunny highs near Seventy two today tonight partly cloudy laws around forty five and in Flagstaff mostly sunny with a high up sixty five today partly cloudy with a low of thirty eight tonight\n\n... like I said I'm here with you for the next hour with some great tunes including ones from our low Hannigan\nThat do demons van William and Elvis Costello and the postures let's start out with one from jealous of the birds Naomi Hamilton bandleader from Belfast Ireland says that this song plastic skeletons was written once she got back from South by south west\nPeter from Belfast Ireland says that this song plastic skeletons was written once she got back from South by south west in two thousand sixteen that was her first trip to America and she brought a journal and wrote a bunch of stuff in it\nWhen she got home she says she went through it and wrote that song in full it's a collection of little words and images that she picked up in the U.S here in plastic skeletons on the degree\n\nRight\nAre you guys have\n\nReally are\nTo\nBecause that's where I bought a ... de undercurrents radio\nCurrents radio\nShow very wrong song\nIt you are law suits\nTo understand what goes on and he\nSaid that you can reduce\nHe do that\nYou know the day the stove and go away\nThey got sued the dead\nMan yo this whole thing and\nMan saying is brand\n...\nAll this land which is a little more business in\n...\n\n... how long the motive mumbles Scottish prowling my hand and I'm ready ball will\nOr even a\n\nWe drive down the cellar hardware\nWhen we get to our website\nThere's a big move there\nSo we got ... ...\nControlling up between both sorry\nOther always remember ever start\nYou're very your hours for a\nSaying like you to hear a little bit of\nBeach so\nTo go back to when you wake up\nCheer you you're going\nYou feel a lot more than what the\n[noise]\n\n\nOh and by\n\nSo many ways\n... and\nYou\nKnow and\n\nAre na na\nNa\nI just you\nSaw you know I don't\nSee why\nNo no no no [noise]\nYeah I saw\nA\nAnd I know\n\n\nGuy on um\nA ...\nGoing to they\nSeen\nGoing to say\nDa da\n\nDa da da da da da\n\n\nPointed to\nYou think\nI\nThis Jackson Brown and you're listening to under current [noise]\n[noise]\nWhich are which caused\nDon't know I don't mean the way\nOn ... ...\n... ...\n...\n\nThat was Jackson Brown and ... cents on the list with the dreamer\nIn front of that a new one for Elvis Costello and the posture it's Mr and Mrs dash and it was a ... piece Jay Douglas gave us celebrate my love with Stan Williams at the top of that sat with cosmic sign\nIt centered currents I'm ... and if you're just joining us welcome here's a song designed to make you feel better hears southern avenue\n[noise]\nTo\n\n\nAll right\nAll\nAll right\nUm let me\nYou\nYou\nHow\nThe\n... Williams now deeply one ... Ninety point seven at the same cage easy kicking men in Ninety One point three ... in England\nMostly sunny today eyes near eighty degrees south south west when seven to fourteen miles per hour tonight partly cloudy lows around fifty four ... mostly sunny eyes near Seventy two today partly cloudy tonight lows around forty five\nFlagstaff mostly sunny ice near sixty five today and tonight partly cloudy lows around thirty eight and ... mostly sunny with the highest eighty nine today it partly cloudy tonight with a low of sixty four\n\n\nHey it's under ... like I said I'm here with us for the next hour hope you like the music that I picked out for you we've got some good ones from carry more in age age and fleet Fox's and even Donovan\nFirst off Macy Gray from two thousand ten beauty in the world [noise]\nTo do\n[noise]\nNa na\nNa na na na\nNa na na\nNa na\n\nThe morning and\nThey called me in\nTo\n[noise]\n[noise]\nHey this is Jay Jay thanks for listening to under current\nShould in Germany\nHim a player\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n\nRight oh whoa whoa whoa whoa whoa whoa\n\nBeen holding back\nNo\nNo this\nPrime ...\nRow row\nRow row\nShe was in\nA row and\nOh whoa whoa whoa\nWhoa whoa whoa whoa\nThey know what I bring that\nWhoa whoa\nCan do\nIn all the\nOld old Opry I added row\nRow row\nRow\nRow row\n\n\n\nIn the pouring rain\nAnd Robin mean\nLost my voice and I lost my clothes like in ... new and then\nA button when ...\n... ... leaves will go on to I Try not to panic as in um you know\nFrom the south ...\nI mean you know\nFrom the south and we were\nDo y'all been\nEverything is saying and I can now right [noise] [noise]\n... ...\n\n... ...\n... ... ...\n... ...\nDue the fear of yeah man [noise]\nYou a much sunshine\nSunshine\nSleeping\nMy mom I once told me\n... ... ... ... ...\nYusef cat Stevens gave us you are my sunshine from the two thousand fourteen release tell them I'm gone past the standards brought us as a treat\nIt with Donovan from Nineteen Ninety nine with to Susan on the west coast waiting and fleet Fox has brought us aisle it's under currents I'm gravity or that and if you're just joining us welcome\nHere's a new one from Paul McCartney\n\nWas driven days you know ...\nMad at me do it in well\nThe Bush really Vermont\nFees [noise]\nCheese\nDo\nOne\nThey\nTo me\nThan just\nTo\nBeat up on\nTV [laughter]\n\n... James and the daughter\nThe back of the nation from ... to try\nYou got to see the\nButter radio waves eat dot org\nWe also broadcast on the Arizona community radio network eighty nine point five as than Kay Jay Z a drink Williams Ninety point one this damn cage Jay Z peep Prescott Ninety point seven Afghan kj easy cake Kingman and Ninety One point three FM like staff\nIn Yuma mostly sunny in a high in eighty nine east when five miles per hour today tonight partly cloudy those around sixty four\nEngland has mostly sunny skies in a high near eighty today and tonight partly cloudy laws around fifty four\nPrescott mostly sunny ice near Seventy two today tonight partly cloudy laws around forty five and in Flagstaff mostly sunny with a high up sixty five today partly cloudy with a low of thirty eight tonight\nIt's ... like I said I'm here with you with some great tune coming out from St Vincent put out the Richard ... and universal speakers first stuff here's Bruce Springsteen\n\n[noise]\nShepherd\nTo\nFor the changes\nVe we will ... ...\n...\n\n\n\nMean\nThe dog to\nScreen do by limiting retreat he yeah he was a quick end\nThe late ... in the book\nIt's going to be under the sun neutrinos blew me\nTake runs fresh probably below them to be removed for\nTo grind fresh Kobe Bryant and serve me move furniture\nDay was not like he was quick and the day I\nYou want to do or happiness is it is a there's a hunch is going to look forward to this is going to get the green and blue skinned men go is so smooth smoother than the devil may need to go to like jump up to the ... main rebel [noise]\nGround eastern\nThat's why he walked out\nCan either way he was born\nHe's cutting it easier\nTo do with the\n[noise]\n[noise] [noise] [noise]\n\n\nUm the man no way what do you really can't make it messed up when you go and no way that can be when you read that change your mind not do well to\n\nDo you head they ... they ...\n[noise]\nHello this is Richard structure and you're listening to under ... American music ... ... ... ...\nWho\n\n[noise]\n\nNa you've been\n[noise]\n\nOkay and do\nJackie green with crazy comes easy an up tempo songs that offers unappreciated not to the black crows whom Jackie laid lead guitar for during the bans two thousand Thirteen world tour\nRichard Thompson you find is that with the new one from these Thirteen rivers album no matter and it was put up with little girl dreaming\nIt's undercurrents I'm God you're that we'll hear a new one from universal speakers in just a minute\nYou are tuned into\n... well here in New one from universal speakers in just a minute\nYou were tuned into border radio Thirteen twenty in ... a C. dot org we also broadcasts an Arizona community radio network\nToday's border radio day sponsors human community theater presenting Agatha Christie's and then there were none assistance will react play that will keep you guessing to the very end opening friday November second at seven PM and running weekends until November Eighteen the pecan grove elementary school\nSix hundred twenty first avenue in you more humid community theater dot org\nThis was folk singer Michael Jonathan inviting you to tune in to this week's broadcast we have the Austin trio the trolls managers and the son of the legendary John McHugh and Jonathan McHugh and his son\nAnd he sort of music in conversation on this week's broadcast\n\nDo you think it's seven on board or radio so he's twenty and\nYou're listening to undo currents coming to you with support from the corporation for public broadcasting and a friend to undo current thank you for your ongoing contributions here's a new interpretation of an old tune from the raking band universal speakers [noise]\n\n\n\n\nJumbo shorter things will get you on the garbage American music where the parents\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\nWhoa whoa whoa Yulia can go out and know\nHappened is that\nGoing along in your show what did you\nWould you say it again [noise]\nBack in the last\nWhat did you get your field I'm back\nIn the weekends dot in all\nMind\nWhen you were kids and she\n[noise]\nWhat do you know you don't\nAlong\nKnow\n\nI eat them go through those slain than what it\nIs it something important maybe\nWhat we want to kill me again I was\n\nListening to change\nLaying on on the ...\nWhen it's not it\nDid you what you eat lunch I don't get me in\n\nBetty live at with what was it you wanted featuring Trombone Shorty in front of that it was Sarah Borgias and the broken singles from the album loves middle name that was headed down\nThe record company gave us I'm getting better and I'm feeling it right now and universal speaker it's brought a sec cover of the tightest high it's undercurrents I'm ... and if you're just joining us well here's the Reverend Shaun aim at\nWould be I'm Ryan\n\nThe burning\nDo when\nSaying look we've\nHappens you have\nTheater no\nLead you to want to talk to\n", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "29", "locations": [["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Tangerine", 49.52778, -73.90472], ["Conway", 35.26221, -92.70132], ["Yuma", 32.72532, -114.6244], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Belfast Ireland", 54.59682, -5.92541], ["America", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Charlotte", 18.3419, -64.9307], ["Vermont", 44.00034, -72.74983], ["Arizona", 34.5003, -111.50098], ["Prescott", 34.54002, -112.4685], ["Bronx", 40.84985, -73.86641], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Yuma", 32.72532, -114.6244], ["Baltimore", 39.29038, -76.61219], ["Conway", 35.26221, -92.70132], ["Conway", 35.26221, -92.70132], ["Belfast Ireland", 54.59682, -5.92541], ["Belfast Ireland", 54.59682, -5.92541], ["America", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["England", 44.0, -71.0], ["Germany", 51.5, 10.5], ["Donovan", -27.16667, -59.33333], ["Vermont", 44.00034, -72.74983], ["Arizona", 34.5003, -111.50098], ["England", 44.0, -71.0], ["Arizona", 34.5003, -111.50098]], "not_found": [], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Prescott", "Conway", "Yuma", "Prescott", "America", "U.S", "Arizona", "Prescott", "Vermont", "Arizona", "Prescott", "Bronx", "Arizona", "Arizona", "Yuma", "Baltimore", "Conway", "Conway", "America", "U.S", "England", "Vermont", "Arizona", "England", "Arizona"], "out_country": ["Kingman", "Tangerine", "Kingman", "Belfast Ireland", "Kingman", "Charlotte", "Kingman", "Belfast Ireland", "Belfast Ireland", "Germany", "Donovan"], "in_state": ["Arizona", "Prescott", "Yuma", "Prescott", "Arizona", "Prescott", "Arizona", "Prescott", "Arizona", "Arizona", "Yuma", "Arizona", "Arizona"], "out_state": ["Kingman", "Tangerine", "Conway", "Kingman", "Belfast Ireland", "America", "U.S", "Kingman", "Charlotte", "Vermont", "Bronx", "Kingman", "Baltimore", "Conway", "Conway", "Belfast Ireland", "Belfast Ireland", "America", "U.S", "England", "Germany", "Donovan", "Vermont", "England"]}, {"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the Arizona community radio network at eighty nine point five FM kj ... a drink Williams Ninety point one FM ... you'd be pressed gets Ninety points to have an FM ... came in and they one point three ... black stuff\nSunny skies in human today highs reaching up to Ninety five they called north east wind blowing throughout the day was mostly clear skies in the evening and the low around sixty six in Kingman sunny skies ties reaching up to eighty three in northeast went up around six miles per hour blowing into the evening was clear skies no love around fifty five\nIn Prescott sunny skies hind you're Seventy six months to clear in the evening Loeb around forty six with some light variable wins in Flagstaff sunny skies a high and you're Seventy today mostly in the evening with the low around thirty eight\n\nAlright it's undercurrents I'm Greg with vigor hello welcome glad to hear some fantastic music about this hour we'll just keep it a secret okay we'll just see what happens let it flow but now the pre tenders to get us going [noise]\n\n\n\nTo [noise]\n[noise]\n[laughter] [noise]\n[noise] [noise]\n\n[noise]\nThey change [noise] stay on that\n[noise]\n[noise]\nHow did you have a [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\nMan [noise]\n\n\nAnd and and then the\nBe nice to meet you man some money\nYou would take down the\nNa na na\nGiants fans here today\nStand behind them monsoon\nAre making you know I'm\nI'm In [noise] and I signed\nTo [noise] to see [noise]\nI can listen to\n\nJob now the law and the [noise]\nYou know I never really know [noise]\n[noise] does Cheney yeah na\nNa\nNa\nNa na na\n\n[noise]\n\nWhy do we know now that we\n\n\n\nMm Mm Mm\nDream you give me\n...\nGoes to the bone\nWant to\nDon't you know\nGotta belong in the proceedings\nBonnie him back on\nIn Sana'a\nAnd\nNa na na\nNa na na na ...\n[noise] you\n...\nAnd\n\nThe\n\nTheir own way yeah\nI mean I Know yeah I\nHave gone to\nWay down in\nNa na na\nNa than others but I Do\n\nDa da\n\n\n\n\n\n\n\n\n\nI Need you\nUp and get me\nAnd read to kill me\nI Need to\nBe there\nWe come on and\n\nOn and you\nWhen you\nTo me\nI Need you to\nBe\n[noise]\nReally come and take my call me and my\nOn\nMe\nThing that\nThey\n\nThe\nGum when you need\nCan read it\nBay [noise]\n\nFrom Rob I'm playing chess where she covers the number song made famous on chess records like at all until about some rescue me the least look grow on undercurrents\nFrom Egypt Station Paul McCartney back in Brazil and it was marked offer good on you son for his new went down the road wherever it's under current and if you're just tuned in welcome Greg the stones ahead\nAnd he was you know from carrying more from a java when I write because it's just the tow truck\nMm\nA raw\nLaying in the mall and then\nMom with a CD or a\nNo sign of a cop\nKnocked out around\nIn the ... man\nTo live in the\nEarly morning\nThere was a rise\nThe mom man\nThe uh the Iraq\nNa na na\nAnd my mom and\nThen when we\nNo\n[noise] [noise] [noise]\nTo me is that they\nTo me yesterday\nKnow what the right or\nHe should do some while\nSure what it was\nThe law but I'm\nSaying\nThen there is a strange I hear you saying\nYou know\nReally care at all you\nWas [noise] oh no meaning in the car a day\nNinety point seven ... kj ... king men at Ninety One point three of them in Flagstaff\nSunny skies in human today highs reaching up to Ninety five they called north east wind blowing throughout the day was mostly clear skies in the evening it all over around sixty six in Kingman sunny skies highs reaching up to eighty three and northeast wind up around six miles per hour blowing into the evening was clear skies no love around fifty five\nIn Prescott sunny skies hind you're Seventy six mostly clear in the evening love around forty six with some light variable wins in Flagstaff sunny skies a high and you're Seventy today mostly clear in the evening what they'll do around thirty eight\n\nAlright it's under current some great vicar welcome music from universal speakers on on the way been Le Pen testing agree to see Austin and this is lake street dive [noise]\nNot I don't think I mean it was [noise] I don't I don't\nKnow if you've been in it that you want to [noise]\nTo not [noise]\n\n[noise] [laughter]\n[noise]\nThey can be I got to know when do you love me and I was when I saw the\nThat um you know he didn't want to come by my goodness [noise]\n\n\n[noise]\n\n[laughter]\n\n\n\nThe\nMen\nHe\nHe\nNeeds to be\nNot meant to\nMuch do\nWe\nKnow\nKnow do both\nNo no no\nMean you don't\n[laughter]\n[laughter]\nYeah [laughter]\n\n\nCan you\nKnow the\n\n[laughter]\n[noise] [noise] yeah sure sure [noise]\n[noise] [noise] [noise] well I mean\nThe country really was [noise] she is she said she was going on strike she's just for the fact\nShould gang the [noise] I mean we should pull\nThe house just tremendous Rochester bringing [laughter]\n\n\n\n\n\nWe've been demonstrated\nDown\nThere's been a\nShot\nTo do is just so she asked\n\n\n\n\n\n\n\nAnd\nTo\n... [noise]\n...\nAnd teach the\nHe is he's the\nThe\n\nKnow\n\n\nLast minute\nWe dont\nKnow\n\n\nI\n[noise]\nNa na\nKnow I was down in the way\nThe\nJournal\n\n\nThat we\nIt's a very playful new album from producer Chuck foster yeah when the time when everything's so heavy it's nice to hear something sweet in light\n\n\nHas children and she's right here they\nJake made a cat here\n\n\nThe the the the\n\nThe week to\nGym\n[noise]\nYou know do you know\nWow just so good that she was shot\nFrom fight like a woman from skin maybe of lakes swimming strike a pose for that believe boy with a Barbie and it was him GMT judging from little dark age\nWe're doing our little renaissance your musically graduate that should we just did welcome Greg\n... got to the Florida is on the way and we're going to catch their minds back down to two thousand for the album prairie where this was nearly\nAnd it's a\nYou\nAnd as long as you and\nWhere a bond issues the\nWith some ...\n... well the back\nBullies ... check\nTraining room\nNinety point seven ... men in Ninety One point three at them like staff\nSunny skies today in Kingman highest reaching up to eighty three leaders in the day northeast ones around six miles per hour blowing into the evening with clear skies Loeb around fifty five in Prescott sunny skies today highest reaching up to Seventy six mostly clear in the evening but the love around forty six and a light variable wind\nIn Flagstaff sunny skies hind you're Seventy with a calm when throughout the day most of the clear in the evening with all over around thirty eight\nAnd you must sunny skies hydrogen up to Ninety five mostly clear in the evening with a low of around sixty six\n\nOutrageous undercurrents I'm grading the vicar welcome to music coming up from the Grateful Dead why I Love it keeps the colder the masters since lord here on and we're going to get started now with her great when from Nineteen eighty seven this is Tracy Chapman's [noise] [noise] [noise]\nI Want to take a where maybe we maybe do you\nPay me to get that we can get some where can I play it and but I'm\nStarting from zero got nothing to maybe we'll let the other\nTeam I got another brood\nA plan to get us out of here and now they can be\nManaged to stay in the little bit of money won't have the job you\nCross the border and in the city you know I can get jobs\nBy the way they live at ...\nDeal with the bottle that's the way ahead in the body to work\nBut if you look like in my mind went up and left him more than ... than we do hear that that somebody's got to give him\nGo that's what I did\nThat we can buy your way and you got to make a decision\nWhen you go through as an entertainer so\nWe're getting the market and the checkout girls\nKind of things are getting better\nFind work and now it's a loaded and move out of jail de\n... has been there in a suburb of\nDi di\nA feeling a little\nI got a job they do the other\n... New York in Palo Alto for better\nBaby together you mean by that kind of sad thing going on when they get back on the bus driver\nThat's enough you could die when he's got to make a decision\nLeaves and not living dad\n...\nThere's a barn song I learned in Utah County\nHow long he\nWas not the law\n\nUnder current\n\n\n\n[noise]\n[noise]\nOr a movie or [noise]\nSo [noise]\nYou know one of the [noise]\nAlong the way they do drugs on the list\nEdge of you\n[noise]\n[noise] [noise]\n... in the long run [noise]\n\nYou know the the [noise]\n\n[noise] well [noise] I don't know about that was\nNa\nNa na white man man a white man\nOne\nIn my mind that er [noise]\nI like man we're in an online\nMan\nA bird and jam\nNo no I'm actually on\nThe are the\nOriented and\nCarry on for\nLine man man on the line man street\nThose are at a man on the map the\nMan right\nWho I Am Pedro\nCarry a new one for\nWhy you man living in a white man ...\n...\n\nStill have but I don't know why\nMaybe by ... girls I\nLittle girls that\n\nI mean just imagine ...\nTrio\nShe\nShe's the\nHow to do\n\nYou do me\nA ...\nYear old man they the main\nAnd he was\nA was a hot dry\nIn this man or\nA a ... a bill\nIn\n[noise]\n[noise]\n\nDo we draw money [noise]\nGod a name\n... [noise]\nUh yeah they\n\nCalled me and uh\n[noise] I have made it a hot\nA\nMan in the mail man\nA man a\nBlack guy you know\n\n[noise] Hi I'm\nThat they\nDo and\nNot a chance to see the\n[noise] na na na na da da\nDa da da da da da da da da\n\nDa da\nDum la da dum cha [noise] du\nDa da\nDa da\nDa da\n\n\nDa da da da da\nDa\nDa da da da da da\nDa da da\nDa\nDa de da de\n\n\n\nLa scene too oh let's say [noise]\n\nHere to Baltimore age ... well before the\nTop man where they try\nAnd go down and then\nWe could have a\nA [noise]\nA\nA ...\nA\n... a a\nThen you keep your needs\nNeed to keep you on the pay\nMe a\nOr [noise]\n\n\nPoints in the machine from really just a year's hope Iran under current Patricia sneaking it will be the Grateful Dead there high time from working ranch dad and it was ... when you're watching an incredible stream\nSmoke it's under current term great if you just joined just welcome first date kid on the way\nAnd we're going to ... ... ... ...\nShe can do but then they can eat them in the ...\n... ... ... to ... yeah well that's good to meet the ... the ...\nThe Glenn ... gets going they deem and ... ... ... ... ... ... ... and the um [noise]\nLet me just so you know they're\nBut what are the boys while and then again there was\nThere isn't [noise] you don't smell it and they tell you what it's done in the [noise] I think for a gun\nBut didn't they didn't know that in a gym for a month and then I Know that you\nShe and put in there that\nWe're at eighty nine point by them changing the a drink Williams Ninety point when I found ... press get Ninety point seven FM cage easy cake king met in Ninety One point three of them like staff\nSunny skies today in Kingman highs reaching up to eighty three leader in the day northeast ones around six miles per hour blowing into the evening with clear skies Loeb around fifty five in Prescott sunny sky today high switching up to Seventy six mostly in the evening but the love around forty six and a light variable wind\nIn Flagstaff sunny skies hide your Seventy what the calm when throughout the day most of the clear in the evening with all over I'm thirty eight and you must sunny skies hydrogen up to Ninety five most declaring the evening with a low of around sixty six\n\nOh writing to turn to currents I'm Greg McGregor welcome music from where do you love was on the way\nJoni Mitchell rate for the riff raff Oregon star real tricky with John mail in the booze breakers but first here's Arthur Rock argue electrified undercurrents [noise]\n[noise]\n\n\n\nThink your bar\n\n\nFor a man on\nBy a problem\nYou're\n\n[noise]\n[noise] [noise]\n\nAnd you\nWe have here\n\nIt well no no no no no no no I can go now to drive around on\nIt you know\nUnder ... ...\nNa\nNa na\nKnow oh\n\nI mean yeah\n\n\n\nGood to be [noise]\n\nYo\nYo yo how\nYoung you know and how\nYo yo way home black cool dry\nYo yo yo yo yo yo yo yo Yo Ma way\nOnly\nReal\nTo\n\nYo yo yo\nYo yo yo\nYo yo yo my whole way too\nThey did know only the\nYou know the yo\nYo yo\n\nThe the the pay\nI'm sure it'll turn\nCan\nWorry about\nJerry Maguire\nOne man\nGiant I'm\nOne\nGuy\n\n[noise]\n\n\n\n\n[noise]\n[laughter]\nHi this is arrogant start and you're listening to under current sometimes they're Native American music on here to stay\n[laughter]\nWe just next I mean they're [laughter]\nWhether the ...\n... thousands serve\n\nLot\nWhen I was loving bird\n\nWould I Do do\nYou stay in the next to\n\nAgo where a lot no\n\n\n\nOne of many characters she plays in her one woman show where she did oh\nMaybe a decade ago either way\nOne of many characters she plays in her one woman show where she did\nYou know maybe a decade ago in LA um the ... yeah that was the name of the name of the album came out as well\n[laughter] how would you call it the original cast recording of one yeah and we're going to start baby you're the best and it was a river ... began band poor into ... and ... for the riff raff hungry ghost\nFrom the navigator ... with us it's under control if you just tuned in welcome I'm Greg\nGreatly swimmers on the way and\nYou know it's kind of ironic really think about it now the blues\nRose up in the U.S yet it took a bunch of Brits which students to the blues to teach us about it so you know however you get the get their right and this is a big teacher for me for a lot of people and the students in his band he always recruits\nYoung up and coming June ... his band and it's told me it was a some kid named Eric Clapton\n... and John Dean and\nMix we weren't\nWe would not drive ring a bell anywhere here they are with oh you're up [noise]\n\n\nNah [noise]\nNa\nNa\n\n\nEighty nine point five FM kj the age ... Williams Ninety point one FM Jay Jay Z the Prescott Ninety eight point seven ... kj decay Kingman Ninety One point three of them in Flagstaff\nSunny skies and humid today highest reaching up to Ninety four some comparable wins will be blowing throughout the evening with mostly these guys in the lower around sixty three degrees tonight in Yuma sunny skies a hind you're Ninety five today some call northeast wins it will be blowing throughout the day was mostly clear skies in the evening and all over the around sixty six\n[laughter] let's let's let's [laughter]\nAll right it's under current some great McGregor hello welcome glad to hear some fantastic music coming up this hour we'll just keep it a secret okay we'll just see what happens let it flow but now the genders to get it going [noise]\n\n\n\n\n[noise]\n[noise]\nWe do [laughter] [noise]\nI can [noise]\n[noise] um\n[noise] they change\nIn any way you know [noise]\n[noise] change\nAnd [noise] and [noise] there are many they are not gun control\n\nIn the news and\nHow did you come home and they're not going to be convicted like God thank\nGod am I trying to make\n\nChange in\n[noise] and\nAh [noise]\n\nI have\n\nOf the things that they did manage the money is not even\nA year and a ...\nAs I understand yeah today\nThen my mom to lower\nThat lives on making such\nA\n[noise] a person to\nDo [noise] you know these are you getting this\n[noise]\nYou can rent a lot of a new home [laughter]\nYou know what I'm saying is look [noise]\nChain na\nNa\nNa na na na\nEl ...\n\nWall do stuff but I did not win\n\n\n\nMm Mm Mm Mm Mm I\nChange do you need\nDream that you give me a car\n...\nActors the bone\n\nDon't you know and\nGot to build a bomb in the ...\nMy na na na na na\nIn Sana'a\nAnd\nTime\nWell I don't know\n[noise] you\nPlan I die\n\nDoctor\n\nHands on\nWith them on the\nNa na na\nNa na na na\n\nWell some of them [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\nDo me any excuse me I watch it\nI Need you\nAnd get me\nBack and read to kill me\nBecause I Need you to be the day\nI'm On a day\nThat\nI Need you\nDo me\nOn man who\nDid you do not\nThe\n\nTake my call me and my\nGoes out there that\nMe\nFeel really\nThings that\n\nYou the\nDa da\nHe sees\nFrom Rob I'm playing chess where she\nCovers the number of songs made famous on chess records like that old son 'til about some rescue me the least look grow on undercurrents\nFrom Egypt Station Paul McCartney back in Brazil and it was mark offer good on you son who's new went down the road wherever it's under current and if you just tuned in welcome I'm Greg the stones I had\nThe news you know from carrying more from his album when I write this is the title track\nMm\nA right\nWing in the morning\nMom in a city or a\nAnd try to copy\nKnocked out around\nEarly on man\nNo I live in ...\nThe morning\nWell right\nMom then\nUh the Iraq\nIn the morning and\nThat's when Iraq\nThey called me\nNo no\n[noise] [noise] [noise]\nTo me yes da de\nDa\nKnow what the right or\nHe should do while\nSure what it was all\nThe law but I'm saying\nWell\nThen there is a strange I have to say\nLoan\nReally care at all\nNo meaning in da da da de\nNinety seven FM kj the cake Kingman and then you one point three of them Flagstaff\nSunny skies and humid today has reaching up to Ninety five but the north east wind blowing throughout the day mostly clear in the evening with a ... sixty six in Parker sunny skies today hydrogen up to Ninety four was calm variable wins throughout the day most of the Clinton the evening with a lower around sixty three thanks for listening\n[noise]\n\n\nAll right it's under current time Greg make vicar welcome music from universal speakers on the way been Le Pen testing agree till she Austin and this is lake street dive\nI'm not calling about the economy was amount on how those that don't want to do that around what these\nGuys are you in a minute you want to\nDate my dad\n\n\nI got the last debate and I wasn't that long ago when I saw the guy\nThat um you know the women in Indiana oh my goodness [noise]\n\n[noise]\n\n\nMain thing is the pain\n\nThe\nMan\nHe\nBritain did need to be\nNice to\nMoney\n\nKnow\nKnow Joe blow up the\nMay\n\nDo you\nDo [laughter]\nWell what do you\nDo\nCan you\nDo\n\n[noise]\n... [noise]\nFrom\nThe time she really was [noise] she is she is nice you go on strike for two or\nGames [noise] I mean the whole story\nGang mainly pool boy\nDid you see house just to come in Rochester, Minnesota [laughter]\n\n\n\n\n\nWere going\nTo start\nSo I found\nBeen a\nShot and then you might be called the\nBoise is a shock to the U.S\n[laughter]\n\n\n\n\nYeah yeah\n\n...\nIn chief and the ...\nWe\n\nKnow\n[noise]\nLet them\nWe dont\nKnow\n\nNa na richer\n\n[noise]\n\n\n[noise]\nHey to\nThough [noise]\n\n\n\n\nThat we\nIt's a very playful new album from police who took foster yeah when the time when everything's so heavy it's nice to hear something sweet in light\n\n\nHas children already using\nTake me Kathleen\n\n\nReady to use the\nThe bed\n\nGym\nHe\nThe in the years and years when the\nWow it sounds so good that she often was sure\nFrom fight like a woman from skin maybe of lakes swimming strike a pose for the big lever boy with a Barbie and it was him GMT junior for little dark age we're doing\nFor the big league with boy with a Barbie and it was him GMT ... for little dark age we're doing our little renaissance cheer musically graduate that should be just to to welcome I'm Greg\nIt's got to the Florida is on the way and we're going to cast your mind back down to two thousand five the album prairie where this is Neil you're ...\nWe go\nA ball on the issues the more\nWas ...\n... ... the back\n...\n...\nI work at eighty nine point five FM K. J. C. H. ... Ninety One F. M. K. J. C. P. prince get Ninety point seven F. M. K. J. C. kicking meant in Ninety One point three at them\nLike staff sunny skies and humid today has reaching up to Ninety four some comparable wins will be blowing throughout the evening was mostly clear skies and the local around sixty three degrees tonight\nAnd you must sunny skies behind your Ninety five today some call northeast went to be blowing throughout the day was mostly clear skies in the evening and a low of around sixty six\n[noise] [noise] [noise] [noise] [noise]\n\nOutrageous with the current agreement vicar welcome to music coming out from the Grateful Dead why was it keeps the Cold War the ... word here on we're going to get started now were great what from Nineteen eighty seven this is Tracy Chapman's [noise] Mm\nI wanted to get to where I'm really making the\nBaby together we can get some where can I tell you but I'm\nStarting from zero got nothing to maybe we'll make a very good\nTeam I had nothing to lose\nA plan to get us out of here in New York and now that can be um\nManaged to say it's a little bit of money won't have the job you know I'm\nThe border and into the city you know I can get jobs\nBy the way they live at\nWith the bottle that's the way it is said buddies who\nA lot of TV I'm living like in my mind went off in less than ... than we do use a day to day care right here in\nSchool that's what I did\nWe could live where you go to make a decision I'm\nWe go through the data ourselves\nWe're getting the market and the check out the\nTurn of the things we did better\nDo you go through the data so\nWork in the market and the check out the turn of the things that are\nWork you know get the loaded and move out of the show the\nDynamic of health and then in a suburb\nA feeling that a long\nA painting by the\nI got a job they allow them\nNew York the New York does not go far better\nBaby together you would need by you know they've got no standing when they get back to ... ...\nPast and they'll see you could die away he's got to make a decision that\nLeads to nine eleven died\n\nThere's a barn song I learned in Utah\nHow long do you\nHer but not the law\n\nUnder current\n\n[noise]\n[noise] [noise]\nOr the or [noise]\nThe people\nThat you don't want to see that [noise] [noise]\nOh no no don't tread on me\nThe Internet or you\nBecause those words\n\nLive in Long Island [noise]\n\n[noise]\n\n[noise] I don't know about that was\nWise man why\n\nBetter\nAm I mean I'm ...\nA white man in an online\nMan I Am\nOkay and Bernard na na\nNa na na na mealtime\nYour comment about the R D you know they say\nA field where you know\nCharity and one for\nOne man living on a white man stream\nMan on the map the\nOr on the prairie or brown\nShe and I never been want to go\nNow you hear another lab manager\nWrong Cary one or a turban\nWhite man living in a white man's nation on\nI think Joe Millionaire stairs must\n\nStill have said but I don't know why\nMaybe it's the ... girl that I\nMaybe a little by little girls that\n\nHe I\nMean just imagine ... ... ...\nHe\nMeans magic\n\nShe knows\nShe's in the\nHow to you know\n\nYou know I mean we do\nKnow a\nYoung man they the main\nBill ... he was\nA was a man a hot dry and\nThis man or\nA a\nA girl\nA a\nA pill\n\n[noise]\n\n\nDo we know money [noise]\nUh the\nName ... [noise]\nNow they're saying\nThe money\nNo doubt I mean uh\n[noise]\nI have been hard uh\nIn in\nThe mail man\nOn a on a a\nBlack guy no [noise]\nI'm\nTo me I\nKnow will\nDie I came to the ...\nNa na na na na da da da da\nDa da da da da da da\n\nDa da\nDum la da dum cha and [noise]\nTo go on to be in\nThe [noise]\nThe dogs the\nBall\n... was\nCollege and one day\n[noise]\nPack to charge a lot ah the\nTeam in the mail man da\nDa\nDa de da de\n\n\n... the civil shit [noise]\n\nHere in Baltimore age ... well before the top\nMan\n\nAs well\nWell\n\nWell how do\nWe could have a a [noise]\n\nA ...\nA\n... a little\nWhen you keep you on the pay and you can go to\nWe are a\nOr [noise] or\n[noise]\nTowards the machine for really just a U.S hope you're on the undercurrents Patricia sneaking it will be the Grateful Dead there high tolerance for working man's death and it was ... when you're watching an incredible stream smoke it's undercurrents I'm Greg ...\nDo you manage dad and it was why was it was election day an incredible stream smoke it's under current so great if you just joined us welcome first date kid on the way and we're going to ... ... ...\nShe can but ... thank you need them and it was\nKind of guy you are really getting money maybe I'll look it up there just sick yeah little kids so much so do we actually met at the end of ...\nThat took place in the ... ... ... ... ... ... ... ... and he um [noise]\nWhen we lead us on the ship you never\nWhat would make a good thing to fly than that then you don't smell it and they tell you that led up but it may not be put a gun ...\nNothing because I live in a gym for a minute I Know that in\nThe ... but in\nWe also broadcast on the Arizona community radio network at eighty nine point five I stand cage Jay Z a drink Williams Ninety point one that same Jay Jay Z Prescott Ninety points ... K. J. D. J. Kingman and Ninety One point three FM black stuff\nSunny skies and humid today highest reaching up to Ninety five but the north east wind blowing throughout the day mostly clear in the evening with a lower rounds sixty six in ... sunny skies today has reaching up to Ninety four was calm variable when throughout the day most of the clear in the evening with a low of around sixty three thanks for listening [noise]\n\nOh right it's undercurrents I'm Greg McGregor welcome music from Lydia love was on the way Joni Mitchell rate for the riff raff arrogance star\nTrek human John mail and the blues breakers but first here's Arthur Rock argue electrified undercurrents [noise]\n[noise]\n\n\n\n[noise]\nBad job in\nTry to get by\nThat we're\n\nBeen around\nFor a job man on\nOn the dial dial\n\n[noise] [noise] [noise]\n\nAnd you\nWe have a good thing\n\nWell I Want to go over there now\nNo no no no no no no no no\nNo I don't know man\nUnder ...\nI'm\nUm no\n\nSay no\nI mean yeah\n\n\n\nTo be yeah\n\nYoung boys on\nYo yo yo\nYo Yo's homeland to try\nYo yo yo yo yo yo Yo Ma humble\nYo yo yo\nYo yo\nTo do\nYo yo yo\nYo yo\nYo yo yo my home where\nLike the\nWay to\nAnd yo yo\nYo yo\nYo yo\n\nThe ...\nI'm sure all time\nWhen I came\nWorry about\nDuring the war\nOne\nGuy\nOne guy\nA\n\n\n\n[noise]\n[laughter]\nHi this is arrogant start and you're listening to under current sometimes are Native American musical and here to say [laughter]\nWe just next to them in their\n... or ...\n\nDo\nMy\nNow we love birds\nKnow\nWould I Do do\n[noise]\n... no\n\n\n\nOne of many characters she plays in her one woman show where she did you know maybe a decade ago\nIn a way or the ... yeah that was the name of the name of the album that came out as well\n[laughter] how would you call them the original cast recording the one yeah and we're going to start baby you're the best and it was a river paintings big damn ban poor into paid an array for the riff raff hungry ghost\nFrom the navigator glad you're with us it's undercurrents if you just tuned in welcome I'm Greg\nGreatly swimmers on the way and\nYou know it's kind of ironic really think about it now the blues\nRose up in the U.S yet it took a bunch of Brits were students from the blues to teach us about it so you know however you get the get their right and this was a big teacher for me for a lot of people and the students in his band he always recruits\nYoung up and coming gel for his band and it's time it was a some kid named Eric Clapton\n... jogging Wii and\nMix we were\nWe were driving a bill anywhere who they are what oh you're up [noise]\n\n\nNa na\nNa na\nNa\n\n", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "27", "locations": [["Arizona", 34.5003, -111.50098], ["Prescott", 34.54002, -112.4685], ["us", 45.99696, -118.49854], ["Egypt", 27.0, 30.0], ["Brazil", -10.0, -55.0], ["Iraq", 33.0, 44.0], ["Prescott", 34.54002, -112.4685], ["Florida", 28.75054, -82.5001], ["Prescott", 34.54002, -112.4685], ["New York", 40.71427, -74.00597], ["Palo Alto", 37.44188, -122.14302], ["Utah County", 40.23384, -111.65853], ["Baltimore", 39.29038, -76.61219], ["Iran", 32.0, 53.0], ["Prescott", 34.54002, -112.4685], ["Oregon", 44.00013, -120.50139], ["LA", 34.052235, -118.243683], ["U.S", 39.828306, -98.5795], ["Yuma", 32.72532, -114.6244], ["Egypt", 27.0, 30.0], ["Brazil", -10.0, -55.0], ["Iraq", 33.0, 44.0], ["Iraq", 33.0, 44.0], ["Indiana", 40.00032, -86.25027], ["Britain", 41.66121, -72.77954], ["Rochester", 43.15478, -77.61556], ["Minnesota", 46.25024, -94.25055], ["U.S", 39.828306, -98.5795], ["Florida", 28.75054, -82.5001], ["New York New York New York", 40.71427, -74.00597], ["Utah", 40.23384, -111.65853], ["Baltimore", 39.29038, -76.61219], ["U.S", 39.828306, -98.5795], ["Arizona", 34.5003, -111.50098], ["Lydia", 41.03061, 24.28153], ["U.S", 39.828306, -98.5795]], "not_found": ["da da da de\nNinety seven FM kj the cake Kingman"], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Prescott", "us", "Prescott", "Florida", "Prescott", "New York", "Palo Alto", "Utah County", "Baltimore", "Prescott", "Oregon", "LA", "U.S", "Yuma", "Indiana", "Britain", "Rochester", "Minnesota", "U.S", "Florida", "New York New York New York", "Utah", "Baltimore", "U.S", "Arizona", "U.S"], "out_country": ["Egypt", "Brazil", "Iraq", "Iran", "Egypt", "Brazil", "Iraq", "Iraq", "Lydia"], "in_state": ["Arizona", "Prescott", "Prescott", "Prescott", "Prescott", "Yuma", "Arizona"], "out_state": ["us", "Egypt", "Brazil", "Iraq", "Florida", "New York", "Palo Alto", "Utah County", "Baltimore", "Iran", "Oregon", "LA", "U.S", "Egypt", "Brazil", "Iraq", "Iraq", "Indiana", "Britain", "Rochester", "Minnesota", "U.S", "Florida", "New York New York New York", "Utah", "Baltimore", "U.S", "Lydia", "U.S"]}, {"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the Arizona community radio network in eighty nine point five and then he Jay Z drink Williams Ninety ... Ninety seven ... cage easy can you can and then you one point three some black\nMostly sunny today in Yuma hides reaching seven degrees come winter up to date\nMust include in the evening with the low around sixty six twenty percent chance of showers in Kingman today mostly sunny a high end you're Seventy three partly cloudy in the evening with the local around fifty three play chance of showers in Prescott today mostly sunny a heightened you're sixty four ten percent chance of showers after midnight most ... forty five\nForty percent chance of showers throughout the day in ... partly sunny a Heinz fifty seven mostly club in the evening with the low around thirty eight\n\nOutrage at some Dickens what can we didn't expect to be ... let's get started\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\nToo much\n[noise]\n...\n...\n[noise] I mean the brand\n\nThe\nFamily on the [noise] they were calling on the\n[noise]\nUm\n\n\n... the the new\n... ... ...\n... ...\n... ... ...\n... ... ...\nNo way they show you\nAbout your\nBaby blue cheese you\nKnow\nA bird ...\n\n[noise]\n\nCan really do\nNeed\nJust give the bronze bra\n\n[noise]\nWas you know they do\n\n\n\nDo you have\n\nYou know\n\n\n\n\n\n...\n...\nYear you\nLive in\nLong\n\n\n[noise]\n\n\n\n\nIs that funny singing along hope so get the kid singing which are on the line sleeps tonight from ... from the subject of the lion king\nSo get the kid singing in the kitchen the lion sleeps tonight from ... am from the soundtrack of the lion king cheap trick when I wake up tomorrow back give it a scarecrow and it was ... from the night sweats with a little honey\nYeah we're we're a little bit of honey on top of the music makes you hope you're enjoying it will take a quick break and come back with Keith ... in just a minute\n\nYeah like the\nNew kids just being you know\nBeing\n\n\n\n\n\n[laughter]\n\n[noise]\n\nSo I'm a girl who\nIn a drive through\nThe ruins all me she learned in the jungle where mom\nI'm going to the drawing jumping on\n\n\nAre you do your driver Jacobs where the girls\nThere wouldn't bring me no no\n\nTurn your your\n\nConstruction but maybe\nA mom creeks\n\n\nWhere I started doing the show\nAre going to be ... bones strong and my mom's current used to\n\n[noise] [noise]\nNot going to die with John John [noise]\nFrank Bank undercurrents take it back to Georgia originally born and raised in Georgia it with his brothers had little group called the rising sun when he was a kid\nIn at age Seventeen he joined the Buddhist reading review as an opening act Frank may take it back to Georgia sisters barrel has a new album out called gold and which are the opening track ghost might be fine and fantastic degree does latest bad guy necessity\n... version from please don't be dead and then that comes from the conversations he had with people around the world is he travels on tour you look back at our country the American\nDream and the American spirit and where we stand for around the world and he teaches headed says please don't be dead end was keep score with old trader from Native American I'm ... now the artist keeps ...\nHave you just joined us welcome it's undercurrents you missed a lot there but there's more on the way so stay with a suitcase Steven still just around the band\nAnd here's a little thing from first date\nIt's still out there but there's more of the way it's a state with security Stephen Stills just around the ban and here's a little things from first day care fit on their last album which is sort of break up about what was it was a little bit too positive\nThey wanted to put it out anyway so they put a piece called tender a free for ... ...\n... ...\nNine miles to be read in Moline here in ... now there's no ... no\nNo I'm a man ... no ... not ... by\n... ... ... that\n... was that na\nMayor to mom\n... and ...\nAnd a bomb in\nIraq\nThat I\n\nThink he'd be on\nShow again ...\nNa na\nMeal brown\nVe this un\nNinety point seven FM J. D. C. K. king then in Ninety One point three FM Flagstaff\nIn Kingman there's a chance of showers and the highest Seventy four today with east north east when seven miles per hour denied mostly clear lows around fifty five that's going to have the chance of showers in Ohio sixty six today partly cloudy tonight with the low forty seven\nIn Flagstaff a chance of showers eyes a fifty nine today and a chance of showers in a low forties tonight in Yuma sunny eyes near eighty eight degrees and some night\nPartly cloudy lows around sixty seven\n\nOh right it's under current some great McGregor welcome who lived through music coming up I'm feeling good hope you're feeling good clarity no coming up new young the December and here's fastball\n[noise]\n[noise]\n\n\n\nAmerican music [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\nOh no no no no no no well I Know all along the\nWay the economy\nTalk to you\nWell you know being on the rain seeping my God I don't know\nWhy can't\nWe got on to\nTon of\n[noise]\n[noise]\nOh [noise]\n\nThe\nTo\n\nI'm Sorry\n\nSorry\nAbout that one\nWe cut out how to\nKnow not to\nLady [noise]\nThat was the\nLead the money\nThey can do\nKeep\nIn mind and\nWill be we [noise]\nI Will be we will be\nWe we\nWill be we will be reading\nA will be the need\nBe really the\nOnly reason he made\nThe the ...\n\n\n\n[noise]\n\n[noise]\nOh\n\nI Know what's right and I could break glass in saying that do go back to you know go\nTo the ... the ... the book in part\nNo how ocean and then\nMe you know I'm not saying\nA stranger and they come down and turn it into\nMom today [noise] [noise]\n\nOn that I mean let's say that again\n\nOn that later today and\nSay oh\n\nOh\nMm\nMm\nMm\nMm\nMm\nSo\nI saw you know\nSo we count\nPlace to do or what\nYours is\nMan's mind body and share is that\n... arms\nCache landing at ... [noise]\nWhere are we are in Iraq on nearly I'll do my\nSean ... your\nCelebrities\nSo far fewer dream\nShowing all\nSo ...\n\n\n... with monster from anyone ... my current nova electric before that communicated with the right one and for that let me say both from her new album grenades cater\nIt's under current some great the December is coming up in just a minute\nYou can hear border radio Thirteen twenty am on the radio at at at download the app and sell it and so like Kay oh let's say as your favorite station border\nRadio it's supported by president he'll Brewing Company a locally owned a restaurant and craft brewery on main street in humans historic downtown and an atmosphere which embraces humans history and rich cultures locals and travelers are welcome to enjoy some time in prison hills custody along with a wide range of menu options and craft beers more on President he'll brewing on Facebook\nIn Prescott there's a chance of showers in Ohio sixty six with south when five to ten miles per hour today tomorrow chance of showers eyes near sixty Six Flags tap chance of showers eyes near fifty nine today tomorrow chance of showers eyes near fifty eight\n\n\n\n\n\n\nMember of the dog to\nScreen do by lemon retreat he yeah he was the quick answer\nAbove the lady who pray in the book but you\nIt's going to be under the sun and the most\nThe grants fresh caught they brought him to be remembered\nWoman\nDay was not the like he was cooking the day\nYou want to know what happened is is it\nYou want to do on a business is it is a there's a hunters ... them to look forward to this cat is going to get to create a new scanner mango is so smooth smoother than they do they do go to like jump up to the ... main rebel [noise]\nThat's on the ground eastern conflict\nEither way he was born\nHe's cutting ...\n...\n\nThat's a new one down the road wherever mark Raul flare but under current you may know him from dire straits good on you so\nMuch for red hot chili peppers with snow ... before that we remembered Jim boy wouldn't the dam goes away and it was the December is with calamity saw have you just joined us welcome to undercurrents I'm Craig trigger you to start here and here's the music from middle ...\n[noise]\n\n\nThe early ... [noise] some ...\n... the ... ... ... ... ... ...\nWell ... ...\n\n\n\n\n\nWe also broadcast on the Arizona community radio network at eighty nine point five FM cage Jay Z a drink one of them's Ninety point one FM kj deep deep Prescott Ninety point seven FM kj ... cake Kingman and Ninety One point three FM Flagstaff\nIn Yuma sunny today with the highest eighty eight degrees south east wind five miles per hour tonight partly cloudy those around sixty seven king that has a chance of showers in a high up Seventy or today\nMostly clear tonight with the low at fifty five in Prescott there's a chance of showers in a high of sixty six today tonight partly cloudy those around forty seven\nKing Flagstaff chance of showers eyes near fifty nine today chance of showers and a low a forty tonight\n\nAlready the tundra currents I'm Greg vicar welcome to operate in the movie some terrific music we have ... from angel snow Ravi were Merrill Florence in the machine and this one from Michelle in alone I think girls\n[noise]\nOh\nIf I look\nAt the new Jim I'm picking up in\nThe new law\nWill not be oh those\nShows\nThe other\nChance to write down really\nThat time so\n\nMight be a good\nTo\nFan of right yeah\nLie [laughter]\nEngaged\n\n[laughter] when you think you\nKnow the well the degree that just a different job [laughter]\nOh no\n\n\n[noise] she\n\nYour\nView\nThe other [laughter]\nThe world a better career\nYou know there are\nDraw up the father man I've been to a bar that that\nShould come\nTo\nThe tone my dumb won't you call ... ...\n... you know my son don't you come to come\n\n[noise] [noise]\n[noise] oh\nThis is angel snow you're listening to under current American music with a passport\n\n[noise]\n[noise]\n...\nUh\nAn hour and a\nAction is not going to\nTry the view\nNow to the ... came to\n...\n... and you know the\nNa\nNa\nNa\nNa\nReally need this in the ...\n...\nDidn't they just\nLook in the you\nTeach good ...\nKnow I'm\nSaying to na\nNa\nNo\nThe na\nNa na\nNa\n\nNon aligned Mm [noise]\n[noise] [noise]\nA\nSo far so\n\n[noise]\n[noise]\n\n[laughter] well [noise] [noise]\n\nAnd you'll know ...\n...\n...\n...\n...\n...\n... ...\n... ... ... ... ... ...\n... against the job\nI Do that on some of it you\nKnow to\nSay why are you going to be ... ... ... ... ... no no not\n\n\n\n\nReally\nLong long ... ... ...\n...\n\n\n\n... ... [noise] Mm Mm\nMm\nMy friends\n... ... ... ...\n...\n...\n... ...\n... ... ...\n... ...\n...\n... ...\n... through the\n...\nThe ball rolling or\n[noise] well ... ... ...\nMm\nMm Mm Mm Mm\n\n\nPaying 'em ...\nKnow we\n[noise]\nWe the only man\nLaundry day the\nFounder change wrong\nBe well\nNo he ... and\nTold me it would be the ...\nJob um\nHe\nYeah they\n\n\nA a um\n\nAre going to start to creep people wind up her two thousand one that really holds up let's talk swell made keep on living arrogant star Charles ... Williams altogether angel ... branching guarded\nAnd it was Rob you were born on the rash\nFor pretty joined the music and just to new ... ... ... ... can you hear from the ... if you remember first here's Florence and mushy [noise]\nWhen you keep you on the couch and you can go\nWe are a\n\nA or a\n\nWe also broadcast on the Arizona community radio network eighty nine point five FM McKay Jay Z a drink Williams Ninety point one F. M. K. J. C. P. Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three FM Flagstaff\nIn Kingman there's a chance of showers in a high up Seventy four today with east north east when seven miles per hour\nTonight mostly clear lows around fifty five that's going to have the chance of showers in a high up sixty six today partly cloudy tonight with the low forty seven\nIn Flagstaff a chance of showers eyes of fifty nine today and a chance of showers and a low a forty tonight in Yuma sunny eyes near eighty eight degrees and some night partly cloudy lows around sixty seven\n\nAlright it's under current some great victory welcome watching music here for you hope you'll stick around gets my little green coming up from the new one yo la Tengo Jason is ... ... and right now he's back [noise]\n\nWhen she was a little\nBut in a\nDogs\nSomething to a ...\nFace to face\n[noise]\nSmoke would smile [noise]\nBlood slow [noise]\n\nYou know the student body president cat then those are the things you do begin training do that it didn't tolerate in and teach it is\nAnd school too damn thing I like the book\nThe in the happy\nProbably ended um oh Judy\nEvery one\n\nI'm not I'm calling because I Do non and blow into somebody with me your cold or a problem with John and let me go down in ... now\nIt and then a lot of them on it\nHarried Lorena every last one that started doing\n\n\nDo\nDo you think that you\nBe mean to me\n\n\nThrough cancer the chemo and my God my hair but I have to do a balancing yet but\nHe knows me taking pictures and those movies I mean they do take things you do do do you go to a man and like in the real Janet Reno the pretty girls or not\nBe no balmy takes pictures and movies we need to take pictures not ... says all men are like to look at girls and Kenny knows the pretty girls are dying\nDid you think that we make these we take big choose not to go home and I like to get any no that's pretty good day\nTo do in a while and I\nThat I'm happy with him I joined to connect me\n[noise] [noise] [noise]\nOh I\n\nThey let me read below\nWhile we're\nOrders\nOnly bring the mom and\nMove into the ... then you know\nNow\nThey are to leave them\nIn law says\nOh man I Know\nWe use\nLeave it alone you\nKnow\nDan beer again while\nHis line around time or\nThe key issue in our\nLeave Spain\nNow they can add\nMachine\nLike in the linen no yeah\nOh go\nGo go go\n\nMm oh\nWhoa whoa\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa whoa\nWhoa whoa whoa whoa whoa\nWhoa\nThat's a\n\n\nGood\n\nDay to day\nYou\n\nDuring\n\nThe\n\nThey had the sweet and then\nThen they can do\nTo change the whole the\nThing is that\nWe do\nThis day\nShe was sweet\n\n\nOkay so let's see\n\nTo me\nNo way home\nDo we really you know no\nWe're much thank you so\n\nBut er you're on a rock and roll electric charge [noise]\nYou know hard on the bay [noise]\nOn the drone [noise]\nI don't know [noise]\n[noise]\n[noise] [noise] [noise]\nDon't know about the\nLaw I Know right Mm\nMm Mm Mm when they grow up in the\nShowed\nUp for\nBelieve to change it is ... ...\nMy ...\nThat so you\nNice day here when\n\nDi\n\nNa\nI Am Dianne\nTo the suit and\nNa\n\n... curious sound isn't that right there that I think we spoke multi instrumentalist electric car the\n... to cheer juice from Israel and the four hundred years before that was flying over water from his wife just like the Ryman in ... we have a lot or someone very similar from their real popular socks I came out almost a decade ago\nHe gets undercurrents I'm Greg and if you just change your welcome costing me scared become part of your choice track for most levels first choose a trio\nA terrific singer's ... heroes Sharon Watkins has he done they call themselves with her\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nMm\nNo no I'm a\n... no\n...\nDo\n\nWe stay\nOff\nAnd then they did and she\nGosh\nDarn and you know\nNa\n\nHe\nGoes\nWe also broadcast on the Islamic community radio network at eighty nine point five ... kj easy a drink Williams Ninety point one Afghan cage Jay Z peep Prescott Ninety point seven Afghan Jay Jay Z cake Kingman and Ninety One point three FM ...\nIn ... sunny today with the high in eighty eight degrees south east when five miles per hour tonight partly cloudy lows around sixty seven\nKingman has a chance of showers in a high in Seventy four today mostly clear tonight with the lowest fifty five\nIn Prescott there's a chance of showers in a high up sixty six today tonight partly cloudy those around forty seven king Flagstaff chance of showers eyes near fifty nine today chance of showers in a low a forty tonight\n\nOutrageous undercurrents welcome we've been expecting you to money and let's get started [noise]\n\n[noise] [noise]\n\n\n\n[noise]\nAn rush\nLittle too\nMean the branding\n\nSaying about\nAll the others [noise] never gone\nThe ...\n\n\n\n\n... the the new\nNo ... ... ... ... ... ...\n...\n... ... ... ... ... ... ...\nI knew where you'd be so we are all\n... ...\nAbout your\nBaby ...\n... ... nine\nA bird ...\n... ...\n[noise]\nA good reason to believe\n...\nJust can't be from Burma\nBut\n[noise] [noise]\n\n\n\n\nThe ages\n\nCheese\nThat either you know\n\nNa na na\n\n\nShe was\nYeah you know and\nSay you're lying to\n\nDidn't\n[noise]\n\n[noise]\n[noise] [noise]\n\n\nIsn't that funny singing along I Hope so get the kids singing in the kitchen the lion sleeps tonight from legal him from the subject of the lion king she track when I wake up tomorrow Becky the scarecrow and there was nothing left in the night sweats with a little honey\nYeah we're we're a little bit of honey on top of the music makes year hope you're enjoying it will take a quick break and come back with Keith ... in just a minute\nIn the ... the in the end\nAnd the man she\n\nNa\nI don't\n\n\n[laughter]\n[noise]\n\n\nWell no girls who\nIn a dry\nRun me she's burned in the dark hole where ma\nYour son or your on your\n\n\nOr you do your driver Jacobs where does the girl\nThere wouldn't bring you know\nTurn on your on your\n[noise]\nThe structure of the border in the\nOf God pink slips\n\n\nWhere else started a new way you know\nAre going to be a key bones strong and my mom's current year's coolest\nYou\n[noise] you're\nNot going to get back to Georgia\n\nFrank banging on the currents take it back to Georgia originally born and raised in Georgia where there's ... there's that little group called the rising sun when he was a kid and at age Seventeen he joined the Buddhist writings have you as an opening act Frank Bank\nMy son when he was a kid getting at age Seventeen he joined the\nBuddhist reading of you as an opening act Frank Bank take it back to Georgia sisters barrel has a new album out called gold and whatever the opening track ghost mighty fine and fantastic degree does latest bad guy necessity\n... person from please don't be dead and then when it comes from the conversations he tried to most people around the world is he travels on tour you look back at our country the American\nDream and the American spirit and where we stand for around the world and he says his head and says please don't be dead animals keep score with old trader from Native American or snobby artist keeps ...\nHave you just joined us welcome it's undercurrents you missed a lot there but there's more on the way so stay with us okay Stephen still just around the band\nAnd here's a little thing from first they didn't feel under last album which was sort of a breakup albums who's a little bit too positive\nBut they wanted to put it out anyway so they put out an e P called tinder a free for ... an auditor\nMm Mm Mm\nNo I'm ...\nI'm a ... no ...\nNo ...\nThat\nMeans nano ... back\nThere to mom\nKneeling na na na na\nNa na na\n\nNa\n\nNa thinking behind in\nLewis no one can mount\n... na na\nMeal around", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "22", "locations": [["Arizona", 34.5003, -111.50098], ["Yuma", 32.72532, -114.6244], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["Moline", 22.96667, -82.3], ["Iraq", 33.0, 44.0], ["Ohio", 40.25034, -83.00018], ["Iraq", 33.0, 44.0], ["Ohio", 40.25034, -83.00018], ["Arizona", 34.5003, -111.50098], ["Prescott Arizona", 34.54002, -112.4685], ["Spain", 40.0, -4.0], ["Israel", 31.5, 34.75], ["Burma", 21.0, 96.0], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999]], "not_found": [], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Yuma", "Prescott", "Ohio", "Ohio", "Arizona", "Prescott Arizona"], "out_country": ["Kingman", "Georgia", "Georgia", "Georgia", "Moline", "Iraq", "Iraq", "Spain", "Israel", "Burma", "Georgia", "Georgia", "Georgia", "Georgia"], "in_state": ["Arizona", "Yuma", "Prescott", "Arizona", "Prescott Arizona"], "out_state": ["Kingman", "Georgia", "Georgia", "Georgia", "Moline", "Iraq", "Ohio", "Iraq", "Ohio", "Spain", "Israel", "Burma", "Georgia", "Georgia", "Georgia", "Georgia"]}, {"month": "10", "state": "AZ", "station": "KOFA", "content": "\nBroadcasting from the campus of Arizona western college does its border radio Thirteen twenty am Kayla the you might end born and radio dot org\nWe also broadcasts an Arizona community radio network at eighty nine point five FM cagey C H ... Williams Ninety One FM cage ACP prince get Ninety point seven FM cagey seeking men in Ninety One point three at them like staff\nMostly sunny in Kingman today hind you're sixty eight bit windy out there was some northeast winds up seven to search him up for our\nPartly cloudy in the evening with a lower I'm forty eight there's a slight chance of showers throughout the day in Prescott today it was sunny skies and hide your fifty eight partly cloudy in the evening with a low rent thirty nine thirty percent chance of showers before noon in Flagstaff a partly sunny skies hind you're forty six the chance of showers slightly decrease in the evening with partly cloudy skies in the low rent thirty two\nIn the sunny skies were behind your eighty one partly cloudy with a low rent sixty two\n\nIt's ... like I said I'm here with you with some great music lined up for this next hour we'll hear from Madison dream Paul McCartney has a new album that started out with a favorite one from arcade fire\n[noise]\nSome\nPeople be the\nSort of a\n\nCame from a man [noise]\nThe no no the\nKids taking the man is\nThe Shia gray with ... ... is the you\nAnd they came and gray\nRandy in this shack whose views\nAnd\nA\n...\nShip and on\n\n[noise]\n... I Know why ...\nWhy mole\nNo jail while he\nAround the any team in in New\nIn in ...\n\nMe and said it would to me to\nSaying we'll be me me\n\n\nIt is he has said it would to me\nAm the main street and then\n... ... ... ...\n...\nBreach the bottom of the\n...\nAnd you just can buy a new way\nTo jam a\n... ... ...\n...\n... to know the last ...\n... by\nDoing well you know put on which to\nA barrel\nDa\nNo\nA\n\nUm\n\nAh in\nYou know oh no not enough\n\n[noise] oh my God\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa [noise]\nBut above all day but I Do\nThat ...\nThat the judge in the well the two\nMain\nFriends up in\nThe bill\nUm and a half broach new\n...\nThat the judge in the book the\nMan to man\nRandom in\nThe middle\n[noise]\n\nThen\nAnd you get down\nJohn McCain\nMy dad and my\n\nBoat in\nBed\nA good job with the bone in terms of the barrel while the real man go bad law I'm sure the guy to a hell of a star with his grandpa Bernie in that dark but you want to do it but there is a big hot ...\nThink it'd be you know it\nGoes I don't believe that not many then and now the goal but we're going to be on the bad lamb\nOr you leave the ... like the Georgia in the dark on a board of ... in the bar is the man and a little bit on the law does not like you know\nBut you\nLot of liquor here about a lot\nJob I had um\nOr you get to see the ... like Georgia and the dog gone and still do particularly you pay a little bit by some of the market you know you remember\nLiquor here that he got a lot\nCapitol Hill is trying to buy had I'm a I'm going to\n\nWin in ...\nIn their good O. J. lo\nWas overjoyed to\nTry\nAnd jump on\nThe ... the the two things are the\nFrom\nThe\nWhy stay on the other way or the man leading the\nWay you did have\nWas bad\nIt um do we like to\nGo with\nCoral job to do\nTo protect the\n[noise]\nChance to catch a game that he did he go again in the world that can can then they\nBuilding the ... the Federal Reserve left\nAnd then to go\nIn San Diego\nAmy lived there with him cats down it was punch brothers with jumbo and Paul McCartney gave us a new song off his new album each station despite repeated warning it's undercurrents I'm Kathy\nLohr rain and the Caesar around the corner but first years hating Sayers with with the foster\n\nNo sense and they don't ...\nYour ... when\nLive down you were raised\n... and ... live down you were raised and a\nJust send the gay marriage than the teachers are paid laid down you read\nAnd\nTrying to calm\nYou know my turn to the ...\nDown you were\nBreaking the law\nLay down you were\n\nIt and you\nO lo\nLo o lay down your own were raised\nLike Jerry in law\nLay down you were rich\n\n\nFood and still be a\nOoh\n[noise]\n\nThis is border radio care what they do much Thirteen twenty am and voter radio easy dot org ... western college we also broadcast on the Arizona community radio network at eighty nine point five FM kj the age ... Williams\nNinety point one FM Jay Jay Z the Prescott Ninety point seven FM Jay Jay's UK Kingman Ninety One point three of them in Flagstaff\nMostly sunny in Kingman today hind you're sixty eight a bit windy up there with the north east winds up seven to search him out\nI pay ... Thirteen twenty am and voter radio ... dot org ... western college we also broadcast on the Arizona community radio network at eighty nine point five FM kj the age ... Williams\nNinety point one F. M. J. J. D. V. Prescott Ninety point seven ... kj decay Kingman Ninety One point three a famine Flagstaff\nMostly sunny in Kingman today a high and you're sixty eight a bit windy out there with the north east winds up seven to Thirteen miles per hour\nPartly cloudy in the evening with the Loeb around forty eight there's a slight chance of showers throughout the day in Prescott today was sunny skies and hide your fifty eight partly cloudy in the evening with a lower I'm thirty nine thirty percent chance of showers before noon in ... partly sunny skies behind your forty six the chance of showers slightly decrease in the evening with partly cloudy skies in the lower I'm thirty two\nIn your state sunny skies were behind your eighty one partly cloudy with a low rent sixty two\n\nIt sounded ... got to be like after nine here with you but you need some great music for the next hour that I picked out we'll hear from Robert Allen to smithereens and steep for Bert let's start out with an indie rock group from Duluth, Minnesota here it's low on under current [noise]\n\nYeah that is you know\nDon't know\nMan\n\nNa na na na\nNa na\nMan 'cause\nI'm at the end of my row\nNa\nJohn I came out for\nNo\nI'm not one to me in\nOn the line I'm\nI'm\n\nDon't know ah they\n\nNa na na\nNa\nUh\nA\n... since ...\nSee nothing but a ...\n\nThe ... for\nThem to live in a way to get wherever I\nGo and they get just a\nA\nOn a\nNo\nNo\nWhen I was younger\nSo much for them to the\nLiving room and then by then and\nNow these things are not so sure\nNow I'm fond of change my mind\n\nA will know when I'm watching\nA really around doing some damage long mine they\nWere but\nWould not need to be in my view is marine move to be here\nOr ... when you're walking along\nA really do some damage in long ... ...\n\nWar may man did\nYou very much for me either read the ball\nNeed\nCrazy\n\n...\n\n...\n\n\nNa\n\nNa and\nAnd ...\nNa\nAnd he [noise] [noise]\n[noise]\nYour [noise]\n\n\n\n\n\n\n[noise]\n[noise] Hi this is Joanne Shenandoah and you're listening to undercurrents American music with a passport\nTo\nGo to\nJoe you may be the way in which you had in\nWater [noise] do glue\nAnd legs you\nKnow run a dog or the mom used to be you know ...\n... and John withdraw um [noise]\nWell ...\n\nYeah no no oh no\nYou know God\nOh no\nI was ... a ...\nA\n... you know I'm a\nI'm a\nYou do you do the we would have been\nAnd they [noise]\nThey do\nEasy no on\nUm\nDid you do your thing to do the wheat in Japan\nAnd they\nThe gate to want\nHear that the law\nWhich you're on the\nI'm Glad I\nOh God you know\nA a a\nOh a\nA lot I uh uh uh\nAh [noise]\n\n\nDid you do you believe in what you had\nNear the ...\nAnd lay\nEight to walk the ...\nYear to beat up on her\n\nOh yeah oh\nKnow I'm a I'm\nA I'm a\nLie is a dollar\n[noise]\nOh\nKnow I'm a I'm a I'm going\nOh\nNo oh no\nYou mean when they were oh ... I live in a\nLong you know [noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\nThat's wax Taylor featuring leaf feels on this song road is rough Nico case gave us last line of Albion\nBrigitte ... formerly of lake street dive gave us serenity and it was the smithereens with it don't come easy you're listening to undo currents and if you're just joining us welcome\nHere's a new one from Steve for bird he grew up in Mississippi and then moved to the big city to pursue his music he just published his memoir in which he reflects on the specific circumstances that brought him into the public guy here's Steve for Bert on undercurrents [noise]\n... that is the\nThis is\nThe\nAnd the guy here's Steve for Bert on under current [noise]\nMinisters are the things\nThis has been rat\nRace because it is\nRemember that Susan my name is too\nI mean\n\nAnd buddy Miller you're listening to undercurrents American music with a passport ...\nStill right\nZone right\n\nA ...\n\nMe they\nLive a ...\nThings were listening to pay at ... Thirteen twenty or Yemen and border radio easy dot org service of Arizona west in college we also broadcast on the Arizona community radio network at eighty nine point five at them K. J. D. A. Drake Williams Ninety ... cage easy you Prescott\nAny point seven F. M. K. Jay Z cake Kingman and Ninety One point three of them like a\nSlight chance of showers in Prescott throughout the day was sunny skies behind you're fifty eight partly cloudy in the evening a low rent thirty nine in Kingman mostly sunny a high and you're sixty eight some northeast winds up seven to Thirteen miles per hour partly cloudy in the evening with the low rent forty eight that when will die down just a bit\nThirty percent chance of showers in Flagstaff today partly sunny a high near forty six partly cloudy in the evening with the low rent thirty two and a slightly less chance of showers\nIn you must sunny skies with behind your eighty one partly cloudy in the evening with the low up around sixty two degrees\n\nIt's either ... got to be like I said I'm here with you with some great music lined up for you Courtney Barnett encouraged by al lean down I knew one from rape Bonneville and more that start out with optical na\nMan man\n\n\nIt is to me a\n\n\nI Do like\nOh this is Joe craven and you're listening under current\n\n\nBeep\nYou think's occurred\nHe takes you make\nIn the end they may have to take you know they can they can they do and\nYou know they need\nTo make you know it takes more than maybe the way they can they can ... di di di\nDi\nDi\nDi do do they can do\nTo make the um\nMade you were ... they said that there was a guy\nDi di\nDi di di\nDi di di\nDi di di ... yards\nTake them all the main goal that you know\nThe the\nBig ball to\nSee whether\nThey take those to make sure they did the on the\nNews in the book and I don't\nNeed to\n\n\nDo\n\nYou know\n\nIt takes to make\nThe thanks so what do they can go and make you make\nGood night for\nDid\n\nDid and [noise]\n\n\nDuring the\n\nSay three years is the\n... in\nAnswer\n\n\n[noise]\n[noise]\n\nOkay oh\n\nSay can you know in the car and they just made\nMe so he will\n[noise]\n\n[noise]\nThe same thing in\nThe ... he\nShe may [noise] [noise]\nThings in\nThe means to\n\n\n\n\n\n\nAnd\nKnow [noise]\n... ... ... ... [laughter] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\nDo you wish\nFrom green [noise]\nOkay [noise]\nYou know [noise]\n\n\n\nTo do much [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\nSo the law ...\nLaw for a\n\nNa\n... ...\n\nMindy misinterpret the Beatles the word Tom Petty give us keep a little soul from here\n[noise] no\n\nMindy Smith interprets the Beatles the word Tom Petty gave us keep a little soul from his and American treasure box set from two thousand Eighteen\nAnd re Bonneville has a new album out at king electric and we heard until such a day from that album and we heard legally danced with ... which means it's important\nYou're listening to a new currency and if you're just joining us welcome here's a new one from Mike Ferris\nAnd then the\nWe you\n[noise]\n\nBut we'll let you go in and\n\n\n\nBroadcasting from the campus of Arizona western college has its border radio Thirteen twenty am Kayla the you my ... radio easy dot org\nWe also broadcasts an Arizona community radio network at eighty nine point five FM K. J. C. H. ... Williams Ninety One FM cage ACP Prescott Ninety point seven F. M. K. Jaycee kicking men in Ninety One point three ethane Flagstaff\nSlight chance of showers in Prescott throughout the day was sunny skies behind you're fifty eight partly cloudy in the evening all around thirty nine in Kingman mostly sunny a hind you're sixty eight some northeast winds up seven to Thirteen miles per hour partly cloudy in the evening with the low around forty eight that when will die down just a bit thirty\nPercent chance of showers in Flagstaff today partly sunny a high and you're forty six partly cloudy in the evening with the low around thirty two and a slightly less chance of showers you must sunny skies were behind your eighty one partly cloudy in the evening with the low up around sixty two degrees\n\nIt sounded kind it's got to be like I said I'm here with you got some great music lined up for this next hour including me to spend big red machine Amos Lee and father John misty\nLet's start out with a band from Provo, Utah here the national parks with this on the creeps up on\n\n[noise]\n\nWhat would your perfect day\nLet's find out there was a hot air balloon\nBoy reasonably [noise]\nMess we filed a way by how do you agree\n'cause to me that\nSaw [noise]\nWhat can I say\nI mean you might be who we're forced me to play there\nWill be fine I Know how they're going\n\nContinue or read\n\n[noise]\n\nHe\n[noise]\nSome people\nThe street and\nSee Tennessee can now I'm\nFan them clean the planet in season ...\nThis ... this ...\nRight now no\nThe same man from\nThe ashes camp stove\nPlanets dinner scene you can say that's ...\n\n\n\nJust saying I don't\nSmall band\n\nHey this is real wolf child and you're listening to undercurrent\nIt's me one kid speech was like you\n\n... like in the\n\n...\nGame losing\nDid June no\nRead in the big man\nNa\nWe weren't\n\nHey this is Mark Matney ... also known as Nadia one on under current American music with a passport [laughter]\n[noise] [noise]\nHey this is mark ... also known as Nadia one on under current American music with a passport\n\n\nKnees ah\nIt a little deny deny deny deny deny deny well\nOh my God I'm no\nAccount they still this is on money go\nWinning goal\nI Know that how can they grow\nThere don't\nDrive could really say you must\nDo than nine oh two than I\nDo then I was in a way\nThrough the night do then I\nMisspoke so fast\n\n[laughter]\nHey is Trombone Shorty thanks will listen to on the current American music what a passport\n\n[noise]\n\n\n\n\nAnd um\n[noise]\nWhen we can learn\n\nKnow did you\nYou're kidding me [noise]\nWhen we can\nNo\nPromise to\nI\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\nTo\nWhat a great one from Trombone Shorty that's long weekend in front of that is easy ward gave us a domino it with a new one from father John misty date night and Peter ... and ... meant give us meditation song\nIt's undercurrents I'm going to be a lot and if you're just just\n\n\nWhat a great one from Trombone Shorty that's long weekend in front of that the the war give us a domino he's with the new one from father John misty date night and Peter ... and ... meant give us meditation song\nIt's undercurrents I'm guilty of that and if you're just joining us welcome here's Kerry rose ... and the Sacred Heart on under current\nIt'll then breath again and they never did\nNow tell well mama took me to do I get that get a\n... bad or when you're older you learn\nLater ... my hand don't ask me what like like\nMom then went\nWell let alone\nMeet with the world\n\nBroadcasting from the campus of Arizona western college this is border radio at Thirteen twenty am ... and border radio easy dot org\nWe also broadcast in Arizona community radio network at eighty nine point five FM K Jay Z a drink Williams Ninety point one F. M. K. J. C. P. press get maybe point seven app M. K. J. C. K. Kingman and Ninety One point three FM in Flagstaff\nIn Yuma sunny today in a high in eighty degrees north northeast when ten miles per hour tonight clear those around sixty four Kingman mostly sunny ice near sixty nine today mostly clear tonight with the low of forty six that's going to have sunny skies in a high a fifty nine today\nAnd tonight mostly clear those around thirty eight in Flagstaff the chance of rain and high at forty six today it's a night in Flagstaff partly cloudy those around thirty one\n\nYou tend to ... here we ... we can create music lined up for the next hour well here from Madison dream Paul McCartney has a new album let's start out with a ... arcade fire\n[noise]\nSo we have\nPeople be telling me they can't\nSo\n[noise]\nMonthly\nBe people be easily me they can't\nFrom a man to nudge people\nThe\nCage mate is\nWith job they hate him and he you\nWas making gray\nSunday during the ship Louis XIV you'd\n\nAnd\nWhen he\n[noise]\nOld were you\n\nTo a\n\n[noise]\nWell I Know there was no ...\nNo ...\nNo one knew me\nAround the any team in\nIn in the same way\nBe entertained and had\n\nAt me and said it would to me ...\nLet me ask you and me I mean\nThat the\n\nAs you said it would be\nAm the main\nStreet and then\n... ... ...\n...\nWhen you reach the bottom of the\n...\nTo jam a\nOn our Web ...\nTo ...\n... to know the last ...\nTo buy and\nMe to walk in a song which too\nA year now\nA\nUh\n\nI'm\n\nAh in\nWord you know oh my God oh my\n\nGod\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa [noise]\nA bottle thing but John ... due to\n...\nThat the judge in the ... the\nBill but the main\nRent some in\nThe bill\n[noise]\n[noise]\n\nThen\n\n... bumping\nKnow\nIn\nTrue\nTo me the radio network that eighty nine point five ... Ben ... Williams Ninety point one FM Jay Jay Z pie Prescott Ninety point seven FM kj ... Ninety One point three of them in Flagstaff\nAnd you love sunny today in a high eighty degrees north northeast when ten miles per hour tonight clear those around sixty four he mostly Saudi ... near sixty nine today mostly clear tonight with the lowest forty six that's going to have sunny skies in Ohio fifty nine today\nAnd tonight mostly clear lows around thirty eight in Flagstaff a chance of rain and high at forty six today it's a night in Flagstaff partly cloudy those around thirty one\n\nIt's ... ... do you like us to nine here with you with concrete music lined up for you Courtney Barnett incurred by all lead let down a new one from ray Bonneville and more that start out with a cool [laughter]\nNa man\n...\n\n\nOh this is Joe craving and you're listening under current\n\n\n\nShakes occurred to me and she takes it to make\nThe change in Baghdad may guy has to take and then they can they didn't know where do you\nTake stock you can\nGet an admission it takes more demand you said some good and they found that there is di\nDi di do do you\nHave to make it do\nThey tell you make your\nLong to make a big\nThing in the\nBig people in\nThe news was that\nIt takes to make sure they can take all the\nTime you do that and I don't\nNeed to do\n\n\nAnd\n\nYou know\n\nIt takes to make\nIt takes just so fast\n\nIt takes\nTakes well did\nThey make you may go down\nIt did but the night you know\nHe did but\n\nI don't know [noise]\n[noise] well\n[noise] Mm\nMm\nDuring the\nWe didn't\n\n\n\n\n\n[noise]\n\n\nLow pay and\nSay you know I'm thinking maybe he will\nA\nWhile and\nWe [noise]\nThe the\n\n\n\n\nYou\n\nAnd\nKnow [noise]\n[noise] [noise] ... [laughter] [noise]\n[noise] [noise] [noise]\n\n\nA you know we\nDo you wish\nFrom green [noise]\nChanged oh can you\nTo be you know [noise]\n\n\n\nJust to watch [noise]\nMuch of the day\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\nFrom your dreams\n\nDidn't we [noise]\nFrom your [noise]\n\n\nWe're in the\nCar on\nNa na\nThe\n\nMindy Smith interprets the Beatles the word Tom Petty give us keep a little salt from his and American treasure box set from two thousand Eighteen\nAnd re Bonneville has a new album out at king electric and we heard until such a date from that album and we heard Leila downs with okay which means it's important\nYou're listening to under current and if you're just joining us welcome here's a new one from Mike Ferris [noise]\nYou\nSo we used to clean\n\n\nWill miss the golden ball and\n[noise]\n\n\n\nNinety point seven ... men in Ninety One point three at them like staff\nIn Kingman mostly sunny today with the highest sixty nine east north east wind eleven miles per hour but I mostly clear those around forty six\nPrescott sunny hiking you're fifty nine today it's a night mostly clear laws around thirty eight in Flagstaff a chance of rain and high uh forty six today partly cloudy tonight lows around thirty one Yuma sunny ice near eighty degrees\nAnd tonight clear with the low around sixty four\n\nIt sounded kind it's got to be like a lot here with you got some great music lined up for this next hour including me to spend big red machine Amos Lee and father John misty\nLet's start out with a band from Provo, Utah here at the national parks with his son they create [noise]\n\n[noise]\nOh it's perfect day\n\nLet's find out there on the hot air balloon\nBoy ... [noise]\n... ... ... ... do you agree\n'cause you can read or heard\nSaw the [noise]\nWhat can I say\nI mean you might be we're forced me to play there are really the [noise]\nWe'll be fine Hi no hot air balloon\n\nYou are from Sweet Honey [noise]\nPhony [noise]\n...\n\n[noise]\nSome people\nThe street as\nSee tennis see can now I'm\nAdams fan and increase the printed in the season none of us from\nThe ... ...\nRight now not\nBusy man I don't find\nAs his campaign stove\nPlanets then they'll see you can say that\n\n\nJust said [noise]\nStraw\n\n[noise] hey this is the real world of child and you're listening to undercurrent\nIt's to me one kids which was ... like you\nDa ding\nDid you know\nRead in a big man\n[noise] [noise]\nHey this is mark ... also known as Nadia one on under current American music with a passport [laughter]\n\n\nThe ah\nAccount the field is somebody go\nWinning goal\nI Know that I can only role\nThere and\nSay you must\nDo then nine oh two didn't know he\nDoes then I was in a day\nTo day night oh Dylan my\nBaseball so fast\n\n\nHey is Trombone Shorty thanks will listen to on the Korean American music with a passport\n\n\nThank\n\n\n\nAnd um\nYour hobby\n[noise]\nWe can start you\n\nKnow just go\nThink\nStand up\nI don't\n[noise]\n\nOoh\n\n\n\n\n\n[noise]\n\n\nWhat a great one from Trombone Shorty that's long weekend in front of that is easy ward gave us a domino he'd with a new one from father John misty date night and Peter ... and ... meant give us meditation song\nIt's under current I'm guilty of that and if you're just joining us welcome here's Kerry rose ... and the Sacred Heart on under current\nIt'll then bread again it mattered and\nMen honky tonk well led mama mia though I gave it a\nBad\nYou're older you learn\nYour land my hand don't ask me what my\nMom went to the doctor or you\nWell let alone\nMe there was", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "17", "locations": [["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["San Diego", 32.71571, -117.16472], ["Arizona", 34.5003, -111.50098], ["UK", 3.51342, -132.1875], ["Kingman", 6.4, -162.399], ["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Minnesota", 46.25024, -94.25055], ["Japan", 35.68536, 139.75309], ["Mississippi", 32.75041, -89.75036], ["Yemen", 15.5, 47.5], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Prescott", 34.54002, -112.4685], ["Kingman", 6.4, -162.399], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Prescott", 34.54002, -112.4685], ["Kingman", 6.4, -162.399], ["Provo Utah", 40.23384, -111.65853], ["Tennessee", 35.75035, -86.25027], ["Nadia", 23.25, 88.5], ["Nadia", 23.25, 88.5], ["Knees", 45.9375, 21.04056], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Ohio", 40.25034, -83.00018], ["Baghdad", 33.34058, 44.40088], ["Provo Utah", 40.23384, -111.65853], ["Nadia", 23.25, 88.5]], "not_found": [], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Arizona", "Prescott", "San Diego", "Arizona", "Arizona", "Prescott", "Minnesota", "Mississippi", "Arizona", "Arizona", "Prescott", "Arizona", "Arizona", "Prescott", "Provo Utah", "Tennessee", "Arizona", "Arizona", "Ohio", "Provo Utah"], "out_country": ["Kingman", "Georgia", "Georgia", "UK", "Kingman", "Kingman", "Japan", "Yemen", "Kingman", "Kingman", "Nadia", "Nadia", "Knees", "Kingman", "Baghdad", "Nadia"], "in_state": ["Arizona", "Arizona", "Prescott", "Arizona", "Arizona", "Prescott", "Arizona", "Arizona", "Prescott", "Arizona", "Arizona", "Prescott", "Arizona", "Arizona"], "out_state": ["Kingman", "Georgia", "Georgia", "San Diego", "UK", "Kingman", "Kingman", "Minnesota", "Japan", "Mississippi", "Yemen", "Kingman", "Kingman", "Provo Utah", "Tennessee", "Nadia", "Nadia", "Knees", "Kingman", "Ohio", "Baghdad", "Provo Utah", "Nadia"]}, {"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the Arizona community radio network at eighty nine point five FM cage Jay Z a drink while in Ninety One FM kj deep deep Prescott Ninety point seven FM kj the cake Kingman and Ninety One point three FM black stuff\nSunny skies in Kingman today some north winds up tend to Thirteen miles per hour in hives reaching up to Seventy one degrees Chris guys in the evening of the Loeb around forty nine and east north east wind up a weapon to Thirteen miles per hour\nSunny skies in Prescott today on your sixty three mostly clear in the evening the Loeb around forty degrees mostly sunny in Flagstaff behind your fifty one mostly clear in the evening with Loeb around thirty one sunny skies in your mind you're eighty five some north north east Windsor ten miles per hour there's guys in the evening with a low up around sixty five\n\nAlright it's undercurrents Greg here it's a pleasure to be with you I've been thinking about some music I think you're going to love for mark Reba Jefferson Starship artist monkeys\nAnd this from birds streets betting on the side\nSay the least\n[noise]\n[noise]\n\n\n\nShould lie\n\nAnd age\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\nJob\nTo\nI mean oh no no no we didn't\nIn the way the ministry\nI\n\nAnd\nI can\nI guess\nFish than I care\nCat and\nI\nGo as we can\nGo to this is weird Fernandez with two and a peace well from the nominee they soldiers dollar hundreds girls from Austin, Texas\nHi I'm ... I got all of a famous Carlos I'm from Los ... what was the rural and you're listening to undergrad under under\nYou know\nRude or whether it's\n\nUm ... the ... the ... the man who lack mom\nNow for ...\nGoal lead paint on me and my\n\nMe I'm\n... de ...\nDe Gaulle them turned me or a\nWould say the\n[noise] you\nAround to cater\nIt ain't so complicated\nTo\nPick up rather he follows in\nWell let's see there is a health plan\nHave gone to lead them to be around\n... we're around\nThem a mayor\nGoing to build a brand new novel why\n\nAnd get all of them turned us round featuring Steve Earle says merit smart rebuild from his new album songs resist a nice\nDidn't get all of them turn this round featuring Steve relative merits Marjorie both from his new album songs of resistance Nineteen forty two here on the curbs retirees with the uh\nI was gonna say the eagles but really it's gone handily piece that he did on ... and Mickey Free Cherokee blues man angels in the room\nIt's under current on Craig Richard really thrilled to be with you and I were going to enjoy the music of Kuwait Marty balance of the Jefferson Starship just sitting here playing\nCrossed over recently and lift behind some really beautiful work that's coming up in just a minute\nBroadcasting from the campus of Arizona western college this is border radio Thirteen twenty ATM K O F ... and border radio easy dot org\nWe also broadcast on the Arizona community radio network eighty nine point five FM McKay Jay Z a drink Williams Ninety point one F. M. K. J. C. P. Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three of them Flagstaff\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\nOn the easiest to come on\nGo up in class [noise]\nYour [noise]\nYour income\nIn general\nStrange connection [noise]\nDue to expire\n\nYour exercise\n[noise]\n[laughter]\nJust tell you that the coronary so that some of the parents out there to say hey kids\nI was in the ATM way back in the day\nBefore everybody craft or work with trans Europe express remember that one yeah right with taste and it was ... percent starship Marty balance on vocals and he wrote this aren't as well as some other really\nProfoundly beautiful Web socks like coming back to me today from surrealistic go\nRight down\nHere they just joined just welcome inside the currents Andre ... wrecker indigenous on the way and this is Rick and get\nWere you also broadcast on the I was on a community radio network at eighty nine point five asked them cage Jay Z a drink Williams Ninety point one F. M. K. Jay Z peep Prescott Ninety point seven Afghan kj ... gate Kingman and then you one point three FM jak staff\nSunny skies in Kingman today some north wins of tend to Thirteen miles per hour in highs reaching up to Seventy one degrees clears guys in the evening of the Loeb around forty nine in east north east wind of eleven to Thirteen miles per hour\nSunny skies in Prescott today on your sixty three mostly clear in the evening a love around forty degrees mostly sunny in Flagstaff behind your fifty one mostly clear in the evening with Loeb around thirty one sunny skies in Yuma hind you're eighty five some north northeast winds of ten miles per hour clears guys in the evening with a blow up around sixty five\n\nAlright it's under currency everybody welcome got best girl athlete on the way vocal sampling from Cooper Fred Segal Smith Kurt Vile and just to collect the mixture music coming up so I Hope you'll stick around and use it or otherwise known as the cat Stevens here right now with gold digger [noise]\nThen it's the gold man\n... go man\nNot one more day [noise]\nHave you here and I chose because I [noise]\n\nPut ... sees [noise] find myself a job\n\nCome and John unions who\nChanges\nStreet and every\n\n[noise]\n[noise]\n\nFar would\nLook very into\nFrom the number one\nBull because there was a ...\nOr ...\nFor because there wasn't no\nFeeling in last chance to build a bowl of alone or watch by will start\nOr two when will the sons we bomb\nThere in the air within the ... so\nPeach peach peach\nPeach peach peach peach [noise]\nThe [noise]\nOne\nWill come back to ... you\n\nAll the pages\nTime when\n\n[noise] [noise]\nSaying no\nMatter\nLong\n\n\nMm\n... ...\nYou know gone\nAnd they were\nGoing to\nOn ...\n\nAgain in\n[noise]\nFew years back down\n... the head\nTo you and your job hunting down\nYears you might\nSunshine a pill\n\nAhead\n\nNot feel that we\nAbout\nBurner\nA gun or a\nModel of no matter what you're going out to own a gun on what I mean do not like we're no longer than the younger you are and what he made up their up among them on\nAnd on and so on but I don't care about them and they came up with the man to man\nWoman when they come back again but you know\nOh no no no no no no I was going on a game when the man I mean those are\nAre are in a\n\nHigh ... we're sitting here listening to under current\n\n\n\n\n\nGood\nRye shooter and that will go by with each other they succeed the\nFrom the Grammy Award winning album mambo senior window recorded\nIn Havana\nAnd there was an American pop June but just cheaper catchy and beautiful commute Kobe though with ...\nAnd even though there was all over the airwaves especially in places like\nMiami ... when I was in my hotel room in Vancouver with my little tiny radio came on the local station\nJust going to show that that to waste sharing is still going on musically these undercurrents wish and music from\nColorado America and around the world in both directions that's why we call it American music with a passport was it from the Native American nations back and forth with everybody lots of crossing influences\nGot a group of Canadians with one Native American covered up the band and lay down trolling most of what this is a good one in fact it's finger licking gr\nMm Mm Mm Mm [noise] Mm [noise]\n[noise] [noise]\nNah\nThinking licking good\nWe also broadcast on the Arizona community radio network at eighty nine point five FM cage eighty eight drink Williams Ninety point one ... you'd be Prescott and he points to have an FM ... came in and they one point three ... black stuff\nSunny skies today in your mind you're eighty five degrees but the north northeast when around ten miles per hour clear in the evening with a low brown sixty five and came in today's sunny behind you're Seventy one some north winds up tend to Thirteen miles per hour clears guys in the evening of low around forty nine with an east north east window eleven to Thirteen miles per hour\nSunny skies in Prescott today I'm sixty three mostly clear in the evening a low around forty degrees mostly sunny and flexed after the highest reaching up to fifty one degrees mostly clearing the evening with a low around thirty one\n\nArrangements undercurrents I'm Greg McBride go hey what's going on ... new music from Mumford and sons coming your way for the John misty Tim O'Brien and let's go back for years now to this one from joined arbitrary\nThe ... I Know\nIn my home\n\nAnd he'd call me ... ... [noise]\nThem that do you know\nAnd you called me ... ... people\nOf shame mom can pull\nBe shame on my mom I\nTelling you what do you feel\nI'll never good you\nThe don't\nDon't go\nCan and we\nDon't\nWant to get\nWhen\nOn there and he loves gentleman bring you\nCan drive you wouldn't have known\nRead on the ...\nIn my bed I'm On\nI'm no good cheap\nAlabama's good she\nOn there but you know the\nBut you don't mind I\nCan\n\n\nWay\nI Want to see when the noon days I'm looking right I Want to be when the debt I'm not even that this is Don and\nNo\nAnd you\n\n[noise]\n\nYeah well that low\nSay\n\n\nKnow ... ...\nBut I Do feel\nThe ...\nWell no\nSorry man I'm\n...\nMm Mm Mm\nMm\n\n[noise] [noise]\nNo no no\nBeing treated\nAnd I'm a\nWhat I got\nAh [laughter] [noise]\nYeah well you\nKnow the na\nNa na na na na na na na the um\n[noise]\n[noise]\nDo do\nI Will do bomb on the\nLot of money on\nIt so I'm I'm aware that\nLittle we know how\nA job to bomb the ...\nYou know I Try\nSome ... ...\nTo ...\nScapegoat plays there during the ... the\nDream for me\nThe ...\n...\n... who are getting a loan for\nThen my mind\nThe late ... early ah and and\nThe theater yeah she\nThat's being played the jury\n\nMain na\nWell I'm just\nWell I'm just\nWas banned from their graves\n\n\nOur lawn lawn and how long\nHow long how long\nWant to know how\nWash the gone gone gone up\nTo make the same day I Want to know when you dig up that you were in your brother's day you\nThat you talk about these\nPeople because Tommy burrow\nGoing on and be God is not that you want to hear\nTaking your gender or either tend to be you know what I Would have to\nChanging that oh I Know that what was that guy\n\n\n\n\nWho wants to go\nKnow a well known as a woman on law no no no no one no one on a lot of the role\nA\nIn any in\n\n\n\nDream you give me\n\nNo ... the\nThe last ... or ... or\nNot they do now in\nThe night to lose ...\nYou think your God there's more to learn a gun but borrowed the money you know my nose and then what\nDo you think you know there's ... joining a new buttoned up or they just so but now she said no no\n... on the ... of them may have been a\nLittle lot of money going up but the main one did just that they're doing a\nLot of ... up but I Do my dad who enters the super bowl the na na\n...\nIn the same day\nA lot that they do not stable job either\nYou know ...\nOr ... or not you\nKnow there's the Bush will give\nMe no good you\nThey could but the the\nUh the big city\nThey're saying no\nMe I could do that either because\nThey like to know how\n...\n...\n...\nEven though you're both\nSaying no no no no no I\nMean the ...\n...\nYou know every country has music that speaks from us so that country in America I'd probably be the blues and enforce it go its Fargo music and that's where that was right there I'm Tony ... with a cassette shot though ... pretty bleak I don't know\nIt's funny it's on the record label ... father John misty before that was the night from God's Favorite customers that's his new album before that from the u._k. was a kilo\nRecently making appearances had the sasquatch festival in Washington and outside lands and San Francisco and he was elected go 'cause I was wondering\nIf you just joined just welcome it's undercurrents I'm Greg and you haven't missed anything there's a lot more music to go from Carter brothers and this from Tim O'Brien with a Bob Dylan song on undercurrents\nThing is broken and\nThis being dumped on ours is\nYeah everything's broken\nYou get a\n... and Robin dog\nVoted off her involved in Maryland\nThing is broke\nJaded and pro game by\nIs the thing is broke\nMm Mm Mm [noise]\nCommunity radio network that eighty nine point five FM ... Williams Ninety point one FM Jay Jay Z pie Prescott Ninety point seven FM Jay Jay Z kicking men at Ninety One point three of them in Flagstaff\nSunny skies today in junior high and you're eighty five degrees but the north northeast when around ten miles per hour we're in the evening with love around sixty five and came in today's sunny behind you're Seventy one some north winds up tend to Thirteen miles per hour there's guys in the evening alone round forty nine with an east north east window eleven to Thirteen miles per hour\nSunny skies in Prescott to the sixty three mostly in the evening Loeb around forty degrees mostly sunny and flex step to the highest reaching up to fifty one degrees mostly clean the evening with low around thirty one\n\nAll right it's under current grid mixture how you doing music from canceling veers ahead my little green the option to Norwood here we are to kick it off right now with an indigenous Australian singer songwriter Emily we're a bar Mm\nOh these sleeping under God still not\nSure exactly you know\n\nTo\nYou know\n\n[noise] be\nThe same God\nThat show the ... um the\nMan in\nMaybe and and then she\n\n\n\n\n\n\n\n[noise]\n\n... good role or cook is a\n\nShow for the ...\nA radical call phone call [noise]\nOut into the young [noise]\nIn leader on talking they [noise]\nThat so they know\nAnd I feel is broken now\nKnow about that all of them\n\n\n\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n... or ...\nOr\n... is the second\n... ...\n\nPublic currently from Egypt Station who cares I Do feel a caterer with invoking the elements from the album ritual and it was ... years with best kept secret\n\nRecorded in New Orleans Ravi robbers story job when he made the album shake this town from the ... people in Mali Africa too narrow way before it after me over my boss of cool and it was seen Hudson believe it or not all that sound just two people\nGeneva is playing bass with all kinds of circuitry on it that doubles and quadrupled the sound and Clinton explain the jobs and singing harmonies see some of the nation\nIn the nation fight like a woman where else are you going to hear that on the radio huh you won't hear it in the mall\nReporting over the speakers there out in the courtyard so we're really glad to be able to share it and everything else we do here with you on a hundred ... thank you for listening and telling your friends about us\nWendy in your support most central voice on the way right now let's turn the music of modern show on undercurrents [noise]\n\nThe\nBomb out what's going on them I Will not by working all the Congo deep down in the journal locked up in a game up as ... and bring a lot to be in my ... and it may go down to England bumble bee the um the Anglo bungled on land to the beat down where their reason a lot of down on the job is to be looking over the ...\nName a boogie pulled it be loving CD but they don't believe crazy when our bank ... under\nRemain calm\nNobody not to be in my business at a legal crazy when I may be on my movie on the ground and losing the doubt downloading a baby on the game of\nDo you mean when a calm sat on the Blount do much to now can reasonably slowly to the mall get game now nobody it'd be game oblivion data me cause nobody go crazy when I'm being being on\nGave me were not thinking oh my lord that's we may know to me so I'll be there's nobody came up listening to me I read on the ground and losing being down the bumblebee it'd be a living from\nFeed me when I come\nBeat me when I\nWas going through mumbled pop out what single ... deep down I mean a ... mouth was long ago it would be a lot to be in my head over me down the king dome little baby I'm Vicky\nDome baby I'm Vicky\nBe an outgoing lately\nHe may not come\nKnow\nMany point seven FM kj the cake Kingman and Ninety One point three of them Flagstaff\nIn Kingman sunny skies and the highest Seventy two with north when eight to fourteen oil for our day\nTo night clear Los around forty nine rescued has sunny skies and the highest sixty three today and clear skies with a lower forty tonight\nIn Flagstaff the chance of showers and hide your fifty three today and I mostly clear lows around thirty one Yuma sunny eyes near eighty five today that tonight clear skies those around sixty five degree\n\nAlright it's undercurrents Greg here it's a pleasure to be with you I can that's amusing I think you're going to love for mark Reba Jefferson Starship Arctic Monkeys and this from birds streets Betty I'm Sorry\nSay the least as\n[noise]\n\n\n\n...\nAnd just do the by\nNa\nVE Day [noise]\n[noise]\nKnow\n\n\n\n\nYou\n\n\nJob\n\n\nI mean not to the law which I didn't know\nDream\nSyria and\nTo a cat\nCan't\n\nI guess\nGet\nCat\n\n\nGo to this is weird Fernandez which you in a piece ... well from would nominate soldier go hundreds girls from Austin, Texas\nAnd anywhere here I got a little suburb of ... what was the rural and you're listening to undergrad under current under\n[laughter] you know\n\n\nUm well the man\n... [laughter] I Do live in Henri around\n\nI'm In a while the ...\nYear round\n[noise]\nSuppose the\nSurvey dream [noise]\nAround the ...\nHere they ...\n\nThey got rather\nHe follows\nWell let's see him play\nHave gone to lead them to be around\nThe jobs we're around\n\nA man\nGoing to be able to know why\nUm\nAnd get all of them turned us round featuring Steve relative merits smart Reba from his new album songs that resistance Nineteen forty two here on under terms the Atari Swiss who yeah\nThat was going to see the eagles but really it's a dog handling piece that he did on civil album and Mickey Free Cherokee blues man angels in the room\nIt's undercurrents I'm Craig McGregor really thrilled to be with you and we're going to enjoy the music of Kuwait Marty balance of the Jefferson Starship jumps in airplane I crossed over recently left behind some really beautiful work that's coming up and just a minute\nYou're attuned to border radio Thirteen twenty am in Yuma and border radio easy daughter we also broadcast on the Arizona community radio network\nHi Abby regional manager at border radio and I think everyone who called during a recent pledge drive if you didn't get a chance to make that call it's not too late you can call eight seven seven eight three eight five to nine to to make your contribution or visit us that border radio easy dot org to make your secure I'm like get every dollar every donation makes a difference so thanks for your support\nOn the table easiest to them or\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\nTrain connection [noise]\nTo [noise]\nTo [noise]\nYour income\n[noise] [laughter]\nJust tell you that it's fun and so that some of the parents out there to say hey kids\nI was in Haiti um way back in the day\nBefore everybody craft or work with trans Europe express remember that one yeah right with taste and it was ... percent starship Mardi balance on vocals and he wrote this aren't as well as some other really\nProfoundly beautiful loves socks like coming back to me today from surrealistic go\nRight down\nHere they just joined just welcome it's under current and Greg with vigor indigenous on the way and this is Vicky in gang\nPaid\nShe\n\nWe also broadcast in Arizona community radio network at eighty nine point five ... the age ... Ninety ... Ninety point seven ... any one point three ... staff\nIn Yuma sunny hides near eighty eight north northeast when ten to Fifteen miles per hour today tonight mostly clear those around sixty eight\n... sunny skies eyes near Seventy seven night mostly clear those around fifty five in Prescott sunny eyes near sixty seven degrees then tonight mostly clear in Prescott with low around forty five\nBlack staffer that sunny skies in a high up fifty five today and tonight the chance of showers and a low around thirty six\n\nAlright it's under currency everybody welcome got best girl athlete on the way vocal sampling from Cooper\nSegal Smith Kurt Vile and just to collect to mix music coming up so I Hope you'll stick around uses or otherwise noticed cat Stevens here right now with gold digger\nIs it coming up so we'll be able to use it or otherwise noticed cat Stevens here right now with gold digger\nMainly to go man\n... to go man\nNot one more day [noise]\n... ...\n\n... ... fine my job to job\nCommon John union's moon\nChanges\n\n[noise]\n\n[noise]\n\nFar away\nI was on the ground\nThe look in training to some\nArmed another war\nFor because there wasn't no\nFeeling in my chest the pill the home alone and um watch by will this time\nOr two when bill the sun revolves\nThere in the year within the soccer field so\n\nTeach teach\nTeens teens teens\nHe he\n\nMoved\n\nShe said\nAnd when\nYou\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nMm Mm\nMm\n\n\n... ... Mm Mm\nMm Mm nine and\nAnd on ...\nMm why\n\n[noise]\n[noise] [noise]\n\nIf you have you back down\nI'll dream would do when the\nDa da da da\nTo you and your job hunting down\nThere are\nDiner brought\nKnow my daughter no matter what you're going out to own a gun on what I mean do not like we're no longer than the younger you are and what he made I mean\nI'm not going to game the man\nMan\nWhen they don't come back again but you know\nOh no no no no no no I don't think she may\nOr may not any more so now those are\nOr in\nA diner\n\nHigh ... we're sitting here listening to under current ...\n\nAmateur\n\n\nThey will\nRye tutor and men will go behind with each other they succeed the from the Grammy Award winning album mambo Sunni window recorded\nIn Havana\nAnd there was an American pop tune just super catchy and beautiful commute Kobe though with a van and even though there was all over the airwaves especially in places like Miami\n... when I was in my hotel room in Vancouver with my little tiny radio Kim on the local station\nJust going to show that that to waste sharing is still going on musically these undercurrents were sharing music from\nColorado America and around the world in both directions that's why we call it American music with a passport was it from the Native American nations back and forth with everybody lots of crossing influences\nGot a group of Canadians when Native American covered up the band and right now Charlie muscle why this is a good one in fact it's finger licking good\nMm Mm Mm Mm Mm [noise]\n[noise]\n\n...\nCollege we also broadcast on the Arizona community radio network at eighty nine point five FM kj the age ... Williams\nNinety point one F. M. K. J. D. V. Prescott Ninety point seven ... kj decay Kingman in Ninety One point three of famine Flagstaff\nToday in Yuma sunny eyes near eighty five north when five to Fifteen miles per hour no clear low around sixty five England sunny skies and the highest Seventy two today clear skies loads of forty nine tonight\nPrescott sunny with a ... near sixty three today and deny clear loves around forty degrees Flagstaff chance of showers eyes near fifty three today tonight mostly clear those around thirty one degree\n\nAlready it's undercurrents I'm Greg McBride ... hey what's going on ... new music from Mumford and sons coming your way father John misty people Brian and let's go back for years now to this one from John arbitrary\nThe ... I Know\nIn ... when my bull\nThem [noise]\nI Need to call me ... all\nMy my bowl\nChange my mind and no\nOne no\nTelling you would use that\nGood ...\nOn them but you\nThey don't\nThe ...\nCan\nGet\nA good\n\nLove Kevin bring you\nCan drive you wouldn't say\nRead me on ...\n\nI'll never get\nAlan Airbus games you\nKnow\nAnd you know ...\nCan let me tell\n\n\nThey can\n\n\nWant to see women doing based on the right I Want to see when the data not even that Donnie ...\nSo\nWhen we come along\nHe he be the [noise]\nThe [noise] the\n[noise]\n[noise] yeah\nWell I don't know\n[noise]\n\n\nNo\n\nThe ...\nWell\nSalary right\n...\n...\n...\n...\n\n[noise] [noise] [noise]\nNo\nCheese\nAnd [noise] um my uh\nWhat I got\nAh [laughter] [noise]\nNa\nNa na\nNa na na na na na\nNa\nNa\nBe [noise]\n...\nLast month\nSo I'm I'm aware but\nJune ... no no\nA job to bomb the ...\nYou do a dry\nJob will will do you\nLooking to\n... ... ... ...\nDreams ...\nNa na\n... ... ...\nWho are getting a loan ...\nUp my mind\nThe late ... I Am and\nYou yeah\nIt all the ah and in the ...\nThey do it yeah yeah\nThat's being played the jury\n\nAnd maintenance man\nThey will not jobs get\nLet's go let's go have surgery\n[noise]\n[noise]\nOur lawn lawn and how long\nHow long how long\nWant to know\nWhat's gone gone\nGone up to make the same day I Want to know when you dig up that you were in the world is saying you\nTalk about that you talk about these\nPeople you got to tell me up roll\nIs gone and we got another and you want it\nTo you and your gender or either tend to be you know I Would\nChanging their own on what was that guy\n\n\n\n\nInto a well known and no one on long I'm no longer a wall and I want to know the girl\nAnd\nMe\nDa\n\n\n\n[noise]\nDream you give me\nA good look the other\nDay but there's millions of the\nBlue blue ...\n... ...\n... they do now in the ninth ...\nThank God the mall the learning gun but on the windows and then\nLike you know there's ... joining a new but the board and they just so but ... ...\n... ... ... ... man but at the\nWho is up but the main when did the ... the\nMeanwhile did just visited wounded in a [noise]\nA little mini gang good but the main one day and then there's this dude wounded na na\n...\nIn the same but then\nThat do not stable skill\nYou need to get\nA ... a\nLot there isn't the boots on the other [noise]\nBeing in the\nMeaning that these\nGuys are the good\nThey're saying we know\nWe could do to them because it is a good number\n...\n...\nNo no no no no I\nMean the ...\n...\nYou know every country has music that speaks from the soil in that country in America probably be the blues and uh in Portugal it's father music and that's what I was right there until ... with a cassette shot though ... pretty bleak out though\nIt's funny it's on the record label feet by ... father John misty before that was the night from God's Favorite customers that's his new album before that from the u._k. was a kilo\nRecently making appearances had the sasquatch festival in Washington and outside lands and San Francisco and it was electric ... wonder about\nIf you just joined us welcoming undercurrents I'm Greg and you haven't missed anything there's a lot more music to come from Carter brothers and this from Tim O'Brien with about doing saw a hundred per se [noise]\nThing is broke and\nThis do that on Mars is\nYeah everything's broken\nGet John\nAnd broken dog\nVoted on her involved with\n... broke\nJaded and bro again about\nYeah thanks bro\n... ... they're all over all\nMany point seven FM cage easy cake Kingman and Ninety One point three of them like staff in\nPrescott sunny with the highest sixty three and northeast when five to seven miles per hour today tomorrow sunny ice near sixty seven degrees Flagstaff has a chance of showers in Iowa fifty three today and tomorrow sunny near fifty five\nIn Kingman sunny icy or Seventy two today sunny tomorrow with a high near Seventy seven degrees Yuma sunny I near eighty five degrees today tomorrow sunny with a high near eighty eight\n\nOh writes undercurrents I've written English or how you doing music from case link veers ahead my little green sea hawks and to know or what have we had to kick it off right now with an indigenous Australian singer songwriter Emily we're Mara Mm\nOh these sleeping under a stern nice to be\nSure that the\n\nYeah\nThe\n\n\nOh these same God\nThat show the that the only\nMan in the\nNavy and and then she ...\nOf the\n\n\n\n\n\n\n\n\n[noise]\n\n... whole group is a\nShow not for the them\nRadical call phone call [noise]\nDown all the young [noise]\nAnd the the um poking day\nWhen it gets them before they know\nAnd I feel is broken now\nAll fall on\nWell\n\n\n[noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n... ... ...\n\nThe east\n[noise]\n\nPublic current news from Egypt Station who cares I Do feel a caterer with invoking the elements from the album ritual and it was ... years with best kept secret\nOh [noise] or\nRecorded in New Orleans Ravi Robert ... story building with the album shake this town from the ... people in Mali Africa to Norway before and after me although my boss of cool and it was seen Huntsman believe it or not all that sound just two people\nGeneva is playing bass with all kinds of circuitry on it it doubles and quadrupled was the sound\nAnd Clinton blamed the jobs\nAnd singing harmonies see Hossam ... nation\nThe name of the nation fight like a woman\nWhere else are you going to hear that on the radio huh you won't hear it in the mall ... over the speakers there out in the courtyard so we're really glad to be able to share it and everything else we do here with you on on your terms and thank you for listening and telling your friends about us\nWendy in your support most central place on the way right now let's turn the music of money on under current events [noise]\n\n\nOut what's going on about what angle the Congo deep down in the journal banking mother's gone away and bring a lot to be in my head I may go down the kingdom bumble bee the um the England bungled on land can be done whether we do not us down to the new people to be a good friend\nNamed Bill Gates will be below ... do the crazy winter ... under [noise]\nYou may not gone\nNobody not to be in my business at a legal pad greedy when maybe ... on the weed out the ground and maybe losing the Dalai Lama game a baby I'm beginning\nAmy when Carl sat on the Blount do my duty now reasonably slowly ... Indians down nobody will be game up all of these data Nicola nobody go crazy when um\nNow that there is no place to go to the market is down knew that they can be came up with these data meat goes no doubt they go crazy when a baby in the um the\n... not ... but\nHe may not go bang boom boom or that is we lead up to me so I think there's nobody came up and it seems to me I read on the ground and losing big down the law bumble bee on the\nMaybe we're not on\nHe may not\nWhat was going through mumbled by ... deep down I mean are generally locked up and not for long ago and bring a lot to be in my ... baby a routine\nBe made when I was going\nA me whether or not\n", "show_name": "UnderCurrents", "year": "2018", "city": "Yuma", "day": "18", "locations": [["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Austin Texas", 30.26715, -97.74306], ["Los", 34.05223, -118.24368], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Yuma", 32.72532, -114.6244], ["Havana", 23.13302, -82.38304], ["Miami", 25.77427, -80.19366], ["Vancouver", 49.24966, -123.11934], ["Arizona", 34.5003, -111.50098], ["Prescott", 34.54002, -112.4685], ["Mumford", 5.26176, -0.75897], ["Alabama", 32.75041, -86.75026], ["America", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["San Francisco", 37.77493, -122.41942], ["Maryland", 39.00039, -76.74997], ["Prescott", 34.54002, -112.4685], ["Egypt", 27.0, 30.0], ["Mali Africa", 18.0, -2.0], ["Geneva", 46.20222, 6.14569], ["Congo", -1.0, 15.5], ["England", 44.0, -71.0], ["Los", 34.05223, -118.24368], ["Syria", 35.0, 38.0], ["Fernandez", -26.83333, -60.5], ["Austin Texas", 30.26715, -97.74306], ["Henri", 44.57216, 26.10218], ["Reba", 17.03667, 37.12639], ["Arizona", 34.5003, -111.50098], ["Haiti", 19.07582, -72.29616], ["Arizona", 34.5003, -111.50098], ["Prescott", 34.54002, -112.4685], ["Prescott", 34.54002, -112.4685], ["Havana", 23.13302, -82.38304], ["Miami", 25.77427, -80.19366], ["Vancouver", 49.24966, -123.11934], ["Arizona", 34.5003, -111.50098], ["England", 44.0, -71.0], ["Mumford", 5.26176, -0.75897], ["America", 39.828306, -98.5795], ["Portugal", 39.6945, -8.13057], ["Washington", 38.89511, -77.03637], ["San Francisco", 37.77493, -122.41942], ["Iowa", 42.00027, -93.50049], ["Egypt", 27.0, 30.0], ["New Orleans", 29.95465, -90.07507], ["Mali Africa", 18.0, -2.0], ["Norway", 62.0, 10.0], ["Geneva", 46.20222, 6.14569], ["Congo", -1.0, 15.5], ["England", 44.0, -71.0]], "not_found": ["New Orleans Ravi"], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Prescott", "Austin Texas", "Los", "Arizona", "Arizona", "Prescott", "Yuma", "Miami", "Arizona", "Prescott", "Alabama", "America", "Washington", "San Francisco", "Maryland", "Prescott", "England", "Los", "Austin Texas", "Arizona", "Arizona", "Prescott", "Prescott", "Miami", "Arizona", "England", "America", "Washington", "San Francisco", "Iowa", "New Orleans", "England"], "out_country": ["Kingman", "Kingman", "Havana", "Vancouver", "Mumford", "Egypt", "Mali Africa", "Geneva", "Congo", "Syria", "Fernandez", "Henri", "Reba", "Haiti", "Havana", "Vancouver", "Mumford", "Portugal", "Egypt", "Mali Africa", "Norway", "Geneva", "Congo"], "in_state": ["Arizona", "Prescott", "Arizona", "Arizona", "Prescott", "Yuma", "Arizona", "Prescott", "Prescott", "Arizona", "Arizona", "Prescott", "Prescott", "Arizona"], "out_state": ["Kingman", "Austin Texas", "Los", "Kingman", "Havana", "Miami", "Vancouver", "Mumford", "Alabama", "America", "Washington", "San Francisco", "Maryland", "Egypt", "Mali Africa", "Geneva", "Congo", "England", "Los", "Syria", "Fernandez", "Austin Texas", "Henri", "Reba", "Haiti", "Havana", "Miami", "Vancouver", "England", "Mumford", "America", "Portugal", "Washington", "San Francisco", "Iowa", "Egypt", "New Orleans", "Mali Africa", "Norway", "Geneva", "Congo", "England"]}]