{"month": "10", "state": "CA", "station": "KEIB", "content": "Best is K. E. I. B. Los Angeles streaming audio patriot dot LA's reinstitute a sports programming occasionally I be evil resumes streaming audio at the conclusion of the game and the\nFastest ... I'd be Los Angeles streaming audio and patriots dot L. A. is preempted do sports programming geeky I'd be will resume streaming audio at the conclusion of the game [noise] fast is K. E. I. B.\nLos Angeles streaming audio at patriot not LA's preempted due to sports programming\nKiki I Believe over still streaming audio at the conclusion of the game [noise] basses K. E. R. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nThe boom boom boom\nBasis K. E. R. I. B. Los Angeles and streaming audio and patriot Donna LA's preempted due to sports programming J E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot L. A. and bring him to do the sports programming and Katie id will resume streaming audio at the conclusion of the game the best is Katie IP Los Angeles streaming audio and patriot dot L. A. preemptive pseudo sports programming\nGeeky id will resume streaming audio at the conclusion of the game and ... says hey I'd be Los Angeles streaming audio at patriot Donna LA's preempted due to sports program a K E R B will resume streaming audio at the conclusion of the game\n[noise] bad is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nTo eat I be evil resumes streaming audio at the conclusion of the game the best is K. E. icy Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio with the conclusion of the game [noise] best is Kay eat I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game the masses K. E. I. B. Los Angeles or streaming audio and patriot dot L. A. is preempted to to sports programming\n... id will resume and streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I'd be Los Angeles streaming audio at patriot data LA's preemptive due to sports programming ... I've evil resume streaming audio at the conclusion of the game\nIn this case I be Los Angeles streaming audio patriot dot ... preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n...\nIs Kay eat I'd be Los Angeles streaming audio ex patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles\nStreaming audio at patriots LA's preempted due to sports programming for GE id will resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles dreaming audio patriot dot L. A. is preemptive due to sports programming ... id will resume and streaming audio at the conclusion of the game\nAnd best is Katie I'd be lost Angeles streaming audio and patriot dot LA's preempted do this for the program a\nK E R B will resume streaming audio and the conclusion of the game fast is K. E. I'd be Los Angeles is dreaming audio and patriots LA's preempted sports programming kinky id will resume streaming audio at the conclusion of the game [noise]\nThis is ... I'd be Los Angeles streaming audio patriot John LA's preempted due to sports programming Kiki ivy evil resumes streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resumes streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\n... be evil resume streaming audio at the conclusion of the game will [noise] bad ... I'd be Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game\nThe\nMan is K. E. I. B. Los Angeles dreaming audio patriot dot LA's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game will pass this case I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\nKatie id evil resumes streaming audio is the conclusion of the game\nBasses may eat I be involved Angela streaming audio patriot jot LA's freedom to do the sports programming K E R B will resume streaming audio at the conclusion of the game best is K. E. I. B. Los Angeles\nStreaming audio patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio and the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio ex patriot data LA's preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the games passes ... I'd be in Los Angeles and streaming audio patriots LA's preempted due to sports programming K. E. R. I. V. evil resumes streaming audio at the conclusion of the game\nAnd then\nThere's ... I'd be Los Angeles dreaming audio patriot dot LA's preempted due to sports programming ... will resume streaming audio at the conclusion of the game\nAnd the best is K. E. I. B. Los Angeles streaming audio and patriot John Elway is preempted due to sports programming\n... be evil resume streaming audio at the conclusion of the game and\nThen this case it I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nThe\nBand is K. E. I. B. Los Angeles dreaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game best is Kate I'd be in Los Angeles streaming audio and patriots dot L. A. is preempted due to sports programming K E R B evil resumes streaming audio at the conclusion of the game\nAnd best is K. E. I. B. Los Angeles and streaming audio patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio and the conclusion of the game\nFast is ... I'd be in Los Angeles streaming audio at patriot dot allies preempted due to sports programming\n... id will resume streaming audio at the conclusion of the game [noise] bad this case the eyepiece or Los Angeles streaming audio at patriot dot L. A. preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game\nIn this case it I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game best is K. E. I. B. Los Angeles\nStreaming audio at patriot dot LA's preemptive pseudo sports programming Katie id will resume streaming audio at the conclusion of the game\nBasses ... I'd be Los Angeles\nAnd streaming audio at patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio as a conclusion of the game for fans is Kay eat I'd be Los Angeles streaming audio patriot dot ... freedom to do the sports programming\nKatie id will resume streaming audio at different ... of the game\nAnd the\nBest is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nPE I be evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be Los Angeles streaming audio patriot dotted LA's preempted do the sports programming geeky id will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles dreaming audio patriots dot L. A. preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "The Rush Limbaugh Show", "year": "2018", "city": "Los Angeles", "day": "07"}