{"month": "10", "state": "AL", "station": "WYDE", "content": "Suffer concussion each year that includes boys and girls every age every type and level of sport\nIsn't always clear that a player has had a concussion so parents athletes and coaches need to learn about concussions science and symptoms the American Academy of neurology recommends athletes thought to have a concussion be immediately removed from place\nAnd not returning until assessed by health care professional trained in concussion this isn't just about sports it's about your brain when in doubt sit it out to learn more at\nA. N. dot com slash concussion that stay and dot com slash concussion a message W YDF em Coleman W. I. D. E. A. M. Birmingham W two or three Seventy ... W D. J. C. H. D. to Birmingham [noise]\nThis is yellow hammer News I'm Jay holiday Alabama's preliminary seasonally adjusted September unemployment rate is four point one percent average weekly earnings increased over the year by fifty three dollars eighty two cents or ... or a week counties with the highest unemployment rates are Wilcox county a nine point three percent\nClark County at seven point three lounge county at seven point two\nCounties with the lowest unemployment rates Shelby County a to point eight\nKomen county a three point one and Marshall an Elmore counties a three point three\nAlabama football player hunter re branding was arrested and charged with driving under the influence or DUI by Tuscaloosa police\nThe red shirt freshmen was arrested Sunday and booked into the Tuscaloosa County jail his bond was set at one thousand dollars six foot four two hundred Ninety six pound offensive lineman is from Coleman rented was called one of the state's top offensive lineman during the two thousand Seventeen recruiting\nAn officer involved shooting at a camp county friday is being investigated for the camp county sheriff's office reports the incident which began as a traffic stop took place just before nine PM between ... and ...\nA DeKalb County sheriff's deputy and a ... a police officer were involved in the shooting but we're not injured the un identified suspect was taken to earlier hospital in Chattanooga\nThere is no word on their condition the investigation is underway ... state bureau of investigation\nAnd sounds head north from Central America to the U.S border many are deciding whether to rest in far southern Mexico or to keep going until they get to the U.S southern border Emily Green is a freelance journalist end is traveling with the crowd of some seven thousand\nI can tell you the vast majority come from Hunter S that it wasn't a plan to than the ... that they heard of that on the news about unsafe stock or even passing by and added the joint it's\nWrong to you by attorney Alexander ... a man for the people for more Alabama's stories go to yellow hammer news dot com I'm Jay\nBrian I'll be banned pretty good Randy and you know amazing since I started working way to ... oh yeah oh yeah great co workers happy customers an\nAwesome pay what do you do I managed to oh tail but the three properties in Alabama with tons of opening that administration guiding security and more for you to choose and grow your career sounds great how I learned more goes away ... dot com slash careers or Google way create jobs and find your winning moment\nDid you know yellow hammer news airs on thirty five radio stations across Alabama every day in addition to our five hundred thousand plus weekly page views on wind yellow him are also deliver\nYellow hammer news airs on thirty five radio stations across Alabama every day in addition to our five hundred thousand plus\nWeekly page views on wind yellow hammer also delivers the news to over one million listeners let us help tell your story to the people of Alabama contract our business development team today and see how a yellow hammer can help grow your business Courtney and yellow hammer news dot com C. O. U. R. T. N. Y.\nAnd yellow hammer news dot com yellow hammer news we know news we know Alabama\nThe forecast for tonight low temperatures dropping down to about forty nine degrees under partly cloudy skies for your Tuesday Afternoon high temperature near Seventy two degrees and are mostly sunny skies perfect fall weather again partly county the Tuesday night with temperatures\nIn the upper forties low fifties rain chances will return by the end of the week um W. B. T. M. Thirteen News I'm Katie around disharmony Mendez forecasts on his Crawford Broadcasting station\nWho says talk radio just stick to just the way you can find out about what's coming to what's going on for\nWhat you missed by following had one oh one superstitious on Twitter or simply go to Facebook dot com and search for super station one on one while you you\nYou can take us wherever you go through with a super station one on one half on the radio on the Web on your phone kind of what the government at all the survey of your home town got in countries it's super station one on what what do you want to do [noise]\nWe don't want to go to a point\nWe are your garden country superstition along\n[noise]\n\n\nGood morning Alabama and a welcome ended a wake\nUp call that time is five oh for this morning ladies and gentlemen we have a show where you [noise] well I just got one thing to say and then I'm going to leave studio today ready for this [noise] Amy Schumer is pregnant [noise]\nSeems the dumbest among us can reproduce\nRight amount everybody have a great do they see\nTuesday right is to say All right just kidding welcome back in the wake up call we got a lot to talk about today Amy Schumer is pregnant there is a um invading force approaching the U.S border that just broke through Mexico's border Beto O'Rourke supporters\nMade what can only be described as a\nAwful hairspray knock off and they made a a video for him and will bring that video\nFor you to day will also posted on social media is you can see it because well this is radio and you can't see the video actually playing but she'll be able to hear the audio and it's just as cringe worthy\nWe've also got instead of the YMCA it's the B. E. T. O. it's debate season yes more like beta season but we're going into the election season\nRight now and things are heating up and it's just awful\nIt's just honestly awful Democrats are making their last ditch attempt it's not working Republicans are riding the momentum into this midterm election and it doesn't ... there doesn't seem\nIt's not working Republicans are riding the momentum into this midterm election and it doesn't ... there doesn't seem to be much hope insight for Democrats histories on their side they will take back at least one of the houses of Congress but at this point\nIt's looking less and less likely every day this blue wave that we're supposed to see this blue tidal wave is looking like a blue missed a blue kitty pool coming across the horizon but we'll\nGet into all that and more ... a little bit later in the show but without further ado I have to go to the man with the planned the man who also a braved the ice age to come in this morning but without his beanie hat\nBecause I I'm assuming I gave you too much crap about your beanie had yesterday I can is that the politically correct term I don't know the\n... is that better would go back to this catchy tune in the Nineteen twenties without his to bargain this morning he came in on his lead still\nDylan how are you and how did you break the ice age\nI'm doing All right doing All right they didn't sleep great didn't sit long enough and it wasn't quite cold enough for its bog in this morning\nIt was cold I don't know what you're smoking but it was called her this morning than it was yesterday morning\nIt was and it was ten degrees warmer and when I woke up this ten degrees warmer and you can't bring these facts to the table when I'm having this discussion that I Know nothing about okay also last night when I got home\nI managed to actually park in front of the garage or a set of off the side where the where I'm just like the ... the cars just out there mhm I managed to be able to park in front of the garage door and pull up really close to it so my a car is actually a lot warmer that what what would have been otherwise\nWell that's very nice some of us just have to park outside in the parking lot so good on you at least you get to pull behind something enough shelter um our car my car was\nMuch oh three oh this morning which are for you but\nIt's okay 'cause I knew ice ages coming that's what I've ... [noise] that's what I did the tournament because I don't understand how you go from Seventy degrees to um thirty degrees that quickly so I've just determine I'm pretty sure at this point that a new ice age is coming or what do you think about Amy Schumer is a pregnancy news you happy\nFor we're going to send her a card or do we need to do a phone call like like what's that work I Know we have such a good relationship with Amy Schumer on this program that we are going to have to say something\n\nCareful very careful we're on radio I don't have words\nOh well\nWell you think of words I Will let you know that also did you hear that I'm Michael ...\nWith also lost state lawsuit for five million dollars is being forced to pay that five million dollars and was allegedly [noise] addicted from his law offices for failure to pay rent so as you're twenty twenty presidential candidate Democrats I guess he followed the\nHere's why you shouldn't drink me her drink means [laughter] here's what you shouldn't drink milk 'cause it's a tool of the white but white supremacist\nIt's like really like if\nYou don't want us to drink milk if you don't want us to mess with the animals like just say it\nAnd if they came out and they said like this is a more convincing argument to me right they say stop drinking milk it's a tool to white supremacy that just makes me laugh because it's not white supremacist may do it but they're more ons if they came out and they said hey how about you stop sucking on a cow's other\nI mean like All right fair or Johnson argument but it could potentially when me over but not hey drinking to drink milk as a tool of the white suppressive patriarchy\nSupremacist patriarchy it's like shut up like it's just like it I just I I feel like I turned on CNN\nLike come on Don Lemon tell me and tell me how I Am again have your racist guess come back on and use racial terms that aren't condoning any other setting that have Roseanne tweeted them she would have been fired for but yes allow them to come on and break them down my throat because you are the moral arbiter of society thank you Peter really do a lot for me but\nFor the future if Peter can come up with a solid logical arguments like stop sucking on the couch after\nI'd probably buy a few more of their points like I'm sure we could come up with other ones during the break\nBut like there's there's gotta be some there's\nBe something but I mean what is not a convincing argument that one did you know or milk came from for a while like was there a time when you were a kid where you had no idea you were just like\nTo be some but I mean what isn't that a convincing argument Dylan did you know or milk came from for a while like was there a time when you were a kid where you had no idea you were just like oh\nWell we don't have the milkman anymore but the the\nWeird guy at the grocery store no I I don't know you bought it at the grocery store right did you knew did you know where it came from I don't think I cared it's not what I\nWas such a rude way to answer that question but [laughter] it's early on okay but\nSo you knew you knew where it came from or you didn't know did you stop drinking milk when you figured out where it came from\nNo I did for a little bit\nBecause I didn't care I found out and I still didn't care\nI mean I think that's a natural reaction I think I may just be like far too much of a like a human being that thinks overly logically about everything else but I'm like I don't think I'd drink milk that came from any other animal\n\nWhy would I drink this and I definitely wouldn't drink milk came from an omen 'cause that's not milk but that's a different point but I Would never ever ever drink something that just flowed from another animal's body\nLike can you give me any other instance in a liquid that comes out of another animal besides what babies drink don't go there besides that and that's our that's our that's our species stuff\nBut besides that is there any liquid that flows from a human being body beans body beside breast milk and Barrett grills during his own pass\nThat we drink I don't think so I don't think so you think on that\nWe go to break we'll come back eight six six five five one Ninety nine thirty three screw you Peter\nYou're listening to the wake up call have you ever made the wrong higher for your organization\nDo you have employee retention problems or maybe had a team members it wasn't a culture fit\nIt sounds like you have people profit fire sheets helps organizations growing scale their business through recruiting the right type of leaders for your organization fires\nHe's fine top cheerleaders that are qualified for the role but more importantly fit your culture and add to your bottom line visit fire seats dot com forward slash yellow hammer today for a special offer on your recruiting strategies\nAre flying an swarming around your home that could be swarming surmise knowing the difference between these insects let's say if you time money and worry\nIf you're uncertain about which type of insect is invading your home all the experts goes pest control will be happy to come to your home at a dinner by insects or insect damage brio charged with no obligation don't wake up call cooks today for re evaluation you you\nCan you sacrifice a day of your life to change someone else's life forever sign up to volunteer for the Cajun maybe certain place dot com and eat our Q. U. S. T. dot com [noise]\nThe Cajun Navy need people to deliver food water and items like diapers from ... Florida hurricane victims [noise] sign up now at ... dot com [noise] changed the world for good [noise]\nLife too short to work a job you don't like luckily when ... has tons of great opportunities for you and your career our property is an act more Montgomery and whatnot that Activision is open and hotel management administration dining and more\nOur team is well taken care of appreciated and always sees the result of their work in each gang smile\nA management administration gaining more\nOur team is well taken care of appreciate it at all when he sees the result of their work in each gang smile that taking things down there I go to a wind creek hospitality dot com slash careers or Google when create jobs and find your winning moment\nDid you know yellow hammer news airs on thirty five radio stations across Alabama every day in addition to our five hundred thousand plus weekly page views on wind yellow hammer also delivers the news over one million listeners let us help tell your story\nTo the people of Alabama contact our business development team today and see how a yellow hammer can help grow your business\nCourtney ... news dot com C. O. U. R. T. N. E. Y. and yellow hammer news dot com yellow hammer news we know news well you know Alabama\nIt's super restriction on what we care about the hard work you vote in your lives that's why our advertising partners are people we take the time do\nYou do after when you go to the white lie and check out our partners you can trust that you're doing business with a right to people you can tell if there's somebody you leave that you don't see why let us know and we'll start\nThe hunt for the city seven nine three three to four we do business the right way super station one on one nobody Whitey\nHey leads thanks for listening superstation little one\n[noise]\nYou can go for a pair of jeans if just rang\nAnd already on a\nGood morning Alabama paid us on those out there you get a little chicken fried\nCalm down eight six six five five one Ninety nine thirty three is the number to join the conversation and what's your frustration with Peter this morning eight six six five five one Ninety nine thirty three so\nTelling the question I pose to you before break and opposed to any listener who's willing to answer the question\nIn human history there are three things that we drink it and not not total but there are three things we drink that come from other being's right other alive things that I can think of\nTheirs breast milk cows milk and Baird grills drinking his own past but that third one is just meant to own category to itself it's just something better girls does I don't think I've ever heard of anyone else doing it just a weird fella but\nGot brass milking cows milk one of those comes from people so it's definitely acceptable\nWell there's another one if you really want to know I Want to go there let's go if you want to look at ancient Indian cultures yeah as they made sacrifices or just cannot ballistic cultures\nContinue you spell it out I Know where you're gone but I Want you spell it out for the lawyers blood\nThere's a reason we don't drink blood anymore I'm just saying people have you what you wanted another uh another example that people have drink\nI meant like currently I didn't mean like when we used to toss people off pyramid like I didn't mean then why do we like those are not good examples of really forward thinking people I Would assume that talent or indeed in two thousand twelve like we are past\nWhy do we like those are not good examples of really forward thinking people I Would assume that talent or indeed in two thousand twelve like we are passed them\nWell technically they're counter restarted into the U.S into how we were supposed to all died too though both well it's supposed to be a great flood I saw the movie don't even tell me I'm wrong well I Would still assume that more people drink blood regularly then ...\nI feel like look I'm not a science guy I've never claimed to be a science guy I Try to look at anything having to involve with natural existence from a logical perspective from common sense and I feel like you can typically\nNavigate your way through those waters except of complex things obviously but like I feel like drinking blood is negative thing is so weird conversation by the way and I would agree with that\nLike I feel like not only how do you get it like you got to kill someone like that's the only way you get it unless you're like some creep breaking into the red cross some Jeffrey Dahmer it's going in there and if you're somebody that's like Jeffrey Dahmer that does that I Hope you get the contaminated blood in your drinking it\nYou know why I drink real coke I don't drink diet I just drink water what did you help not why don't you go join pita\n[laughter] it was so the ... I'm Sorry ... five one [laughter] but I mean I Believe the rooms are already doing that was a joke but\nI just I don't get it where we strayed away from our point yes Diet Coke is bad no it's not good for you but what idiot was my own and see if this is good for either one of those\n\nLike what else is out there that we haven't had a Bobby to go try I feel like a lot of Bobby's were killed off by evolution\nRight and so we don't have enough of them now\nNow as the socialist left party is showing we're getting away from evolutionary principles I mean what's her name Amy Schumer is pregnant we the dumb people are here to stay maybe we'll get the new milk\nHere soon because somebody willing I Want to try that everybody would be like oh my God that's good I think we may have it and I think that it's found in what ever is an Amy Schumer is whim eight six six by five ... not not oh\nGod [laughter] [noise]\nI think the person that's going to find it is found in Amy Schumer is worm airs the rephrase everyone was working for eight six six five five one Ninety nine thirty three I'm going to throw up Henry take it away good morning\nOf fine good morning and uh it's a\nTough one on this morning show [laughter] I ... I I'm not going to praise it too but highly I obviously a Schumer has found the turkey based or so I don't know how did she get\nPregnant sailor please tell me I'm I'm In awe\nAndrea I'm not going there you know I'm not going there well it may have been a turkey paste or that and I I don't know from the ...\nAspartame ... and a\nSecular shut all these other different chemicals they're printing and as a as a calorie British sweetener but we don't we just go right why chlorine\nAnd all these other things and we wonder why we don't live to be a hundred and twenty as God promised ... so you know it's not like it's a God's fall it's more like the pollution and what we put it what how we pollute the bodies that keeps us from\nYou know a ... get gaining his problem is so that that show were but drinking blood ridiculous all the blood sausage I've never ... it might be good it's\nMade of glad it wasn't really that good\nI guess uh they don't serve too much haggis\nAre there but I imagine that weren't not unless you're in Scotland mostly in Scotland yeah\nThat's where the stone of ah Jacobs pillar or went back to just recently um and I don't want to get too far off but ah you were there did you get to see the the the kings and queens thrown in to see that rock that's right under the seat\nI did Yes sir and that's the coolest thing\nIt is it's very cool especially when you\nSee that rock that's right under the seat I did Yes sir and that the coolest thing\nIt is it's a very cool especially when you haven't eaten haggis before so you're not sad renting to the bathroom\nOr do you want to get that rocket just throw it all that all she can make it go that way ... [laughter]\nYou know I'm I was wondering how we got to the point of the blood but to for Peter to say these things yeah you know what else do they have to say I'm going to get make it and you shouldn't use flowed to close me ... central ... are both coach they ruined\nAh in New York when they were spray painting I'm throwing pain on these on people's private property yeah and uh do one more thing we we wonder why are they mobs in in our streets in the halls of our government\nWell it's nothing new which just seems to be exaggerated are a little bit but it's nothing new there is a mob they acted as a mob standing outside of uh\nWhat's your faces or you know they they said she was like the means woman ever forget this was her name was an H ... when the age I forgot what she owned a bunch of buildings there in New York and they would of course stand out side of those buildings because the richest\nPeople were there and they were assured of ah the the fur coats ... unbelievable and as far as you know\nAny animal goes or if you're if you can join ... it's very nutritious it the same some of the we share some many of the um the the things that help us to not get sick we share those same things in London animals sheep's milk goats milk\nCan imagine what it was like going through the desert with two point one million people leaving Egypt ... and there was no water in the desert and uh I guess a little goat milk would surely help through that day\nAnd I really get that I totally get that but you gotta admit that who ever found out that she was or cow's milk was the thing they are a little off the rock or\nWhat they said dribbling obviously from the baby's mouth and uh you know they they you know you just can't say well why are they like it so much I'm going to give it a try\nYour ah how do you go ahead and pull on this key and then get some milk add to that show that within itself may have been a little problem for the person who did that but what would you say was it a male or female was at a map man or woman that first told\nAnd figured out how to get that milk out\nOh my bed is one hundred percent on them and\nI Would say a woman in oil and\nWe're always taking care of those duties and you know there were a lot easier than going out and so on the fence post or or ... or any other stuff uh that the modern\nReady but I I just think for sure that say hold my beer watch this time\n[laughter] is that exactly the same thing as the red neck slogan yeah oh my bill watch this exact\nWording tells you that the right and then there's ... somebody else in there or\nThe all the other way the rational way I Would take it you have a a a lamb or or a baby that is not joking that milk and the man or doesn't have a baby bottle any other means to do it so they take it and they scored it into the mouth of the baby and some square it's in his mouth\nThe man or doesn't have a baby bottle any other means to do it so they take it and they scored it into the mouth of the baby and some square it's in his mouth is I'm not not too bad it's not even that hot I mean I don't have the code\nOh God I don't like ... and then there was all\nDone by accident so I but I I before I get out of here I got to say something you you're using a word\nThat every a cushion should always want another Christian about net is more on we can't call other people more um God is very very very very uh\n... and ... it's a let me see if I get to strike\nA five Matthew five versus twenty two but I say on that you\nThat who show ever is angry with his brother without a cause shall be in danger of the judgment and then he goes on and whoever ... shall say to his brother Rocco and Rocca is a form of you take your point your finger at the person you're ... ... you say you\n... you know you see how even even today we use the same\nUh emotions and things that are or were written thousands of years ago in any way to say rock I shall be in danger of the council and then he means is an ... right ... finishes diverse with whoever shall say now full shall be in danger of help fire bad translation\nNow full is from the Greek it's from the word moral rows and it's a it means in a a wicked rep probate destitute of all spiritual or divine knowledge\nSo what can I call somebody use an idiot that sucks on out or who oh cool okay\nPlain old flu because you know what you don't listen to fool old you are bigger fool for doing so they're more on on coming from the Greek word Moore's uh and it really\nIs from ... and and your strongest quarter and says thirty four Seventy four of the word thirty four Seventy four and it tells you how the word progress to enter the English language\nBut if you're going to your call somebody more on your saying they're completely devoid of ever being out seed planted and then ever becoming a are one of God's Children\nAnd I didn't know that thank you\nFor and and then he ended up with your because you use that word because you ... you are said to somebody you're a rubber obey you're unable to ever have any spiritual knowledge you're in danger you yourself using that word against another person especially bother especially a brother\nOr you are in danger of help fire and we know help fire is\nYou know is that nasty stuff we all get at the end if we don't have good works yeah and I can I correct or none of them you brought up go rations with words those words were about hand washing\nAnd other stuff that became traditions or man you have to be careful what works shooter you're explaining works as raising a woman in your family\n[noise]\n\n[noise]\n[noise]\n[noise]\nThere'll be ... there'll be ... do you do thirty seven ... W. B. J. C. H. D. to where we [noise]\nThis is yellow hammer News I'm Andrea ... the Alabama forestry commission estimate that hurricane Michael did twenty million dollars worth of damage to timber in Houston county\nThe AFC conducted a survey of over forty thousand acres of forest land so far forest recovery efforts can be found\nAt the AFC website for those who own timberland that website is forestry dot Alabama dot Gov the University of Alabama raises a lot more money this year than last Jay Holland with yellow hammer news has that story\nThe University of Alabama says it raised more than two hundred twenty four million dollars and gives him pledges this year the schools have the money came for more than sixty two thousand donors the school had raised a hundred twenty million during the previous fiscal year\nUniversity presidents Stewart bill ... news release the money creates a strong foundation for growth and development of current and future projects and programs for the yellow hammer news radio network I'm Jay Holland\nAnd development of current and future projects and programs or the yellow hammer news radio network I'm Jay Harlem\nAnd at least he doesn't have a large attorney fee to worry about a Texas man decides to go a lawyer and instead represents himself in court then loses\nThirty six year old to Kammen Holt was convicted by a jury of kidnapping and then sentenced to life in prison hold was under trial for abducted a seven year old girl from\nHer custodial father back in twenty sixteen the girl was found alive days later into ski Alabama the mother of the child was withhold at the time of the abduction and is now awaiting her trial\nHoover police released the identity of a man shot in front of an apartment complex on Sunday twenty three year old Darryl stay of Hoover died at you it'd be hospitals\nFrom the gunshot wounds witnesses say they sell the shots fired from an S. U. V.\nHoover police say that evidence found that the scene indicates a drug transaction was taking place\nThis news is brought to you by attorney Alexander ... a man for the people from ... Alabama stories go to yellow hammer news dot com I'm Andrea [noise]\nIn an instant your life can change maybe you've been injured in a car wreck or perhaps you've experienced a bad drug\nWhen you're seriously hurt first her case inexperienced personal injury attorney who provides first class legal advice and representation at Alexander should our our clients matter and over the past Twenty years we've recovered millions of dollars for them and I'm ready to help you get the results you deserve call me Alabama\nNobody's going to be on my way [noise]\nEither both guy and sometimes he kind of ...\nI'm going for a small businessman will grow twenty first century jobs and will be a loud voice to help existing Alabama businesses I'm willing for Aynesworth is the husband to the pre K. teacher\nStill expand voluntary pre K programs and speak out for classroom technology I'm willing to work always bold sometimes loud will Aynesworth will take his job seriously and\nCongestion and accident\nThis traffic report is sponsored by always money and it's like we're still dealing with that accident is the sound on an ice fifty nine fourth avenue so it stop and go traffic from either for fifty nine an exit one thirty seven also some congestion on highway thirty one north bound before me Daniel street\nIn Shelby County all ways money\nAlways money is the best place to get an auto title loan abducted thousand dollars and customers and trusted them for nearly Twenty years and so can you visit always money dot com to get started lows of the two approval\nAndrew you can meet this morning I'm Sarah Thomas with traffic on superstation one on one a W why the ...\nThat makes sense in classes low seventies expected today forty seven and the other night low tonight will still be nice and driving a high close to Seventy and then a chilling rain arrives for Thursday and friday\nThirteenth meteorologist Seventy four cats on his Crawford Broadcasting station\nShows for us to stick to just a year where you can find out about what was going on\nWhat you missed by following that one oh one super searches on Twitter or should we go to Facebook and search for super station one on one while you you\nYou can go wherever you go through with a superstition ... up on the radio on the Web on your phone or what the government at all the surveys of your home town garden for each one on\nYour buster thinks rulers superstition world a little one\nCountries it's super station one on one Whitey\nHey he'll a buster thinks we're listening superstition one on one\n[noise]\nAnyone can tell you this is talk of diamond is a suburb of your face without the without saying hey Megan how are you taking away the normalization of\nFeel yeah Alaska disappointing that type of behavior of the messages if I Know I take that off and it's such a giant up your story ... freaking out over it\nJack Kennedy and LBJ went in and the double standard for the last\n... I Love I Love does nothing but the most bizarre\nDown there by that\nTakes a wheel man\nMichael hard his them that the\nFocus was on Michael [noise]\nPay ... ... our show to answering your cause James hanging out in the studio with us for ... been talking about the urban sprawl here for just\nA bit and let me let me make this point [noise] and they were going to go out to the phones [noise]\nI have been a long time congregants if you will church of Ohioans and you know I've I've visited other churches and start sneak off their masks every once in a while as well\nAnd you know these you know I've been talking about the possibility of changing churches Enron has nothing to do with church of the highlands it has to do with the fact that sure to the highlands is a very wealthy church I mean it just is Airforce with cash\nAnd I was going to people that I've always part of the reason I'm really I'm In Auburn fan I've always been the underdog kind of a guy\nAnd I I'm always the guy just pulling for the person or the team or whatever they're probably doesn't stand as much of a chance and I said to her a few weeks ago you know maybe we need to look around a little bit and find a church that really needs our money that needs our participation you\nKnow sometimes you go to church with the highlands and you'll get into a group to make our community service effort and well there are\nPlenty of people are already there and sometimes you feel like you just don't make a difference of people's lives and you know this kind of people and she is as well where we want to always help where we can why it made the comment earlier today about joining the care of and I wasn't getting about that\nYou know just kind of get in the middle of things because I like to be in the middle of things because the way our role\nBut it kinda got me thinking you know if I'm looking for another place to uh uh to hang my theological shingle maybe I'll look for a church that you know my three or four hundred dollar a month and tithing or whatever might be in a given my would really be a benefit to them as opposed to going further into their bottom line\nAnd again it has nothing to do with the ... the highlands birthday I think Chris Hodges is one of the most brilliant people in the face of the earth and always delivers a sermon that is just moving\nBut then it gets me to thinking a little bit about the church of the highlands announcement a few months ago about building in the inner city which they already have the dream center it's already there but then there was this black minister they got all up in arms about black people don't need to be going to white churches mhm have you ever been to a church or the highland campus\nI driven by now I mean if they're not white churches\nThey're full of Latino and black people they're full of Asian people and people of all cultures this wasn't\nA matter of keeping the white church out of the inner city this was a matter of keeping dollars out of the inner city because dollars\nSix sass achievement accomplishment economic sobriety are a threat\nSuccess\nAchievement accomplishment economic sobriety are a threat\nTo the ideology that you belong where you want to belong mhm and that's what it all really and truly boils down to\nAnd that's why these whether these marches are coming here for asylum or assimilation or a better life for whatever the case may be they are going to literally march\nInto the doom of the blue inner cities and for all intents and purposes not be any better off if they are allowed in and some of them undoubtedly will be\nIf they are led in an air assimilated by these these aspects of our culture that had no desire to do anything for them other than to exploit their fears\nAnd their ignorance for a vote\nA thorough quote out there from a movie I forgot the name of it but the quote goes like this free will like butterfly wings wants touch can never leave the ground again right and that's what you're seeing in the inner cities\nAnd please tell them that you heard about them on the Michael heart show right here on superstation what a one W. I. D. E. right off the road mountain Alabama you've been hearing me talk about these guys for years and I cannot say enough\nAbout the folks at Billy Mitchell jewelry what an amazing a bunch of folks was so amazing deals are some of the most beautiful diamond jewelry you'll ever see of course you get great deals on those diamond engagement rings and gentleman you can certainly upgrade the woman if your dreams rang as well when you go to Billy Mitchell but don't forget it's also a graduation season is upon us\nA whole line of attendance bracelets necklaces you name it if it's a diamond it's apt Billy Mitchell jury if they don't have it you don't need it check them out on Facebook or for more information give him a call to five six nine seven four one six three three to five six nine seven four one six three three\nFor Billy Mitchell jewelry and telling you heard about it right here on my heart show\nIt's super station we care about the hard work you put into your lives that's why our advertising partners are people we take the time do you don't have to when you go to the white lie and check out our ... you can trust that you're doing business with a right to the people you can tell if there's somebody you don't see on the line with us\nAnd we'll start the hunt for the whole\nCity seven nine three three to four we do business the right way super station one on one what do you why\n[noise] covering\nSuper station one on one somebody why [noise]\nDogs and cats living together [noise]\nSame as you just said to me on the air [noise]\nOh yeah a good ... and it was eight seconds\nIsn't it amazing how\nHow much are less\nWe've heard about how [noise] now you got me flustered\nIt's interesting that the narrative has changed from Kavanaugh and everything to associate with that famous separation you know at the border\nWhere where where's the impeachment talk mhm we're only way we're going to teach him immediately oh never going to be June when we when the house back out and now we're going to beat you when we when the White House back mhm\nAnd what we heard out of a ah Christine for you know that ... has been fined four and a half million dollars for the friday and one of his law partners Mm well that stormy has to pay Donald Trump's legal fees and nobody's related to that a court case\nWe know that Nancy Pelosi is getting shouted down in restaurants and when it happens ... McConnell\nHe born very liberal areas are coming to his rescue\nMhm but yet you're right where's the Kavanaugh chatter ... where all the other women where are the are suppose that other witnesses coming out that we're we're we're told if he's confirmed there'll be more accusations wherever they may yeah you know why they're not coming out 'cause there's no money in\nIt so you're right and then voila a caravan a caravan now we've got talking points again like ... ... from heaven all of a sudden\nA couple of hundred people decide to I don't know go off Forrest Gump and one day I just fell out running\nAll of a sudden a couple of hundred people decide to I don't know go off Forrest Gump and one day I just fell out running Mm gonna bump that gee running\nHell of a sudden we've got seven thousand people were signs march into line towards America how convenient [noise]\nYou know I've often thought the stupid people have more headaches than smarter people there must be a law ... out there\nWhere's Maxine Waters been where ISIL maxi\nI haven't heard anything from her\nWears a Sheila Jackson Lee and Schumer and Spartacus when he's not assault in a man in the bathroom every knows that you haven't heard the ah were rattled or a week since that's come out ... Harris a she'd probably a vacation in the Caribbean or breaking more glass ceilings yeah\nYeah\nBill and Hillary doing a tour mhm yeah they gotta by the beach house they all just go out there and get your credit card ready because you've got to go out there and see ... [noise]\nWell I mean what what was it a couple of days ago Don Lemon oh yeah his show was maybe they were replaying the audio from the bus recording before\nThe election yeah there'll be Bush beer no there there were the um\nTrump recording yeah yo yo yo yo Bush yeah but yeah\nIt's okay I did it grows back\nIt's it's a slow day for me sorry but it has nothing to do with what's going on there just are um\nBecause you got you got to store it because you know what if you don't start you know there's always a things that's exactly right six to the bottom and in this case the truth is starting to ... how are you\nAre doing All right I yeah I think we just go out and deploy our sonic weapons at the border and it will ever make it through that we shoot 'em but and that all pretty much stop everything if the hurricane doesn't take 'em out first um\nBut you and I have discussed urban sprawl before and it's kind of funny how we keep talking about the same thing every two or three years four years um\nBut ... and you know you have far more control in urban setting you have far more degrees of illness a far more need for medical care it's cetera et cetera et cetera nobody self sufficient you can't grow your own garden and and your front yard our back yard like you used to be able to do in some places\nAnd you just like you said you're far more reliant when you live out in the country and you can actually do for yourself and if you need your neighbor to come over and and plow your field then you end up bartering something out because you go over and build them a shed or something right\nAnd then you you're not rely on the government to a common cut your grass for you but I think we need to go back and require that people watch slogans run\nSoil and green and the original roller ball before they get out of high school\nRoller ball with James Caan yes oh yeah that's all ... dads it's the only place you can find that now as Amazon Prime and yeah I don't really mean digitally motorcycles and roller skate so I'm all about it\nBut but the the underlying story arc there though is that all the athletes works for the corporations\nTrue rations right everything and the corporation gives you your wife or they take it away and James cons case you know and and the line in there about uh\nTrue rations run everything and the corporation gives you your wife or they take it away and then James cons case\nYou know and and the line in there about or you can't give people hope and if if this guy wins then he's got to get people hope and you know really just move at flashbacks from that movie the all time Obama was an office\nWell you know I Know there may be another baby to throw into the mix was the Truman Show no I'm not a big you know Jim Carrey fan but eventually he comes to his sentence in a sense isn't realizes that his entire world is crafted and it's not until we find the door out that he finds himself\nWell that's exactly right and you know your your comment about looking for a church where you can serve but that really is the ultimate sign of spiritual maturity is when you start looking for your chance to serve other people and you know church house I'm sure it's great I have questions but you know I Know good people from there\nI'm not going to disparage them or the pastor without knowing anything but uh you know you get outside of the mega churches into the little churches my whole thing has always been where can I served my God and that's always been my my ankle when I go looking for a new church where do you want me got and where can I served and when we began to serve others\nThen we find a level of prosperity that we didn't know before ... you know the Porsche poorer states in this country\nAre the most charitable and the richest states are the most shellfish and they're usually blue\nYeah yeah it's a good ... have you back you to another movie they live yeah wearing sunglasses and consume consume by obey mhm\nAnd then another one's probably one of the funniest movies you'll ever see in the history of humankind\nRadiography Wednesday bronco ... Rondo [noise]\nBecause they're I've I've always loved Harry ... I'd say dirty bruises or is one of the ... is one of the funniest guys I mean you know for somebody who was just such a Big East and he is yes I mean he is absolutely I think he's lost their goal but as a president Camacho\nI mean can you can see America in that movie I don't know twenty Thirty years from now because we are like a rambling wreck from Georgia Tech we're out of control and where you're heading right towards\nA state of complete ignorance in this country and if people don't grasp that then you know whatever I'm just going to hear\n... on the radio drink my free coffee\nAnd just sit back and watch road burned I held down\nYou don't have a ... year guitar I'm thinking more ...\nYou know was that little Martian from the Flintstones ... little bubble had guys for taking the brain foreign ... Marvin Martian is his name yeah yeah I'm going to go all Marvin\nOf Americans but you know he didn't add that it would would change the complexity of the electorate there was a difference between the complexity of the nation and and the complexion of the electorate\nBut he didn't go so far as I mentioned that but I my point as cyclical your take on may be you know knocking on doors some truth here\n'cause we're I mean I did to a degree you know something else that people you know they they are failing to ... to realize is that you know with the importation of these likely voters visa v the caravan ...\nYou know isn't it interesting that simultaneously we're getting all of these calls from the left just in the last Eighteen months for the dissolution of the electoral college\nAnd you know people are people are drawn those those lines together either because if you bring in seven thousand new voters in any one particular district will likely he'll devout Democrat and the electoral college becomes even a greater threat to your agenda\nExactly you have to double the Congress\nYou have to give them more representation even though they're not supposed to have it the only way we can take care of this right now\nIs to make sure that not a single illegal or anyone coming across that border uh from ten years ago today received low government programs are for Twenty years and then you'll see the emptying out of the belly of the the\nProblem that we're having this stomach ache well just immediately bleed back to their home countries because yeah is every caller said you know\n... and other things that are every time you raise a standard from another country that's only the found\nAs every callers said you know every ... and other things that are every time you raise a standard from another country that's only the foundation for invasion it's not the foundation for absorption or coming in and being part of the great\nWell another thing that's very frustrating is that there are tens of thousands of people listening to this broadcast right now that are going off the jobs that pay taxes that in part will be use to shore up the governments of some of these other countries so that the hierarchy within those countries can repress their very own people and us force them out\nYeah they're going to be able to double down on the line Michael labeling hotel totalitarianism and these other countries that are pushing these people out there we're going to head if we keep on going now allowing Democrats to strike up Cuba to give them validation\nGo ahead and give up voting to Iran and give it putting the MS Thirteen Eighteenth street and a Hamas and the PLO but can you go to court\nI hear your Henry against\nThem but you know what the Democrats don't have a Freedom Caucus\nThey might have a a Democrat socialist caucus but they don't have Freedom Caucus they don't have nothing that has that will put the uh um individual up at a better place and my ... I Would say was it Tangerine Dream that the ... like butterflies was in\nAnd I I wrote down the road with Henry it I I gotta go\n... what it is accuracy and Canadian Bacon they shouldn't be there should be taught in every school in this country by like\n... because they're very much a Democrat operative dog show and had a had actually pen and an interesting op ed and I don't typically like to read things on the air but I I think\nThis is a worth listening to because he has been pretty devout as a a leftist for many years\nThe Democrats have a problem a serious problem he writes\nBut one that they have yet to acknowledge fully or frankly at all what's the problem here it is Democrats have moved so far left\nThat the Republican attacks on them for being an extremist and too far in the clutches of the tire out of touch leadership had been working and working well according to the recent NBC Wall Street Journal poll\nThe Republican campaign now in simple just focus on how far left the Democrats are and how will hold and its candidates particularly congressional candidates are to the unpopular democratic leadership in both the house and the Senate\nSharing goes on to write I argued here and elsewhere the Democrats need new leadership I also have suggested that those candidates who have rejected their leadership are likely to do better than those who remain you'd take the money and suffer the political consequences\nBut right now as we head into the final two weeks of the election campaign which is two weeks in the day rather wipe\nIt appears that both the Senate and potentially the house races are tightening ended up here's Donald Trump's attack on the Democratic party for being out of touch with the electorate and too confrontational as\nWell as led by two failed leaders of the past\nAre working rest assured the Republicans have failed to take advantage of what has been their principal opportunity which is run on the economy and got political credit for something the voters they themselves see as improving and beneficial\nInteresting shown points that out since Obama took credit for the economy just yesterday but back to the piece that being said the caravan currently moving from the Mexico Guatemala border towards the United states gives Trump and the Republicans a chance to double down on immigration and issue the Democrats themselves for me\nScott Guatemala border towards the United states\nGet Trump and the Republicans a chance to double down on immigration and issues the Democrats themselves remained vulnerable on why are the Democrats vulnerable and immigration because they have not disavow the attack that day for open borders having a substantial number of their candidate supporting either\nThe knitting or the elimination of ice doesn't help either article continues on much in the same way but basically\nJones pointed out of the Democrats are losing their footing because their immigration policies are out of touch\nTheir ideas are out of touch and rest assured ladies and gentlemen\nThat are more of these folks are allowed into this country it will be to the detriment of other minority groups that have worked so diligently over the last many decades in this country for equal opportunity and their share of economic success stick around her come right back on the other side you're listening to the Michael ...\nIt's not right versus left it's us versus them the Michael hurt show\nHoney that's a beautiful picture but\nDid you make the roof to different colors iris last night oh he has a\nWay what if he's ever notices ugly black streets in this coloration on your roof what you're actually seeing is algae growth a route that has lots of algae\nIndicates significant aging from degradation making it susceptible to other types of problems\nWhen storms come through your already decaying roof will be more likely to sustain major damage bill at complete homework may be able to get your replacement\nPaid for by your homeowner's insurance with his training as that of an insurance adjuster bill can work with your insurance company to make your replacement affordable fix the problem now before the storms come to\nBy calling bill to zero five eight three seven\nNine nine four seven five eight three seven Ninety nine forty\nSeven with satisfied customers and highland lakes and thus Davia hills the roof or who can complete did Neal is bill I complete homework\nEvery business needs good partners to help them succeed and meet their goal vertical solutions media has been working with small to mid sized companies in the Birmingham area for over ten years in fact they've been the trusted marketing partner for this very radio station for almost three years\nVertical solutions media has experience working with a wide range of industries and with companies of all sizes are small retail stores to most of these big corporations are approaches customize to the needs of each client whether offering occasional projects support or fully integrated day to day marketing operations in addition vertical solutions\nMedia recently lost a new Web development division called outlined start they specialize in online Web strategies to build affinity with your audience for friends awareness and the prospects for yourself process request a free no obligations sixty minute marketing consultation call them it two or five Ninety three\nSix free one seven for a visit our website at vertical solutions media dot com\nThe following it does not necessarily reflect the opinions or abuse of Crawford Broadcasting its employees affiliates or advertisers\nThat's what's on the line and this year's elections this is just as Tom Parker you also have less mobs trying to tear down just as Kevin off\nLabel means to be next after for Thirteen Years on the Alabama Supreme Court has a strong independent conservative voice has taken on and beaten the Southern Poverty Law Center and been outspoken that ruby weighed in on murder fail were wrongly decided [noise]\nAnd I'm a strong supporter of President Trump and his effort to put more conservatives on our federal courts\nWade and murder fail were wrongly decided [noise] and I'm a strong supporter of President Trump and his efforts to put more conservatives on our federal courts to left his mom doesn't like that\nThey want judges who overturn our laws and look the other way when the leftist mob tries to destroy options side to this is just as Tom ...\nRepublican for chief justice I'm asking for your vote to keep Alabama's core took place for the rule of law was respected and not where the mob root for my Tom Parker chief justice mock celebrity tweet to Montgomery three six one one one [noise]\nWho says talk radio to stick to just the way you can find out about what's coming out what's going on for\nWhat you missed by following had one on one superstitious on Twitter or simply go to Facebook dot com and search for super station one on one W. I. E.\nYou can take us wherever you go through with a super station one oh one half on the radio on the Web on your phone kind of like the government at all the surveillance cameras your hometown God and country said superstitions one on why why do you\nHitler rose to power under the promises that he would restore the father lay it economically speaking and fight off the world war one reparations as part of the treaty of her side that's where the popularity came from he gets elected and all of a sudden his whacked out views on soldier began to emerge\nThat while they had electoral college will [noise]\n[noise]\n[noise]\n\n[noise]\n\nW ... W ... [noise] do you do thirty seven ... W. B. J. C. H. D. to where we [noise]\nThis is yellow hammer News I'm Andrea ... the Alabama forestry commission estimates that hurricane Michael did twenty million dollars worth of damage to timber in Houston county\nThe AFC conducted a survey of over forty thousand acres of forest land so far forest recovery efforts can be found\nAt the AFC website for those who own timberland that website is forestry dot Alabama dot Gov the University of Alabama raises a lot more money this year than last Jay Holland with yellow hammer news has that story\nThe University of Alabama says it raised more than two hundred twenty four million dollars and give them pledges this year the schools have the money came for more than sixty two thousand donors the school had raised a hundred twenty million during the previous fiscal year\nUniversity presidents Stewart velvet in a news release the money creates a strong foundation for growth and development of current and future projects and programs or the yellow hammer news radio network I'm Jay Holland\nAnd at least he doesn't have a large attorney fee to worry about a Texas man decides to go a lawyer and instead represents himself in court then loses\nThirty six year old to Kammen hold was convicted by a jury of kidnapping and then sentenced to life in prison hole was under trial\nFor abducted a seven year old girl from her custodial father back in twenty sixteen the girl was found alive days later into ski Alabama the mother of the child was withhold at the time of the abduction and is now awaiting her trial\nHoover police released the identity of a man shot in front of an apartment complex on Sunday twenty three year old Darryl say of Hoover died at you it'd be hospitals from the gunshot wounds witnesses say they sell the shots fired from an S. U. V.\nHoover police say that evidence found at the scene indicated drug transaction was taking place\nThis news is brought to you by attorney Alexander ... a man for the people from ... Alabama stories go yellow hammer news dot com I'm Andrea [noise]\nIn an instant your life can change maybe you've been injured in a car wreck or perhaps you've experienced a bad drug\nWhen you're seriously hurt trust your case inexperienced personal injury attorney who provides first class legal advice and representation at Alexander should our our clients matter and over the past Twenty years we've recovered millions of dollars for them and I'm ready to help you get the results you deserve call me Alabama\nIs likely to be known [noise]\nEither both guy\nSometimes he kind of ... [noise]\nI'm willing for a small businessman will grow twenty first century jobs and will be a loud voice\nAnd sometimes he kind of ...\n... for a small businessman to grow twenty first century jobs and will be a loud voice to help existing Alabama businesses I'm going for Aynesworth is the husband to the pre K. teacher still expand voluntary pre K programs and speak out for classroom technologies\nWill Aynesworth always bold sometimes loud will Aynesworth will take his job seriously enough\nWater main break this report is sponsored by always money so please don't forget we have a road shut down this is old leads wrote that shady lane it's near shades creek parkway and it shut down due to a water main break so please try to find\nAn alternate route around that until they can get that contain also with congestion sound bum I for fifty nine that has just passed the thirty one derby parkway expect modern delays from that as well\nOh ways money always money is the best place to get an auto title loan abducted thousand dollars and customers a trusted them for nearly Twenty years and so can you visit always money dot com to get started lows of the two approval\nI'm terra Thomas the traffic on superstation one on one W why in\nThe ... the mixture of sun tanning clouds with low seventies expected today\nForty seven and the other night low tonight will still be nice and driving a high close to Seventy and then a chilling rain arrives for Thursday and friday WGM Thirteen meteorologist Seventy four cats on his property broadcasting station\n[noise] what goes on the radio sin what goes on Facebook superstation ... W Whitey [noise]\n\nAnyone from do you love your dinosaur where they'll end up in the Soviet face all goes without saying hey Megan how are you\n... and the last of them were you saying that type of behavior what comes in is is is if I Know I take it off in a certain age I end up your story ... that's why the lesser freak out over it\nJack Kennedy and LBJ\nHim a double standard for what\nDoes nothing but some of the laws that say why\nDo we own my own\nMichael heart is the\nMan of the welfare of my goals [noise]\nVery wise about five of the size of the hour it's actually bought five or nine hours three three got about forty five minutes left of air time on this broadcast [noise] so I asked the question to me again and just you just ask and parts of your water would have got to flush it out\n[noise] uh\nQuestion was basically what is your opinion on ranked voting or so for for example say we we had a fourth party system\nObviously three of those you agree with more than the fourth grade so in the rank to vote you would obviously have your first choice than your second choice and then your third choice\nAnd there are two ways that they can be counted one is each choice gets a points based on where you rank to like say for example first points to get the first place you can spot points second place gets three third place gets one type or to make them significantly different\nOr a win the votes of being tallied you could look at all of the first places if no one gets majority then you go to the second place as it's known as a majority there you go\nIt's a being tallied you could look at all of the first places if no one gets majority then you go to the second place as it's known as the majority of there you go further on\nSeveral things come to mind under that scenario believe it or not when the country was first founded and they were doing with the the Continental Congress it looks something like that whoever got the most votes which president whoever got the second most votes was vice president\nHere's where the problem came in and the founding fathers realize this literally I mean like on day one\nThat presents an opportunity to have to completely opposing parties in office\n\nLet's assume that we have that type of voting in place first off it it it completely eradicate the electoral college and we're right back to popular vote him\nThe let's assume for one second that we did that exactly the way you suggest it\nWhile I'm not saying a the president or whoever gets the first several as president and every second is vice president we saw the uh the running mates as we have now so there's a the one party that's in power the executive branch\nOkay so they're still attached yes okay we got ours we can leave it that way okay because I was going to say that if you did it the way I originally assumed that you could theoretically have Donald Trump as president and Hillary Clinton as vice president and that puts you know Tom ... literally and physical risk even more so than they already is\nThen there's the possibility of him leaving office and all of a sudden the entire dynamic of the of the election changes because now you've got Hillary Clinton ascending to the presidency in this example\nBut you know the the rank voted that you're speaking of it it's actually been tried even in some communities as well the problem is again you know is it so far for what I just described but also opposite stuff up you know for corruption and fraud and the vote counting it all the things that go along with that\nBecause the second party justification for you and the second part of justification for me might not be the same justification and it just kind of muddy the water so the idea of the founding fathers was that the entire executive branch theoretically\nThe entire elected a executive branch was like minded and everything that they thought as opposed to having this amalgamation of different thought predicated on these little ... by um\nYou know these little um what's the word I'm looking for more segregated popular votes because that's what they become so now you have a multitude of different votes from different parties as opposed to having a you know this this mandated for a philosophy versus that mandated philosophy it's not a bad thing to consider\nWhen and I'm not saying I'm not suggesting that we do but when you look at it from the perspective of getting a you know people that are in there and in a tiered system but something else to consider here is that in\nAll likelihood not only are we doing away with the electoral college but in all likelihood because of the tone and temper of the nation at any given time the end result would typically ended up being the same\nA district thirty to the house in Alabama you'd have very little bit of ... just like you have all the left side of ... ... how the city\nOr late ... blocks of white section of box but then people would see a link\nThen it has all the ... what's black although he like along the ah old Martin river there so you got to ... you will never have um the public is in that area very pardon the sport but there are\nNow is no reason they all do it it's not because they bought the fact is the last time he only and I could be wrong you know this sounds like you know everything in all honesty you know joking around with such as um black smoke almost as much as I Do\n\nHope I'm I'm listening I wasn't sure you're finished\nYeah I I was I'm done I'm Sorry my phone's not what you just get because they I mean that's I mean we can never get rid of that no matter what\nWell you know ... at the end of the day Rhonda and it's kind of where you know we're doing our having this conversation\nIs the process perfect no I mean quite frankly it's not you know these districts are drawn and redrawn by state legislatures in the majority party in most states actually controls the process stumped some states require bipartisan or nonpartisan commissions oversee line drawing and it varies from state to state to state and then it\nOh it was a process stumped some states require bipartisan nonpartisan commissions oversee line drawn and it varies from state to state to state and then and also the conversation brings us back to states rights the responsibility of state legislatures as it relates to the federal government we're kind of in a weird place in our history right now\nWhere we we have these kinds of conversations of\nWhat is the sovereignty of the state look like versus the sovereignty of the federal government and those two ideologies are constantly in opposition\nTo one another and it it's absolutely not a perfect situation which is why people including myself are often refer to the United states as an experiment you know the founding fathers knew all too well and it was an experiment\nAnd then you can prove that because they gave us the amendment process and so it it can sometimes be very very very frustrating as these districts are drawn in a manner that does favor one party you know I'm I have no argument for you because you're spot on with that observation\nRight and that's because I actually ran for that position he uh terms ago right well I I Know how it goes but now here's a\nQuestion and a half are you sir I'm not worried about the twenty ... more worried about the only way or\nYou know the ... when the next term some experts that after so lucky to have to offer a ... going to stay on half of\nAmerica First after ... ... ... is is there a light at the end of the things are going to get that going to get darker\nIf you force me to answer that question I'm going to say that things will get dark again because if we use history as a barometer we have been down many of these roads before you've heard all the chatter about you know the possibility of a\nYou know ... enlarging the Supreme Court well that's not new FDR try that as well and so there's going to be this constant bipartisan ebb and flow between the right and the left\nWhat's really disturbing however is historically speaking the right and the left seemed to be going to further and further extremes\nWith each passing generation now there's also been some talk about whether or not Trump needs to abandon Mike Pence and the upcoming election and take on Nikki Haley if he takes on Nikki Haley as a running mate that changes that entire conversation and dynamic is well\nIf he stays with pets and gets re elected I think to make America great again movement continues on not that it wouldn't under Haley but it might look a little different\nWell that pendulum you're speaking of do you think if they can go one way so far there's no coming back\nYou know I I Hope not because you know if it goes if it goes so far ... if if if the right goes as far right as the leftist going left\nThen we are in some form of\nYou know third world country theocracy and I don't think anybody wants to see that\nYou know do I want prayer in school absolutely do I want prayer mandatory in school no you know I think it's the right to the right of the individual and you know to a lesser degree the right of the community to govern itself\nBut in a far flung hard right theocracy every decision that we make is predicated on the whims of whoever occupies the oval office\nWe you know we have often in this country been the most successful wherever we did have been center right or center left and all those rare occasions just plain old flat center\nBecause when we're extreme writer's dream about I mean look at our church is as well you know you've got you know the the the snake handling you know the uh\nCenter because when we're extreme writer's dream about I mean look at our church is as well you know you've got you know the the the snake handling you know the churches on on the right you know the speaking in tongues and you know and they're primitive this and they're primitive that and you know there's a measure of ostracized seen people when you go to that extreme\nSo ... extremism has never flourished in any democracy anywhere in the world\nOr else you're right and like I said I Love your show people\nThere were like you're on very much longer\nYou know right now and what kind of use the will still the term rhino will borrow it for a moment on the Republican side you could say the majority of conservatives or center right they're not hard right there center right\nNow a lot of people was that the see them more writer but I don't think anybody wants an extremist right movement in this country because that can be oppressive by its very nature it's just a different type of oppression\nAnd that's why you know so many of the Republicans we're we're so antithetical to the extreme and some of the laugh 'cause we refuse to adopt that same ideology in our own political viewpoints\nBecause it's detrimental to the whole Jimmy Durante set at best a former comedian why doesn't everybody just leave everybody else to hell alone\nBecause what's interesting about our society is in our communities is that what we're left to our own devices without the influence of the federal government we typically get it right but you can't have a one size fits all identity\nYou know I I was talking I was talking to Dave a few moments ago and when we were talking about in the parking lot just about marketing and business and things like that and you know let's let's assume for one second you own a company that manufactures\nClothing for example for ... let's just say bigger people okay and you build your your bigger people clothing store in Birmingham or Atlanta you'll have X amount of a market\nAnd your company is probably going to thrive\nWell let's assume that are are closing for bigger people store wants to expand and we want to build in other markets it doesn't make any sense to build the bigger clothing for bigger people store in\nPoverty stricken Bangladesh why 'cause there's no bigger people there and I realize I'm I'm being somewhat tongue in cheek here but the point is is is is that your store and it can look like anything by the way to be successful\nThere's got to be a market for it you just can't superimpose\nA one size fits all ideology\nNow you guys know I have a background in foundation repair and waterproof talked about that a hundred times on the air\nAnd there's a lot of foundation good foundation companies in Birmingham in Huntsville and all throughout the southeastern United States but you don't see much of that foundation issues south of Birmingham as you get that closure timid guy marine down towards the state line and the coach why because the soil is different\nYou've got lonely or Sandy or soils the further south you go as opposed to the rich red clay is of north\nAlabama so the process is different because the market is different that was the ideology behind the states and the original colonies so when we have this one size fits all\nWhether or not it's in our business practice or just in our business or or or corporate practice of the nation\nA one size fits all policy or offering\nDoesn't work you're not going to build a distillery you know you know next to a Baptist church you're not you're not gonna you're not gonna take you know uh I\nYou're not going to build a distillery you know you know next to a Baptist church you're not you're not gonna you're not gonna take you know a a a a beer taverns for example and to you know a Mormon heavy community and expected to thrive\nBecause of the individuality of thought and ideology and theology perhaps and when the federal government visa V. healthcare tries to super impose a one size fits all idea it always fails and this is why we have stage intellect neural colleges\nWere not supposed to be one folks were supposed to be fifty individual communities that are essentially all moving in the same general direction the benefits the most amount of people\n\nNot again that's the best theoretical to a degree but that's the idea back when the colonies the colonial days Georgia was Baptist\nThe Pennsylvania Dutch ... Pennsylvania the Catholics were in Maryland but we all have the same thoughts we all have the same desires to interspersed and commerce with one another individual communal with one another we're not supposed to\nWay that you just described it Gingrich ... wasn't hard right\nWell here's this far right is this country has seen it since the uh\nYou know there is there a center right there is right and then there's extremist right we've never been an extremist right\n... exactly what it was I Would argue that in the beginning when we were levels when we were\nA guard against the crown we were we were those people fighting in the streets against the theocracy and that was as far as you'll ever get well I mean they weren't in the middle they were for writing as you can get at that time they certainly weren't to the left when you lose rights every time they get a majority\nThere were some there were some a theocratic aspects the king ... third but that was not even a horn right extremism they had free trade they had commerce had ownership had private private privacy law private privacy laws I mean you know but even that's not extreme is right\nThe patriots did but the came one at all his uh and all you had to go his way or the highway put it that way\nYeah that was also that was the posturing of economics not so much a theology\nYeah yeah 'cause he wanted his money back for one thing I mean what are they had invested so much in the Americas at the time that he wanted to use the stamp act and everything else\nAnd that's why the commerce clause was drawn I mean I'm not arguing that it was it was absolutely economic exploitation\nYet again again you know we're talking about the hard extremism of the writers were the state controls everything because you know something you know something and I share this with you before and you know you know this is true extremism to the left and extremism to the right are eerily similar\nIt's just what they promote it's different\nYeah I agree one hundred percent and I agree and I remember when we talked about the in the past but I I Would also argue that you lose rights on the left but you sustain those rights when you went to the right and that's why we\nThink about it this way since you're going to attempt to go high article on me you actually sustain more of your rights in the middle because in the middle everybody leaves everybody else the hell alone is has the rent was fond of saying\nWhat a profit was draftee yeah ha ha ha ha no doubt or say\nYeah but that was a that was born in your uh the ... yeah but that but do you what the uh\nHindering him on I mean you almost made a point there and then you blow it we ... do\n[laughter] yeah I just I just don't you why I agree with you when it goes so far right we could end up with a theocracy is\nThat I I never I never I never ... Henry listen again I never said I saw that coming to the point I'm making is we wouldn't tolerate the extremism to the right so why are people in the lab tolerate an extremism of the left it's called a metal for or if you prefer an analogy\nI agree but you know you don't look so good about going so far to the right that in the right party and the Republican Party we have the middle of the ground that we go to in our own party the conservative agenda which pulls self report selves back\nFrom that geography by that agenda that would pose so far right there was no a check on the left do\nThat they know I and\nAccuracy by that agenda that would pose so far right there was no a check on the left do\nKnow that they know I and I don't I don't argue that I don't argue that Henry I I got to go but I got a bunch of calls coming in\nWell thank you for the electoral college and a summation it was very good way of dealing with the other one's thing is that every one of them lives through a central all our government and that's the point we can't allow centralized government by thanks Henry operation [noise]\nGod I'm through the ringer I'm right through the ringer hello murder of how are you\nI'm doing All right ah I just got the email news updates from Fox Roger Day O'Connor has early onset dementia\nTrump gets his third appointments O'Connor hell is about to break my wife about what what about you mean ... Ginsberg\nNow I mean Sandra Day O'Connor okay\nJack Jack Fox News I just got the email okay\nAnd that is that's big\n\nGoing into the midterms keeping and taking the majority in the Senate\nIs even more important now\nMy my off base on this I missing something here well I mean you know she's she's obviously you know retiring but Sheena she's\nYou know not on the court curly\n... Linda she stepped down\nYears ago really yeah I think she was thought who replaced or was that Kagan ...\nWe've got sort of my our Kagan on the court and Rudy\nDarn it [laughter] I was just getting really excited a but still point is to get\nSenate yeah we do but now you're our I'd had done it [laughter]\nI don't I I ... you can hold out hope Trump's got to get another nominee I fully confident that\nYeah well I certainly I think so as well\nAs I can learn but yes I appreciate it right yeah\n... has been off it worked for years but certainly you know\nAnd and it's true she has the beginning stages of dementia but I got him know how this woman must be pulled aside here\nReal quick and see if we can say no to the CIA retirement ten years ago I'm not seen in a daughter here and I thought it just matters\nBy a hey look the west has called in hello stay how are you\nFrom ... to try to agree with that\nBut\nLet me kind of go back a little bit of a court once you're talking about this pendulum situation that we got going back and forth\nAnd you know when I talk about this is well we get into this extremism we're starting to see the last movie and I think the right moving that much further was because the lab has become so far to the\nNature of course\nWhat are the chances every one has been asking us ever since you got together on that radio station ... about the possibility of a third party\nIn the right lose so far to the right and so part of the lab do you see the possibility of a legitimate third party coming in the middle\nYes [noise]\nIs probably something that [noise] because I agree with you like a question\n[noise]\nThis is probably something that has like a question without knowing what you're going to feel like that will happen in our life\nYes\nNow now let's not say also that I'm older than you and so I have to to find the same time that's that's a phrase that and not say our lifetime but in this generation how 'bout that\nOkay I was there I think we just don't think a legitimate third parties jury this if I\nLet me let me let me ask you this and let me ask you this then define legitimate\nOne that's got a legitimate shot in claiming\nIt might be in the twenties thirties I don't know if I'll be around in the twenties thirties by and and it might be on the outside of you know whatever time I have left on this mortal coil\nBut I Do think you're going to see some pretty significant progress now by definition your definition of legitimate I don't necessarily know but I think I'm going to be enough to sway future elections for the two dominant parties\nI I'm just you know thinking about it I mean we're still having helped man on the Republican Democrats that despite the fact that yes we are part of this none of them really have a legitimate shot at the White House I'm Talking about one that has a legitimate way\nFrom the electoral perspective you're spot on [noise]\nThat's that's the one that I'm curious about certain that I Would see it in my mind I don't think\nThat unfortunately is Dave it's a coin toss it at this point in time I actually hope we do I don't know what that's going to look like but you know we're going to find out about two weeks as to what the future of either of these parties looks like\nBecause depending on how this thing ends up if the Democrats when they're going to go even harder left and the Republicans when they might very well stay in tread water for generations become\nVery well maybe I won't talk about it soon absolutely I've seen a few days ago I\nWas going to be joining us in a a upcoming edition the program you all stick around last break my heart joke come right back\nYou don't have to agree with Michael heart\nYou can choose to be wrong if you want to get the money go show\nThe following it does not necessarily reflect the opinions or abuse of Crawford Broadcasting its employees affiliates or advertisers Jefferson County sheriff Mike ham\nBefore school started I was hanging out school supplies in Smith is\nA little ... girl told me that she was scared to go to a new school\nMy heart broke for her and I reassured her that my deputies and her mom would be there to protect\nHer crime doesn't know political parties and criminals don't care about race or gender when I was first elected you're sure if I made only one problem is to keep your neighborhoods and your school site\nBook because of his platform and his promises which resonated with there's\nMillions think that will happen in November for the very same reasons that was one who was conservative I Am a proud of it\nAnd a traditionalist and a constitutional is am I ever one who believes in the rule of law and the protection of our individual freedoms under the constitution at all costs\nI Do hope and pray that happens I Do hope and pray there is a red wave in November two thousand Eighteen\nTomorrow only two of Tim trust news organizations I Bill McCollum\nW one ... do we ... do you do thirty Seventy ... W. B. J. C. H. D. do\nYellow hammer News Good morning I'm Audrey entice the president of the Alabama public service commission twinkle Kavanaugh's expressing her personal opinion on President Trump's affordable clean energy policy Kavanaugh says it's a replacement to the Obama administration's clean power plant\nAnd is protecting rate payers as well as providing reliable electricity with a much more balanced approach Kavanaugh says the Trump policy places more responsibility on individual states to meet the emission standards without dismissing the use of coal or crushing the consumer with skyrocketing costs\nThe mobile county commission voted to dedicate to point five million dollars to build an athlete center at the University of south Alabama\nOr crushing the consumer was skyrocketing costs\nThe mobile county commission voted to dedicate to point five million dollars to build an athlete center at the University of south Alabama the center will be part of the universities new stadium campus it will be called immobile county Center for academic success and will serve more than four hundred student athletes from all Seventeen division one jaguar sports\nThe facility will provide resources for student athletes to succeed academically\nMontgomery police released photos in connection with three suspects one of her burglary and theft\nThe crime occurred on October fourteenth at the Alabama State department of transportation property the three black male suspects were caught on surveillance video well breaking into the property a cash reward as possible for any tips that lead police to those suspects\nAnd the Shelby County sheriff's office is offering a free self defense class for women on November third\nThe classes designed to teach women to spot and avoid dangerous situations and how to respond in the case of an attacker\nThe sheriff's office says that with the holiday season approaching crime increases was stolen items and women are a prime target registration for the class can be done on the sheriff's office website this news is brought to you by attorney Alexander ... a man for the people from ... Alabama stories go to yellow hammer news dot com I'm Andrea\nHe's a bald guy and sometimes he kind of ... talk I'm willing for a small businessman will grow twenty first century jobs and will be a loud voice to help existing Alabama businesses I'm willing for Aynesworth is the husband to the pre K. teacher\nPhil expand voluntary pre K programs and speak out for classroom technologies I'm willing to work always bold sometimes loud will Aynesworth will take his job seriously and [noise]\nOne million two million and even farming and these are the results are expressing hardworking attorneys have been able to provide for you and your clients all over Alabama I'm Alexander ... and\nMyself on being an Alabamians\nPart two of attorneys are knowledgeable and relentless when it comes to represent injured flies here in Alabama every case isn't a million dollar case but we firstly go after insurance companies every day as if it is I'm Alexander ... let me be your attorney borders dishes may call it the least of which\nWater main break port is sponsored by always money so please don't forget we have a road shut down this is old leads wrote it shady lane it's near shades creek parkway and just shut down due to a water main break so please try to find\nAn alternate route around that until they can get that contain also with congestion south on ice four fifty nine that has just passed that thirty one derby parkway expect modern delays from that as well\nAll ways money always money is the best place to get an auto title loan abducted things I was in dollars and customers a trusted them for nearly Twenty years and so can you visit always money dot com to get started lows of the two approval\nI'm terra Thomas the traffic on superstation one on one W why de\n... that makes sense in classes low seventies expected today forty seven overnight low tonight it'll still be nice and driving a hike let's just Seventy and then a chilling rain arrives for Thursday and friday\nIt's just you have any GM Thirteen meteorologist staffing lack of any forecasts on his Crawford Broadcasting station [noise]\nTakes a special moon justice of\nWhole other sort of\nGo research there's others [noise]\nHe takes a whole other sort of\nGoes the scissors that whole other\nRoom everybody's got to be ready or the day a Tuesday Thursday a [noise]\nYou've almost be better make the November that morning out there in the heart of God's Country while I'm watching the mini mini monitors\nHere it's got to be some radio headquarters oh I turned about laughing at just the big day who was ... it looks it looks like the ornery meters off the charts on big baby as I said anything to us this morning that but you're going to be an air we gotta show which was like seven\nOr eight minutes ago now big day\nIt doesn't matter you're likely she pants Bonner ... up there to\nThe ... what what happened to you big day why or why are you still want to read it I\nMean people care I don't know why they care but people care I have family members who care if you're up said if your your feelings are heard I've got thousands of listeners I don't understand it but I feel that it is necessary to allow you to be up to the public because they are concerned\nBecause we can let these idiots in our country\nYou mad about the hordes the army the invasion the invading army of rag it's one thing that I could have nice uses up by the way by\nBetter than mine I got a hold of mine I've just well\nThe you know there is a dog gone I'm\nWatching TV and there's an ambulance taking care of them go to first they stopped going on in the chicken the calls you know with the lonely torturers walk to invade the United states\nIt's a long and tortures wall to walk them to block swimming get back on the truck we'll ... those two boxes of all why big Dave others are the wind is hurricane cannot get over there quick ... big\nDay have you not been paying attention it is clearly\nOur fault that Honduras is apparently a crap all it is our fault the Guatemala is also apparently a crap all it is also our fault but El Salvador is also a gravel\nAnd know how ... how was that America's fault I don't know because we are not Russian there for vacation and stuff\nWell maybe that's why they're having to come here we're not down they're laying out on the beach checking the place out zip line and do the jungles if we were they would all have good jobs wouldn't have to come to America\nWhile I'm totally your fault big game is hurricane cannot get over there quick enough to disrupt\nAnd stop them\nA wishes hurricane was named wrong [laughter] hey\nYou're very upset I Would ... to see how this turns it would make\nMe even more proud if the hurricane was named big date and it just blew them all all arguing I'm Sorry for ... for no one there their phone most powerful drug violence\nNow I don't know why the thousands of Mexicans are\nOh sorry for not one they're they're almost cost rather violence now I don't know why the thousands of Mexicans\nAre joining the army because they have jobs galore Chris rate is with us is buddy Dallas Dallas last name dollars 'cause you have your own\nFarm in Dallas Coleman is a Dallas cold when all from dot com do you have a billboard yet come a no no Coleman is okay six or seven thousand billboards you don't have that yet either oh I'm getting up there by two thousand\n[laughter] you know Tim ... today actually is going to be a big day for more people joining because it's the keel a Tuesday in Mexico\nSo they're going to have a big party who knows who's going to join in that thing to have an awesome time\nThere what is it that the ... Tuesday and talk ... ... ... have accounted conga line in Mexico it's not a Congo\nAnd that would be another continent as a Congo not so they go Congo and towards the United states\nDid you see them burn that of that several of them had burned an American flag and then\nThey they put a swastika on it and then they put like drums face on it and these people are like oh we love America and I was like yeah I mean you gotta be kidding me\nAnd like you said like everyone's like oh there's a bunch of women and children it's mostly a adult males who we have no nothing about the cartels obviously going to be a part of this we have zero\nBroken immigration system I'm going to lose my mind\nBecause our immigration laws are only broken because we don't enforce them in court rulings court rulings throughout them frankly in my opinion ought to be ignored but because the constitution says the ... the United states has the authority to protect us from invasion\nAnd I personally believe one he legal aliens coming over the border counts as an invasion\nYou don't get to come in the country you're invading the country you're invading our space I Would tell the Ninth Circuit your number one and you know exactly what you mean that I Need a circus bunch on a giant\nHit it was a caravan of sweetest models coming here I mean I think I might you know that's one thing I say we just let\nYou know a lot more border we don't have to work every day that would be as ... down they're letting the man that don't merit based immigration yes totally their nose to the why a lot of money\nAs I don't have their own ... you know after they do have to if they don't have they don't have their own ... they got to say [laughter] say over the [laughter] the welcome to the program thank you for listening\nHey how are you today I'm doing pretty good and good heart it's oh it's perfect solution to our immigration dilemma yes ma'am tell us\nOkay you take all the liberals who watches CNN and ... down to the water and Cook County a personal like going to be wholly responsible\nLike that's kind of a adopt a Margaret program yeah\nI mean if they're willing to do that and the whole law for us to get in trouble they go and tell you\nOh like that like that totally responsible if it turned out to be him is Thirteen and you or kill somebody or sell some drugs like you get to go for the same sentence I like that\nSo that lets off landlocked completely\nThat's a really good idea because all the air I was talking about sending creating tent cities in the most liberal towns in every state\nAnd enforcing five six seven hundred a thousand new illegal alien children into the school system and that school system can absorb the calls\nAnd and we might have the change of attitude of some of our elite leaders if that was the case\nLike I said they're responsible for them you know that's fine as long as we don't have to pay for them and they do\nThat is good and they need to employ them also make sure that all their needs are met\nYes ma'am great idea they I mean thank\nYou I don't know the doctor Margaret Chan for every one of them that comes into them go out we have to trade\nYeah wherever soon too liberal into one and let's see if we can get rid of ten liberals for every one person who taped\nNairobi are well yang Han ...\nUnless this trade let's just trade Hollywood oh we'll just we'll just we'll throw all the Hollywood people out send them to another country and we'll let the illegal aliens have those homes have those businesses I mean the movies would probably be better anyway if somebody else to do and\nThere's some good there's some good actors though I mean you're going to happen\nBones had those businesses I mean the movies would probably be\nBetter anyway yeah they'd if somebody on doing I mean there's some good there's some good actors though I mean you're gonna miss entertain you really you know it's not as many as there used to be Tom Cruise he's still good you can talk root zone that that concerns I Know a great we're in Dallas is either not only that you know I'd rather go back in the game though\nNo one was I'll tell you he's conservative do\nGo to hand Henry welcome to the program if you say one thing positive about Tom Cruise I'm I'm a have a heart attack is short\n[laughter] that's that's not very positive so I'll give you that right [laughter] I was going on in that\nLast caller was mentioning something pretty good you know there was a time when we used to have to sponsor an alien before they came into this country there was an all black and white movie called the glass wall and uh this is when a of course\nIs that before we moved it up and made it a glass ceiling entering the guy's a what\nOh God of love but I got to tell you I I the glass while you oughta go ahead I don't know if you can even read Hollywood's probably hiding it because this is when are they actually do the Americanism as a ... attributes of\nGod leading us instead of us something a start up a by uh the devil itself as what we've become to the entire world maybe just beginning to believe that one of the great Satan like Iran does but\nI wanted to speak to this day\nWho has all this violence attitude towards these fine um immigrants\nYeah guild being gay is always being judgmental not very nice and had\nTo say what do you guys are you hearing you know when I got on I think we're going\nTo hang he is in a bad mood ...\nWho's our ah they they they succeeded in shutting me down or they took it interfere with a woman who said she's coming here because her husband as violent I don't take ah she's been to Chicago Russia Iraq yet what she was holding\nHer special needs child nine years old and there was a they also showed that Down syndrome children that needed care and uh with the other women say we're not supposed to say anything we're not supposed to we're supposed to be empathetic towards this\nMob that's uh invading our country because they have children with Down syndrome and special needs children as PBS NewsHour made sure\nAnd broke my heart to know that I was against\nSuch a a an invasion by this need for children now why are we going to pay\nMillions of dollars to put them through school and a special needs program and everything else they're not coming up here\nTo help America vote coming up here to use America because they know a lot of the trip that any of their governments are going to take care of with Down syndrome child or a special needs child now I don't get it but obviously I don't have the empathy that big Dave has his mind Matt\n... thanks very appreciate it All right we'll just prepare yourself that the coverage is going to be\nUnbelievably\nEmotion driven and if you pick out like you can find a few people that are very empathetic and seven thousand but the overwhelming majority or help the able bodied male who can who can work in their country and there are jobs that they could do\nWhy don't they ... I don't really make their country great I don't understand ... along the ... lines with his adopted Margaret program you know I'd like to adopt illegal in any legal program but it's just too hard adopt them\nTo be great I don't understand it you know along the lines with his adopted Margaret program and I I like to adopt illegal for any legal program but it's just too hard adopt a migrant\nFlows off the top are still criminals\n[laughter] be remind me to remind folks are not playing a missionary economics plan I was gonna say if the doctor folks here\nAre what Nancy Pelosi and Schumer and everybody else and they're making America great\nWhere only great because of these young minds that are entrepreneur is the brilliant they all want to be doctors\nThey are the premier people in this country we should send them back to their home countries\nSo they can take their education their talent their abilities and turn that place around if they are so wonderful they should take care of me they should be sent back as little seedlings to create a bountiful harvest\nBack in their home country ... they're going to take care of you to offer to really great compromise that will will legalize one point eight million if we can change the entire system and there'll be last time will change it and the Democrats weren't even interested when she was well Reagan the ... just care about the the\nIssue Reagan did make a big mistake he believed people were still\nRight he he so I'll do this and then you all do that this time if we're if we're going to do with Trump leads to say you don't do that then live this coral welcome to the program\nScott how are you doing man I'm having a fantastic guy ever again as all here\nWell we got a dilemma owner hands that I don't know if if if I Would turn about a hundred thousand of rail United States citizens\nPack their bags and go to the go to the battle zone we were getting all around by terrorists or all it is in\nThe Democratic party is declaring war on our country's Scott\n... let me ask you a question if you and I in in ten thousand Alabamians got together and say well we're going to go to the border and we're going to make sure those ten thousand\nPeople don't people don't invade why do you bad that you and I would be treated more harshly than the folks are going to be treated to invade our country and you know I'd\nGo on a minute San I pack my bags you're my gear and I'd go I'm ready to stop this crap you got it now and I'm only speak to the Democratic party that listening to this right here in America if you're American\nAnd you don't assessed are you going to vote for a party of trying to get control over there for the power and you don't want 'em to destroy our country you're low down snakes Doug man\nYou got it they saw that said you know I don't disagree with you at all\nAnd I understand the passionate is it is I personally think when we find out who's sponsoring this march they ought to be held accountable I Know is making the rails that it could be ... money et cetera three or four or five different\nNation as part of the the what was that the a treaty of Tripoli\nOh I Know I don't disagree and not to mention Jonathan don't forget we should probably stop our social where ... welfare programs because\nThey have been promoted under the guise of\nFeeding the poor eggs and that is religiously based and we need to abolish it\nAbsolutely absolutely I just noticed a whole lot of that on CNN last night where they were\nYou know by say throw in Christianity back at any by the you know we can say theirself a Christian because how could you dare not want to bring all these poor people in all of them up not bad if they just cross over three countries to get air I think they could have found a place of states wings four and a half way\nBetween here and there I can find a little bought on land and plan a little garden on\nBuilding a wall moose was what I got to say that the people that are ... million all that stuff about about the ...\nWhat are they saying first 'cause our listeners don't know because Jonathan said they're using Christianity gift you I call it bart's use shame right if you were a good guy big day you would be for these people so somebody is sent to a private message now I have to say who right why did they say\nRemember you are a child of Christ don't fall to the temptation of hey OK number one\nSaying that we should obey Caesar's laws unless they go against his\nJesus said\nThat we should obey Caesar's laws unless they go against his laws\nOkay yes that's fair enough okay I rest my case\nAnd plus they did a poll that and so I think it was Latin America where they said a hundred and Seventy five million people said they would love to come to the United states imagine if everybody that wanted to come you're just in her own hemisphere we let them it would overrun the country we can't take that many people in our ... ...\nIt's just okay there's a lot of people want to come here but we have limited resources we can't we already were the most generous country on earth when it comes to\nAllowing immigration we take a million new citizens a year\nBut at some point you have to say okay we we can't take everyone and that's not a a faith\nThing I'll ride go why but I Can't afford it\nIt's hard to walk there and\nWhen it's time to get on a boat or a plane\nWell they knew that the kind of do like they do in the Mediterranean will just get on a boat and cast it over there maybe what land over there\nBut you know in Hawaii I've heard you can't be a citizen if you haven't lived there for so long\nYou why yeah are you sure or the other one is a state I used to do that's what I heard we got here don't base book got in here that there was a lot of winter they don't they're not as they do to know how to address a limited I [laughter]\nI loved it because I think that by somebody to help me out here and welcome to the program\nYeah several points on this caravan I think that Trump's right we need to send the military down there\nBut also argues for the ... are there real need of a wall that right we can't get to well done in time for this particular situation support the military down there but I Would also issue or a threat to Mexico if you don't help us get control of this\nOr you want to export anything you want to have you ever heard of ... naval blockade and the embargoes you want to do business with the free world Mexico ever again\nYou better get control your southern border ... and ... and help us get control of the mess you've allowed and perhaps supported in your country right now in other words you we we got to demand it may be an ally in dealing with this caravan problem\nYou got it I said I'm not sure they will be\nThere doing more than they have done on this issue there at least ... some of them they're just saying well ahead of the guys at the bridge but I mean we just saw the video earlier they met her I don't even have the resources they don't have the resources that was a dollar bill\nThey are in charge\nThat's a good point why didn't show called the ... the Democrats think they are linked together anyway you know\nMaybe I guarantee the cartel gets down to ... and ... and there would not be any video footage of what happened was the car sales hiring in Mexico high paying job you know that no tax is it'd be a farmer and yeah I mean Margaret correctly from Harmon help your on from the earth you know knowing what's going on\nOr off or is there a separate professional ...\nThere you go that'd be where I've always thought if we can bring back legitimate gladiatorial fighting we'd get us an island somewhere and\nI don't know Central America and um have real gladiator game to be when you get a million dollars if you die will bury you in Chicago and ah I think people watch it we do pay per view\nThat we saw some security you know like ... how did the old people find out obviously and then the ones that when you get it and one's in don't you know you had lived a good life that was a that was going to be good for dancing nationalized medicine to yeah\nBut you can do now\nSo you know he had lived a good life that was a that was going to be good for now I think they know socialized medicine to help\nUs NASCAR a bill or their ability\nYeah but the super NASCAR you got to make the cars look like um what's the old Mel Gibson movie where they're\nYou know what I'm Talking about you got to have you got to have big banners that are made out of swords you gotta have guy he was you had\nTo choose no Braveheart no not right for the Patriot road warrior rub the only way road warrior ethic before your time you\nKnow I had moved like one of the er again a mad mad Mad Max that's it that\nWe got nice noting that there are you Mad Max\nWork but then I make sequels to that that maybe it was terrible they've done and they made a recent one that got the girl that was pretty good it was like doing actually pretty good it was surprising it usually sequels are in times worse but yeah it just amazes me heath welcome to the program\nDoing pretty good Mr base I Want you to help me out with something just a poor country boy lot me it just seems to be on my understanding is seen as pass commonsense how is showing id to vote how in the crowd is that voter suppression\nThe you know Mr base and I used to live off the grid I still do ways but you have to have a day to go to a doctor he had to have a day to do anything and I got this thing called the real idea at yes but obviously in some states someplace they're showing on a vote that's voter suppression\nThat's right ... how the legal going to vote illegally if you make them showed ID go to only ...\nThere's only about thirty million of them here I mean that's something the low ball ... I mean so he don't and they want to talk about Russian influence an election but they don't seem to have no problem with all these illegal was coming over here\nHow waving flags of the country they just lay off they hate this country and they come over here for the free stuff and they're both in our relations I mean\nAnd that that but ... but that's voter suppression if we die or make them showing ID I mean give me a bright Mr base in those people buy this stuff\nAh yes some of them do he thanks buddy I appreciate it that reminds me there's a story out of New Hampshire where a judge in New Hampshire this story about sharing Bernstein from yesterday\nNew Hampshire judge on Monday put on hold on law you know what the law they're big\nDave it required some voters to present proof of residency when they register so what was happening is when the flood of people register right before the election\nThe state of New Hampshire was saying hey look we don't even know where you live you might live in New Jersey you might live in New York just because you want to vote over here and you're signing up at the last minute we don't necessarily want to be voting for our congressman or our state legislature door so tell us where you live\nI mean and this judge says no\nThat's going to suppress the vote might disenfranchise someone\nWhich is weird because New Hampshire is wider than Elizabeth Warren's ancestry I mean like there's I mean there's just not an illegal immigrant or anyone that you could say that is trying to do that without you know like in California and Texas oh well what went on places\nIs that people have figured out that they can go and register to vote in some of these so they are voting in New York and then they get bussed over and they vote in New Jersey or they go to ... because\nThe states don't talk to each other on who's registered to vote and if you just decide I'm going to go vote over there and you say I have a\nThere was a program it might not have been twenty sixteen it might have been in the Obama reelection where they were advocating people\nBut I'm going to go vote over there and you say I have a resident I mean there was a program it might not have been twenty sixteen it might have been in the Obama reelection where they were advocating people to move in and live temporarily quote unquote Tipperary in some of these dates and vote and let their voices be heard\nLook you think we won't go across state lines get a lottery ticket we won't go across state why don't you go get you a lottery ticket not yet I Want to better their ... wrote a lower night or no to that one of your mind when you have to that that is that yeah well\nHow did you go into a billion dollars if you don't want to go get one point six million right it is yeah I'm Down some of my friends love me and they went in and help yeah they all have to Mr Big with that attitude this big what's going on\nAnd I got to give some props to big Dave everybody's on in this day but I'm One of them on the illegals saying\nHey I'm with their motives policy but the personality of rotten\nAs big stick together [laughter]\nThey are the only thing is All right but I Believe the ... making a celebrity death last night the first one between Trump and Bob Mueller\n[laughter] okay well in the hands when we can do\nBy it and he's he challenged into a fight that'd be a quick bite me look Biden he's ... he's real frail and drugs like it means a fat guy you know like you just with his weight and I just could jump on them\nPart could cause right all liberals away everybody else's money never ... on on the line I mean\nThe unusual step right up on the line look right in the eye and say you want to go only one of his walking away and [noise] ... [noise] like you're saying\nYou got it they were headed to the locker room bill you'll get the ball the storms like if you don't want to miss it will be back [noise]\n[noise] oh you want to do ... Coleman W why do you are you in Birmingham\nW two or three Seventy ... W. B. J. C. H. D. to Birmingham\n[noise]\nThis is yellow hammer News I'm Andrea entice the department of justice announces and expansion of their database to allow twenty five more tribal authorities the tribal access program will provide the tribes with the ability to search the national crime information database\nBy the end of twenty Nineteen the total number of tribes that will have a kiosk that allows them to use the database will be increased to Seventy two the deejay says that for too long the lack of access to the criminal database has hurt travel law enforcement agencies from doing their jobs and keeping their community safe\nA juvenile crime wearing his busted up in Tuscaloosa by way of a vehicle accident three juveniles in a Ford Explorer struck an unmarked police officers vehicle as the police officer was leaving an accident investigation\nThe three juveniles ended up ... the vehicle and the scene police and found out that the vehicle left behind was stolen two days later the investigators found one of the juveniles through fingerprints and caught up with the other two as well three stolen vehicles were later found in several other people were arrested in connection to the theft ring\nThe edible county sheriff's office was looking for a missing Gadsden man forty one year old Jeremy Lipscomb was last seen by a family member near a boat landing off of fits very road he was seen on Saturday let's come as white five foot eleven a hundred and sixty five pounds of brown hair and hazel eyes he was wearing a brown T shirt and khaki pants\nThe last part of highway Seventy two in Mississippi is now opening all of his four lanes that traffic the roof goes from the Tennessee State line to the Alabama State line the four point to Mali expansion costs twenty nine million dollars to add more lanes and new interchange unreal line a connecting road\nThis news is brought to you by attorney Alexander's are Nora a man for the people from ... Alabama stories go to yellow hammer news dot com I'm Adrienne ties [noise]\nWhen it comes to representing injured Clive it's all about the numbers I'm Alexander ... I\nHave over Twenty years of experience and her service well over twenty five thousand ... we have over eighty knowledgeable attorney in\nOver two hundred helpful staff members we're fourteen officers throughout the great state of Alabama we have recovered over three hundred million dollars for a closet have trusted and believed in our ability to give them the numbers if you want the numbers in your case called Alexander ...\nThree two three one tiles stations makes quality leaves\nWhich has been for many years\nDid you know your hammer news airs on thirty\nFive radio stations across Alabama every day in addition to our five hundred thousand plus weekly page views on one and yellow him are also delivers the news to over one million listeners let us tell your story to the people of Alabama contract our business development team today and see how your homework and help grow your business Courtney at your home or news dot\nCom CEO you or cheese\nThis was developing team today and see how your ... your business Courtney at your home or news dot com C. O. U. R. T. N. E. Y. at your ... dot com you'll hammer news we know news we know Alabama\nAnd makes chips and planning classes less seventies expected today\nForty seven and the other night to nine to still be nice and driving a high class just Seventy and then a chilling reign of rights for Thursday and friday it's just you have any VPN Thirteen meteorology Stephanie lack of any for cats on his Crawford Broadcasting station [noise]\nFirst of all sorts of stuff is\nA whole other sort of [noise]\nGo for that whole\nSuper station one oh what\nWelcome to the program everybody's got to be ready wellness data twenty third day of October a Tuesday in a year or two thousand and Eighteen where we\nSpend all week saying something about a certain issue a big baby wakes up reads it on Facebook comes in indignant and everybody calls agreed with big day\nYou just don't see it in the wrong way\nI mean my aunt she's like I agree with big day be nice to have blah blah I'm all love the big day these\nCountries like he's like teddy bear you know and his voice was like ...\nLike turn your phone off get in here why are you ate I wanted to get\nJust trying to try to keep restricting ... Good Wife charley is said to Me Margaret typical [laughter] oh I like like I'm not saying you're while I got like a good or not that open them around yeah yeah there you go\nThe or is there any real news out there there is Obama has given a couple of his speeches\nLately if you are not aware of that he gave a this was an article over at the American mirror\nObama says he has a lot to say he referred to himself as a thirty eight minutes speech we need to have we need to do with give away but we don't have anything to give away we're going to do it with our three people here\nWill do it over to under\nRocco bomber gives a public speech\nIn Nevada for thirty eight minutes your job each one of you as contestants let's go to the radio serving your go with that\nI worry about what can I have a question of how many times did Obama refer to himself\nIn this campaign speech it's supposed to be helping Democrat candidate Jacky Rosen in Las Vegas ... big day goes when he five twenty five at least Chris Reed goes with twenty\nFive I think over one thirty eight I think more and more you're going forty yeah to a new one\nThat was when we go by not even getting their half\nI thought it was not really wants to men if he was Ninety two time wow in thirty eight minutes did rock Obama refer to himself and then the trumps the nervous system [laughter] in the first four minutes and thirty seconds\nEight minutes did Iraq Obama refer to himself and then when they\nTrump's assistant [laughter] in the first four minutes and thirty seconds\nHe did not can call us a republic\nWhere ... democracy over and he said in this democracy while I'm telling you I don't know how long it's going to take for this to to catch on in the country and I hope people will remember that we said here first\nDid the left is telling us and has been telling us when they keep saying\nOur democracy Trump as a threat to our democracy conservatives are a threat to our democracy they are not talking about the United states as we know it based on the constitution and the republic they are talking about\nTheir vision for what the country should be when they get to mold the country and their image that's what Obama\nSaid when he said he wanted to fundamentally transform the United states and then put mostly comes along Cortez comes along Bernie Sanders comes along and when they say our democracy they do\nNot mean what you and I think they may they're telling us the truth\nYou know Dallas made a good point the other day said we got rid of the monarchy too quickly you know like [laughter] we just we should have pay a little extra ... you know like the British had things or you\nGet the day the people we have in this country today had been around at the founding of this country we would still have the time yeah they wouldn't have fought the British no heck no that would be on Christian is old sweet tea or the British did ask you if you want one love her too so it would it was sweet tea OK okay ...\n... Americans had like ... like we had incredible backbone like they were they ruled the taxes pretty minor which was like listen you're not live or nothing it was nothing but you're like you don't let us have a say in your parliament's screw you were saying it\nRight and we're not we're not giving you every everything we've worked for for some little percentage I think it was three percent there was\nSo slow are we willing to pay that right now I ... I always Lucian to get back to three percent off I mean\nWhile the president was also because he is on the trail [noise] he was campaigning still in Las Vegas is another article this is over at buzzfeed where rock Obama said when you hear all this talk about economic miracles right now\nWhen you hear all this stuff about how great the economy's going I'm going to give you the quote\n... when you hear all this talk about economic miracles right now ... member who started it\nOh trust me I have an opinion I was just trying to give you a little time we'll be right back\nYour listening and we just recently the following it does not necessarily reflect the opinions or views of Crawford Broadcasting its employees affiliates or advertisers Jefferson County sheriff my town\nBefore school started I was handing out school supplies and spent\nA lot of first grade girl told me that she was scared to go to a new school\nMy heart broke for her and I reassured her that my deputies and her mom would be there to protect her\nCrime doesn't know political parties and criminals don't care about race or gender when I was first elected you're sure if I made only one problem is to keep your neighborhood and your school site\nFor your share my town on the back of your ballot\nIn politics or people who work hard to divert your attention from the great work being done by your sheriff's office don't fall for their politics and policy it is it politics taking drugs off our streets just the hardworking dedicated and we'll try and sure shifted Democrat Republican independent minded to serve everyone and protect all\nEveryone can vote for your share my camp clip your ballot over to something from my camp\nPaid for by the sheriff macho campaign PO box to six non trust for for five one seven three [noise]\nThere are three types of people in the world the sheep civil and uh she talks that protect us she\nShe thought firearms as the burning in areas brand new indoor handgun and rifle range located fifty nine hundred deer fit parkway and Trump though the owners are the dogs are military and law enforcement veteran whether you're new to shooting or you just want to stay sharp\nHow your skills with NRA and FBI power on the instructors prepare for the day that you hope never ... ton at the rains may just save your family's life is at our Facebook page or cut a seat thought firearms dot com or you can give them a call I see if I was five eight six for one seven zero zero down the U.S\nTheir Facebook page or go to sleep dock bar arms dot com or you can give him a call I Choose your both by eight six for one seven zero zero don't be achieved joined up ... with Keith dock bar on [noise]\nStop water damage before it takes a toll on your home basement flooding can called major damage to your electric system rotten wouldn't structure along with\nMajor health concerns basement waterproof singing crawl space and kept selection is just another way Alabama professional services is here for your home abs use this top notch product installed by\nTrain technicians to put a stop to\nThe prophet called a shield it to zero five three one nine nine seven nine nine and ask for your W why do eat water perusing package or visit call the shield dot com [noise]\n\nSeeing a bomb\n\nAnd I\nAsked me when I was America's great\nI lead to do this is just to draw\nBack when reading Barney we're having a gay oh dum\nAnd there wasn't nothing we're going before Bert and Ernie had an actual real time but thank you know even Sesame Street came back and said that got all of it they're just they're\nNot I don't know me watch burden or do you tell me there is not when I was Bert and Ernie weren't on they may have changed their ways we don't get don't get me START I really was I don't even think about Ernie would not use to grasses and he was definitely trying to\nYou know good and well that ... was not putting up with that stuff and he would he would have told him either kicked\nHim out of the ... yeah you're already lived in an address candy didn't want to wake up and come out of it the the burden earning ... ushered in oh yeah ...\n... ... and we're so\nYour Oscar the grouch lived in a garbage can and you're saying Bert and Ernie lived in the closet\nOh I don't know what they said I don't think there are they were they were all they've already they lived\nIn a socialist town there were having to room together to save money of the good pay the taxes it was terrible\nYeah and they had to leave in the day in bed because it was cold and whatever yeah we're the ... would you watch uh apparently\nSesame Street when I was little was different than the Sesame Street when a ...\nThey ... the only person on that show that was worth crap was Carol Dracula that'd be like you know 'cause he was killed over the hill and you had to make money [laughter] him on the cookie monster I Do like cookie monster do\nDie to diabetes recently I did I ever write to me I never liked big bird\nHim on the cookie monster I did like cookie monster to [laughter] died of diabetes recently I did I ever write to me I never liked big bird\nBig bird was too big a big yell at higher up all of this uh yeah he was a friendly monster big bird you saw ... walking down the street shooter here to like a raptor right\nYeah it really looks like a body yeah and he ... he he didn't give a lot of wisdom either Oscar the grouch he told life how it was you know like this is ridiculous he was the\nGuy that yes in the neighborhood tried to make sure everybody get a job that care of themselves to remind them a a ...\nIt was that guy Jimmy Kimble reminds me he apparently last night bag the audience to vote for Beto O'Rourke\nIn Texas now so what are these man on the street things where they went to the college campuses Texas ... asking people who they supported\nWho they're going to vote for every person the videos as ... who is a congressman nail\nYeah and he's been accounted for a while and she sees accomplish nothing but doesn't matter like if you're if you're if you look nice and you can give a good speech then it doesn't matter that you didn't do anything I mean that's brought\nWell that's that was the question will tell us one thing that was done I'm not not just legislatively he dig in his in his life it for a business for first for sports for just tell me anything he did something he wrote the best guides may know ...\n... and when he was twenty six he got a DUI he fled from the scene of a crime\nOkay anyways shirtless across the highway okay and twenty six twenty six\nAnd they was apparently he is an amazing sprint\nOr from the police report so [laughter] I got to give it to a guy you may have handled it a try yeah fewer hammer does that guy you can go across the highway that speed that's it that's an accomplishment lo and behold against him I'm known against everybody changes from when they were twenty six throws me\nWell I'm not sure that they do is change from the time he was twenty six yeah I hear are we allowed to do when he fixes to the left is now\nIn fire speeches makes me want to drink too much so I mean I I agree if he's\nSo he has raised what right at forty million dollars thirty something million dollars\n... out of jak Democrats or ... forty million dollars\nIn Hollywood yeah most the most of that money came from California and ... and he's not running as if he's running for Texas because he's talking about socialist issues in the beach and the president and like you know I don't think he wants to win he just wants to he wants to win\nThe nomination twenty twenty he's got no good ideas but he says things nicely and he's the most is the wider he's wider than Elizabeth Warren and he goes by ... I mean I just doesn't make sense well\nBecause it does it does it really matter what they believe so so ... is not sure\nAbout any policies that will actually work Ocasio Cortez is not sure about any policies that were actually work Bernie\nSanders gets credit but at least he but it's kind of scary he's very senior\nHe's for policies that will not actually work our way to the point and I'm asking Dallas especially because he's even younger than Chris I understand the concept that if you're not liberal when you're twenty you don't have a heart and if you're not conservative when you're forty you don't have a brain understand that\nBut what is it that young people or is it the college education is it public education how can they think in the United states that these ...\nWhat is it the young people or is it the college education is it public education how can they think in the United states that these policies are actually going to work for us\nWhen they've not work anywhere in the world we can't pay for the policies to start with right and the people who are generating income and are working at our are paying the bills will decide that there's no use in doing it\nIf they're not if they can't even take\nCare of their own families by working while they're young people think all this stuff is going to work\nThere is a distance but people are my age twenty five twenty six between intentions that are sold buddies politicians you know I Want you to have free healthcare free education\nI have a family member who whose who summed it up to me I'll I'll go over to death\nBut she said oh or I won't say what she said relatives Scott I'm I just want people to be happy\nWe're going to make you work right\nAnd that that's that doesn't sound quite as good we're going to make you sweat\nWake up early do your job yeah be your own time expect something of you that doesn't sound great to someone who's grown up with everything handed to him even when they're poor in America mhm many things are handed to you free large free this free that some sort of ram what\nYou're promising is nice everyone said oh I Would like a job but then when you look at what the other person's you're right a liberal or left ear and liberal is promising are saying oh you don't have to work you don't have to get a job you can get all this stuff we got Obama phones all that stuff right\nWe're going we're going to we're going to give you free health care you know you don't have to pay anything for were promising you a free education yeah so you can get a degree in urban ... art management gender studies gender studies gender urban gender gender based urban art management\nShe's [laughter] and you're going to have all these things and then if\nThey were going to guarantee you a job and now they're literally promising a guaranteed living wage ... so that if you really think you can get by you just have the living wage and don't even have to work at all and I don't see how this works as a society\nThat's why I keep asking\nWhy do we not fight in Alabama State motto is we dare defend our rights why are we not fighting as a state to say you know what you can do all that craziness there\nBut the constitution promises a a Republican form of government\nAnd we're just not going to do it we're not going to go off the cliff with everybody else which is one of the reasons why liberalism is determined to do everything on a national level ... calls they cannot afford to leave a place free\nEverybody has to be put in their bondage\nOr their own folks look at Alabama or look at Texas and say hey what are they doing so well when and we're not mhm so everybody has to be forced there I just I don't understand why young people or a leftist don't get it\nAnd I mean it's just a promise and they're not saying a\nSanctuary to colleges that they have you know once you get out all the people that I went to law school with\nYou know now they're making a bunch of money and they're gone well I voted for all these high taxes on income but ah I'm not too sure enjoy paying 'em mhm so I think after they leave and they they realize you know I'm I'm essentially giving away thirty percent or three months four months of my year to someone else\nAnd I'm working hard working hard and I'm given away thirty percent of my income I don't know what that person doing but they're definitely not making this money I'm just handed it to them so they're not happy once they leave but\nSome of them still though liberal oh yeah some of it will just be are those the ones that they became too easy\nI think it's more groupthink really addict addict at a very you know upper middle class when I was coming up but I [noise] jeeze I had to work for everything I mean I go I Want to play baseball and um that's where I learned my work ethic and I think that some people\nYou know maybe they do have an easy and they just think that's the way life is but I think a lot of his group think trying to be you know the same fit in with everyone else 'cause when you're on a new campus or when you're in high school I thought I care\nMentality yeah just want to fit in yeah everybody else that is\nEveryone else 'cause when you're on a new campus or when you're in high school I thought I care about herd mentality yeah just wanna fit in yeah\nEverybody else that is funny because you end up with the bullies on campuses are the liberals\nOh yeah oh yeah they're the they're the outspoken whether their majority and minority I mean in my case\nAs or uses majority but they're they're\nVery outspoken they're the ones that have probably the most campuses events\nRight and there there there ain't going to be in charge of the student government so their their calls and the student government to say we don't want Scott come and speak a campus 'cause he was going to be hate speech and they're they're in charge there there are already pulling the levers of\nPower they had they had in my school I won't mention what school it was but they had somehow managed to pull a all vegetarian day two days a week now any vegetables or fruit [laughter] I'd a had a much\nSo their cause you to star oh yeah [laughter] I was not happy with what was a mandatory the cafeteria cafeteria\nAll vegetarian day two days a week\n... so you couldn't get a burger oh no I'm In soy burger does that count as I Do know that I got a murder that is not a burger no beef so\nThat is crazy whether that's a good example though because I keep trying to tell people that win liberalism does get in charge all these people they think they're going to have freedom okay whatever it is or whatever\nTheir lifestyle choice whatever their drug choice is whatever they're they're not working choice is whatever I can just do\nWhat I well when the liberals get fully in charge when the socialist or fully in charge they will tell\nYou how to live close to different people that you're talking about her the liberals\nAre the socialist do they are the same way some of us or not you're not a liberal I Am a liberal with the little oil\nOh that that's just getting your libertarian at best a liberal\nOr don't don't get classical but you can't change the definition I Can't remember the ... at best you're going I'm a libertarian it but yeah I can be liberal although what else you other than do\n[laughter]\n[laughter]\nAnd I'm telling you when they get in charge and they relied hey our guys have voted for us to smoke dope all day and hitting the Lincolns a snake\nAnd we need to be a little later we'll work at all no rush in ... then they will crack now\nDo you get into his voice smoke do don't we won't work is exactly we have to sell the stuff [laughter] I'm just kidding [laughter]\nSo that's\nThe other one that gives me a and your vegetarian day thing is a great example\nBecause I promise you all those liberal folks that your college ... rock I were\nPressed no one should tell us we need to be a new whatever I Need to love whoever I Need to I Need to be free and then all of a sad when they get into charge and say oh by the way two days a week no me at the cafeteria\nThat sounds like oppression to me that sounds like the sixties to me no meat a lot of art\n... loving everybody will ... will\nBe free will be awesome I just\nIt's free into some place and then you realize it's a little more concerned\nAbout my wife watch this on these Netflix show token you need to speak and we've got tall he's very very mild mannered so they watch this show and it has ... magic and it's like this at once upon a time\nYou go that would get called he's very very mild men so they watch this show and it has ... magic and it's like this that once upon a time share where its own number of years and I'm One of the things they always talk about is about a magic is it\nMagic comes with a price and I'm trying to figure out if there's a way I can convince all these young people that hey look\nAll these things come with a price that there's no such thing as pretty much doesn't seem to work so maybe I can say look it's like magic [laughter] you think it's gonna be magic you think it's going to be free you think it's just going to be put the genie is just going to give you free college free free a free lunch free healthcare\nBut it comes with the price and or your on your soul for that price are trading at for bondage\nBut I'm not sure they get it but you don't pay that price doesn't want to receive that so it's the person you're right that is going to be painted you talked to are below the bonded you'll be in right but you just don't know that's coming yeah that's later down the road I'll give you I'll take care of you\nFrom cradle to grave thank you but you're gonna have to run on this hamster wheel every day\n[laughter] that's kinda how it works\nOK [laughter] I'll be back you're listening to Scott ... radio\nIf you're in the market for a new Honda you need to visit Honda jak they carry only the best the best was talking about how the under Jeffrey is the only Alabama Honda dealer to be a president's award winner customer satisfaction for three strikes\nYou're whether it's sales or service Honda Jasper his top notch they carry over Seventy five used cars\nAnd they have Honda certified you did undergo a hundred and twenty five when faction and you'll have great foreign\nVisitor call Honda jak drove\nA three five zero one zero zero\nSell jewelry your hometown professional service jobs from Waukesha county for over Thirty years come see other big selection of eight fifty highway Seventy eight days just for Alabama you know you're going to zero five to one Seventy eight do put it off and the other day surprise her with some diamond studded\nHearing Joel how to use without worst pet southern also\nJewelry youth or the boss doesn't knows a jury has the perfect job for the perfect girl [noise]", "year": "2018", "show_name": "Laura Ingraham Show", "city": "Birmingham", "day": "23"}