{"month": "10", "state": "SC", "station": "WLTR", "content": "And not the age of ...\nI wanted to do a lot\n\nThe age of ten\nThe age of tear\nUp well Graham on for a ...\n[noise]\nToo small\nTo be um\nSide uh to be you know\nSomeone needs to ... ...\n\n...\n\n[noise] [noise] yeah I see you\nMentioned that just seal\nRecorded this works Corinne Bailey Rae many many people of all different kinds of Netherlands window ensemble pollen broke society Nicole nearly all kinds of folks and\nDifferent kinds of Netherlands wind ensemble Holland broke society\nNicole ... all kinds of folks and as you heard there Mandy Potemkin\nGreat great songs and the name of the new one is called I Want to be kind and he is one of a kind tighter but to say hello to you if you're listening right now over ... W E a G T E Toledo\nOhio or W. I. N. O. Odessa New York we hope you'll be with us next time when I guess we'll be living ... Taylor Gretchen Peters Jill Barber Sean Raul an amber rhubarb is\nNo stage is brought you in part by Charles Ryan associates we are smart brand communications crafting solutions to drive results for more than four decades probably supporting the arts and public broadcasting throughout the mountain state\nYou're listening to a mountain stage live performance radio from the mountain state of West Virginia mountain stages supported in part by this station and by West Virginia public broadcasting\nHotel accommodations for mountain stage guests are provided by the Charleston marry a town center hotel centrally located for the business and pleasure traveler in downtown Charleston retail district there's this mountain stage on NPR\n\nAre just tuning in [noise] glad you did\nThat and we got some great music still to come on this show amen to shy or sent her band will be out and just while but we will open the hour\nWith a couple of folks who have never been on the show before a matter of fact they just made their first full length album called healing tied\nThere called the war and treaty and they're made up of the husband and wife team Michael Trotter junior and Tanya Trotter Tanya grow up in D.C and she won a\nTalent contest as a young teen and knew that's what you want to do and she began writing right after that which is pretty uh pretty unusual and Michael was a little more of a late bloomer but he got his start in a very unusual way he was in the army in Iraq\nAnd he began to write songs tribute to people who are falling soldiers there and that's what they assign them to do because they were so powerful that got back\nYou underwrite songs tribute to people who were falling soldiers there\nAnd that's what they decided to do because they were so powerful they got back they run a festival together met each other and they had been together ever since they've taken the world of American music by storm you're going to see why right now please walking for the first time to the mountain stage the war and treaty [noise]\nOh ball ball ball ball ball and\nThose things now that you\nRiding in my\n\nYou at my door dry in Normandy\nYou know [noise]\nWe were\nWas only\nWe\nBut only by\nThe time you lower and\nMean she won't be there as\nAs\nRead your when\nRadio\nMe um you know already saying\nNo no no we wait a minute you know\nHe opened the we walk we didn't do\nThey go and do you really want we\nAlready know what are you being driven\nNew man you'll be they\nKnow the average G. lower\n\n\n\n...\n[noise] [noise]\n... me me\n\nMe\nLike\n[noise]\n...\nWell\n...\n...\n\n[noise]\nNo Larry said we never play mountain stage before\nHe didn't know we played just days many a times in our head yeah [noise]\n\nProbably not be afraid of the person I'm Jerry for real\nThat\nNo longer have to get dressed up and rehearsed like really mountain states\nProbably won't get invited back but it's okay uh this was our last\nThank you also there's [noise]\n\nThere's all cause not over yet which means don't give up still got life and your body's today in your lungs\nDon't quit don't give up all night dream it's not over yet\nReally sweet ... ... ...\n...\n...\nThink you\nKnow Mm I'm you know\nThe bank [noise]\nNew rerun you know the main\nYou may\nDo they\n\n\nDa\n\nMotives all ...\nAnd all that before\nIf we could\nDo more\nSprayed\nWith our own\nHome\nOh well\n\n[noise]\n\nNo no my\n\nThere [noise]\nThey're going to be out for another month and a little bit more promoting this record in I don't have to tell you they come here area anywhere near you got to go see these guys my goodness\nAnd somehow I think we might invite them back again\n[noise]\nAnd treaty wow you're listening to mountain stage live performance radio from the mountain state of West Virginia\nTreaty wow you're listening to mountain stage live performance radio from the mountain state of West Virginia\nMajor funding for mountain stages provided by Bailey an Glasser L L P A nationwide law firm born in West Virginia with offices in Charleston Morgantown wheeling St Louis D.C Boston Alabama Florida and Delaware details at Bailey Glasser dot com\nAnd by the west Virginia tourism office there are places you visit and places you'd be holds you'll find natural wonders an endless experiences in the mountain state West Virginia a place that's almost heaven more information at W. B. tourism dot com\nAdditional support is provided by hip historic Charleston West Virginia you'll find live music seven nights a week in West Virginia's capital city it's music from the hip your adventures starts on line at Charleston W. B. dot com there's this mountain stage on NPR\n\n\nNames of shapes between stars shaped still should they\nGo to name Jill\nAnd the\n...\nRead the\nThey hang on to the window\nBut not\nA law\nTo dry\nIn a mall in\n... Ohio\nThe early\nHe really\n\nKnow\nWhen\n\n\n\n[noise] [noise] [noise] [noise] [noise]\n\n\n", "show_name": "Jazz Night in America", "year": "2018", "city": "Columbia", "day": "28"}