{"month": "10", "state": "NE", "station": "KFAB", "content": "American Made an antique styled our seats are part art part furniture and all security\nAnd if you like the classic look of our ... we also feature beautiful matching tool chess and furniture\nWith hundreds of thousands of satisfied customers we've built our reputation on having the best built best looking and most convenient safe with great service in warranty on line financing and free curbside delivery so go with the best\nAnd get style convenience security and true peace of mind with rhino\nSafe dot com today that's rhino save dot com rhino safe dot com\nMessage into your ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree to further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur in thought leaders and what if you could earn that degree in his little list\nSixteen months one hundred percent on line to find out more checks market to seven nine six four or five\nThat's an A. R. K. E. T.\nTo seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs online checks to market to seven nine six four or five\nThat's M. A. R. K. E. T. to seven nine six four or five\nWhen they hear all\nLet my mistake and take over my life I was appointed by credit the way for a ... high school and I didn't do it\nTen years later at age when ... when I found\nIf I wanted to make her a better person to provide a better life for\nMy family never stop pushing for me to be better if they knew what I can be calm and who I can\nTeam is amazing\nThe educational director Mr anyway my seven year old daughter or should spend more of that is more than\nI mean given an opportunity and under the law for and\nNo one can Malone if youre thinking I'm finishing your high school diploma new ... education on near you as you were in a moment not or any or ... brought here by the dollar general littering the foundation and the council\nExcuse me I Know you have a nine o'clock so we'll keep this short I'm a business suit in the back of your closet you warming nearly every day before your office went quote casual\nI used to be the c._e._o. of your closet now I'm just out one interns no one ever talked to I always thought you'd circle back with me get granular keep me in the pipeline but not a\nNot thing don't you remember the kitchen presentation you still coffee on me and I still look amazing during the break out talk back human eight so\nI think it's time for me to move on I've got a great resume and I absolutely crushed in interviews okay let's make this a clean break ship the paradigm the only thing I ask that you think outside the box here and do this\nTake me to goodwill or I can really make a difference\nYour donations to good will create new jobs training programs and education assistance for people in your community defined your nearest donation center go to goodwill dot org donate stuff create jobs a message from goodwill and the ad council and the fourth can you see that\nThat's [noise]\nNothing because the moment you see that\nThat your child dies opening up to a world a possibility [noise]\nOne trip to the foreign come back on moral to different [noise]\nThere are some moments only before it's kinda fun yours discover the force dot\nLearn about forest near you\nDiscovered cool thing to do when you go like hiking\nFor camping\nCreate your own adventure with\nAnd friends might just be [noise] ... find it to discover the forest dot org that's discovered the forest\nRock the by the U.S for thirty ...\nPractice report area where we live about\nAn hour later and they believe are allowing our route and\nMrs ... who is your wife the widow of a shot down dead New York city\nPolice officer ... see what happens later this week I tell my next Sunday we're going to know if we have troops justice and the American way or not I stand for square with Brett Kavanaugh I pray to God you do to continue with more see you next Sunday night don't counting under great American live with you every Sunday [noise]\n\n\nActing roles for alerts in office be automatic originally applied\nHello America this is Martha Stewart no you can cook great chasing dinners at home and\nIt's easy to forget about frozen foods and take out instead join me for great home cooked food introducing Martha him early spoon meal kids\nRepression fresh ingredients with my wonderful easy to follow the recipes delivered break your door and right now you can try tree for free for a very limited time an offering three free Martha and Merle eastern meals to everyone anywhere imagine cooking butter based at stake\nBirch or pork tenderloin she stuffed chicken and more with new recipes every week Mars and mercury spoon and helps you put a delicious dinner on your table and around thirty minutes\nFor three free meals and free shipping text yum to two four six eight ten just text the word yum to two four six eight ten for details hurry three free won't last long text yum to two four six [noise]\nLet's go inside the mind of a ten year old I should\nWarn earring did I and I was hearing Gabby has those ... year an accurate Sheikh opt out but that's just what you would want me to damp McCain laughter for me by collapse Sarah yeah\nBut then they can and will be like she's ... years now it's just like the Kayla Sarah ... actually a great name I Wish I was calling to Kayla there's like an doesn't Sara's in my class hey why not heading into you buckle up any seatbelt forget sometimes because the rainiest like busy you know\nA pizza at school tonight\n[noise] sometimes it can be tough to get to but it's not impossible always make sure they're wearing the seatbelt even a short drive remember you have to you have the\nTo never give up until they buckled on a message from the national Highway Traffic Safety Administration and the jobs they record dot Gov blessed to talk a little more information\n... you can trust to review eleven ten K. F. A. B. or radio station [noise]\n[noise]\nDown to the wire on a new trade deal I'm an Carrick Fox News the usa and Canada comes from a new trade deal is done\nThe United states Mexico Canada agreement us MCA replaces the Nineteen Ninety four NAFTA packed under the new agreement exemptions on terrorists on two point six million cars and the dairy agreement the same as the Trans Pacific partnership trade agreement rejected by President Trump\nSteel and aluminum tariffs are not part of this agreement the Associated Press reports the agreement preserved a NAFTA dispute resolution process something the U.S wanted to jettisoned\nWith the announcement friday the FBI week long investigation of sex assault allegations against Supreme Court nominee Brett Kavanaugh a delay in the Senate confirmation vote judge Kavanaugh's confirmation that suddenly was thrown into doubt\nWhen you're looking at a nomination that is basically one vote short or two votes short depending on how you crunch the math\nYou don't really know exactly how it's going to turn out you you don't know which way it's going to tilt uh that's the problem that the math and the Senate is so tight fifty one Republicans forty nine Democrats so if they're able to court one of these four senators who appear to be on the fence right now\nLisa Murkowski of Alaska Susan Collins of Maine a Heidi Heitkamp of North Dakota Joe Manchin of West Virginia they might be in business\nFox's chat her from California passes a law for net neutrality and the Justice Department filed suit the new law aimed at preventing Internet service providers from blocking our throttle in traffic or offering paid fast lanes known as paid ...\nThe Trump Administration wants to deregulate broadband Internet service companies freeing them from utility style rules which could temper innovation supporters of net neutrality insist the rules are necessary to protect equal access\nTo content on the Internet Fox News fair and balanced [noise]\nNow the news radio eleven and a baby whether watch\nScattered showers and isolated thunder showers likely overnight along with the fog and the drizzle a study temperatures near fifty degrees as we head towards Monday morning then it's sixty percent chance of morning and afternoon showers and drizzle cloudy otherwise instill cool with a high a fifty eight and north northeast when at five to ten miles per hour with a ... most\nThe effects of the administration of carnival or on clinical signs in cats\nAfter the Pete challenged with feline herpes virus why the vets spearheading this study we're laying a contrarian Stevie em\nTV M. P. H. D. taken away George\nThank you rich we have indisputable through for the power of carnivores from nature [noise] this double blind study is being peer reviewed in an international journals and there was also the study Seventy five percent of the cats no longer showed any signs of their immune condition [noise] this is big news folks the ...\nIt's coming study will include cats and dogs to ... shortly we'd like to think about the Michael lap and ... him for his amazing assistance in putting this altogether we're also looking forward to the study with people in the United states\nNow that's carnivores ... dot com C. A. R. N. I. V. O. R. A. carnivores dot com carnivores dot com or call one eight six six eight three six eight seven three five that's one eight six six eight three six eight seven three five\nCalls today carnivore carnivores ... dot com\nI face down these nice looking again go\n... go cannot guarantee you will be close to the other ... like a legal team can accurately verify claims even experienced the complex human emotional state known as having us housing and sort of modest living somewhere on the ocean floor with no arms legs\nA wireless access what's there will be happy about uh climbs on like oh I'm so happy I didn't get turned into New England clam chowder today pronounced originally I was told on tall da Silva them to say\nWhat were we talking about a young guy go Fifteen minutes could you Fifteen Percent or more\nRenewable\nLiving at the beach [noise]\n\nWelcome back you know I don't think a day goes by went up I don't get at least one or more messages from coast listeners asking me when there's that missing for one one guy coming back Wednesday ... going to be back on the air\nAnd I always tell them not soon enough we get more requests for Dave than any other guest that I've experienced since I've been with the program for ten years and that's a that's because he always brings the goods I Am jazz that he always allows me to get the first interview when he unveiled a new book and like the other books this new one does not disappoint\nA Davis you probably know spent Twenty years in law enforcement then worked in the tech industry for a bit but found this true calling as an investigator of unusual disappearances and his work in that area has become a phenomenon known all over the world multiple books a documentary film\nAnd maybe some other surprises to come Dave great to have you back\nIn Georgia I'm always humbled that anyone even wants to listen to listen to me though or appreciate the invite\nI Want to say you know I noticed something as I was reading the new book today that you make some personal observations than I Am not a I haven't seen it you go this far in the other books I insights\nInto your own emotional reactions to some of these cases and it seems clear like the subject really gets to you and you've got I think eleven hundred and thirty five cases that you profiled over the years thousands more they'd be looked into\nSome of them really seemed to get into your head though I I think in part because of similarities of some of the missing to your own life right\n[noise] you know I think that's true um I've been very fortunate to me family of people who have been lost and when you meet these people it really brings brings home the emotion and\nThere's a lot of parallels to my life with a lot of these families and I've written about people that remind me of myself a lot of times and uh [noise]\nI've put in the book just recently probably because it's it's more of an evolution of my writing and\nHopefully people see that you know hey if people are really really good people these are the drag society these are\nThe upper echelon and it's a conundrum to me why I don't find people that are down and out in life that are disappearing but it it seems to me that it's always the high rollers the people that are high performers that are disappearing\nYou know one place in the new book you mentioned how as a rule you did not reach out to the families of the missing now sometimes you meet him in ... due to various circumstances but in general you don't call somebody up out of the blue and say hey can I talk to you about your dad loved one or you're missing loved one because it seems like an invisible line that you don't want to cross over but I Wonder\nHas the success of your book help in the sense that these families now reach out to you that they're unsatisfied say with the the search effort or something and they're they're turning to you for some help her answers\nIt has happened and uh [noise] I don't want to inject myself into a search or into the turmoil that evolving with somebody disappearing now somebody reaches out want some help absolutely I'm going to be there I'll do everything I can [noise]\nAnd there's been cases just recently where that's happened and I've been glad to help and ah I've kind of guided them and it it seems that a lot of these families\nAnd covered the same sort of issues time and time again and it's frustrating as heck to sit back and hear the frustration and their voice a\nCommon one is is it seems as though when jurisdictions stop searching they get to a point seven to ten days and they say hey there's nothing else we can do there's no place else to search\nA runner and out of resources we've got to stop well many times families and friends rally at that point and they get a group together and they keep searching for what I tell these people is you've got to get a copy of those reports that the jurisdiction wrote search and rescue reports\nLaw enforcement report\nSee who they interviewed who they talked to were they search the effectiveness of the search\nOr the areas they completely eliminated in the in the areas that they thought that they still should search more because without that you really searching blind and there's been instances just lately where people have said no they said they won't give us anything\nI find that baffling\nWell I mean that's how they've treated you I was gonna ask you the same question about different agencies I Know how the national Park Service feels about you and that they are we should anybody who has not heard your earlier interviews or is not familiar with the books you might be listening tonight\nI'm maybe we start there where you can explain the history of your interaction with the national Park Service the forest service government entities in general because they've shut you out I mean I guess I I'm interested to learn that they're doing the same thing to the families of the missing but ah it's really\nKind of clear over the big picture that they don't want to help solve these mysteries\nYou know it's a sad note on human\nDid he if that's the case but there is a lot of obstruction so when I started out I was told by a couple of Park Service rangers that they had found\nDisappearances in their parks where they had worked that bothered him didn't make sense when they tried to find information they couldn't and they thought somebody with an investigative background on to be looking into it\nAnd that's sort of how it all started and I filed a series of freedom of Information Act requests against the national Park Service they have the largest contingent of federal lead train police officers and the national park police\nAnd they're trained at the federal law enforcement training center they get outstanding training they're smart people they understand what should be done and I asked for a list of missing people well they came back and they said they don't carry any list and they don't have any listen missing people in their parks in jurisdictions\nAnd ah we talked about it and it had to be a semantics issues to ... refiled and they came back in the attorney called this time into why do you want this information\nAnd explain to him I said hey you can't ask that as a determining factor in Florida and they said oh we're not we're not saying we're going to use that to determine we just want to know why you want it and I said well how research and then it came back and he said well you don't have any listen missing people\nI said well you have two hundred and eighty three parks monuments the patrol and you have a lot of police officers and then you have special agents that are to the detectives\nSo somebody must be keep it a list that each individual location or a cumulative list at headquarters to understand what's happening and it's only politically correct if somebody calls in and wants to know the status of the case how you ever going to find it and said no we don't have any less\nSo years ago somebody said well they are just file a request and see how many rules of toilet paper at Yosemite National park I bet they have that inventory list\n[laughter] and of course they would but as it happened they came back and I said well I'm a printed author so I Want to use my authors status\nAs an exclusion for fees and get you to accumulate that list for me a couple of weeks later they came back and they said well your books aren't enough libraries to qualify Lucian of such qualifiers just some arbitrary thing they said\nAnd then I said okay well why don't you just tell me how much it's going to cost me for you to put together the lists I Want to list from Yosemite and I want to was from the national Park Service and they said well it's going to be thirty four thousand for the list from Yosemite and one point four million from the list from the entire\nSystem and I can't\nTell you how many people since I first said that years ago have tried to go at the Park Service and get it but nobody's ever been successful in getting the list from their entire system because we still say they don't have it and I've done interviews on other stations were\n\nThis is ... ... ...\nIt's been it's the new view streaming it is and\nIt's a new month which means a new list of streaming goodies that'll keep you from raking leaves Netflix's adding the much anticipated second part of making a murderous on October Nineteen\nAs well as seasons we have daredevil the hip hop evolution season to that same day Ron White new comedy special titled if you quit listening I'll shut up drops in the sixties and Netflix are marrying a new music ... theory called re mastered the first special focuses on reggae icon Bob Marley called who shot the share of\nThe movies to get you down John with a never ending story TVs big adventure Robin ... print the fees blood ... like the devil's advocate on Al Pacino was born to play said and you got to lake house Billy Madison the shining that can marry making more and more\nHulu has your Halloween fix this month with movies like Wes Craven present day scary movie Texas Chainsaw massacre to the nightmare before Christmas rack one through four is available plus everyone's favorite killer dog ... and the original child play you can also catch a new season from years of Fox's animated shows like Bob's Burgers Family Guy\nAnd The Simpsons now and it's thirty of the the\nAmazon Prime at more than two hundred titles this month with movies like raging bull full metal jacket robocop one two and three and the David Lynch bill Mulholland Drive maybe you can figure out what's going on this time to relive all seven seasons of growing pains on crime and watch the man in the high ... beans and three which premieres on October thick\nAnd that's new to me are streaming edition and I heart radio what else can your smart speakers\nWhether it's the same time\n[laughter]\n\n[laughter] [laughter] [laughter]\nI don't see them please\nPlease\nNa na na\nNa na na\nYou are listening to coast to coast am with George now [noise] even though the\nAh they say that imitation is these sincere as a form of flattery or it can go too far though of the success of David ... missing or one one books has inspired other people to sort of\nBorrow his template and their ... their own uh output at deals with the same subject which I guess we all need more information on it but some have gone too far there are people pretending to be him\nAnd in a moment I'm going to ask Dave about that and then we're going to jump into some current cases new disappearances that or maybe you can shed some light on out there in coast to coast land we'll be right back\n[noise]\nTake one atom of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide a miracle molecule your own body makes such you'll lose your cardiovascular health keeping you vibrant\nBut as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beach and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body one teaspoon of super beach daily supports your cardiovascular health and blood pressure levels we're talking real healthy natural\nEnergy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase\nField a one plus one equals boomer effective superb each call one eight hundred five one five zero zero five three or go to ... beach dot com today\nWarning if you were buried in debt you can afford to not let the credit card companies make you think that you have to pay it all back because you don't what the credit card companies don't want you to know is that there's actually a way to get debt free without paying off your entire debt\nOr going bankrupt if you have five thousand dollars or more in credit card debt you know have the right to let us settle that debt for a fraction of what you will for free information called debt free dot com now\nAt one eight hundred four hundred seven\nOne four or five will leave and show you how much money you could save if you are struggling to pay off your debt do not let the credit card companies make you think that you have to\nCall debt free dot com now for free information on how to get out of debt faster than you ever thought possible without bankruptcy we offer a guarantee with no upfront fees so there's no risk for the free information you need a call now\nOne eight hundred four hundred seven one four or five that's one eight hundred four hundred seven one four or five one eight hundred four hundred seven one four or five\nNews radio I'm living in ... at the beach [noise]\n\n\nDavid blight as I mentioned uh during the break there that uh you've got some imitators out there are people who have written books similar to yours as well as people who've gone further than that pretending to be you can you address that for a moment before we jump into the cases\n[noise] for one of the most frustrating parts of you know in the public spotlight I go to conferences all the time people come up to me and they say this how did you come up with that\nAnd I'm thinking I never [laughter] and there's a series of YouTube sites\nThat have the name David flight is missing for one one Michigan national parks are all fraud they're not me there are people that have used my name to get innocent and listeners to get on and every time you click through they get paid by their Google Ads\nThe only site that has me is a kennel missing project you say all the rest are not me in fact\nAbout eighty percent of them when you click and and you listen if you don't know it's somebody else talking about some other topic and it's not even me at all so\nI tried to tell us that people don't trust you to really don't even listen to him a ... missing project site that's the only real site that you're going to get honest information from\nAll right um talk for a moment about search and rescue\nParameters because that that information becomes key you picking the cases that user ruin on I mean there are metrics there are there's data\nUm for search and rescue 'em yeah how how they proceed and and I are huge database I Would think that gives clues about which cases stand out as being unusual\nSo that the data that you're trying to get to is really in the reports that they generate\nAnd the national Park Service for one won't volunteer up any of these reports now find name a specific date and a specific time and that person has been rural to be a missing and presumed deceased\nThey're released the report most times other times they want there is a case from eighty six\nI'm an era the girl's name was ... she was missing from Yosemite and I've tried to get that case ten times and I know nobody looked at the case in Twenty years and a special agent there told me I'll never see that case\nIt's a standard missing persons case there is no suspect there's no crime why can't I see it\nUm and just so people understand in law enforcement missing people is one of the few things that they handled it isn't criminal uh everything else in the law enforcement world is criminal oriented\nAnd missing people it's not against water go missing if you want to fall out of society you can and it's handled entirely different than a criminal investigation there's no prosecution that's going to emanates from these cases that are Thirty years old that disappeared in the middle you're somebody\nBut these people harbor it like there's some secret in there that they don't want you to see\nAnd a lot of times I'll grant you that the reports are horrific they don't have much data they don't have much information other times that are really really good and I don't understand why there and want us to see it but there's this\nI called territorial behavior and many of the times they won't grant you access now in the state of Washington they have a mandatory disclosure law that reports have to be disposed of the public upon the crust Colorado has outlaws well sort of like the freedom of Information Act a law\nBut many states don't and law enforcement knows that and they won't give up anything um so the first thing is you got to get these reports to really see what is there because you really can't trust I'm Sorry to say this George you can't trust the media\nBecause I Would say eighty percent of the time when I finally get a copy of the report\nThe news reports are totally completely wrong compared to what law enforcement said happened\nAnd I like to think back Thirty years ago forty years ago when there were reporters that really dug deep and got to the heart of the story and maybe today they can't spend the time to do it and so there's this superficial job of collecting information\nThirty miles away for a two year old it just you don't have enough people to do it and you have to work for that Ninety five percent tile but the problem is and all these books they don't talk about the other five percent anywhere I'm probably the first person that ever talked about it\nBut as you state how these kids making this extraordinary distance\nAnd extraordinary hikes\nWhen I go to a conference I always ask people how many people in the room or parents you know Ninety percent of people raised their hands and I said if I said OK you set your child down in the dirt on a trail walk away or watch the child what's that child going to do for the next hour\nThey said well maybe it'll crawl under Bush and go to sleep maybe the plan that dirt for a while maybe they'll run down the trail for a little bit get upset cry and then go to sleep\nAnd I said how many how many parents and your your kid would run up hill nobody racist or hand I mean it does happen but it's pretty rare [noise]\nBut I have all these examples where these heights have been achieved by these little can't\nOr they cross a couple of mountain ranges or you know it incredibly difficult terrain sometimes without any shoes on a you know he's got to remove\nYeah we talked about a two year old boy that they guest she traveled nine to twelve miles in nine hours over two mountain ranges\nAnd he was sunk face down and snow the next morning unbelievably a wife and we found that guy years later and interviewed him and he has no recollection of what happened and it's his mom said we couldn't believe we found him and we couldn't believe it was the wife\nYou have a case in the new book ah in Southern California the Lucerne valley bill Hanks this was back in Nineteen fifty six is the child is five years old at the age of disappearance\nAnd you do the math on a bill I guess if he had walked nonstop for twenty four hours he'd have to go watch six miles per hour\nBut a kid's not going to walk for twenty four hours with no food or water um it it seems just impossible\nUnless somebody picked him up or some something or someone picked him up and locked up their\n... and the reason these cases have significant is that let's say you report on a child who's abducted in downtown Vegas\nAnd they're found in West Los Vegas three hours later six miles away you know I sure as probable somebody put them in the car and drove from there but when you're talking in the middle of the wilderness that's not happening and when you talk about this happening when the\nPeople in the party didn't see anybody never talk to anybody and when they check the trail walks nobody else was there nobody else saw anything nobody saw any cars nobody else was there so how did that child make that distance in that time doesn't\nMake sense\nOr in the new book or it's law L. A. W. land air and water and a land cases you've talked about before but you've got some new ones including one\nThat happened in organ pipe cactus national monument Arizona rent or take a break now when we come back this one is really creepy and even some of the investigators who are working the case admitted it was really creepy\nI Will tell you why in just a moment talking with David blight is going to take a break the person's project break down into the break [noise]\n\n\n\n... devices great news if you're a ... through soup we want to enjoy our website on your boom visit goes to ... dot com on your iPod or Android rose or [noise]\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\nWe walk\nThey're rock and roll lovers of Sandy ... take a trip back to this week in rock and roll history start off in Nineteen Seventy eight where the members of Aerosmith bailed thirty bans out of jail after they were arrested for smoking pot during Aerosmith concert in Fort Wayne coliseum something nice for them this week in Nineteen eighty six\nPopular news anchor Dan Rather is attacked by a man who hit them from behind him repeat the phrasing Kenneth ... what is the frequency prompting R. E. M. to write this song what's the frequency Kenneth\nThis weekend Nineteen eighty seven in a wild twist Smokey Robinson holds the number tense bottom hot one hundred with one heartbeat while a song about him when smoky things by ABC isn't number eight this week in Nineteen Ninety two shin eight O'Connor rips up a\nPhoto of Pope John Paul the second on Saturday Night live at the protests over sexual abuse than the Roman Catholic Church the incident happened that shouldn't have ended her live performance can out of nowhere produced a photograph of Pope John Paul the second which he then ripped into pieces there were done silence and the Saturday Night live studio at NBC because they went to a commercial\nAnd this week in the year two thousand the new TV series CSI crime scene investigation debuts on CBS with who are you by the who has a theme song three more series and the franchise would appear all with theme songs by the who I still think my favorite though was CSI Miami\nWith David Caruso saying cheesy lines like this into the song looks like\n\nThere's a\nTo protect your family from disaster do you do\nCameras on them\nTaking pictures of important document beeped at over ... more simple to do that really don't do a much different view on the [noise] agreement\nOn a trade deal with Canada I'm an Carrick Fox News the United states Mexico Canada agreement us NCA replaces the Nineteen Ninety four NAFTA packed the U.S and Canada come from a new trade deal is done\nA Dario agreement the same as the Trans Pacific partnership trade agreement rejected by the president is in the new agreement along with exemptions on tariffs on two point six million cars steel and aluminum tariffs are not part of the new agreement the agreement reportedly preserves a NAFTA dispute resolution processed something the U.S wanted removed\nCanadian Prime minister Justin Trudeau saying it's a good day for Canada [noise]\nMore accusations made public but unsubstantiated Charles Chad Weddington claimed he interacted with Supreme Court nominee Brett Kavanaugh why like yell now he's telling several media outlets judge Kavanaugh was untruthful during his Senate testimony Fox's at Henry\nThere is a male or Yale classmate\nA Brett Kavanaugh who wants to come forward and tell the FBI that he witnessed what he calls violent drunk and behavior or that Brett Kavanaugh largely through a beer or someone that led to a fight someone got arrested a problem of course as we have no way of verifying we have no evidence to support this we have no ... operation\nThe comments are on the record which is what the White House cheered when Senator Jeff Flake cut the deal to have the FBI investigate\nThe Justice Department filed suit against California over a new new net neutrality law just put in place Sunday night California enacting the law to prevent Internet service providers from blocking arthritis in traffic or offering paid fast lane known as paid prior to ...\nThe Trump Administration looking to deregulate broadband Internet service companies supporters of net neutrality insist the rules are necessary to protect equal access to content on the Internet\nFox News fair and balanced [noise]\n\nNow the news radio eleven Jim Carey a baby whether watch\nScattered showers and isolated thunder showers likely overnight along with the fog and the drizzle a study temperatures near fifty degrees as we head towards Monday morning than sixty percent chance of morning and afternoon showers and drizzle cloudy otherwise instill cool with a high a fifty eight and a north northeast when a\nI said have you heard of that case no well this person's still missing\nSo she was a thirty two year old graduate student she had been a PE teacher with a master's degree in physical education decided she wanted to go back and get to more masters degrees\nAnd she ... she was just really admired by all of the faculty that she worked around and and studied under and all of the articles in all the court said that they stated she was really smart\nWell she was about to graduate with a degree in sociology and biology and she was working and you're a university lab tech to earn some extra money she loved the outdoors type regularly\nOn January thirty first Seventy one she left her residence in southeast Albuquerque she was driving her white sixty eight Plymouth station wagon and she went about an eight hour drive to the monument and she slept in her car that first night\nFebruary first it was established that she attended an evening ranger presentation\nAt the end of that presentation she went up to the ranger engage them in conversation he remembered it and said hey she asked really good questions and was smart February second she went to the park visitors center spoke to a ranger they're stating she had just returned from a hike to bowl pasture\nAnd asked about a guy the trip to a place called dripping springs\nSubsequent investigation found she spoke to a ... a ranger an individual named Larry Henderson you said he she he remembers or ask good questions was interested in the environment wander nowhere to go to see more things\nFebruary third she moved your car out of the campground nobody knew exactly why and on February forth at nine Fifteen and I am a ranger was patrolling and found chemicals car parked in s this\nCanyon picnic site with a note taped inside the windshield and it said if I'm\nNot backed by four thirty pm on February through these contact the ranger smart smart thing to do\nExactly no I Wish everybody would do that\nBut then as I went through this I started to think she was going to a place and she was heading to a place that she went to earlier and I always wondered in the back of my mind it's something happened that first trip and she was going back to the second time and just in case she was leaving this no I wasn't sure\nSo he purchased patrol vehicle and he had the two miles up from bull pasture he saw nothing and decided to check the trail register and it was signed\nBy Carol the first day she went on February second notify park headquarters advises them that he has a missing hiker and this starts the search process\nFebruary fourth and fifth national park service that you sent in to Forman teams up that trail the search whether it was described and reports of cold and blustery they determined care it was last seen eating an orange on the trail and they did find some spare orange peel scattered around\nThe Pima County sheriff was asked to join the search when the national Park Service started to get low on resources they also called in the border patrol and the tribal police US Customs\nMonth an air force base they brought in civilian helicopters was massive the search every three hundred ground searchers were on at any one time\nThe park superintendent again he met Ryan contacted turtles parents in North Carolina\nThe parents they did the care would never ever go off trail she was in ... outstanding athletic condition and she was supposed to be back in Albuquerque on February fifth February twenty second Matt Ryan told the Associated Press it's almost becoming a search for the answer to a mystery\nMarch seventh one last push to locate curl rangers claimed to\nSmell an odor of human decaying flesh up the trail\nMarch thirteenth national park service for the team into the area of the odor and found nothing\nAnd again they have no documentation on the incident anywhere now I did get this NPs report that was in the Pima County documents and it was written by the chief ranger Roswell boils\nAnd it was three type written pages that outlines of search for Carole\nAnd Ninety percent of it real boring real mundane for radio what it says one additional clue was turned up on Monday February fifteenth too limited locations about four hundred yards of park on the south west facing of the hosts a Jay ... is\nA very strong in distinct human odor was found but no other locations\nSupervising ranger how cross of ... that's where our national monument and one other searchers who was recently involved in the recovery of the body had very strong and positive feelings on the day then vacation at the odor\nThe following day ranger cos after flying the area and a border patrol plane letting eat man search party back over this area again the order was observed at the same location but only occasionally and noticed is\nThanked other members of the team described it as a very weird and scary all efforts were negative and search activities have been reduced intermittent\nPatrols at this time I have never in thousands of reports\nSeen anything described in our national park service report as very weird and scary\nFlight that yeah\nThat's really strange just a feeling they had or the fact that they're smelling what they think is the human flesh but there's no source for the older\nWell here's what it says other members of the team described it as a very weird and scary so\nI'm sure all of us who spent time in the outdoors have spent have smelled the odor of dead flash decaying some time animals die smell it I don't know if that could be weird and scary\nBut ah\nAgain this was her second hike into that area which she nervous about making the trip is that why she left a note to where she just smart about it they never found her there was never any subsequent follow ups after that first sixty\nDays search both of her parents are deceased she didn't have any brothers or sisters there's no\nThere's nothing left of her family anymore\nYou have another a case in in the book about a land disappearance that involves a really smart person somebody who's the editor for what looks like great things his name is even read and his disappearance was in Nineteen Ninety nine in Oregon tell me about that one\nSo this is the one time out of the thousands of times where I read this case and I said you know\nI'm going to go against my own protocol I'm going to call the parents and I'm Glad I did but Steven read missing June twenty third Nineteen Ninety nine salmon Butte trail head outside of Sandy, Oregon\nAbout seven miles southwest of Mount Hood and for people who don't know a lot of disappearances amount ... around Mount Hood that I've written about before he was twenty four years old\nHe's an intellect super smart kid was a third year medical student the reports come from the ... county sheriff\nAnd uh when he was twelve years old as a gift for his birthday he asked his parents for the book called Grey's Anatomy\nAnd it tells you where his head was that he knew he was he was going to be a doctor when he grew up\nYou graduated from college with a ... biology degree five data cap is soon become loud\nIt was accepted Wayne State medical school first year medical school he was granted internship to the Mayo Clinic in June of Nineteen Ninety nine at the end of his second year going into his third year he took his first vacation in eight years\nAnd he traveled to Oregon to check into some possible residency and so he was kind of mixing business with pleasure\nSold the family wanted to see some wildlife mother told her son at the time never to hike alone please don't do that Steven on June nineteenth\nYou flew into Portland international airport got a vehicle from run Iraq a Chevrolet Cavalier drove to Portland youth hostels checked in and paid cash for Thirteen nights I'm sort of paint Thirteen\nNights with his credit card now law enforcement reports state on June twentieth even called his parents on their on his borrowed cell phone from them\nSaid he had arrived all was well checked in things were great manager of the hotel said Steven usually left before the others will look he was last seen on June twenty second or the twenty third and he was seen at night in a suit saying that the residency interviews had gone really well and he was happy\nOn June twenty second he drove his vehicle from the hostile to the salmon Huckleberry wilderness twenty five miles southeast to Portland and completed the trail permit to enter the same in the wilderness\nThis week in Nineteen sixty five ... arrives at Kennedy international airport in New York City the first visit\nBy renting pope to the United states during his packed one day American visit limited entirely to New York city oh Paul visited St Patrick's cathedral met with President Lyndon Johnson at the Waldorf Astoria hotel address the general assembly of the United nations attended a public math at Yankee Stadium and then flew back to Rome from Kennedy Airport\nAnd this week in two thousand three actor Arnold Schwarzenegger is elected governor of California despite his inexperience Schwarzenegger came out on top and the lemon week campaign to replace Gray Davis who earlier had become the first United States governor to be recalled\nBy the people since Nineteen Twenty one towards the nigger was one of a hundred and thirty five candidates on the ballot which included career politicians other actors and one adult film star rats you look back at this week in history\nThis week top TV stream\nDuring a routine flights passengers as mine Tito air a twenty eight return home to find the world has aged five years and number five it's the premier of envy the newest decides I fantasy manifest\n... as the big bang theory returns for its twelfth season premiere episode of CBS hit show takes fourth place to get the ... seat in three on NBC nine back into the then premier and Lansing number three\nSnacks such an Italian nice sights on the latest episode of the real housewives of Orange County you're a number to shout\nFinally highly welcome to her first baby on keeping up with the ... the perfect storm a episode is your number one TV strain that certainly top TV stream thought I'd our radio\nAsking your smart speaker for Nebraska news weather and try to make sure you please and say play KFC be on a highway yeah [noise]\n\n[noise]\n\n\n[noise]\n\nAnd\n[noise]\n\n\n\n\nFrom\nCoast to coast and worldwide on the Internet is coast to coast am with George nap now here's George\nBall at the blue sky you to bring us back into the program or conversation with David White is about his latest book missing for one more land air water\nThe era era cases are something different no departure for Dave in and they are featured in this book he focuses on aerial triangles that seemed to coincide with the clusters on the ground up people literally vanish into thin air we're going to get to some of those in just a bedroom coast to coast am [noise]\nNitrogen bonded with one atom of oxygen boom you just created nitric oxide a miracle molecule your own body makes such as your cardiovascular health keeping you vibrant\nBut as we all age our bodies need help generating more natural nitric oxide super beach by human\nHas harness the power of nutrient enrich beach and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body one teach would have superb each daily support your cardiovascular health in blood pressure levels\nWe're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase\nField but one plus one equals boom affect the superb each call one eight hundred five one five zero zero five three or go to ... beach dot com today\nAre you considering ... Oregon straight to secure your valuables and firearms if so before you spend any money on any typical run on a ... check out the amazing handcrafted rhino iron works strikes at ... dot com she for yourself why Ronald shaped customers are so passionate about their and chicken dust real style shapes and if you're a gun owner you'll love it\nUnion some swing I've done rack and rhino save dot com you get free curbside delivery a great warranty and service still go to ... dot com today such rhino safe dot com\nI just hundreds of dollars by switching to Cal I've never seen more lives\nDisclaimer cycle cannot guarantee you will feel more a lawyer you wind up us functioning respiratory circulatory system pull you belong where you are on the if you only do you know brings on me and you would like to save money on car insurance looked like a legal team applauds ... excellent life choices even though ... we still we encourage you to go dot com or download the\nPleasing a minimum of five hundred feet away from our lord and presumably delicious delicious brain\nGeico Fifteen minutes could save you ... percent or more\nNews radio I'm living on\nThe beach [noise]\n\n\nSo Dave I Want to jump around a little bit to make sure we save some time to talk about the era cases so I Want to jump into one of the most babbling cases involving water it's a guy named Henry McCain but this is really pretty creepy\nThat is a creepy case and ah [noise] the new Brighton Minnesota the community just north of Minneapolis not very far with the suburb September seven two thousand Fifteen to twenty eight am it happened [noise] McCabe was thirty two years old\nSo uh he was an immigrant from Liberia married to a woman named cream their two kids lived in a city called mounds view again just north of Minneapolis more side this is a cost her area of missing people that I've written about in the past\nYou had a great job used an auditor for the state of Minnesota for the department of revenue\nOn September sixty thousand Fifteen his wife with kids or went to California and it was a planned vacation well on that Sunday night Henry went out with a long time friend he was a very diligent guy always on time very respectable\nAnd he and his friend went to the early they laugh early on that Monday morning and ... states that he dropped him off at a location in ... at the super gas station or a Seventy third avenue\nAt two twenty three am Henry phone appears Trump pocket dial this wife while she was asleep and California and left the link the voicemail strange sounds screaming paintings growls et cetera\nAnd it's hard to determine when you listen to it if they're all human sounds or their animal sounds or what are they\nWe we have a recording of a news report that was done based on this and then includes ah some of the clips from that phone call so maybe we can play that right now and then on the other side you can tell me a little bit more about it\n[laughter]\nIt's only now unlike anything you've ever heard before [noise]\nThere were two minutes' worth it in the yard one [laughter]\nVery little actual talking what are you concerned that disturbing neither one of the night call came from Henry McCain cell phone it with labor date September Seventy two twenty eight in the morning nicknames worry why her in domestic\n...\nMinutes at a meeting he services is a nonprofit agency and act as a go between the police in the Liberian community leader is trying to help their family in some sense rewarding\nThe Raul selling to hide [noise]\nLightning moaning and pay like ... [noise]\nGet rid silent didn't sound like either Henry or another person's head out there and try to show and he was\nBorn at night at like ...\n... ... [noise] I don't like that\nNow isn't stark contrast to other articulate recordings of Medicaid speaking at an event in the state auditor\nWhen\nYou mention it one piece of evidence now police have revealing their police chiefs tell me even the FBI is analyzing the recording and voices for clue that she says the investigation to get any here on Tuesday\nAnd it had notoriety in the early forties for being a place where all the blimps that patrolled the coast of California that's where they were stationed in there and Treasure Island in the middle of the day\nWell in August sixteenth Nineteen forty two a blimp was getting are sent out of Treasure Island where they held the world's fair there was a man by the tenant earners Cody twenty seven years old and Ensign Charles McAdams thirty eight years old\nAnd uh they left Treasure Island no big deal general patrol all the details on this came from the navy file under a freedom of Information Act I filed fascinating report on this\nWell as they depart they ah start to head out over the Golden Gate and they start to go out over the Pacific towards the feral on islands in Cody was at the controls of an L. E. airship and this was originally taken by our military\nAnd it was owned by good year and they took it because there was a a needed for patrol [noise] we'll both men lived near Moffett Field in Mountain View but they drove up to a treasure island for the day to leave on their ship\nA that night water vapor was in the air and it made the ship too heavy to carry a normal third person that would be in the bucket they only left with to\nThe first hundred and ten minutes of the flight was normal in fact there was no communication and then it's seven fifty am the crew radio that they were investigating a suspicious oil slick and there were five miles east of the feral on islands at eight oh five\nNumerous attempts by radio to reach the crew but there was no luck\nAnd the navy scrambled to ... to you kingfisher aircraft out of Alameda naval air station to go track down the blimp\nWill the planes encountered cloudy weather with a ceiling a five hundred feet they decided it was too dangerous to fly below the crowd so they flew above them at ten forty five AM Moffett Field received a call from Fort funds to near the Golden Gate stating that they had to LA ship with two pilots and all we're fine\nWell the navy made a huge sigh of relief and they felt that all was okay now this was a really really weird call but it was in the file and they couldn't explain why it was their\nMinute eleven Fifteen for fundraising calls Moffett Field again stating that that in LA had crashed\nIn the hills of Daly city Daly city is just south of San Francisco on the coast\nOr the navy response to Daly city and they find their airship on the ground with one bomb missing the gun laws in near perfect condition both motors on the ship were off even though one throw was half open and the other was all the way open\nAnd the crew which was required were life preserve is over the water both of the life preserver that they were supposed to be wearing were gone\nThere was a confidential maybe briefcase in each a airship and that was still intact the cabin door was open plenty of fuel was in the tanks the radio was in perfect condition no distress call\nFor funds thing called back and say they said they made a serious mistake know LA was present at the Fort they couldn't explain why they made that original call\nThe central coast of California had a major search that started almost immediately the navy found to fishing boats and navy boat in a coast guard ship that's all the blimp dip and dropped to flares on the oil slick\nThe blimp then gained altitude and disappeared into the crowds\nThey said all appeared fairly normal but it did go into the cause and disappeared the crash happened at four thirty to build the street and Daly city three miles east of the Pacific ocean the\nCrew did not use parachutes and shoots that were in the craft were still there\nThen there's a couple of theories that I'm Sorry to interrupt you there was a couple of theories that developed a new theories are just about as weird as the disappearances or we're going to go to a break come back we're going to jump into the other details about this case and then I get your take on what might have happened to these two missing group people\nInto the break with journey wheel in this guy [noise]\nFind out more about it I just logged on to go to ... am dot com\n[noise]\n\n[noise]\n\n\n\nPeople from all walks of life are affected by mental illness rents go workers our own family members people like Michael Jackson's nice ... Brown in fact one of the poor\nFamilies in Nebraska and across the U.S are touched by these illnesses joined community lights on Wednesday October eleventh in breaking the silence about mental illness she branched journey to recovery Josh used the drums when a notice for five years today\nShe is a writer poet spoken word artist in a leading advocate\nIn the mental health community joined us and hear her story of hope\nMore information or to purchase tickets as a community ... or\nMy name is Lola strain on them can be done you know I mean I've just been a long time in my backyard\nAnd\nI Love flowers\nAnd call her and\nShe was like my mom was already in the ... take care of my cell\nPhone Bill Murray also mills I'm looking forward to the earth\nWill become like\nOne in six singers me does the threat of hunger and millions Marlin isolation drama behind me or am I not allow volunteer for meals on wheels donating your lunch break at America Online you can launch Saturn Mitt Romney's my meals on wheels America and the ad council\nHi I'm Geraldine my first uh for DWI eyes my blood alcohol level is point five four but I still had twenty more years of drinking for the first time at forty one years I have hope all because of teen challenger\nNeuro needed vehicle and do go to to see of ID dot org\nYou were hearing it now the day's news radio living in a baby in the\n\nLast minute and the deal is done I mean Carrick Fox News Canada's prime minister called a cabinet meeting laid on Sunday and shortly after the U.S and Canada confirmed a new trade agreement was in place the United states and Mexico Canada agreement us MCA replaces the Nineteen Ninety four NAFTA packed\nThe dairy agreement is in this is the same as the Trans Pacific partnership trade agreement rejected by President Trump while steel and aluminum tariffs are not included exemptions on tariffs on two point six million cars is included\nNAFTA dispute resolution process something the U.S wanted removed reportedly made the cut Canada's prime minister calling it a good day for Canada\nCharles Chad ... a North Carolina State University associate professor says he used to interact with Supreme Court nominee Brett Kavanaugh when the two were at Yale Weddington says Kavanaugh was often belligerent and aggressive when drug this latest report could hurt the ... goal to confirm Kavanaugh you\nJust don't know what you don't know and you don't know which political impact maybe this is something that it's not that big a deal I mean to hurt here uh a report if someone being too drunk and college and starting a fight there's a lot of uh you know things like that the one on college dormitories and frat\nHouses of no where's that written that that's necessarily disqualifying for the Supreme Court but it could be just a drip drip drip\nFox is Chad ... from the meeting between the president and Rod Rosenstein of the Justice Department was delayed because of the Kavanaugh hearings Fox's ... Scott White house\nPress secretary Sarah Sanders on Fox News Sunday says that meeting will likely still happen\nIt could be this week uh I could see it pushing back another week given all of the other things that are going on uh what the Supreme Court\nRosenstein under scrutiny after reports he planned to wear a wire to record the president and seek\nHis impeachment Mitch McConnell suggesting no action until after midterm Fox News fair and balanced [noise]\nNow the news radio eleven and a baby whether watch\nScattered showers and actually to punish showers likely overnight along with the fog and the drizzle a study temperatures near fifty degrees as we head towards Monday morning than a sixty percent chance of morning and afternoon showers and drizzle cloudy otherwise and still cool with a high of fifty eight and north northeast\nWell like ah maybe they got into an argument and uh and both fell off or maybe one of them accidentally fell over and the other guy tried to save him and was pulled into the water or\nI mean could that could does not have happened ... ... what do you think George [laughter]\nWell I'm just asking you did to respond to those stories that doesn't seem like a there was any kind of a disturbance sign of disturbance in the in what was left or the craft or and if they were wearing their life jackets you'd think that they would still be had been floating around out there when the when the search was underway\n[noise] or even if they come out of their life jacket they would have recovered the jak\nRight because the area of the water that was searched out there with search so thoroughly and eventually those jackets are gonna wash up the shore and they would have recovered them on the beach so oh these explanations absolutely made no sense at all\nYou have another case from Scotland a that was held Nineteen Seventy five\nBefore I get into that if I Want to address something that you said just after the break and that was an explanation that fits the facts and I immediately thought of skin Walker ranch you know\nIs going to bring this up at some point um you know as I read this book today um I notice that you you've ventured a little bit farther than you have in previous works or in the land in the air disappearances there's the Fred let Frederick ... case which is a famous UFO case\nThere's also a reference to a needs a National Institute for discovery science which was\nThe organization that was studying skin Walker ranch in and several of the cattle mutilation that had happened in the winter basin\nAt the circumstances where it looked like these cows had been dropped from the sky some of them disappeared altogether but some of them or their their legs were broken as if they'd been dropped from the sky several of your cases I thought the same thing in multiple missing poor woman books that looks like people are snatched down to the off the ground\nAnd then some of them are dropped back into these odd locations little kids that are suddenly miles and miles away I it it seems like I Know you don't want to commit to\nAny particular explanation because you don't have enough evidence to a to point at one in particular but some of this stuff\nCertainly ventures into the area of the paranormal and um I wanted to share this with the audience that I don't know David how how closely you follow the UFO a topic I Know you sometimes you get into those subjects but\nIt's been an amazing nine or ten months a where all these documents are coming out about government studies of UFOs the Pentagon's ongoing interest and one of the stories that I was able to break earlier this year was about skin walk Iran's that uh a program that have been created by the Pentagon\nOr to look at UFOs also went much further that it it studied what we would call paranormal events unexplained mysteries at places like skin Walker ranch and elsewhere\nAnd I'm at Jeremy core bell is made a film about it and I included in that film and is a reference to our book which had been read in Washington it turns out an earlier this year I was invited to go back by Senator Harry Reid to meet with some people whose names I cannot cannot make public\nBut they are they gave me sort of a download on the UFO mystery and what some of the research had uncovered and um and ... as well as additional information and some of that has been made public but the one of these guys pulled me aside\nHe had a at an ongoing interest in skin Walker ranch and other mysteries related to it and he asked a asked me some questions about the ranch and then he said\nYou know we think that that guy de ... that um that his mystery with these missing people might be related to the phenomena at the ranch\nAnd I asked a couple of questions that didn't seem to have a real solid answer or not one that they would share with me but the idea that the phenomenon that's been seen there which is sometimes playful and sometimes dangerous my\nYou are related to yours startled me and I don't know how you react to that but maybe it makes you uncomfortable or being associated with anything as weird as that but you're stuff's pretty weird too\nSo how would you rank this person's credibility and integrity on a topic like this\nUm I'd say this person that I'm Talking about knows more about it than anyone and I don't mean just in the military I mean anyone or you know this person has seen a lot of stuff that the the public has never seen so\nYou know he he has a very broad spectrum and a very broad knowledge base about what we would call paranormal including you up close and\nAlleged abductions and things of that sort so I don't know exactly how your a phenomena fit in with a larger picture but the idea that somebody has been looking at it is a I think that's pretty interesting\n[noise] well that's a wake up call [laughter] think so um [noise]\nSo you know way back when we first started to talk about the ranch I really put an emphasis on that area\nTo see if there was anything related to a disappearance that I could see my teeth into they can relate it to the activity there\nAnd you know there's really nothing around that ranch that I could say is related to missing people that I study but as I said before sometimes I think\nI related to law enforcement and if you have a say a series of bank robberies\nThe bank robbers aren't ever going to do a bank robbery in their neighborhood\nBecause they don't want to draw attention to it\nAnd I've always stated that I think that this is related to the profile points I I gave you one of those is water and when you look at Mississippi and Louisiana say it just filled with water and I have no cases from there\nIt's bizarre and isn't George isn't there a lake fairly near that ranch\nYeah it's ... it's a reservoir it's called bottle hollow\nUm it's a manmade lake but the ones right in the middle of the ... reservation you control that property and they allow camping and fishing and swimming and things of that sort when that lake is a a\nHas a long history of really weird stuff creatures have been seen there and objects coming in and out of the water and there but a lot of drowning so that they the ... tribe believes that uh there's something in the water that pulls you down a lot of people are brown there and uh\nSo uh you're right I get asked all the time if there's anybody in the vicinity the ranch you meet your criteria who's banished like that and I have to say no\nOther than animals livestock things of that sort but no people have a banished then I Know of course we haven't really dug into the historical archives or to the extent that you have but I think that some of that work is being done right now\nAnyway it's uh it it was a it struck me as a significant that the person who told me that in D.C had brought up\nYour books and and your subject matter I Want to try to get one more of these air disappearances in before the bottom of the break because I'm I think I'm going to open up the phone lines you know people are going to want to talk to you a little bit the Scotland cases guide Norman Peter Gibbs can you summarize that one\nSure I'd never twenty fourth Nineteen Seventy five nine thirty\nOccurred on the island of moral if an island in Scotland fifty five years old a Gibbs was a war hero he was an intellect and he was a pilot we spit fires and the battle of Britain in Nineteen forty\nHe was staying at a place called the Glenn force the hotel and it sat right on the ocean northeast side of the island a mall and there was a graph airstrip there and the rooms were right next to the airfield looking at the water\nYou arrived at the hotel on December twenty if\nOn December twenty thirty contacted the owner of a Cessna one fifty parked at the script and asked if he could fly it\nIn Hamilton was the attorney negotiated a price to fly the two seater and on Christmas Eve Nineteen Seventy five at nine thirty Gibbs walked out to the plane with a hotel guests named Felicity Granger\nAnd she thought she was going to go with him on a flight but he told her no she had to lay out the porches suit can fly inland [noise] so she exits the plane places the torches out in the field and he she sees him taking off the plane flying out over the water\nNow some reports say that after he took off they saw strange lights on the water some people said it might have been a fishing boat but they could never identified the boat and they could never see where the lights went\nWell make a long story short Gibbs didn't return on the plane and there was a major search on and off the island for days and they found nothing and they found a sheep herders and ranchers that search all their property they got nothing\nWell on April twenty first Nineteen Seventy six it was about four months after the disappearance gifts his body is found\nOn the north pole and this is an amount and it's like an oil near the airfield\nAnd he has a small scratch on his chin nothing else and a shepherd took part in the original search and he walked by the spot where the body was found multiple times and never saw it now if given the jumped from the airplane there should have been more injuries and broken bones\nWhy it's caught are having trouble focusing in school\nTrouble finding ... middle school would you like direction\nKnow why it's counter having trouble focusing is called\nFinding lowest airfare to stumble now I Am tired of fighting with hand over heart\nWalk restaurant meet a rape you\nKnow I Need a house up very smart but a mind wanders Oregon\nI think I understand but finding that potatoes for French by no no for us it ... you know why don't you understand me sorry I was trying to show how Connor feels everyday frustrating is Annette redirecting to understood dot org\nAnd the one in five kids with learning and attention issues this is what life can feel like more understood that Oregon or free online resources about learning attention is designed to help your child thrive in school\nUnderstood that or anything is understanding is everything\nYou buy understood that board and the\nAd council it only takes ... minutes to find out if you may have pre diabetes and you can do it I Do I have pre diabetes dot org or you're probably not going to argue it's we're listening to the radio you're busy which is great because busy people can't get pre diabetes mine I read that run\nThey can should warn Michael do visit do I have pre diabetes dot org and take a short\nBecause pre diabetes can be river\nRocky body I Can't tell an pre diabetes or wearing interests lie\nHegemony here you are hearing it a year to ... days news radio\nGen ... they be three we went up\nIn your smart speaker for Nebraska news weather and traffic and play on\nThe phone and\nEvery day\n[noise] and you know you got\n\n\nDoctor George now called the wild card minute eight one eight five zero one one zero in on the first time caller line is it ... wives zero one for civil to one to talk to read from east to the Rockies\nGame eight hundred eight to five vibes zero three three from west to the Rockies to greet gold eight hundred six one eight eight to wipe on\nThis is goes to goes day yeah with George net\nModi's singers back into the program we're talking with David flight is about missing\nFor one one land air water his latest book we've got 'em for another twenty five minutes and we'll get to as many of your calls as we can right after this [noise]\nTake one Adam of nitrogen and bonded with one animal boxes June boom you just created nitric oxide a miracle molecule your own body makes that fuels your cardiovascular health keeping you vibrant\nBut as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beach and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body one teaspoon of super beads daily supports your cardiovascular health and blood pressure levels\nWe're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beads and free shipping with you first purchase\nDeal though one plus one equals boomer effective superb each call one eight hundred five one five zero zero five three or go to ... beach dot com today\nMessage indeed ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree to further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more checks path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online\nText path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nNews radio and listen to a baby [noise]\n\n\nWe're talking with David politeness let's go right to the phones west of the Rockies Gina Marie in Washington state you got to a specific case in mind you know welcome\nYes Hi God Bless everyone and everything everywhere especially to Samantha ... family and friends um I'm calling about her um when I heard that the look on tonight I was calling to talk about her and that was the first case he talked about\nUm I went up to the mountains in granite falls off your sunrise mind trail uh we're ... um for a week and a half weeks ago\nTo go and officially search you know and with a friend of mine and ah she fits all the criteria she had you know ... I'm so she had a medical condition anything extra hiker\nGranted it's in granite falls the granite and boulders creek forever if you have to cross through the creek that um\nHe how when we went um Mm came back out of the mountain and um we met up with a couple of other researchers and I'm One and only had found some future panties 'em and they tried calling in nine one one non emergency number and they tell search and rescue and they never called back\nUm and another lady um they were and that generally now became flash at certain points um yeah and they they tracked it on their own they could give it to the end of um\nYou know I I don't know I have a three page on my cell phone and excuse me one of them didn't make any sense it was way off to the left or the or where you park your car it's not even with a trail is um anyhow um and it kind of the day you know I've thought of what could be and I figured maybe ... to another dimension\nUm big foot big foot my the guy who was with in front of a ... foot a couple of times in their\nFamily and I've seen a shift twenty five feet above me and also an underground secret naval base that owned the land stage enough I'm On the back side of this now that Jim creek 'em at all I had it\nAnd I don't know and it could have anything to do in this case or not but it's just it all kind of strange things that I might even mentioning that phone call you guys had sounded like big but because I couldn't big before\nWell gee you know we're going to get Dave to react to you dropped a lot of stuff on us there will get Dave's reaction to some of that I mean all those ideas have been proposed before I I'm I suspect that he's going to tell us that we don't have enough information to ah to assign it to any one of them but they you can speak for yourself\nOr oh oh I had on one of those things are the cell phone hanging up about a case in Michigan\n[noise] several years ago and they crack this guy's song over this area\nAnd according to the kings and according to where it hit he would've had to have crossed a road multiple multiple times\nIn this pattern that he was supposedly tracked him and there was never any evidence he was in any of these areas and he was found the feast\nIn an area probably where he should have been and where they were originally looking\nBut it just like this lady said the kings didn't make any sense [laughter] probably more often than you're here and everyone kind of ... often says well you know maybe it's just the technology we don't know maybe not that good there's some reason we're getting these paintings in these areas\nAnd it's disconcerting that they happen because and not only throws off the search there's never an adequate explanation of how it got there\nOn the Appalachian Trail from Rochester to Philadelphia you there's ways to drive in many places in the Appalachian Trail you can pull off the road and just walk and take a nice walk on the trail and one time I did that in the afternoon\nAnd there was a a man or woman and a boy and a couple of other people walk in one direction and we started talking and walking within five minutes another family came from around ab ... seemed like to me out of nowhere\nAnd there were picnic tables right near there and the one woman who I was very suspicious of that just appeared said Hi to the other one and she had a girl\nAnd the shuttle can our kids play and the the the people that I had been walking with the mother said yeah and we sat down at a picnic table and the the strange woman said to the other lady that I had been walking with what's your name [noise]\nThey they tell their name and the woman says that's our name too\nAnd then about three minutes later the lady looks into boys gone and she starts calling them and I got up and I walk around and I swear to God I Am not making this up\nThere was a close creature over the boy the boy had passed out or I don't know if the creature bump them but this is the part I Want you to know it had\nKind of futuristic very tight fitting clothes it jumped this creature looked humanoid\nBut not totally human it jumped at least twenty feet from the ground ... without running jumped up to the the middle of a tree where the you know the branches start coming out\nAnd then I just turned around and I went back I didn't say a word I was scared I thought that that creature and those people that appeared were part of the same group I thought they were military people and this creature was a genetic hybrid this is what I Believe\n\nWell that that's quite a story a David any reaction to that\nNo one interesting\nYou know you do have some uh ask well thank you for calling with that and the the other folks who are on the phone hang on because in the next hour or I'm going to be here I'm interacting with our our listeners and um and so folks have you have your own stories and theories then I'm all in and we'll we'll have plenty of time to chat and the next hour\nIn some of your books David and I'm not sure I don't remember an example here you you reference it about an earlier book in this new book um about the boulders\nAnd I I was always wondering well heck there's boulders all over the place how can that relate to\nThe missing persons a mystery you have a couple of cases where witnesses tell you why it it relates that these things sort of come alive um or they move right\n[noise] well yeah I wrote a story in my last book one right before this about a story of a Spanish priest in Texas that\nWas running from Native Americans in on this giant piece of cake granted in Texas state [noise]\nAnd he said that after you ran up to the talk of the granted it opened up with him and he said it was just older gifts committed for three days\nAnd then he said at the end of the third day that amount and the only got like that and uh people probably don't know this story I Won\nThat when they're building it for granted or big older because they have a boy or a nurse or friday that things are living inside those\nDave a polite is a missing for one more land air water is the latest book it's as rebutting as your earlier work and I want to thank you for coming back\nEffects million George\n... will be in touch soon I Want to talk to you about that in about a triangle a little bit more maybe we can do something together for television anyway\nIt's great to have you here\nFolks stick around the next hour we're just going to be taking calls from you maybe you'd like to comment about uh about Dave's or work or maybe you have some theories to explain some of these cases maybe you've had your own experiences are stories those of you who are on the line hang on and we'll get to your calls in just a bad here are the four tops stickers ended the break\n\n\nExcuse me I Know you have a nine o'clock so we'll keep this short I'm a business suit in the back of your closet you warn me nearly every day before your office went quote casual\nI used to be the c._e._o. of your closet now I'm just out one interns no one ever talked to I always thought you'd circle back with me get granular keep me in the pipeline but not\nNothing don't you remember the kitchen presentation you still coffee on me and I still look amazing during the break out talk back human eight so\nI think it's time for me to move on I got a great resume and I absolutely crushed in interviews okay let's make this a clean break ship the paradigm the only thing I ask that you think outside the box here and do this\nTake me to good well where I can really make a difference\nYour donations to good will create new jobs training programs an education assistance for people in your community defined your nearest donation center go to goodwill dot org donate stuff create jobs message from goodwill and the ad council to find some people\n[noise]\nNothing because the moment he's the boss\nYour child's eyes opening up to a world a possibility\nOne to the point Michael Moore all the different\nThere are some moments only the forest fire find yours discover the force dot\nLearned about forest near you\nDiscovered cool things to do when you go hiking\nFor camping\nCreate your own adventure with\nAnd friends and my just see this\nNew movie or something they're\nFine to discover the forest dot org that discovered the forest\nRocky by the U.S for a long count them\nKnowing your breath and save your life\nGo to know your girls that are going\nFacts on Brett tell\nYou by Khomeini and the ad council [noise]\nWe have a trade deal I'm an Carrick Fox News the United states and Canada confirming a new modernized trade agreement designed to replace the Nineteen Ninety four NAFTA packed\nThe new deal will be called the United states Mexico Canada agreement us MCA\nThe agreement reportedly preserving a NAFTA dispute resolution process something the U.S wanted removed the agreement ... terrorists on two point six million cars and includes a dairy deal essentially the same as one rejected by President Trump steel and aluminum tariffs are not part of the agreement\nThe U.S and Canada under pressure to reach a deal by the midnight Sunday deadline it's been one years since the deadly shooting in Las Vegas fifty eight people were killed more than eight hundred injured Natalie ... was shot in the jaw and continues to recover she tells Fox many survivors steal a responsibility to tell their stories still\nHave a lot of pain and it's a and a hard journey with all these surgeries and ... and and now my face will never be the same my smile and my question off changing and there are different now and I'm obviously grateful to the allied\nLittle has changed regarding gun control legislation in Las Vegas authorities had been unable to determine a motive on Friday President Trump ordered the FBI to conduct a limited supplemental investigation into sexual misconduct and assault allegations against Supreme Court nominee Brett Kavanaugh\nWaiting for the FBI to produce this report we don't know how long it's going to take now the agreement is seven days\nA but if the FBI comes to the Senate and says it's going to take a little longer we're gonna have to do more thorough job here you can't imagine that the Democrats and the Republicans would be happy about that but they say All right let's take the time the Democrats might be very happy about that frankly because you know the longer they can drag this out the worse it probably is for for Brett Kavanaugh Fox is Chad\nPark from Fox News fair and balanced [noise]\nNow the news radio eleven Gen okay a baby whether watch\nScattered showers and isolated thunder showers likely overnight along with the fog and the drizzle a study temperatures and you're fifty degrees is we had George Monday morning than sixty percent chance of morning and afternoon showers and drizzle cloudy otherwise instill cool with a high a fifty eight and north northeast when a five to ten miles\nAnd their high then like know finding when they have found some room and you know how\nLong that even that has slashed because they're scared to do anything for ...\nWell that sounds interesting I'll tell you what I Will make a note and send it on to David and see if he has any information on it he he has a pretty good network got us in Tim courage cases so chances are he knows something about it but I'm Sorry I don't Nancy thank you for the call going to bury in South Carolina hey Barry how you doing\nHello your nap I Hope you're doing well buddy I got a real good story to tell you about the national Park Service\nOr it goes right along with what you were talking about and um I I don't know how familiar you are with the east coast guard but apple acting Troy awards for twelve hundred miles north Georgia and a moose headway Maine\nAnd there have been a lot of gifts of parents are hikers it runs right along the of the room of the Appalachian Mountains and ... either way me and my wife ... love Ashville North Carolina about a year ago\nAnd we pull into this rest stop area in your shop stuff in the park ranger there\nAnd I got to talking to shoot the ball and go you know or what do you pay much attention as some people gathered around asking about the different version area and uh you know so ... and all of a sudden and how ... it you are or what I said\nWell tell me how much you know about all the people that there's a fear here on this Appalachian Trail and George ... the main or shame\nHe had an antagonistic toward all over and we all just kind of drifted away right hand side or the gift shop yard we and my wife and I came out about thirty minutes later and he was ... about\nThirty feet from the McCain jak contact with him and he said come in and he nodded his head and\nI did you know and he said\nIt me a favor vase and don't ever mention anything about that ... around the crowd\nThere are in different areas and ah [noise] and since er during that time period or my wife and I had a\nHad the misfortune of having a miss a missing son [noise] and uh he was a very well trained a boy scout and uh we figured that uh you know that uh since it's been two years now\nThat uh you know it's a well nothing ... nothing has turned up in terms of evidence or anything like that so the uh the local law enforcement closed the case and ah and because he's an adult we can't go forward with it because of his wife\nAnd a and so we're we've been kind of stuck with that but I wanted to find out it's a mixture of prices are being\nAware of this a phenomenon of uh of defeat a issue and uh it's it's been a well publicized in newspapers in in over there\nYeah I'm I'm sure you've heard of that and uh you know if you wanted to try to contact him we have a we have links on that goes to goes website his website is can am missing dot com that's where you reach a days I I Know he knows about the ... the story because it was a widely publicized but your son\nUm what are the circumstances where did that happen and when\nEyes hard radio weekends boards time capsule\n[noise] and now the heart radio we can sport time capsule\nSports fans of Sandy lasted I'm here to take you on a journey back to this week in sports history start back in Nineteen Twenty one and the first broadcast of the world series on radio in New York Yankees beat the New York giants three to zero [noise]\nThis week in Nineteen fifty five Baltimore coal fooled back Alan and meet she becomes the first rookie in NFL history to top one hundred yards rushing in his first two games get a hundred and fifty three against the Detroit Lions after his one hundred and Ninety four yard performance in his debut against the Chicago Bears this week in Nineteen eighty four Walter pain\nPassage Jim Brown as the NFL's career rushing leader\nThis week in Nineteen Ninety One the New York rangers trees burning nickel to Edmonton\nFrom ... in Nineteen Ninety four he would leave the rangers to his family come victory this week in Nineteen Ninety three after nine years of playing in the NBA Michael Jordan retires from basketball you start playing minor league baseball and then he returned to the bulls in the NBA in Nineteen Ninety five [noise]\nAnd this week in two thousand five the NFL plays its first regular season game outside the United states when the Arizona Cardinals defeat the San Francisco forty niners thirty one uh fourteen in Mexico city Mexico that you're a high\nHard radio weekends Ford's time capsule think your child might as well\nMedications gotten into your household products at a reaction wider renting called the police helpline first for fast free advice from medical professionals called one income or two to one to two anytime anywhere see the number save a life ... by the U.S department of health and Human Services asking your smart speakers\nWhether it\n[noise]\nI'm trying\nTo run around and um\n\nOh\nNo kidding\nOh\n\nAs long as you get so much\nEver need\nTo talk to George nap called the wild card minded eight one eight five zero one for one zero in on the first time caller lined is eight one eight vibes zero one for seven to one\nTo talk to read from east of the Rockies goals eight hundred feet to climb vibes zero three three from west to the Rockies to three calls eight hundred six one eight eight to ... this is coast to coast am with George now\nThe traveling will berries ended the line breaks off we're talking about missing people disappearances the strange criteria as outlined by Dave ... is missing for one one book series\nAnd I'm hoping that some of you have your own experiences or a you know somebody else a case that's from your area or maybe you've seen something weird out in the wilderness out in the woods that you want to share with the coast audience will go to the phone lines in just a moment and get to as many of your calls as we can [noise]\nTake one atom of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide a miracle molecule your own body makes that fuels your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human\nHas harness the power of nutrient rich beach and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body one teaspoon of super beach daily support your cardiovascular health in blood pressure levels\nWe're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase\nField do one plus one equals boom affect the superb each call one eight hundred five one five zero zero five three or go to ... beach dot com today\nMessage indeed ... if you're considering going back to school after filter following questions do you need the flexibility to take classes and your schedule you have college credits to transfer\nDo you want to earn a quality degree from a world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for you\nArizona State university offered over one hundred and fifty highly ranked degree programs one hundred percent on line\nYou learn the same degree as he went on campus from wherever you are on your scheduled press I don't see why mine except familiar transfer credits for information ... lived for three five sidelined seven\nLearned for yourself fly here was ranked number one for innovation by US News and World Report\nAnd learn to thrive with Arizona State university for more information about all the one line ... lived for three five five when sat and talked to are are the two three five five lines sat in radio of\nTo gay a baby [noise]\n\n\nOur final segment tonight on coast to coast let's go to the phones first time caller Glenn in ... Washington Glen welcome to the program a lot of weird stuff happen up in that area\nYour order and rock lake area George\nI have not but uh please tell me about it what what is your experience been\nHappy they're very um my wife [noise] like I don't\nKnow why you're wrong\nHere and there was like oh I Know like greyhound walking on later on a couple of weeks later\nAnd it never was never ever said about it you know anything about that or\nI don't know anything about that specific a creature or creature report but I Do know that the ... of area has been a hotbed for really weird stuff for a very long time\nOr the guys who investigated the skin Walker phenomena Utah spend some time on the ground up there collecting information and stories rumble locals including the tribe\nAnd had reported the number of different kinds of creatures it's always been a UFO hotspot or at least for the last fifty or so years so there's a lot of weird stuff\nConcentrated in the area you're discussing uh but no I hadn't heard the story about the the um things pulling people out of their sleeping bags room rock lake thanks for sharing that do appreciate it we're going to go east of the Rockies to Roy in Youngstown, Ohio\nMorning Roy hey how you doing All right what's on your mind\nHey um I remember a ... this evening\nA you guys were talking about a ... you were talking about this couldn't walk or rent rent and uh and I literally stood up and said that it and I point out the radio because I've read all the books I've read all the four one one books I've read the skin walk ranch book\nAnd I've been following this thing for some time for several years\nOr ... was ... when you guys were talking about that all kinds of things to come to mind a rich lived a certain number of uh disappearances are a lot of disappearances happened on or near rich line and I just couldn't walk ranch that's on a ridge line\nUh let's see uh a hundred percent success rate every time an individual is taken no one ever see something taken over the skin Walker ranch\nWe're dealing with with with something that is highly intelligent and no one ever ... somebody's on the property or on around I mean it's just to me I'm just saying to me uh in my opinion I think that you know the the skin walking ranch uh\nIs very close to uh the\nThe phenomenon surrounding the Fort one one [noise]\nWell I you know I think there are some similarities and that it is whatever it is it seems to be intelligent and it seems to know what people are doing before they do it themselves and it's still the that's for sure the only difference is there at skin Walker to my knowledge no one has disappeared animals they're here but not critical\nYou know there has not been any people now saying but there's been a you know yeah I mean that's the other side that we have had animals missing but then we've also had mutilation\nBut um you know I just kind of reason to the way that well there are people but I tell you up in those woods there'd been some strange strange events uh I I called in a while back I talk to you when you talk to the big\nFoot researcher that the records their their sounds it was in those sim woods\nI heard this ah ungodly sound that couldn't be any other animal and I don't think of the best opera singer POV raunchy could have imitated the sound and I'd encourage you to find out\nWhat coast to coast did with the audio tape they used to play of this a legit big foot recording ten or more years ago George ...\nYou used to play it I think art bell used to play it hasn't been played for years but I heard that up in the shame which is a unique recording never heard of it before\nI'm starting to buying more and more to the fact that these big put my feet dimensional Mike extraterrestrial connection ... that I saw in the woods but more I think about it there's\nI'm Ninety nine point nine percent sure those remarks humans\nAnd hindsight I'm just glad they didn't take me whatever they are doing up in that area\nWell we're glad to cause a ... you wouldn't have been able to call in presumably thank you Jason for sharing that story that's a that's pretty strange you need to start carrying some recording equipment with you wherever you go thanks very much try to get one more caller in close to home here Brian in Las Vegas hey Brian what's on your mind\nOh yeah\nA couple of comments on the on the Michigan for one one on one on\nPrevious callers and over quickly maybe to get the story in real quick\nUm I had kind of a big would experience and it wasn't until he played this year sounds like coast to coast they realize that that's what I heard I\nWas up um the Willamette or for national forest it's a lot of fields of between um mount bachelor and a three sisters in Oregon\nAnd um it was up there a late night watching the stars and hanging out and you know like to play music stuff sometimes I just kind of hang out somewhere where it's quiet and there's nobody around for hours up there and we went down to look into stars through the ... and I heard that same sound that he's talking about as best as I Know what he's talking about [noise]\nUm and it at a weird psychic effect I don't know anybody else has had this experience but um it was kinda like hey what are you doing up here you know and and I\nKind of second guessing but\nOil it's really far away and uh you know maybe I'm just imagining that and\nSo I kept hanging out and look at the stars in about ten minutes past and they closed oh I'd say at least three to five miles in maybe ten minutes and it did the same sound again only the the impression or psyche can personally at all it was like hey I'm coming at you\nAnd may I jump to my car so bad and got out of there um and\nYou know I never really piece together what was you know I'm like Crawford I Will do a lot of reading listen a lot of course coast of and when the sheriff down to like oh my God that is what it is it has a you know I'm a musician so I listen to overtones and frequency and stuff a lot\nBut I and I'm I'm Sorry to cut you off but we're at the end of the program I thank you for sharing that story with the snow and I'm Glad you got the call ended a hope you'll call back and ensure stories with us thanks to all of our other callers as well and to my earlier guest stay ... new book is called missing for one one land air water\nAnd we'll have date back got real soon to talk about something else so thanks to my colleagues there at coast to coast Nathan's Dayton and a dog Walker\nBreak bishop our Web master at Sloane ... also helps us out ... always uh\nContributes to the program at of course a producer Chris morals George ... is back tomorrow night I'll be back in a couple of weeks goodnight every one [noise]\nGetting ready to be in the new to me you streaming it is yeah\nIt's a new month which means a new list of streaming goodies that'll keep you from raking leaves Netflix's adding the much anticipated second part of making a murderer on October nineteenth as well as these daredevil the hip hop evolution season to that same day Ron whites new comedy special titled if you quit listening I'll shut up drops in the sixties\nAnd places for Marian new music ... series called re mastered the first special focuses on reggae icon Bob Marley called who shot the share of on the movie side to get you down John with a never ending story be big adventure Robyn at Princeton these blood ... like the devil's advocate\nOn Al Pacino was born to play said you've got to lake house Billy Madison the shining that can marry make more and more\nHulu has your Halloween fix this month with movies like Wes Craven present day scary movie Texas Chainsaw massacre to the nightmare before Christmas rack one through four\nIs available plus everyone's favorite killer ... ... in the original ... you can also catch a new season from years of Fox's animated shows like Bob's Burgers Family Guy and The Simpsons now when it's thirty sneezing\nAmazon Prime at more than two hundred titled this month with movies like raging bull full metal jacket robocop one two and three and the David Lynch bill Mulholland Drive maybe you can figure out what's going on this time to relive all seven seasons of growing pains\nOn prime and watch the man in the high castle season three which premieres on October sick and that they wouldn't be screaming edition and I heart radio\nWhen it comes to parents who are known for being brought home because you don't have the perfect be hearing about the camera you ... for more information on adoption\nIt was it a dumped us kids do toward a message from the U.S department of health and Human Services are dunked us good at the council\nJoined usually the choice to dance to\nFor me to be informed secret traffic going to live in a ... a B [noise] down to\nThe wire on a new trade deal I'm an Carrick Fox News the United states Mexico Canada agreement us MCA replaces the Nineteen Ninety four NAFTA packed\nThe U.S and Canada confirming late Sunday and agreement was reached the agreement of them terrorists on two point six million cars also included a dairy deal once rejected by President Trump the agreement reportedly preserved a NAFTA dispute resolution process something the U.S wanted removed\nWith the announcement friday of the FBI's week long investigation of sex assault allegations against Supreme Court nominee Brett Kavanaugh a delay in the Senate confirmation vote judge Kavanaugh's confirmation suddenly thrown into doubt\nWhen you're looking at a nomination that is basically one vote short or to vote short depending on how you crunch the math\nYou don't really know exactly how it's going to turn out you you don't know which way it's going to tilt uh that's the problem that the math and the Senate is so tight fifty one Republicans forty nine Democrats so if they're able to court one of these four senators who appear to be on the fence right now\nLisa Murkowski of Alaska Susan Collins of Maine a Heidi Heitkamp of North Dakota Joe Manchin of West Virginia they might be in business\nFox is Chad per gram California passes a law for net neutrality and the Justice Department filed suit\nThe new law aimed at preventing Internet service providers from blocking are struggling trafficker offering paid fast planes known as paid prior tradition\nThe Trump Administration wants to deregulate broadband Internet service companies freeing them from utility style rules supporters of net neutrality insist the rules are necessary to project equal access to content on the Internet [noise]\nSailor companies are getting into the Internet service business promising ultra fast affordable wireless option varieties and Tom Service launches in for cities with five gee technology\nNow the news radio eleven Gen ... baby whether watch\nScattered showers and isolated thunder showers likely overnight along with the fog and the drizzle a study temperatures near fifty degrees as we head towards Monday morning than sixty percent chance of morning and afternoon showers and drizzle cloudy otherwise instill cool with a high a fifty eight and a north northeast when a five to ten miles per hour with\nTo help protect your identity and devices life lock uses proprietary technology to help detect the range of threats to your identity like your personal info for sale in the dark Web\nAnd north in security protects against online threats that if there's a problem life locked with Norton agents will work to fix it\nNo one can prevent all identity theft\nCybercrime or monitor transactions and all businesses\nBut new life lock the door and security provides more detection and more protection against cyber threats to life locked dot com recall one eight hundred lifelong can use ... Georgetown for an additional ten percent off your first year\nPlus a twenty five dollar Amazon gift card with the annual enrollment that's life lock dot com promote ... George ten for ten percent off and a twenty five dollar Amazon gift card term supply\nMessage indeed ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree to further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more checks path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line\nText path to seven nine six four or five that's P H A T H to seven nine six four or five\nRadio of live and did\nThey be [noise]\n\nWelcome back you know I don't think a day goes by when I don't get at least one or more messages from coast listeners asking me witness that missing for one one guy coming back Wednesday ... going to be back on the air\nAnd I always tell them not soon enough we get more requests for Dave than any other guest that I've experienced is I've been with the program for ten years and that's a that's because he always brings the goods I Am jazz that he always allows me to get the first interview when he unveiled a new book and like the other books this new one does not disappoint\nA day but as you probably know spent Twenty years in law enforcement then worked in the tech industry for a bit but found as true calling as an investigator of unusual disappearances and his work in that area has become a phenomenon known all over the world multiple books a documentary film\nAnd maybe some other surprises become Dave great to have you back\nIn Georgia I'm always humbled that anyone even wants to listen to listen to me though or appreciate the invite\nI wanted to say you know I noticed something as I was reading the new book today that you make some personal observations that I have not uh I haven't seen it you go this far in the other books I insights\nInto your own emotional reactions to some of these cases and it seems clear like the subject really gets to you and you've got I think eleven hundred and thirty five pages that you profiled over the years thousands more they'd be looked into\nSome of them really seemed to get into your head though I I think in part because of similarities or some of the missing to your own life right\nYou know I think that's true um\nI've been very fortunate to me\nFamily of people who have been lost and when you meet these people it really brings brings home the emotion and there's a lot of parallels to my life with a lot of these families and I've written about people that remind me of myself a lot of times and uh [noise]\nI've put the in the book just recently ... probably because it's it's more of an evolution of my writing and hopefully people\nSee that you know have these people are really really good people these are the drags is fighting these are\nThe upper echelon and it's a conundrum to me why I don't find people that are down and out in life that are disappearing but it it seems to me that it's always the high rollers the people that are high performers that are disappearing\nYou know one place in the new book you've mentioned how as a rule you did not reach out to the families of the missing now sometimes you meet him in ... due to various circumstances but in general you don't call somebody up out of the blue and say hey can I talk to you about your dad loved one or you're missing loved one because it seems like an invisible line that you don't want to cross over but I Wonder\nHas the success of your books help in the sense that these families now reach out to you that they're unsatisfied say with the the search effort or something and they're they're turning to you for some help her answers\nIt has happened and uh [noise] I don't want to inject myself into a search or into the turmoil that evolving with somebody disappearing now somebody reaches out want some help absolutely I'm going to be there I'll do everything I can [noise]\nAnd there's been cases just recently where that's happened and I've been ground to help and ah I've kinda guided them and it it seems that a lot of these families\nAnd covered the same sort of issues time and time again and it's frustrating as heck to sit back and hear the frustration and their voice a\nCommon one is is it seems as though when jurisdictions stop searching they get to a point seven to ten days and they say hey there's nothing else we can do there's no place else to search\nA runner and out of resources we've got to stop well many times families and friends rally at that point and they get a group together and they keep searching for what I tell these people is you've got to get a copy of those reports that the jurisdiction wrote search and rescue reports\nLaw enforcement report the who they interviewed who they talked to were they search the effectiveness of the search or the areas they completely eliminated in the in the areas that they thought that they still should search more because without that you're really searching blind\nAnd there's been instances just lately where people have said no they said they won't give us anything\nI find that baffling\nI mean that's how they've treated you I was gonna ask you the same question about different agencies I Know how the national Park Service feels about you and that they are we should anybody who has not heard your earlier interviews or is not familiar with the books who might be listening tonight\nI'm maybe we start there where you can explain the history of your interaction with the national park\nService the forest service government entities in general because they've shut you out I mean I guess I I'm interested to learn that they're doing the same thing to the families of the missing but uh it's really kind of clear over the big picture that they don't want to help solve these mysteries\nYou know it it's a sad note on humanity if that's the case but there is a lot of obstruction so when I started out I was told by a couple of Park Service rangers that they had found\nDisappearances in their parks where they had worked that bothered um didn't make sense when they tried to find information they couldn't and they thought somebody with an investigative background on to be looking into it\nAnd that's sort of how it all started and I filed a series of freedom of Information Act requests against the national Park Service they have the largest contingent of federal we train police officers and the national park police\nAnd they're trained at the federal law enforcement training center they get outstanding training they're smart people they understand what should be done and I asked for a list of missing people well they came back and they said they don't carry any list and they don't have any list of missing people in their parks and jurisdictions\nAnd ah we talked about it and it had to be a semantics issues ... refiled and they came back in the attorney called this time and said why do you want this information\nAnd explain to him I said hey you can't ask that as a determining factor in for you and they said oh we're not we're not saying we're going to use that to determine we just want to know why you want it and I said well how research and then it came back and he said well you don't have any listen missing people\nI said well you have two hundred and eighty three parks monuments the patrol and you have a lot of police officers and then you have special agents that are to the detectives\nSo somebody must be keeping a list that each individual location or acumen who was the headquarters to understand what's happening and it's only politically correct if somebody calls in and wants to know the status of the case how you ever going to find it and said no we don't have any less\nSo years ago somebody said well if they if you are just file a request and see how many rules of toilet paper at Yosemite National park I bet they have that inventory list [laughter] and\nCourse they would but as it happened they came back and I said well I'm a printed author so I Want to use my authors status\nAs an exclusion for fees and get you to accumulate that list for me a couple of weeks later they came back and they said well your books aren't enough libraries to qualify Lucian of such qualifier just some arbitrary thing\nThey said and then I said okay well why don't you just tell me how much it's going to cost me for you to put together the lists I Want to list from Yosemite and I want to was from the national Park Service\nAnd they said well it's going to be thirty four thousand for the list from Yosemite and one point four million from the list from the entire system and I can't tell you how many people\nThree more series in the franchise would appear all with theme songs by that I still think my favorite was CSI Miami with David Caruso saying cheesy lines like this into the song it looks like\n\nThere's a look back at this week's Wyoming\nDocuments kids present multiple choice parenting you accidentally cut your daughter's bangs unevenly do you mind things up a centimeter former hairline\nMental mental mental sweat fans are still hot right now everyone's wearing them like that get ballplayer and that basketball player B gets spiritual mom where did all the ...\nOf reflection could never capture are true south huh beauty is within\nOh let's see look on the bright side less time low trying more time texting or D show empathy mom you really don't\nHave to\nKind of have a parent on alert again or do you have to be perfect to be a perfect parents Arnold ... for the camera level for more information contact you\nGot to believe that you got to believe dot org a public service announcement from the U.S department of health and Human Services to the dump us kids and the ad council\nThere's both a will be caught on exchange flash crowd\nDisasters don't plan ahead but you can talk to your loved ones about making an emergency plan getting started today at ready dot Gov slash plant brought to you by FEMA and the ad council asking your smart speaker\nFor about his newsletter play\n[laughter]\n\n[laughter] [noise] [laughter]\nWell I'm In the bombing please\nPlease\nNa na na\nNa na na\nYou are listening to the coast to coast am with George now even though the\nAh they say that imitation is decent serious form of flattery um it can go too far though of the success of David ... missing for one one books has inspired other people to sort of borrow his template\nAnd they're bringing their own uh I'll put that deals with the same subject which I guess we all need more information on it but some have gone too far there are people pretending to be him\nAnd in a moment I'm going to ask Dave about that and then we're going to jump into some current cases new disappearances that maybe you can shed some light on out there in coast to coast when we'll be right back\n[noise]\nTake one Adam of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide a miracle molecule your own body makes such shows your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human\nHas harness the power of nutrient enrich beach and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body one teaspoon of super beach daily support your cardiovascular health and blood pressure levels\nWe're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase\nField one plus one equals boom effect of superb each call one eight hundred and five one five zero zero five three or go to ... beach dot com today\nWarning if you're buried in debt you can't afford to not let the credit card companies make you think that you have to pay it all back because you don't what the credit card companies don't want you to know is that there's actually a way to get debt free without paying off your entire debt\nOr going bankrupt if you have five thousand dollars or more and credit card debt you know have the right to let us settled that debt for a fraction of what you will for free information called debt free dot com now\nAt one eight hundred four hundred seven\nOne four or five will even show you how much money you could save if you are struggling to pay off your debt do not let the credit card companies make you think that you have to call debt free dot com now\nFor free information on how to get out of debt faster than you ever thought possible without bankruptcy we offer a guarantee with no upfront fees so there's no risk for the free information you need a call now\nOne eight hundred four hundred Seventy one four or five that's one eight hundred four hundred seven one four or five one eight hundred four hundred seven one four or five\nNews radio of living to live in a way of a B\n[noise]\n\nDavid polite as I mentioned uh during the break there that uh you've got some imitators out there are people who have written books similar to yours as well as people who've gone further than that pretending to be you can you address that for a moment before we jump into the cases\n[noise] for one of the most frustrating parts of you know in the public spotlight I go to conferences all the time people come up to and they say\nThis how did you come up with that I'm thinking I never [laughter] and there's a serious YouTube sites\nThat have the named David quite is missing for one one missing and national parks\nFrauds they're not me there are people that have used my name to get innocent\nAnd listeners to get on and\nEvery time you click through they get paid by their Google Ads the only site that has me is a candidate missing project YouTube site\nAll the rest are not me in fact about eighty percent of them when you click in and you listen if you don't know if somebody else talking about some other topic and it's not even me at all so\nI tried to tell us to people don't trust you to really don't even listen to him a Muslim ... missing project site that's the only real site that you're going to get honest information from\nAll right um talk for a moment about search and rescue parameters because that that information becomes key you picking the cases that user ruin on I mean there are metrics there are\nData um for search and rescue 'em yeah how how they proceed and and I a huge database I Would think that gives clues about which cases stand out as being unusual\nSo that the data that you're trying to get to is really in the reports that they generate\nAnd the national Park Service for one won't volunteer up any of these reports now find name a specific date and a specific time and that person has been rural to be a missing and presumed deceased\nThey're released the report most times times they want [noise] there's a case from eighty six\nI'm an error the girl's name was ... she was missing from Yosemite and I've tried to get that case ten times and I know nobody looked at the case in Twenty years and especially if they're told me I'll never see that case\nIt's a standard missing persons case there is no suspects there's no crime why can't I see it\nUm and just so people understand in law enforcement missing people is one of the few things that they handled it isn't criminal uh everything else in the law enforcement world is criminal oriented\nAnd missing people it's not against water go missing if you want to fall out of society you can and it's handled entirely different than a criminal investigation there's no prosecution that's going to emanates from these cases that are Thirty years old that disappeared in the middle you're somebody\nThat these people harbor it like there is some secret in there that they don't want you to see\nAnd a lotta times I'll grant you that the reports are horrific they don't have much data they don't have much information other times that are really really good and I don't understand why there and want us to see it but there's this\nI called territorial behavior and many of the times they won't grant you access now\nIn the state of Washington they have a mandatory disclosure law that reports have to be disposed of the public upon the crust Colorado has that laws well sort of like the freedom of Information Act a law\nBut many states don't and law enforcement knows that and they won't give up anything um so the first thing is you've got to get these reports to really see what is there because you really can't trust I'm Sorry to say the storage you can't trust the media\nBecause I Would say eighty percent of the time when I finally get a copy of the report\nThe news reports are totally completely wrong compared to what law enforcement said happened", "year": "2018", "show_name": "Coast to Coast AM with George Noory", "city": "Omaha", "day": "01"}