{"month": "10", "state": "MA", "station": "WBUA", "content": "Owner of the ... market basket chained ... calls and says Samuel or why are you selling to my competitors and not to me that he had thirty four stores at the time and some and say well ah to be honest Mr demos we don't have enough cows he said well get some\nCows and he slammed the phone down and we took that is very good business advice so we went out and grew are hurt even further and well\nThen so we now realize we needed to get serious about this and so we managed to lease a small refrigerator truck and started delivering actually to the market basket where warehouse\nHow much yogurt were you making at that point we're producing now about three hundred and sixty cases a week of yogurt and a case like twenty four\nCups six ... six packs of court and so by the end of eighty four we were are run rate was headed in the sort of half a million dollar range but you\nWere probably spending more money than you are bringing in right\nOh my God you have no idea yeah we were burning I mean I kept not weekly cash flows not daily casualty I kept hourly capitalism yeah I knew on a Wednesday morning how much money had to come in that afternoon in order\nFor us because by then the cup guy it figured out some you know send me it wasn't paying them so now we're on very short terms with everybody I mean my fundraising\nSkills turn out to be you know we will be nowhere without Samuels yogurt making skills and his family's unbelievable\nAttention to detail they were perfectionist but we were also we would also be nowhere without my ability to keep getting credit and cash because it was burning [noise] I mean we were on him [noise]\nWe come back in just a moment how Garry and Samuel begged and borrowed\nAnd how they almost lost it anyway again and again and again I'm Guy rise and you're listening to how I built\nThis from from NPR from [noise]\nThis is not as you point going W. B. U. R. N. W. B. U. R. dot org partly to mostly sunny in most areas but some clouds in some areas for the rest of the afternoon temperatures in the fifties\nFifty four degrees now in Boston make the most out of your car ... even when it's time to replace a bug donating it to W. B. you are you'll be supporting the news and you may be eligible for a tax deduction find out how the W. B. U. R. dot org slash cars and things\nWere funded by you our listeners and by ... which one of the local stores featuring all extent of the products including extent of the mobile and X. men of the Internet\nStore locations are extremely these stores dotcom\nFucking and brown and nickel\nA coed pre K. through twelve day school in Cambridge open house Saturday October twenty seven details at BBN S. dot org and good news garage New England car donation nonprofit providing affordable and reliable transportation solutions to working neighbors and need good news garage dot org\n\n... verify dot Gov slash go and from transfer wise a service that helps people send money internationally three million people and businesses use transfer wise to send or receive and convert currencies and more than Seventy countries more it transfer wise dot com or from their [noise]\nHey welcome back to how I built this from NPR I'm Guy rise so in the summer of Nineteen eighty four Gary and Samuel an stony field are almost broke their basically running on fumes and they're trying to bring in more money by just finding a few more stores to sell their yogurt\nIn those days as a whole foods didn't exist yet but the holy grail for natural products was a little three store chain called bread and circus which eventually became part of hopelessness and they had one store and Cambridge on prospect street and you know we were selling now to Jim Lewis market basket just as now I'm Talking July of eighty four\nAnd um and we were desperately trying to get down there because we knew that if we could crack bread and circus every other little natural foods co up in New England would then take us in\nAnd we kept going down there and they said no no no we've already got you know a hippie yogurt made by somebody in Vermont to in their cheaply with their ... you know they didn't need another you know organic yogurt from some crazy people in New Hampshire [laughter] took place but you guys do\nSo in July of eighty four I had my thirtieth birthday at the farm and my I had my old ultimate Frisbee team um come up to visit me most of whom lived in Cambridge as\nYou might imagine and um I said look it's wonderful you've outcome if you want to give me a really good birthday present good under bread and circus on prospects in Cambridge and ask for my yoga that was on a Sunday on Wednesday Mary Carol skin or the buyer bread and circus called and said Garry I don't know what's going on but demand is suddenly gone through the roof\nWere getting all kinds of requests for yoga get it when when you can you get it in there well I got in my car and I made the first delivered that afternoon I'm about a month later we were her number one selling yogurt\nAnd uh she took us in the other two bread and circus is an awfully went but it was my Frisbee team I mean you know that's what it takes I you know I always say we can ship the yogurt three thousand miles is the last Eighteen Inches that makes all the difference you get it on people's miles and then they're going to ask\nFor an end run around the time you meet magnate ... will become your wife\nYeah without a month after that fateful meeting with bread and circus we had our summer no ... northeast organic farming association conference in I I as it turned out I was the keynote speaker and or right after I finished my speech this very\nAdorable or organic farmer from New Jersey who is running her own nonprofit farm down there\nA waited patiently to ask me a question well that turned out to be what is now my thirty one year white Meg and her mom had been the deputy commissioner of agriculture for New York state so she had a ton of an egg orientation um\nAt one point she kind of whisper to me that she'd be okay with\nA if I needed some money with lending me some well of course that needed money so she loaned us or\nFifty thousand dollars ... I started raising and I got to about\nTwo Seventy five three hundred ... a sort of a month or so later she said well I think we can increase so she increased to a hundred and eventually I got to cross the finish line got the five hundred ... you know venture capitalists are the reason they want what they called F enough money\nThey know that you might as an entrepreneur if things get rough you you might just get up and walk away if it's you know some harbored MBA with with with a tie but if it's your mother's money huh yeah yeah and so now we worked for our moms\nWhich must have been pretty stressful\nOh yeah you know what happened in this farmhouse I always had payroll on Thursday mornings at and but at this point it was a half a million dollar business and I never had cash in the bank that night before payroll never just this is became our way of life and so I think\n... was a sleep in our bedroom which was about fifty feet from my office I Would on many occasions tip toe over to the office to call my mother in law\nTo have a chance to see if I could borrow another thirty five hundred twenty five hundred to make ends meet and eventually ... got onto this and one night I heard the click click a call waiting on my mother in law is on and Meg was calling from the house to say mom don't do this\nWhat your wife was telling her mom not to lend you money for the business right because right well 'cause she didn't have confidence and then they will look she's living in a nightmare me she saw how crazy it was I mean we had chimney\nFires we had the well pump would go out the ... the power would I mean we are on the hilltop farm a long way from anywhere was make things do you listen to ditch the thing that's bag it I mean or or did you eat because it sounds like maybe shouldn't believe in any\nWell she had no reason to believe in it it was insane but why did you believe in and did you think that means you are you are what two three years into this thing and it not only are you not making money you are in that big that big time\nYeah [noise] well I'll say this I'm Meg or you know fortunately loved me even more fortunately probably love the yogurt and we're nowhere else to go [noise]\nYou know she had given up for a job down on her farm in New Jersey and signed on to this crazy them enterprise but here's where the story is I Know that you think and couldn't get worse but\nAs as a Lily Tomlin says it ... it ... it it got a lot worse before it got worse okay what happened what happened well so now I'm going to\nJump a year and a half we've now expanded the plant were buying milk from ten or twelve farms and we have maxed out this little from there is no\nYou cannot squeeze another drop of yogurt out of this place so presumably you are looking to to work with another factory right so spring of eighty six we are out of capacity we contracted with a little dairy in western Massachusetts Greenfield mass we were desperate we did not do any\nOf this financial due diligence one would normally do\nWhat happen for us was their bank went in and put 'em in the chapter seven padlocked implied locked it up", "show_name": "How I Built This", "year": "2018", "city": "Tisbury", "day": "14"}