{"month": "10", "state": "FL", "station": "WJCT", "content": "\nOh I Know my son of very high [noise]\n\nTo how to fight us on Tuesday [noise] and that's\nOur show from hardly strictly in San Francisco\nMedia are music director my outlook on bay [noise]\nMoreno [noise] alec heartbreak on average on guitar [noise]\nHave Palmer on T. [noise]\nOn\nCalling me in my yard and Greg\nTom and yours truly Serena Brooke\nSweet errands\nBuckingham\nOur head writer and out in America correspondent is\nOur writers around my yard Greg\nClara Katie Rich and Rachel ...\nHow Baron Rochelle rocky bend little\nTo read the Virgin Mary Calhoun Tom Campbell Claire Coffee Jason coping Diana ...\nThan had been Janice Kaiser Ben Miller emerald O'Brien Joey Ryan ... Kathryn pleasure no it meant\nAnd our local public radio remember the\n\nNext week for our show at the palace theatre in Saint Paul Minnesota when\nDirty projectors and this ... brother\nLive from here are supported by staples with printers burning can toner cartridges for home and the business and in store print shops for customized presentation\nBooklets and manuals more at staples stores or staples dot com\nOr want to leave you with a with a song by another\nWell one of your favorite songs\nIs sly stone [noise]\nI can be wrong\nDaughter in\nAnd then\nThere are some who found man in\n\nOn and so on and\nWe are a shame if we\n\nAmerican public media\nI think the Mediterranean look coral Gables is largely due to the influence of towards marriage I broke my ankle and coming up on water frontiers weekly radio magazine of the Florida Historical Society we'll talk with Mary biographer are more parks\nWill discuss historic Sanborn fire insurance maps and talk about Ernest Hemingway six two cats that border brought tears Monday evening at six thirty on eighty nine nine W. J. C. T.\nNews and information all day music at night and intelligence funds for your weekend this is eighty nine nine W. J. C. T. up in Jacksonville your community your world\n\nWhen it comes to W. J. C. T. Dallas\nHas a night in America's next in eighty nine nine your community you are\nYou\nGod or [noise] how\nThat's Mississippi Fred McDonald going down\nAnd that's what we're going on this jazz man in America\nDown to Mississippi River by way of jazz and the concern of\nThe conference call up and down the Mississippi traveling highway sixty one and guitars bill ... is taking the river\nWas a place where people were coming together and\nIt's a trip to the birthplace of the ... after the heart of American music one song out of touch with\nEach one was like an amazing opportunity to just go further\nI'd be interested in it because bill leading our tour you know is going to take down a few sun roads along the way I'm not trying to\n\n... um\n\n\n\n\n\n\n\n\nWell\n... [laughter]\n...\n\n\n[laughter]\n... ... ...\n... ...\n...\nWell ... ...\n...\n... ... ...\n... ...\n... ... ...\n\nNa\n\n\nThat was the features St Louis native drink a beer factory phone\nThe first three takes houses the rising sun with Bill was Illinois electric guitar Rudy roasted on drums\nThe phone bill has performed with the great Mavis Staples\nAnd later with the native will be laying in Arkansas who singing originally\nA couple of years later I meant leave my home and I got to sit and she has been played the way having loved the song\nAll along the way and have the chance to play with and I just never would have a dream come\nNow some of the people don't seem like God to be\nThis is the weight\nNa\n\n\nNa\n\nOf the most you know from ... to ... you\nKnow the second version of house of the rising sun\nO\nO\n\nL\nO\nL L\nO O\nL L\nNo\n\n[noise]\n\n\n\n\n", "show_name": "Jazz Night in America", "year": "2018", "city": "Jacksonville", "day": "07"}