{"month": "10", "state": "GA", "station": "WABE", "content": "Just to July [laughter] interesting distress signal or the answer is mayday off Sam she wrote the book Little Women\nLouisa may ... that is correct brand in the in the Nineteen Ninety four\nMovie adaptation of Little Women Winona Ryder plays this protagonist\nJune\nJune [laughter] we were looking\nFor Joe March Sam operate plaza played this parks and recreation character whose alter ego is Janet ... snake whole April ... that is correct where at the halfway point Sam as in the lead three to one\nBrand and she became prime minister of the u._k. following David Cameron's resignation Theresa May that is correct same it's the rock band with the number one album the king is dead\n\nWe're looking for the December is [noise]\nBrandon in walk the line Reese Witherspoon played this singer songwriter\nJohn ... three seconds when no no right to know your note rods brown a June Carter cash to that we're looking more in the\nSame it's the world's largest beer festival most notably celebrated every year in Munich\nOctober fest that is correct here's the situation Sam is in the lead for the two brand and you must get this question right to stay in the game a famous British folk first about guy Fox asked the reader to coach remember remember the fifth of this month's\nRemember remember [noise] fifth of November\nYes indeed Sam if you get this right you win a famous earth wind and fire song asks if you remember the twenty first night of this month September that is correct [noise]\nOur big winners and that's our show asked me and others has musician is Jonathan Gold in\nOur puzzles were written by Madeleine caplin and senior writer Karen Lorie with additional material by Emily winter\nOur senior supervising producer is Rachel Neal asked me the other is produced by Sylvie Douglas and my cats of Travis Larchuk tiara Powell rebel would end our intern Alexis ...\nAlong with Steve Nelson and on your grundmann we recorded by Damon ... and David her again we'd like to thank our home in Brooklyn New York the ... hour live events ... American men ... and\nOur production partner WNYC I'm her ripe ago near ... and this was asked me another from\n\nSupport for NPR comes from the station and from the Pew Charitable trusts marking Seventy years of non partisan research and data learned more up huge ... dot org slash Seventy\nAnd the Conrad and Hilton foundation supporting shining hope for communities the two thousand an Eighteen recipient of the Hilton humanitarian prize nomination information for two thousand a nice scene is that he'll ... foundation dot org slash pride [noise]\nAnd you're listening to Ninety One W. A. B. E. Atlanta a broadcast service of the Atlanta public schools I'm Martha ... it's a minute before ...\n\nSupport for W. H. B. E. comes from Emory jurors master degree legal training for non lawyers concentrations include healthcare business and employment law on line and for part time options available more at Emory law ... dot org\nEverything going on in the world you listen to W. A. B. E. because you're trying to stay informed\nSo why not support it and on this or Seventy eighth anniversary we'd like you to have our limited edition seventies anniversary T shirt\nIt's yours within early sustaining donation of ten dollars a month\nThe shirt features radios from the last seven decades and our seventies anniversary love them\nTo stay informed show your support\nHelp us and the member Dr early at W. A. B. E. dot org slash donate [noise]\nBull's eye with Jesse Thorn in the production of maximum\nOn dot org and is distributed by NPR [noise]\nI'm Jesse Thorn\nJack Black and Kyle gas have literally brought the band back together tenacious D. or releasing their first album in six years putting together an animated series pretty much by themselves it\nIs truly to craftsmen doing their best work yet\nThis time it's like we don't have by boat and Kirk and David Cross of mister show there to hand hold us carry us across the finish line we wrote this and directed at ourselves and lose it\nFeels like was it you know what it feels that hey finally grown up yeah ... ... if the ball back [noise]\n\n\nThis week tenacious D. we'll talk with me about their new animated series post apocalyptic do and more the ban has been around for over Twenty years\nGoing from playing tiny clubs in Hollywood to playing eighty five thousand sea stadium you know it's more alarming his let it almost feels normal now to do that for somebody to [noise]\n[noise] yeah but in fairness we they didn't call me came to\nThe Metallica yeah that one was about when we were on right before McDowell got I don't know that we did a poll that crowd also [noise] did you know that Jack Black got his first acting gig at third team\nWent to school I was so stove to be able to go to school and like some kids are you on TV [noise] thank you thank you I use I celebrity for like [noise] it lasted for a couple of weeks where I had some human powers but then I went back to being in the ...\nPlus a jazz singer Jose James will tell you about the song that changed his life [noise] it's all coming up on those I let's go [noise]\n\n\nIt's ... I'm Jesse torn\nMy guess this week are the two members of a band that I Love so deeply I once sent a check in the mail to a theater company to buy their T shirt there is literally a poster of bears in our bathroom it's for a show I went to in two thousand one\nThey're called tenacious day\n[noise] they don't need much more introduction that Kyle\nGas and jak lack of been together making music for over two decades now even wild jak has become you know an actual movie star the band has put out for records they had a TV show a feature length films and now they're back with a new album an animated series it's called post apocalyptic out\nThe first episode for the animated series just dropped it tells the story of Jack and Kyle J. B. and rage cage they survive the apocalypse the world is very weird now there are monsters everywhere and they were on the mission to change planet earth back to the way it was before\nEvery character is voiced by Kyle and Jack the animation was drawn by jak himself it's silly it's stupid it is very funny and the songs they recorded to accompany the show drop as an album November\nHere's a bit of the beginning of the series that doesn't need much set up the ban seizing explosion in the sky the world is about to and so they hide of course in refrigerator\nGo to bars yes [noise]\n\nOh\nOkay [laughter] [noise]\n\n\nDo these are hard to get out\n[laughter] you know my sleep\n[noise] Jack Black Kyle Guy rage cage tables welcome to both I what a joy to have you on the why don't you cut in my line out a clear and I knew that was coming I didn't get that clip blamed Kevin further than my brother he probably around their line of interest\nOf time I'm sure a cage that they had to make a couple of trims ... yeah he has the money or it seemed like it was a\nIf it was actually ... I Am impressed at the number of efforts that they left it\nKevin is this belief practically gleeful back there man that's what I Do\nUm the truth is I was hearing spaces that should be treated like a long section we can't take off the editor cap literally in the ... the bomber judge is dropping the bomb and ... and say well it's like why is it taking so soon as you realize there's a bomb just run\nYeah yeah that's true yeah um it it's not too late we can still make the ... that's the great thing about the D. I. production is that it's all a U.S so we can do whatever the hell we won't apparently ... ... ... ... ... ... was what you wanted\nTanks [laughter] sorry guys how much I don't know where they may need teachers I think I got forty or fifty bucks for you\nKnow admitted to I'm Glad it was over over twenty bucks I was going to be by far my body has changed and I said you're fast why you can find shapes her thank your Kyle is very kind of you so\nWhat was your relationship like Kyle I'm I'm looking at you because you were the grown up I was the grown up our relationship was uh it definitely was kind of a big bro I think at first I checked was just such a unusual interesting he didn't he just was it like you and I he had a very kind of\nI Would say kind of an alternate upbringing sort of more of an open which I think tended to a facility jacks creativity and but not like a like me not like a great student so to be so I think we bonded on\nOn the yeah the music and acting and creativity and all that sort of stuff and yeah it was a it was very satisfying\nIt's ... I'm Jesse ths aren't my gas or Jack Black and ... gas there the band tenacious D. I get the impression jak that you were genuinely disastrous student\nI was not good at the book learning [laughter] uh I had trouble in school I\nThink that I ... I'd never been checked for it but I'm probably dyslexic and other A. D. D. H. D. type of diagnosis would would probably fit me but um\nI I did I was very passionate and active in the theater community in theater classes I excelled and you know any of the\nSome of the more creative types of classes I I flew rushed to but the thing about me and cage early on I really did need um\nA a a a big brother I feel like I knew I needed that are mentor and uh also I needed a mentor I needed someone to teach me I needed him to teach me his waves are around the the er the guitar and the music and\nBut really just emotionally to there was a real emotional you know you didn't have all that but there was along with that lead\nFive years to learn more at Annenberg Foundation dot org passes NPR\nWelcome back ... I'm Jesse for my guests are Jack Black and ... of the band tenacious D. their back I've got a brand new animated series called post apocalyptic do the first episode just premiered on YouTube\nI had a friend in college who er was a pretty standard nerd wonderful guy and one year I'm going to say was my sophomore year his junior year\nHe just appeared with this album that he had written and recorded in his dorm room nobody knew nobody knew I mean I knew he had a guitar you know that's what I knew I knew he had a guitar and\nIt was quite good and he had just one day decided essentially to be shameless huh you know like that there is this I ... ... it's very much much easier to not\nMake a record a heartfelt record yeah in your dorm room and and then share it with people who share like recruit a band and play shows yeah I remember just being offered by that\nAnd I'm I'm kind of odd but I mean the other guy that's that's a lot to do from zero from scratch I mean when I think about my favorite songwriters I Do think of the the raw in motive honest people like you know your Eliot Smith ...\nYou're you're a Nick drinks these are the the the songwriters that that really pull\nAt my soul at my heart's drive I think once in awhile I mean like the ballad of all evil might be funny but I think we do kind of go deep we'd go real we go back we go down to the source of who we are but yeah there's always a way of uh\nOf of comedy wink it makes it just okay now we need it we can't\nLet it go yeah I Am I've made peace with that I\nI don't mind at all I Love that on the road we've chosen [laughter] fund or if\nIn fact even in my side projects they all they end up being kind of funny ... it's just seems like why well because there's also a great tradition of of rockers that have a good sense of humor like you know diamond Dave yeah dude just funny that you do songs about AC DC ... yeah\nWell I mean one of the things that tenacious fees music is kind of\nIn dialogue with is the ridiculous mass of big rock music in\nOne of the things that is great about tenacious D. is that it is you've never been mockery of\nThe ridiculous ness of rock of big rock music but celebration of the ridiculous nicer big rock music\nI think you've I think you've you've stumbled on a very important concept yeah I think you can't really not like your subject well yeah then it becomes something else yeah I mean you really are I don't know that that when it becomes\nParity there you go to but ah yeah we celebrate we do make fun of of Satan though today and music is just absurd ridiculous and malaria and we've had a lot of fun with that over the years yeah but um\nBut there is also something great about sanctions [laughter] have powerful\nJak we were talking about your aspirations to performance when you were a kid\nAnd I do have a clip of you in a TV commercial I didn't want to hear what it is this is a commercial for pitfalls are even when I said my I've read that such a hairy yeah starring Jack Black was it was before we ever met cage [laughter]\nMini ten minute Web episodes where you don't you think we started at ten but then yet but we ended up at six but once we finish with like this is like a movie this plays isn't moving we when we played it\nFor friends and family at cows birthday and uh let me tell you I Know their friends and family\nWe we get a nice\nA response and um it felt like a some of our best [noise]\nIt did feel very pure though there was no notes network now it was just ah the three of those old room like this when you say the three of us human\nMe you and John Spiker John Spiker our producer extraordinary to try that you guys are ... you don't forget about tenacious to God you know for his [noise]\nBut you know we were going to do a different album we had a plan to do a different concept album but we looked at each other when it was time to get down to business like this is not the album for our time we actually have to do the post apocalyptic\nConcept rock opera because of these these times demand it and and that's where we didn't\n... I think that means we're I'm\n... Jack Black to measure the bank you so much for being on balls I Would enjoy going to have you on this young Larry Summers are having retirement [noise]\n\nToday ... folks post apocalypse do the animated series is available to stream now on YouTube and the soundtrack dropped early next month they're also kicking off a huge too are all over North America will have links to dates on the page at maximum fun dot org [noise]\n\nMore bull's eye after a break still the comp jazz singer Jose James tells us about the song that changed his life it's ... for maximum fund dot org and NPR\nHere listening to members supported Ninety ... deli you ab Atlanta's choice for NPR good afternoon I'm Martha Dalton\nSupport for WABC comes from Atlanta history center presenting the CIA BC private wealth management author series author David blight discussed as his book Frederick Douglass profit of freedom on October eleventh at ... pm tickets available at Atlanta history center dot com human beings I made up of just four\nLetters a G G T the same for letters that every species on the planet has billions of letters of code if you had every page filled with ease g's and T's you'd have eight hundred dictionaries worth of genetic code\nAnd that code decides who we are [noise] guy rise that story next time on the Ted radio hour from NPR Saturday afternoon at one Ninety point one W. A. B. E.\n[noise]\nHi I'm Daniel by ... operations associate at maximum ... support for NPR comes from NPR member station than\nThe Gruber family time dish supporting NPR's international coverage covering the trends moments people and listening to drive the world\nAlways with the goal of creating a more informed public\nOne challenge and invigorated by events ideas and culture\nThe general Family Foundation supporting the national Center for learning disability which works to improve the lives of the one in five individuals with learning and attention and\nLearn more at M. C. L. D. dot org [noise]\nThis is NPR\nYou're listening to both black I'm Jesse part\nTime now for our segment the song that changed my life this time Jose Jay Z Jose is a singer from Minneapolis and while he works a lot in jazz collaborating with folks like Chico Hamilton Chris Bowers just to name a couple he's also kind of a genre polygraph\nHis effort to go beyond jazz hip hop electronic music and now so [noise]\nMe [noise]\nOh You're welcome to do [noise]\nFor his latest album James is taking on one of the grain bill with James ... new album lean on may features twelve rendition of his favorite bill weather's tracks the one you're listening to right now is used me he recorded it right here in Los Angeles where we make this show Capitol Records famous studio ...\nBut not before getting bill withers blessing of course you got that from a legend over dinner and so when we asked\nHim to talk about the song that changed his life you'd think he might go with a bellwether song right but instead he picked love and happiness\nA classic from another all time great soul singer outbreak okay let's go to say\nMy introduction to Al Green I'm anybody major probably laugh at this was actually watching pulp fiction\nEverybody knows the scene you know\nYou know the gangster wrestlers while this is being introduced and you know they're playing this this cool Seventy soul music\nRight now [noise] you got to build a\nPainful as it may be\nDays just above\nJazz is going to get through a list of ...\nAny any acquaintance is such a genius for using music and he's in crazy ways you know\n... me this whole tradition of how soul music is you are in these gangster movie and the black gangster movie and it was so cool you know an intermediate Lee made me want to learn who would that singer what was the sound in what was this way behind the scenes\nThis business is filled to the brim\nWhat they asked what age like who wants to [noise]\nHave you made it gets better when they\nHad to go by the soundtrack to pulp fiction and I went to the electric fetus which was princes favorite record store in Minneapolis that's where I pretty much you know build my entire collection from jazz have bought\nIt was and remains to this day it just an amazing\nRecord set up in the last of the CD how\nOpen it up and that's how I was let stay together by Al Green and said okay who's Al Green you know and then\nAnd then this one track eleven happiness just completely you know grab me and it took me you know another direction no [noise]\nNothing happened were coming from a jazz background I'm I'm always looking for something a little bit more sophisticated and loving happiness starts out of time about it\nAnd it's just teaches singing loving happy in the know\nAnd then that foot stop comes in you know on a box\nThat that that he didn't do\nIt and it was like oh\nOkay I was just a jazz standard which are very clever and you know as a verb bows and [noise] you know this is a quite different you know just standing at the same loving happiness okay\nAnd you're like wait a minute something's going around to oh\nBump and we'll go and do some more there's nothing wrong\nWith the drama you know some was on the phone\nAt three o'clock in the morning and like that kind of rhyme come from a hip hop I loved that immediately you know can you help us all along ... someone on the phone\nTalking about she can make it like that such an intriguing line that I was already hooked 'cause I'm a I'm a lyricist in where it's meant to\nBe in love\nWith my mom gave me one day you know\nThere hasn't been\nThat point I was a really a jazz do jazz Bob but anyway you know that much about so an orange I didn't understand it\nOur brain actually started as a jazz singer and I found out you know a on where Marvin Gaye winter's flu well all these guys started just had a certain kind of jazz information and your hair\nOut in the very beginning go up and hold that no no", "show_name": "Bullseye", "year": "2018", "city": "Atlanta", "day": "06"}