{"month": "10", "state": "TX", "station": "KTSA", "content": "Don't push yourself into a faster than your body is ready for exercising profit they make you more and more relaxed and generally healthier Canada's nice or abused can be just the opposite so be careful\nA message from the will Rogers is the troops go where you are Institute dot org\nAnd still make fun of the kids in my eighth grade class can alcohol regularly\nOver Ninety nine percent of my class has been offered illegal drugs half of my college classmates binge drink abused drugs or do both but the frequent dinners I had with my family have helped to make sure I'm not want to\nLearn more about the national center on addiction and substance abuse at Columbia University's family day at a family day dot org dinner makes a difference Katie essay posh\nAsking where you are white is a boy this isn't about right or left is just like All right [noise]\nI'm all for it\n[noise] so Oxford Oxford Dictionary famous super uh they have\nThe ten most miss ... were some of these\nYou never can is accommodate most people spell it a C C O M O\nDa TE is actually a C C\nO M M they missed the second him this one I found to be like really which\n'cause remember like we're we're weird weird language we have like which way did he go or she's a which oh man right we have meet meet like those are so but the way that they said that it's it's it's misspelled\nIs W. I. C. H. [laughter]\nWhich I found to be weird ah which you know that's not true W. H. I. C. H. receive\nIs one receive is one R. E. C. I. E. V. E. is the way the law to people's spell it when really it is our E. C. E. I. V.\nUntil usually everybody gives an extra out its wrote an extra mile and a lot of times what it is is people get kind of ... you know like for me it's like you'll miss a letter it's a double are it's a double whatever it is a Kurd\n\nIs one of those things where O. C. C. U. R. E. D. is a lot of people spell it would actually there's two hours in their\nSeparate these one where\nIt's it's an instead of sep IEDs sep hey\nThat's the one that people miss this one right here is one I see a ton of people mess and I've been guilty of before it's government it's actually government so instead of G. O. V. E. R. M. E. N. T. which is yeah OK governments because you're you're missing the end is actually G. O. V. E. R. N.\nM. E. E. N. T.\nDefinitely I get that one I see that one miss a lot pharaoh\nPharaoh people spell it and this is number two S. A. M. E. P. H. A. R. O. H. when actually it is P. H. A. R. A. O. H. but the number one misspelled\nWord publicly publicly\nMost people spell it be you B. L. I. C. A. L. L. Y. and it's actually P. B.\nI. L. I. C. L. Y. publicly man I'm awful it spelling I Am that's what spell checks for\nAnd here's the other thing is sucking British ran the about this too like when you ... ... people they're they're they're so sometimes when you're using a voice the\nTax because you've got to you know do something and it's so they'll put whatever there is it seems to be okay like there that's not how I met there and the people are gearing idiot it's like I'm doing voice the tax under twelve different things\nOh that's frustrating three two three five three twenty four twenty three ...\nBenson shows your Twitter you can tweet us love hearing from your follows lacrosse all the mediums and we've got out there and got the Instagram\nWe got shepherd says your TV on YouTube that Facebook ah we've got Twitter uh feel free to follow along with us and always engage in the show I like a good conversation All right here's your useless facts of the day it is Halloween time one of the famous Halloween things to do especially for kids is watching the great pumpkin Charlie Brown\nDidn't you know the Charles Schulz was indeed\nBeen overwhelmed with candy shipments after it came out because Charlie Brown ... rocks instead of candy and treats in his bag\nSo people sent them candy odd right it's crazy out there it is they could be nicer to one another day I think we should have you absolutely should friday's here tomorrow that's a beautiful thing as well actually I've been to chose your Twitter C. H. A. V. E. N. S.\nO. N. might not jak [noise]\n\nThis is the sound that show [noise]\nI trade where do you need to sell your home are you looking forward to selling your home well it can be a hassle rife unless you sell to purge dot com\nV. E. R. C. H. ... dot com you simply fill out a little form hit you back with an offer for your home that's right to sell to purge dot com bust will make an offer on your home it's a real market offer to by the way it's not some low bug thing to real market off or if you accept the offer they will buy your home\nNo more hassle trying to fix up your home show your home get\nOut of your home pay a real estate agents know you simply sell to purge dot com it's the hassle free way of selling your home so have you been thinking about downsizing of seizing or your company has told you you got to relocate to sell to ... dot com dude is so easy now\nTo sell your home did the all new way of selling homes and it sells to purge dot com that sells a purge dot com no need to put up with the hassle of selling your home anymore sell to purge dot com\nEven if you haven't made that decision but you're thinking about it sells ... dot com [noise]\nDo you do yoga and morals on local regional national world by bringing use average here\nFrom a B C\nI taught at a fingerprint on an envelope mailed to Congress one Maxine Waters is what led the FBI to fifty six year old Caesar say arc of average or Florida arrested friday for allegedly mailing pipe bombs to several key Democrats and public figures this week\nSay I may have been arrested here outside an auto zone in South Florida but he will stand trial twelve hundred miles away in New York the case will be handled by U.S attorneys in the southern district of New York three of the fourteen devices were found in Manhattan\nBut before say our heads north he will make his first court appearance here in federal court in Miami that will take place on Monday afternoon Margaret Miller to ABC News plantation Florida Deborah\nAgain manages a restaurant where I say I used to work she says he shamelessly bigoted\nDay black Hispanic [noise]\nUm who I\nHaven't caught in a way to find the whole ... Adolf Hitler\nSay our faces five federal charges speaking at a security conference in Bahrain today secretary of defense James Mattis said the United states is willing to live some sanctions on Iran if it shows is meeting conditions of abandoning its nuclear weapons program\nWe do not believe the Iranian regime speech for the Iranian people we know there are people all of us in this room know there are people in Iran who want peace who want prosperity who want trade\nMadison accused around the government of sponsoring terror and ignoring the will of its people or\nGame three turned out to be one for the history books in the world series that seemed to go on into the night we're going\nAt Dodger Stadium where you\nWe'll go to the seventeenth adding at Dodger Stadium\nGames set a record for the longest in World Series history in time and ending seven hours and twenty minutes max ... walk up and the Eighteenth gave the Dodgers are free to to win in Los Angeles red socks to leave the series two games to one this is ABC News\nHave you ever thought about saying goodbye to your job just walking into your Boston saying I quit and how would you like to commute to work without ever leaving your home\nWill not long ago a thirty nine year old entrepreneur from a billionaire family spent twenty million dollars in three years to find the best home based business in North America he researched Seventy different companies and when he found the only one that had a real long term potential he bought it\nAnd right now he's looking for people to help him turn this company into his next billion dollar success story\nSo if you're serious about making money from home without having to leave your home will grab a pen because I'm about to give you the address of a website where you can learn all about this unique in rare opportunity\nWrite this down W. W. W. dot go here next dot com now get on your computer and go to this site now part time or fulltime your income is based totally on your performance interested\nGo here next dot com and say goodbye to your boss tomorrow go here next dot com\nIf you're going on I ... west ... then you then you then you had a toward a a long ... yeah and I'm used to walk across Colorado and make a little curve and you pass the stopping Rob on your left in the next part of the market is return left to go down to ... ...\nIs there a place to get more direct specific directions on his or an address uh probably but we don't have an address on the release you know oh no okay All right but it's coming up the Nineteen through the twenty twenty first yeah yeah All right up you got something for the record books the international game fish association has approved ...\nIt's five pounds seven ounce black proper use the new all tackle world\nRecord versions historic catches the heaviest ... ever recorded by the ... and replaces the previous record for black property that stood since two thousand six first thing called the record copy on may Fifteen twenty Eighteen while fishing and ritual sons pond in his hometown of Philadelphia, Tennessee\nAfter hugging the fish Ferguson skillfully play the copy on six pound tests line for probably five minutes\nAfter it hit the ... and ... combo that he was casting okay that's pretty neat yeah I'm instant background checks we continue to provide that information each month as the data is released and the numbers continued to decrease the September twenty Eighteen numbers\nHave been released and show a decrease of nine point seven percent I'm at nine hundred Nineteen thousand nine Seventy nine compared to September twenty Seventeen when the and I see us figure was one million Nineteen thousand thirty seven day ah the Blanco river\nNow let's talk a little bit about whether because I'm a goodness gracious west Texas [laughter]\nUh I kept to your ear and Stevie red rave on you know is flooding down in Texas you know it wasn't a is right uh with the heavy rains I'm but I'm Leno river lots of um flooding took place there in ... county um high water rescues\nWere done around ... and a gun information around lake Stamford or just north of ...\nThat that was well above conservation pool and we all should up our heads and say a little thanks\nFor the cool front that has moved through that are pushed\nHurricane Michael to the east unfortunate for those folks in the Florida Panhandle huh [noise] um but my goodness um this was you know a\nAn organized disturb area south of the Yucatan right that they are going on twenty percent chance of developing once you get home you know and then split up quickly and came within two miles an hour of becoming a cap five ... right I'm just I'm absolutely absolutely amazing\nBy the way I'm going to my Google Map yes and make sure I got this right at Shaw has been rode a but it's actually a Eighteen Ninety I knew he was on the date because they haven't found an error smoke rise a it's a it's a it's a farmer's market wrote Eighteen Ninety just hanging left and go right to the big\nPart you see our research department never ... isn't that great at a moment's notice right on top of the\nUh but I'm back to the Blanco river that and it has been named uh one of the twenty waters to watch for the national fish habitat partnership basically what this is doing is um after the historic flood of twenty Fifteen\nThe Blanco river bank experience heavy erosion which impacts water quality a quantity and or course favors exotic species the invasion\nBut um you know state is working with landowners and other stakeholders to assure the restoration of that ride period because that is just beautiful area oh it is gorgeous after like All right we've got a big show headed your way we mentioned to you got a couple of ... district leaders\nThat will be providing their hunting forecast so we're going to take a break\nWhen we come back we've got our best bets outdoor report we're going to find out of ... Potter author of right after this [noise]\nThis is Harold reminding you that it's time to get those fields and food lots planet and the products you need come from plot spike seed I pass by getting my place and the deer let it\nNow's the time to plant pots my poor jokes especially blended for forage results produce an extremely high yield any long growing season last by four jokes can be planted in September for great grazing early in the season is this are more coal tolerant than other varieties they usually last through the entire hunting season\nUniversity test show plus my words outs are capable of producing over ten thousand pounds of nutritious porridge per acre and that's how a lot of deer ... out plus my porridge oats and there are other wildlife management products are available at feeding sporting goods stores and at tractor supply\nYou can learn about their phone line of a year round products and order online at ... dot com your premium proven plot spy\nFriends you can listen to taxes outdoor worldwide on your smart for the fitter I listen to your shows\nKendall he may\nFor less than a tide anywhere ... dot com\nAmerica's Best selling truck forty one years running as Ford these people worked very hard every day to do the best truck struck she need trucks with best in class payload into going but you're not going to see um celebrate these forty one years a lot of fireworks and party hats\nBecause it's not about them is a bout you it's about building the trucks you depend on to get the job done that's how they built them yesterday that's how they will build them today and most importantly that is how they will build them tomorrow America's Best selling trucks were forty one years boards F series bill for tough me best in Texas\n[noise] it is time for the best bets on sex is outdoor\nHeroine will be looking at [noise] that we're looking at the mess mess ville [noise]\nYes and it says it says that goes out or a journal fishing and hunting times\nThis weekend as well as mundane a or a trio of poor gays absorbed by Tuesday and Wednesday arranges fair then things improve on Thursday and friday but both carrying a good rating next Saturday and Sunday our our two best days of the week\nThis week and look for game to be most active from mid to late afternoon until well into the evening hours after sunset\nOn Monday Tuesday and Wednesday a major time shift ... major feeding period of the day on these three days looked for game to be most active from well before sunrise\nEugene defeat until mid to late morning by Thursday and friday times we'll have continued to adjust so look for game to begin feeding either side of sunrise and continue to be active until either side of the noon hour\nThis weekend this most active periods begins from early to mid morning and continues until early afternoon on Tuesday act over the next to the moon will enter its first quarter face on the coast this weekend Saturday has a double tight schedule of too high to low tides this Sunday has a single tied schedule at one high end one low\nMonday has a single low tide as the only tired of the day Tuesday through Thursday there will be single tight schedule each day then friday through next Sunday there will be a double tied schedule each day\nI continue on the coast um hurricane Michael certainly had a bit of an impact that the entire Gulf Coast including the all the way down to south Texas where I'm a high tides were experienced\nDue to that a massive storm but things have subsided and this is um I guess the\nThe storm where we see the receding ties that will carry water redfish um had not exited the bays on out and they'll continue to hang around\nAround the Jedi use of passes and along the beach front um but ah speaking of red fish red sheen has been very good in the bays\nBig lake has seen a good activity the front that we've just had to end the front that is coming in later this weekend\nWill be a bit stronger carrion stronger wins and we will see increased bird activity as water is blown out of the back lake and marsh areas on\n'em and that they will be deposited in to the base systems look for um bird activity on average shoe Sabine\nA Galveston Bay certain amount of yet he's Galveston Bay west Galveston Bay\nUm greens greens I'm chocolate has been very a very productive throughout the past few weeks and months\nAre hitting on down each matter Gore debate continues to be a productive spot don't forget about the marshes around Freeport or good trout and redfish action continues flounder activity is beginning to pick up with them fish starting to stage 'em all up and down the Texas coast\nOr west medical journal bay red fish in behind ... peninsula as well as mad at ... island\nI'm On in behind saint Joe island\nA trout activity around the mouths of the drains is pretty static a pattern this time of year the reefs of cocoa and into St Charles bay are starting to show signs of some quality fish showing up a then you've got either side of the JFK causeway where the grass beds continue to hold trout\nWith the exception of ... thirty which seemed to catch every ranks our also also they're less and less up in the northern part of the district you know and then when you go south of I thirty area more you know Sally Sally Ride Tony all away to College Station and this cat ends up\nYou know one of the clouds dots of what it got an Iraqi and we're still much of the district you know several inches behind a ... petition but ah but or their side of the coin or their side of the fence and other people that are head of the average too so\nIt's got to kind of depends on where you're at\n[noise] you know overall ... what do you look at your their population in your in your district\nOh you know continue to increase based on you know our survey information not dramatic increases but just over the past many years and this is a steady\nIncrease in in their numbers you know are in spite of also increasing pressure so uh um that in itself to me would be an indication that the overall the deer hurts pretty healthy\nLooking at a recent weather events as we started in the fall and then of course we've got\nA supposedly for cancer more whether I'm full range um would you say that we're looking at a good match crop are we looking at ... brown email oh what kinda what kinda foragers natural forge is on the ground for here\nSo my predicts and on you know the the corn crop you know is is\nGood and the two very good you know again depending on you know where you're at what those Thomas showers and stuff that I'll walk under some host oaks that you know that have very few corners and then you'll go to some red or white oak trees and they're just you know loaded so uh you know\nBut I think makes me laugh sometimes it hunter's kind of get disappointed when a corn crops good because you know the corn feeders not as good or dependable so [noise]\nUh these we've had some really time the rains here lately so for production a nice little green up there's going to be good as we're here in the early parts of the archery season and em out these days and so uh I I think were set up pretty good living in an old or habitat conditions what to do\nWhen that happened to John I think it's time for you to get up on your legs like a man again at the end again among some uh in you know do a little Doolittle still hunting uh with that mass crop though are now what's the status of one of my favorite big game animals squirrels\n[laughter] squirrels and the big game animals might have missed [laughter] well yeah I mean small rival make some bigger you know you go yeah\nSo a squirrel certainly a underutilized you know and many of our or especially a republic\nAreas here in in the district you know we get more squirrel hunting pressure from non residents but to\nTo they you know this morning when I got up you know is in the fifties and and the guy should really consider going out and sitting in the woods do a little school so the apple opportunity we had you know good mass production the last couple of years so that equates to or city quite to more squirrels so the opportunity should be plentiful\nA you know I Know you are as a a long time waterfowl hunter and we were when we put the report together for the October issue of Texas outdoors journal\n... we're down um but um that was voting well for what a production of of CD type I'm a grant says or or not go ... ... and stuff like that do our thing shaggy shaping up now we're catching me one or two um floods back areas\nThat you know some of my local lake or I Do most of my copy fish and stuff is still a couple of feet low not necessarily a great waterfowl like but uh as you go up all night and a quarter or again you know the the those lakes have filled up or have put some water and those Warsaw plants\nThe last part of the early ... season\nOr the guy's a visit with were reporting a very nice numbers the ducks and an excellent habitat condition\nMany of the stock tanks which are certainly sleepers in the dark world across Texas 'cause most people don't pay that much attention to that or you know surveys and everything in case you know significant waterfowl used across the state owned stock on them so they shouldn't be and and much better condition than they have been and are so [noise]\nYou know we get some you know miserable weather for our friends up north we ought to have you know a nice\nOf you know John looking at a program has been going on for a guy I guess decades or in your area or the or the turkey restocking what are we looking at it as far as our Turkey's now\nWell it's getting a little better\nThey know it was we weren't you know having real obvious success or they two years ago [noise] burglary move this year both some real brands and some eastern ... uh\nYou know we don't expect much from those first your stock in it but we got documented production and same birds and getting more trick report so I Am cautiously optimistic that I'm not going to stay where you know turn the corner but ah we're gaining momentum and uh\nAs far as just general hunting success for the spring season you know it was it was slightly better than the last couple of years average but a little bit lower than the long term average you know the guys\nYou know still only shooting you know a few hundred eastern Turkey's a year or in this part of the state but ah\nAs far as our restoration efforts are like I said I'm very cautiously optimistic and we had some really good success last year with birds so\nOn some of the wildlife management go off to join or working in managing specifically for ground nesting birds for turkey um what I have learned is that benefits all while alive but it takes you a pretty good chunk of ground neighbors really need to talk to each other through minimum acreage is what ten thousand\nYeah what we do a an eastern talking eastern turkey stalking you know restoration effort yeah we we want to put together ten thousand acres so that takes in this part of the world you know some good neighbors or some cooperation over you know a larger landscape but ah [noise]\nWe continue to get interest from a land owners are hotter than and we've got a couple of ... a locations under evaluation right now on and\nAnd really the only thing that's holding us back at this point is is getting a more Eastern Birds from you know are cooperating neighbor states you know people that have nuisance birds are made and there's a threat or what the baby trade or something but uh\nSo the interest is is high you know especially in that this may just river record or and that's most recently where we're having our best success with a documented a production and birds moving around and of course\nDoing all that fun stuff to the mall just like to do put and transmit or from satellite GPS system\nWhere you know we can kind of think we can kind of keep track of them and and you know I make five or sometimes they were not as smart as a turkey because we we evaluate habitat and\nAll this stuff from some times of Turkey's want to go someplace else so [noise] so we're learning as we go all and and like I said our successors improving and so we're looking forward to invite her future with turkeys in east Texas so\nOutstanding land so we're going to look at any big left a couple okay how are they are very good John we appreciate the update our first yesterday John ... the Texas martial law district leader out of Tyler John appreciate you joining us today\nAre you guys had a great weekend\nWe'll be right back right after this\nYou're listening to the state's most honored outdoor radio show Texas outdoor news\nFather has been we have or be a four girls and they are the joy of our lungs my wife and I had a dream and plans and a lot of life where we could go to the lake and raise our kids and so we weren't with capital from credit together and we were able to make our dreams really capital\nFarm credit came along the side and may happen\nTo gather we're better find out why capital foreign printed on equal housing winter in about ... when I bring into it\nWe'll punish reviewing box deal for and\nWhat not real for road [noise]\nWe've just driving in a family thing even remotely flash real more used to be on\nThe rocks or from a legendary fall from\nMore than seven years of hard core Harry ... new no mercy rocks or from your mind to feel or rocks or off\nThe place to stock up on ammunition is Carter's country for practice self defense or hunting Carter says everything you need from federal and state cartridge federal is American Eagle practice am always priced right with nine millimeter and just for Ninety seven a box and forty five I'm only Twenty one Ninety seven\nSuperior performance of hydro shock pistol ammo can be yours and nine millimeter for twenty three Ninety seven\nThirty eight special for twenty two Ninety seven\nForty Smith in western and forty five auto was only twenty four Ninety seven for the burn hotter federal stock gunshots shells in twelve until engaged or just six eighty seven for twenty five round box and the state had any game shots shells and twelve and twenty gauge are just six forty seven a box\nFor practice or plenty of hunting it's hard to beat the economically price to state game and target ... shells and twelve or twenty gauge for only five Ninety seven a box suck up right now all four corners country locations Carter's country where you are a great outdoors begin as\nWe continue our Walsh across Texas is removed from Tyler, Texas to le Grange that's home where David forged ... Texas parks and while district leader David welcome back to Texas outdoor news how you doing sir\nOr doing get Nike\nHey listen you know when we do our annual ... for the report that appears in Texas outdoors journals October issue you were reminded me that your district has seen a whole bunch of water a either in the spring as well as a and other times this year we got a little drive but", "show_name": "Jim Love", "year": "2018", "city": "San Antonio", "day": "27"}