{"month": "10", "state": "FL", "station": "WMFE", "content": "\nHe says the b._b._c. World Service when I see me after the crash continues\nTo bring in Russia's fast food can be I think it is I probably ten years on for\nDays and they can begin to decline the international relations\nIndications go far beyond find how long do they crash at the the the worst service dogs come\nYou are listening to the b._b._c. World Service\nIn Washington for an\nHour South America correspondent Katie Wilson reports from Brazil won on your resume I just had my son does is here in the studio or America's editor kind of began by telling me about\nTheir own mind on march so smart speaker to BBC World service the world's me do you see him [noise]\nSupport for Ninety points at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nBack some vital ally suspected of ordering the murder of a un ratcheting on MORNING EDITION from NPR News\nI'm In a way to clog the boy when you when you're younger land over and over and they don't [noise]\nCompared to Saudi crown prince to Supreme Court justice Brett Kavanaugh's time to well king\nAnd I'm Steve Inskeep complaints both men were found guilty until proven innocent Republicans toffee electioneering may not be quite that tough Latino voters are largely\nAlso this hour why some Asian Americans oppose\nOfficials track a mystery illness in childbirth It's Wednesday October Seventy the day a refugee arrived in the United states\nAlbert Einstein Germany Nineteen thirty three years in a\nLine from NPR News in Washington I'm core of the Coleman cleanup continues along the Florida Panhandle and in parts of Alabama and Georgia from hurricane Michael at least twenty six people are known dead from the storm sixteen people in Florida and the others in Georgia North Carolina and Virginia what's unknown is how many people are missing\nSecretary of state Mike Pompeo says the Saudis have committed to investigate the disappearance of the Saudi journalist but so far he won't say whether he believes the Saudis killed the man in their consulate in Istanbul as NPR's Michele Kelemen reports\nHeavy boarded the plane from Riyadh hunker secretary than pay a with describing his visit to Saudi Arabia as a success the Saudi king crown prince and foreign minister he says I'll understand they need to quickly investigate the disappearance of your mouth ...\nThey want to have the opportunity to complete the investigation or a wife and I got I think that's I think that's I think that's a a reasonable thing to do to give them that opportunity and then we'll all get to judge will all get to evaluate the work that they do\nShow was last seen entering the Saudi consulate in its handle October second where Turkish authorities say he was killed that Saudis initially said he left the conflict but now appear to be changing that story Michele ... NPR News traveling with the secretary in ...\nTexas Republican Senator Ted Cruz and his Democratic challenger representative Beto O'Rourke held a second debate on Tuesday from member station K. E. R. A. Rachel Lindley reports they sparred over health care abortion and border security\nWith less than a week before early voting starts in Texas crews work never missed a chance to pounce sometimes simultaneously\n... very nicely how old I get an\nExchange kept our question on border security\nCongressman O'Rourke not only opposes the wall but he is that we had too many fences walls already on the border he wants to tear down the ones we have\nThe El Paso Democrat said the U.S should focus on ... century\nI have a better idea of who and what comes into our country demonstrably makes us safer\nSen Cruz came into the debate just hours after a new CNN poll showed him leading his challenger by seven points for NPR News I'm Rachel Lindley in San Antonio it is now legal\nTo buy recreational marijuana in Canada the new Canadian law took effect today than carpet jak reports that Canada is the first ... seven nation to legalize recreational pot\nCelebrations in part parties when well into the night as many Canadians marked a day they believe would never come\nPrime minister Justin Trudeau is campaign promise to legalize recreational cannabis as now reality anyone Nineteen or older will be able to buy marijuana\nBut just days before legalization a new survey suggested nearly eighty percent of Canadians have no interest in smoking legal pot than carbon jak reporting from Toronto and this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and baking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\nGood morning six so for for Ninety point seven news I'm Shawn ... five four three we have ignition\n[noise] [noise] and lift off of a check for mission carried by United launch alliance apple is five rocket for the United states [noise]\nJust after midnight United launch alliance successfully launched and that was five caring that high took ... communication satellite\nFrom Cape Canaveral with clear skies and no technical issues you and I sent the Air Force's advanced extremely high frequency communications satellites into orbit it was the most powerful version of yet spied rocket with more than two million pounds of thrust at liftoff\nOf sixty nine billion dollar merger between CBS commitment has been approved by the department of justice Ninety point seven ... reporter Daniel prior says this will consolidate the number of prescription drug plans available to consumers in the short term\nWhen the deejay approved a merger between America's largest pharmacy in third largest health insurance company it required at night to sell off its Medicare part D drug plan\nSome experts are concerned that fewer Medicare part D providers will lead to a less competitive market but you only get keep an ski as Kaiser Family foundation says once the dust settles plans offered next year will actually give consumers more options\nThis administration has also taken steps to make the Medicare part D and Medicare Advantage marketplaces more competitive kind of have on the one hand there are mergers happening and on the other hand there are new players coming into these marketplaces\nHas the merger between two companies that are competitors it's hard to tell what the effect will be on drug prices CBS the c._e._o. Larry Jay Marlowe says it will make it easier for patients to access more diagnostic and preventative care services at the pharmacies Danielle ... Ninety points out the news\nThis is not only did you hear about the recent boom in paleontologist inspired by a famous film\nThe drastic generation is one hundred percent of thing\nOr what about the couple that proposed to each other simultaneously\nI'm Ari Shapiro the world is full of all kinds of news and when you support NPR you help us report the good the bad the strange and the joyful\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot O. R. G. once again that's one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG\nGoing to take a look at the traffic sponsored by ... Subaru we have an incident on Fort eastbound near for thirty six are all lanes or block traffic's getting by on the left shoulder so you why more in ... so it is jam from England for thirty six once again it's east for ... uh I for east bound\nAnd west bound no delays but we do have one roadway accident Texas avenue with Americana lane blockage orange was a trilogy rolled sunny today hide your Ninety free tonight clear low Seventy five better chance of rain friday Thursday and friday and including drier by the weekend right now it's Seventy five degrees\nAnd It's Wednesday morning I'm Schoenberg six or seven oh good\nSupport for Ninety points at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nYour abs Pompeo was sent by the Trump Administration to try and find out what happened to Saudi journalist Jamal ... the writer disappeared after entering Saudi Arabia's consulate in Istanbul\n... been critical of the Saudi Government and many people believe he was killed by Saudi agents but the Saudis so far or denying any knowledge and President Trump so far seems to be taking them at their word\nNPR's Peter Kenyon is with us now from assemble Hi Peter I know so secretary of state Pompeo was on something a fact finding mission here out what did he learn or not learn in these meetings in Riyadh and in Turkey\nWell if you learn anything new from the Saudis there's been no public discussion of that so far as he did say Riyadh is committed to a full transparent investigation of the Saudis as you note deny any involvement in ... disappearance a there are stated position is still that he left the consulate freely within an hour of arriving and they don't know where he is\nA there are however these multiple media accounts reporting the Saudis were preparing to acknowledge it showed you died in the consulate during questioning\nNow turkey ... certainly got a very different story a Turkish investigators have said they have audio video evidence of the show just killing and dismembered mint add some more gruesome details are coming out today\n\nThis is NPR News\nSupport brandy point seven news comes from the use the F NBA UCF MBA offers for schedule options in three locations making it convenient for professionals who wish to pursue an accredited MBA while continuing their career path\nInformation about these yes MBA including schedule options admission requirements and deadlines is available at U. C. F. M. B. A. dot UCF dot edu\nGood morning six and I hope that the cup of coffee station 'cause they look to see how the traffic Lewis is looking\nThis broad view by Don nearly sports Subaru I Fort ... mirror for thirty six the Orleans or block traffic is getting by on the left shoulder only job you have a chance to be traveling there ... or why more road are much better alternative for thirty for Seventeen Ninety two are good because it is jammed okay that's as of right now\nI for ... for thirty six always are closed by four west bound no reported delays and obey the past told him avenue lame blockage their use Texans have an incident\nSupport for Ninety point seven news comes from certified financial group working as the new series for nearly forty years they're independent CFC professionals in providing central Florida families with retirement planning and wealth management for a fee so they are registered investment advisor\nLearn more financial group dot com certified financial group where they are planning tomorrow today\nHi I'm Audie Cornish NPR News W. N. F. E. needs your help your support and makes the work of W. M. F. E. possible consider getting what you can whether that's ten dollars or a hundred dollars make your gift of support at one eight hundred seven eight five twenty twenty or give at W. N. F. E. dot org and shanks\nDragging on the forecast got sunshine today Ninety three tonight's going to be clear tomorrow\nForty percent chance of showers bought some ... ... a little more rain as possible on friday while the Centers for Disease Control and prevention so he was confirmed sixty two cases of a new uh uh uh my lightest acute slice of my life as it is a rare condition caused weakness with ... sometimes paralysis\nStrange and unusual that's coming up to ... minutes right here\nNPR continues\nSupport for NPR comes from the station and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price investor confidence\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template dragging drop email editor and twenty four seven customer service more campaign monitored dot com\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser and Kathryn ... on a new episode every Friday on prime video\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King more than me is a charity that aims to educate and protect Liberian curls its founder is an American woman named Katie ...\nShe has thousands of social media followers they're mile or tell stories about life in West point which is a slum in Liberia's capital\nStories like the one about a girl named Abigail here's my lawyer\nA little girl in Liberia who doesn't have a mom or dad I'll go on a street selling herself eleven years old because she didn't have a glass of clean water\nThere should be no girl on the streets when her biggest dream is to go to school\nBut according to a report just released by ProPublica and time magazine\nThe print for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nLee Young who wrote the story\nBefore we get into what went wrong with that charity more than me I Want to ask what was going right what's ... more than me apart from other charities at the beginning\nI think that more than me and particularly its founder Kim ... had an incredible ability to connect with those who could commit money or resources to their mission\nAnd I think that in a way this is a story about about social media on about how you present the story level really engage with hearts but will make people reach into their pockets and thinks that the individually by taking a small step or making a difference\nSo who is Katie might like why did she start this organization\n... a woman from New Jersey who had a long background in doing various forms of yeah community help and volunteer work who ended up in Liberia in two thousand and six on on evangelical internship\nAnd then from there she continued her relationship with the country and she started ... first registered in two thousand and eight\n[noise] she didn't have a lot of nonprofit management gets you\nKnow and ... has been very clear in our own promotion of the organization that what she brought to this wasn't incredible depths of love it's a love driven organization\nHer co founder a man who really helped her start this organization on the ground in Liberia was an army Macintosh Johnson tell us about him\nI never met Macintosh Johnson but he was someone who is fundamental and the starting up of this organization he was a he was a guy who had had a childhood interrupted by war who told you must be so he'd be a child soldier\nUm and then in in West point had also been part of the vigilante groups which is a group of you know community members who are in the absence of of police um you know help to provide those kind of that kind of support to the community so he was a well known guy in the area of West point where he operated he was well liked\nAnd he became very highly trusted really very very quickly\n[noise] can you explain exactly what he was stealing the systematic way that he was abusing girls\nJohnson was heavily involved in the recruitment of girls said he was the point person for the organization in West point it was viewed as his organization along with ... and he was using that power according to other girls told the court to abuse those who are within his his group of power\nAccording to what they told the court girls as young as ten years old I'm were exploited on numerous occasions and [noise]\nAnd when they talk to the court they all said that well he he threatened to remove me from the scholarship\nDid Katie ... the founder of the organization now what he did during [noise]\nWell that's something that we ask Katie and something that we've reported our responses in the piece one detail of this which also helped in power Johnson was the fact that my life had an intimate relationship with them but she conceded in an interview\nBut that same year and twenty eleven there was some form of conversation takes place which involves Johnson's ex wife who [noise]\nWho says that she said something along the lines of you know I told her that she loves the children but she didn't didn't really get it\nNow my lower recounts that conversation different that she'd heritage but she described I think there's rumors that Johnson had been in sexual relationships with young girls and but she said she fold up and she asked the girls themselves and they said that that he was a good man\nThere's a second level of tragedy to the story in that after Macintosh Johnson was arrested he stood trial it was a hung jury and after that it was revealed that she had HIV rain [noise]\nWhile it was it was known by people within the organization and there were rumors it was never formally revealed that he had aids when he died\nOn as a consequence you know potentially all of those who have contact with them which according to reports on to our reporting and also with the court documents and organizations internal documents was many many girls\nThat are potentially at risk now it's important to say that the ten girls who actually testified in the court those who actually are willing to bring a case they were retested and one of them tested positive\n[noise] it's so complicated right because as you outlined in the piece kick him either at one point to you in a bottle to whether or not her organization was responsible for this says\nYou know where are your schools were the schools that you have dealt in Liberia she clearly feels that even if for organization willfully or not turned a blind eye to this to be that it has been a net positive for the girls have Liberia\nYeah I think that you can see in in a lot of the responses we had and the Chinese leadership that there was this sense of why are you telling the story you know look at these other girls that we've educated\nBut I think that to to view this as you know just a an unavoidable thing that happened in the early points of the organization it just that's not a logic that we'd applied to to sexual abuse with an institution in any other context\nAnd Liberia still allows the organization to operate schools\nWell the story is really hard in Liberia because of course a lot of people are involved in the building up as an organization like the sea of local government to ... mile or had strong support from first of all from the president Ellen Johnson Sirleaf\nAnd then also the local local donor community I think I'm a local community had the sense of\nA lot of people have a feeling that something had gone wrong in this and this organization but didn't know the ... so there's a whole lot of soul searching going on on the government has not just a a fool investigation involving seven different ministries they've said that they are looking into reopening the case [noise]\nUm and they're living as well as more technical stuff like well how do we heard was a process for credit things organizations have we hold them accountable they're looking into whether they charge you aids policy was was followed and the school\nThe condition is known as a cute blasted my light is or a FM for short it can start with symptoms such as the eye lands and difficulties following the CDC has confirmed sixty two cases and the last few months mostly in young children\nSince the CDC began tracking the disease four years ago and total of three hundred and eighty six cases have been confirmed\nOne case where the seven year old boy and his mother Susan coin says her son came down with an ear infection this was back in the fall of two thousand fourteen\nSo I took him to the pediatrician and she put him on a antibiotic\nBut within a few days Evan complained of severe pain in his back legs he became extremely lethargic and went downhill quickly\nHe loved children Michael control and both his arms and legs you know one minute you have the healthy head and the next minute your kid is totally paralyzed it it it would be on horrifying to us\nIt's not clear what caused the evidence sickness and the CDC is Nancy ... says unfortunately the cause of this condition is still unknown\nI'm frustrated that despite all of our effort we haven't been able to identify the cause of this mystery illness we don't know who may be at higher risk for developing and got them or the reasons why they may be at higher risk\nNetanyahu says given the rising cases the CDC is escalating its response and consulting with a variety of experts to solve the mystery\nThey do know that some kids who get it have also had viruses such as intro virus another possible risk factor is West Nile virus which so far there's no common pathogen that links all of the cases\nDespite extensive laboratory testing we have not determined what path to get it or immune response or the arm or leg weakness paralysis and most of these patients\nGiven that the symptoms are similar to polio disease that have been almost completely eradicate it and that's an ... pointed out that this does not polio\nRight now we know that polio virus is not the cause of these ads on cases CDC is tested every store ... and ... and patients none of them have tested positive for polio virus\nThe CDC says despite the increase in cases asked them is a very rare condition affecting fewer than one and a million children but she says it's good to be aware of the signs and symptoms that Ninety percent of those affected our children there are some cases in adults\nWe recommend taking medical care right away if you or your child develop sudden leak this the arms her legs\nAnd those are the CDC can't give any specific information about what's causing a I found nothing ... says it's good to take general precautions\nParents can help protect their children from serious diseases that following prevention steps like washing their hands thing up to date on recommended immunization and using in separate Ellen to prevent mosquito bite\nIn the case of season coin son Avon he's healthy again he was treated with steroids Andy was an occupational and physical therapy for Eighteen months\nEdited fully recovered he has regained all isn't it and I'll strength in foreign lands\nBut this is not always the case some kids who've been diagnosed with a FM continue to have paralysis and require ongoing care Allison Aubrey NPR News\nNew\n\n\nThis is NPR News\nSupport for Ninety point seven news comes from UC the reliable one oh you see has expanded community solar end it's dedicated to making it easier than ever for residential and commercial customers to reap the benefits of solar energy without installing their own panels\nMore information about signing up is that do you see dot com slash community solar\nGood morning terms to look at ... brought to you by Don really sports Hebrew I for you stumped still the accident near for thirty six traffic is just getting by on the left shoulder we have a a Seventeen minute delay there for ... for thirty six and also if you're twenty seven to for twenty nine that's about Fifteen minutes\nI for westbound ... Thirteen minutes from four thirty four to four thirty six everybody stuff and by\nTaking a look up there in in Orlando cellphone orange blossom trail past holding a Orleans are blocked\nUsed Texas by this is Steve Inskeep with MORNING EDITION from NPR News takes a lot of people to bring you MORNING EDITION everyday on W. M. F. E. listeners support makes it all possible and your gifted W. M. F. E. no help to be here for you everyday\nCalled eight hundred Seventy five twenty twenty and give us generously as your cat that\nYou're in the short for a nice day we'd get a high and you're not each region nice clear low Seventy five\nTomorrow maybe a little bit of transferring coming up in ten minutes of marketplace morning reports the number of people living in poverty is decreased according to the world bank but you do estimate comes with a couple of footnotes so you want to stick around with it and all the business news coming your way to minutes here on the other point seven WNYC\nI'm Robyn Young did you Robin get short shrift for his ballets because his choreography for shows like the canine story was so good\nYou know he really was a genius\nThat field it's just that because he was so good in that field is ballet\nThe wrong or and not enough attention\nNext time here now [noise]\n[noise]\nI'm Steve Inskeep you too can attend an Indian wedding\nTourists want this genuine the cultural experience can buy one we receive reports started a company called joined my wedding allows total strangers to do just that in India you're ready for a ticket if you're going to structures on how to dress and then he joined the\nParty some proceeds go to the bride and groom and do you play your part in an Indian wedding industry that is now worth billions and growing every year It's MORNING edition\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com [noise] from indeed\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician that committed the children's health by being health care partners dedicated to their wellbeing from birth to adulthood including us all important teenage years or Leno health has over twenty pediatric location to serve central Florida family more information including locations Arlene do health dot com slash kids\nAnd from listeners like you who donate to this NPR station and this is MORNING EDITION\nFrom NPR News I'm new well king and I'm Steve Inskeep we ride along the extra search and rescue teams after hurricane Michael NPR's hospital along traveled through Florida's Jackson County with a crew from FEMA a\nLarge paper map playing out the more than nine hundred square miles in Jackson County has spread across the folding table in a makeshift command\nCenter here because his mind will just start going left him off the springs with Israel with which I guess is\nA search and rescue team or Virginia task force one is about to start its fourth day here trying to drive down every single road in a remote part of Florida's panhandle trying to figure out what people here need emergency medical care health covering their roofs directions to the nearest donations [noise]\nWe're going to now are you today\nOn all of them are over before ... was the chief kid had sores behind the wheel leading a caravan of trucks pass the ball and power poles long leaf pine snapped in half and washed out cotton fields hurricane Michael left behind rescue specialist Adam sheets rise in the front seat\nThis is probably my third or fourth hurricane deployment is the worst ... how are you may have worked with Virginia task force wall with FEMA were just checking all people to see how everybody is the mayor of Frank\nHow the how was your pencil checks in with a couple of residents who are living with an elderly relatives however is still out for many here and generators roared behind almost every conversation [noise] most of the roads here thing for your foot stormed a breach still blocks some unpaved driveway Virginia task force one is the first outside help ... income through\nWouldn't eat a whole lot of work that plane up all they freeze it fell down and the top dissolve the houses are some of his float away that brought up very that's the last ... slowly\nJust turned eighty one he lives with his son Ricky who uses a wheelchair points out of church for us the way that lost his roof around the corner at toppled tree has left holding the trailer homes and now looks chewed through in the middle\nIf it's terrible that often but we all live and\nThat's a good sign up there just a short drive away a neat robot Delia stands in front of a house top with blue tarps and plastic sheeting for every Nelson has been staying here with her daughter\nIsraeli someplace you guys that will be ... from a very I think lots of water and it turned out at home but then I go there you know there's trees everywhere it gave me to my house but it's a lot was I get it and they're split ... ... you\nKnow some works the midnight shift at a nursing home Dutch city in water is still out at her own house but she says she's not sure how much longer she can stay with her daughter\nWould you favor [noise]\nShow through information\nFrom Bush wants to use ... church kicking\nPeriod okay thanks very much they got ready they they they got your\nCell phone service is still spotty and parts of Jackson County so rescue specialist like Adam sheets Devin stepping in as messengers reeling information about relief services in person and lending a friendly ear she says before the hurricane many living here we're already just getting by something like\nAnd I'm Tracey Samuelson went to the marketplace morning [noise]\nFrom APN American public media\nSupport for Ninety point seven news comes from the Florida department of state\nEncouraging Florida voters to the election ready by checking their voter registration status ensuring signatures are up to date reviewing sample ballots and knowing the election dates and voting options voting resources and information available at your vote Florida dot com get ready get set vote\nSupport for Ninety point seven news comes from Sheffield Lohmann trusted legal advisors to businesses in all areas of commercial litigation ... theories and beneficiaries in probate trust in guardianship litigation offices in Orlando to their Easter land in\nPort orange learn more at ... dot com Shaquille dumbing expect more from your last name\nOh good morning and coming up and local news well it woke me up last night about you and read the items large Kelly we may find up yesterday and this is your last day ... we may not be a millionaire will tell you why it's coming up a natural will be NPR's on the way Mel MORNING EDITION continues here on NPR them look\n\nThe pressures Saudi Arabia faces for the disappearance of a writer the kingdom has one prominent defenders\nThis is the voice of every little bell rings true [noise]\nSupport for Ninety point have the news comes from Orlando Health\nRelated health network a pediatrician they're committed to children tell by the health care partners dedicated to their well being from birth to adulthood including this all important teenage years later health has over twenty pediatric locations to serve central Florida family more information including locations Arlene do health dot com slash kids\nPeace prize she's only twenty five years old but she's on a mission to draw attention to atrocities committed against the federal deficit jumps in two thousand eight have lots of things are pointing in\nWashington will get it when they have to protect me are widely Johnny forty nine years old\nAnd the news is next\nMine from NPR News in Washington encore of a Coleman the death toll from hurricane Michael is rising nearly a week after the storm made landfall\nAt least twenty six people have been killed and Florida officials say of that number sixteen people perished in that state what's unclear is how many people are missing NPR's Debbie Elliott has more\nTwelve of the debts are reported in Bay county where hurricane Michael made landfall last week with a hundred and fifty five mile per hour when\nSearch and rescue efforts continue thousands of people are still unaccounted for their response has been hampered by heavily damaged infrastructure roads electricity and communication systems\nProlonged cell phone outages have made it difficult for friends and family to check on people who remained in the Florida Panhandle during the storm governor Rick Scott has been critical of telecommunication companies are not restoring service more quickly Debbie Elliott NPR News\nSecretary of state Mike Pompeo has arrived in Ankara for talks with Turkish leaders over the disappearance and suspected murder of Saudi Arabia and writer ... ... spent a day in Riyadh talking with the Saudi king and crown prince and says they've opened an investigation\nThey made no exceptions to they would hold accountable they live with just ... they were very clear they are they understand the importance of this issue\nThey're determined to get to the bottom of it and that they will conduct the report will all get a chance to see it\n... a critic of the Saudi Government vanished October second after entering the Saudi consulate in Istanbul, Turkey Turkish officials have said they believe he was killed inside adage Bonnie removed something the Saudis deny\nPresident Trump initially said there would be consequences if the Saudis were found to be responsible now he's comparing criticism of the Saudis to allegations of sexual assault against Supreme Court justice Brett Kavanaugh the Trump says is innocent\nThe U. S. is offering ten million dollars for information leading to the rest of the head of Mexico's most powerful drug cartel NPR's Carrie Kahn reports the Justice Department announced the reward as part of a crackdown on the ... new generation cartel\nAttorney general Jeff Sessions says the ... state based ... at least five tens of cocaine and five tens of math and to the U.S each month each one of the five most dangerous criminal groups in the world\nThey announced reward is dabble what the US offered last march to the rest of the cartels leader domestic policy get us advantage Mexico is also offering a reward of about one point six million dollars for the editor Rashed known by the nickname men show\nUs prosecutors also announced Fifteen indictments against members of the ... generation officials say the cartel has influence in Seventy five percent of Mexico and then several countries around the world Carrie Kahn NPR News Mexico City\nYou're listening to NPR\nSupport for NPR comes from NPR stations other contributors includes Subaru featuring the own new three row ascent with feeding for up to eight and the choice of second row captain's chairs love it's what makes a super super will learn more ... Subaru dot com\nGood morning at ... for for Ninety point seven I'm Schoenberg just after midnight five\nFour three we have ignition\n[noise] one [noise] and lift off of work very\nUnited launch alliance successfully launched the ad was fired rocket carrying the high tech communication satellite for the military from Cape Canaveral\nWith clear skies are no technical issues you LA severe forces advanced extremely high frequency communications satellites Warner's you'd watch the most powerful version of yet was five rocket with more than two million pounds for us at liftoff testing is under way after reports of possible red tide in India Atlantic in Melbourne beach\nNinety points Evans environmental reporter Amy Green find the results are expected today\nIf I could get fish and respiratory symptoms began over the weekend says Virginia Barker provide county natural resources department the\nLifeguards went to the area where the first reports came in and they said that they also experienced you know nasal issues\nAnd nearly year long red tide in southwest Florida has spread in recent months carried by the gulfstream around the peninsula Saturday most kids end up the Atlantic coast in our county to harmful algae the the rare any green Ninety points that any of these\nLottery officials called them dueling jackpots whatever term you prefer the combined mega million Powerball jackpot combined is over a billion dollars Tuesdays make a million bucks now up to six hundred sixty seven million the largest in the game's history the odds of winning\nAnd other you want to know one in over three hundred two million meanwhile the Powerball jackpot for Wednesday his role do an estimated ... ... three hundred and forty five million this is ...\nHi I'm off on all of our president and general manager of your station might be point seven W. M. F. E. and this is our silent drive a food two years since we first tried this less intrusive style will fund raising and this is how we do it now W. M. F. E. family your\nContribution to date helps pay for public radio news and programming without the pressure of commercial interests Ninety point seven double your him if he is powered by you\nShow your support for uninterrupted programming during the silent Dr visit W. M. F. U. dot org or coal wanting to hundred Seventy five twenty twenty thank you\nSupport for Ninety seven news comes from video providing assurance taxing advisory services to clients in central Florida in around the world more ... ... people who know no media\nAnd we're going to take a look at the forecast year and it looks like it's pretty good day to day without a lot of sunshine summer like heat again today highest climbing in the upper eighties low nineties\nSubtle patchy fog this morning but that's going to be burning off of it has an already in record highs for some neighborhoods they were going to change things up a bit a front going to come in on Thursday bringing us a slight shower and storm translating today I buy my Ninety and friday the moisture increases\nRaymond thunder storm coverage of crimes do fifty percent milk keep rank coverage at about that on Saturday and then it drops down gets cooler air on Sunday it's ...\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep President Trump has dug in supporting Saudi Arabia's crown prince\nIn the same way that he dug in for a Supreme Court justice literally the same the president compare to judge accused of sexual assault with a Saudi leader accused of ordering a murder here we go again so the president and an ape you interview guilty until proven innocent\nHis secretary of state just visited Saudi Arabia as well as turkey where Saudi writer disappeared\nSupport for Ninety point have the news comes from Orlando Health\nRelated health network a pediatrician that committed to helping tell by the health care partners dedicated to their well being from birth to adult had quitting is all important teenage years later how ... pediatric locations parents central Florida family more information including locations that Eileen Dole health dot com slash kids\nHe's doing Washington Post columnist David Ignatius knows people well in both capitals Washington in Riyadh and he's in our studios David welcome back thank you you would think that a U.S administration would be acting in support or as an advocate for a U.S resident who has disappeared this writer has disappeared who's connected with your paper I guess we should mention\nUm butter the two countries actually working together here\nWell that's that's the biggest fear after Trump's comments and Pompeo's visit visit the U.S is trying to help Saudi Arabia cook up a a process that will uh rather than putting out the facts put out a ... a cover story that the that supports the Saudi leadership\nThis is NPR News\nSupport for Ninety point seven news comes from a G present featuring mystery science theater three thousand live the thirtieth anniversary tore Joel Jonah and the wise cracking robots present this I find movies the brain and that stock or to Saturday October ... at the hard rock live in Orlando more at ticket master dot com\nAnd Wednesday morning we're taking a look at ... still that problem on rightly or the right lane a by Fort ... told him a car out but\nIt's a drug that you just get by on the left shoulder so they have a big delay there about the twenty minutes from the road for thirty six year old ... about twenty five minutes twenty seven for twenty nine I for west bound up twenty five minutes of delays like married to a pass for thirty six that the accident causing a problem\nAnd southbound orange blossom trail pass holding all lines were blocked used Texas having\nSupport for Ninety point seven news comes from digestive and livers central Florida reminding our listeners that frequent heartburn can be a sign of acid reflux disease and that early detection is the key to preventing the disease from escalating into a more serious conditions such as berets esophagus geared awareness week is from November Eighteen through twenty fourth more ideal CFL dot com\n\nSupport the news that matters with your own going monthly gift from your checking account or credit card and we'll send you a pair of Ninety eight point seven W. M. F. E. customs salt consider thirty fifty perhaps one hundred dollars a month during the song and Dr call one eight hundred Seventy five twenty twenty or visit W. M. F. U. dot org\nIs going to be sunny and hot today high Ninety free a little cloudy or tomorrow well coming up for you or North Carolina has fewer and fewer voting locations is yours or some people have to travel farther\nAnd there's a lot of research that suggests that whenever you move a polling place further away from a vote or that are less likely to vote they're\nComing up new early voting rules in North Carolina and concerns over voter turnout that ten minutes right here on NPR\nSupport for NPR comes from this station and from Amazon Web services used by millions of customers a W s provide the range of cloud services and functionality from tools to security to compliance more information to build on ... W s\nFrom Lausanne the collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track building work better together more at Lausanne dot com\n[noise] and from Lyndon mood bell learning process is committed to helping all students learn to their potential they're learning centers and on line private school offer instruction and reading comprehension Lyndon ... bell dot com slash NPR\n[noise] It's MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep good morning when the Nobel Committee said that ... that was one of the recipients of this year's peace prize they cited her courage\nShe refuses to accept the social colors that requires women to remain silent out of the shades of their views is to which they had been subjected to\nFour years ago as ... fighters enslaved thousands of women and girls in Iraq many were repeatedly raped and sexually abused otherwise\nNot him rod was one of those women she was only Twenty one years old at the time and from a tiny but ancient religious minority groups they use ET\nYazidi people into their veins and\nThey just on a simple life they they can they can leave fleet and group in Iraq in even half baked and their their vein ... piece the ... yeah they just want\nTo live in peace and chasing\nFeel safe I talked to ... and NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace\nSupport for Ninety point have the news comes from Orlando Health\nRelated health network a pediatricians are committed to children's health by being health care partners dedicated to their well being from birth to adulthood including this all important teenage years related health has over twenty pediatric locations served central Florida family more information including locations that are window health dot com slash kids\nThat it's important for us the justice is done out of the\nSix thousand years ET women who were abducted by ISIS we hope to see at least one ISIS number who did this to one me as a woman to be punished for the crimes they committed against gives me the women and we hope to see them in court in public I think it is easy\nTo see winning the Nobel Peace prize as a kind of combination or end of a person's career you've you've done what you said how to do\nIn your case at twenty four years old that is clearly not true you clearly feel like you have a lot less to do what is next for you after winning the prize\nI'm twenty five twenty five ... and ...\nAfter I delivered our master and we have as a community delivered or message about how we would like to see the reconstruction of our homeland infringe RJ complacent and to provide security for ... said that they can go back\nAnd we would like to see this never happen again not get any other community or any other religion or any other group\nAre you angry\nUs in the ...\nI can just simply say I'm angry cheap because of that word only will not describe how much we have suffered but what I can say is that we are right we have the right to speak about this we have the right to deliver a message\nIf anger doesn't quite capture it what is the word what do you feel everyday\nOr chemicals to show them that you know like I said what makes us feel good at least is that we are delivering a peaceful massive die we are not delivering a message to hurt anyone by when I meet with students and presidents and anyone\nI speak about what happened to us and I deliver my message with a clear conscience that I advocate for people\nDuring our half hour interview not humor odd seemed at times pretty shattered but also strong she says that strength comes from her UCD identity she calls the rape of UCD women and the murder of easy demand including many people in her own family a genocide\nShe wants to these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes find yourself frustrated\n... sometimes I feel that my message has not been clearly heard and that's what that is not my fault because they feel like too much is going on in terms of women being victims and it's not the first time and certainly it's not the last time\nAnd perhaps every year a woman's someplace in the world or groups of woman or thousands will be victims of sexual violence or terrorists groups and so I feel like this is not new to people and it's not going to be the last time and people have become numb to this kind of news\nI'm your mother your mother was killed by the Islamic state and I wonder when you think about her now\nWhat do you think she would think about everything that you've done what do you think she would think about you having won a Nobel Peace prize being the voice of the ... community to the rest of the world how do you think your mom would feel\nYou need some of the day because I had the ...\nWhen I received this means that it was around probably five AM in the morning and us we diverted on the first thing I did was look at her picture and cry but because they felt they needed her her ... and not just her with the eighty women ... are women that were with her\nAnd they were all executed for no reason just for being a CD and for being older women I feel like they will be\nProud proud\nYou are twenty five years old you've just gotten engaged congratulations in your life is not what you thought it was going to be just a couple of years ago what kind of life do you want for yourself now\nLook ahead up so much on hug yes we have got engaged politically still difficult for me to deal with all of that so much as much as they try to come close to finding a simple life things come up and then we have to deal with them to continue this work\nBut I Hope that I can but I Want to learn English I work on my English in school and I want to create a family with my fiance and being able to have the simple life and just be safe\nI Hope you get exactly what you want\nIt was really a pleasure speaking to your not humor I thank you so much [noise]\n\nThank you for listening to us on your local member station you can keep the conversation going with us on social media\nI'm Noel King you can reach me on Twitter at Noel King Rachel Martin that Rachel NPR David Greene is at NPR green and Steve Inskeep is at nprinskeep to find out more about the people who put this show together everyday\nGo to our website NPR dot org slash MORNING EDITION and click on the staff taps to read about are amazing crew of editors and producers [noise]\nAnd then there's the fight over how people may vote early voting starts today in North Carolina and it's so popular that more than half of North Carolina votes were cast early in two thousand sixteen\nFor two thousand Eighteen lawmakers altered the rules in ways that could lower turnout here's Alexandra open a member station WFSU maybe\nTo prepare for early voting election director Adam Reagan in Gaston county just north of Charlotte is testing voting machine by running sample ballot through that [noise]\nThese machines were meant to be inside early voting locations throughout the county but the new law requires all sides with any county to be open from ... pm during the week and as a result raking can only open three sites for selection\nEarly but he was very popular and gets to county and and I would have loved to have more early voting locations it came down to having more locations you know helping more voters versus a bit of Sherry responsibilities to the county\nSome democratic lawmakers see this as another attack on voting rights in a state where a voter id redistricting an early voting rules have all been struck down by the court at various points in the last few years\nDuring a Jew and get paid about early voting democratic state representative Amos quake said the requirement that if one side is open on the weekend the rats also have to be could discourage county from having any weekend hours\nWeekend early voting has been for fun and has been referred\nBy a certain population and certain ... relations right to vote as not only in our life but it's been rejected in recent court decisions\nHe's referring to black voters and appeals court ruled a twenty Thirteen lot that among other things caught early voting by a week targeted African Americans with quote surgical precision but Republicans who champion this law argue they're only trying to minimize confusion here state representative David Lewis also during the debate\nWhat we set out with the into use you to do is to be able to make it more reliable and the ... the voters would know that the early voting site or sites in their county was open from the time in the morning on the evening\nThe law has some bipartisan opposition run riot is the Republican Party chair of the ... county about fifty miles north of Charlotte the county has had to cut it early voting sites and half frustrated historically low would use and he says even though they may not seem like an unfunded mandate\nThat's exactly what it translates to being at the end of the day\n... counties with smaller election budget like ... are disproportionately affected by this change well individual location maybe open longer they released Seventeen percent fewer sites that selection and mighty political scientist Charles Stuart that third says that for voters convenience Trump's hours\nAnd there's a lot of research that's been done this or just that whenever you move a polling place further away from a voter they're less likely to vote there\nStewart says the rule change could simply shift turn out to election day which could mean longer lines at the polls and the state or a voting rights has become such a political hot potato elections officials say they just go with the flow Becky Gallup Harris the elections director in ... county\nDue to court cases legislation all of that kind of thing factors and and it just seems like we always have something like ... and that takes us in a different direction\nThe question remains voters adapted easily\nFor NPR News I'm Alex ... [noise]\nIt's NPR news\nSupport for Ninety point seven news comes from alert today Florida committed to safeguarding those who bike and walk avoiding distractions is crucial to public safety drivers should just drive and walk I should just walk more information is available online at alert today Florida dot com because safety doesn't happen by accident\nThat it takes a look at traffic brought people I've done nearly sport to re route if you haven't gotten the message I for ... year for thirty six the right length ... oh I don't know late last night it seems and causing them to live about twenty two minutes really road too late to a four thirty six it also in champions gate they've got about half an hour there for twenty seven for twenty nine\nDo and the other way like married for thirty six about half an hour as well I Know the five year old galley causing a twenty minutes away from us we're not too well galley there north I'm turnpike little busy from the U.S all a parkway to for Seventeen\nAnd let's see we have a couple of roadway accidents cellphone for a city wrote at Kennedy boulevard\nA soft on winter garden Vineland mid late when a vis a vis the boulevard followed the police there and cell phone trail past Holden alternate is Texas avenue\nHi I'm Jeremy opposite of here and now W. M. F. C. has provided central Florida with more than just the news the station is also featured in depth information about the people and cultures around you\nPlease consider a gift of a dollar or two a week to help W. M. F. E. the number to call is one eight hundred seven eight five twenty twenty or go on line to W. M. F. E. dot org and\nIt is another hot day to day sunshine with the hive Ninety three and I got to be clear low Seventy five and tomorrow a forty percent chance of showers and thunderstorms but some sun in there too with again a high closer to Ninety\nWell if you are if you're aware of Jonah Hill's a career he's made some movies even nominated for an Oscar Wilde but\nHe's made his first movie is directed his first movie it's about a Thirteen year old boy from troubled home that's coming up for you in just a bit right here on NPR's MORNING EDITION it is I'm forty four right now on our Wednesday morning together I'm Sean ... good morning\n[noise]\nGood morning I'm Noel King earlier this month on October ... Christopher how long he was born in a hospital in Liverpool\nTo write that Philip mentioned the nurses that he shares his son's birthday\nHoping that his father was also born on October ...\nBBC statistician puts those odds at one in one hundred and thirty thousand Phillip says his dad burst into tears when he heard the news family may want to consider buying some lottery tickets It's MORNING edition\nSupport for NPR comes from this station and from Charles Schwab who believes the modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more at Schwab dot com [noise]\nFrom Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser and Kathryn ... on a new episode every Friday on prime video and from the sustaining members of this NPR station\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King there are reports of a surge of new Ebola infections and the Democratic Republic of Congo today and emergency committee of the world\nSupport for Ninety point of a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nAnd has the story the definitely they show has only sounded the alarm this way for times most recently in twenty sixteen when he got arrested in Latin America and before that in response to the twenty fourteen twenty Fifteen Ebola outbreak in West Africa that infected more than twenty eight thousand people\nThis outbreak in the D. R. C. has been much smaller about a hundred and eighty confirmed cases so far but it centered in a particularly challenging area\nTo Provence that they get more than Twenty years shovel conflict\nPeter salon I as a top official with the W. H. O.\nHas one million of eight million residents internally\nThat it's a highly on your part of the Democratic Republic of Congo\nAnd armed rebel group called the allied democratic forces has been launching attacks on government forces UN peacekeeping troops and also civilians now so on and says despite that when you first surfaced in early August\nWe're quite confident we would get on top of the up and\nThe government W. H. O. and partner organizations launched a major effort to treat infected people and administer and experimental vaccine to anyone who had had contact with them the strategy started to show success\nAnd then what happened in September is we had seven or eight major tax\nViolent attacks by the rebels including one in a city called Benny where they killed more than twenty people mostly civilians\nThe population of any ... that enough is enough\nPeople who for years have felt completely abandoned by the government and the international community started turning against the health workers who were seen as an arm of the government people would say\nLook you can't even guarantee a physical security\nWhy should we go along with this unfamiliar anti Ebola campaign you're pushing\nNow salon stresses that the vast majority of people are still cooperating but rumors has started that the vaccination campaign is actually a plot to spread the disease members at a safe burial teams were attacked with rocks and severely injured and often after rebel attack whole neighborhoods shut down in protest\nWidowed allowed to move in the streets of barricaded by young people sometimes donating ties are objects and sometimes the ... or other weapons\nIn the last week and a half the effects of this has started to become clear with not just a rise in the number of new cases each week but ever more cases who contracted Ebola from someone the W. H. O. had not previously known about\nThat's the situation that the emergency committee that's meeting today has been asked to assess David Hayman is an infectious disease expert in an advisor to the deli Late Show\nSome fielded by calling a public health emergency or increased political importance of the event will possibly increase the mobilization of funds\nThe deli they chose asked for thirty three million dollars to help neighboring countries prepare for the possibility of a spread across their borders and declaring this kind of emergency ... also have a wider affect\nSupport for Ninety points at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nMe up to two PM a variety of screenings will be made available to the public including hepatitis C team a globe and test fluent hepatitis B vaccine kids Uri with face painting and jumpers in food trucks more ideal CFL dot com\nSupport for Ninety point seven news comes from Chico people's gas natural gas heat pumps may help contribute to air conditioning resiliency for consumers and businesses in Florida well reducing their carbon footprint more information about natural gas can be found at people's gas dot com slash G. H. P.\nGood morning to you It's Wednesday I'm Sean for coming up at the time of the year that for ... actually look forward to not hurricane season will talk about how that's looking and also the big merger between CBS commitment what does it mean to you and uh we'll give you the latest on hurricane\nMichael and be a a recovery efforts out there that's coming up but national news from NPR's mixed it's eight o'clock who\nMorning what makes President Trump's so eager to defend Saudi Arabia the president back some NATO allies suspected of ordering the murder of a U.S\nMORNING EDITION from NPR News\nThis is going to serving Orlando over [noise]\nCompared to Saudi crown prince to Supreme Court justice Brett Kavanaugh ... king\nAnd I'm Steve Inskeep in compliance both men were found guilty until proven innocent Republicans top may not be quite that tough Latino voters are largely presumed hospital\nAlso this hour why some Asian Americans oppose\nOfficials track a mystery illnesses children It's Wednesday October\nSeventy the day a refugee arrived in the United states\nNineteen thirty three years in his\nMind from NPR News in Washington encore of an Coleman secretary of state Mike Pompeo is an author a turkey for discussions about the case that missing Saudi Arabian journalists Jamal ...\nTurkish officials have suggested he was killed inside as Saudi consulate in Istanbul and his body removed\nThe Saudi Government is vehemently denied that secretary Pompeo traveled to Saudi Arabia to speak with the Saudi king and crown prince and NPR's Michel ... says reporters questioned ... about that conversation\nWe asked him directly the Saudis tell you that that they killed ... and he said he didn't want to discuss the facts and the case and he didn't and he said the Saudis didn't either he said that was reasonable to give them time to investigate any also a cold district incredibly successful\nBecause he said they agreed to fully investigate this um which by the way something they've said before and\nOf course you know early on they said that ...\nAnd their story seems to seems to be changing but we didn't really hear I'm a I'm a away in on any of that\nNPR's Michel ... traveling with the secretary in on current turkey\nLeaders in the European Union are gathering in Brussels for what it's supposed to be the deadline for a deal to ease the United kingdom out of the block by next march NPR psoriasis are highly Nelson reports from the Belgian capital no deal appears to be forthcoming\n... a lot still needs to happen even if the leaders were to agree on a branch of strategy during the summit here experts have to hammer out details of the continental sized divorce and the twenty eight you parliament's must ratify the deal\nThat President Donald Tusk says negotiations are once again stalled over at the same snag us before what to do about the border between Ireland which is a member state and Northern Ireland which is in the u._k.\nIt looks like a ... of the gold yeah a lot of us would lead guy comes to you and your version of the great sea\nCall them and British prime minister Theresa May to deliver a new facts that could break the log jam psoriasis are heading out than NPR News Brussels\nWall Street opens in about an hour and a half after closing the day sharply higher on Tuesday the federal government released news showing the labor market is in good shape with a lot of job openings\nAnd big companies released better than expected earnings news this week NPR's Scott Horsley says President Trump is complaining about rising interest rates even as the stock market zooms up\nThe Federal Reserve has been slowly but deadly increasing interest rates and that boost costs for all kinds of debtors including the federal government itself the federal deficit balloon by Seventeen percent and the fiscal year that just ended and the government's expected to borrow more than a trillion dollars in the upcoming year\nNPR's Scott Horsley this is NPR\nSupport for NPR comes from NPR stations other contributors include his car insurance providing customize insurance for small and medium businesses so they can do more and be more learn more at age ... CEO X. dot com or from an aging Hitchcock's insurance encouraged courage\nGood morning it as they do for for another point seven use I'm Schoenberg stone crabs season open this week and so far the catch in the Florida Keys is looking good that's according to bill Kelly he'll do the head of the keys commercial fisherman association\nWere fairly optimistic that we're going to have a good season here in the Florida Keys unlike some of our neighbors to the north and especially on the west coast where they're being severely impacted by the red tide and its fables a juvenile ground\nWhile these fishermen are hoping the red tide stays away from local waters or better yet breaks up entirely one issue they don't have to worry about is the effect of terrorists they may have been a problem for selling lobster to the Asian markets but Kelly says that's not an issue with stone corrupt\nIt's a Florida favorite and beyond our state boundaries as a matter of fact but most of it is taking care of right here in the local domestic consumption and so forth\nStone crabs should be available at many local fish markets already in Florida the season runs through may fifteenth sixty nine billion dollar merger between CBS in it and it's been approved by the department of justice or health reporter Daniel prior says this will consolidate the number of prescription drug plans available to consumers in the short\nTerm when the deejay approved a merger between America's largest pharmacy in third largest health insurance company it required at not to sell off its Medicare part D drug plan\nSome experts are concerned that fewer Medicare part D providers will lead to a less competitive market like you can't keep an ski of Kaiser Family foundation says once the dust settles plans offer next year will actually give consumers more options\nThis administration has also taken steps to make the Medicare part D and Medicare Advantage marketplaces more competitive kind of have a on the one hand there are mergers happening and on the other hand there are new players coming into these marketplaces\nHas the merger between two companies that are competitors it's hard to tell what the effect will be on drug prices CBS the c._e._o. Larry Jay Marlowe says it will make it easier for patients to access more diagnostic and preventative care services at the pharmacies Danielle ... Ninety points out the news\nThis is ... Hi I'm off on paint all of our president and general manager of your station might be point seven W. M. F. E. and this is our\nSupport for Ninety points of a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nDied in the consulate during questioning now and turkey ... certainly got a very different story a Turkish investigators said they have audio video evidence of the show just killing and dismembered ... add some more gruesome details are coming out today\n\nThis is NPR News\nHi this is ... and all of our here letting you know that Ninety point seven W. M. F. E. he's bringing capital steps back in twenty Nineteen there's a lot of your show will be coming to trinity prep on Thursday February twenty eight at seven thirty PM support this hour drive and get your tickets today\nIs it W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty eight Nineteen\nTaking a look at traffic sponsored by done really sports Hebrew I for it you spend a west by now it's just about a twenty five minutes late either direction matter which way you're going we do have a couple of accidents westbound on the beach line near the five forty one lane is blocked\nSo use five twenty there's about Fifteen minutes away there in North on on the for Seventeen there was an accident there yesterday there's one here today right in the middle of like just a bridge so there's a backup from four thirty four to the middle of the bridge and what else do we have going on up on edge wondering palm avenue inferior shores\nThe alternate is orange blossom trail\nSupport for Ninety point seven news comes from a visit central Florida central Florida as Polk County features of variety of year round art and cultural experiences such as historic landmarks galleries museums theaters music venues and more a weekend arts get away to poke county can be choreographed\nAt arts central dot ORG\nAnd we're going to take a look at the forecast year for a central Florida looks beautiful today either Ninety free and for the middle of October boy oh boy I'm tired of that Sunday tonight clear low Seventy five tomorrow more chance of showers and thunderstorms but we will see some ... from what we understand some more rain is possible on friday but cooler and writer\nAnd I'm going to hold them to it are coming up uh on Saturday and Sunday [noise] so uh coming up\nIn about ten minutes the Centers for Disease Control and prevention says it is concerned uh can for sixty two cases of acute flats in my life is in children it's a rare condition causing weakness in the arms and legs\nAnd sometimes paralysis what's behind it and more about it coming up in about ten minutes right here has MORNING EDITION continues at eight Twenty one\nSupport for NPR comes from this station and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price investor confidence\nFrom Viking dedicated to bringing the traveler closer to the destination by river and by sea offering a small ship experience with the shore excursion included in every port learn more at Viking Cruises dot com\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John flattery Amanda Peter Paul riser and Kathryn ... on a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King more than me is a charity that aims to educate and protect Liberian curls\nIts founder is an American woman named Katie ... she has thousands of social media followers they're mile or tell stories about life in West point which is a slum in Liberia's capital stories like the one about a girl named Abigail here's my lawyer\nA little girl in Liberia who doesn't have a mom or dad I'll go on a street selling herself at eleven years old because she didn't have a glass of clean water there should be no girls are still on the streets when you're free to go to school\nBut according to a report just released by ProPublica and time magazine some of the girls that more than me was supposed to be helping were victimized they were raped by a man who was a staff member with the charity Rachel Martin spoke with Finley young who wrote the story\nBefore we get into what went wrong with this charity more than me I Want to ask what was going right what's ... more than me apart from other charities at the beginning\nI think that more than me and particularly its undercut the mile or hugging incredible ability to connect with those who could commit money or resources to their mission\nAnd I think in a way this is a story about about social media on about how you present the story level really engage with hearts but will make people reach into their pockets and thinks that the individually but taking a small steps are making a difference\nSo who is Katie mylar why did she started this organization\nGetting my there's a woman from New Jersey who cut along background in doing various forms of gift community help and volunteer work\nSupport for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nWhich are the first registered in two thousand and eight [noise]\nShe didn't have a lot of nonprofit management gets you\nKnow and kicked him ... has been very clear in our own promotion of the organization that she brought to this was an incredible depths of love it's a love driven organization\nHer co founder a man who really helped her start this organization on the ground in Liberia was a man named Macintosh Johnson tell us about him\nI never met Macintosh Johnson but he was someone who is fundamental in starting up of this organization he was a he was a guy who had had a childhood interrupted by war who told numerous people he'd be a child soldier\nUm and then in in West point had also been part of the vigilante groups which is a group of you know community members who in the absence of of police um you know help to provide those kind of that kind of support to the community so he was a well known guy in the area of West point where he ... he was well liked [noise]\nAnd he became very highly trusted really very very quickly\n[noise] can you explain exactly what he was doing the systematic way that he was abusing these girls\nJohnson was heavily involved in the recruitment of girls said he was the point person for the organization in West point it was viewed as his organization along with ... and he was using that power according to what the girls told the court to abuse those who are within this group of power\nAccording to what they told the court girls as young as ten years old I'm were exploited on numerous occasions and\nAnd when they talk to the court they all said that well he he threatened to remove me from the scholarship\nDid Katie ... the founder of the organization now what he was doing [noise]\nWell that's something that we ask Katie and something that we've reported our responses and the peace one detail of this which also helped in power Johnson was the fact that my lawyer has an intimate relationship with him but she's conceded in an interview but that same year and twenty eleven there was some form of conversation takes place which involves Johnson's ex wife who [noise]\nWho says that she said something on the lines of you know I told her that she loves the children but she didn't didn't really get it\nNow my lower recounts that conversation different that she'd Harrods she described I think there's rumors that Johnson had been in sexual relationships with young girls and but she said she fold up and she asked the girls themselves and they said that that he was a good man\nThere's a second level of tragedy to the story in that after Macintosh Johnson was arrested he stood trial it was a hung jury and after that it was revealed that she had HIV right\nWhile it was it was known by people within the organization and there were rumors it was never formally revealed that he had aids when he died\nOn as a consequence you know potentially all of those who have contact with them which according to reports on to our reporting and also with the court documents and organizations internal documents was many many girls\nThat are potentially at risk now it's important to say that the ten girls who actually testified in court those who actually are willing to bring a case they were retested and one of them tested positive\n[noise] it's so complicated right because as you outlined in the peace keeping my alert at one point to you in a bottle to whether or not her organization was responsible for this says\nYou know where are your schools were the schools that you have dealt in Liberia she clearly feels that even if her organization willfully or not turned a blind eye to the cities that it has been a net positive for the girls have Liberia\nYeah I think that you can see in in a lot of the responses we had an attractive leadership so there was this sense of why are you telling the story you know look at these other girls that we've educated\nBut I think that to to view this as you know just a an unavoidable thing that happened in the early points of organization it just that's not a logic that we'd applied to to sexual abuse with an institution in any other context\nAnd Liberia still allows the organization to operate schools there\nWell the the story is really hard in Liberia because of course a lot of people are involved in the building up as an organization like the local government to ... mile or had strong support from first of all from the president Ellen Johnson Sirleaf\nAnd then also the local local donor community I think I'm a local community had the sense of\nA lot of people have the feeling that something's gone wrong in this and this organization but didn't know the ... so there's a whole lot of soul searching going on on the government has not just a few investigation involving seven different ministries they've said that they are looking into reopening the case [noise]\nUm and they're looking as well as more technical stuff like well how do we how what's the process for credit than these organizations have we help them accountable they're looking into whether the HIV aids policy was was followed and the school\nJust to be I led the difficulties following the CDC has confirmed sixty two cases and the last few months mostly in young children since the CDC began tracking the disease four years ago and total of three hundred and eighty six cases have been confirmed\nOne case where the seven year old boy and his mother Susan coin says her son came down with an ear infection this was back in the fall of two thousand fourteen\nSo I took him to the pediatrician and she put him on a antibiotic\nBut within a few days Evan complained of severe pain in his back legs she became extremely lethargic and went downhill quickly\nHe lost children Michael control and both his arms and legs you know one minute you have the healthy head and the next minute your kid is totally paralyzed it it it would be honored horrifying to us\nIt's not clear what caused the evidence sickness and the CDC's Nancy ... says unfortunately the cause of this condition is still unknown\nI'm frustrated that despite all of our effort we haven't been able to identify the cause of this mystery illness we don't know who may be at higher risk for developing and got them or the reasons why they may be at higher risk\nNetanyahu says given the rising cases the CDC is escalating its response and consulting with a variety of experts to solve the mystery\nAnd they do know that some kids who get it have also had viruses such as intro virus another possible risk factor is West Nile virus which so far there's no common pathogen that links all the cases\nDespite extensive laboratory testing we have not determined what packaging or immune response or the arm or like weakness and paralysis and most of these patients\nGiven that the symptoms are similar to polio a disease that have been almost completely eradicate it nothing ... pointed out that this does not polio\nRight now we know that polio virus is not the cause of these ads on cases CDC is tested every store that's and then from math and patients none of the settlements have tested positive for polio virus\nThe CDC says despite the increase in cases eh Sam is a very rare condition affecting fewer than one and a million children but she says it's good to be aware of the signs and symptoms the Ninety percent of those affected our children there are some cases and adults\nWe recommend taking medical care right away if you or your child develops sudden weakness of the arms her legs\nAnd do the CDC can't give any specific information about what's causing a FM ... says it's good to take general precautions\nParents can help protect their children from serious diseases that following prevention steps like washing their hands thing up to date on recommended innovations and using insect repellent prevent mosquito bite\nIn the case of seizing points on Avon he's healthy again he was treated with steroids Andy was an occupational and physical therapy for Eighteen months\nEditor fully recovered he has regained ... and all strength in a foreign land\nBut this is not always the case some kids who've been diagnosed with a FM continue to have paralysis and require ongoing care Allison Aubrey NPR News new\n\n\n\nThis is NPR News\nSupport for Ninety point seven news comes from Florida Hospital where they are committed to a whole new way of health care on January second Florida Hospital become known as advent health with a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at the health dot com\nOr we're taking a look at ... done really sports you root for you spent in West palm\nOf usual delays nothing unusual Florida turnpike self up at five twenty eight the beach line the right lane is ... about a Fifteen minute they're\nPast five four to five twenty eight and that accident on the middle of the bridge like just the bike lanes blocks or about a half an hour of delays there now Clark approaching colonial Coley there's an accident use Montgomery itself on what a garden blind when a vista in Lakewood of is the alternative is a popular\nBy one road support for Ninety point seven news comes from a G present featuring the legendary Bob Dylan live in concert with his band friday October twenty six at the Dr Phillips Center for the performing arts in Orlando\nTickets available at the box office or at Dr phil epicenter dot org\nHey Peter said we'll hear from wait wait I'm well I'm really looking forward to seeing you all under of every fifteenth I wanted to urge you all to become a member or sister any member of W. M. S. E. at W. M. F. U.\nDot org or are we finally Dr I'm Sorry that's one eight hundred Seventy five do oh do Oh thanks\nSo I'm sure today high above Ninety three clear tonight looks at me for tomorrow better chance of rain but making way for some cooler dryer or a few degrees anyway a Saturday and Sunday going up for ya market place more than ... report President Trump is offered negative opinions about the Federal Reserve in the past few weeks since this time\nHe's calling his biggest threat\nThat's all the way in marketplace morning report but ten minutes right here on MORNING edition continues for you on your Wednesday\nGood morning Schoenberg\nI'm Steve Inskeep you too can attend an Indian wedding\nTourists to wonder is genuine the cultural experience can buy one of the reports that have started a company called joined my wedding allows total strangers to do just about a movie or you pay for a ticket to get 'em structures on how to dress and then he joined the party some proceeds go to the bride\nAnd groom and do you play your party at an Indian wedding industry that is now worth billions and growing every year It's MORNING edition\nSupport for NPR comes from the station and from the levels and foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John de into Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information or a Mac found dot org and from the listeners support this NPR station\nAnd this is MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep we ride along the extra search and rescue teams after hurricane Michael appears Hans solo Wong traveled through Florida as Jackson County with a crew from FEMA a\nLarge paper map out the more than nine hundred square miles of Jackson County spread across the folding table in a makeshift come into this ... this is my\nCircle of friends with a digital\nPicture of search and rescue team or Virginia task force one is about to start its fourth day here trying to drive down every single road in a remote part of Florida's panhandle trying to figure out what people here need emergency medical care health covering their roofs directions to the nearest\nSupport for Ninety points at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nWas chief kid has sores behind the wheel leading a caravan of trucks pass the ball and power poles long leaf pine snapped in half and washed out cotton fields hurricane Michael left behind rescue specialist Adam sheets rides in the front seat this is probably my\nThird or fourth hurricane deployment is the worst option\n... worth with Virginia task force one would be more for just checking all people to figure out what it is the mayor of events that have a young when\nShe pencil checks in with a couple of residents who are living with an elderly relatives power is still out for many here and generators vora behind almost every conversation most of the road to Europe and clear such stormed a breach still blocks some unpaved driveway Virginia task force one is the first outside help ...\nThrough a whole lot of work that plane up all the freeze it fell down on the top dissolve the houses of some of his float away that brought up very doesn't last frying slowly\nJust turned eighty one he lives with his son Ricky who uses a wheelchair points at a church across the way that lost his roof around the corner of toppled trees has left the holding a trailer and now looks chewed through in the middle\nIt's as chair of the office but we all live and\nThat's a good sign up there just a short drive away ... stands in front of the house top with blue tarps and plastic sheeting Nelson has been staying here with\nHer daughter and I just really the place you guys that will be further from the very I guess my lots of water and it turned out at my home but then I go there there's trees everywhere babies to my house but it's like a gateway and they're split ... ... you\nKnow some works the midnight shift at a nursing home such a city in water is still out at her own house but she says she's not sure how much longer she can stay with her daughter\nFacials [noise]\nHere's a shelter information\nFrom both short views reform ... properties church the jury okay\nThanks very much they got they they they got your\nCell phone service is still society in parts of Jackson County so rescue specialist like Adam sheets having stepping in as messengers reeling information about relief services in person and lending a friendly here she says before the hurricane many living here we're already just getting by\nI'm Tracey Samuelson and this is the marketplace morning reporting [noise]\nFrom APN American public media\nSupport for Ninety point seven news comes from career source Florida dedicated to helping businesses grow would compete Florida flex training grants are available to help keep existing fulltime employees at the top of their game businesses of all sizes can apply for incumbent worker training grants apt to career source Florida dot com\n\nSupport for Ninety point seven news comes from certified financial group working ... for nearly forty years they're independent CSP professionals within providing central Florida families with retirement planning and wealth management for these are they're registered investment advisor learn more financial group dot com certified financial group where they are planning tomorrow today\nAt a good morning coming up in local news was a lovely night for a rocket launch and will there be red tide and ... we may have the answer today and this may be the last day or not a millionaire that's coming up but national news from NPR's is next on the way at the top of the hour and a good morning ... who\nThe pressures Saudi Arabia a basis for the disappearance of a writer the kingdom has one prominent defenders\nIs Ninety seven women serving Orlando Melbourne and they go to\nWhat makes the United states and the Trump Administration so close to the leaders of Saudi Arabia and I'm Steve Inskeep\nAnd I knew well king also this hour we cannot ... mirage did your co winner of the Nobel Peace prize she's only twenty five years old but she's on a mission to draw attention to a profit he committed against her you need people to federal deficit jumps in two thousand Eighteen lots of things are pointing\nIn Washington will get some answers when they're having a rapper\nAnd the news is next\nLive from NPR News in Washington encore of a cool and authority than the U.S southeast say at least twenty six people have died because of hurricane Michael\nOfficials in Florida say at least sixteen people were killed in that state following the strongest storm to strike the area in fifty years NPR's Greg Allen reports twelve of the ... were in ... county\nBay county in Florida's panhandle is where hurricane Michael made landfall with a sizable storms\nSupport for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nAnd listening gear that's had been reporting to Mexico beach it's not clear yet how many the Florida emergency operations center says twelve debts in Bay county plus one death in ... county had been confirmed by medical examiner's under state law medical examiner's we're responsible for confirming and attributing Des occurring and their counties\nThat's when the storm of all been confirmed and gas and county and clay county there also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina Greg Allen NPR News\nA day after meetings and Saudi Arabia secretary of state Mike Pompeo is in Anchorage today for talks on the disappearance of Saudi journalist ... he met with Turkey's president and foreign minister NPR's Peter Kenyon says Turkish officials believe ... was killed in the Saturday constantly in its temple\nSaudi officials deny any involvement in ... disappearance Turkish authorities say they have evidence ... was killed in search of the Saudi consul general's residence and diplomatic vehicles and assemble did not take place Tuesday as expected Turkey's foreign minister says the search could be carried out today that constantly building was searched Monday\n... is a Washington Post columnist who's been missing for more than two weeks\nRussian officials say at least Eighteen people are dead and more than forty others injured out of occasional schooling Crimea officials say the attacker was a student who later took his own life and here's Lucy and Kim reports from Moscow the Kremlin first said the bombing could be terrorism\nRussian state TV showing images of rescue workers at a vocational school in the Crimean town of courage Russia's national anti terrorism committee says the blast was caused by an explosive device criminal spokesman said president flooding they're putting expressed his condolences to families of victims and ordered investigators to determine what happened\nPurchased known for being on the crime inside of a new bridge connecting Crimea which Russia\nRussia annexed Crimea and twenty fourteen after occupying the Ukrainian province in holding a referendum that few countries have recognized the scene Kim NPR News Moscow\nWall Street will open in about half an hour futures indicates stock prices may fall at the opening now investors had new economic news the Commerce Department says construction on new homes dropped five point three percent last month as mortgage rates jumped to their highest levels since ... eleven and this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\nAnd a good morning in his mental for for Ninety point seven news I'm Shawn very well early this morning\nFive four three we have ignition\n[noise] and lift off of\nUnited launch alliance successfully launched an atlas five rocket carrying a high tech communication satellite for the military from Cape Canaveral with clear skies no technical issues you a license the air force has advanced extremely high frequency communications satellites into orbit\nIt was the most powerful version of the atlas five rocket with more than two million pounds of thrust and lift off\nThe satellite will provide the military with encrypted and jam proof communications testing is under way after reports of possible red tide and Indian land in Melbourne beach Ninety point seven environmental reporter Amy Green finds the results are expected\nToday if I could get ... and ... began over the weekend said speaking you Barker county natural resources department the\nLifeguards went to the area where the first reports came in and they said that they also experienced you know nasal issues\nAnd nearly year long red tide in southwest Florida has spread in we had mine carried by the gulfstream around that peninsula Saturday must cat and at the Atlantic coast intern our county to harmful algae the the gates ran any green Ninety points that any of these\nLottery officials called them dueling jackpots whatever term you prefer the combined mega millions and Powerball jackpots combined for over a billion dollars to Tuesday's mega million jackpot smell up to six hundred sixty seven million the largest\nIn its history the odds of winning one over three hundred and two million meanwhile the Powerball as role to an estimated annuity a three hundred and forty five million this is Ninety point seven\nSenior hometown to Capitol Hill budgets are part of our everyday lives I Know the chain taxes terrorists trade the choices you make this November connect to all of them\nWhen you give every month as a sustaining member you hope is covered the economic and political means that will affect your years down the road he just had to support them means you'll need tomorrow today\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. heat on orgy you're a supporter of a dollar a day during this island Dr makes sure the reliable need to know information on that point seven W. M. F. E. stays exactly where you expected to be\nCalled one eight hundred Seventy five twenty twenty\nSupport for Ninety points at a news comes around burger Kirk and called litigation attorneys serving the business community throughout the state of Florida more at ... dot com\nWell how does our Wednesday look weather wise well we're experiencing sunshine and some are like heat again today client or the highest climbing into the lower nineties\nWe may see some record highs in some neighborhoods with big changes around the way there is a front coming through by Thursday bringing the showers and storms later in the day I have about Ninety by friday the moisture increases rain and thunderstorms coverage\nOr claims to fifty percent and the temperatures drop in the mid eighties wearing the key brain coverage about forty percent Saturday and then cooler drier air drops in for Sunday\nAnd Monday that's nice it is nine o seven good morning\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep President Trump has dug in supporting Saudi Arabia's crown prince in the same way that he dug in for a Supreme Court justice literally the same the president compare to judge accused of sexual assault\nWith a Saudi leader accused of ordering a murder here we go again so the president and an AP interview guilty until proven innocent\nHis secretary of state just visiting Saudi Arabia as well as turkey where Saudi writer disappeared but Mike Pompeo explicitly said he did not ask about the facts of the case he only said he wanted a transparent process what are the Trump Administration and the Saudis\nDoing Washington Post columnist David Ignatius knows people well in both capitals Washington in Riyadh and he's in our studios David welcome back thank you you would think that a U.S administration would be acting in support or as an advocate for a U.S resident who has disappeared this writer has disappeared or who's connected with your paper I guess we should mention\nUm butter the two countries actually working together\nHere well that's that's the biggest fear after Trump's comments and pumped as visit visit the U.S is trying to help Saudi Arabia cook up a process that will uh rather than putting out the facts put out a cover story the the the support of the Saudi leadership\nThis is NPR News\nGood morning this is MORNING EDITION on my viewpoint seven WM at the John birth and with hurricane season still under way we give you all the latest breaking news about the weather and things that may affect you during hurricane season make sure to download our WM every apple your phone before the storm\nAnd followers on Twitter Instagram at WM every Orlando\nAnd you can also show your support for all the uninterrupted public radio news and the programming that you listen to daily by making a donation of a dollar a day online at W. M. F. E. dot O. R. G. or call one eight hundred seven eight five twenty twenty thank you\nSupport for Ninety points on the news comes from the central Florida expressway authority we're told revenues are invested locally and travelers can save time and money with the past ... pass works on all toll roads in Florida Georgia in North Carolina\nAnd for parking at Orlando international airport learn more and get ... dot com\nSupport or not he born seven use comes from ... education foundation who believes that education changes lives and strengthens communities and is guided by disbelief to invest in programs that promotes students' success in the early grades college and career readiness and post secondary completion\nLearn more at ... dot org\nDon't miss the next Ninety point seven W. M. F. E. speaker series on Monday October twenty ninth\nDr Helen ... turned forty I Am Dr hang fish kind will present healthy finances discussion on how to fine tune your planning process for a better today and tomorrow for more information mentors BP to this free event go to W. M. F. E. dot org slash events\nHi I'm Matthew ... points even used where you can hit endive conversations about issues that matter in central Florida and you can have usa support local programming or not he points even during the silent drive by calling one eight hundred Seventy five twenty twenty all make a contribution on line of W. M. F. C. dot org slash support and thanks\n[noise] support for NPR comes from the station and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template a drag and drop email editor and twenty four seven customer service more campaign monitored dot com\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul rider and Katherine high on a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep good morning when the Nobel Committee said that ... there was one of the recipients of this year's peace prize they cited her courage\nShe refused to accept the social codes that requires women to remain silent out of the shades of their views as to which they had been subject to the\nFour years ago as comic state fighters enslaved thousands of women and girls in Iraq many were repeatedly raped and sexually abused in other words\nNot him rod was one of those women she was only Twenty one years old at the time and from a tiny but ancient religious minority group the ZD\nYes any people in their their money and\nThey just on a simple life they they can they can leave we any group in Iraq and even here but and they are they're very key piece the ... and they just want\nTo live in peace and fixing\nTo feel safe I talked to him rot and NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace prize with the help of an interpreter she spoke mostly in ... which is her native language about what she now hopes to achieve\nUm I'm diminishing I mean we had set it over\nAnd over that it's important for us the justice has gotten out of the six thousand he is he the women who were abducted by I said we hope to see at least one ISIS number who did this to one me as a woman to be punished for the crimes they committed against humanity women and we hope to see them in court in public\nI think it is easy to see winning the Nobel Peace prize as a kind of combination or end of a person's career you've you've done what you said how to do\nIn your case at twenty four years old that is clearly not true you clearly feel like you have a lot less to do what is next for you after winning the prize\nAnd I'm twenty five twenty five yes [noise] and it just\nAfter I delivered the message and we have as a ...\nSupport for Ninety point have the news comes from Orlando Health\nRelated health network a pediatricians are committed to children's health by being health care partners dedicated to their well being from birth to adulthood including this all important teenage years later health has over twenty pediatric locations to serve central Florida family more information including locations that Arlen do health dot com slash kids\nNever happen again not to any other community or any other religion or any other group are you angry\nUs in the ... as I can just simply say I'm angry cheap because of that word only will not describe how much we have suffered but what I can say is that we are right we have the right to speak about this we have the right to deliver a message\nIf anger doesn't quite capture it what is the word what do you feel every day\nOr what chemicals to show them that you know like I said what makes us feel good at least is that we are delivering a peaceful message we are not delivering a message to hurt anyone when I meet with students and presidents and anyone I speak about what happened to us and I deliver my message with a clear conscience\nThat I advocate for people\nDuring our half hour interview ... seemed at times pretty shattered but also strong she says that strength comes from her UCD identity she calls the rape of using the women and the murder of ... men including many people in her own family a genocide\nShe wants these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes find yourself frustrated\n... sometimes I feel that my message has not been clearly heard but that is not my fault because I feel like too much is going on in terms of woman ... victims and it's not the first time and certainly it's not the last time\nAnd perhaps every year a woman's someplace in the world or groups of woman or thousands will be victims of sexual violence or terrorist groups and so I feel like this is not new to people and it's not going to be the last time and people have become numb to this kind of news\nI'm your mother your mother was killed by the Islamic state and I wonder when you think about her now\nWhat do you think she would think about everything that you've done what do you think she would think about you having won a Nobel Peace prize being the voice of the ... community to the rest of the world how do you think your mom would feel\nIn some of the ... when I received this news it was around probably five\nAM in the morning and us and the first thing I did was look at her picture and cry but because they felt they needed her ... and not just her but the eighty women they eat him or women that were with her\nAnd that we're all executed for no reason just for dean is eating and for being older women I feel like they will be proud\nProud you are twenty five years old you've just gotten engaged congratulations in your life is not what you thought it was going to be just a couple of years ago what kind of life do you want for yourself now\nLook ahead to observe mutton hub yes we have got engaged but it's still difficult for me to deal with all of that so much as much as they try to come close to finding a simple life things come up and then we have to deal with them and still continue this work\nBut I Hope that I can but I Want to learn English I work on my English in school and I want to create a family with my fiance and being able to live a simple life and just be safe\nI Hope you get exactly what you want\nIt was really a pleasure speaking to your not him rot thank you so much [noise]\n\nThank you for listening to us on your local member station you can keep the conversation going with us on social media\nI'm Noel King you can reach me on Twitter at Noel King Rachel Martin is at Rachel NPR David Greene is at NPR green and Steve Inskeep is at nprinskeep to find out more about the people who put this show together everyday go to our website NPR dot org slash MORNING EDITION and click on the staff\nHad to read about are amazing crew of editors and producers [noise]\nAnd then there's the fight over how people may vote early voting starts today in North Carolina and it's so popular that more than half of North Carolina votes were cast early in two thousand sixteen\nFor two thousand Eighteen lawmakers altered the rules in ways that could lower turnout here's Alexandra open a member station WFSU ...\nPrepare for early voting election director\nSupport for Ninety points of a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nThese machines were meant to be inside early voting locations throughout the county but the new law requires all sides with any county to be open from ... to seven PM during the week and as a result raking can only open three sites this election\nEarly but he was very popular in ... county and and I would have loved to have more early voting locations it came down to having more locations you know helping more voters versus are British eerie responsibilities to the county\nSome democratic lawmakers see this as another attack on voting rights in a state where a voter id redistricting on early voting rules have all been struck down by the courts at various points in the last few years\nDuring a junior debate about really voting democratic state representative Amos quake said the requirement that if one side is open on the weekend the rats also have to be could discourage counties from having any weekend hours\nWeekend early voting as them for for and has been referred by a certain population and certain populations right to vote as not only in our life but it's been rejected in recent court decision\nHe's referring to black voters and appeals court ruled a twenty Thirteen law that among other things caught early voting by a week targeted African Americans with quote surgical precision but Republicans who champion this law argue they're only trying to minimize confusion here state representative David Lewis also during the Jim debate\nWhat we set out with the into use you to do is to be able to make you more reliable and dependable voters would know better as early voting site or side and their county was open for Mr Tom in the morning to sit on the evening\nThe law has some bipartisan opposition run riot is the Republican Party chair of ... county about fifty miles north of Charlotte the county has had to cut its early voting sites in half frustrated just or do though would use and he says even though they may not seem like an unfunded mandate\nThat's exactly what it translates to being at the end of the day\n... counties with smaller election budgets like ... are disproportionately affected by this change well individual locations maybe open longer there will be Seventeen percent fewer sites that selection MIT political scientist Charles Stuart that third says that for voters convenience Trump's hours\nAnd there's a lot of research has been done that suggests that whenever you move a polling place further away from a voter that are less likely to vote there\nStewart says the real change could simply shift turn out to election day which could mean longer lines at the polls and if they were voting rights have become such a political hot potato elections officials say they just go with the flow Becky Gallup Harris the elections director in ... county\nDue to court cases legislation all of that kind of thing factors in and it just seems like we always had some for each patient that\nTakes us in a different direction\nThe question remains will voters adapt as easily\nFor NPR News I'm Alex okay\nIt's NPR news\nThis is my viewpoints W. M. I. V.\nWe're public radio for all of central Florida but more importantly where your public radio stations we provide you with news we think you could use an entertainment we think you'll like\nAnd we ask you to help us provide that uninterrupted public radio news programming that you listen to every day by making a donation now on our silent Dr we're committed to more programming and less fundraising to help support this tradition of lessons fruits of fundraising\nBy visiting W. M. S. dot O. R. G. or call one eight hundred Seventy five twenty twenty call today and thank you\nSupport for an eight point seven news comes from Orlando Health this year almost two hundred and Seventy thousand women are estimated to be diagnosed with breast cancer but regular screenings and south exams can lead to early detection with early diagnosis breast cancer has a survival rate of better than Ninety percent learn more at our Leno health cancer dot com slash at risk to Orlando Health\nSupport for Ninety point seven news comes from UCF with the belief that being big goes beyond size\nAt UCF being big means being able to connect more people to work for the academics to thought provoking views to diverse cultures to lifelong friends and to life changing opportunities more information at UCF dot edu slashed big\nDon't miss the next Ninety point seven W. M. F. E. speaker series on Monday October twenty ninth\nDr ... doctor hang fish kind will present healthy finances discussion on how to fine tune your planning process for a better today and tomorrow for more information mentors repeated this free event go to W. M. F. E. dot org slash events\nPublic radio listeners contribute because they value\nThe programs they hear listener donations are the single largest source of revenue for Ninety point seven WMA or the that's why your financial support means so much right now make your contribution today during the silent Dr call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot org\n[noise]\nGood morning I'm Noel King earlier this month on October ... Christopher how long he was born in a hospital in Liverpool\nEngland was different that Philip mentioned the nurses that he shares his son's birthday\nTold them that his father was also born on October sixth\nOf BBC statistician puts those odds that one in one hundred and thirty thousand Phillip says his dad burst into tears when he heard the news family may want to consider buying some lottery tickets It's MORNING edition\nSupport for NPR comes from this station and from log me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com [noise]\nFrom indeed used by over three million businesses for hiring where employers can post jobs and your screener questions to build their short list of preferred candidates learn more it indeed dot com slash higher and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King there are reports of a surge of new Ebola infections and the Democratic Republic of Congo\nToday and emergency committee of the world Health Organization is meeting to advise on what the outbreak should be declared a public health emergency of international concern and ... dies in man has\nThe story that definitely they show has only sounded the alarm this way for times most recently in twenty sixteen when he got arrested in Latin America and before that in response to the twenty fourteen twenty Fifteen Ebola outbreak in West Africa that infected more than twenty eight thousand people\nThis outbreak and the ... has been much smaller about a hundred and eighty confirmed cases so far but\nIt's centered in a particularly challenging area\nTo Provence that have been more than Twenty years the shovel conflict\nPeter salon I as a top official with the ...\nIt has one million of eight million residents internally and it's a highly unstable acute potted Democratic Republic of Congo\nAnd armed rebel group called the allied democratic forces has been launching attacks on government forces UN peacekeeping troops and also civilians\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric locations to serve central Florida family more information including locations Arlene do health dot com slash kids\nA major effort to treat infected people and administer and experimental vaccine to anyone who had had contact with them the strategy started to show success\nAnd then what happened in September is we had seven or eight major attack\nViolent attacks by the rebels including one in a city called Benny where they killed more than twenty people mostly civilians\nThe population of and he just said enough is enough\nPeople who for years have felt completely abandoned by the government and the international community started turning against the health workers who were seen as an arm of the government people would say\nLook you can't even go to the uh physical security\nWhy should we go along with this unfamiliar anti Ebola campaign you're pushing\nNow salon stresses that the vast majority of people are still cooperating but rumors have started that the vaccination campaign is actually a plot to spread the disease members at a safe burial teams were attacked with rocks and severely injured and often after rebel attack whole neighborhoods shut down in protest\nWindow to to move in the streets of barricaded by young people sometimes burning ties are objects and sometimes the ... the ... or other weapons\nIn the last week and a half the effects of this has started to become clear with not just a rise in the number of new cases each week but ever more cases who contracted Ebola from someone the W. H. O. had not previously known about\nThat's the situation that the emergency committee that meeting today has been asked to assess David Hayman is an infectious disease expert in an advisor to the deli Late Show\nSome fielded by calling a public health emergency were increased political importance of the event will possibly increase the mobilization of\nThe deli they chose asked for thirty three million dollars to help neighboring countries prepare for the possibility of a spread across their borders and declaring this kind of emergency could also have a wider affect", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Orlando", "day": "17"}