{"month": "10", "state": "FL", "station": "WMFE", "content": "Family show your support for I'm interrupted programming donating a dollar a day because it W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty [noise]\nHow do you know when ... is an overdose reversal drug that sees thousands of lives in Philadelphia every year but knowing when to use it can be complicated\nCertainly if somebody is you know six foot four and there's like three hundred pounds you want to be very very careful how you wake up or shut up you have to be prepared to protect yourself on the next MORNING EDITION from NPR News [noise]\nJoined MORNING EDITION Monday morning from six on ... point seven W at my feet not even seven W and as the FM Orlando Melbourne Daytona Beach\nSupport for growing older I'm Ninety points on the news comes from Westminster communities of Florida offering choices an active senior living in Orlando with Westminster towers in downtown or land out in Westminster Winter Park in the heart of Winter Park more information about independent living assisted living\nNursing care and more is that Westminster communities F. L. dot org\nRunning up a rowing later the legacy of Robert Weber thing we didn't really start to live until doctors told him he was going to die\nFor doing this program your love for the same thing for the vital we have a reinvent or so [noise]\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been messy family\nDon't your support for uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nTo bring the blood pressure down but not about deny out it's about hey what can I eat that will lower my blood pressure naturally\nAnd if you want the best possible workout go to the playground not the gym\nThat that makes your memory better it makes you it makes you feel just absolutely germs to jazz revitalize\nSo what do you say revitalize your life isn't it time you started growing Boulder [noise]\n\nLive from NPR News in Washington I'm nowhere rom a multi faith service was held in Pittsburgh last night to remember the eleven people shot at a synagogue yesterday [noise]\n\nSix people were wounded I'm forty six year old man is in custody he's been charged with twenty nine federal counts including using a firearm to commit murder and hate crimes officials say he had posted several anti Semitic comments on line\nVice president Mike Pence condemned the shooting during a campaign appearance for the reelection of Nevada senator Dean Heller breeze ender from member station K. U. N. R. reports\nAnd arrived in Nevada capital Carson City in our later than scheduled citing the aftermath of the tragedy in Pittsburgh and also think law enforcement he responded ends mentions the four officers who were killed during the event which drew support in the crowd\nAnd attack on innocent Americans salt on our freedom of religion\nThere is no place in America for violence\nAnti Semitism this evil\n[noise] and stopping at northern Nevada City supports the CIO Pete attempt to attract rural voters multiple polls are showing Heller tight race against time congresswoman Jackie rose and prayed about it open Senate seat for NPR News I'm bringing down there in Carson City Nevada\nHas a caravan of Central American immigrants makes its way to the U.S border there is a search and the number of unauthorized immigrants being released from detention Texas Public Radio's David Martin Davies has more\nIt's three to Yemen but Alina shivering and the San Antonio a greyhound bus station she and her son were just released from the border patrol holding facility gallon for the center San Antonio\nThe Honduran citizens or as cold as it is at the bus stations it was much older letter which is what they called the ice ... sat in the last five days separated from her son but that is one of us committed several thousand immigrants were being released over the coming days by immigration\nStatement refund and Customs Enforcement says the releases are due to the limits for them by inaction in Congress for NPR News I'm David Martin Davies in San Antonio\nSaudi Arabia is rejecting Turkey's request to try to suspects and the killing of a Saudi journalist in Turkish court Peter Kenyon reports\nSaudi officials have acknowledged his show ... died and the Saturday consulate in Istanbul on October second but insisted crown prince Mohammed bin Salman had not ordered the journalist to be killed or kidnapped the Saudis have arrested Eighteen suspects and foreign minister Adel al Jubeir says his country will try and responsible and hold them to account\nPhotographic and other evidence appears to link several of the suspects to the crown prince and president rigid type aired one proposed trained them in Turkey the Saturday attorney general headed to turkey Sunday for talks with investigators\nPeter Kenyon this is NPR News\n... across the country covered local news and all those stories about your city is culture town hall and changes in your community there are all connected I'm Jeremy Hobson and local journalism means going into your neighborhoods schools and barbershops to talk to you\nWhen you link all those stories together you get a vivid picture of our country its people and the challenges we face take for an example education\nSchools across Oklahoma had been closed for nine days\nAnd in North Carolina thousands of teachers are expected to march on the state\nCounters in Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix you\nCan hear the bigger picture when you listen to NPR and when you get each month you help support local stories that unite our country keep the stories to connect our country coming become a sustaining member now\nThen you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG\nYour general supportive a dollar a day during this final Dr make sure the reliable need to know information on that point seven W. M. F. ...\nStings exactly where you expected to be please call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG once again one eight hundred Seventy five twenty twenty and things\nAt home at work or to stay connected when traveling you can stream Ninety point seven news and Ninety point seven H. D. to classical music my for my website W. M. F. E. dot org\nClick listen button and select the station you want to hear it that easy sponsored by Romans come or graduate school of business and Orlando Health\nSupport for NPR comes from NPR station other contributors include the corporation for public broadcasting and the state of John crock who's request serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. dot org\n[noise]\nBy folks I'm Mark Middleton along with Bill Schaffer and this is growing\nBoulder the program that celebrates hope inspiration and possibility at who doesn't want more\nOf that you ride mark on this program you'll hear from experts they'll bring the tools the examples of ordinary people living extraordinary lives to show you that it's within your reach to do the same our guests are all different but the take away every week is very similar you too can change your life you can improve your health\nYou can even reinvent yourself chase and catch your wildest dreams today you're going to meet a man who believes he has the simple solution to protecting the health of your brain plus we'll talk to the world's foremost expert on volunteerism and we've\nGot the world's greatest softball player on the most important single step you can never take growing boulders nutrition experts in registered dietitian doctors\nSusan Michel will join us with tips to lower your blood pressure\nShe is an award winning writer in broadcast journalist a well known face on ABC News for Thirty years but what you might not know if she's not only a swimming enthusiast she may be the world's most passionate swimming enthusiast she has written\nA great new book is receiving outstanding reviews from literally every major literary and media organization in the world\nIt's a love letter to swimming and all my eyes to the past time that continues to capture the hearts of young and old let's welcome the author of swim why we love the water Lynch sure Halen how are you\nI'm great how are you I'm so happy to be with you today\nWell thank you we were thrilled that have ya well let's talk about the book because you touch on all aspects\nFor Ninety point the news comes from Orlando how to cover the whatever whenever and wherever Orlando Health is dedicated to providing many pathways Akron care including nine hospitals ten emergency rooms and urgent care location in forty six ... tend to more information is that you really do not come\nOn prehistoric caves there are ... images of swimmers um there are at least two maybe more Egyptian hieroglyphics about swimming and\nSo it's really always been part of our lives you know I always say I'm there wasn't one of those um first brave person to eat an oyster moment it just\nIt's been part of our lives for ever since there were human so it goes way back and there were great swimmers in in ancient times as well that we know about for instance Julius Caesar was a very strong swimmer and famously\nAh one at least a battle or too because he was able to swim across the harbor when all the fighting was going on\nFrom that moment forward he has never needed anyone for anything to amuse himself [noise]\nNow in his early seventies he rides his elliptical bike industry and spends his days walking slack ropes throwing knives\nAnd jumping bear footed from rock to rock to rock Toronto [noise]\n\nSteven believes the key to a long and healthy life is play he has a simple philosophy that he calls never leave the playground and to prove it he's turned his property into a personal playground where he invents ways to keep his body and mind and child\nMy memory has become an absolute mayhem since uh since the beginning to do all this stuff um I don't forget things\nAnd he never falls he has the balance of a teenage circus performer something he's determined to teach others to stem the rising epidemic of life changing falls\nTwo million people are going to fall down and go to the hospital to Syria to the emergency room to fall and break your hip there's a tremendous number of the population is going to be dead near an eighty percent of people who've over sixty five fall and break a hip are never going to live independently again [noise]\nSteven believes the playground activities are as important for\nOlder adults as they are for young children because they build neural pathways grow brain cells develop balance in coordination and are key to preventing ... dementia hand bones breaking falls\nAnd when I get really good I can make them taller and I can step over please [laughter] maybe that's that's that's tough for your rent or you're a mad scientist I Am indeed\nStevens inventions include a skateboard that he's still ride daily\nAnd nobody's ever seen anything like this this is curved this way and it's also curves this way\nHe's also designed patented and build one of ... kayaks what makes it unique\nOkay it's comfortable like your couch at home it's talk that long and it weighs Fifteen pounds nine ounces which is extremely like carbon fibre an epoxy has been backing bag and take one of those great big coolers in the back so has carrying capacity it's fast and it tracks route\nAnd he invented and build what may be the most unusual pair of skates and the world\nI don't know if you can see that the word says ... rolls\nAnd it's a Japanese my name of course how many people you know they can do this I\nI don't know anybody personally can do it I have to do it yeah I'm going to demonstrate for if you want [noise]\nTo prove that he runs out into the street steps on the skates and takes off almost to your mother yelling now to get out of the street and away from the traffic [noise]\nEven has always been decreed as tight he's a retired college professor at a rundown ceramic artist\nI have a piece in the Smithsonian National museum and I still going around the country and teach it but I don't make power anymore but gorgeous thank you very much casserole and you have a DVD I have nine DVDs are sold all over the world I grab a hold on to that not\nSelling DVDs all over the world is one thing changing the world is another\nThing I Want to change the world I Want to keep people help people not be so falling Downey want them to help people would be better ... longer healthier richer lives\nTo overcome his sphere of falling you guy wires to support a vertical ladder so I learned\nThat I learned in doing this I overcame the fear 'cause I Would get up here in this thing ... around and I'm not used to juggling of wobbling around\nBack on the ground he jumps back and forth over a rail and throws the ball against the wall\nCatching my right throwing my left catching my left turn off my rights which pans\nHe believes developing your non dominant hand and foot is the key to building brain cells\nSometimes I throw [noise]\nAnd I've never seen anybody do that that's what this does it makes your memory better it makes you it makes you feel just absolutely juiced in jazz revitalize sufficiently jazz\nFor Ninety point at a news comes from Orlando Health covered the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nSession with jak alternating hands of course followed by Dick flipping\nThere's half turn left left hand\nThere's a full turn left hand\nFull turn left hats now I think I've got 'em all different life saving what is it too late for someone to start this stuff is that what you're like you can do it at any moment in time but these are things that old people can't learn no that's not so that's not so you can abs absolutely you can you can learn I\nHave people all fix are sitting down in a chair\nAnd they go like this they're sitting down a chair and they go like this and then and then maybe they maybe they up to ... up to distance like that and then then they stand up and do this and how and how can you go Oh nice things right here\nThey are so so so do you ever seen these things that don't bounce right right no no anyway I can do it\nQuick cans and educated feed Stephen Mader bored with a piece of pipe on the bottom and drilled a series of holes in the times that\nNumber down one two three four five and the reason I number to like that was to make the most difficult to roll around\nI thought this might be great for rehab and those guys coming back from war that are injured or that that Gabby woman that got you got her brain ruined by that horrific man out there in Arizona I thought about writing to her and\nSay and I could help you I can help you\nAnd you just do it you just do it and you didn't do it and you just do it as long as you can as long as you're comfortable\nIf juggling on a small bongo board is good Stevens figures juggling on her big bongo board is better I retired just trying to watch this guy's got to be exhausting living with them\nWhile I'm fifty five he's Seventy one and he runs circles around he's inspiring to me\nThe bowl that's what I've been saying for people to people for years and years be bold in your life choices because it's just going to be make your life richer\nAnd I do this with my eyes Shaq\nAnd I can drive to rush hour traffic on Seventy five right through Atlanta steering with my knee and during his hands of course he's\nKidding about that but his message is dead serious never leave the playground [noise]\nBecause it will develop\nNew brain cells it will cause you to be more creative will cause you to be more excited about life will improve your memory\nFriends that second the alarm goes off in the morning till the time we go to bed at night constant movement in activity\nAnd before he goes to bed every night even Jefferson learning theorists philosopher in better athletes and kid at heart writes in his journal and he admits the most days he writes pretty much the same thing today I'll write\nExquisite are perfect are wonderful\nThere is beauty in almost every day and almost every person's life and all you have to do is look for his there it's there to see and find out\nHow 'bout that guy is message as certainly struck a chord sense we produce that stories from people all over the world every one from doctors and researchers who confirming his theories to every day people who want to learn more about his simple games with the big results\nYou know we had lunch with Stephen recently and he said he thinks this story is going to change his life he's already in the early stages of producing a whole series of DVDs anyone of any age can improve their balance in less than the odds that they get Alzheimer's\n[noise] are you waiting\nFor your life's purpose to find you why not go find it Dr ... Richardson or two time Olympic gold medalist and arguably the greatest softball player whoever lived says the key is simply to believe in yourself and go chase what you law\nShe's amazing mark you know she says you have to be willing to fail because everybody does nobody has great at anything initially said don't let the doubts scare you way here's dot\n... dot Richardson two time Olympic gold medalist if you're waiting for your life's purpose to find you it could be a very long way to find the most success in happiness in life don't wait for the world to come to them\nYour passion is out there waiting for you to find it started to have I simply committing to try new things to get a little outside of your comfort zone for like at six fighting and rewarding\nAnd don't worry if you're not good at something nobody's good at something right away the important question is do you love it\nWhen you do more of what you live in posterity begin to flow into your life trust me [noise]\nNow where else are you going to get advice like that from a two time\nOlympic champion you can find more motivational tips\nFrom Dr ... Richardson and other incredible GB contributors all you have to do to find them is go to a growing Boulder TV dot com\nComing up the healing power of good and how you can tap into it this is growing\nBold support for grown older\nProvided by the center for health and wellbeing coming soon in winter park wellness fitness in medicine together in one convenient location offering programs and services to promote healthy living and positive aging more at your health and wellbeing dot org [noise]\nOh absolutely I I'm One of those that's never met a chocolate that I don't like [laughter] and I believe in\nMaking food real nutrition everyone eats and nutrition is about food it's not about do not do this and avoid that it's about learning to do what you can do to empower your health\nBut we do Susan don't we start to think of you know whenever we get our head oh boy you know I'm a little heavier than it should be your my numbers didn't come back that well from a doctor is it the first thought deny deny deny\nIt is I think people think okay I'll have to give up this I have to give up that and that's why I tell people that that diet really is a four letter word and then when you drop it to you feel like you're just going to roll over and die and really it's about food\nAnd looking at OK what can I switch out what little changes can I make what can I tweak says that I feel better and I don't feel like I'm deprived\nI was to move on and talk about that because we want to talk to you today about Susan if we can lowering our blood pressure doctors tell us step one is to cut are sold in sodium in\nThere we go denying again\nHow how much of our total sodium in take every day actually comes out of the salt shaker\nYou know you'll be surprised because most people think gosh if I just give up the salt shaker I'm going to be in great shape but really only twenty five percent\nOf your daily salt and sodium intake comes from the salt shaker so that makes a whopping Seventy five percent that's going to come from all the food that you eat and basically bottom line the more processed foods that you eat the higher the sodium level\nYou're one of those it says for I mean get rid of the processed food right\nYeah cut down as much processed food but the thing that's neat is that people think okay high blood pressure cuts sodium but actually what I Want to share is that you can actually add things to diet to bring the blood pressure down so it's not about denial it's about hey what can I eat that will lower my blood pressure naturally\nThat is why we liked Dr seuss [laughter] it's not about always what you don't need you can actually improve yourself by what you we\nGot a great example forty mark I mean the other than what I've stopped doing because I wanted to cut myself down instead of eating McDonald's French fries I Know have a Big Mac oh good choice\nThat you just like triple ...\nIf they're more salt in a package of fries than there are in a Big Mac\nYou know that when I asked people that's what they think but the truth as\nA Big Mac averages styles\nAnd ... a thousand milligrams of sodium now you're thinking okay what's that relative to well the average person needs about twenty three hundred milligrams a day but if you're fifty\nOr older that need drops to about Fifteen hundred so one Big Mac is two thirds of your sodium and take for the day where French\nFry an order of French fries contains less than four hundred milligrams I'm about three fifty\nBut many times that's because that salt is on the outside you taste it and it tastes salty but like in a Big Mac all the sodium contained within\n... is there and you know everyone today you know you go to some of the other fast food places and they go oh you can eat all you want because we put the salt on them instead yeah in a\nSea salt is no different I mean that they're I guess let me put it this way the crystals might be larger so there may be a little less sodium but it's still sodium say you still have to look at how much it uh how much of that that you're taking\nA doctor ... and Michel is with us now talking about ways to lower our blood pressure through our diet and document July I could be public enemy number one or at least as far as the chicken population is concerned because I eat a lot of chicken up\nJust as there are women out there was sailing enhanced breast use it true that some ... have been enhanced are pumped pumped up themselves with salt water solution\nExactly right in fact I I tell people that listen to my pod cast I say okay it's time to become a label slicks southern next time you go to the grocery store\nWhat I Want you to do is not just look at the nutrition facts label on the back that tells you how much sodium isn't something that you want to look for that really fine print it's on the front\nOf a a package of chicken I don't care if it's on an entire chicken if you're looking for a leg a brass but you want to see if it's been enhanced or pumped up with a saltwater solution and the reason I say that is that poetry that has not been enhanced will contain maybe fifty milligrams of sodium\nFor a four ounce portion well that's that's hardly anything but is that poetry has been enhanced or popped up pumped up with what usually chicken broth or water or a little salt then that sodium level jumps up to three hundred four hundred milligrams per four ounce serving\nYou may as well eat a Big Mac [laughter] go back to the beginning of our entire conversation 'cause you through something out there that that really caught my mind and and you said that there are some foods that we can add to our diets now that will help lower blood pressure like what what kind of food for your time is\nA little late and the first things I tell people yes don't forget about Saturday and it's important but let's talk about what you can add\nAnd number one would be the potassium rich foods what we know science tells us that diet slow and potassium seem to cause a rise in your blood pressure so when you consume potassium rich foods on a day to day basis as part of a healthy diet\nYour blood pressure may be reduced naturally okay now you're thinking where do I find potassium ... potassium rich the think fruits and veggies almost all of them so that raisins bananas tomatoes that's even tomato paste and tomato sauce spinach citrus potatoes things you might not think about\nSo when you cut processed foods and you bump on\nFresh fruits and vegetables guess what happens blood pressure lowers naturally\n... and other sources ah you know 'cause I read your blog every day Susan Mitchell dot org you mentioned calcium rich foods and omega three rich foods as well\nExactly and this is why the minerals potassium and calcium work in the body together they had a synergistic effect to lower the blood pressure so if you think of calcium where you're going to find that sure and and what we think of first that's going to be dairy so whether that's\nYogurt or cheese milk even calcium fortified products like orange juice\nOr soy and almond milk that have been fortified with calcium\nWhen you add the calcium in again you're lowering sodium but you're boosting up that calcium and the potassium ... together which have a natural blood pressure lowering effect just eating foods that you love\nHi I'm off on taking all of our president and general manager of made the point I mean do you imagine it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now and the families\nDon't your support for hunting corrupted programming donating a dollar a day when we ... call one eight hundred Seventy five twenty twenty\nDot org or you can check out her growing library of content on growing Boulder dot com she tells it like it is she's the one and only growing Boulder nutrition specialist Dr seuss and Mitchell\nDoctors didn't think he lived to see forty we'll find out how we did it and why he thinks being sixty might be the best age yet this is growing Boulder\n\nSupport for growing older reminded UCF College of medicine where physician scientist and teachers are discovering innovative solutions for today's medical challenges and bringing them to you learn more about the colleges position practice at UCF hell dot com\nSubscribe to a growing older magazines now with more information articles and photos than ever before\n... unlike any other film and the kind of inspiration you need to live your life to the fullest more information and growing older dot com slash subscribe\nThe following interview was recorded before the passing of our guest\n\n\nMark middle ... shaver is along side and you are listening to one of the most important most empowering shows on\nRadio growing Boulder because as you know there has never been a more interesting time to be alive and no it's not just about living longer because if you're sick nothing could be worse it's about the possibilities that exist for each and every one of us is\nIf only we embrace the challenges of aging and make the effort to live life to its fullest\nMan I Love it when you make those points smarter than writing really right on the money and we folks are far from the only people who feel that way one of the most vibrant and challenging voices out there\nHappens to be a wonderfully gifted writer who's lived a difficult and complicated life he's also a psychotherapist so his perspective on aging is fresh and vibrant and compelling\nOh did I tell you he's HIV positive and was expected to die over Twenty years ago\nWhen his new book is a great read it's called the new sixty outliving yourself in reinventing a future we're happy to say Hi to Robert dilemma than hey Robert how are you\nI'm just great and if I'm very excited about doing this program because your philosophy and my philosophy or basically the same thing yeah\nLive out live fully and excited Lee and and vitally in heaven and reinvent ourselves and embraces chapter and whatever age we're\nYou know you wouldn't think that it would be a tough sell but you know a week after week we come on you're trying to help help motivate people because really you\nCan be anything you want to be these days\nWell yes you know there's a wonderful fans", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Orlando", "day": "28"}