{"month": "10", "state": "FL", "station": "WMFE", "content": "They says the b._b._c. World Service were on an ... asks if some of them certainly can help feed Africa\nBrings money for what you do for higher\nYielding problem writing betters me\nMost farmers are out of the book I wanted to control so let me see let me just because you've lived in Africa\nAfrica for them to be the world\nDon't slash documentaries\nYou are listening to the b._b._c. World Service\nWashington for the most\nAre starting America correspondent Katie watches and warnings from Brazil\nOn your regional editor Mike ... is here in the studio or American editor counter to go traveling\nOn their own mind so\nMuch because this is the b._b._c. World Service the world's me do you think should [noise]\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been to the family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nToday Turkey's president promises a little\nAnd you're listening to it here on W. M. F. E. FM serving Orlando Melbourne Daytona Beach I'm Brendan Byrne at six o'clock good morning\nWhat does turkey really have an why has it apparently hesitated to relieve the full story and I'm Steve Inskeep\nAnd I'm Noel King former attorney general Eric Holder says gerrymandering is a threat to democracy with election day approaching he want Democrats to focus on winning the legislature which control how rational down front and then making millions arteries into one ... billion dollar if you think an office\nIf your best shot and I think again over twenty third resilience religion\nAnd the news is next\nLine from NPR News in Washington I'm corporate Coleman Turkish president ... type ... speaking to a Turkish lawmakers about the death of Saudi Arabian journalist democracy ... he says the investigation into the death will continue are the ones that that ... was the victim of a Savage murder\nMeanwhile news outlets report CIA director Gina Haspel is going to turkey to his desk information about the death\nTurkey's foreign minister is raising the possibility of the un investigation into ... genes death NPR's Peter Kenyon reports\nForeign minister ... ... tells the state news agency that turkey is continuing with its investigation into the show ... killing but would cooperate with an international pro possibly led by the United nations\nSaudi Arabia insisted for two weeks that showed you left the consulate freely before knowledge and friday that he was killed inside the consulate during the ... and without the knowledge of Saudi crown prince Mohammed bin Selma and according to Riyadh\nNewly released evidence seems to contradict that story including footage of consular officials burning papers today after ... visited and reports of phone calls from the consulate to the royal officers in Riyadh around the time of this killing Peter Kenyon NPR News Istanbul\nThe Supreme Court is temporarily blocking a court order that commerce secretary Wilbur Ross give sworn testimony in lawsuits over the new citizenship question on the twenty twenty cents is NPR's Hansi Lo Wang reports dozens of groups are suing the Trump Administration to get the question removed\nBased legal back and forth days leading up to the first potential trial over the citizenship question is expected to start in New York City on November fifth a lower court had allowed the plaintiffs attorneys to question commerce secretary Wilbur Ross about his decision to add the question at the twenty twenty cents at\nThe Chinese are looking for evidence to prove their claim that Ross misuses authority by adding a question that Census Bureau research suggest could harm the accuracy of the information collected from the census\nSupreme Court justice Neil Gorsuch however wrote in his own opinion that allowing the probing Ross his mental process he is quote highly unusual\nA court order allows the Trump Administration to file request to permanently block Ross his deposition or for the Supreme Court to hear the cases on the long NPR News New York\nFormer president bronco bomb it went to Las Vegas Monday to campaign for Nevada Democratic Senate candidate Jackie rose and Obama says that President Trump is trying to claim credit for an economic turnaround was already underway when Obama left office\nWe got the economy growing again we started the longest streak of job creation on record recovered another twenty million people on health insurance\nWe cut by more than half partly by making sure the American like me\nDemocrat Rosen is campaigning against incumbent Republican senator Dean Heller you're listening to NPR\nSupport for MPR terms for NPR stations other contributors include a constant contact who's automation feature allows small businesses to deliver emails or a series of email campaigns to their customers learn more a constant contact dot com and the any Casey foundation\nFrom Ninety point seven news I'm Brendan Byrne at six so for a rally was held at the University of South Florida in Tampa yesterday as W USF Bethany time reports it's a major democratic candidates came to gain support for their campaigns and to get out the vote\nFormer vice president Joe Biden was at USF Monday campaigning for Andrew Gillum and Bill Nelson\nThe stranger and other Democrats to talk about issues ranging from health care to school funding and needle walkers that her biggest takeaway from the event the importance of voting we do have to get out and vote that way down where it got to stay in the St Matthew Walker has been Norman likes if the candidates talks about what he called the real issues\nValues your commitment to them and it's inspiring to see that kind of leadership\nMany of the speakers encourage the crowd to go right from the event to the ... center next door the building opened up as an early voting site for Hillsborough County residents Monday morning I'm Bethany tied in Tampa\nBiden will be in downtown Orlando this afternoon for getting out the vote campaign\nOf Florida City commissioner has resigned after being charged in the fatal shooting of a man he accused of shoplifting hatch it from an Army Navy surplus store news outlets report forty seven year old Michael Dunn resigned yesterday from the lake with city commission a grand jury charged and friday with second degree murder of\nSurveillance video released to the public shows done shooting fifty year old crystal ball Lopez earlier this month\nThe video shows done holding a gun in his right hand while trying to get Lopez from carrying the hash it out of the store done grabs if is full of Lopez's shirt and Lopez's partly out the door raising the hatchet when done fires and Lopez falls dead and dozens attorney says the shooting was justified because Lopez was holding the ...\nMost Floridians undergoing addiction treatment news Medicare to pay for it that's according to data on the state's opioid epidemic presented today at a conference in like known up\nEpidemiologist seeing deep cassette says that's even though people with substance abuse problems are getting younger\nNationally it's still thirty five to fifty four year at age group but in Florida and a twenty five to forty four year old age group is seeing the impact\nCassette says throughout the count country more people use medicate to get rehabilitation and other substance abuse care but Florida is not Medicaid expansion state which means more people rely on other health insurance plans or pay out of pocket this was Ninety point seven news\nThe Capitol Steps are back nutty point seven WMA fees bringing the Capitol Steps the central Florida Thursday February twenty for some political fun show your supportive of silent drive by getting your tickets today\nVisit W. M. S. dot ORG or call one eight hundred Seventy five twenty twenty don't delays tickets went fast last time the Capitol Steps splitting the mock democracy this hilarious show is coming to trinity ... and you don't want 'em and\nHave fun and support nutty point seven WM at the at the same time during our silent Dr\nVisit WMA feed that orange juice that W. M. F. E. dot O. R. G. and things you\nTake a look at traffic sponsored by John mealy sports a Subaru I for east bound and west bound up to speed at this time also the toll roads are looking good\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now that you've been happy family\nDon't get support all uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nOr of a journalist but ... has put definite accusations on the record today he's addressing a meeting of his ruling party he's been talking of the death of ... Ga who walked into a Saudi consulate in Turkey on October second and never emerged\nThey're the ones who has his dad was a premeditated killing by Saudi Arabia ... g's native nation which has writings criticized the Saudi Government first set of knew nothing of his disappearance and then said ... died in a fight and that it is still investigating\nNPR's Peter Kenyon joins us from Istanbul Hi there Peter ... so what evidence as one put it on the table [noise] well ...\nSays the evidence that they have so far strongly suggests that this was a planned operation basically dismissing the Saudis story that it was an accident\nA one new thing that he said uh is that part of the evidence that they have is that the Saudi team that showed up in advance of the killing scout it out some areas possibly for disposal of a body including a forest in northeast is done ... uh and then he also ah in his remarks called on Riyadh\nTurn on your public radio station [noise]\nThis is NPR News\nAnd you're listening to it here on Ninety point seven news good morning I'm burned and burned it six Nineteen\nSupport for Ninety points have the news comes from UCF house where expert physicians care for the community was advance Castro in Toronto gene ... services UCF health provides care for complex GI conditions including inflammatory bowel disease daily activities\nAnd Mel absorption disorders and offers advance screening and treatment for chronic liver disease learn more at U. C. F. L. dot com still\nYour traffic sponsored by Tommy Lee sports do rely for east and west bound to lay free and up to speed\nOn the toll road monitor like Florida turnpike north found approaching county road for Seventy Leesburg the right wing bloc their due to construction Italy would have missed the south and what a garden violin wrote it just a boulevard one lane is lost due to a crash use a pop to Vineland road as your alternate\nSupport for Ninety point seven news comes from certified financial group working his ... for nearly forty years they're independent CSP professionals have been providing Center for the families with retirement planning and wealth management for these are they're registered investment advisor learn more financial group dot com certified financial group where they are planning tomorrow today\nRepublican Ron disadvantages in Democrat Andrew Gillum both want to be Florida's next governor and they're not afraid to mix it up\nAndrew couldn't keep Tallahassee safety is not the guy to keep Florida family say\nAll right we'll run as being dawn and that Donald Trump neglecting all sense of reason and facts\nComing up more on this heated race from NPR's Greg Allen that's coming up in about Fifteen minutes here on my viewpoints other news\nNinety point seven us is bringing capital steps back in twenty ninth is hilarious show will be coming to the press on Thursday February twenty some\nShow your support violent drive and get your tickets to the\nBusiness W. M. F. E. dot forgery for call one eight hundred Seventy five twenty twenty\nIt'd be a beautiful day weather wise today partly sunny sky just a slight chance of showers and late afternoon hot is reaching about the mid eighties\nSupport for NPR comes from this station and from log Meehan makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more Goto meeting dot com [noise]\nFrom the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles her family's experience of survival relapse and recovery starring Steve corral and Timothy shallow may now playing\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep much is at stake this fall as Americans vote for Congress for the long term there may be\nMore at stake in hundreds of races that receive little national coverage there were elections for state offices governors and state legislators and many many others they will have great influence in drawing election districts and those districts influence who can be elected to Congress another legislatures in the future\nPresident Obama's former attorney general Eric Holder announced the Republicans dominated that process after the two thousand ten sensors he leads a group trying to give Democrats influence after twenty twenty\nOne is the problem that you're trying to address but we're trying to deal with the problem of partisan gerrymandering and racial gerrymandering or we saw the Republicans\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support for uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nRational level and then so what we want to do with having twenty Twenty one a fair process by which people will draw lines that will include a Republicans and Democrats who are truly going to represent the the people\nLet's be blind when you say a fair process do you really mean because you're a Democrat won that is slanted more to Democrats than Republicans\n[noise] no I'm just looking for a fair process I I think that if we have a process that is fair Democrats and progressives as opposed to conservatives and Republicans will do just fine\nHow are you in this whole at least in part because as his critics would suggest President Obama didn't do much to build up the Democratic party to build up the bench at a time when Republicans and conservative groups were spending a lot of time and focus building up their batch [noise]\nNo I don't I don't criticize the president on that but I I Would say the Democrats I don't think really have focused enough at the state and local level to the degree that Republicans did and we have to reverse that we have to make sure that we are focusing on every race in every state um every time\nSo if your goal is a different map for legislative districts in twenty Twenty one what is at stake in two thousand Eighteen\n[noise] well we have at stake I'm a little less than half of the people who will be at the table in twenty Twenty one will be selected in twenty eight teams the governors who are elected them in twenty Eighteen and we will be serving for your terms will be intimately involved in the redistricting process in twenty Twenty one\nState legislators who are serving for your terms and who are elected in twenty eight team will be at the table in in twenty Twenty one so\nThe impact that we want to have one twenty Twenty one has to begin now in twenty Eighteen and obviously we have to have a good electoral effort as well uh in twenty twenty in addition to the lawsuits that we will be bringing and the independent commission efforts that we will be supporting between now and a twenty Twenty one\nWhat kind of money as your organization raising an hour you're distributing\nWe've raised I guess about a hundred for over thirty million dollars and we are distributing them the money\nWe look at everything through a redistricting land so governors always matter a state legislators matter but in certain states if you look at Ohio State auditor or the state secretary of state um they matter in certain places hum Supreme Court justices will matter so in North Carolina we're supporting and eat or else\nWho is running for the state Supreme Court is one of the reasons why we campaign so\nHard for Rebecca ... who won he Wisconsin's Supreme Court seat\nArgue campaigning for judges who are elected in many states with the explicit idea that these are judges who might someday rule the way you would like on a redistricting case\nThough oh I'm looking for or or judges who will look at the facts look at the law a and rule in a fair way not trying to pick the judges who will rule our way uh I'm confident that again if you put people on the bench you'll look at the the the laws as they have been written look at our constitution\nAs it has been written look at the state constitutions as a as they have been written that we will get rulings that will be acceptable to the people generally a ... and I think ensure a a a fair process\nOne other thing attorney general you received a lot of attention particularly in conservative media for a speech major mature ripped off a famous remark by Michelle Obama knew when\nThey go low [noise] they go low\nWe what did you mean or what I meant ... in that remark was that uh I Am going to stand up very forcefully against anybody who would try to undermine our democracy that the Democrats have to be tough when it comes to confronting people like that and all parties I'm like that\nAs you know there's a broad debate about how properly to be forceful is that something to be expressed through votes through protest through yelling at lawmakers have restaurants or something else what's appropriate [noise]\nWell I certainly think some votes through protests um I I must say that just personally I Would not be yelling at them\nLawmakers in in in restaurants going to go into their homes um you know I I'd be going act them at the ballot box I I think it was extremely powerful when women came out today after the Trump inauguration was very powerful when young people marched here I'm In Washington to\nHave four more same gun safety measures those are the kinds of ways I think in which the people should or should express themselves attorney general holder thanks so much and I think you [noise]\n\nAll right Steve mega millions lottery is up to one point six billion dollar billion billion with a B they're doing is set for tonight and yes as a very exciting that your chances our chances of that one in three hundred million\nNow some people come up with plans to improve their odds in a big one is getting a bunch of coworkers together and forming in office pool what about that\nOne in three hundred million is the famous twenty three hundred million I'm that both astronomical so the odds are basically the same\nJason Kirkland is a lawyer who represents jackpot winners and he says if your office pool does somehow when that is not necessarily good\nThere could be a lot of problems with office full\nYeah sometimes not everybody knows who's and the Grover out which could lead to some awkward conversations if you were to win and that's not all\nLived in Bob where people used to play in a group a long time ago and then somebody wanted a single and then the group went after them said no we're always playing together\nVery awkward but curling is not entirely against the office pools\nWell you know I understand why people do it because you know you'll feel terrible if you're off his wife and you didn't contribute just because you didn't like those I Would never say not to and I understand that there's always peer pressure because you don't want to be the one person left out so I'm not going to say not to\nBut he will say this that\nThe last thing in the art twenty people at twenty lawyers or going to court and fighting over this and tying the money up for years or or God Knows how much\nOne week to the day of the storm Ninety nine and a half percent of the people in my city had their power that\nThe recent hurricane in Tallahassee response to it does help put to rest of the tax Republican mounted about his leadership during hurricane her me two years ago\nIn his campaign speeches Gillum outlines of series of mainstream democratic and progressive proposals he wants to expand Medicaid under the Affordable CARE Act he wants to increase the starting salary for teachers to fifty thousand dollars and he wants to almost double the minimum wage in Florida to Fifteen dollars an hour\nEverybody I Know what's there aren't enough where they can take care of themselves and their family and maybe take a vacation when we get out of a year and that shouldn't be too much to ask and the fate of lord\nIf Gillum wins he'd be Florida's first black governor and ... says she likes scones progressive ideas his humility and his charisma his race she says shouldn't be a factor\nI Lived in Virginia for three years and I will tell you that Virginia is a very conservative state and we had a blackout Ritter and this is for heaven's sake\nA big deal race has been part of the campaign however talking about the state economy in August Republican Congressman Ron dissenters said voters shouldn't monkey this up by electing Gillum a comment many cold out as racist he's\nAlso had to defend his participation in racially charged conferences and this connection with a donor who made racist comments about President Obama\nDecided has made a campaign appearance this past weekend the favorite stop Republican candidates large central Florida retirement community villages\nTo American friendliest hometown [noise]\nThe villages is Trump country when asked about a third of those in the audience said they were part of villagers for Trump Sherry re drove over from nearby Ocala\nI have tremendous respect for what Donald Trump has done and I respect that he chose a Mr defense restaurant and and that's why I'm here I Want to meet him and hear more of what he has to say\nWell President Trump didn't actually choose decides to run his support has made all the difference is the\nPresident's endorsement and his appearance at a rally with the status in Tampa help boost the former congressman to an easy win in the primary since then the status has concentrated much of his campaign on attacking Gillum in his speeches dissenters calls Gillum a socialist and unfounded label Gillum rejects another line of attack by descent this has more substance\nAnd I'm the only one of the two of us who can credibly\nSay he's not under FBI investigation for corruption or the FBI\nIs investigating city contracts with developers in Tallahassee including one with whom Gillum went on a vacation to Costa Rica Gillum denies any wrongdoing and says the FBI told him he's not the focus of the investigation\nAnd is a tax the status is getting help from President Trump over the weekend the president tweeted that Gillum quote was one of the worst and most corrupt cities in the U.S dissent has picked up at the end begins skill him in a debate Sunday calling Tallahassee the most violent city in Florida\nAndrew couldn't keep Tallahassee safe he's not the guy to keep Florida family say\nAll right well Ron as being Don a and that's Donald Trump or neglecting all sense of reason in fact uh I presided over city that experience in a five year low in our crime rate on trajectory to be at a twenty year low\nPoll show it's a tight race early voting in Florida started Monday Greg Allen NPR News Miami\n[noise] and you can follow local coverage of that race and more on our Web site at W. N. F. E. Orlando you're listening to Ninety points that the News I'm Brendan Byrne it's six forty three\nSupport for Ninety points on the news comes on the table trust working to ensure opportunities for a successful employment for people with disabilities a skilled workforce for Florida's businesses\nThe able trashed and tell Herman education and planning on the land at ... dot org [noise] let's say like a\nTraffic sponsored by ... sports ... east bound delays from us twenty seven for twenty nine I for westbound slow and go from four thirty six to ... boulevard in orange county in ... north down to Kobe a pop the road between being in road in Keene road that\nIs shut down you want to use clerk Kona road or being in road as your alternate\nOn point seven WM after you get stories of inside\nThat make you stop and think this radio you want everyone you know to hear and his radio that exists banks to the general support of listeners like you contribute now to support the silo Dr call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot org\nComing up in the next ten minutes on the marketplace morning report the Trump Administration is rolling back elements of the Affordable CARE Act the goal is to make more affordable plans but without some important benefits like mental health services in prenatal care\nThat story plus all the morning's business news coming up on the marketplace morning report\nIn about ten minutes here on Ninety point seven news\nDon't forget there's lots of ways to listen to your public radio station be sure to download the W. NFC mobile app where you can listen live to your favorite programs wherever you go to that just popped into my ear buds and listened along\nAnd you can follow along with local headlines right through the up there as well we're heading over to W. N. F. E. dot O. R. G. and hit the listen live button in stay connected with us wherever you go today\nIt six forty five\nGood morning I'm Noel King he didn't stay in during to make the marriage for\n... ... even ... should be just fine the couple married this weekend at the thirty mile marker of Detroit marathon which they were running the grew more intense he does he served the bride\nOr a ... and the veil ceremony was quick to keep their muscles from freezing up and the newly wed finished together in a respectable for hours and forty seven minutes It's MORNING edition\n\nSupport for NPR comes from this station and from in need used by over three million businesses for hiring where employers can post jobs and use screener questions to build their shortlist of preferred candidates learn more and indeed dot com slash higher from log me in Maine\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician they're committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years or Leno health has over twenty pediatric location to therapy central Florida family more information including locations that are lean do health dot com slash kids\nUm [noise] and from listening was like you who donate to this NPR station\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep a popular young Michigan band makes many of their fans\nThink of a much older group ... NPR's Vince Pearson reports on the group that makes this so [noise]\n\nI'm Josh his gun I play the vocals I'm Jake ... on the guitars they're twins twenty two years old\nOr younger brother so based on what makes this family so talented\nMust be something about the water up their mind\n\nWe just talk about how noise in the house in Alabama [noise]\nOh yeah it was quite well we started in the basement of him and moved up to the garage is you know and then from there you know it was just sort of like bars or even up here [noise]\nYou got our shows in a van and where you went across the country from that started the momentum\nThat was actually at the top of last year ... things are grown so fast and so quickly it's almost a ... because it's unfathomable to watch you know [noise] like literally you started [noise] you got your van and started pouring record\n\nFor even releasing a full length album before member ban sent to straight songs to number one on one of billboards rock charts and they started getting all kinds of buzz\nGo the flow back style but very fresh Shelby\nMark Pennington this program director of rock station W. R. I Am from Detroit and an early supporter\nOf course the obvious rubber comparisons live there but there's ... to it and it's voices so unique and strong fall away\n[noise]\n... voice\nAwesome compared right of actually and not\nAlways favorably in fact many consider the Michigan band a total rip off\nI think people make the mistake assuming that we are offended by it or that we just like in any way might step when that's far from the truth [laughter] you know\nStill Josh says he never set out to sound like a lead up and say\nWhat I was initially trying to do is that the kind of see Wilson ... doing you know or Joe Cocker and that kind of thing but I found it was a lot easier to just being in a tight space over\nTop of everything else and if I were to sort of may get louder because we've got\n[noise]\nThe case the band seems to have found a good formula they're really an older listeners who still thrilled to seven dismissed out as well as younger ones who weren't there the first time around [noise]\nCreating rock and roll comfort says J our environment the current times about about influences are music and I think our generation and see that and they say oh this is rock and roll for us [noise]\nEight PM American public media\nIt's been a full two years since we first tried are less intrusive style of fundraising call the filing drive and this is how we do it now fill U M every\nFamily show your support for interrupted programming by donating a dollar a day because it W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty\nSupport for Ninety point seven news comes from the climate graduate school of business at Rollins College featuring Kramer's MBA program and the state's first accredited executive doctorate experience how in advance business degree from American help take your career further by joining their online into sessions on November sixth and seventh\nDetails can be found it Rawlins dot edu slash info sessions\nSupport for Ninety point seven news comes from the Florida department of state\nEncouraging Florida voters to be election ready by checking their voter registration status ensuring signatures are up to date reviewing sample ballot and knowing the election dates and voting options voting resources and information available at your vote Florida dot com get ready get set to vote\nWho did morning the U.S withdrawal from a nuclear missile tree comes just as missiles were more dangerous the prospect of super fast type responding in our MORNING EDITION\nAnd you're listening to it here on W. N. F. E. FM serving Orlando Melbourne Daytona Beach Brendan Byrne it's seven o'clock this morning\nSupport for Ninety point have the news comes from Orlando Health\nLeno health network a pediatrician that committed the children's health by being health care partners dedicated to their well being from birth to adulthood including this all important teenage years later how over twenty pediatric locations to serve central Florida family more information including locations Arlene do health dot com slash kids\nSome smaller cities are seeing some growth we report on the rise of Worcester, Massachusetts\nTobar twenty third day in Nineteen eighty seven when the U.S Senate rejected the Supreme\nCourt nomination of Robert Bork\nThe news is next\nLive from NPR News in Washington I'm core of a Coleman Turkey's president is making accusations and the death of Saudi Arabia and journalist ... president ... won his toe Turkish lawmakers there are many unanswered questions but speaking through an interpreter he says turkey does not believe this was an accident\nThe information [noise] Ninety evidence that we have so far collected [noise] indicates that Jim ... was slain in a vicious violent emerges\nCause show J died inside of Saudi Arabian consulate in ... after giving several different explanations including one that ... was still alive the Saudis now say he perished in a fistfight\nTurkey's president alleges the Saudis had taken away the cameras system inside the consulate before ... arrived and that a team of Fifteen Saudis was assembled waiting for him meanwhile news outlets report CIA director Gina Haspel is traveling to turkey to review intelligence about the matter\nPresident Trump campaigned alongside his one time Republican rival Ted Cruz on Monday NPR's Scott Horsley reports the cruise is facing a competitive reelection race in the traditionally red state of Texas\nAt a campaign rally in Houston Trump offered an unapologetic defensive is America First policies including pulling us out of an international climate agreement and slap steep tariffs on traditional trading partners\nIt's sort of\nAnd really we're not supposed to work you know what I Am I'm a nationalist with\nJust two weeks till election day job is emphasizing hot button issues such as border security and the Supreme Court at a possible side of the GOP tax cut is falling frat with voters Trump is recently been promising an additional tax cuts that so far little more than a slogan Scott Horsley NPR News Washington\nA judge in California is cutting the amount of money that pesticide maker Monsanto must pay to a man who sued the company over its weed killer roundup as NPR's Giles Snyder reports last August a jury determined that roundup caused the grounds keepers cancer\nThe decision by the judge in San Francisco comes in the first to come to trial of thousands of cases that have been filed over Monsanto's round up and ranger pro weed killers in August the jury found the products caused grounds keeper Dwayne Johnson cancer and awarded him two hundred and eighty nine million dollars last\nMonth a judge signal she may consider a new trial and the punitive damages portion of the word has Monsanto now owned by bear sought to overturn the verdict but Mondays ruling the judge said she was compelled to honor the jury's decision several had written letters or junior to uphold their verdict\nOr judge however reduce the amount of money Monsanto most paid jobs into Seventy eight million dollars drawn to his lawyers have until early December to accept the amount or seek a new trial trial Snyder NPR News\nThis is NPR support for NPR comes from the daily investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at the deli dot com slash wealth but that will be brokered services allows the and Americans for the arts and Americans for the arts dot org\nFrom Ninety eight point seven news I'm Brendan Byrne at seven for former vice president Joe Biden will be in Orlando today campaigning with US Senator Bill Nelson and other Florida candidates on the Democratic ticket not he points Evans the cold dark and crushed in has more\nFight in his in town for an early voting rally alongside Nelson Orlando mayor buddy Dyer congresswoman Stephanie Murphy and found endings and others on the November ballot the event aims to get people to the polls before election day though\nIt comes a day after early voting began in more than thirty Florida counties including orange seminal ...\nThe rally takes place at the Cheyenne saloon in downtown Orlando it's part of Biden's swing through the state he stands for democratic gubernatorial candidate Andrew Gillum yesterday in Tampa I'm Nicole dark and crashed in Ninety points seventies meanwhile\nRepublican governor Rick Scott lag six points behind Democrat incumbent Bill Nelson and the Senate race despite pouring millions of dollars into campaign advertising this is according to the latest Quinnipiac poll Shon ... reports\nRepublican governor Rick Scott is still trailing in Florida Senate race after hurricane Michael Monday's Quinnipiac poll find democratic Senator Bill Nelson lead shrunk just one point or last month\nThe survey finds Nelson carrying both independents and women by twenty points or more Nelson's lead is outside the three point five percent margin of error the Quinnipiac poll is at odds with at least two other recent surveys democratic pollster SEA gifts got a two point lead in St Pete polls show Scott ahead by less than half a point\nFor Florida public radio I'm Shaun okay\nThe number of Puerto Ricans who moved to Florida after Hurricane Maria may have been overestimated in previous studies media counts according to new research a new study released this month by the University of Florida's bureau economic and business research suggests that between thirty and fifty thousand islanders settled in Florida in the past\nYear earlier estimates from the University of Florida at Hunter College it put the number well above fifty thousand people those studies were based on things such as welcome center visit school enrollment female applications and cell phone data is Ninety point seven news\nHire more fun than all of our president and general manager of your station Ninety point seven W. M. F. E. and this is our silent drive\nIt's been a food two years since we first tried this less intrusive style of fund raising and this is how we do it now ... American family your contribution today helps pay for public radio news and programming without the pressure of commercial interests Ninety point seven W. M. F. you it's powered by\nShowing your support for uninterrupted programming during the silent DR Music W. M. F. U. dot org or coal wanting to hundred Seventy five twenty twenty thank you\nSupport for Ninety points at a news comes from Ron burger Kirk and called the litigation attorneys serving the business community throughout the state of Florida more at ... dot com\nTraffic sponsored by Tommy Lee sports super north down to kill your popcorn road between being in rodents Keane wrote this shutdown clerk ... wrote as your alternate in South down\nAvalon park boulevard past Waterford cheeks parkway all lanes or block used Woodbury road as your alternate [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King good morning Turkey's president has offered new details on the killing of journalist Jamal cause showed gene ... spoke to Turkey's parliament this morning it\nIs and it was not going to satisfy our jobs and all of a um it should really the really sort of shut down the road rationed by\nFew or to one also said that he has clear evidence that the killing was premeditated\nThe print for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital children had been caring for the children and teenagers in central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nAnd he left their conflict in Campbell alive now all of this back and forth has prompted many U.S officials to question the relationship between the U.S in Saudi Arabia one of those officials as Congressman Adam Schiff he's a Democrat in California and he's the ranking member of the house permanent select committee on intelligence\nRepresentative shifted many good morning good to be with you so what did we learn in are the ones who remarks today\nBut we learned that the Turks have additional details or only some of which they've shared with the public about the premeditated nature of this killing a that the team actually didn't all had over the same time that part of the team won over earlier and may have done reconnaissance in a forest to determine where to dispose of the body\nThis is NPR News and you're listening to it here on Ninety point seven news good morning I'm Brendan Byrne it's seven Nineteen\nSupport for Ninety point seven news comes from ... providing assurance tax and advisory services to clients in central Florida in around the world for over one hundred years offices in Orlando and Tampa more information is available online at ... dot com ... people who now no ... I\nThink like a traffic sponsored by ... sports Subaru in Orlando south down Avalon park boulevard just passed water for chase parkway two lanes are blocked their use Woodbury Roger alternate I for east bound stop and go from obey teach you Amelia street on the other side of things I for west bound slow downs from lake Mary boulevard to mainland boulevard\nSupport for Ninety point seven news comes from mid Florida credit union mid Florida is committed to offering a wide range of personal ... commercial banking products and services in the central Florida area more information is available online at mid Florida dot com mid Florida your community credit union\nJust ahead President Trump is threatening to cut off aid to Central American countries for not stopping a Caribbean caravan of migrants heading north\nI can only tell you this we give them hundreds of millions of dollars they do nothing for us\nComing up what steps the president might take and how members of Congress are responding that's coming up and about Fifteen minutes here on Ninety point\nSeven news does your morning routine include coffee breakfast maybe a drive to work does it also includes Ninety point seven W. M. F. E. Hi\nThis is David Greene co host of NPR's MORNING EDITION help keep this station strong into the future by calling one eight hundred seven eight five twenty twenty or you can go online at W. M. F. E. dot org\nPartly sunny skies today with a slight chance of showers in the late afternoon hides reaching about the mid eighties tonight mostly cloudy with a chance for change showers rather low sitting about Seventy degrees MORNING EDITION continues it's seven Twenty one\nSupport for NPR comes from the station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com [noise]\nFrom Amazon Web services used by millions of customers\nA ws provides a range of cloud services and functionality from tools to security to compliance more information at a ws is how dot com\nFrom ... a meal care company that delivers semi perhaps meals to be finished at home in Fifteen minutes with one paying gobble sous chefs due to prep work like chopping and marinating\nThis week's menu is a gobbled dot com slash MPR\nAnd from the any each case the foundation\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King when hurricane Michael plowed through southwest Georgia it hit that area's farms like a bomb cotton fields near harvest were blown bear and decades old pecan grove were leveled\nGBDs grant Blankenship visited a pie can't farm in southwest Georgia to see how the recovery is progressing\nTucked away in a corner of the time no pecan grove near the town of Pretoria Georgia is one of those things that Mitch Bolger says makes a living and working here is\nWorse than that is so this is talk\nOf about half a dozen water birds fly through cypress trees bordering a bubbling spring fed pool and yes this summer swimming hole is in fact cold oh wow [laughter]\nA lot of fun that gay\nBolger has been the farm manager at pine over Twenty years the family that owns the plantation is mostly scattered in Colorado in Rhode Island\nBut for Bolger this isn't the only home his kids who never know listening to everything which is why the scene that our backs hurts so much it's one of the thousands of the farms the country's lead lawyer by hurricane Michael and this one was a real money make us one of the oldest Fridays or he is\nThe print for any planes at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nAnd maybe Thirty years away the concert piled like gravel and address dream that between norm is tree trunks then that's it still be guided by hand if only someone would do the work\nI had a girl Monday in that now don't have a ... hour I paint them Tony ... they needed day\nThat's twenty five cents a pound and that works out to about twenty five dollars a day and an average year these nuts would have been headed to China not this year and now because of the weather but because of the U.S China a trade war now\nThat I Know that we can supply what\nThey're still money to be made in a group of far younger trees no it didn't escape\nDamage [noise] thousands of\nThese trees must be cut down to still ... says the younger trees are the long term future of the final plantation but in the short term\nYet those lean years gotten ahead of us and we'll you know will work around them\nWhich Bolger says that means re planting intending and waiting for decades and he's hopeful he'll see the pine pecan plantation sick with money makers again for NPR News I'm grant Blankenship in Pretoria Georgia\n\nNext we have news of a side effect of booming cities where housing costs are sorting and people are priced out people who can't buy an are moving to smaller cities think about San Francisco and Oakland [noise]\nYou know our Manhattan and Hoboken New Jersey which is a little bit cheaper\nOver the past few decades that process has brought big change to Boston and the town's surrounding to now a four hour west of Boston Worcester, Massachusetts is seeing its stock rise from W GBH radio in Boston Aaron Schachter reports on what could become a case study in urban growth\nA few years ago if you'd asked most people in Massachusetts their opinion of Worcester\nYou'd likely get an answer like this one from Michelle 'cause\nThere wasn't any place I'd ever come to make me nervous made me scared and my mother used to tell me all the time when I was a kid and stay away from what's inside nice place to be\nIt has something to the psyche I think of the city that it wasn't gonna wasn't gonna come back that this was just our faith ...\nCity manager and we're going to go to screw up here in points to Union Station as a symbol of Worcester is booming industrial revolution at the turn of last century\nOr the mid seventies it's ... ... there was also the gallery him all which was supposed to revitalize downtown but instead killed local businesses divided the city in half and then went belly up\nThere were a lot of silver bullet strategies over the years you know jeeze if we just make this project cap and this'll be the catalyst officials\nReally got to work and twenty ten by unifying the large park outside city hall and then demolishing the inferno mall Kate McAvoy a vice president for Harvard pilgrim health care is a fifth generation ...\nProperties are hot commercially poppies are hot residential eight everyone just wants a piece of West right now it's crazy\nIt's actually not crazy at all considering the forces at play Brian sergeant professor of public policy at UMass Amherst says there is a classic path for a smaller city to boom in Worcester is following the formula a whole lot quicker than anywhere else\nYou need a smaller city near a larger city um you need the largest city to get really expensive fast that's Boston you need to smaller seats are do through under development or a lot of times um post industrial depression didn't have the expensive city prices people out there will be some bleed over from their\nBoston is forty seven miles an hour train ride away making that bleed over a relatively easy commute this past spring average rents in Boston roast faster than any metro area in the country\nAnd that was on top of an already booming real estate\nMarket professionally it's a great place to be personally as socially it is just incredible\nThirty two year old Sam canary works for Morgan Stanley and lives in one of ... new downtown building he's minutes from a domestic airport since surrounded by nine colleges and universities including the state universities teaching hospital\nI Walk to work every day I see three or four nights a week the feed seen here is great\nThe social scene here is great\nBut I got to be here and I can access the world is right outside my doorstep\nThe city is experiencing booms in tech biomedical and specialty manufacturing\nCity officials have green led to point six billion dollars in recent construction new housing as well as retail end restaurant space and Worcester is finally growing after losing residents for much of the last century\nBut it's the residents already here who Danielle revere thinks about she's with the central mass housing alliance and says over the past twelve months rent and housing prices have risen too far too fast\nWe need to remember that we're pricing are out there that we are ... are young families out in order to have it like a really vital say we don't want to end up it's in crisis is that we're seeing in the Boston area\nThe root beer says the housing speculation so far hasn't extended much beyond the city center but she worries that it's only a matter of time before affordable housing goes the way of westerns once vaunted industrial manufacturing\nFor NPR News I'm Erin ... [noise]\nMigration activists hope to call attention to Central Americans suffering President Trump has used the caravan to stoke fear before an election he falsely spoke yesterday of plots to quote overwhelmed because a lot at stake he kept the caravan in the news by threatening to cut off aid to Central American country\nNow the aid that he threatened was actually designed to address the problem of migration that he was complaining about NPR's Michele Kelemen reports\nPresident Trump is sounding increasingly frustrated with how Central American countries are handling migration\nBought about ... cell Salvador's invested a lot of money every year we give a bar and they did not say for us not say he's\nNow warning those countries that he will start cutting off or substantially reducing foreign aid though some lawmakers are pushing back\nIt's like cutting off you know if you've ever been through here\nThat's Eliot Engel the ranking Democrat on the house committee on foreign affairs he says the president may be frustrated and angry about the caravan of migrants coming from those three countries and moving through Mexico but cutting aid will help\nMake the situation we're we we should be working with these countries to try to uh to help alleviate some of the problems are driving people to come to the United states is the first place\nUSAID in the region is meant to do just that addressing the root causes of migration by improving security and rule of law last year according to the U.S global leadership coalition the U.S provided amount eight hundred thirty eight million dollars in foreign assistance to Central America and Mexico\nAnd it is making a difference on the ground according to rich Jones who spoke to us from El Salvador where he works for Catholic Relief services\nIndustry the economics and we can fire you got completely interconnected starts very much in the interests of United States to see that development happen here that violent to reduce fear because it's pushing people\nInto Eurasian irregular migration\nThe Trump Administration is reviewing all USAID making clear to countries that receive assistance that they should support U.S interests congressmen angle points out that Congress holds the purse strings and he and his colleagues won't sit quietly by if the administration tries to go around the will of Congress\nWe keep hearing from the administration that everybody has to obey whoa how about the president or baby empowerment Control Act which prohibits the president from ... story or pounding money appropriated by Congress\nBut don't expect any quick moves on this as James Roberts a former foreign service officer now with the Heritage Foundation a conservative Washington think tank\nWhere dozens of programs in the three countries and they the Caribbean reviewed not all of them are effective manner you're too small in order to make a long term difference it's often difficult to measure them\nWhile Robert would like to thorough review he points out that it takes time and needs to be coordinated with Congress he also argues that it is in us interest to help these countries blue security and economic opportunities for people in the region to keep them home\nCannot begin to solve all the problems of these countries are they have to be from private sector holding them ... it's a very small piece of the puzzle\nThe state department won't say whether it has received orders from the White House to cut aid officials ad that they believe Central American governments are discouraging their citizens from taking the dangerous journey north Michele ... NPR News the state department\n[noise]\nThis is NPR News and you're listening to it here on Ninety point seven news good morning I'm Brendan Byrne it's seven forty three\nSupport for Ninety point seven news comes from Orlando Health this year almost two hundred and Seventy thousand women are estimated to be diagnosed with breast cancer but regular screenings and self exams can lead to early detection with early diagnosis breast cancer has its survival rate of better than Ninety percent learn more at our Leno health cancer dot com slash at risk to Orlando house\nLike a traffic sponsored by Tommy Lee sports Subaru on the toll roads feast bound for overweight delays from Kirk men to live for west bound goldenrod too high for us about a Fifteen minute rice for those areas there in South down on the for Seventeen stop and go from red bug lake wrote to university boulevard\nSupport for any point seven news comes from the UCF NBA CCF MBA offers\nFor schedule options in three location making a convenient for professionals who wish to pursue an accredited MBA while continuing their career path information about the UCF MBA including schedule options admission requirements and deadlines is available at UCF MBA dot U. C. S. dot edu\nJust ahead Ninety point seven economic analyst tank fish kind digs into building permits yes that's right building permits what can they tell us about the economic future state listening that conversation is just ahead\nJoshua Johnson the host of one a couple of sustaining member of W. M. F. E. during our silence drive your generator supportive a dollar a day to make sure the reliable need to know information on Ninety point seven W. M. F.\nE. stays right where you want it so please call eight hundred seven eight five twenty twenty or visit W. M. F. E. dot org\nThere's lots of ways to listen to your public radio station if you download the W. M. F. E. a mobile apps and listen live or on demand I'll stay connected with local headlines right in the actor or head on over to W. M. F. E. dot org at the top of the page will see a button that says listen live go ahead and cook it and you can listen to the programming throughout the day\n[noise]\nGood morning I'm Steve Inskeep ... on your car you should calmly pulled over on the same applies to planes Bryan Monroe is a flight instructor who was teaching the students to fly the plane lost power instructor took over for the involuntary descent and smoothly\nMerged into traffic on a freeway near San Diego passengers of a car captured the perfect landing on video although they're amazed profanity\nMeans we cannot play the south It's MORNING edition\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more it Raymond James dot com\nAnd from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges\nAt next dot U. F. L. dot edu\nSupport for Hank fish kind commentaries on not the point seven news is brought to you by the UCF executive development center\nEven sevens economic analyst tank fish kind says that\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician they're committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including this all important teenage years later how over twenty pediatric locations to serve central Florida family more information including locations Arlene do health dot com slash kid's\nGuide tells Ninety points Evans Nicole dark and crushed in about new data on building permits and the sunshine state and what it can really tell us\nBuilding permits or up twenty three percent so far this year compared to twenty Seventeen and that's propelled by thirty six percent increase in multifamily permits a multi family includes apartments and condominiums nickel wow at twenty\nThree percent increase overall powered by a thirty six percent jump in multifamily permits that sounds really strong to me is that sustainable\nWell permit volume is that a hundred and forty thousand per year and that is sustainable because it would house roughly three hundred and fifty thousand people were just basically what our population growth is\nBought a further growth rate of twenty percent or more in twenty Nineteen would really cost them over building because then we'd over shoot are there any signs of over building yet\nNot yet at the statewide level McCall but there really are some troubling spots showing up ... like where well like Miami a condominium marketers overbuilt now and you know we we've discussed that in sipping over building for a number of\nWeeks and it's just getting worse not better permitted volumes up thirty five percent in Miami based on a forty one percent increase in multi family permits wow\nYeah and so at the current rate there'll be Thirteen thousand five hundred and twelve permits issued which is enough to house thirty seven thousand a hundred and fifty people but population growth is not even going to be twenty five thousand people\nSo that puts an extra five thousand multi family units into a market that already overbuilt multi family units this a fourteen month inventory of multi family units for sale the equilibrium levels we've discussed\nIs six months yeah so you know here's another five thousand units plopped onto a overbuilt marketplace wow yeah what about here in Orlando housing market doing here now\nWell it's a very strong I mean permit volumes of fifty three percent in Orlando over twenty Seventeen propelled by a hundred and sixty six percent jumped the multi family permits that's mostly apartments\nAt this pace total permit volume in the Orlando metropolitan area nickel will top twenty nine thousand and that's enough to house Seventy five thousand people and that's much higher than my population projections that yeah so ... that result in over building\nMaybe [laughter]\nYeah well there's a lot\nOf this this catch up as have spoken we've had this huge ... jobs in population and all that had a big movement from Puerto Rico\nAnd we haven't had the increase on the supply side right to catch up over the last few years so I think that there's some pent up demand still in the marketplace and this catch up will be very helpful but you know if this pace of permitting continues especially for apartment construction\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been to the family\nDoes your support all uninterrupted programming but donating a dollar a day the W. M. S. dot org or cold one hundred Seventy five twenty twenty\nLittle become known as advent health with a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you to learn more at the end health dot com [noise] start\nA conversation with your public radio station you can tweet us at W. M. F. E. Orlando sweet me I'm at space Brendan love to hear from listeners especially when I'm here in the studio all by myself early morning or you can find us on Facebook we're at W. M. F. E. mighty pointer\nSupport for Ninety point seven news comes from\nUCF with the belief that being big is just the beginning with more than eighty online degree programs UCF provide students near and far with access to high quality education on their own schedule more information is available at UCF dot edu flash on line who\nMorning Turkey's president put on the record evidence that the Saudi killing of a journalist was premeditated the advances search for a place\nAnd you're listening to it here on W. M. F. E. FM Orlando Melbourne Daytona Beach I'm Brendan Byrne it's eight o'clock good morning\nOr just President Juan did not say all his investigators may know but raised questions about the Saudi role I'm Steve Inskeep and I'm Noel King\nFormer attorney general Eric Holder says gerrymandering is a threat to democracy with election day approaching he wants to Democrats\nOn winning state legislature which control how congressional districts are drawn and then making millions lotteries one point\n... dollars if you think an office pool is your best shot I think again she's over twenty third Brazilian soccer legit pain can be eight years old today and the news is next\nMine from NPR News in Washington I'm core of a cold Turkey's president is making new claims and the death of Saudi Arabian journalist ...\nSpeaking of Turkish lawmakers president ... type ... says he believes ... was viciously murdered\nThe journalist disappeared this month after entering a Saturday consulate in Istanbul the BBC's mark low and reports from Istanbul president airline is calling on Saudi Arabia to disclose who ordered ... killing\nPresident as one had promised the naked truth behind what Chuck he believed was the premeditated murder of ... but his speech gave badly more detail than we knew he said hard drives in Saudi come see led were removed before the killing but there was no mention of the recordings of the killing tech you said to have\nThe president did say he wanted Eighteen Saudis arrested by react to be tried in Istanbul out into the international community wouldn't believe the Saudi narrative of the road corporation\nThe BBC's mark low and CIA director Gina Haspel is going to turkey to review information about ... genes death\nThe Supreme Court is temporarily blocking a lower court ordered that would have forced commerce secretary Wilbur Ross gets sworn testimony about the upcoming twenty twenty cents as an issue is a controversial citizenship question\nAs NPR's Nina Totenberg reports the Census Bureau hasn't asked this a ball households for decades because it may be intimidating enough to threaten the census is accuracy\nDozens of state and local governments went to court to challenge secretary Russia's edition of the citizenship question contending that it was at it for political purposes documents produced in the lawsuit showed the contrary to earlier assertions Ross had in fact consulted with the White House\nOn the citizenship question over ruling the recommendations of the career staff at the Census Bureau\nWas a trial and the issue scheduled for the first week in November the Trump Administration is pulling out all the stops to prevent secretary Ross and others from being forced to answer questions under oath and the Supreme Court temporary order has all the earmarks seven eventually win for the administration\nNina Totenberg NPR News Washington\nThousands of Central American migrants are crossing into southern Mexico and pushing on their goal is to southern us border [noise]\nOr the Trump has been furious over the migrants claiming without evidence that the group is the work of Democrats\nHe's also raised the specter of terrorism claiming that there are people who are Middle Eastern in the group of thousands again he offered no evidence to support this and reporters have not verified this claim\nTrump is threatened to cut us aid to El Salvador Guatemala and Honduras if they don't stop the migrants he's further threatened to seal the southern us border with the help of the U.S military\nBut there's no evidence he's taken steps yet to do this [noise] this is NPR\nSupport for NPR comes from NPR stations other contributors includes Subaru featuring the all new with three row is sense with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a super learn more at Subaru dot com\nFrom Ninety point seven news I'm Brendan Byrne it's eight or for a rally was held at the University of South Florida in Tampa yesterday as ... as Wu ss Bethany Tyne reports some major democratic candidates came to gain support for their campaigns and to get out the vote\nFormer vice president Joe Biden was a U.S that's Monday campaigning for Andrew killing and Bill Nelson the three joined other Democrats to talk about issues ranging from health care to school funding and needle walkers that her biggest takeaway from the event the importance of voting\nWe do have to get out and vote that way down we're going to stay in the same map\nWalkers has been Norman likes the candidates talks about what he called the real issues\nAre values shared commitment to and it's just far agency that kind of leadership\nMany of the speakers encourage the crowd to go right from the event to the ... center next door the building opened up as an early voting site for Hillsborough County residents Monday morning I'm Bethany time in Tampa\nBiden will be in downtown Orlando this afternoon for get out the vote campaign event as well\nMost Floridians undergoing addiction treatment use Medicare to pay for it according to data on the state's opioid epidemic presented today at a conference in lake known up epidemiologist Sunday cassette says there's that even though people with substance abuse problems are getting younger\nNationally it's still thirty five to fifty four year at age group but in Florida a twenty five to forty forty at age group is seeing they impact\nCassette says throughout the country more people use medicate to get rehabilitation other substance abuse care but Florida is not Medicaid expansion state which means more people rely on other health insurance plans or pay out of pocket\nOr Florida City commissioner has resigned after being charged in the fatal shooting of a man he accused of shoplifting hatch it from an Army Navy surplus store news outlets report forty seven year old Michael Dunn resigned yesterday from the Lakeland city commission\nA grand jury charged him friday with second degree murder this is Ninety point seven news\nI'm Mark Mehmet while he's editor once wrote that the media in the public should prove that they're lucky to have each other every day has the standards and practices editor to NPR my job is to help prove how lucky we are to have you by making sure ...\nSupport for Ninety points or the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nIt's easy to support ... point seven WMA every during the silent Dr ... W. M. F. E. dot O. R. G. or call one eight hundred Seventy five twenty twenty once again W. M. F. E. dot O. R. G. and thank you\nLet's say look a traffic sponsored by John mainly sports Subaru on the beach line east bound five twenty eight a crash has one lane block just Penn State road five twenty critically about ten minute delay use five twenty as your alternate their\nEyes for eastbound there is a crash approaching state wrote for thirty four with one lane blocked it's causing some delays in area there as well I for west bound break lights from lake Mary boulevard to\nMainland boulevard MORNING EDITION continues it's eight or eight [noise]\n\n[noise] It's MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep good morning it would be going too far\nTo say that Turkey's president says disclosed everything he knows about the murder of a journalist but ... has put definite accusations on the record today he's addressing a meeting of his ruling party he's been talking of the death of ... Ga who walked into a Saudi consulate in Turkey on October second and never emerged\nEveryone says this death was a premeditated killing by Saudi Arabia ... g's native nation which his writings criticized the Saudi Government first said it knew nothing of his disappearance and then sent to show she died in a fight and that it is still investigating\nNPR's Peter Kenyon joins us from Istanbul Hi there Peter ... so what evidence as one put on the table\nWell he says the evidence that they have so far I strongly suggest that this was a planned operation basically dismissing the Saudis story that it was an accident\nA one new thing that he said uh is that\nPart of the evidence that they have is that the Saudi team\nThat showed up in advance of the killing scout it out some areas possibly for disposal of a body including a forest in northeast is ... uh and then he also ah in his remarks called on Riyadh or to allow the Eighteen people they've arrested in connection with the show ... death\nTurn on your public radio says\nLocal member station is W. M. F. E. you're listening to Ninety eight point seven news I'm Brendan Byrne it's eight Nineteen\nIt's been a full two years since we first run are less intrusive style of one reason why we drive and this is how we do it now WM every family show your support for interrupted programming white donating a dollar a day does it W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty\nYou're driving sponsored by ... Subaru got a crash I for east about approaching state road for thirty for the right wing is blocked they're talking about a Fifteen a delay all the way back to meet Lynn boulevard I for west found congestion approaching for thirty four to meet one boulevard\nAnd on the beach line there's a crash east bound just pass state road five twenty has one lane block there by ten minute delay there you want to use five twenty as your ultimate\nSupport for Ninety point seven news comes from Medicare Medicare is dedicated to providing a team of health care professionals that are built around the patient needs and will be with them every step of the way more information is available\nOne eight six six nine eight seven six two to four four at ... dot com\nJust ahead Republican Rhonda stances and Democrat Andrew Gillum both want to be floors next governor and they're not afraid to mix it up\nAndrew couldn't keep Tallahassee safety is not the guy to keep Florida family say All right well Ron is being done and that's Donald Trump neglecting all sense of reason and facts\nComing up more on this heated race from NPR's Greg Allen is coming up in about Fifteen minutes here on Monday point seven news support\nFor Ninety point seven news comes from teeth out people's gas natural gas heat pumps may help contribute to air conditioning resiliency for consumers and businesses in Florida found reducing our carbon footprint more information about natural gas can be found at people's gas dot com slash G. H. P.\nShaping up to be a really nice day weather wise partly sunny sky so they just a slight chance of showers and late afternoon hours reaching only the mid eighties\nSupport for NPR comes from this station and from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide\nWith email template uh dragon drop email editor and twenty four seven customer service Morris campaign monitored dot com\nFrom it laughing a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at Lausanne dot com\nAnd from Hitchcock's insurance providing customized insurance for small and medium businesses so they can\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support one uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nAnd they sent them NPR News I'm Noel King\nAnd I'm Steve Inskeep much is at stake this fall as Americans vote for Congress for the long term there may be more at stake in hundreds of races that receive little national coverage their relations for state offices governors and state legislators and many many others\nThey will have great influence and drawing election districts and those districts influence who can be elected to Congress and other legislatures in the future\nPresident Obama's former attorney general Eric Holder announced that Republicans dominated that process after the two thousand ten cents as he leads a group trying to give Democrats influence after twenty Twenty one is the problem that you're trying to address\nWhat we're trying to deal with the problem of partisan gerrymandering and racial gerrymandering or we saw the Republicans in twenty eleven use the power that they got in the ... election in the redistricting that occurred the year after\nTo draw gerrymandered seats at the state level as well as the congressional level and then so what we want to do with having twenty Twenty one a fair process by which people will draw lines that will include a Republicans and Democrats who are truly going to represent the the people\nLet's be blood when you say a fair process do you really mean because you're a Democrat won that are slanted more Democrats than Republicans\nNo ah I'm just looking for a fair process I I think that if we have a process that is fair Democrats and progressives as opposed to conservatives and Republicans will do just fine how\nAre you in this whole at least in part because as his critics would suggest President Obama didn't do much to build up the Democratic party to build up the bench at a time when Republicans and conservative groups were spending a lot of time and focus building up their bench\nNo I don't criticize the president on that but I I Would say the Democrats I don't think really have focused enough at the state and local level to the degree that Republicans did and we have to reverse that we have to make sure that we are focusing on every race in every state um every time\nSo if your goal is a different map\nFor legislative districts in twenty Twenty one what is at stake in two thousand eighty\n[noise] well we have at stake I'm a little less than half of the people who will be at the table in twenty Twenty one will be selected in twenty Eighteen the governors who are elected 'em in twenty Eighteen and we will be serving for your terms will be intimately involved in the redistricting process in twenty Twenty one\nState legislators who are serving for your terms and who are elected in twenty eight team\nWill be at the table in in twenty Twenty one so the impact um that we want to have one twenty Twenty one has to begin now in twenty Eighteen and obviously we have to have a good electoral effort as well in twenty twenty in addition to the lawsuits that we will be bringing\nAnd the independent commission efforts that we will be supporting between now and a twenty Twenty one\nWhat kind of money as your organization raising an hour you're distributing\nWe've raised I guess about a hundred over thirty million dollars and we are distributing them the money\nWe look at everything through a redistricting land so governors always matter\nA state legislators matter but in certain states if you look at Ohio State auditor the state's secretary of state um they matter in certain places hum Supreme Court justices will matter so in North Carolina we're supporting an IED or else\nWho is running for the state Supreme Court is one of the reasons why we campaign so hard for Rebecca ... who won a Wisconsin Supreme Court cease\nFire you campaigning for judges who are elected in many states with the explicit idea that these are judges who might someday rule the way you would like on a redistricting case\nThough oh I'm looking for or or judges who will look at the facts look at the law a and rule in a fair way not trying to pick judges who will rule our way uh I'm confident that again if you put people on the bench you'll look at the the the laws as they have been written look at our constitution\nAs it has been written look at the state constitution says they have been written that we will get rulings that will be acceptable to the people generally a ... and I think ensure a a a fair process\nOne other thing attorney general you received a lot of attention particularly in conservative media for a speech your major mature ripped off a famous remark by Michelle Obama knew when\nThey go low [laughter] they go low\nWe can what did you mean but what I meant ... in that remark was that uh I Am going to stand up very forcefully against anybody who would try to undermine our democracy that the Democrats have to be tough when it comes to confronting people like that all parties I'm like that\nHas you know there's a broad debate about how properly to be forceful is that something to be expressed through votes through protest through yelling at lawmakers at restaurants or something else what's appropriate [noise]\nWell I certainly think ... votes through protests um I I just say that just personally I Would not be yelling at them\nLawmakers and in restaurants going to go into their homes um you know I I'd be going hack them at the ballot box I I think it was extremely powerful when women came out today after the Trump ... who's very powerful when young people marched here in Washington to\nAsk for more is saying ... gun safety measures\nThose are the kinds of ways I think in which the people should or should express themselves\nAttorney general holder thanks so much ... thank you [noise]\n\nAll right Steve the mega millions lottery is up to one point six billion dollar billion billion with a B they set for tonight and yes it's a very exciting that your chances our chances of that one in three hundred million\nNow some people come up with plans to improve their odds in a big one is getting a bunch of coworkers together and forming in office pool what about that\nOne in three hundred million is the famous twenty three hundred million I'm that both astronomical so the odds are basically the same\nJason Kirkland is a lawyer who represents jackpot winters and he says if\nYour office pool does somehow when that is not necessarily good\nThere could be a lot of problems with office pools\nYeah sometimes not everybody knows who's in the Grover out which could lead to some awkward conversations if you were to win and that's not all\nLived in Nevada where people used to play in a group a long time ago and then somebody wanted a single and then the group but after that I Would say no we're always playing together\nVery awkward but curling is not entirely against office pools\nWell you know I understand why people do it because you know you'll feel terrible if you're off his wife and you didn't contribute just because you like those I Would never say not to understand that there's always peer pressure because you don't want to be the one person left out so I'm not going to say not to\nBut he will say this that the last thing in the art twenty people at twenty lawyers are going to court and fighting over this and tying the money up for years or God Knows how much\nOne week to the day of the storm Ninety nine and a half percent of the people in my city had their power back\nThe recent hurricane in Tallahassee response to it has helped put to rest attacks Republican mounted about his leadership during hurricane her me two years ago in his campaign speeches Gillum outlines a series of mainstream democratic and progressive proposals he\nWants to expand Medicaid under the Affordable CARE Act he wants to increase the starting salary for teachers to fifty thousand dollars and he wants to almost double the minimum wage in Florida to Fifteen dollars an hour\nEvery body I don't want to earn enough where they can take care of themselves and their family and maybe take a vacation when we get out of a year and that shouldn't be too much to ask\nIf Gillum when he'd be Florida's first black governor and ... says she likes scones progressive ideas his humility and his charisma his race she says shouldn't be a factor\nI Lived in Virginia\nFor three years and I will tell you that Virginia's very conservative state and we had a blackout return for heaven's sake\nDeal race has been part of the campaign however talking about the state economy in August Republican Congressman Ron dissenters said voters shouldn't monkey this up by electing Gillum a comment many called out as racist\nHe's also had to defend his participation in racially charged conferences and this connection with a donor who made racist comments about President Obama\nDissent has made a campaign appearance this past weekend the favorite stop for Republican candidates large central Florida retirement community villages\nTo America as friendly as hometown [noise]\nThe villages is Trump country when asked about a third of those in the audience said they were part of villagers for Trump Sherry re drove over from nearby Ocala\nI have tremendous respect for what Donald Trump has done and I respect that he chose a mystery fan Chester runs and that's why I'm here I Want to meet him and hear more of what he has to say\nWhat President Trump didn't actually choose dissenters to run his support has made all the difference the\nPresident's endorsement and his appearance at a rally with the status in Tampa help boost the former congressman to an easy win in the primary since then decide as has concentrated much of his campaign on attacking Gillum in his speeches dissenters calls Gillum a socialist an unfounded label Gillum rejects another line of attack by the status has more substance\nAnd I'm the only one of the two of us who can credibly say he's not under FBI investigation for\nCorruption or the FBI is investigating city contracts with developers in Tallahassee including one with whom Gillum went on a vacation to Costa Rica\nGoing denies any wrongdoing and says the FBI told him he's not the focus of the investigation\nIn his attacks the status is getting help from President Trump over the weekend the president tweeted that Gillum quote was one of the worst and most corrupt cities in the U. S. D. status picked up the theme against Gillum in a debate Sunday calling Tallahassee the most violent city in Florida\nAndrew couldn't keep Tallahassee safe he's not the guy to keep Florida family say All right well Ron as being Don a and that Donald Trump or neglecting all sense of reason in fact uh I preside over a city that is experiencing a five year low in our crime rate on trajectory to be at age twenty year low\nPoll show it's a tight race early voting in Florida started Monday breakout when NPR News Miami\n[noise]\nAnd you can find more news about\nRace and other races throughout Florida on our website at W. N. F. E. dot O. R. G. good morning I'm Brendan Byrne you're listening to MORNING EDITION here on Ninety point seven news is eight forty three\nSupport for Ninety points at a news comes on the lake whales museum presenting the forty third annual pioneer days festival this Saturday and Sunday October twenty seventh and twenty eight on the shores of lake with different then it's open to the public and celebrate that communities history with heritage are historic tours and other family friendly events more ... city of like ... dot com\nSingle traffic sponsored by ... sports Hebrew I for east on we've got a crash approaching state road for thirty four with a right wing bloc they're causing delays all the way back to ... boulevard you can use why were road Seventeen Ninety two or four thirty four as you're altering their\nEye for west bound things are moving along All right except for a small pocket of delays from state route for thirty four to mainland boulevard about a Fifteen minute ride their\nSupport for Ninety point seven news comes from citizens property insurance whether recovering or preparing for the next storm that may affect central Florida citizens is available to their customers claims can be attracted more information is available online at citizens ... dot com\nOr report it twenty four seven my calling alive citizens representative\nJust ahead tonight is the drawing for the mega millions the largest jackpot in us history\nWell whether you win the big prize is up to chance how the ... got to be so huge was a deliberate choice that story plus all the morning's business news coming up on the marketplace morning report about ten minutes here on Ninety point seven news\nEvery word count in public radio ham Rachel Martin and when we're working on a story we check our facts and ... our words carefully we do it because accuracy and worry ... here's how you can show accurately as matters to use to call one eight hundred and Seventy five twenty twenty or did it W. N. F.\nE. dot org thanks so much beautiful day where\nHi I'm up on taking all of our president and general manager of might be point seven W. M. S. it's been a for two years since we first tried this less intrusive style the fundraising called fire with Dr ... how we do we now have you been maybe family\nThrough your support and interrupted programming donating a dollar a day with him every dot org or cold one hundred Seventy five twenty twenty\nGood morning I'm Noel King eating said that he came in during to make a marriage\nWell when he black enough even till it should be just fine the couple married this weekend at the thirty mile marker of the Detroit marathon which they were running the grew more a tuxedo T shirts to bribe\nOr a ... or end a veil ceremony was quick to keep their muscles from freezing up and the newly wed\nFinished together in a respectable for hours and forty seven minutes It's MORNING edition\nSupport for NPR comes from the station and from the candy to fund reporting individual dignity and sustainable communities are investments and transformative leaders and ideas learn more at ... dot org\nFrom American Jewish World Service working together for more than Thirty years to build a more Justin equitable world learn more is AJ W. S. dot ORG\nAnd from the Jacob ... foundation supporting the health and wellbeing of underserved populations at ... dot org\n\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep a\nPopular young Michigan band makes many of their fans think of much older group\nLed Zeppelin NPR's Vince Pearson reports on the group that makes this child\n[noise]\nI'm Josh his gun I play the vocals I'm Jake ... on the guitars they're twins twenty two years old\nOr younger brother so based on what makes this family still count\n[noise]\nWe just talk about how the way through the house now been\nOh yeah it was quite loud and we started in the basement and then moved on to the garage you know and then from there you know it was just sort of like bars or even a few\nYear ... van and we went across the\nCountry [noise] from that started the momentum\nAnd that was a [noise] actually at the top of last year to get things are grown so fast and so quickly it's almost a ... because it's unfathomable to watch you know [noise] like literally you started [noise] you got your band and started touring if you're going to\n\nFor even releasing a full length album before ... two straight songs to number one on one of billboards rock charts and they started getting all kinds of buzz\nGotta flow back shall look very rushed all day\nMark Pennington is the program director of rock station W. R. I. ash from Detroit and an early supporter\nOf course the obvious rubber plants are persons were there but there's layers and up to it and it was just so unique and strong it was just blown away\n[noise]\n\nPlant for some\nPeople are awesome prepared right of actually ... not\nAlways favorably in fact many consider the Michigan band or total rip off\nI think people make the mistake assuming that we are offended by it or to reduce like in any way much up one day and that's far from the truth [laughter] you know\nStill Josh says he never set out to sound like a lead up once there\nWhen I was initially trying to do is that the kind of see Wilson picket is doing you know or Joe Cocker and that kind of thing but\nI found is a lot easier to just being in a tight space over top of everything else if\nI were to sort of may get louder because we've got three\nOr [noise]\nWhatever the case the band seems to have found a good formula they're really an older listeners who still thrilled to seven different style jak as well as younger ones who weren't there the first time around [noise]\nCreating rock and roll concert says J our environment the current times about about influences are music and I think our generation and see that and they say oh this is rock and roll for us to get\nOur producers are Michael Lipton Katie long and Daniel ...\nBrancaccio with the marketplace one word from eight PM\nAmerican public media and you heard it here on Ninety point seven news good morning I'm Brendan Byrne it's eight fifty nine\nSupport for Ninety point seven news comes from Florida is historic coast where October visitors can save her local flavors that farm to table restaurant festivals and more foodies will enjoy the unique ... Florida's a store cos\nWhich reflects the coastal location and diverse heritage details asked historic ... culture dot com\nSailors being intersection is up next\nSupport for Ninety points at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nDot O. R. G. [noise] support for Ninety seven news comes from CFL technology source a Winter Park I T firms serving central Florida for over Fifteen Years CFL technology source provides IT Services backup solutions and telephone systems for small and midsized business more information at my technology source dot com\nCFL technology source simplified IT solutions\nTop issues for Orange County sheriff candidates including school safety testing the homicide rice and putting more resources into policing growing county I've met people into down addiction we continue our coverage of some of the key races in central Florida as midterm elections\nWith conversations with the candidates for Orange County Sheriff Joe millionaire was retiring from his position as a lender believe she lost that he does this Friday or a lot of businesses are Assad Florida highway patrol chief who now heads up security does these ...\nAnd Darryl shepherd says he's running to bring more transparency and accountability for the office\nThen how trip to space camp ... working with by the next generation of young minds and the troops will be own plan of this conversation with math the education they ...\nAnd the power of the pan older tablets a conversation with Andy ... and ... and the summer is about political cartoons and atomic from head to head on at this age and the news [noise]\nLive from NPR News in Washington on corporate Coleman Turkey's president says evidence strongly points to a plan Saudi operation to kill the journalists and the Saudi Arabian consulate in Istanbul NPR's Peter Kenyon reports president ... type aired on discussed the killing of Jamal ... with Turkish lawmakers today\nAre the ones that members of Saudi teams sent Istanbul and adventure the killing scattered out potential areas to disposable body he also says although the Saudi consulate his diplomatic territory there was a murder committed on Turkish soil\nDo an interpreter he called on the Saudi Government to allow the Eighteen people arrested in connection with the show ... killing to be prosecuted in church\nEvery CERN hosting so we will not remain silent against this murder and we will take any steps required really conscious some\nLast Saturday officials have claimed to show G A critic of the government suffered an accidental deaths during a fight broke out after he entered the consulate October second Peter Kenyon NPR News Istanbul\nMeanwhile CIA director Gina Haspel is going to turkey to review the matter the un refugee agency said more than forty five staffers to Mexico to screen the claims of thousands of Central American migrants seeking asylum\nAt least the shrine reports from Geneva the agency says about a thousand have sought asylum in Mexico\nThe when they see our says all countries have a right to manage their own immigration but spokesman Adrian Edwards says nations are refugees seeking international protection from entering their territory\nIndividuals' fleeing persecution bottom me to be given access to ... to refugee status determination procedures if people are fleeing persecution violence and one country they need to be provided a access through your sign them system\nPresident Trump has vowed to turn back the caravan of refugees and migrants from the U.S border stealing ... warns the caravan is facing a worsening humanitarian situation for NPR News I'm Lisa shrine in Geneva\nThe largest lottery prize in America could be awarded tonight the mega millions lotto has a jackpot that's now worth one point six billion dollars the chance to win is about one in three hundred three million but that's not stopping to read some gray she bought a ticket in Santa Cruz California\nPlant a lot of poor people in the world and I think anybody would like to take him being a wait and\nMoney they can do what they want to do maybe via Thailand some may find bones seven day\nEverybody has the jury and so this lottery\nThe odds are more likely that you'll get hit by lightning or become an astronaut and when this lottery if you don't when there's a different chance tomorrow night\nThe Powerball lottery will be drawn that jackpot now stands at six hundred and twenty million dollars mega millions on power boilerplate and about forty four states the district of Columbia and the Virgin Islands\nThis is NPR support for MPR comes from NPR stations\nOr their contributors included constant contact who's automation feature allows small businesses to deliver emails or a series of email campaigns to their customers learn more constant contact dot com and the Emmy AKC foundation\nFrom Ninety point seven news I'm Brendan Byrne it's nine four former vice president Joe Biden will be in Orlando today campaigning with US Senator Bill Nelson another Florida candidates on the Democratic ticket Ninety point seven in the cold dark and crushed in has more\nBiden is in town for an early voting rally alongside Nelson Orlando mayor buddy Dyer congresswoman Stephanie Murphy and found endings and others on the November ballot\nThe event aims to get people to the polls before election day though it comes a day after early voting began in more than thirty Florida counties including orange seminal ...\nRally takes place at the Cheyenne saloon in downtown Orlando it's part of Biden's swing through the state he stumped for democratic gubernatorial candidate Andrew Gillum yesterday in Tampa I'm Nicole dark and crashed in Ninety eight point seven\nNeed meanwhile Republican governor Rick Scott lag six points behind democratic incumbent Bill Nelson and Florida Senate race despite pouring millions of dollars to campaign advertising this according to the latest Quinnipiac poll Sean ... reports\nRepublican governor Rick Scott is still trailing in Florida Senate race after hurricane Michael Monday's Quinnipiac poll finds democratic Senator Bill Nelson lead shrunk just one point or in the last month\nThe survey finds Nelson carrying both independents in women by twenty points or more Nelson's leaders outside of the three point five percent margin of error the Quinnipiac poll is at odds with at least two other recent surveys democratic pollster SEA gifts got a two point lead and saint Pete polls show Scott ahead by less than half a point\nFor Florida public radio I'm Shaun okay\nThe numbers of Puerto Ricans who moved to Florida after Hurricane Maria may have been overestimated in previous studies and media count that's according to new research\nA new study released this month by the University of Florida's bureau of economic and business research suggests that between thirty and fifty thousand islanders settled in Florida in the past year earlier estimates from the University of Florida for hunters college it puts the number above fifty thousand people\nThis is Ninety point seven news\nNews but just scams the surface I mean it's kind of like running a damp paper towel over counter top and saying that you cleaned right\nDavid drain and what do you support public radio you pay for journalists who roll up their sleeves and scrub we get in there so you can either stuffed two weeks' worth of clutter into a closet and hope the door stays shut or invest in the reporting that gets the job done here's how to do it\nSupport you're listening habits by donating a dollar a day become an ... point seven W. M. S. P. monthly ... er during the violent drive and we'll send you a pair of ... point seven W. M. F. E. customs sucks call one eight hundred Seventy five twenty twenty who doesn't love public\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. it's been a full two years since we first tried this less intrusive style the fundraising called the silent drive and then how we do it now that you're going to the family\nDon't your support for uninterrupted programming by donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty blocked\nThere you want to use that ... approaching for thirty four you can use ... Seventeen Ninety chew or state route for thirty Four's you're altering otherwise expect about a thirty minute ride from\nFairbanks avenue to that accident I for westbound delays from four thirty four to mainland boulevard\nThis distinction I met ... we're going to hear from the three candidates running for Orange County sheriff but it's still end up police chief John ... who stepping down from that role\nI asked her about the homicide rice in orange county according to stats from the Orange County sheriff's office over all crime is down in the county ... homicides are up is that something that can send you thinking about what you might do if you're in this role\nYeah any homicide a is one too many\nAnd homicide is a crime of rage a crime of passion and because of that something that's really hard to predict and prevent certain other words when we have a a rational burglaries robberies we can see a pattern\nDeveloping in a certain area or for a certain type of car if it's I don't know if that's where homicides since it said many times a a crime\nOf passion or rage it just happens [noise] um because someone got into a fight or because there was an incident uh it's hard\nTo predict so but this very concerning to us I you know most of the uh homicides both an orange ... overland are are drug related that's why both agencies or do many operations I Know in the city of Orlando we did one last month and\nYou're headed the arrest of twenty nine a drug dealer as an effort to\nIn law enforcement such as the chief of police or Thirty years as a background I think that's one of the significant advantages that I Do have a that I have also had a career in creating jobs as opposed to ah just being in law enforcement I also understand both sides of the law\nUh you know in relates in relation to the citizens and being that real person and being for the people I I look\nLet me just come back to your to your graduation from police college\nA police academy so every every person that wants to go or become a police officer has to go through an FDR leaf certification or I did that so I have a basic understanding at a minimum of what it takes to be a law enforcement officer why\nDid you decide not to see that as a career\nOr at the time I was Twenty years old I was in college you know things wasn't as divisive as they are today you know I don't see a lot of them I didn't see a lot of minorities getting you know shot an unarmed\nA in a sense I didn't see such a divide in law enforcement and personally you know I Want to pursue other things I I I'm I was very bright or in college I had a bright future scholarship um I went to Florida State uh Pham you as well and I just wanted to be able to pursue other things before making a big decision\nAre asked to committing to a career in line for so\nAs to your comments about you being the only candidate in the right to know what both sides of in a race to feel like I Wonder if he's the elaborate on that a little bit\nUh well you know I have been arrested before you know um I haven't been convicted of anything but I Do understand the process I also understand the the impact on as a as far as consequences or you know you look at this race and you look at other things and that's the first thing people bring up even though I haven't been convicted of anything\nThey still in public opinion like to make you convicted and some people will try to discount the judicial process\nA discount the due process rights that we have a say oh well they must have been a problem in the system and everything was dismissed everything was dropped but it's it it it was because he had a lot of money or he had no system played out as it would in any other situation so I understand that I Would make sure\nI'm One a re arrest as a last resort I think that's such a significant impact on someone's life that if you can find other means such as diversion counseling citation and the forms of minor you know related such as drug arrests marijuana ... that's a good example of something that society is changing their views on\nI Want to ask about uh some of the things that are might be tough issues for for somebody thinking about law enforcement role in orange county one of the things is the homicide rate in orange county what would you do to address that\nWell I think we definitely need to address it uh so to speak in a literal fashion uh actually investigate put some more effort into uh the way we investigate homicides um I think you know right now at least from talking to people that have been victims of homicide or the\nEvening family members are for example there was one case travel Turner a you know and and I spoke to his family in regards to a situation where he was shot a downtown la ... at a nightclub the beach in my club and they felt like they weren't treated very properly the investigation wasn't very transparent\nHi I'm off on taking all of our president and general manager of Ninety points that W him after it's been a for two years since we first tried this less intrusive style the fundraising called the silent drive and this is how we do it now that you've been happy family\nDon't your support for uninterrupted programming by donating a dollar a day W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nInvestigation and can assist or in any role so you know it happened within the county and I think that the sheriff can uh you know take that investigation and and if there's you know some bragging in it um you know they and I feel like all law enforcement officers should be cooperating\nDarryl ship but when asked about school safety because there's been a lot of focus on school safety and how to improve it especially after the shooting in Parkland Margaret Simon dog with high school early this year yes what would your Robie a share of to promote school safety and and um keatley school say\nWell I I think initially are looking at all in school shootings that I've seen across the country ah I think you know you have to and for some of the same things that I went to school understanding for example your backpack was able to be checked a your locker was able to be checked\n'em you know and right now we have a situation where\nYou know people are most of these shootings are student of student there not outsiders coming into the school shooting of the schools they're easily previous your peers\nUm so you know I feel like we should hardened or the parameters in a sense I Am a proponent of metal detectors not in a sense of saying that we're going to make our schools for like jail um but you know look we we have a lot of technology today\nThat we can really designed things that fit within the environment\nDow shepherd candidate for Orange County sheriff thank you so much John thank you for having me and I spoke to ... Lopez or a Todd Florida highway patrol chief says investing more into technology is one way to help tackle the crime rates in orange county\nWhich I like this is a former Florida highway patrol chief eyes running for Orange County sheriff welcome to intersection thank you appreciate it to tell me about your platform or what is it that fits your ... from the other candidates well\nThere's several things that just be a part but ah but to start with the platform as a look I've I've been walking the community pine hills or obese or a pop culture like Dona and everybody has the same concerns\nAnd I'm In my platform appears to be resonating with the community next to reduce bobbing crime and the second part of that as community policing and the third part is to have a robust a recruitment and retention program\nOr the violent crime or as you all were um has decreased ... murders you know when you talk to everybody\nWhile the homicide rate has gone up in orange county but I Believe the crime rate I've ruled the downs that not correct\nIn orange county but not in the city of Orlando right into the ... it's gone up so for murder rates right now it's thirty eight you get thirty eight homicides and the city of Orlando for two thousand and eight team thirty eight as compared to two thousand and Seventeen in\nThe city of Orlando you have twenty five\nWell it's I mean is that the responsibility of the Cherokee think or is it more in Orlando city police\nThey like that just that's a that's a leadership in in the city of Orlando to strategy that need to use to two dozen Eighteen so we're not even over we still have three more months okay left into into doesn't Eighteen we're at thirty eight\nSo for the city of Miami you have thirty eight mhm right now for you to date is the same amount that you have in the city of Orlando and the city will end up you have two hundred and eighty thousand people living in the city will end as compared to Miami you have over five hundred thousand\nMy question is like what responsibility would that be for you as share from what could you do to help reduce that\nWell my response will be used to make sure that we use in the right technology okay there's a lot of technology or ... is a technology that's used so what do you have murders and you have weapons are involved [noise]\nSo ah ... is a is a news technology which used is they match patients from weapons whenever you collect any weapons from from whether it's a last weapon or abandoned weapon or any weapons that's used in any type of case\nYou catch fire that weapon that can property okay so you just walk into Orlando police in front of you take all the weapons that interview fire\nYou take those cages and you take those projectiles\nAnd you submitted to the lab so they have it's almost like DNA so you have a database of ... that weapon they could determine if that weapons ever being used\nSo far so that's one when I talk about evidence led policing so that's one way of technology we've got to leverage technology or else doing it and then you've got to find out some of these causes these root causes of a of of murders where there's drug related to domestic violence related\nSo you're saying you want to see more of an emphasis ON Technology what about stopping as the Orange County sheriff's office stuffed up enough\nIt's a good very good point this county is growing All right the populations increase integrate county to live and everybody's moving here and it's a thousand people moving\nTo the state of Florida every day a large chunk of that is moving to Orlando Orange County and you did come in from New York to come from Puerto Rico that coming from Miami to come in from Venezuela so we have in the county government has not kept up with that growth\nAs far as policing and and um law enforcement\nRight because what happens is um let's take an example east Orlando we used to live with a very big sector when it comes to Orange County sheriff's office and a lot of people are moving there in in the population is growing out east\nSo when they start building roads and they start planning buildings in rows and everything the sheriff's office used to have a seat at the table we need to be that because it takes you know a year to train\nLet me ask about one specific aspect of um deputies and staffing and that is school security ... because after the shooting in Parkland there's now a need for making sure that the schools have adequate or law enforcement presence within them or what would you do to make sure that\nThe schools in orange county have that law enforcement prisons\nWell I take that this situation very personally my wife works in the school system and my kids went to the school system elementary middle school and high school now they are UCF so for so many years when I left the house\nTo go to work in uniform you know they would hug kissed me and and and on and tell me hey be safe and return well that rule has changed now\nNow they're walking out the door and now they're going to the schools and they're going to work on petrified like every other father shouldn't be", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Orlando", "day": "23"}