{"month": "10", "state": "FL", "station": "WMFE", "content": "Supporters university room Hampton here in the u._k. semesters and decisions [noise]\nYou're listening to the b._b._c. world therapist with signs from all over the planet on the phone\nSo I Will see me as much for the town was shaped by some one who is\nDi di di di di ... in the Senate and also [noise]\nBlue will be BBC World service dot com crash movies\nYou are listening to the b._b._c. World Service\nHow technology reporter really time until this morning or ... percent both within this on the one to get ... joined one of the week torturing him on the on air online march so this is the\nBBC World there have been the world's radio station [noise]\nFor Ninety point at a news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six outpatient centers more information is that to their land on health dot com\nPresident Trump's pick to move to the center of this whole election coming up on MORNING edition [noise]\nGood morning six o'clock it was not even point seven days or you know\nWhat to Turkey's president one and I'm David Greene and I'm Steve Inskeep ... place themselves at the center of the investigation of a murdered journalist\nHow could that benefit of president for jailing journalists also this hour ... wants to come home\nThe state legislatures all they're playing defense against Democrats were hoping to get your way\nTo get guns out of Washington DC go wrong It's Wednesday or cover twenty four\nAnd the news is next\nLive from NPR News in Washington I'm core of the Coleman President Trump calls the death of Saudi Arabian journalists democracy ... the worst cover up in the history of cover up the U.S State Department is beginning to take action to punish Saudi officials believed to have been involved as NPR's Michele Kelemen reports\nThe state department is revoking or denying visas for Twenty one county officials and secretary of state Mike Pompeo says the U.S is considering them targeted sanctions to\nWe've identified at least some of the individuals responsible including those in the intelligence services the royal court the foreign ministry and other Saudi ministries who we suspect to have been involved in Mr to show used the F\n... says the U.S is still learning the facts and will base any further response on what the US government can confirm over the next few days Saudi Arabia's crown prince meanwhile met with the U.S treasury secretary who's in Riyadh Michele ... NPR News the state department\nTo the Associated Press says the government of Mexico reports Central American migrants continue to file applications for refugee status as they arrive from Honduras El Salvador and Guatemala\nThousands of migrants have joined together to walk north to the U.S border there are reports of another my grand caravan leaving El Salvador Maria Martin reports\nSources including a Salvadoran media and the U.S department of homeland security say another migrant caravan it's in the process of coming together this time in El Salvador reports say the group is being organized via WhatsApp and Facebook with plans of leaving us out the door next week\nThe first step would be neighboring Guatemala and in response that country's interior minister says it's working with the defense department\nTo put in more stringent border security measures than those in place last week when the first migrants march came up from Honduras on government spokesperson said that one took us by surprise adding that one of my life has now help return more than three thousand migrants back to Honduras for NPR News I'm ... I'm art\nThere appears to be at least one winner in the huge mega millions jak pot the numbers were called out last night by host Jon crow\nNumbers are twenty eight Seventy five fifty five and they don't make about five\nThe lottery officials in South Carolina say at least one ticket with sold in that state it's unclear if there are any other winning tickets the estimated mega million jackpot is worth one point six billion dollars\nThe national Hurricane Center says hurricane Willem has been downgraded to a tropical depression the center of the depression is over central Mexico it now has top sustained winds of thirty five miles per hour\nWhen will it was in the Pacific ocean off Mexico's coast it was a hurricane with top sustained winds of one hundred sixty miles per hour or a category five storm the storm's remnants are now moving east toward southern Texas\nYou're listening to NPR News from Washington\nSupport for NPR comes from the NPR stations other contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nAt a good morning for Ninety points of abuse I'm Schoenberg and six four former vice president Joe Biden said the mid term elections will determine the moral character of the country now you point seven stand your prior says Biden was in Orlando stumping for Democrats\nBiden rally support ... for democratic gubernatorial candidate Andrew Gillum and democratic Senator Bill Nelson who's running for reelection he ended the is that with a story about a Pennsylvania grandparents whenever he left our house his grandfather would yell\nBiden urged democratic voters to turn out in November to help flip Republican control of the house and Senate Democratic leaders like Senator Bill Nelson had not only voted to protect the Affordable CARE Act but\nHe said ... hope for Andrew Gillum also wanted statewide Medicaid expansion Danielle prior Ninety point seven news\nText messages and other documents surrounding trips made by Florida democratic candidate for governor Andrew Gillum are being turned over as part of an ongoing ethics investigation some of the documents appear to contradict Gillum assertions that he paid for all expenses related to two trips to Costa Rica in New York City\nAnd attorney representing a Tallahassee lobbyist turned over the documents Tuesday in response to a subpoena from Florida as ethics commission the Tallahassee marriage steadfastly denied any wrongdoing in the case which is separate but related to an ongoing FBI investigation into city government\nOne text messages Gillum told by lobbyist Adam Corey that Mike Miller had gotten the tickets to the Broadway show Hamilton Miller would later find up was a FBI undercover agents\nAnd the candidates for Florida governor scheduled to debate for the second and final time three days after their first testy encounter Republican Ron defenders Democrat Andrew Gillum will meet tonight at a community college in your Fort Lauderdale to debate will air live on my viewpoint seven\nAt seven o'clock this is Ninety points them I'm Mark Mehmet while he's editor once wrote that the media and the public should prove that they're lucky to have each other every day\nHas the standards and practices editor to NPR my job is to help prove how lucky we are to have you by making sure our reporting use clear and transparent now we're asking you to become a new member today because when you're lucky to have someone you don't take them for granted\nIt's easy to support ... point seven WMA feed during the silent Dr visit W. M. F. E. dot O. R. G. or call one eight hundred Seventy five twenty twenty once again W. M. F. E. dot O. R. G. and thank you\nIt is six or seven taking a look at traffic no delays on I for east or west bound to report and that is good news for this Wednesday morning\nWeather wise we're going to see a clubs mixed up some clubs thirty percent chance of showers mainly afternoon ... eighty four and two nights a twenty percent chance of rain tomorrow we bump up the chance to do about forty percent fifty percent on friday the drier and much cooler air for the weekend with high temperatures\nIn the seventies and that sounds pretty good right now it is Seventy three degrees and it's six\nGood morning\nHi I'm off on taking all of our president and general manager of made the point that I mean do you imagine it's been a full two years since we first tried this less intrusive style the fund raising called fine with Dr and how we do it now with the family\nDo you support and interrupted programming donating a dollar a day W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nShip has been struggling to explain what exactly happened President Trump has been criticized for not responding more forcefully against the kingdom though his tone has shifted in recent days\nSomebody really messed up and then the worst cover up ever and we're ... is at the deal standpoint when they thought about it because whether it's on to that idea I think is in big trouble and they should be in big trouble\nKnown addition to the president's remarks secretary of state Mike Pompeo announced that the U.S would be revoking the visas of Saudi operatives who were accused of killing his show gee\nSo many of those suspects were already under arrest bumpy you insisted that this would not be the less steps the United states would be taking on this matter but for turkey where this killing took place the uproar has offered president ... air to want a chance to boost his regional influence yesterday\nIn a speech to Turkish lawmakers he demanded to show jeeze killers be brought to account and suggested holding their trial you stumble\nFor was yours is a professor of international relations at the London School of economics also the author of numerous books on Mideast politics and he joins us on the program this morning professor welcome\n[noise]\n[noise] [noise]\nThis is NPR News\nSupport for Ninety point seven news comes from certified financial group working as they do see areas for nearly forty years they're independent see as the professionals within providing central Florida families with retirement planning and wealth management for a fee so they are registered investment and buy their learn more financial group dot com\nCertified financial group where they're planning tomorrow today\nAnd a good morning we're going to take a look at traffic brought you buy done ... I've ... picking up a little bit of volume out in the champions gate area twenty seven the for twenty nine about twelve minutes Billy's I for west bound know report it delays looking good\nSupport for Ninety points on the news and some of the seminal state college speaker series\nFeaturing Ross Douthat New York Times columnist and author with a presentation can the Republican Party keep the working class reception and book signing to follow Thursday November first at seven PM more ... seminal St dot edu slash speaker dash theories\nOn Ninety point seven W. M. F. E. get stories of inside\nThat make you stop and think it's radio you want everyone you know to hear and his radio that exist thanks to the general support of listeners like you contribute now to support the silent dried call one eight hundred Seventy five twenty twenty or visit W. M. F. E. out of work\nGood Wednesday morning she is full moon beautiful morning is coming our way we're going to see it makes the clouds and some thirty percent chance of showers mainly afternoon high buddy for tonight twenty percent chance of rain tomorrow more chance of rain mainly after to\nHide your eighty five but the lead romp for the weekend some cooler weather becoming well the Trump Administration hasn't had to deal with much oversight from Congress yet\nWhat we've seen is not only a a stretch of time when you have an executive branch that has been breaking norms that you have a Congress is set by and allow that to happen\nWith that to change in a big way however if Democrats win control of the house that story coming up with about ten minutes here on that point seven WM iffy thanks for joining us this Wednesday MORNING EDITION continues for you know it is six Twenty one\nSupport for NPR comes from the station and from Amazon Web services used by millions of customers a ws provides a range of cloud services and functionality from tools to security to compliance more information at age ... USS how dot com\n[noise] from see three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and I all the solutions that industrial scale learn more at sea three I O T dot AI\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and baking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nIt's MORNING EDITION from NPR News I'm David Draine and I'm Steve Inskeep Republicans want to preserve their power on this fall state elections Democrats want to take some of that power away\nYou know the old in the head a faith based approach to mid term elections are always afraid of a candidate for when we didn't do myself democratic\nChairman Tom for as is working on the Nevada governor's race as we hear elsewhere this morning\nFor years Republicans have dominated governors offices in legislatures state lawmakers make big choices about Medicaid expansion taxes roads schools and they also draw the district lines for future elections some our future national leaders according to the Republican or overseas his party's efforts\nFarm team and their part a current leadership people underestimate the impact that state and local governments asked Matt Wald\nHi I'm off on taking all of our president and general manager of made the point that in W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now that you've been happy family\nDon't your support one uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nOne year at all time high you are naturally playing defense and when you have an environmental historical trend lines are going to tell you that you're going to wind up losing seats um you have to fight against that regression to the ...\nAren't there several states where the flipping of a couple of seats could make a significant difference or even change the chamber\nYes you have a one seat majorities and Colorado and New York Maine two seats are in Wisconsin and and the number of other states are quite close further compounding\nAh what you're saying is the narrow margins by which no seats chain chance ten votes twenty votes a thousand votes so it is critically important for people to get out and vote\nI guess we should remember that the Virginia house of delegates after the election in two thousand Seventeen ended up on the verge of being tied between Republicans and Democrats and they had to have a drawing to decide the last seat and you guys won the drawing you got the drawing even though you've lost a lot of ground in the election\nHow much of an advantage is it for your side that Republicans were in charge of many state legislatures at the beginning of the decade and so they did the redistricting in many many states\nIt's important to make sure that you've got fair and competitive lines and our contention is that better candidates with better ideas when based on ah the quality of their campaign\nThere are some pretty dramatic examples where states as a whole voted for Democrats and Republicans ended up in control of the chamber one of them being Wisconsin in two thousand twelve\nWhere Democrats appear to have a big majority in votes and you had Republicans ended up with an overwhelming majority in the state legislature that's drawing of district lines that's where they came from right\n[noise] well I Would raise a couple of points out that um first and foremost the system we've designed as to have local representative that people can count on carrying the interest of that community we don't have a parliamentary system\nA it's a winner take all system within districts uh and so applying a notion that a statewide total somehow should be apportioned out two representatives a is a fundamentally against uh the basic structure of our system but if\nYou drew the lines differently in Wisconsin the election result could have been completely different with the identical set of votes from the public\nCould have that and you could have had different candidates and you could have had different issue sets and there are a lot of hypothetical\nBut what you've seen within Wisconsin a is overwhelming Republican success at the statewide level um you've seen Republican governors lieutenant governor statewide elected officials be reelected which has nothing to do with lines and you see that all across the country\nHow if at all do you advise state legislative candidates to deal with questions which must come up about President Trump\nThe state legislative level has very little to do with the federal government as it as it relates to um personality issues and dominant figures now there's obviously an environmental impact it's going to drive energy and resources in certain categories\nBut the best thing any elected official can do to be successful is to understand their district can advocate for the things that are important to their constituents\nView at a wave election in two thousand ten on that went all the way down to the state level um [noise] how do you deal with the danger of a wave election and two thousand acting\nWell certainly always need to be prepared for the challenges that come but when you look at the special elections that have taken place this year if they're a winding up for our wave I think they're going to be extraordinarily disappointed\nWould you argue there is something technically or politically that you are managing to do and district after district that Democrats are failing to do in order to be in position to win a\nPrize in local government I think part of that is an ideological difference between the two parties the Democratic and progressive movement seems historically it'd be more focus on sort of installing a ... a master architect at sixteen hundred Pennsylvania Avenue a and a more conservative philosophy wants to defuse that power out to the localities\nThat's Matt Walter of the Republican state leadership committee after historic\nFlooding in Austin, Texas that cities one million residents have been told to boil their drinking water most ... shells member station ... has more [noise]\nThe water rushing into Austin reservoirs has the look\nIf it's so turned off by flooding brown filthy even when it goes to Austin treatment plant it takes a lot longer to filter so on Monday the city told people to conserve\nWater and as a precaution to boil what they were going to use for drinking and food ... you can probably guess what happened next and I'm calling in\nSouth ... yesterday Maggie Chapman was one of a bunch of shoppers at a supermarket wheeling out bottles of water supply haven't proven the day before when shells were bear after stores started to limit how many bottles people could buy\nIt just inconvenient at this point but I think about you know just daily things that we use water I hadn't even thought about\nWhat kinds of things some restaurants are close to cafes aren't serving so you need a lot of people desperate for coffee and on a more serious note the city of San Antonio sensible water tank or to help keep the local jail supplied with drinking water and the city of Austin worried about maintaining water pressure in its system\nWe've been providing water for a hundred years it has never happened to us this is blowing our mind to\nGreg ... is the director of the city's water utility he said after all that silk slowed water treatment the city's system of pipes and reservoirs started to lose pressure\nIt loses too much pressure that said he won't be able to spray water from hoses to fight fires and water pipes risk getting contaminated as microorganisms need into holes and opening they wouldn't normally access\nThe good news is there a says is that water conservation is working people in Austin or using less more water is going into the system and water pressure has improved\nThe one thing we can control is how much water we use we can't control the weather but we can control that aspect of it\nHe says if conservation continues and the weather cooperates things could start returning to normal by this weekend if heavy rains kick up more silt and the river\nAnd the scandals of President Trump's administration one thing has been missing congressional oversight hearings this is where we see lawmakers grill officials about alleged misdeeds but if Democrats win control of the house they are promising a new era of investigations Here's NPR's Peter Overby\nDemocrats were put congressmen Elijah Cummings of Maryland in charge of the house committee on oversight and Government Reform\nCummings has plans for potential investigations among them it's a political ties to protected former ... chief Scott Pruitt for so long the security vetting done on Trump adviser and son in law Jared Kushner the Justice Department and its record on voting rights\nCummings taught political recently he wants to work with Committee Republican\nThose are the kinds of things were going to have to do and if they're going to is that going to be very pleasant for them to be very pleasant for me but\nI signed up but his job is what I'm supposed to do\nThat's how congressional oversight is supposed to work but hasn't now with one party controlling Washington the past two years Justin rude is a former congressional investigator now with the nonprofit project on government oversight\nWhat we've seen is not only a a a stretch of time when you have an executive branch that has been breaking norms but you don't have a Congress who sat by without consequences allowed that to happen without significant accountability\nDemocrats would face pressure from their base to impeach President Trump House Democratic leader Nancy Pelosi says she's against it here she is last week at Harvard's Institute of politics\nHave changed their life even\nThough she says Democrats should go after Trump's tax returns he's refused to disclose some Democrats would have the authority to get something\nAt the house intelligence committee perspective chair Adam Schiff of California says he would probe allegations that Russia has financial leverage over Trump\nThe Trump Administration has ignored virtually all information requests from congressional Democrats but there's a workaround for that get the documents from friendly nonprofit groups to get them through the freedom of Information Act Austin ... is director of American oversight a progressive group to snow filing for your request\nIt's actually very difficult to enforce the congressional subpoena in court in contrast a freedom of Information Act request wish we could file we can go to court very easily and force agencies to be transparent\nIt's worth noting this for your strategy was owned by conservative groups and the Obama era\nHouse Democrats plan to have all the committee's doing oversight investigating cabinet secretaries who broke the rules protecting Obamacare finding out what went wrong with hurricane relief in tackling other issues that Republicans have brushed off\nOne master of oversight is former congressman Henry Waxman during forty years in the house he investigated everything from the tobacco industry to the Iraq War\nWaxman listed three goals have good oversight stopped a waste of money hold people accountable and make government works the way it should his word of caution to House Democrats don't do oversight the way the Republicans have recently\nThe committees that Congress used their power which is in credible amount of power and abused it for simply political points simply to advance their election interests\nWaxman said that's not what oversight should be about Peter Overby NPR News Washington [noise]\n\n[noise] this is NPR News\nSupport for Ninety point seven news comes from can bring some chats private well he'll exist to be a collaborative community of individuals' families and committed professionals focused on growing wealth in support of the families entering values more information is available online at W. W. W.\nDot ... dot com\nEffort Wednesday morning we're taking a look at traffic brought to by merely sport super I for eastbound just the delays or building a from twenty seven the past ... for twenty nine about twenty two minutes now an eye for east bound for westbound reporting no delays no surface street accidents either at this juncture\nDoes your morning routine include coffee breakfast maybe a drive to work does it also includes Ninety point seven W. M. F. E. Hi this is David Greene co host of NPR's MORNING EDITION help keep this station strong into the future by calling one eight hundred seven eight five twenty twenty or you can go online at W. M. F. E. dot org\nAnd thank you were going to have a mix of clouds and sun today at thirty percent chance of showers mainly afternoon of hives near eighty four today to like just a slight chance of showers was about Seventy tomorrow's better chance of rain\nI about eighty five and a better chance of rain still on friday was cooler weather coming our way for the weekend you got a programming note forty case you're interested the ah the debate is going to ear lived tonight\nA from a W. M. F. eat from seven to eight PM gubernatorial debate that will be in Fort Lauderdale but it will be on the air here from seven to eight\nFilling up the marketplace morning report Sony stock trades or ... done electronically now buying and selling shares based on a computer algorithm so may be wondering why are there still humans on the floor\nOf the New York stock exchange will have that in all the morning's business news coming up for you right here on Ninety point seven W. M. F. E. public radio for all of central Florida\nMORNING EDITION continues now for you it is six forty four on our Wednesday morning his son [noise]\nMakes its way up to date on these uh last remaining weeks of daylight savings time\nOf our NPR colleagues recently completed across the country bike ride he wrote a group from the Pacific to the Atlantic which sounded impressive I'm Still we learned of hurting for these attempted across the United states while popping up really on his bike yeah the means to ride the whole way on one we'll\nOsborne has done this before when it took Seventy five days this time is aiming to raise money for charity by doing it faster It's MORNING edition\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com [noise] from Trader Joe's offering new ...\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nMore at Trader Joe's dot com and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep Paris was one of the first large cities to experiment with a bike sharing system what it introduced the leap more than a decade ago they leave I'd been a huge success at a point of pride for the city until this year when it changed operators and almost collapsed\nThe parents mayor has given the new valium operators until this fall to get their act together well it's fall NPR's Eleanor Beardsley reports [noise]\n... trying to unlock one of the colorful new ... from their song that businessman says he's been riding the bike to work every day for the last several years and I can't imagine going back to driving a car or taking the metro\nBut he says despite ... troubles the system has improved a lot in the last two months\nOf only about ... before August Vacation there were no bikes here and you had to walk to a lot of stations to find one at least now their\nBikes for tens of thousands of precision they leave is a vital mode of transportation and air traffic choked city so when a new transport consortium one available contract with a plan for electric bicycles people were enthusiastic\nWe're very excited with the new ... there were a lot of promises are new by whiz high technology on new features\nThat female Abu way of Paris in the saddle a cyclist advocacy group lab ... says the new company smoke bingo was a big disappointment\nIt was the last two for biking um disaster for mobile teaching garbage\nBags were broken or unavailable the ducks that held them we're out of water daily daily bused plummeted from one hundred thousand trip today to a couple thousand Paris mayor and it died though said she was giving ... just a couple of months to get things on track the company hired crisis manager out no matter\nYellow who became ... new CEO now ... says the first mistake with changing they leave operators with no lead in time\nIt was I think crazy to do that because you have to be the musicians and ... to to fight ducks that's the new tree by a to B a child's for about three\nThings continue downhill over the summer now they all sat on top of technical problems the company's struggled with vi damage in fast and it tore it in the city of light\nUnfortunately because I'm French and I'm about as young diffuse a a tone of uh in CBD sheep and he took beauty of schools and so we had the beginning of ... which was ...\nSays the new they leave now fit snugly and lock properly and they're charging docks trips have now written back up to nearly forty thousand a day and he said the new they leave them like the old ones are available in the Paris suburb\nYou have to think about these people who have moved from ... to our reason they want to use a clean by golly tree by Joe and and we have ducks in stations roughly ...\n... feet bully is still trying to unlock a bicycle\nFrom ATM American public media\nSupport for Ninety point seven news comes from Florida State university and ditch recently completed raised the torch campaign which has created ordered him stover one thousand three hundred students scholarship more information about the impact of one billion plus\nPhilanthropic dollars this on line that raised the torch started efforts you dot edu\nSupport for Ninety point seven news comes from Westminster towers as senior lending community in downtown Orlando offering maintenance free living with services including dining housekeeping twenty four hour security in transportation\nThe community offers active living as well as assisted living in skilled nursing care available when needed more at Westminster towers Estelle that'll work\nAt a good morning to you this is Sean Bergen coming up and local news nothing could be finer someone's rich in Carolina\nThis morning and the gubernatorial candidates were duking it out in Miami yesterday will tell you that when and also in this state Nineteen forty six weeks or first picture from outer space of the earth on a modified beaches [noise] it's a\nGood morning Republicans are seeing a surge in fundraising what's driving their supporters to open their wallets and where's the party going to spend the cash the election It's MORNING EDITION from NPR\nIs not going to be serving Orlando Melbourne\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now have you been to the family\nDon't your support for uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nAnd the rain forest and some people they are having a hard time supporting his environmental policy\nLater how Israelis reacting to the killing of Saudi journalist I'm all for show the Japanese journalist is reportedly relief three years after being taken in Syria is Wednesday October twenty fours or to the bottom now he's here thirty thirty\nTwo years old before they drag\n\nLine from NPR News in Washington I'm quarter of a Coleman President Trump says he will soon know everything there is to know about the death of journalists democracy OJ NPR's Giles nine of reports Trump says he'll be briefed on the investigation later today\nPresident Trump told reporters at the White House it a lot of information that's been gathered about the killing of Washington Post contributor to ... jeep and that he's planning to meet with U.S officials looking into his death says he takes a stronger tone toward Saudi Arabia calling the killing a total fiasco\nWas horrible it is a huge issues are that they should have never been in execution or cut her a physician and never happens\nPresident says he wants to hear a bipartisan recommendation from Congress on how the u._s. should respond some lawmakers are demanding sanctions the state department meanwhile has moved to revoke diseases of Saudi individuals suspected of being involved ... stuff [noise] trials later NPR News Washington\nLocal media in Pakistan say Saudi officials promised the Pakistani government six billion dollars in aid to help shore up that country's troubled economy some Pakistani critics say the money as a reward for the country's support of the kingdom of Saudi rulers face criticism for ... killing\nNPR's DSD reports from Islamabad about the actions of Pakistan's new prime minister Imran\nKhan the money with an ounce stopped a con attended an investment summit in the Saudi capital several big name companies and speakers withdrew from the event after the killing of John ... in the ... Khan had only said he couldn't get the conference because Pakistan was desperate for line\nNPR's de ... the top health official in the Trump Administration says new data suggest the opioid epidemic in the U.S is beginning to plateau as NPR's Emily Sullivan reports overdose trends are being cited in his speech\nYesterday Alex days our secretary of health and Human Services said new preliminary data from the Centers for Disease Control and prevention just increased by ten percent from twenty sixteen to twenty Seventeen those numbers stalled toward the end of twenty Seventeen here in the beginning of this year\nAnd other word steps aren't going down that are now at a steady rate [noise]\n\nPresident Trump is expected to sign a bill later today that expand Medicaid opioid treatment programs and support to research have nine opioid pain relief Emily cell of an NPR News\nThe national Hurricane Center says what was hurricane Willa has degenerated into a tropical depression it's now over central Mexico it once had top sustained winds of one hundred sixty miles per hour\nLottery officials in South Carolina say at least one winning ticket was purchased in that state for the huge mega millions lottery the jackpot is one point six billion dollars it's not known who the winner is or if there were other winning tickets this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nGot a good morning it is you know for for Ninety points of abuse I'm Sean ... the numbers are in and it appears there is at least one winner\nOr records one point six billion dollars were up for grabs Tuesday night and the mega millions\nAccording to South Carolina's a lottery website winning ticket was sold in that state lottery officials across the country have not report if there any other to prize winners the Florida Lottery is reporting that multiple tickets matched all five numbers but did not have the correct Meg of all three of those are worth one million and another\nPlayer used to make a player to bumped a ticket to three million in FBI investigation into corrupt in Tallahassee city government has dogged mayor Andrew Gillum campaign for governor even though the Democrat has hasn't been charged with anything and maintains he's not the subject of the probe\nGillum suffered a blow yesterday in the scandal two weeks before election day worth early voting underway newly released text messages showed he accepted a ticket to the Broadway show Hamilton from a man who reportedly was an undercover agent his opponent Republican Ron defenses seized on that news during the campaign event in aventura yesterday afternoon\nAndrews running on teaching Trump okay I mean I don't know why for Trump did not receive I Hamilton from an undercover FBI agent\nFeeling was also in Miami yesterday he defended himself and the Facebook Live video filming a park and the Richmond heights neighborhood where he grew up he said he believed his brother paid for the ticket and called the controversy a racist distraction from Republicans\nThe goal is obviously to use my candidacy as a way to reinforce of frankly stereotypes about black men\nEchoing an answer he gave it a CNN debate on Sunday Gillum said Republicans attacks rooted in the race this belief that black people are lazy or criminals he stressed he works hard and doesn't accept anything for free\nBy the way the gubernatorial candidates will debate tonight and that will be aired live on W. him if he from seven to eight o'clock this is Ninety point seven\nI'm ... now knowing what's happening in the mid term elections before you vote in November is important\nBut what about what's going to happen in December or January when you get every month you have NPR covered the entire election what happened before what's going on now and especially what's coming next\nBe a part of what comes next become a sustaining member today\nYou could become a sustaining member during the fine would drive by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot O. R. G. once again that's one eight hundred seven eight five twenty twenty\nAnd it is time for a look at traffic brought you buy down nearly sport Subaru I've ... found just getting busier the usual spots twenty seven for twenty nine about twenty five minutes of delays through downtown not really anything just about six minutes late Mary boulevard to mainland about Fifteen minutes of delays\nOr the north bound turnpike about ten from Osceola Parkway we do have an incident on the cell phone for twenty four twenty nine the north bound Florida turnpike ramp the left lane is block so there's a Fifteen minute delay in that area checking our forecast we gotta mix of clubs in Sunday hide your eighty four could see a shower afternoon it's seven oh so\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nI'm Steve Inskeep in Washington DC this is a tough mid term election for Republicans although there is no evidence yet that they're doomed\nThough the party in power usually loses ground Republicans are favored at this moment to hold the Senate they're long shots at best to keep the house although many of the decisive elections there are close so where to Republicans place their final bats Steven Law is with us again\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and how we do it now with the family\nDon't get support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty well\nDemocratic stark candidates people like ... rock of Texans have raised tons of money what is the group like yours do for the Republican side\nSure well we look at all these different races we tried to figure out which ones are the most competitive and most importantly where our own involvement would make a critical difference and uh so we're placing our last bats in these final weeks in the same way that outside groups and the other side are as well would you give me an idea of where some of those vets are going [noise]\nSure I as a a majority leader McConnell a a described it they're pretty colorfully he said a lot of these races if not all of them are nice fights and dark alleys they're very very close\nAnd uh so we're investing in states like Indiana and Arizona Tennessee and Nevada, Missouri West Virginia all states where those races are essentially within the margin of error and these are states where our money matters\nThis is NPR News\nSupport for Ninety point seven news comes from a guy said appliances a family owned company that has been selling installing and servicing appliances and central Florida since Nineteen eighty aggressive appliances specializes in luxury brands and features galleries of life working kitchens learn more at a grass and appliances dot com\nAggressive appliances a deeper commitment to appliances and the people who are less than\nSeven like GMO until you to look at ... done nearly sports Hebrew I Fort used by the west but I'm getting a little busier course about a twenty minute delay usual spots are about ... Fifteen through downtown now I'd only five north bound past week um road there is a big rig versus a pickup truck the right lane is blocked\nSo there is no delay but move over to the left as north on on the turnpike pass for twenty nine two lovely are blocked in that area so as a result of north on turnpike from Osceola park winter for Seventeen has about a ten minute delay there so other than that things are moving along\nSupport for Ninety point seven news comes from certified financial group working as a new series for nearly forty years they're independent CFC professionals who've been providing Center for the families with retirement planning and wealth management for a fee through their registered investment advisor\nLearn more financial group dot com certified financial group where they're planning tomorrow today\nI'm Joshua Johnson the host of one a become a sustaining member of W. M. F. E. during our silent to drive your generator supportive\nA dollar a day and make sure the reliable meat to no information on Ninety point seven W. M. F. E. stays right where you want it to please call eight hundred seven eight five twenty twenty or visit W. M. F. E. dot org\n[noise] after I get a look at the forecast we got a mix of clubs in sun today thirty percent chance of showers mainly afternoon ... for tomorrow live better chance of rain but cooler weather for the weekend welcome in terms of Thirteen Days away and voter turnout will be key in states she'll says Nevada\nThe event electric reflects the nation's electric it's tribalism the Republicans are going to vote for the Republicans and Democrats are going to vote for the Democrats\nMelt the Democrats are hoping to win the governor's race for the first time in Twenty years more on their\nSupport for NPR comes from this station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com [noise]\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template a drag and drop email editor and twenty four seven customer service Morris campaign monitors dot com\nAnd from Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles her family's experience of survival relapse in recovery starring Steve corral and Timothy shallow may now playing\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm David Greene on Sunday Brazilians elect a new president John ... is expected to win easily he's a retired army captain and congressman from the far right\nEnvironmentalist see his policies as a threat to the Amazon both in our grew up in a rain forest in a community that who's now deeply divided about his rise to power in fact Philip Reeves has more\nOf a small country town in southeast present ... spent his childhood\nMid day drinkers and a bond is a town square remember him well including Francisco Gianni a civil servant fifty eight to\n... when we said one day I'll be president office yeah Chinese drinking beer with his brother Luis Antonio who says he used to go fishing with both of them out of\nThe he's the son of the town was his Luis Antonio ... an ultra conservative who stands up for family and religion I'm much corruption [noise]\nLocal officials say about sixty percent of this community support spokesman Louise I'm telling you proud to bolster NATO grew up here this place is called elder\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming donating a dollar a day with W ... or call one eight hundred Seventy five twenty twenty\nCaves the waterfalls full that our riches here just a few minutes drive away\nThey say in the town that they live in the middle of the Atlantic rainforest or that telling the truth because here\nWe are surrounded by far the Atlantic rainforest flung stretched along much Brazil's huge coastline before the country was colonized began building cities [laughter] most of the forest\nDestroyed but chunks remind the chunk in this area covers nearly twenty times more land the Manhattan the forest is one of the richest in the world didn't bother to the city it has tens of thousands of species many threatened lettuce with adult is an environmental activist an eco tourists guide\nAcute they'll both ... and we have everything air plans animals insects micro fauna\nEverything the forest around here is on the Gulf and the protection get books out of talks listening Brazil's environmental licensing laws because he thinks they suffocate the economy Brazil's powerful agri business lobby hungry for new land farming and mining is behind him says the battle\nIn the forest around Eldorado thereabouts it doesn't kill 'em Boehner's\nThese are small impoverished Afro Brazilian communities often establish centuries ago by African to escape slavery these days both for NATO says he sees old Brazilian says he\nHit in the kingdom vote is people haven't forgotten his past racist remarks about them this time of the amount of ice who lives in\nOne falcon and like fixate those and people say he's very prejudiced and then he doesn't like black so we feel really offended local\nOfficials psychosomatic I Lived in that out of from the age of five to a team his father was the town dentist who ... the Internet also vice principal of a local school\nSays he and both NATO hung out with his kids swimming and the rivers playing soccer and hunting puts his mom was a washer woman in the bowl so NATO household he says but then I was just politically on the left\nAnd dreads also now to becoming president\nOf the short if for no plays\nPresident should you not to people is not confined to Michaelson out all night is creeping across the rainforest in the house and the elderly those big towns glad\nThe mat and his deputy I guess that's an awards ceremony for locals who completed fashion and bakery causes that these two officials belong to a centrist political party and yet they say they don't see also NATO from the far right it's a threat to global\nThings had been the case it did it sit there in up in a booth\nRica if most amount of becomes president I'm sure he'll look kindly on the town to vice mad you know show\nWhat about the Atlantic rainforest pulled around with him on and also what are the ones in the forest is Elvis on his greatest pressure to map the voucher motorized and lungs of the region yet the town's broke it needs income and jobs he says\nSo it shouldn't profit from the forest allowing in where he goes non polluting industries and\nProtected you can do both his jeopardize the orchid 'cause they only have to I Believe shy about NATO knows that he says [noise] lane is a battle the Eldorado eco tourists guide disagrees not proposed Disney for ... and the most amount of doesn't have any consolation policies this or that or\n... or the boss ...\nSo any form of threats to the Atlantic rainforest is terrible he says because once you lose it you'll never get it back ... Reeves NPR News El Dorado\nYears after he vanished in Syria a freelance journalist is confirmed it safe ... suitor was taken by an extremist group but unlike other reporters who have been killed in recent years he has surfaced in Turkey NPR's Anthony Kuhn reports\nJapan's chief government spokesman ... told a hastily convened press conference on Tuesday\nThe Tokyo had received information from ... about the journalist forty four year old is June pay us to to you and you can you do you go to conjure informed us that Yahoo there hasn't been released it actually and is it an immigration senator he might have a turkey soup guy told reporters\nYesterday I went to Syria three years ago to report on the fate of his colleague ... go\nGo show was taken hostage in Syria in twenty Fifteen and beheaded by the Islamic State's group\nIn al Qaida affiliated group known as the new front reportedly took an pseudo hostage it's not clear how he was freed in twenty sixteen video came out purporting to show yesterday he told his family he loved them any hinted at the nature of his ordeal in wherever\nYou are a wave and\nWhen you're sitting in a dorm room suffering pain he said oh there is no one to answer a no win respond when you are invisible you do not exist no one cares about cheap\nYahoo that began reporting in the middle east in the early to thousands he was taken hostage in Iraq and two thousand and four and leader freed after time some Japanese voice to anger at freelance journalists got themselves in trouble and then had to be bailed out by the government\n[noise] yawn suit as family meanwhile has been eagerly awaiting news his mother told state broadcaster and ha that has she prayed for her son's release she folded little paper origami cranes at least one a day more than ten thousand you know\nAnthony Kuhn NPR News Beijing\nWas go turn over loaded\nIt return other voters and we've identified with whatever it is we don't\nSuffer the ramifications of it\nIs all I can that's the biggest challenge Nevada is a purple state that swing state trend in two thousand sixteen election largely Latino voters organized by the state strong is labor union the color near union that it shows Hillary Clinton Democrats flipped the state legislature\nAnd delivered the first Latina senator Congress Catherine Cortez ...\nIt's the model says camper as chairman of the Democratic National Committee he's into that for the day came\nThe Democratic party nationally [noise]\nLeads to emulate what Nevada has been doing\nSince the beginning of twenty fifth in which was organizing early organizing everywhere making sure that we have\nTwelve months party [noise]\nWe're we're talking to people he points to the voting flyers at every checkout counter at the Asian grocery store in early voting state he says attention to details like that is what the point\nYou know the audience at a faith based approach to mid term elections you always afraid of the candidates would win but we didn't do much else\nCorrect says he thinks Democrats for anywhere from eight to a dozen governors seats election the popular Republican incumbent in Nevada Brian Sandoval is barred from running because of term limits\nSo she has a chance against his Republican opponent Adam lack salt the current attorney general Irish ... campaign for this story too but no one responded\nNow something is shifting last year with voter turnout is higher than usual during the primaries and in the first days of early voting and the race is really a toss up according to polls\nDon't often is the editor than a data independent and an expert on Nevada politics we needed a coffee shop\nIn Nevada lecture it reflects the nation's electric very polarized\nTo lower turnout election so it's tribalism Republicans are going to vote for the Republican the Democrats are going to vote for the Democrats\nLike the country now that I don't know the Democrats in urban areas ended the Republican in rural areas so rough says whoever can turn out their voters were winning the governorship\nThat's how I don't watch all one four years ago for for attorney general he's the only candidate in modern Nevada history to have lost both the urban areas and still want a statewide race\nBack at the grocery store democratic candidates who is ... is that the people he needs to lift like days of Las Vegas tracking character more recent arrivals or visitors who can't do\nOthers are conservative to shake his hand and leaders how many are not voting for him and then there's ...\n[noise]\nShe registered or ... thousand sixteen to go to real life marijuana she got the money that came from it would go to her kids' school so far she says that\nWords um anyway how are we going to fix the first started my my daughter out of the fork during the debt for the kids\nTo vote for the person who will improve her three children it's education and the fountain NPR News Washington [noise]\nThis is NPR News whether a boarding or not he point seven uses ... by ... Orlando\nSupport brandy point seven news comes from the UCF NBA these yes MBA offers for schedule options in three locations making it convenient for professionals who wish to pursue an accredited MBA while continuing their career path\nInformation about these yes MBA including schedule options admission requirements and deadlines is available at U. C. F. M. B. A. dot UCF dot edu\nShouldn't forty three so you know look at travel abroad you buy a relief for to root for it you spell now we have a disabled car a block and the rights center lane at Princeton street so we've got to delay from John Young parkway to Princeton\nA bordering on twenty five minutes there so that's a that usual traffic is that just goes into bigger like lake Mary boulevard to make on on the west side about twenty five minutes as well north on on the turnpike best for twenty nine the left lane is blocks or move over to the right or the poor weight east and west bumps about Fifteen minutes in each direction\nAnd the other highways looking pretty well out there today\nIt's been a full two years since we first run are less intrusive style of fundraising call the drive and this is how we do it now W. M. F. E. family show your support for uninterrupted programming donating a dollar a day does it W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty\nAnd take a look at the forecasts we got a mix of southern clouds with the thirty percent chance of showers today mainly in the new mainly in the afternoon highs me ready for tonight just a slight chance of showers mostly cloudy\nLoad up Seventy Thursday a better chance of rain mainly after two o'clock in the afternoon with a highly five and then we'll see some more rain\nSome cooler air and the drier and cooler on the weekend coming up we're going to take a look at Helen Reddy her Nineteen Seventy two anthem you can hear it in your head right now it's the anthem for female pride and solidarity still speaks to women and men engaged in the fight\nFor equal rights that's coming up for his MORNING EDITION continues year at Ninety point seven WMA the seven forty four\n[noise]\nGood morning I'm David Greene with a story about the importance of return customers the BBC is reporting\nOn a group of men who were about to Robert shopping Belgium until the quick thinking owners that have come back at the end of the day I'm going to have more money than\nThe guys left the owner told police to show up later they were skeptical but they came\nAnd when the thieves returned in the evening they arrested them maybe\nThe owners should have asked the guy to fill out of customer survey or something you're listening to MORNING EDITION\nSupport for NPR comes from this station and from a zoom zoom offers cloud video conferencing online meetings sent a video conference room solution in one platform featuring digital video and audio were screened sharing account registration and more at ... dot us\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth fidelity brokerage services Elsie\nAnd from the listeners to support this NPR station\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep good morning we're deep into an election season vital question is who shows up Karen Grigsby Bates\nThe bar for Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nDays ago and it's thirty second spots are popping up on the Internet in one a guy with a laptop is sitting on a cafe patio he looks disgusted Lee into his recyclable cup as a stunning young black woman pulls\nUp a chair the coffee here sucks you know what else ...\nSuppression how did you know my name's people voting\nThe parties will represent me was broken right so the woman without her phone and makes a call nine one one\nReporter writing I certainly think you're going to be the next parenting alkaline\nPlan on voting [laughter] oh I can describe him\nIf it flip on all the white people the barbecue Becky the pool patrol palsy Starbucks to these who is called the police on black people just doing stuff\nReally in the park using the condo pool waiting in a coffee shop for business partner\nOnly in this video black people are calling the police on white once they think are being irresponsible citizens\nKaren the gallon heads acronym the nonprofit agency that commission for videos that are popping up on your mobile devices she gets it they're taking a risk riffing off whites policing black bodies for this campaign to cheat reverse parity\nThere's nothing funny about that but I think that tying that cue Pacific engagement and using your vote to really make a stand out what kind of country you want to live in in the direction you want this country to go in I think that can be really powerful\nAcronym worse to elect progressive candidate to be a targeted digital media campaigns and the gallon says call the cops is part of the knocked the vote project which has a specific goal\nIt is a program designed specifically for the earth's you may not vote in all election or especially in mid term election\nThe company approach director Malcolm delete it helped write and direct the spot leaves work includes night school and last year's hit comedy girls trip the idea of a direct pleaded voters appealed to him\nYou know I think it's just important for people to um just be aware and like we're not telling you know what was in my particular but like hey but you got to vote you got to get involved in the process\nSo we sat down with acronyms creative director Vince Murphy who by the way is black and devised the call the cops series there's a hipster a suburban mom and a worried black man played by the daily show's Roy would junior\nWho's calling the cop on the table and he'll make plans to vote November\nBallot\nNumber one I like reporting emergency in ... three white women just taking selfies criminal selfie improper use and filters in just the same person over and over again playing the dramas and they literally have no plans of voting in November but scares me that's not a legal [noise]\nPlease her not to have a\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called a five hour drive and this is how we do it now have you been to the family\nDon't your support and interrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nBusiness degree from American help take your career further by joining their online into sessions on November sixth and seventh details can be found it Rawlins dot edu slash info sessions\nSupport for Ninety points on the news comes from the central Florida expressway authority were told that the news are invested locally and travelers can save time and money with the pass eat past work on all ... in Florida Georgia in North Carolina and for parking at Orlando international airport learn more and get ... dot com\nYeah the good morning on a bunny to clog I'm Sean ... local news or Joe Biden was in town just the other day will tell you what he had to say and also the candidates for governor gonna meet up with another debate will tell you where you can listen to that live and also how the electric is coming back on in the panhandle give you an update their means I'm national loses next it's eight o'clock\nWho\nYour morning so how does immigration really affecting the job market look it's a real effects of an issue President Trump's pick to move to the center of this whole election coming up on MORNING edition [noise]\nThis is not going to face or Leno Melbourne [noise]\nWhat this Turkey's president one I'm David Greene and I'm Steve Inskeep rage of tie up here to one place themselves at the center of the investigation of a murdered journalist\nHowever that benefit of president for jailing journalists\nAlso this hour Republicans once controlled\nState legislatures all they're playing defense against Democrats were hoping to catch\nTo get guns out of Washington DC go wrong It's Wednesday or over twenty four\nAnd the news is next\nLive from NPR News in Washington I'm quarter of a cold in the state department is taking steps to punish Saudi Arabians citizens who are suspected of involvement in the killing of Saudi dissident journalist democracy I'm Jane the agency has revoked or deny us visas for Twenty one Saudi officials\nSecretary of state Mike Pompeo says the United states is continuing to learn the facts after weeks of changing explanations the Saudi Government now admits ... was killed in a fist fight in the Saudi consulate in Istanbul, Turkey\nMany Sadie critics don't mind that\nThe candidates for George's hotly contested governor's race had their first broadcast debate on Tuesday Georgia Public broadcasting Steven Fowler reports the candidates do old over voting rights\nMidway through the debate Republican Brian Kemp was asked if he used his position as secretary of state to suppress minority voters in elections his response\nIf you look at the numbers minority participation in Georgia's up twenty three percent we have a million more people on our voter rolls today than we had when I took office\nBut Democrats Stacey Abrams said voter suppression was about more than being on the rolls\nCreating an atmosphere of fear making people worried that their votes don't count\nThe pair of glasses in recent weeks over everything from rejected absentee ballots the door just strict voter registration law they both face libertarian Ted Mets in November for NPR News I'm Stephen Fowler and Atlanta\nA Japanese journalist is free after vanishing in Syria three years ago NPR's Anthony Kuhn reports from Beijing that the freelance reporter is believed to have been held hostage\nForeign minister tomorrow kono told reporters that Japan has confirmed the identity of forty four year old ... Qatari officials notified Japan of us who does release on Tuesday Japanese diplomats went to visit him at an immigration center in southern turkey and found him in good health\nNow Sudan went missing in twenty Fifteen and it was reportedly taken hostage by an al Qaida affiliate known it's a time as the al Nusra front\nTokyo insisted that it it paid no ramps into free I sit here and think turkey unconscious for their help with the case this was Yahoo does second freedom from captivity he was taken hostage and leader fried in Iraq in two thousand and four\nAnthony Kuhn NPR News Beijing\nThere is at least one winning ticket for last night's near record breaking one and a half billion dollar mega millions lottery and fears Emily Sullivan reports the ticket for the jackpot was so somewhere in South Carolina\nThere could be other winning tickets that have been a long lottery odds but the south Carolina education lottery is the only one so far to report one sold in the state that matches all fixed making millions numbers and Tuesday nights drawing\nThose numbers I was at one point six billion dollars of our twenty nine years or a lump sum payment of some nine hundred and four million dollar NPR's Emily Sullivan NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nHad a good morning it as a model for for Ninety points of views Schoenberg former vice president Joe Biden says the mid term elections will determine the moral character of the country [noise] Ninety point seven Samuel Pryor's as Biden was in Orlando stumping for Democrats\nBiden rallied support at the Cheyenne saloon for democratic gubernatorial candidate Andrew Gillum and democratic Senator Bill Nelson who's running for reelection he ended the is that with a story about a Pennsylvania grandparents whenever he left our house his grandfather would yell\nBiden urged democratic voters to turn out in November to help flip Republican control of the house and Senate he sat democratic leaders like Senator Bill Nelson had not only voted to protect the Affordable CARE Act\nBut he said good ... hopeful Andrew Gillum also wanted a statewide Medicaid expansion Danielle prior Ninety point seven news\nCandidates for Florida governor is scheduled to debate for the second and final time three days after their first testy encounter Republican run to send us an Democrat Andrew Gillum will meet tonight at a community college near Fort Lauderdale on Sunday in Tampa the to scaffold over the economy race and president Donald Trump\nTo Sanders former congressman as an outspoken supporter of Trump Gillum the mayor of Tallahassee as a frequent critic of the president of the winter the November six election will replace Republican Rick Scott who was barred from seeking a third term Democrats have not won the offices Nineteen Ninety four the rate will air live right here on Ninety point seven at seven o'clock\nAnd electric utility providers in the Florida Panhandle they're hoping to have nearly all power restored to customers whose homes are equipped to receive a by early November that's roughly a month after the area was hit by hurricane Michael\nGovernor Rick Scott announced the gold Tuesday this includes the hardest hit areas of Mexico beach towns and Calhoun Jackson county's where the electrical infrastructure required a complete rebuild\nA governor's office news releases fewer within forty seven thousand seven hundred accounts were made without power down from the more than four hundred thousand immediately after hurricane Michael\nBoth of those tools include homes and businesses destroyed or damaged too heavily to accept power this is not the point seven\nHi I'm off on taking all of our president and general manager of made the point that I mean do you imagine it's been a full two years since we first tried this less intrusive style the fund raising called fine with Dr and this is how we do it now with the family\nDo you support and interrupted programming donating a dollar a day W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nDrive by getting your tickets today\nVisit W. M. F. eating out or G. or call one eight hundred Seventy five twenty twenty don't delays tickets went fast last time the Capitol Steps putting the market and democracy is hilarious show was coming to trinity rep and you don't want 'em is\nHave fun and support nutty point seven WMA the at the same time during our site when Dr\nWMA feed that more Jews that's W. M. F. E. dot fool orange and things you\nSupport for Ninety plates at a news ... Kirk and called litigation attorneys serving the business community throughout the state of Florida more at ... dot com\nAnd taking a look at the forecast makes a club and some of the thirty percent chance of rain we're eating for in his eight oh seven MORNING EDITION ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington DC\nAnd I'm David Greene in Culver City California ever since the killing of Saudi journalist 'em all cause showed gee the Saudi leadership has been struggling to explain what exactly happened President Trump has been criticized for not responding more forcefully against the kingdom though his tone has shifted in recent days\nSomebody really messed up and then the worst cobra ever and we're ... is at the deal standpoint when they thought about it cause weapons on to that idea I think is in big trouble and they shouldn't be in big trouble you\nKnow in addition to the president's remarks secretary of state Mike Pompeo announced that the U.S would be revoking the pieces of Saudi operatives who were accused of killing could show gee\nSo many of those suspects were already under arrest\nBumpy you insisted that this would not be the less steps the United states would be taking on this matter but for turkey where the killings took place the uproar has offered president ... or the one chance to boost his regional influence yesterday\nIn a speech to Turkish lawmakers he demanded ... killers be brought to account and suggested holding their trial and you stumble\nFor was yours is a professor of international relations at the London School of economics also the author of numerous books on Mideast politics and he joins us on the program this morning professor welcome\n[noise]\n[noise] [noise]\nThis is NPR News Ninety point seven W. M. B. is bringing capital steps back in twenty Nineteen this hilarious show will be coming to trinity ... on Thursday in February twenty eighth at seven thirty\nShow your support or the silent drive and get your tickets to the\nVisit W. M. F. E. dot ORG for coal one eight hundred Seventy five twenty twenty\nEver going to take a look driving sponsored by done really sports Subaru I for eastbound is busy in the champions gate area about twenty minutes of delays\nDowntown about John Young parkway to Princeton street now checking in about seven seed minutes\nI four west ... past make lake Mary boulevard to make one about twenty five minutes there and uh the turnpike near Osceola Parkway to force him teams about sixteen minutes west bound for oh wait a little busy about Fifteen minutes and we do have a road in accidents ... accident north on his cellphone summer Lynn\nRoad is shut down still the water main break is causing a problem there metal woods whether we wrote it on a ... who use fear we woods and an la carte edge would draw it water drive it for a city use obey the instead\nSupport for Ninety points and the news comes and this the NS companies celebrating the firm's fiftieth anniversary in twenty Eighteen and looking ahead to the Next Fifty years of planning designing constructing in maintaining the belt and natural environment that the NS companies on line at C. S. C. O. S. dot com\nAnd checking on the forecast where you see a mix of clubs in southern thirty percent chance of showers in the afternoon eyes memory for tonight to just a cloudy low of about Seventy well the Trump Administration hasn't had to deal with much oversight from Congress\nYet what we've seen is not only a a stretch of time when you have an executive branch that has been breaking norms that you have a Congress who sat by and allow that to happen\nThat could change in a big way however if the Democrats win control of the house that stories coming up for you in about ten minutes right here on your public radio station Ninety point seven billion UMF ee I'm Schoenberg it's pleasure help you get up and start your day MORNING EDITION continues now for you it is a Twenty one\nSupport for NPR comes from this station and from CSP certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement and estate planning in the client's best interest let's make a plan dot org [noise]\nFrom the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verify dot Gov slash go\n[noise] and from Lyndon ... del learning process committed to helping all students learn to their potential there\nFor Ninety point at a news comes from our land out how to cover their whatever whenever and wherever Orlando healthy dedicated to providing many pathways act care\nIncluding nine hospitals and emergency rooms and urgent care location and forty six ... ... ... more information is that you know health dot com\nIt's MORNING EDITION from NPR News I'm David\nGreene and I'm Steve Inskeep Republicans want to preserve their power in this fall state elections Democrats want to take some of that power away\nYou know the old in the head a faith based approach to mid term elections you always afraid of the candidate for when we didn't do much else democratic\nChairman Tom for as is working on the Nevada governor's race as we hear elsewhere this morning\nFor years Republicans have dominated governors offices in legislatures state lawmakers make big choices about Medicaid expansion taxes roads schools and they also draw the district lines for future elections so I'm our future national leaders according to the Republican overseas his party's efforts\nThere part farm team and their part a current leadership people underestimate the impact that state and local governments have\nMatt Walter of the Republican state leadership committee was with the group as the party captured two thirds of all state legislatures they've recently lost some ground and hope to avoid losing more\nWhen you're at all time high you are naturally playing defense and when you have an environmental historical trend lines are going to tell you that you're going to wind up losing seats um you have to fight against that regression tend to me\nAren't there several states where the flipping of a couple of seats could make a significant difference or even change the chamber\nYes you have a one seat majorities and Colorado and New York Maine two seats are in Wisconsin and and the number of other states are quite close further compounding\nWhat you're saying is the narrow margins by which those seats chain chance ten votes twenty votes a thousand votes so it is critically important for people to get out and vote\nI guess we should remember that the Virginia house of delegates after the election in two thousand Seventeen ended up\nOn the verge of being tied between Republicans and Democrats and they had to have a drawing to decide the last seat and you guys won the drawing you got the drawing even though you've lost a lot of ground in the election how much of an advantage is it for your side that Republicans were in charge of many state legislatures at the beginning of the decade and so they did the redistricting in many many states\nIt's important to make sure that you've got fair and competitive lines and our contention is that better candidates with better ideas when based on ah the quality of their campaign\nThere are some pretty dramatic examples where states as a whole voted for Democrats and Republicans ended up in control of the chamber wanted them being Wisconsin in two thousand twelve\nWhere Democrats appear to have a big majority and votes and yet Republicans ended up with an overwhelming majority in the state legislature that's drawing the district lines that's where they came from right\n[noise] well I Would raise a couple of points out that um first and foremost the system we've designed as to have local representative that people can count on carrying the interests of that community we don't have a parliamentary system a it's a winner take all system within districts\nUh and so applying a notion that a statewide total somehow should be apportioned out two representatives a is a fundamentally against uh the basic structure of our system\nBut if you drew the lines differently in Wisconsin the election result could have been completely different with the identical set of votes from the public\nCould have that and you could have had different candidates and you could have had different issue sets and there are a lot of hypothetical\nBut what you've seen within Wisconsin a is overwhelming Republican success at the statewide level um you've seen Republican governors lieutenant governor statewide elected officials be reelected which has nothing to do with lines and you see that all across the country\nHow if at all do you advise state legislative candidates to deal with questions which must come up about President Trump\nAnd the state legislative level has very little to do with the federal government as it as it relates to um personality issues and dominant figures now there's obviously an environmental impact it's going to drive energy and resources in certain categories\nBut the best thing any elected official can do to be successful is understand their district can advocate for the things that are important to their constituents\nView at a wave election in two thousand ten on that went all the way down to the state level um how do you deal with the danger of a wave election in two thousand I team\nWell certainly always need to be prepared for the challenges that come but when you look at the special elections that have taken place this year if there are winding up for our way of I think they're going to be extraordinarily disappointed\nWould you argue there is something technically or politically that you are managing to do and district after district that Democrats are failing to do in order to be in position to win\nPricing local government I think part of that is an ideological difference between the two parties the Democratic and progressive movement seems historically to be more focused on sort of installing a ... a master architect at sixteen hundred Pennsylvania Avenue a in a more conservative philosophy wants to defuse that power out to the locality\nThat's Matt Walter of the Republican state leadership committee after historic\nFlooding in Austin, Texas that cities one million residents have been told to boil their drinking water most ... shells member station ... has more [noise]\nRushing into Austin reservoirs has the look\nIf it's so turned off by flooding around filthy even when it goes to Austin treatment plant it takes a lot longer to filter soap\nOn Monday the city told people to conserve water and as a precaution to boil what they were going to use for drinking and food prep for you can probably guess what happened next and non ...\nSays sign here yesterday Maggie Chapman was one of a bunch of shoppers at a supermarket wheeling out bottles of water supply had improving the day before when shells were bear after stores started to limit how many bottles people could buy\nIt just inconvenient at this point but I keep thinking about you know just daily things that we use water I hadn't even thought about\nWhat kinds of things some restaurants are closed cafes aren't serving so you meet a lot of people desperate for coffee and on a more serious note the city of San Antonio sensible water tank or to help keep the local jail supplied with drinking water and the city of Austin worried about maintaining water pressure in its system\nMeaning providing water for a hundred years it has never happened to us this is blowing our mind to\nBritain as there is is the director of the city's water utility he said after all that silk slowed water treatment the city's system of pipes and reservoirs started to lose pressure\nIf it loses too much pressure to city won't be able to spray water from hoses to fight fires and water and tights risks getting contaminated as micro organism sneak into holes and openings they wouldn't normally access\nThe good news is there says is that water conservation is working people in Austin or using less more water is going into the system and water pressure has improved\nThe one thing we can control is how much water we use we can't control the weather but we can control that aspect of it\nHe says if conservation continues and the weather cooperates things could start returning to normal by this weekend if heavy rains kick up more silt in the river\nDemocrats would put congressmen Elijah Cummings of Maryland in charge of the house committee on oversight and Government Reform\nCummings has plans for potential investigations among them the political ties to protected former ... chief Scott Pruitt for so long to security vetting done on Trump adviser and son in law Jared Kushner the Justice Department and its record on voting rights\nCummings told political recently he wants to work with committee Republicans\nThose are the kinds of things were going to have to do and if it's going to be very pleasant for them to be very pleasant for me but I signed up but his job is what I'm supposed to do\nThat is how congressional oversight is supposed to work but hasn't now with one party controlling Washington the past two years Justin rude is a former congressional investigator now with the nonprofit project on government oversight\nWhat we've seen is not only a a a stretch of time when you have an executive branch that has been breaking norms but you have a Congress who sat by without consequence and allow that to happen without significant accountability\nDemocrats would face pressure from their base to impeach President Trump House Democratic leader Nancy Pelosi says she's against it here she is last week at Harvard's Institute of politics\nHave changed their lives\nClose he says Democrats should go after Trump's tax returns he's refused to disclose than Democrats would have the authority to get something\nAt the house intelligence committee perspective cure Adam Schiff of California says he would probe allegations that Russia has financial leverage over Trump\nThe Trump Administration has ignored virtually all information requests from congressional Democrats but there is a workaround for that get the documents from friendly nonprofit groups to get them through the freedom of Information Act Austin ... is director of American oversight of progressive groups has now filing for your request\nIt's actually very difficult to enforce the congressional subpoena in court in contrast a freedom of Information Act request wish we could file we can go to court very easily and force agencies to be transparent\nIt's worth noting this for your strategy was owned by conservative groups than the Obama era\nHouse Democrats plan to have all the committee's doing oversight investigating cabinet secretaries who broke the rules protecting Obamacare finding out what went wrong with hurricane relief and tackling other issues that Republicans have brushed off\nOne master of oversight is former congressman Henry Waxman during forty years in the house he investigated everything from the tobacco industry to the Iraq War\nWaxman listed three goals have good oversight stopped a waste of money hold people accountable and make government work the way it should his word of caution to House Democrats don't do oversight the way the Republicans have recently\nThe committees in Congress used their power which is in credible amount of power and abused it for simply political points simply to advance their election interests Waxman said that's not what oversight should be about Peter Overby NPR News Washington [noise]\n\n\n[noise]\nThis is NPR News support for Ninety point seven news comes from the AC Florida medical center the AC Florida medical\nCenter understands that getting older can be difficult the AC is committed to offering all the medical services patients need to stay healthy all in one place more information is available at won eight five five four three one six two to four or sci fi medical centers dot com\nI take a look at traffic brought you buy done really sports ... east bound is a easing up just a little bit we've got just a little busy traffic out twenty seven for twenty nine about twelve minutes\nAnd other than that the west bound side we do have an accident at the turnpike to write lanes or blood so John Young parkway to the turnpike so I was about a Fifteen minute delay life for westbound\nIt also taking a look at north ... it is closed because of the water main break and in Lockhart cellphone edge water drive but for the city rode the road is shut down so the alternate is orange blossom trail\nSupport for Ninety points other news comes from Ron burger Kirk and Caldwell trial attorneys meaning the litigation needs of the business community offices in Orlando Tampa Tallahassee Miami and Birmingham, Alabama\nLearn more at ... dot com round burger Kirk and Caldwell medication it comes naturally to ask\nI this is Steve Inskeep with MORNING EDITION from NPR News takes a lot of people to bring you MORNING EDITION everyday on W. M. F. E. listeners support makes it all possible and your gifted W. M. F. E. now helps us be here for you everyday called eight hundred Seventy five twenty twenty and gives generously as you can ...\nTake a look at the forecast elite forty four wheel of a mix of clouds in some today with the well thirty percent chance of showers mainly the afternoon eyes today about eighty four tonight law about Seventy with a cloudy skies and tomorrow more chance of rain just a little bit better mainly after two o'clock behind your eighty five coming up in about ten minutes\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care\nIncluding nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com [laughter]\nGood morning I'm Steve in one of our NPR colleagues recently completed a cross country bike ride he wrote a group\nWhich sounded impressive on do we learn to offer these attempting to cross the United states while popping really on his bike yet the means to ride the whole way on one we'll\nOsborne is done this before when it took Seventy five days this time is aiming to raise money for charity by doing it faster It's MORNING edition\nSupport for NPR comes from this station and from the ... foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John de into Catherine MacArthur Foundation recognizing exceptionally creative individuals this year's MacArthur fellows and more information or at Mac silent dot org and from the listeners support this NPR station\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep\nParis was one of the first large cities to experiment with a bike sharing system what it introduced the leap more than a decade ago very leave I'd been a huge success at a point of pride for the city until this year when it changed operators and almost collapsed\nThe parents mayor has given the new valium operators until this fall\nTo get their act together well it's fall NPR's Eleanor Beardsley reports [noise]\n...\nTrying to unlock one of the colorful new vaguely\nDong the businessman says he's been riding the bike to work every day for the last several years and I can't imagine going back to driving his car or taking the metro vote he says despite ... troubles the system has improved a lot in the last two months\nOf only about ... before August Vacation there were no bikes here and you had to walk to a lot of stations to find one at least now their\nBikes for tens of thousands of Persians they leave is a vital mode of transportation and air traffic choked city so when a new transport consortium one available contract with a plan for electric bicycles people were enthusiastic\nWe're very excited with the new upper right or there were a lot of promises are new barge whiz high technology on new for truth\nThat female Abu way of Paris in the saddle a cyclist advocacy group lab ... says the new company smell van Gogh was a big disappointment\nIt was developed for biking um to for ...\nBikes were broken or unavailable the ducks that held them we're out of water daily Bailey bused plummeted from one hundred thousand trip today to a couple thousand parrots mayor and the Dow do said she was giving ... just a couple of months to get things on track the company hired crisis manager out no matter\nYou know who became ... new CEO now young says the first mistake with changing they leave operators with no lead in time\nWhich was I think crazy to do that because you must be the new stations and ... electrified ducks flew to treat by a to be a child for about three\nThings continued downhill over the summer now they all sat on top of the technical problems the company struggled with vi damaging theft and it tore us in the city of life\nUnfortunately because I'm French and I'm a ... to see the tone of uh in CBD cheap and he took the team of schools and so we had the beginning of ... which was ...\nSays the new they leave now fit snugly and lock properly and they're charging docks trips have now written back up to nearly forty thousand a day and he said the new they leave them like the old ones are available in the Paris suburb\nYou have to think about these people who have moved from the sort of up to par even the one to use a clean by golly treat by Joe and and we have ducks in stations but roughly ... type I read\nBack at the ... bully is still trying to unlock a bicycle\nFrom a pie and American public media\nSupport for Ninety points other news comes from the U.S that College of public health preparing students who share a belief in the common good and a passion for improving the public health offering certificate bachelor master and doctoral degree programs in online on campus and blended format more information is available online at\nPublic health at USF dot edu\nMiss the next Ninety point seven W. M. F. E. speaker series on Monday October twenty ninth Dr ... turned forty I Am Dr Hangst\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now have you been to the family\nDon't your support all uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty UMF eat out or slash events\nComing up for your local news well the reason you and so many of other uh so many others of us are going to work this morning we'll give you the details and the governor's candidates are going to slug it out one last debate tonight will tell you where you can hear it if you can't watch it and election day how many people here in vote have voted already many many it's nine o'clock\nGood morning Republicans of seeing a surge in fundraising what's driving their supporters to open their wallets and where's the party going to spend the cash the election It's MORNING EDITION from NPR\nThis is not only seven that we serve in Orlando Melbourne [noise]\nWonder stand this moment in Brazil's politics why not traveled to a rain forest I'm Steve Inskeep\nAnd I'm David Greene the controversial far right leader expected to become Brazil's president grew up in the rain forest and some people they are having a hard time supporting his environmental policy\nLater how Israelis reacting to the killing of Saudi journalist I'm all for show a Japanese journalist is released three years after being taken theory on Wednesday\nOctober twenty four started from the bottom now he's here turning thirty two years old happy birthday drink [noise]\nHere's an here's\nMy from NPR News in Washington core of the Coleman Turkish broadcaster MTV says Turkish police have received permission from Saudi Arabia and authorities to search a well on the grounds of the Saturday constantly in general they had previously been denied\nThis is part of the investigation into the killing of Saudi journalist democracy ... NPR's Peter Kenyon reports the consulate building has already been searched\nSaudi officials have acknowledged ... died in the consulate following more than two weeks of denials they said it was an accident during eight rogue operation a claim that skepticism from Turkish president Recep Tayyip air to won\nA presidential advisor says ... killing as quote a disgrace that reaches all the way to crown prince Mohammed bin summer everyone wants those responsible tried in Turkey rather than Saudi Arabia Peter Kenyon NPR News Istanbul\nThe Associated Press says the government of Mexico reports Central American migrants continue to file applications for refugee status as they arrive from Honduras El Salvador Guatemala thousands of migrants have joined together to walk north to the U.S border\nPresident Trump has threatened to cut off aid to Central American countries if they don't stop the migrants journey today he tweeted the U.S will never accept people coming into the country illegally\nRussia is calling threats by the president extremely dangerous Trump has threatened to develop new ballistic missiles after the U.S leaves a landmark nuclear arms control packed for Moscow Charles Maynes reports\nIn his weekly call with reporters Kremlin spokesman Dmitry ... called us plans to leave the intermediate range nuclear forces treaty and develop new weapons tantamount to a declaration of a new arms race such announcements made the world a more dangerous place and pass calls in Russia had no choice but to think of its own national security\nOr the U.S has yet to formally exit the nuclear agreement the White House has made clear to Russia it's intend to do so\nIn talks with criminal officials in Moscow this week Trump's national security adviser John Bolton called the Nineteen eighty seven Cold War treaty outmoded for failing to include countries such as China and Iran and pointed to Russian violations of the IMF packed to justify the U.S withdrawal NPR News I'm Charles Maynes in Moscow\nThe national weather service confirms that rare tornado touched down in New England on Tuesday it struck the city of Lincoln suburb of Rhode Island's capital Providence it's not clear how strong the twister was Beverly ... says she and her husband will never forget it\nHe could see that the Clinton fly through the air I hear him saying cleaning the chief of flying all over the place\nThe national weather service also reports more storms survey work is underway in North Providence Rhode Island but there's been no tornado determination there yet\nLottery officials in South Carolina say at least one winning ticket was purchased in that state for the huge mega millions lottery the jackpots where at one point six billion dollars it's not known who the winner is and it's not clear if there were other winning tickets you're listening to NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nAt a good morning it is and I know for for Ninety points them use I'm Schoenberg whether you heard at the numbers are in and it appears there is at least one winner a record one point six billion dollars were up for grabs Tuesday night in the mega millions lottery jackpot and according to South Carolina's lottery website of winning ticket was sold in that state\nThey have not reported if there any other top prize winners anywhere in the country\nThe Florida Lottery reports the multiple tickets matched all five numbers but to not have the correct Meg I'm all three of those tickets are worth one million\nAnd another player used to make a player to bump that two three million\nThe candidates for Florida governor are scheduled to debate for the second and final time three days after the first test the encounter Republican ... sent us some Democrat Andrew Gillum will meet tonight\nAt a community college near Fort Lauderdale on Sunday in Tampa to to ... over the economy race and president Donald Trump the fantasy former congressman as an outspoken supporter of Trump\nGillum the mayor of Tallahassee is a frequent critic of the president the winter the November six election will replace Republican Rick Scott\nNow election day is two weeks away but more than one point one million people have already voted in the battleground state of Florida new statistics released yesterday by the ... state division of elections show that nearly one numbered fourteen thousand people voted during the first day of early voting across the state\nMore than one million voted by mail\nThere are more than Thirteen million registered voters and the state Florida voters will be choosing a new governor between Tallahassee mayor Andrew Gillum and for us representative Ron descent of snow outgoing governor Rick Scott is challenging US Senator Bill Nelson a race for the Senate that could determine control of that body this is Ninety point seven\nFinger hometown to Capitol Hill budgets are part of our everyday lives I Know the chain taxes terrorists trade the choices you make this November connect to all of them\nWhen you give every month as a sustaining member you hope it covered the economic and political means that were affected years down the road he's had his support them means you'll need tomorrow today\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. feed on orgy you're supportive a dollar a day during this island Dr makes sure the reliable need to know information on that point seven W. M. F. E. stays exactly where you expected to be called one eight hundred Seventy five twenty twenty\nSupport for Ninety seven news comes from ... taxing advisory services to clients in central Florida and around the world more ... dot com media people now know video\nSay look at the roads brought you buy done really sports were the only uh incident is westbound on ice for Florida turnpike the rate lane as black so if you're on ice four west on from the far away to the turnpike\nFor Ninety point at a news can some land out how they're gonna whatever whenever and wherever Orlando healthy dedicated to providing many athletes care including nine hospitals and emergency rooms and urgent care location and forty six patients parenting more information is that he's doing now health dot com\nAreas still ongoing soul boy that area the alternative is higher ah where are you this is ... son with the thirty percent chance of showers and our highs and the mid eighties and about the Seventy will be our load tonight tomorrow greater chance of rain with ... eighty five right now it is nine o seven MORNING EDITION continues here on going so\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Steve Inskeep in Washington DC this is a tough mid term election for Republicans although there is no evidence yet that they're doomed\nThough the party in power usually loses ground Republicans are favored at this moment to hold the Senate they're long shots at best to keep the house although many of the decisive elections there are close so\nWhere to Republicans place their final bats\nSteven Law is with us again he leads the Senate leadership fund for the Republican side good morning thanks for coming by your morning so where did you just explain what the role is of groups like yours at this moment when individual democratic stark candidates people like ... rock of Texas have raised tons of money what is a group like yours do for the Republican side\nSure well we look at uh all these different races we try to figure out which ones are the most competitive and most importantly where our own involvement would make a critical difference and uh so we're placing our last that's\nIn these final weeks in the same way that outside groups and the other side are as well would you give me an idea of where some of those bats are going [noise] sure I as a majority leader McConnell a a described it they're pretty colorfully he said a lot of these races if not all of them are nice fights and dark alleys they're very very close\nAnd uh so we're investing in states like Indiana in Arizona and Tennessee and Nevada, Missouri West Virginia all states where those races are essentially within the margin of error and these are states where our money matters\nThis is NPR News is\nMORNING EDITION maybe point seven W. M. S. C. and I'm sure to to be back with you after a couple of days off well employees sixteen the better flip the state us from red to blue instead the fruit of the country's first Latina senator to Washington now the state could elect its first democratic governor you nearly Twenty years\nThat's part of the elections that are going on right now the terms very exciting stuff and MORNING EDITION is on top of it All right You're welcome to our fall silent Dr we're committed to more programming unless fundraising help support this tradition of listen true should fund raising by going you've W it must be the orgy\nSupport for Ninety points other news comes from Sheffield moment trusted legal advisors to businesses in all areas of commercial litigation and took a duty areas and beneficiaries in probate\nTrust in guardianship litigation offices in Orlando to their east to land in Port orange learn more at ... dot com shutdown looming expect more from your last term\nSupport for Ninety point seven news comes on when the world of central Florida ... lake orange in Osceola county since Nineteen Ninety five providing energy efficient double inflated vinyl windows inciting doors in hurricane protection in home estimates and custom measurements available more including financing information design ideas and energy savings calculator at window elderly into dot\nCom don't miss the next Ninety point seven W. M. F. E. speaker series on Monday October twenty ninth Dr\nHelen ... turned forty I Am Dr hang fish kind will present healthy finances discussion on how to fine tune your planning process for a better today and tomorrow for more information mentors repeated this free event go to W. M. F. E. dot org slash events\nIt's been a full two years since we first tried are less intrusive style of fundraising call the soil and drive and this is how we do it now WM iffy family\nShow your support for five interrupted programming donating a dollar a day does it W. M. F. U. dot ORG or call one eight hundred Seventy five twenty twenty\nSupport for NPR comes from the station and from Amazon Web services used by millions of customers a ws provides a range of cloud services and functionality from tools to security to compliance more information at eight of us just how dot com\n[noise] from see three I O T providing a software platform maples organizations to deploy artificial intelligence predictive analytics and you'll see solutions industrial scale learn more at the three I O T dot AI\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and baking and capital markets expertise along with a legacy of putting clients by natural wellbeing first learn more at Raymond James dot com\nMORNING EDITION from NPR News I'm Steve Inskeep and I'm David Greene on Sunday Brazilians elect a new president a year both in our world is expected to win easily he's a retired army captain and congressmen from the far right environmentalists see his policies as a threat to the Amazon\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming donating a dollar a day with W ... or call one eight hundred Seventy five twenty twenty\nIt's a small country town in southeast present ... spent his childhood midday drinkers and bond is a town square remember him well including Francisco Gianni a civil servant fifty I eat a lot of\n... voice said one day I'll be president has yeah Shani drinking beer with his brother Luis Antonio who says he used to go fishing with boats and out of\nFear that he's a sign of this town was his Louis Hi Tony ... an ultra conservative who stands up for family and religion and science corruption [noise]\nNo good officials say about sixty percent of this community support spokesman out a new recent Tony ... proud that both NATO grew up here\nThis place is cold Eldorado ... is the name suggests this is a shabby town or Fifteen thousand people it makes a living growing bananas and for tourists who come to the nearby caves and waterfalls full that our riches here\nJust a few minutes drive away they say in the town that they live in the middle of the Atlantic rainforest\nOr that telling the truth because here we are surrounded by far the Atlantic rainforest one stretch them much of Brazil's huge coastline before the country was colonized and began building cities most of the forest destroyed\nBut chunks remain the chunk in this area covers nearly twenty times more land the Manhattan the forest is one of the richest in the world and by the diversity it has tens of thousands of species many threatened lettuce with adult is an environmental activist an eco tourists guide\nAcute they'll pull the plug ... we have everything air planned animals insects micro Fonda\nEverything the forest around here is under government protection get both ... talks loosening Brazil's environmental licensing laws because he thinks they suffocate the economy Brazil's powerful agri business lobby hungry for new Lance of farming and mining is behind in his rebuttal\nIn the forest around Eldorado there about a dozen kill them Boehner's these are small impoverished Afro Brazilian communities often established centuries ago by Africans who escaped slavery these days ... says he sees all Brazil into the\nHit in the kingdom motives people haven't forgotten his posture racist remarks about them is taught him on ice who lives in one\nGame like fixate those people say he's very prejudiced and that he doesn't like black so we feel really offended\nLocal officials said Bolsa matter lifting that was it out of from the age of five to a team his father was the town dentist who ... and and I would also vice principal of a local school\nSays he in both NATO hung out with his kids swimming and the rivers playing soccer and hunting birds his mom was a washer woman in the boats and out of household he says but does this politically on the left and dreads also now to becoming president\nJust short for you know he's\nPresident should you not just people not to find them like also not a young [noise] Nike is creeping across the rainforest in a house on the elder autos big towns glad\nThe mad and his deputy aghast at an awards ceremony for locals who've completed fashion and bakery causes these two officials belong to a centrist political party and yet they say they don't see also NATO from the far right it's a threat to include\nThings like eat it fitted sit there not been able\nRica is the most amount of becomes president I'm sure he'll look kindly on the town his vice mad you know show\nWhat about the Atlantic rainforest fool around with him on and also monitoring the forest is Elvis on his greatest pressure to map the voucher mode eyes and the lungs of the region yet the town's broke it nice income and jobs he says\nSo it should profit from the forest allowing in where he goes non polluting industries and\nProtect it you can do both sister but I feel because you because I only have to I Believe shy about NATO knows that he says [noise] late last the data the Eldorado eco tourists guide disagrees not proposed Disney will never be the most amount of doesn't have any conservation policies is within\n...\nSo any form of threats to the Atlantic rainforest is terrible he says because once you lose it you'll never get it back\nThen Reeves NPR News El Dorado\nYears after he vanished in Syria a freelance journalist has confirmed safe ... suitor was taken by an extremist group but unlike other reporters who have been killed in recent years he has surfaced in Turkey NPR's Anthony Kuhn reports\nJapan's chief government spokesman you'll see de su ... told a hastily convened press conference on Tuesday\nThe Tokyo had received information from ... about the journalist forty four year old ... pay us to to you and you can you do you go to conjure informed us that Yahoo there has been released and is it an immigration center a turkey suit got told reporters\nYesterday I went to Syria three years ago to report on the fate of his colleague tangy go\nGo show was taken hostage in Syria in twenty Fifteen and beheaded by the Islamic state group\nYou know kind of feel lead a group known as the new front reportedly took an pseudo hostage it's not clear how he was freed in twenty sixteen video came out purporting to show yesterday he told his family he loved them any hinted at the nature of his ordeal in\nVery or a family and\nWhen you're sitting in a dorm room suffering pain he said oh there's no one to answer a no win respond or you are invisible you do not exist no one cares about cheap\nYesterday I began reporting in the middle east in the early to thousands he was taken hostage in Iraq and two thousand and four and leader fried at the time some Japanese voice to anger at freelance journalists got themselves in trouble and then had to be bailed out by the government [noise]\nYahoo does family mean wireless been eagerly awaiting news is mother told state broadcaster in each case that has she prayed for her son's release she folded little paper origami cranes at least one today more than ten thousand in all\nAnthony Kuhn NPR News Beijing\nWas go turn on the road if we turn out to voters that we've identified working with whatever the ticket if we go\nTo suffer the ramifications of\nHis life says that's the biggest challenge Nevada is a purple state that swing state trend in two thousand sixteen election largely Latino voters organized by to stay strong is labor unions to color near union\nThat it shows Hillary Clinton Democrats for the state legislature and delivered the first Latina senator to Congress Catherine ...\nIt's the model says Tom per as the chairman of the Democratic National Committee he's into that if the ...\nThe Democratic party nationally [noise]\nLeads to emulate what Nevada has been doing\nSince the beginning of twenty fifth sandwiches organizing early organizing everywhere making sure that we have\nA twelve months party\nWhere we are talking to people he points to the voting flyers at every checkout counter the Asian grocery store in early voting state he says attention to details like that is what's important\nYou know the audience they had a faith based approach to mid term elections you always afraid of the candidates would win but we didn't do much else\nCorrect says he thinks Democrats will for anywhere from eight to a dozen governors each election the popular Republican incumbent in Nevada Brian Sandoval is barred from running because of term limits\nLike has a chance against is your public an opponent and lack solve the current attorney general Irish ... campaign for this story too but no one responded\nNow something is shifting this year with voter turnout is higher than usual during the primaries and in the first days of early voting and the race is really a toss up according to polls\nDon't Austin is the editor at the data independent ended expert on it out of politics we needed a coffee shop\nIn Nevada electric reflects the nation's electric very polarized\nTo lower turnout election so it's tribalism Republicans are going to vote for the Republican the Democrats are going to vote for the Democrats\nLike the country now that it ... the Democrat in urban areas in the Republican in rural areas so ... says whoever\nCan turn out their voters were winning the governorship that's how animal actual one four years ago for for attorney general he's the only candidate in modern Nevada history to have lost both the urban areas and still won a statewide race\nBack at the grocery store a democratic candidate slack wrapped up his visit to people he needs to reflect in Las Vegas of transient character more recent arrivals or visitors who can't do\nA conservative to shake his hand and made her telling me they're not voting for him and then there's ...\nMarijuana [noise]\nShe registered as a sixteen to start to realize marijuana she got the money that came from it would go to her kids' school so far she says that\nWords a minute how\nCan we first started my my daughter attitude on the floor 'cause you know there weren't enough that's for the kids\nTo the for the person who will improve her three children it's education and the founding NPR innings my thing [noise]\nThis is NPR News\nPutting this is MORNING EDITION and the point seven WMD well you may have noticed some new programming that's been a joining us here\nWell there's a new program on Fridays Florida roundup every Friday noon right your your host Tom ... militia Ross impact the latest in local and national political news and there's a new podcast as well don't forget to download growing Boulder\nOn the WMD as we have genetically award winning showed follows great stories from people who have flipped the script on aging in our living their best life\nSo called a new programs in the new projects for you to check out do right here for you and be able to MIT dot O. R. G.\nSupport for Ninety points on the news comes from UCF house where expert positions care for the community with a dance gastroenterologist pathology services UCF health provides care for complex GI conditions including inflammatory bowel disease Celia\nDisease and Mel absorption disorders and offers a dance screening and treatment for chronic liver disease learn more you see I've helped dot com\nSupport for Ninety point seven news comes from Florida this historic host where October visitors can save her local flavors that farm to\nTable restaurant festivals and more foodies will enjoy the unique ... Florida's historic coast which reflects the coastal location and diverse heritage details that historical culture dot com\nDon't miss the next Ninety point seven W. M. F. E. speaker series on Monday October twenty ninth Dr Helen ... doctor hang fish kind will present healthy finances discussion on how to fine tune your planning process for a better today and tomorrow for more information in the worst VP to this free event go to W. M. F. E. dot org slash events\nMight be point seven W him if he is here for you date in in the hour you can be here for Ninety point seven W. M. F. you in the same way support news that matters with your own going monthly gift from your checking account or credit card\nAnd we'll send you a pair of maybe point seven W. M. F. E. custom socks call one eight hundred Seventy five twenty twenty or is it W. him if he'd done a war\nGood morning I'm David Greene with a story about the importance of return customers the BBC is reporting on a group of men who were about to Robert shopping Belgium until the quick thinking owners that have come back at the end of the day I'm going to have more money than\nThe guys left the owner told police to show up later they were skeptical but they can't\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways Akron care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com [noise]\nFrom Trader Joe's offering new products in every store and new episodes of the original podcast series inside Trader Joe's at apple podcast or where podcasts are available more at Trader Joe's dot com\nAnd from the listeners who support this NPR station\nThis is MORNING EDITION from NPR\nNews I'm David Greene and I'm Steve Inskeep good morning we are deep into an election season when a vital question is who shows up Karen Grigsby Bates from NPR's Code switch team met people who want to grab young voters' attention by making them laugh\nA new campaign called call the cops started a few days ago and it's thirty second spots are popping up on the Internet in one a guy with a laptop is sitting on a cafe patio he looks disgusted Lee into his recyclable cup as a stunning young black woman pulls up a chair\nThe coffee here sucks you know what else ...\nVoter suppression how did you know mining people voting\nThe parties will represent me specifically broken my right so the woman without her phone and makes a call nine one one\nReporter writing I have several things are going to be the next parents [laughter]\nPlanning on voting on oh I can describe him\nIt's a flip on all the white people the barbecue Becky the pool patrol palsy Starbucks suzy's who is called the police on black people just doing stuff\nDrilling in the park using the condo pool waiting in a coffee shop for business partner only in this video black people are calling the police on white once they think are being irresponsible citizens\nKaren the gallon heads acronym the nonprofit agency that commission for videos that are popping up on your mobile devices she gets that they're taking a risk riffing off whites policing black bodies for this campaign to cheat reverse parity\nThere's nothing funny about that but I think that tying that cue to civic engagement and using your vote to really make a stand about what kind of country you want to live in in the direction you want this country to go in I think that can be really powerful\nAcronym worse to elect progressive candidates be targeted digital media campaigns the gallon says call the cops is part of the not the vote project which has a specific goal\nIt is a program designed specifically for voters who may not vote in all election or especially in mid term election\nThe company approach director Malcolm delete it helped write and direct the spots leaves work includes night school and last year the comedy girls trip the idea of a direct pleaded voters appeal to him\nYou know I think it's just important for people to um just be aware and like we're not telling you know what was my particular but like hey but you got to vote you got to get involved in the process\nSee we sat down with acronyms creative director Vince Murphy who by the way is black and device called a cop series there's the hipster a suburban mom and a worried black man played by the daily show's Roy would junior who's calling the cops on\nThe table deals me some you'll make plans to vote November\n... number one I like to report an emergency in ... three white women just say yourself is Trumbull self in progress using filters ... the same thing over and over again playing the drama and they literally have no plans of voting in November scares me that's not a legal [noise]\nPlease her avocado [noise]", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Orlando", "day": "24"}