{"month": "10", "state": "AL", "station": "WNTM", "content": "So the impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little list sixteen months one hundred percent on line\nTo find out more text market to seven nine six four or five\nThat's an A. R. K. E. T. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line text market to seven nine six four or five\n... N. A. R. K. E. T. to seven nine six four or five\nReturning to Hank Aaron staying in ... thriller nights of my family friendly ... my cat or a knife in the car radio during spring we go down the skeleton cause anything to find your idea of these scary here and ...\nAnd it don't sound all ages open nightly for September twenty eight and thirty four inch rain or shine seven in the past is one of the kind like that can only see here in ... thriller for my dot com\nSunday October twenty first sports news today on the free I our\nRadio ads I check out our entire radio resentment inside a studio during a brand new episode with the legendary sir Paul McCartney\nKnow him and treat them with Joe leaving to talk about his new album Egypt vision and of course some discussion about a little band called the Beatles and we were ... when we were playing music or radio present forgive video check it out now\nAmerica likes to go out and you already have an ... and\nThe tigers and John welcome to the bill Cunningham show John please go ahead\nI'm a graduate of the nation wow what happened at Purdue I have no idea really too quiet [noise]\nFirst and we can identify anybody\nComing across the borders of gang member why are we sending them to Guantanamo Bay\nBecause what they say is I'm a refugee and I want to hearing the ... federal law says okay and and then we have made a\nGang member ... why can't we send them\nBecause because they have civil rights under the federal statutes do a damn a hearing and so we can't do it without a hearing mental we get rain sandbag Central Americans we can't know\nBillie it why can't we fed and have our induction or whatever I better like we have along the border at age ... Alaska well set up camp up there weaken private people up there\nNo no we can't be goes there's too many my friend John\nWe do not have the space we're not scaled don't have enough herring officers the camps are not big enough we're talking about this year so far one hundred and Seventy five thousand kind of under the radar we're talking about tens of thousands or more coming at one time were not scaled to do it doesn't work that way\nThe federal law ought to say that upon arrival\nFrom Central America or any other place you're sent back to your country of origin immediately that's not federal all federal law says Mexican Jess\nOther countries you know so if you're from El Salvador Nicaragua Guatemala or Honduras or Venezuela and you show up on the southern border instead of ... and running away from the cops border patrol\nThese individuals run toward the police and saying English\nI demand refugee status I demand a hearing then they have to be processed it takes to lots of time to process that person then give him a hearing and that's months from now that never transpires were not scaled to do it\nGuantanamo is too small\nMilitary bases are too small or talking about\nTens of thousands a month coming into America we don't have the money it doesn't work what needs to happen is the federal law needs to be changed with the cooperation of the Democratic party that says when you arrived here illegally you're mainly sent back to your country of origin without a hearing\nThat's it no due process because you're not an American but Democrats\nTend Democrats in the Senate will not allow that to happen they will not allow got change Trump wanted to get those so called dreamers might be twenty million dreamers don't know how many citizenship on the path to an exchange for a border wall to stop it but it can put a cork in a bottle\nBut Democrats wouldn't agree Democrats right now we're not agree they'd rather destroy the country and get political power they keep the country the way it is in Cape out\nAt ten or ... migrants from the most violent places on earth\nContinue ... about thirty five minutes I'm going to put a called into Corey Lewandowski the legendary campaign manager of Donald Trump's been Eighteen months is his campaign manager and then later on also\nIs Kevin ... of the blacks fear about the impact in the black community of tens of thousands perhaps millions of migrants coming into America from Central America the most violent place on earth\nContinually recalls one eight six six six or seven seven three three ... still counting and the great American live with you every Sunday [noise]\n\n\nWhat happened you used to go hours without visiting the bathroom now it seems like you're constantly getting up to ... and you're even getting up at night to go this is not okay listen\nThe makers of super ... to ... the number one prostate formula or introducing a new wonder pill super beta prostate piece three advanced\nWith three key ingredients that are great for your prostate if like picking treat prostate supplements and want to celebrate we're sending free bottles to men who want to cut down on bathroom trips yes your first thirty days supply is free pay shipping and handling\nGo one eight hundred three eight eight three eight one six\nEarly research suggests that an ingredient in ... three advanced may help support an normal prostate sauce combine that with the production and urges to ... and you have a formula you'd be crazy not to try get pi three advanced free\nGold one eight hundred three eight eight three eight one six one eight hundred three eight eight three eight one six one eight hundred three\nOn weekdays at eleven news radio seven ten WINZ GMO fields and Irish radio station id nine point nine W ...\n[noise]\nThe caravan of migrants move closer to the U.S border I'm an Carrick Fox News Mexican agents blocking the Central American migrants briefly before allowing them in the Guatemalan border Fox's William allows you and ask\nBill love your show every Sunday night thing I'm an ethical your producers have you ever do pockets for your regular show during the week\nOkay anyway um yeah my comment is that I think\nThere is something beyond that the a deeper steak beyond a shadow government probably the dark\nI don't know what it is it one world government is going to burgers or the child or or whoever\nKnow on that point in about an hour and twenty minutes I'm going to call Peter Wallison he's written a book about the bureaucracy the so called deep state\nHow that continues it continues today three thousand new rules and regulations a year hundreds every month it never stops is going on right now Trump's trying to stop it he's going to make a major pointed his book that I read\nThat that it cannot be stopped that there is a deep state in Washington that will continue even assuming Trump is there for eight years it will not be stopped that's his point he might run ...\nBut I Would agree with that completely and I I Want to tell you you know the people that road again governor governor I mean judge Kavanaugh right they were led by the Democratic party first [laughter] reason they don't want constitutional judges on the Supreme\nCourt oh no they ... they don't want a super legislature they they won judges\nTo impose rules and regulations on us that cannot be passed through the Democratic process and so they've done that the last thirty or forty years and when you got Gorsuch in Kevin ... who ... oh I Hope become constitutional judges they're going to say wait a minute if you want to convince your fellow citizens to have abortion or gay marriage or something else\nGo convince them in the legislature passed a law it's OK don't come to us to service the second legislature\nAnd I hope that said Kevin all ... states in Roberts and Alito and and not Thomas I I Hope that's what\nThat's what they do in the future is don't come to us to impose new rules and the American people go to the legislature go to the Congress go to the states go to the city has got to the county that's where it belongs\n[laughter] you know the Democratic party bill ... one ... in a ...\nA sure experiment in every day over there is a state of California\nYeah how's how's Venezuela looking\nOh my God yeah you know it yeah on the same [laughter] but we have a a man who will probably be governor and lieutenant governor\nOf data California New under very brown yeah which is a given 'em or a given new cabinet rank you fill\nYour eye out for them and Ohio is Gavin Newsom needs to be married to Kimberly don't boil\nOh friend of mine today\nI'll really know interesting yeah well this man is fairly lacking and character\nBecause he's gonna win and ... isn't it going to win nonetheless\nAgain John crock you were on going to vote for the work for the Republican running\nBut you don't want this man is so far left the banks Jerry Brown look look right a Ronald Reagan and all he wants to open borders he wants to pay for health care\nHow things automobile any thing that's illegal immigrant want in this state is broke\nAnd now we got proposition ... after the Democrats are fighting withdrawal repealed the gasoline tax which is about what ten eleven and a\nDoubling of the registry your piece here of a vehicle or can you not when I'm cooking\nGo I I don't understand you you go forward ten or Twenty years give millions of illegals free medical care free public education free lawyer free Dennis free doctor's free veterinarian services and free car now how does California survive it becomes Venezuela done it\nIn the dark because we're we're broke and I don't know why we're broke because I mean there is no real reason for it\nAnd talking about middle test job destruction talk about the pollution controls talked about the lack of job creation talk about in Los Angeles county schools there's fifty seven languages and dialects being spoken inside the public schools every day which means no one's getting educated in anything\nThat's right that's right it is a it doesn't make any any [laughter] you know what the Democrats do but I like I said it really does come down to that they want and open border of socialist state here and I I'm Sorry I just\nWell you know I like to know where it socialism worked\nThat it worked in Cuba Venezuela where does socialism work even the red Chinese Communist they're turning away from social as it doesn't work it doesn't work in Central America doesn't work in South America Brazil and Argentina and dig deep trouble that Israel is already there and so I can see the day in the future\nWhen we do have a hundred and Seventy five thousand so far this year I can see the day we have one or two million or three million we have a two hundred and fifty million who live in South and Central America Mexico given their druthers would move to America two hundred and fifty million were and how are they going to go how does that work anywhere in the real world\nContinue their causes go to Cheryl in ah New Jersey Shirley New Jersey welcome to the bill Cunningham show Cheryl go ahead\nDown the ban Hungary all ban who got re elected and kick out Joe and\nThrow around where the ... campaign went along with these immigrant storming the hunger ring down on whom dry Therrien route throw around with had the universe sitting there\nIn uh in Hungary Budapest, Hungary and pick the on band said we're going to tax all intervene a court that ... that they're giving at twenty five percent that are out there are a black\nI'm a victim on ban says no gender starting that college who said that uh we got to raise the tantalizing way we don't want them going calming we want more Hungarian\n[laughter] sure I Love eastern Europeans coming I'll say this I Want every legal immigrants coming to America because they are tested\nThey our research we know who they are and they tend do a pledge allegiance to our country I Want every illegal and we're going to say to hell where they are and I want a government that enforces the law and God Bless America that we got the trumps during the White House imagine of Hillary was there right now which you would be doing let's continue now we have\nTwo lines open if you call now eight six six six four seven seven three three seven eight six six six four seven seven three three seven as we continue a cause the Missouri tendency Connecticut in Las Vegas Eighteen minutes after they are built counting and the great American why with you every Sunday night [noise]\nStart your morning with uncle Henry news radio seven ten Dylan un P. M. [noise]\n\nAre you considering a safe or gun safe to secure your valuables and firearms if so before you spend\nAny money on any typical running all male safe check on the amazing handcrafted rhino iron works shapes had rhino safe dotcom see for yourself why rhino safe customers are so passionate about their antique industrial style safes and if you're a gun owner you'll love the convenience of the swing outgoing rack\nRhino has a huge dealer network break pricing warranty in customer service so go to rhino safe dot com today that's rhino safe dot com\nThe seventh Daniel fall flooring yard sales going on now with incredible\nDeals in lumber liquidators we've got hundreds of floors on sale up to fifty percent off in stock and ready to go see big on waterproof floors all on sale from just thirty nine cents get would look limited flooring all on sale up to forty percent off free finished\nHardwood and bamboo starting at Ninety nine cents plus special financing stop by your local lumber liquidators store or visit lumber liquidators dot com today\nMessaging theories may apply burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree to further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur in thought leaders\nAnd what if you could earn that degree in his little list sixteen months one hundred percent on line\nTo find out more text market to seven nine six four or five\nThat's an A. R. K. A. E. pi to seven nine six four or five star to your online MBA information\nManagement or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line text market to seven nine six four or five that's\nYou know California\nFrom the old we're bombing in ... studio gold you five ... disease radio seven ten W. N. D. M.\nFox News ... Stevens the Saudi Government acknowledging that as a journalist ... show gave the Saudi ... and turkey but insisting\nThat nothing is on the monarchy [noise] we have a check on him as we haven't seen that too [laughter] so he obviously this mistake made the mistake was to try to cover that come from the\nSaudi foreign minister Adele ... during an exclusive interview Sunday with Fox is red bear some good news at the gas ... we have\nA nickel decline in the average price of regular grade at ... to in fact there might be a little more to come could oil prices have dropped and refiners are passing through these dropped into the wholesale gasoline Marquette\nEndless drove the lumber publishes the lumber survey this is Fox News [noise]\nYour home for Gulf Coast mornings with Kelly ... don't go on to use radio W. N. G. M. M. [noise]\nCorey Lewandowski welcome again to the bill Cunningham so Corey how are you I'm doing great bill how are you today\nDoing well you know about a week ago I spent some time with the president to privately it was wonderful you spent like hundreds or thousands of hours with the guy and I said on the air the other day that uh\nThere there's a differential between what I see in the media sometimes with the president and how he truly is before we get on to so many issues going on especially the mobs versus jobs and all that kind of stuff you know the American people a measure of the man himself\nWell you know I've spent so much time with a then candidate Trump and now President Trump he's truly cares about other people he's extremely uh magnanimous and private he is funny\nHe's gracious he's always asking about how my family is doing and what he can do to help me that just who he is and if you listen to the media you know they tell you he's the worst human being on the planet help but the truth is he's exceptionally\nGracious I've seen in so many times helping people that never get the story told because he doesn't want the story told but he's always there to help whenever he can\nWhy is that because the media ought to be calling balls and strikes you know they ought to be saying well this is what's going right this is what's going wrong media ... Research Center ... well ... one of my buddies\nEvery few months as the media coverage is Ninety two percent negative Ninety five percent negative the media is protected by the U.S constitution only business in America that gets constitutional protection and the media should call balls and strikes a lot of good stuff a lot of bad why does the media only report the bad enough to good\nThey only report the bad in this administration the Obama administration you would think that our economy is growing at four percent and we had more Americans working than any other time\nIn our nation's history they'd conflated those to see the Trump agenda is not what the mainstream media wants to talk about I here's a great example just last week I think it was\nA President Trump getting interview with Leslie stall for sixty minutes she interrupted him sixty five times during that interview had to put that in comparison when sixty minutes during an interview with ... bomber a couple of years ago they interrupted him more times have their own agenda their agenda is to make the president look bad\nNot to give him credit that he deserves for the successes that he's had because they're no longer in the business of reporting the news and they are now in the business of making the news and that the big change over the last two decades\nCorey Lewandowski the president or the other night Montana friend it as mobs versus jobs the only difference is the Edmond J and I think that's brilliant on his part because one look at Brett Kavanaugh will\nLook about a trucks that ever trumps sticker on getting burned I look at congressman getting shot I look at the Republican congressman Republican operatives getting beat up and getting stuck in the side with tens\nI look at how you're confronted in airports in restaurants mobs versus jobs and do you think the average American I think forty percent of what the president forty percent oppose them there's twenty percent going back and forth do you think that the moniker of the president mobs versus jobs is going to stick\nI think it will stick because the American people see and hear what people like Eric Holder had to say very recently when they're down we kick them and we kick them in the head you know the the calls to violence by the leaders of the Democratic party whether it's\nA Maxine Waters or others think if you see them in a gas station if you see them in a restaurant you go after them you don't give them a break\nYou know that's not the way our country is supposed to be\nAnd I didn't support proper Obama but never ever ever did I ever remember\nRepublicans or conservatives for that matter going after members of the previous administration when they're eating dinner at a restaurant we've now seen it with\nSarah Huckabee Sanders sleeping with secretary Nielsen ... we've seen with Senator Ted Cruz we've seen what happened to congressman\nSteve ... where he almost lost his life because the mob violence antifa is so out of control your goal on their desire is destruction it's not to make our country better this president is created I think\nOver for a million new jobs in the last Twenty one months and that's where we should be doing look even if you don't want this president if he didn't want him to succeed you want him to succeed because you want our country and succeed and that's what the differences\nThat Democrats I hate to say this hate this president more than they love their country\nOr the other issue the culturally it has acceptable to me the fame and to make fun of industry or the president and the first lady you may recall about a week ago TI who's a rapper that I Will watch nonetheless I sold them TMZ and I did a video in which a look alike millennia Trump\nWas stripping nude in the oval office performing sex act in the oval office and it was culturally acceptable to do that I'm sure he might sell a lot of lot of his songs and records from that can you imagine three years ago if a country artist\nHad to pick the Michelle Obama stripping naked in the oval office in performing sex acts in the oval office what would the outcry from the media bend it but was Michelle Obama\n... it would be front page news for a week on end that wrap that the the country artist would have had his life\nProbably threatened on multiple occasions but look let's go back to just about a week ago Hillary Clinton gave an interview about her husband and his relationship with Monica Lewinsky and they asked her new you think that relationship was inappropriate and less than two weeks ago her answer was\nNo it was appropriate because she was an adult he was the president of the United states\nLeader of the free world Monica Lewinsky was an intern and Hillary Clinton is still justifying her husband's behavior can you imagine for one second that was the the converse of Donald Trump had done that with\nWhen she was secretary of state in the Clinton Foundation and the fact that she lost her security clearance political re litigated all with quarterback in front of the Democratic party\nNo court she'd be a wonderful candidate I mean I could not think of any one more qualified to represent the Democratic party than Hillary Rodham Clinton that would be a beautiful thing\nIf you have my help I think you and I can encourage her to clear the field critics I think we're going to get her to the\nLast election from Bernie Sanders right back and please shoring system just like you know last time and\nShe did a great job great job by Corey Lewandowski will do it again give me your production in about two weeks house in the Senate give me your production\nUh I think in the Senate Republicans gained four or five states increasing the majority and in the house I'm going to say that it's a prediction the Republicans are going to hang on by two or three feet to retain the majority and keep the Trump Pence agenda moving forward\nGod Bless America Corey Lewandowski Trump campaign manager thanks for coming on the bill counting am showing my friend will do it again\nYou every day and God Bless America let's continue\nWith more built counting the great American live with you every Sunday night\n[noise] for me\nIs power news radio seven ten WINZ [noise]\n\nHave you tried that trendy need eating out you can have months of frivolous fine with people who just love to play a game but if you are ready for something more grown up trying to match\nOver thirty thousand new people a day are heading to match for grown up conversations that lead to great date and beyond our listeners they go to match dot com concerts for free today you sign up its end informative profiles to get a deeper sense of the people you'd like to me start for free today at match dot com that match dot com\nThe seventh Daniel full flooring yard sales going on now with incredible deals lumber liquidators we've got hundreds of floors Ansel up to fifty percent off in stock and ready to go see big on waterproof floors all on sale from\nJust thirty nine cents get will look limited flooring all on sale up to forty percent off\nRefinished hardwood and bamboo starting in Ninety nine cents plus special financing stop by your local lumber liquidators store or visit lumber liquidators dot com today\nWhat happened you used to go hours without visiting the bathroom now it seems like you're constantly getting up to ... and you're even getting up at night to go this is not okay listen\nThe makers of super ... to ... the number one prostate formula are introducing a new wonder pill super ... prostate piece three advanced with three key ingredients that are great for your prostate if like picking three prostate supplements and want\nTo celebrate we're sending free bottles to men who want to cut down on bathroom trips yes your first thirty days supply is free\nPay shipping and handling just dial hounded two fifty on your mobile phone and say the key word\nEmpty early research suggests that an ingredient in P. three advanced may help support an normal prostate sauce combine that with a production and urges to pay and you have a formula you'd be crazy not to try try prefer you draft free dial pound to fifty on your mobile phone\nAnd say the key word empty again dial pound to five zero\nAnd see the key word empty\n\nRadio set up right where I Am I already knew you end up for him and the day ... dry hot reading Trump campaign\nWhen he was in charge I tell you what things are going very well things are going to go well believe it or not put me in the camp who believes the twenty Eighteen and twenty twenty it's got to be very close to twenty sixteen that is I Believe the Republicans will keep the house by a slim margin\nAnd pick up seats in the Senate maybe four or five seats\nAnd mix tallies doing a fabulous job\nIn Arizona and I'm looking forward to a some sort of a from the grave endorsement by Senator John McCain of mix Sally who's an American a pilot hero flyer\nWho was the defending the nation while her opponent was basically burning the American flag in Arizona and calling those who live in Arizona part of a meth lab so uh when I look at what's happening\nAround the country especially in Nevada and uh\nArizona what's going on in Florida I have great hope that when it's all said and done much like in twenty sixteen the Republicans in twenty eight you know going to shock the world and pick up Senate seats in and you also keep\nThe house they tuned coming up next from live from St Louis Missouri You will be Kevin Jackson the watch fear who ah was banned from Fox News about three or four weeks ago we're going to talk about what he said that got um banned and more of a long becomes available eight six six six or seven seven three three some still counting on the great American live with you every suns you know [noise]\n\n\nMessage into your ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little list sixteen months one hundred percent on line\nTo find out more text market to seven nine six four or five\n... N. A. R. K. E. T. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs online text market to seven nine six four or five\nThat and they are ... eat\nThe bottom of the hour breaking using one news radio seven ten WINZ out a whole meal and I ... radio the many nine point nine W ... three mobile [noise]\nBorder patrol is getting ready I'm an Carrick Fox News the growing caravan of Central American migrants continues to march toward the United states Fox has gripped Jenkins is in McAllen, Texas\nThis is a border there's already overwhelmed just yesterday\nClose to complete and utter disaster or ally and you're right about that but I think the reason that those women didn't do it was and we didn't get too much introspection and this but if you look at Christine body for life I bet you we find out\nThat you know there is a history of her but nobody wants to discuss and that's why she's sling the way\nYou know when once it with God I'm not going to press they tried to find out you know nobody bother me leave me alone\n... ... as you know\nIf I were Cavanaugh I would've initiated a lawsuit against everybody in the food chain including\nAll the congressional gangs that went after him including Chuck Schumer for the record for me and not just like a girl it's a guy to Chuck Schumer is a skeptic because he's a guy who was complicit in as a roommate or\nUh from New York there are all people they just want to watch somebody be destroyed over a thick ideology noted left isn't and I think it's pathetic\nAnd the far reaching ramifications impact the guys like Bill Cosby\nWho sits in print than at the age of Eighteen years old an American icon sits in prison in his eighties over allegations that date back for five decades meanwhile a guy who\nOf vowed then and I mean you know denial sex abuser Bill Clinton runs around here campaigning\nI tell you it was amazing ... you had a situation where he actually raped a woman who told us that Juanita Broderick\nWhen Clinton raped her with a bloody lamp told her a roommate what happened the roommate solved the blood on her lap saw her pantyhose was torn she actually had four or five corroborating witnesses as the event took place and then they also had the so called uh Arkansas state troopers confirming the fact\nThat the one eight abroad ... was actually raped and then you have while he's in the White House is president sexually groping in molesting Kathleen Willie in the White House\nAnd and that was well known and corroborated but the media completely ignored both of those events because it didn't fit did it but it did to go there Brett Kavanaugh\nAbsolutely and so that that's the double standard in in the bigger double than it has to do more with men\nIt's me too movement and trying to to I Love how the left tries to migrate thing how they try to get us to take ownership so the ownership of me too because a bunch of left this lecture at Hollywood lefty [laughter] okay it's Harvey Weinstein's of the world with all these young on your news and these old school actresses and all these ... political\nFeminist taking pictures at Harvey going to his party's extending its virtues that awards dinners and so on while enabling him to do exactly what he's been doing for women for a decade\nDating back decades and and all the trail of women who did exactly what Harvey ask them to do getting their butts\nOut and then suddenly when their careers are waning they decide they want to turn states' evidence but then what's interesting to me to a ends up being\nA bill ends up being part of a\nWoman being used against Kavanaugh being used against a high powered CEOs of companies [noise] this movement is born a the lectures activities of left us in Hollywood that and and and the entertainment industry where they marginalized objectify women like crazy\nAnd suddenly a guy like Kavanaugh they want to make him the\nPoster child I mean it just it bores me\nAnd when it came time for Obama to put his daughters on summer in terms physicians would somebody\nA Brock Hussein Obama and Michelle Obama is elected Harvey Weinstein\nSaid to take their daughters end of the Hollywood scene when they knew or should have known exactly what was going on from all of their connections but they couldn't care less about Harvey Weinstein was a star Harvey Weinstein and access Harvey Weinstein was are making millions of dollars and giving millions the Democratic party including the Obamas\nSo they set their own daughters end of the care custody in control of Harvey Weinstein and the media didn't cover that either did they know they didn't\nBut here's what's interesting about that so they know Harvey their daughters are on touchable but you know whose daughter's aren't bill the daughters of ordinary people there and a daughter that you know that you got to be concerned about cause harm people take advantage of them but the the what the what rocket bomb and selling us\nI have so much power I Know that this guy that Electra is left is who will take advantage of women and every time but I can put my daughters with him but don't you dare put yours that's exactly how the left stacks up I can do it you can't because I'm covered but you're not\nAnd and look at it the less than it is a precautionary tale [noise] for many many boy I've said many times what harmless thing is your kid your son going to do at the age of Fifteen some woman's gonna come back twenty five thirty years later and say oh look at what you did to me more heat I ain't gonna remember it\nHe is not it's going to be insignificant to him and her but\nBecause something may be important in life she decide I'll take him down for what\nWell you know it's it was hanging by a thread two weeks ago and now he's on the court and I think the other issue I Want to get your perspective on this Kevin Jackson and the black sphere which is the what's happening now with the Honduran migrants\nComing through or Guatemala into Mexico there right now is three to five thousand strong and they're heading toward the Texas border this is a terrible event for the Democrats\nOver the next two weeks before the election they have the video and the pictures of thousands of migrants\nWhenever I watch MSNBC all I hear about is women and children then I see the video of these migrants coming to urban areas in America and they're almost always young males and the young women tend to be raped or sexually molested the men are drug meals and I'm sure there's good family members among them\nAnd Kevin Jackson of you and your wife and your children were in a\nOr in Honduras and the bill Cunningham and my wife and kids were in\nAnd we're in Honduras living the horrors of socialistic left wing military hunter regime the first thing I Would want to do would be to get to America I understand it completely\nBut along the process it gives billions of dollars damage Thirteen other gang bangers to provide a passage Everytime you go through some other drug infested area Mexico you got to pay\nHomage you gotta pay either sex or money to even pass through and and live by the time you get to the northern part of Mexico according to sixty minutes about two months ago there was hundreds of dead bodies because some men did not want to participate\nAnd becoming drug meals to give drugs into America\nSome women were killed because they did not want to be ritual is typically raped on a regular basis\nThis is a horrible journey I watch MSNBC this is about refugee status of desperate people I watch other news outlets and this is terrible Trump's going to send supposedly our soldiers to the southern border to stop it\nAnd all of this is playing out during an election that the Democrats supposedly have in the bag because hundreds of millions of dollars up to a billion\nAnd it's been pumped into these campaign or buy a Tom Styron by Bloomberg and others in order to uh to me are Republicans all over the country get get get me over the next two weeks ... how's this going to play out at like ... or early on November the sect\nBut Democrats have missed every time they no longer have their finger on the poll from the American electorate people want our border protected so they and they also get that this is fake news it's contrived it started as a hundred and sixty people now it's up to four thousand now and so\nWhat prompted the right thing he said Honduras these people show up losing their aid Mexico I guarantee he made the same call to the new president of Mexico and said look\nIf these people get where you were going to renegotiate our trade agreements we're going to look at the age where he would send to you\nFrom Mexico the polling military on the southern border got just heard this literally today good so Mexico's going at it on doors I bet you will send buses the say\n... you're going to get back to our country or else and and the what the how they're going to play out to Democrats again overplay their hand\nThey think that there's some issue that's going to be the guy the you know the ... the division point with Americans in Americans overwhelmingly won our borders protect that we don't want these migrating horns to think that they can just come anytime they want\nSo whether whether it's the kind you back or whether it's the Kavanaugh fact whether it's the stars of an investigation of the Russian they'll which we now see that that is completely been busted apart because the\nJudge Royce Lamberth who just said I don't understand how Cheryl Mills isn't in prison you know ... and Hillary Clinton a bunch of others and then there's a conspiracy with the FBI so that's about to break that's going to be the big story this week [noise]\nAnd then you've got this yet again read a dirty patient of the whole border issue that Trump's going to send troops and say you're not going in no\nImpact on doors you know Kevin Jackson it's bad for a hundred doors in Guatemala and Mexico\nThere's ten uh males generally males to America because it takes away the ability of Hondurans to reform their own government because the safety valve is there to send people to other countries and so what's left are those who cannot function and do a brand new society it's bad for those countries\nBut before I let you go about two minutes\nThe Kanye West he's in Africa right now you're a conservative black male which is extremely dangerous Kanye West is radioactive according to media he he's a conservative now black male who ah five six years ago said that George Bush wants to kill a wants to kill black people but now he's flip the other direction\n[noise]\nMan\nTell California\nMy ... and how does that affect me\nThat and much more in the new episode of the uncle in racial podcast available on the ... heart radio ads\nFrom the own lawyer plumbing and dream studios clearly best Joyce is news radio seven ten doubled un GM\nFox News impulse Stevens forecasters watching hurricane will uh gaining strength to a game of Mexico's Pacific coast it is a\nCategory for hurricanes are dangerous hurricane maximum winds and you're a hundred and forty miles an hour or it's headed for the south western in West central portion of Mexico right now it's about two hundred and twenty five miles south south west of Kabul Korean this Mexico\nHurricane specialist John ... Hurricane Center the Saudi Government admitting to the deaths the Washington Post columnist Jim ... of the Saudi ... live in Turkey but promising a full accounting\nThis threat is to do this for a long journey we are determined to uncover every soon we are determined to find out the toxin we're determined to punish those who I was home schooled this murder Saudi foreign\nMinister Adele allows you bury during an exclusive interview Sunday was Fox is Brett Baer this is Fox News\nRoger she don't have any writers year unscripted show is inherently improv show just W. when GM [noise]\n\n\nI thought like hunting and the great American is continuing to suffer as they were simply continue\nThe other night on Fox I'm watching and uh the speaker made a comment the expert on the administrators agency slashing the Congress that\nMade the comment that every year and matter who's the president something like three thousand new rules are put into effect by the alphabet soup federal government agencies and uh they're simply a room making that becomes law making which is completely different than what the founding fathers intended what the constitution did not intend\nThe consequences had been not necessary rules and regulations the costs the American economy billions of dollars every year\nThe constitutional separation of powers been compromised in other words\nThe ... the the agencies or the federal government or the state government agencies were mainly the federal government agencies are accountable to no one other time lawsuits filed might be years before their compromise and you can't even\nBegin to stop three thousand new rules going into effect and then as a consequence we Americans are going to question the legitimacy of their own government when it's completely on accountable a good man Peter Jay Wallace since written a book judicial fortitude\nOr subtitled the last chance to rein in the administrators state and uh Peter Wallison welcome for the first time the kind of a game show Peter how are you\nI'm fine thanks to go to have you here a couple of weeks ago of course we got a the fifth conservative vote\nOn the Supreme Court Brett Kavanaugh which is a good thing in his writings and the second circuit us court of appeals where he was for twelve years Brett Kavanaugh often knocked down the administrative state ruled by rule which is a great thing now describe the American people what is the administrator state and how does an impact our lives\nAre they administer the aid is all of the federal agencies including everything from the Treasury Department\nAll the way down to the FCC\nAnd their hunger grab them and the way that they impact our lives is that they make a lot of rules and regulations based on staff who in many cases generations old and those rules and regulations are not only planet for all\nThat is there are many of them but they have a major effect on our lives and the ... percent the book that I have written is to explain that the we have to rein in in in some way\nAnd it was ... when the when you when you say we have to rain the men who is we\n[noise] uh well the American people have to bring them in and the way to do it is so unfortunately the only way to do it is through the court system and that's why your point about a ... Brett Kavanaugh having been\nConfirmed for the Supreme Court is very important because I think he is the road of the five of the five member majority who would be interested in raining in the administrative state by cutting back on the activities and the rules that they are able to make\nCan you give me a concrete example and I think government agencies I think the FCC I think the IRS but\nYou're telling me there's hundreds of government agencies bureaucrats about about one point two million strong new every day meeting offices mainly in Washington memorial all over the country\nAnd then they got to do something they just can't sit there and drink coffee all day so they sort of not enacting rules because they want because they have some generic piece of legislation giving them real making powers and then they issue these three thousand new rules that day that must be complied with how much harm is not causing us\nWhere I think it's causing a lot of harm in the sense of business is of course it creates a lot of regulations that they have to comply with\nCompliance activities are very extensive for business is one of the estimates that I have in the book is that each near it car who really in dollars to comply with government regulations\nThough that ... trillion dollars actually gets passed on through all other Americans who are consumers of the of the products at these businesses are there so\nThat an important factor in the fact that ... trillion dollars this more than the government actually ... ah either from businesses are on the individual each year\nFor a very significant thing I'm Glad it can be turned back town and they can be reduced give me\nThe idea here and described in the book is that the court can step in and begin to review carefully the legislation under which all of these rules are made and very frequently\nUm the rules are based on laws that were ... years ago I'm kind of generations ago and they are in perpetrated by the administrative agency to give them the authority to all these new rules\nAnd the court can look at that legislation again and say wait a minute you know gone too far the Congress did not give you the authority to make this rule\nAnd there are a number of examples in the book where um you can see that the that the agency has gotten well beyond what Congress actually authorize so\nIf the court is willing to step in and take those steps and that's what fortitude is necessary that's why the book is called the national guard it do they have to have the strength\nOf character that go in and make these decisions that will turn down regulations of um of administrative agency then we can actually beginning to reduce the amount of regulations and rules have come out of Washington\nPeter Wallison let's go back in time does not hot summer in Philadelphia and Seventeen eighty seven article one they said the founding fathers said and we believe that the Congress the house in the Senate or the most powerful instruments ... government because of the best reflects the will of the people in reality at least for the past", "year": "2018", "show_name": "Ground Zero with Clyde Lewis", "city": "Mobile", "day": "22"}