{"month": "10", "state": "GA", "station": "WABE", "content": "[noise] our head writer\nAnd out in America correspondent is\nWriters around my yard Greg has\nMarketing regions Patrick Clara Katie Rich and Rachel ... thanks to the\nOf live from here Debra back how barons Rochelle rocky bend those who do that and to read the bridges many Calhoun Tom Campbell Claire Coffee Jason Colvin Diana floating jeopardy now look I\nSam husband Janet's Kaiser Ben Miller emerald O'Brien Joey Ryan ... Kathryn pleasure no men\nJason warmer thanks for the staffing grew up hardly strictly bluegrass and our local public radio members that\nNext week for our show at the palace theatre in Saint Paul Minnesota with\nDirty projectors and this ... brother [noise]\nLove from here are supported by staples with printers Burbank toner cartridges for home and the business and then store print shop for customized presentation\nBooklets have manuals more at staples stores or staples dot com [noise]\nWe want to leave you with a with a store and buy another well one of your favorite songs for sly stone [noise]\nI can be wrong\nMile believe ...\nAnd then made those\nMen\n\nThe all you know\nWe are shame [noise] ...\nCan figure out the back room in\n\nEvery day people\nGame yeah\nAmerican public media\nAnd this was ... one W. A. B. E. plant life from here is back Saturday nights and Sunday nights at six o'clock cooling off down to the sixties this evening and then tomorrow partly cloudy right back up into the mid eighties\nWith everything going on in the world you listen uh WABC eat because you're trying to stay informed\nSo why not supportive and on this or Seventy ... anniversary we'd like you to have our limited edition seventies anniversary T shirt\nIt's yours within early sustaining donation of ten dollars a month\nThe shirt features radios from the last seven decades in\nHer seventies anniversary love them\nTo stay informed show your support\nHelp us and the ... early at W. H. B. E. dot org slash donate\nFor every million baroque era composer there were countless other parochial musicians whose\nNames are not nearly as well known and his reputation didn't necessarily have the staying power over the centuries but that doesn't mean they weren't as talented or that their music wasn't as enjoyable ... will feature some of the composers you've never heard of in the spirit of discovery on this Columbus Day holiday weekend\nThis evening at eight or Ninety point one W. A. B. E. N. O.\nThis Sunday baroque I'm Suzanne Boehner [noise]\nFor every familiar composer like Johann Sebastian Bach ...\nTony of all the and George Frederick handled there were countless other parochial musicians whose names are not nearly as well known and who's reputations didn't necessarily have the staying power over the centuries but\nNecessarily mean they weren't as talented or that their music wasn't deaths enjoyable neighbor featuring some of the best composers you've never heard of in the spirit of discovery on this Columbus Day holiday weekend\n\nLive from NPR News in Washington I'm Janine hurts in upstate New York to vehicle crash involving a limousine left twenty people dead police of the limo failed to stop at an intersection crashing into an an occupied SUV before\nLanding intervene everyone in the limo Eighteen adults were killed along with two pedestrians National Transportation Safety Board chair Robert Sumwalt says it's one of the worst accidents he's seen in a while\nTwenty fatalities as just horrific about on the board for for twelve years and uh this is one of the biggest wall of water and we've seen in a long long time\nThe NTSB is on site investigating it happen in school Harry about forty miles west of Albany\nPresident Trump is holding several campaign rallies this week as he fights for Republicans to maintain control of Congress as NPR's Tamara Keith reports he started last night in Kansas holding the confirmation of Supreme Court justice Brett Kavanaugh\nPresident Trump says the one week delaying the confirmation vote for Kavanaugh turned out to be a great thing he told cheering supporters at a rally in Kansas that Republicans have been energized by the fight\nSomething that is reflected in recent polls Trump said his backers could show how they feel about it by voting in the midterms is November\nAnd you allow the wrong people do get a job offers fingers ...\nHistorically the president's party take that drubbing and the first congressional elections after he takes office one question is whether the GOP enthusiasm of recent days will last democratic enthusiasm has been elevated ever since Trump's election camera Keith NPR News\nFlorida's governor Rick Scott has declared a state of emergency and more than two dozen counties head of tropical storm Michael which is expected to turn into a hurricane late Monday or early Tuesday\nToday is a time to get a plan do not put it off there isn't any reason not to be prepared to keep your family safe\nThe governor activated five hundred National Guard troops and warned residents that the storm surge could affect areas of the state that aren't in the storms direct path\nThe national Hurricane Center says right now the storm has maximum sustained winds of fifty miles an hour it's about one hundred Ninety miles from the western a tip of Cuba storm could be a category too by the time it reaches the Gulf\nIn Haiti rescue crews and civilians were digging through the rubble looking for survivors of last night's five point nine magnitude earthquake that hit the northern part of the country when a strong five point to magnitude aftershock hit the same area the U.S Geological Survey says it's the first significant aftershock at\nLeast twelve people are dead or the one hundred or injured several buildings have been damaged or destroyed the country's president said today who makes sure proper systems are in place to help the victims Haiti still recovering from the twenty ten earthquake that killed at least one two hundred twenty thousand people you're listening to NPR News\nOne at ten people in the United states ends up in the emergency room due to injuries in a given year and\nAlison Aubrey reports a new study those shows just how costly those injuries are researchers analyzed data from hospitals treated injuries during two thousand Thirteen they tallied up the cost of medical spending last work time and decreased quality of life\nThis study found twelve million injuries are caused by falls or being hit by an object accidentally another three million injuries are caused by car related accidents there were about Seventy thousand cases a firearm\nJuries and about ten thousand near drownings when you add it all up the annual price tag tops one point eight trillion dollars the author said many of the injuries are preventable and quantify the costs can encourage prevention efforts this study is published in the journal injury epidemiology\nAllison Aubrey NPR News\nDozens of California's Central coast may see unusual sites and hear unusual sounds today as the sex marches I use the falcon ... rocket and for the first time space actual attempt to land of the vehicle on a ... near the launch site and not on a drone ship in the ocean the\nLaunch of the ... will take place at seven Twenty one pm Pacific time from ... air force base here for says residents may see multiple engine burns by the first stage and the third one also be one or more sonic boom SpaceX has flown boosters back to land after launches from Florida but as yet to do so\nYeah you know a man on the uh\n... well a a man\n\n\nBut I don't know about that I'm\nA little on the uh I'm\nA\n... na na na na na na na na na\n\nNa na na na na na na\nA little more set up a a a\nA na na na na it's gone\nA long while you're on the phone call\nMy mom and there's some golf balls\nWell no no no\nNo a\nMan you know probably\n... na na na na\nNa na na na na\nNa na uh\nAnd from ... school where the joy the treatment is balanced with humility and generosity offering coed Catholic education were great seven to twelve marriage ... presents an open house Sunday December second promote ... more at ... dot com\n\n... on ... of color played a sonata by being ... I'll be cheap\nMusician ... was born in Seventy one teacher near the end of the baroque era and although he's not exactly a household name he was a student have ... and a friend just lay it pulled in both ... Mozart\n... and ... concerto for violent hope is one number two\n[noise]\n... played the violin so low with Iran baroque orchestra for pediatric nurse ... concerto for my oldest one number two when they're hidden treasures of Italy you can\nThe music you're hearing by visiting Sunday baroque dot org\n\nYou're listening to Ninety point one WABC\n[noise] the president's evangelical supporters are working hard to get out the vote November but concerns about moral issues that have inspired believers on the left to head to the polls as well\nAs one of the reason I'm actually going to get I Want to be part of that to say you know\nBelieve in you and\nBelieve you know and liberal ...\nFor the latest on all the cabin on your that's tomorrow on MORNING EDITION from NPR waking up Atlanta for six filter on my viewpoint won W it'd be\nSunday baroque is supported by the John Moriarty Institute for ecology and spirituality at Sacred Heart university announcing an ha adult educational journey to Ireland June fourth through eleven to twenty Nineteen John Moriarty Institute dot org\nI never heard of ... Antoni Gretzky before I received a CD of his music in early twenties Seventeen the ... and composer live Trump Seventy nine to Seventeen sixty nine and very little else is known about him\nThe harmonious society of tickle fiddle gentlemen recorded a whole CD of his music and this is their performance of Seventeen forty violin concerto by yourself Antoni Gretzky\n[noise]\n\nHarmonious society of tickle fiddle gentlemen played the violin concerto indie from Seventeen forty by yourself Antoni Gretzky\nSunday baroque it's supported by the Richard ... at Hartford foundation for public giving providing support to institutions that are committed to enriching lives in Connecticut including the Hartford Stage Company and the Connecticut guitar society\nThis program is produced at W. S. H. U. in Fairfield, Connecticut by Julie for dino ensure Welsh rock with help from Rick Andreas at WTC Cincinnati I'm Suzanne bona and this is Sunday baroque\n\nSwedish recorder player Dan Lauren straddles the centuries you regularly performs broken renaissance music\nBut he is also committed to broadening the repertory and promoting the recorder is a legitimate concert instrument today and he is responsible for a number of contemporary work featuring recorder coming up in the next hour Sunday parochial here Dan Lauren Plano roiling interviewing concerto by Antonio evolve [noise]\nAnd you're listening to Sunday baroque unnoticed point one W. A. B. E.\nTo bury swing with you tonight thank you for joining us [noise]\nSupport for WNBA comes from the Atlanta symphony orchestra presenting rebels love letter to Greek mythology the ballet deafness and Chloe Thursday on Saturday October eleventh and Thirteen details or you'll show dot org classical series presented by Delta Airlines\nWith everything going on in the world you listen to W. H. B. E. because you're trying to stay informed\nSo why not support it and on this or Seventy eighth anniversary we'd like you to have our limited edition Seventy eighth anniversary T shirt\nIt's yours within early sustaining donation ten dollars a month\nThe shirt features radios from the last seven decades in her seventies anniversary logo\nTo stay informed show your support\nHelp us and the member Dr early at W. A. B. E. dot org slash donate\nThis Sunday baroque I'm Suzanne bono [noise]\nIn fourteen Ninety to Columbus still the ocean blue and\nDid he and his fellow adventures sale on besides up into in Santa Maria [noise] they see on the water and today you'll hear some ... some of George Frederick handles water music and other musical discoveries for Columbus Day weekend [noise]\n\nLive from NPR News in Washington I'm Janine hurt after a bitter by heart\nAnd fight over now Supreme Court justice Brett Kavanaugh a key member of the Senate Judiciary committee Democrat Chris Coons says it's time for the country to move forward\nAs Senate role in our in our politics is not to just reflect the country but to help heal and leave the country and that's the course we should be off\nSpeaking there and NBC has meet the press meanwhile Republican Senator Lindsey Graham says he's happy in a cabin up but he says he has a warning for Democrats this midterm election season\nThis is going to the strength at the ballot box [laughter] so I'm going to have never campaigned against her colleague\nThat's about to change ground speaking there on Fox News Sunday National Transportation Safety Board investigators are looking into what caused a limousine crash in upstate New York they kill twenty people today as NPR's Bob Yellen reports federal officials say it's the deadliest transportation accident nearly a decade\nPolice say a limousine was carrying Eighteen people and barreling down a steep state road and scary when it killed two pedestrians ... Johnson says she lost three family members in the crash including a couple who got married this past summer\nThat was a large family and those who cartoon cartoons my brother and I really like this has happened\nInvestigators wouldn't say how fast the limo was traveling they are examining why the vehicle did not stop at an intersection Bobby Allyn NPR News\nIn Brazil's presidential election today far right ex army captain ... and narrow ran up a commanding lead and the first round of voting but he didn't get the outright majority he needed to avoid and October twenty eighth run off against leftist rival Fernando ...\nThis after an election that deeply divided Latin America's biggest nation along gender and racial lines also narrow often compared with President Trump has been accused of denigrating women and minorities in Brazil\nLeading climate scientists conclude that new technology and other untested methods are needed to take greenhouse gases out of the atmosphere interest Christopher Joyce has details on the new report\nThe scientists were asked if it's possible to keep the planet from warming more than about two and a half degrees Fahrenheit above pre industrial temperatures that's a red blood and for dangerous effects on the climate\nWe conclude that current pledges by governments to simply limit emissions of greenhouse gases are not enough to stay below that line which needed are new and potentially expensive technology used to extract those gases from the atmosphere as well as the best new forests to soak up carbon dioxide from the air\nThe reporters from the Intergovernmental Panel on climate change scientific group that advises the United nations Christopher Joyce NPR News\nAsian markets are trading lower at this hour the aged hours down about a third of a percent you're listening to NPR News from Washington\nInterpol says a Chinese official who was reported missing has resigned as head of the international police agency\nAnnounced that came after Beijing said mom hung way was under investigation and China on suspicion of unspecified legal violations Interpol says among was had resigned as president of the agencies executive committee effective immediately but didn't say why\nTurkey's president says he has closely following the investigation into Saudi journalist who disappeared after entering the Saudi consulate in Istanbul NPR's Peter Kenyon reports another Turkish officials as investigators believe ... was killed\nPresident ... says Turkish investigators are going through camera footage and other evidence and he'll await the results of that investigation one of his advisors does a Turkish broadcaster that investigators believe the show he was killed in the consulate in his body moved elsewhere\nHe said he skeptical about Saturday claims that there's no camera footage of to show the inside the consulate and says there's no evidence that he left as the Saudis claim\nShow he's been a prominent critic of Saudi crown prince Mohammed bin Salman and flip became to last year he went to the consulate for papers you needed to marry his Turkish fiancee Peter Kenyon NPR News Istanbul\nThe price of a gallon of gas is rising gaining seven cents a gallon over the past two weeks the Lindbergh survey says the average price for a gallon of regular now stands at two dollars Ninety seven cents and that's forty one\nLike Alan higher than this time of year ago rising crude oil prices are behind the price hike I'm Janine her and you're listening to NPR News from Washington\n\n\nAfraid founder goats and fry baroque orchestra played that can trigger number twelve by Lorenzo get tons other teary which has the nickname the the tempest you're listening to Sunday borough\n[noise]\nAnd you're listening to Sunday baroque or Ninety point one double ...\nUm the next city life may go will ... ... sangre writer and Dr ... her one woman show about growing up in that latter shaking the when the\nEnd of Corey jumps and the ... song writer ... child abuse his second album I'm Delores right is joining me Monday happy love and they have mom doubled you may be ...\nAt bless his choice for in pee on\nThis program is funded thanks to a generous ongoing support provided by the friends of Sunday for real cause contributors include Dr Louis piper Stratford, Connecticut\nLike Christopher Columbus George Frederick handled did not see all the ... blue but he and his crew of musicians sailed the river tend to ... play water music for King George John nearly a gardener conduct the English Baroque soloist playing handles first water music sweet\n\n\n\n\nWell\nWell well my\n\n\nI'm\nLook on the front of\nAnd I'm On\n\nNumber one the\n\n\n\n[noise]\n\n\nNa\n\n\n", "show_name": "Atlanta Symphony Orchestra", "year": "2018", "city": "Atlanta", "day": "08"}