{"month": "10", "state": "NY", "station": "WAMC", "content": "Support for WAMC comes from mark ... antique Saratoga Springs I Am calling me New York\nJewelry and diamond buyer purchasing silver coin collection vision antiques fine art and the states\nFive one eight five eight seven eight seven seven interim healthcare helping people remain at home for ... years providing companions aids and nurses in the home to the twenty four hours a day serving the capital region in Columbia county ... falls in Saratoga interim healthcare\nDot com this\nIs Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety three ramps and you can WHM cage de Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a NHCD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nine tie kinda rogue WAMC which do you want to buy\nOne great Barrington W W E S H da da na ... W. A. N. D. H. D. Ninety point one Stanford\nW a and R eighty five Bruce during WAMC am fourteen hundred Albany [noise]\nBases WAMC northeast report I Brian shields the number of services are scheduled in our region following Saturdays\nPittsburgh synagogue shooting [noise]\nThis is not going to fall so what we do and who um we're going to be proud of our Jewish identity [noise]\nHudson Valley bureau jeep Alison done for a call for civility and New York's race for governor WAMC capital corresponding with with that story Senator Charles\nSchumer came to Albany today calling on the Trump Administration to reverse goes to a hospital drug just jump around ... will have a story to jump on these and other stores after the world or national news from NPR [noise]\nFrom NPR News in Washington I'm jak spear the man accused of killing a loving people at the tree of life synagogue in Pittsburgh Saturday\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero e essays and we hearing us more\nPower than in a wheelchair during the five minute ... wearing a blue sweatshirt and hand cats he spoke in a clear voice when the judge asked if he understood the charges lodged against him those charges include fatally preventing people from practicing their religion which is a federal hate crime us attorney Scott Brady spoke with reporters after the hearing\nAre thought were family with the community and rest assured we have a team of us working hard to enjoy the\nEt cetera turned to court for a preliminary hearing Thursday he's being detained without bail for NPR News I'm Molly herring in Pittsburgh\nPresident Trump and first lady Maloney a Trump will travel to Pittsburgh tomorrow that's according to White House spokesman woman Sarah Sanders center says the president has ties to the Jewish community and wants to stand with the families of the victims and the survivors\nThe president is the grandfather several Jewish grandchildren his daughter is a Jewish American and son in law did this and that Holocaust survivors tomorrow the president and first lady will travel to Pennsylvania to express their support of the American people and grief that Pittsburgh community\nThere have been mixed responses to the president's plan trip leaders of the liberal Jewish group and an open letter saying he was not welcome until he denounced white nationalism\nWere rabbi Jeffrey Myers with a synagogue where the shootings took place at the president would be welcome bear consumers are opening their wallets last month even as monthly incomes rise and get the lowest level in nearly a year the Commerce Department says consumer spending was up for tens of one percent last month as households bought more motor vehicles and spent more money on health care\nAfter opening higher stock prices plunged today with the Dow Jones industrial average finishing nearly one percent lower NPR's Jim Zarroli reports would drop came after news the west may impose more tariffs on Chinese goods\nThe Dow is up three hundred and fifty two points at one time in the morning\nBut in the mid afternoon word came that the trade war with China might be intensifying and the Dow dropped as much as five hundred and sixty six points it later recovered part of the last big exporting companies like Boeing were hit hard\nAnd so we're tech giants like Amazon which fell more than six percent for the day\nNetflix lost about five percent the Dow has fallen ten percent in less than a month and is now a negative territory for the year Facebook is down thirty percent from its all time high Jim Zarroli NPR News New York\nLooking at the numbers the Dow is down two hundred and forty five points today to twenty four thousand for forty two the NASDAQ fell a hundred and sixteen points yes it'd be five hundred dropped Seventeen points this is NPR\nStrike by baggage handlers in Belgium continues to cause delays that the country's main airport for a fifth straight day or because of the audio partner luggage handling company or striking to make calls to improve working conditions\nCompanies services such major airlines as Ryan air TY easy jet and British Airways dozens of flights into the Brussels Airport were canceled today\nGermans are coming to terms with the angle of Merkel's decision to step down after her current term is chancellor expires but that's not until twenty Twenty one is NPR's rice or how do you know some report your political opponents are pushing forward to leave sooner\nChancellor mackerel that she has to answer to the growing number of German voters cliff delivered her conservative blow after blow and return regional elections thoughts on on the mentions the dean of the country and tough fill it and that she's grateful to have been at her government tell him for Thirteen Years\nThoughts on on dimension so dean that she's in her country in tough silly and that she is grateful to have been at her government tell them for Thirteen Years she added she won't stand for re election as her party leader in December but did she will continue as head of the German government\nThe leaders of the main opposition party the far right alternative for Germany so they weren't satisfied plus getting in a tie for the ... parliamentary coaching at least lie to all of that and even mackerel acknowledges the to oppose she holds are intertwined and that medical should resign as chancellor\nPsoriasis already Nelson NPR News\nIn Venice the water is rising not that unusual in the city which has already got a lot of water where we are officials say the current levels are alarming upwards of Seventy percent of the storage city has been flooded by waters it reached more than Fifteen and a half inches above sea level mess often floods with high winds pushing water in from ... I'm jak spear NPR News\nSupport for NPR comes from NPR stations other contributors include F Jake the foundation of donor advise phones working to maximize the impact of charitable giving answer create customize philanthropic solutions learn more effort J. C. dot org and the ... e Casey foundation\nVisitors' WAMC northeast reportedly division aren't Brian ...\nThe man accused in the Pittsburgh synagogue massacre of ... appeared briefly in federal court in a wheelchair in handcuffs today to face the charges that he killed eleven people and what is believed to be the deadliest attack on the Jews in us history\nFollowing the Saturday's shooting a number of services have been scheduled in our region more from WAMC Hudson Valley bureau jeep Alison done\nCongregation gates of heaven in Schenectady well hold the servants have remembrance solidarity and peace tonight at seven not Cutler is the congregations rabbi\nRacism the bigotry and it's something that will not be tolerated\nHe'd said to temple is opening its doors to the Schenectady clergy against hate congregation in the spirit of unity and healing\nMy colleagues have come together with us to show\nSolidarity and support not only to give an opportunity for a Jewish community grieve but to also give opportunity for the extended community to come together and say this type of\nBehavior is not tolerated nor is it a part of our cultural a fabric painting and therefore we stand together to say\nTo stand up to this type of hatred and and and ... awfulness and murderous rampage\nAlso at seven tonight as a community gathering in Rockland County to remember the Pittsburgh victims it's that the Jewish community campus in West Nyack where state senator David Carr literally will deliver comments\nI just heard an outpouring of support from the community wanting to gather and just say and one collective voice that were standing\nUnited against hate and that's what we're going to be doing tonight and I think we're going to have a very large crowd because people are just extremely upset about how\nThe rhetoric and that is just really a oiled into into violence\nRepublican Rockland County executive that day has ordered all county flags to be lowered to half stuff out of respect for the victims democratic Westchester County executive George lot emerge at the same\nNew York governor Andrew Cuomo also directed that flags on all state government building be flown at half staff until sunset Sunday and honor of the victims in both Pittsburgh and at a supermarket and Jefferson town Kentucky Cuomo addressed the shootings that are being investigated as hate crimes and he spoke about the meaning of the pledge of allegiance\nAnd anyone who seeks to divide and the one who seeks to separate\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com that\nIs not an American as we have to find that in this nation\nAgain ... a Democrat who's thirty eighth district includes most Rockland and a piece of Westchester\nAnd it's just oils my blood when I see them all to freak with mass shootings and say when are we finally gonna learned our lesson that we need commonsense gun control in New York state and across the nation\nMostly cloudy skies tonight drying out with low temperatures in the mid thirties\nI mix of sun in cloud and pleasant during the day on Tuesday with hide in the lower timid fifty region wide for Wednesday increasing clouds after some mornings sunshine with a chance of showers especially\nNorth of I Ninety and west of the Hudson River valley by the end of the day and hides in the upper fifties showers likely on Thursday otherwise cloudy skies near sixty\nA steadier rain likely on friday otherwise cloudy and the middle and upper fifties mostly cloudy back to the lower fifties\nThe a steadier rain likely on friday otherwise cloudy and the middle and upper fifties mostly cloudy back to the lower fifties on Saturday and more sunshine on Sunday staying in the lower fifty four WAMC on news channel Thirteen meteorologist Paul ...\nYou're listening to WAMC northeast report weight edition municipal leaders in the Berkshires are responding to criticisms made by the former Brooks your district attorney David Cape was in an interview with WAMC last week WAMC searchers bureau chief Joshua Landis with more\nTape was commenting on the election to fill the seats he retired from in March ascribe to rising crime rates and the county's largest cities to their leaders in city hall\nWe got involved in doing it because other people were doing it and they were holding up to their responsibility\nHe sided Federal Bureau of investigation uniformed crime reports that indicate an uptick in violent crime over the past several years\nBoth Pittsfield and north Adams have willfully understaffed police departments for our communities of their population of that's part of it are those communities um north Adams unfortunately has such a poor tax base that it would be very difficult for them to try to ever achieve that\nPittsfield I'm a has repeatedly denied the request to expand it to where it absolutely should be and that's something that they should be doing about\nI was quite shocked and surprised at his claims and I found that the A's surgeons as baseless\nPittsfield Maryland attire she tells WAMC that during the time in which her tenure overlapped with cable says January twenty sixteen to march twenty Eighteen her interactions with his office only came when her office reached out to his\nAnd said cable is was well aware of for efforts to combat crime and the county's largest community\nWhat on disappoints me about David Mark is that this man and the city council put more money into our police budget and we have hired more police officer\nTier is supporting Democratic primary winner Andrea Harrington in her race against longtime cables deputy Paul Koch of yellow who is running a write in campaign\nReach for comment to bits feel police department back tire up saying in a statement that it's quote\nPosition for the past ten years has been that based on population call volume an stats is that we shouldn't be staff that one hundred ten to one hundred twenty hour currents authorized strength of Ninety nine is actually an increase by the current administration to move us in that direction\nTire also cited the d._a. office's involvement with the city's implementation of shops bought her a surveillance system that attacks the source of gunfire using acoustics to show that cable is once aware of the efforts to fight crime\nI understand that they have taken on on some political undertones or some very blatant an obvious political positioning I continue and I am committed to doing the work\nIn North Adams Mayor Tom Bernard who has not endorsed either candidate for DNA to cable is the task for use of the statistics in question citing the FBI zone disclaimer that the information in the report offers a quote simplistic into or incomplete snapshot of communities at best\nIt doesn't help when the chief law enforcement officer intentionally misconstrued the data to deny his own accountability\nBoth mayors underscored their belief that the data and the manner in which case was presented it obvious gates their holistic efforts to combat crime through educational programming community investments and better training for law enforcement\nObvious gauge their holistic efforts to combat crime do educational programming community investments and better training for law enforcement reporting from WAMC news ... bureau apps the beacon cinema I'm Josh land these\nNew York Senator Charles Schumer today called on the Trump Administration to reverse cuts made to our hospital drug discount program AMC's gym with all those reports for the Democratic Senate minority leader gathered with area healthcare leaders at Albany medical center today to detail the effort\nSchumer says the three forty be program is a vital economic function for the overwhelming majority of hospitals in New York\nIt allows hospitals to purchase prescription drugs at age twenty two fifty per cent discount but they're reimbursed by Medicare at the same normal rate so they get some extra money\nThe program was enacted in Nineteen Ninety to to help hospitals and other medical centers that treat low income rural and uninsured patients\nSchumer said the Centers for Medicare and Medicaid services imposed a twenty eight and a half percent cut to the programs reimbursements on January first two thousand Eighteen\nThe Democrats as New York hospitals including five facilities in the capital region would lose one point eight billion dollars in funding over the next decade\nAlbany medical center will lose eleven point five million in the coming decade Ellis medicine will lose twenty three million in total in New York state alone there'll be a hundred fifty eight million dollars in cuts to the year\nOver the next ten years St Mary's would lose seven point eight million dollars Columbia memorial one point six million and Nathan ... power more than five hundred thousand dollars according to Schumer's office\nMore than seven hundred hospitals including twenty six in New York wrote to Schumer and other legislative leaders asking Congress to eliminate the cut\nDr ... is the executive vice president for system care delivery and the hospital general director at Albany medical center three forty be program\nIs relatively small in the context of a\nBig pharma is a total spend about two and a half percent of the\nFour hundred and fifty seven billion dollars the annual billion dollars of spend in the United states for for drugs and also I think very important to leak this is a direct relationship between pharma the big drug companies\nAnd the providers um those discounts or provided directly to providers of this means that it operates a little or no cost to the federal government\nAlbany med says about twenty percent of its patients fall into the low income population the three forty be program is designed for then did he says Albany met use its funding from the program for its pediatric oncology efforts\nHaving those dollars at risk to some extent puts that program at risk\nWhole milk and the president and CEO of Schenectady based Ellis medicine says sixty five percent of its patients are covered by Medicare or Medicaid he says the three forty be pro grant enables people to take drugs they wouldn't be able to afford\nIf they can't afford the medications they may not take their medications they will end up in our ER they'll end up being probably hospitalized there'll be sicker\nAnd uh probably in the long run that will end up costing the overall services by Medicare and Medicaid more money\nCritics say the three forty be program lax federal oversight has been growing each year end\nAnd and Medicaid more money critics say the three forty be program lax federal oversight has been growing each year end incentivize is hospitals to increase drug costs with additional charges that hospitals are using savings from the program to assist low income patients\nSchumer says he is open to reform in the program to include restrictions on how health centers can spend the money\nThat's not why they're doing they're doing it to help the pharmaceutical industry and they're doing it because they've gone after hospitals and health care up and down the line\nSchumer said he is confident Democrats and Republicans will join his call to eliminate the cuts for WAMC News I'm Jim ... less\nSupport for WAMC comes from the center for natural wellness school of massage therapy co hosting a day of natural beauty on November the ... the event is open to the public seeing ws empty dot com for more information\nFirst lied providing high speed data Internet go location and boy services to businesses over its own fiber optic network and supported by locally base personnel first like dot net\nSaratoga bridges Boston sponsor York community resource for people with disabilities and their families supported employment they services in more Saratoga bridges dot org\nThe comic blind as open it split WAMC listener comic blinded eight hundred six nine five nine one seven zero eight hundred six nine five nine one seven zero for the WAMC listener comic blind\nSupport for WAMC comes from Godfrey financial associate single em on financial planning investment management that insurance for women and their families and hearing judiciary standard since Nineteen Ninety five a woman to own independent financial planning from Godfrey financial dot com\nThat you were joining us today on WAMC northeast report late additional ... I'm Brian shields state you now for marketplace\nSupport comes from Troy traumatic concerts presenting the stoning and philharmonic chamber choir and telling their chamber orchestra", "year": "2018", "show_name": "Northeast Report - Late Edition", "city": "Albany", "day": "29"}