{"month": "10", "state": "MS", "station": "WMPN", "content": "Da da\n\nDa\n\n[noise]\n\n\n\n[noise]\n\n\nMhm\n[noise]\n\n[noise] [laughter] [noise]\nWonderful cellist ... playing piano the cellist so now the number two in ... major by your hardest Brahms played on an instrument that has a direct connection to Brahms public ... cello which Amit place you can catch up with more at new classical tracks at your classical dot org\nAnd you can you hear MPP think radio is going to the dogs during this ball players drive you make a contribution to the radio we might go to be\nSure to local pet shelters around the state would there be sustaining membership of ten dollars per month and the Beagle contributing piles of pet food to a local pet shelter think of it as trickle\nDown generosity because of your financial support we literally you'll do both make your play today but we can't be beat online dot org slash support\nThe stations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood\nCheck out what's happening on MP be music radio and listen online at him be be online duck or gee\n[noise]\nThere is a certain appeal that new things have\nIt's human nature really and if that new things sparkles that so much the better [noise]\nNothing that sir Edward Eldar composed would be new release\nUnless he hadn't written it in the first place [noise]\nWell that's a lovely two and four strings his new alright having been based on some new laying around at the piano by sir Edward almost Nineteen years ago [noise]\nI'm Mindy ... near the queen's home and more is our [noise]\n\nMusic by a chap who was included in a collection by the London Mozart players in conductor much yes by merge cold contemporaries of Mozart his name is ... and this is the second movement from his symphony number fine [noise]\n\n\nSome piano ... around by sir Edward Eldar back in the late Nineteen twenties here ... here's how it sounds\n\nLittle song for strangers arranged by Donald Fraser cold the queen's whole uh based on an improvisation piano improvisation by ... ed wood Eldar recorded in Nineteen twenty nine at the queens hall London\nDonald Fraser conducted the English chamber orchestra it's from a recent release on the Abbey label\n[noise]\n\n\n[noise]\n\n\n\n\n\nThree times or the ... at risk biggie pay tribute to the place he loved above all others the city of Rome first in fountains of Rome and then\nFive or so years later gathered some little musical ideas that resulted in a another set of pieces cold the hundreds of Rome\nHere's a recording by the Cincinnati Symphony conductor ... to ...\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nOh\n\nHi ... role by up to Reno speaking\nThe Cincinnati Symphony orchestra but conducted by his too low the scope of\n... [laughter]\n\n[noise]\n\n[laughter]\n[noise]\n[noise]\nHe was truly one of the great so did his job the twentieth century jump yeah Ron Paul\nWhen the honor roll on and the friends list chamber orchestra together they made this recording above ... concerto by ... [noise]", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Jackson", "day": "24"}