{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n\n\n\n\n\n[noise]\n\nHow do you like to dance to that that was the Japanese and Chloe sweet number two by rebel with ... and the Cincinnati Symphony orchestra I Know that sounds like\n\nI'm Larry Gross gets mountain stage live performance radio from NPR\nSaturday Night at seven on MTV music radio [noise]\nThe stations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. green ...\nCheck out what's happening on MP be music radio and listen online at MVP on line duck or gee\n[noise]\n\nFrom the BBC had an ear for the colorful shimmering blue and I will Noreen upon the white cold as a woman's hair watercolor\nHuge of a flower garden in the rain but he also loved the married shades of gray\nCan be found he spent a fair amount of time exploring that Palin\nIs the one that can be found there yeah a lot of color\nEither way you restrict yourself to only black and white\n\n[noise] belong and why I Love to be the black and white for two pianos coming up in just five minutes\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\nOh thank\n[laughter] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[laughter] [noise] [laughter]\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[laughter]\n\n[noise]\n[noise]\n\n\n[laughter] [noise]\n\n\n\n\n[laughter]\n[noise]\n[noise]\n\n\n[laughter]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nCould they be she was dying of cancer and he was angry\nAt himself that he could not joining the war effort he runs in the first movement peace we just heard black and white he who stays in his place it does not dance quite lead me to a disgrace he\nThought that he was describing himself by\nNot being able to ...\nGet to the war effort but he decided what he could do was to write music do what he did best nuts how he stood in place and fought for what he believed in we heard one of the ... last pieces he was able to finish before his death\nIn black and white blocking my bike well did you see mark an argument you Daniel bearer blind so bullish\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nNo\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\nBut\nI\n[noise]\n\n[noise] [noise]\n\nJulianne hill climbing you'll know like if I went there in the can chicken number one by ... sorry Claudio bottom conducted orchestra that to\n", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Jackson", "day": "01"}