{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n[noise] [noise]\n\n[noise] [laughter]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[laughter]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\nA I'm\n\nI'm\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\nThe piano concerto number twelve by Mozart and that was ... kind of an underrated pianist I think he really good one too and he was leading to the end of talking about\nMusic fans have been around you know that there's always more new interesting music if you know where to look the discovery never stops in young fans\nAre excited you know the musical since a secret [noise] one hundred and some connections between generations cultures roots rock we bumped pop needed\nAll flus together\nHow bitter Sunday night at seven\nOn MPP music radio stations have been ... music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org G\nO\n\nO\nThere's something strange about the corals fantasy by Beethoven it's an impressive piece by itself\nWith a big chorus and a number of soloist an orchestra\nBut as you listen to it as it goes on you get the feeling like\nWas the server her soul for something\nLike that other big\nCoral or Castro soloist movement toward the end of his career hits the coral fantasy and it was premiered with a couple of his symphonies in one of those monster concerts Beethoven seem to love to put on and we're going to hear it in about forty minutes with electric about house orchestra and the court Missouri and all\nKinds of um the bulk of some of us and this can assume that I just have\n\nTo say is a a boss down by ... are both apparently that was a a a an ...\nAn anagram acronym anagram for another name Jay ... something like that but they don't quite match I'm not sure how that works this is the broadside band led by Jeremy ... bay stands by one oh horrible [noise]\n\n\n\n\n[noise]\nMm [noise]\n\n[noise]\nIn the ...\n\nNa na\nNa na\n\n\n\n\n\nMm\nWhoa whoa\n[laughter]\nOh ooh\n\n\n[noise]\nNickle every course took off the master of orchestrate Shannon what's the big\nOne hundred twenty gate orchestrated you know a\nCrayon box with a sharp to nobody could make an orchestra sound quite like he did\nThe Russian Easter festival overture showing off his his skills his math skills the philharmonic orchestra led by your guinea Stefano\nHere as a composer born in touch tent Kazakhstan in Nineteen fifty seven as a young woman she moved to Australia works there no\nThis is fast blue village to buy Elena cats ... played by the del sol string quartet\n\n\n\nMm\n\n\n\n\n\n\n\nThe cello concerto in the major by Antonio the bully sold was hunting chatting with the London chamber orchestra led by Christopher Warren green\nIn a moment a a large work for chorus an orchestra and soulless by Luke trick that Beethoven to kind of trial run for what he would\nProduce a leader in the Knight symphonies the coral fantasy\n[laughter] [noise]\n[laughter]\n[laughter]\n\n\n[laughter]\n\n\n\nNo one who was there a soon forgot it and it's become legendary amongst your concert on December twenty second Eighteen oh wait a benefit concert a benefit of the composer\nThe premier that night of the fifth and sixth symphonies Beethoven his fourth piano concerto which he played uh\nParts of the masses see and what we're about to hear the coral fantasy it has even larger forces then Beethoven would melt later in the ninth symphony ... electric about doubts orchestrated the central German radio wire and soloist mhm\nMm Mm\n\n\n[noise]\n\n[noise]\n[laughter]\n[noise]\n[laughter]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Jackson", "day": "19"}