{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\nAnd I\n\nThought\nIt was a ... [laughter]\n\n\n[laughter] [laughter]\n\n\n\n\n[laughter]\n\n[laughter]\n\n\n\nMm\nMm\n\n\nMm\n[laughter]\n\n\n\nNobody really knows why they're called the English sweets everybody's kind of guessing I think we're style well no box wasn't writing in English style really more French than anything\nDid he writes pretty English noble men that's about somebody's best guess but nobody can prove it self goodness knows why he wrote this very early keyboard sweets the English sweets and a half dozen I called in the English sweets but that's what they are that was the second one and a minor and it was played by pianist Anne Marie ... I Hope you enjoy that\nThanks for your company on this Thursday really appreciate it I was glad to have you here I'm Lynn Marshall\n\n... yes I'm Talking to you know obviously you really should be grainy and we\nAppreciate your point like are you a member but I did you become a member of our members are\nPart of it makes it go and put them in the financial contributions to the beach and keep the company and you come\nHere don't see how they used to be the first thing they are today by calling me three seven to ... yeah that's one eighty eight eighty three Seventy four for me to me\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. B. in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. ... chicken what's happening on MTV music radio and listen online at MVP on line duck or gee\n[noise]\nYou know\nThere are some places that just feel right maybe that's why you live where you live it feels like the right place to beat it feels like home [noise]\nOr maybe that's why you vacation in the same place it just feels like the right place there's something comforting about knowing where you are and what to expect\nTchaikovsky knew all about that feeling he went back to Rome repeatedly throughout his life and it was a place that just it right from the very first\nIt was during lunch such visit that Tchaikovsky composed music\nHe's ... chili tell yeah and\nAnd a little bit later on this Thursday something for the piano fans in the room I'm Alina sees thanks for listening here ... with a village dance ... [noise]\n\n\n\n\n\nLucky Tchaikovsky got to spend the winter in Rome and fell in love with the lights and the sound of that city he loved the Italy he went there several times throughout his life\nDuring that particular trip in Rome he wrote back to his ... now I'm working on a sketch Albany county incentives via based on ... the work will be effective\nTchaikovsky thought it would be effective anyway hope you do to Tchaikovsky is capri chili tally in the Cincinnati pops perform did with Dr Eric ... from\n... Rachel Martin pine takes on the boogie woogie blues in about Fifteen minutes\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\nWe're now\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\nNot for the\nThat's what we're like\nOh no\n\n\n\n\n\n\nRight and\nThat's\nWho knew the horn to go that low I guess if you're a horn player you knew that that's the horn showcasing the lowest of it slows an highest ties you weren't concerto in major he's music my Eighteenth century composer named Tony hill Rossetti\nHerman ... silhouettes performing with concerto Amsterdam and conductor yeah sure\nBarcelona symphony orchestra plays Leonard Bernstein's mass and concerts this weekend you'll hear that orchestra take on another American masterpiece in less than ten minutes\n\n\n\n\n\n\n\nIt's called will be boogie that'd be ... by ... you heard Rachel Martin pine like mine lean with pianist Matthew hey go\nAnd something you'll find on Rachel Barton Heinz new record it and you can read more about it and hear more from it on the ... it's called new classical tracks you'll find that on your classical dot org you'll also find new classical trapped on I ... or really wherever you get your pack yeah\n\n\n[laughter] [noise] [noise]\n[noise]\n[laughter]\n[laughter]\n\n[laughter]\n[laughter]\nOh\n\n\nHere's George Gershwin Rhapsody in blue\n\n[noise]\n[noise]\n[noise] [noise]", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Jackson", "day": "25"}