{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[laughter] [noise]\n\nTwelve German dances by Beethoven fairly innocuous except for the fact that buried somewhere in there is a quote from what would become the third symphony\n\nEven ancient music for centuries ago contempt rash and alone\nEven contemporary every weekend Sunday perhaps you can hear a variety of modern performers treats can use it gets a living art one and put their unique\nImagine it gets damp on music on the Eighteenth century earlier I Can't do that and I hope you can join me for Sunday borough\nSunday Morning at six ... be music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... ... you may you view\nW. M. P. in Jackson W. M. A. W. ... W and maybe structural W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at MVP on line or gee\n\nYou know how it is\nSometimes we feel weighed down by work or in less bad weather [noise]\nNews that\nLife in general\nBut you know what that doesn't prevent us from creating our own fun [noise]\nOur own optimism and sense of wellbeing\nOur reason to celebrate\nI'm Mindy Rattner Chinese composer sure one trend poor in his own sense of sun into his festival overture compose revised to complete it during the turbulent years of the cultural revolution it's coming up later this hour\n\nOkay public TV fans you remember\nThat will tend to Abby young London routes score [noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise] [laughter]\n[noise]\n\n[laughter] [noise]\n\n\n\n\n[noise]\n\n\nAnd that is ... ...\n\n\nMm\nMm [noise]\n[noise]\n[noise] so easy\nTo miss you know you can you [laughter]\n\n\n[laughter]\n[noise]\n\n\n\n[noise]\n\nOh Mm\n[noise]\n[noise]\n[noise]\n\nAnd you do you mean the\n...\n[noise]\n[noise]\n[laughter]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] ... sonata by ... ... bc and I keep coal miners what's the violin it she was accompanied at the piano by the ... in\nFront of us have heightened really brought\nComposing symphonies to a state of high art and\nHis last dozen or so particularly gorgeous he wrote them not to be performed in London at one of those uh symphonies coming up in just a moment [noise]\n\nHere's Adam to share with the astro Hungarian heighten orchestra and heightens symphony number Ninety seven [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Jackson", "day": "17"}