{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n\n\n[noise]\n\n\nAround in\n\nEmil bumped up all the spine your waltz with the bank you an orchestra led by Michelle ... chat ski I'm Lynn ... really glad to get Johnny Depp you enjoy your weekend\nSo why would you want to contribute to impede during this week when when you contribute to Mississippi\nPublic broadcasting you're contributing to a better informed Mississippi whether that's children that are affected by TV TV programming whether they're touched by our education outreach programs whether it's adults who are listening to news program here on MP be think radio you were making a difference with every dollar you\nGive at M. P. B. online dart board that's M. P. B. online dot org ...\nStations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on the line at him be be online dot O. R. G.\n[noise]\nWhen it comes to your own personal philosophy about life you're ... I Wonder has it changed over the years or do you feel the same way about life now as you did then\nI suppose the kind of depends on the experiences you have in your life\nProbably shaped your overall philosophy it did for Dr Pam glass\nQuite dramatically too he's one of the characters in the novella by most hair and he's a character that Leonard Bernstein portrayed and he'd operandi candied\nDon't hear the overture by Bernstein\nAnd you get a chance to contemplate your life philosophy to in five minutes [noise]\n\nThis is my walking tour Rena number [noise]\n[noise]\n[noise] [laughter]\n\n\n\n[noise]\n\n[laughter] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nDa\nDa\nDa da\nDa da da da\n\nDa da da\n\nDa\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[laughter] no no no\nNo we don't need a big\nDa da da\nDa\nDa da da da da da da da da da da da da da da da da da\nDa da da\nDa\nDa da da\nDa\nNa na na na na na na\nNa\nNa na na na na ve again [laughter] they just may or may not have been ... na na na na na na na na na na na na\nNa na na na na na na na na\nNa na\n\nNa na na na na na", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Jackson", "day": "26"}