{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n\nNa\n\nNa\nNa\nNa\n\n\n\n... bringing in many musicals each together in that inspired music by John Weaver who was the teacher of our beside Lewis Allan Morris and both of them were involved in the instruction of Oregon music at the Curtis Institute in Philadelphia before Mr ... piece dreams by humor came as\nSoon as the designer this organ why Perry studied in New York City ... was recorded in concerts by Peter nuts Nagl at first Presbyterian Church and killed ... during the twenty Seventeen east Texas pipe organ festival\nA showcase today are kind of a ... to the upcoming twenty eight teams festival which runs November eleventh through Fifteen ... underground killed Gore in Longview and you've been up to Shreveport, Louisiana want to hear more why not at ten more details with pictures and specifications\nOr online as well as middle of the back story about Roy Perry and his ... involving linked to that at pipe dreams dot O. R. G. this program ... team forty one\nBy dreams is supported by Parsons pipe organ builders if Kennedy ... New York but Marquis organ builders of dilutes Georgia members of a poll by the associated pipe organ builders of America\nWhich is a collaborative of designers creatures and maintain is a pipe organ founded religious and educational institutions concert halls and residents is throughout the United states and beyond when the bubble resource guide and member prospectus is available at age ... will be a dot com\nContinuing supportive like dreams is provided in memory west the seat doubly by his family\nAlso ... Walter McCarthy Larry ... and the gravestone foundation get ... on behalf of her Family Foundation and the ... bought the chemical under the age are key foundation celebration of the license Martha ... camera\nProvide important support as you listen to contributors to this public radio station [noise] we've been delighting in some east Texas treasures I Hope you have been entertained and that you stay tuned here for more fine list [noise]\nI'm Michael Barone this is ... from American public media\nA globe is your home to the great American song each week I'll show you the best in local chance in popular song Nineteen thirties new today from Frank Billy in Allen\nLooks like ... LA Dianne Reeves and Gregory border Margaret chill out and spend some time when you're low somebody said shame on MTV music radio\n\n\nStations have been ... music radio R. W. M. A. H. Biloxi WMA bimbo W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood\nCheck out what's happening on MTV music radio and listen online at ... be online dot O. R. G. [noise]\n\n\n\n\n\n\n[noise]\n\n\nBack with more the east Texas pipe organ festival twenty Seventeen and it was pretty ... to the upcoming twenty Eighteen festival which takes place in the underground kill Goree Texas November living through Fifteen you can find details pipe dreams dot org program Eighteen forty one\nHello I'm Michael Barone delighted to be sharing these recordings with you which were made by my ... my colleague Peter notes nickel that was an ex dance by the guilt per is played by Jason old when the Williams family Oregon at First Baptist church in Shreveport\nJason continues on that same instrument with one of the ... she has to go to St Louis who switched organist ... they just want to die in the Washington ... [noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n... ... ... ... ... ... ... ... ... ... ... a\n\n\n[noise] to to play the double fantasy John log lady to organist single ... Jason olden Jeremy carrots Scotts all the before manual you rank Williams by working at First Baptist church in Shreveport, Louisiana\nIs recorded during the twenty Seventeen east Texas by ... festival some more ... was organist to church or some sort of ... in Paris blinded since the age of two worlds touring recital is nevertheless the prolific those are\nThe speech comes from an early work the short sweet doors we read it had to leave and we're headed back to first Presbyterian Church in ... the iconic Roy very you'll be ... organ read the whole place was using ... like\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\nMm [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\nWe have you noticed to refer to as the title of it too much so and an Irish here they didn't like the last\n... British Bowser Charles really stands for of course was based on Danny Boy Gen ... played roast on the ... First Baptist church in Longview, Texas Texas treasury celebrated during the annual east Texas pipe organ festival\nAmerican to the heart of our next piece it's a new school by David ... the looting the him there is a way into the whites ... sinks bound for heaven David wrote this piece on commission from and dedicated to our ... Johnston didn't\nHe plays at Saint marks the industry\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\nMm [noise]\n\n\n[noise]\n\n\n\n[noise]", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Jackson", "day": "10"}