{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[noise]\n[noise]\n\nOooh na\nNa na\nNa\n\n\n... bringing in many musical states together in that inspired music by John Weaver\nWho was the teacher of our beside was Alan Morris and both of them were involved in the instruction of organ music at the Curtis Institute in Philadelphia before Mr ... piece dreams by humor came as soon as the designer this organ why Perry studied in New York City\n... was recorded in concerts by Peter nuts Nagl but first Presbyterian Church and killed ... during the twenty seventh tee east Texas pipe organ festival\nA showcase today are kind of a ... to the upcoming twenty eight teams festival which runs November eleventh through Fifteen ... rounds killed Gore in Longview and you've been up to Shreveport, Louisiana want to hear more why not at ten more details with pictures and specifications\nOr online as well as middle of the back story about Roy Perry and his ... Skinner involving linked to that at pipe dreams dot O. R. G. this program ... team forty one\nBy dreams is supported by Parsons pipe organ builders are kind of dig with New York\nBut Marquis organ builders of dilutes Georgia members of a poll by the associated pipe organ builders of America\nWhich is a collaborative of designers creatures and maintain is a pipe organ founded religious and educational institutions concert halls and residents is throughout the United states and beyond the bubble resource guide and member prospectus\nIs available at age ... will be a dot com\nContinuing supportive like dreams is provided in memory west the seat doubly by his family\nAlso grants for Walter McCarthy Larry ... and the gravestone foundation get ... on behalf of her Family Foundation and the ... bought the chemical under the age are key foundation celebration of the license Martha ... camera\nProvide important support as do listen to contributors to this public radio station [noise] we've been delighting in east Texas treasures I Hope you have been entertained and that you stay tuned here for more fine list [noise]\nI'm Michael Barone this is pipe dreams from American public media\nThe globe is your home for the great American song each week I'll show you the best in local chance in popular song Nineteen thirties today from Frank Billy ...\nLooks like curtailing Dianne Reeves and Gregory border Margaret chill out and spend some time with low somebody said shame on MTV music radio\n\n\nStations have been ... music radio R. W. M. A. H. Biloxi WMA bimbo W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online dot O. R. G. [noise]\n\n\n\n\n\n[noise]\n\n\nBack with more of the east Texas pipe organ festival twenty Seventeen and it was pretty ... to the upcoming twenty eight teams festival which takes place in the underground kill Gore Texas November living through Fifteen you can find details pipe dreams dot org program Eighteen forty one [noise]\nHello I'm Michael Barone delighted to be sharing these recordings with you which were made by my ... my colleague Peter ... that was an ex dance by the guilt per is played by Jason old when the Williams family Oregon at First Baptist church in Shreveport\nJuice and continues on that same instrument with one of the ... she has to go to St Louis who switched organist ... they just one in the diet with Washington ... [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n... ... ... ... ... ... ... ... ... ... ... ... ... ...\n\n\n\n\n[noise] to to play the double fantasy John log lady to Oregon there's gender single Vince ... Jason olden Jeremy terrorists call it's all up before manual you rank Williams by working at First Baptist church in Shreveport, Louisiana\nIs recorded during the twenty Seventeen east Texas by ... festival some more ... was organist in the church is some sort of ... in Paris blind since the age of two worlds touring recital is nevertheless the prolific those are the speech comes from an early work the short sweet or sweet ribs\nAnd to lean and we're headed back to first Presbyterian Church you you'll go round the iconic Roy very ... organ Fred home plays music ... like\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nMm\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\nReally so have you noticed to refer to as the title of it too much so and an Irish here late in life but the last\n... British Bowser Charles really stands for of course was based on Danny Boy ... played on the skin oriented First Baptist church in Longview, Texas Texas treasure celebrated during the ... east Texas pipe organ festival\nAmerican to the heart of our next piece it's a new scored by David ... the looting the him there is a land of pure the whites oh shut up ... seats bound for heaven David wrote this piece on commission from and dedicated to our ... Johnson gimmick\nHe plays at sea marks the industry\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\nMm [noise]\n\n\n[noise] [noise]\n\n\n\n[noise]", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Jackson", "day": "09"}