{"month": "10", "state": "MS", "station": "WMPN", "content": "So\n[noise]\n\n\n[noise]\n\n\nA precursor to its big London successes just before this trip to the symphony number\nEighty eight and ... by heightened with lots of ... and thanks for joining me on this Tuesday\n\nLooking for a youthful perspective on classical music oh I'm going to play delicious transcendental attuned number seven it's very exciting an energetic and their party in parts of South Park and overall it's a pretty good teeth\nNo further than from the top joined me Christopher I'm running for our tenth anniversary season each week right here on NPR Saturday morning at nine on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi Wu may ... ... you may you Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or gee\n\n\nIf I were to try to draw a map of your or\nIt might come out looking a little weird [noise]\nBut as long as I have an idea of what direction nine and\nThen travel on the continental isn't that complicated English language signage is pretty good and the train the trains are fantastic\nHi Mindy rent near sir Edward El Al Gore and his wife did a lot of traveling in the Eighteen nineties they made it to the very up on three occasions each one fondly remembered\nThe music mountains and gorgeous far as inspired Eldar to write music which we'll hear in just a few minutes\n\n\nThat set up three each ... by ...\n[noise]\n\n\n[noise]\n[laughter]\n[laughter] [laughter] [noise]\n[noise]\n\n\n\n[noise] no [noise]\n\n\nNo ...\n\n... ...\n...\n\n... ...\n\n... ...\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\nThe rollicking the very end dances by sure Edward Eldar\nWilliam boating conducted the English string the orchestra and some of their wind and brass playing French\nSpeaking of brand as the number of can share he composed in the ... period with Trump it as a solo instrument well there are dozens maybe even a hundred\nAnd then in the classical period things almost came to a screeching halt\nJust a handful of trumpet charity from that whole period one of them coming up in just a moment\nWith\n[laughter]\n[noise]\n[laughter]\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n[noise] they ... never compose ... concerto for trumpet but his contemporary Johan ... whom will most certainly did\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\nAnd trumpet concerto ... each plant by Johan ... John Wallace was the trumpeter and Phil harmonious orchestra west conducted by Christopher Warren green\n[noise]\n\n\n\n\nPianists Maria as well be a chef Andres card to play a fantasy by ...\n[noise] [noise]\n[laughter]\n[noise] [laughter]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Jackson", "day": "16"}