{"month": "10", "state": "GA", "station": "WUWG", "content": "Pitches member supported Keith ... where in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter\nThis is members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\n[noise] hey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station all you have to do is call and you might even receive a tax\nDeduction G. P. dot org slash cars or called eight seven seven GP the one car can bank [noise]\n\n[noise] from the University of west Georgia because Ninety point seven FM Wu WG and W. W. G. H. G. Carroll to Georgia Public broadcasting radio network\n\nThat's already are still investigating a series of a parent\nHeightened tension prominent from the president is blaming the news media latest on MORNING EDITION from NPR News\nOne of the targets of the bombs or why is he made so many political enemies by Noel King in Washington DC\nAnd I'm Rachel Martin reporting from Texas to twenty third rational\nComing up we'll hear from another house race in North Carolina where anything demographics are contributing tight reign in a traditionally Republican districts really mean\nHarvest season in the mid west will take you to Iowa or ... or in a wet growing season have men Mahler profit\nCountry artist Keith Urban from\nThe news is next\nLive from NPR News in Washington I'm Dave ...\nThe FBI is urging the public to pass along any information that may be connected to the ten suspicious packages addressed a prominent Democrats and to CNN NPR's Hansi Lo long says the devices and the packaging materials are being analyzed us investigators look for a suspect and motives\nAre examining the devices that the FBI Laboratory in Quantico, Virginia during a press conference at the headquarters of the New York city police department NYPD Commissioner James O'Neill would not\nInvestigators are examining the devices that the FBI's laboratory in Quantico, Virginia during a press conference at the headquarters of the New York city police department NYPD Commissioner James O'Neill would not confirm whether any of the devices were designed to be hoaxes\nWe are treating them as life devices as you see the way our bomb squad detectives went into CNN yesterday a this has to be taking with yet most seriousness\nAuthorities are also looking into powder found in the package send to CNN's office in Manhattan FBI says the pattern is not a biological threat but investigators are still treating the substance as potentially dangerous ... along NPR News New York\nHomeland security secretary Kirstjen Nielsen tells Fox News investigators believe some of the pipe bomb packages originated in Florida\nPresident Trump is preparing to send eight hundred active duty soldiers to the U.S Mexico border has thousands of migrants from Central America continue their track toward the U.S Michel Marizco with member station cage aids easy says defense secretary Jim Mattis is expected to sign the order\nIt's not clear what the military will do here on the border last spring Twenty one hundred National Guard soldiers were mobilized here but they only support the border patrol agents Santa Cruz county sheriff Tony is that as a Democrat says he has his doubts about what Trump will accomplish by sending more troops\nKnown to to try to scare people in every which way he can so that you can go places a base and then there's obviously is they\nPut a department of defense and homeland security did not respond to requests for further information on the true mobilization for NPR News ... zone\nA caravan of migrants is still more than a thousand miles from the U.S Mexico border Matthew Shepard is being honored today at the national cathedral in Washington Twenty years after he was killed in Wyoming NPR's Tom Gjelten says shepherds ashes will be placed in a ...\nThey're prosecutors said Matthew Shepard was murdered simply because he was gay his killing was seen as a classic hate crime highlighting anti gay bigotry and piss a couple of Bishop Gene Robinson himself an openly gay priest\nWill lead the tournament Robin ... says the placement of shepherds ashes at the national cathedral is significant for the algae Beatty cue community\nThat's NPR's Tom Gjelten shepherd was abducted and killed by two men when he was Twenty one and a student at the University of Wyoming Japan's prime minister Shinzo Abe's in Beijing Today for talks with China's president Xi Jinping [noise] this is NPR\nStudent at the University of Wyoming Japan's prime minister Shinzo Abe's in Beijing Today for talks with China's president Xi Jinping [noise] this is NPR News from Washington\n\nFamous as food water parks and other relief supplies are being flown into the northern Mary on the island to help those in need and the aftermath of super typhoon you to\nOfficials say it will likely be months before electricity is restored to the roughly fifty thousand people living in the U.S territory the typhoon destroyed homes and vehicles and knocked down trees and power lines at least one person was killed it was the strongest storm to hit the U.S this year\nLouisiana born blues and country rock musician Tony Joe white is dead at the age of Seventy five his son tells the Tennessee and his father suffered a heart attack\nHis chest is with member station WBUR ... reports from Nashville white was an accomplished singer and guitar player who's songs were covered by recording artists such as Elvis Presley and Tina Turner\nTiny Joe ... biggest hit came in Nineteen sixty nine with a song that combined rock and roll blues in country into a sound that fans labeled swamp rock\nDrew me\nDown and he was about a wild animal of grain called pope we took it as a reference to marijuana take that number eight on the billboard hot one hundred and was covered by a number of heart including Elvis Presley get whites Love Lucy and the child and hunting farming northeastern levy and I moved to Nashville and songwriting\nCredits include rainy night in Georgia which became an R. N. D. hit and the wailing Jennings team terrible man for NPR News I'm ... skin Nashville\nGame three of baseball's World Series is tonight in Los Angeles the Dodgers trail the Boston Red Sox two games to none [laughter] I'm Dave mattingley NPR News in Washington\nSupport for NPR comes from the NPR stations other contributors include the Annenberg Foundation\nCommitted to supporting educating and engaging communities and the United states and globally for more than twenty five years learned more at Annenberg Foundation dot org and the corporation for public broadcasting [noise]\nTouchdown John Nelson N. G. before reminding you that football isn't justice for here in the south it's a way of life every Friday I traveled day covering high school what the average of the TV but there's still a lot to talk about joined me for the ball friday's in Georgia pod cast available on GB dot org\nAnd wherever favorite my taxes are found\nYou see people are still a lot to talk about joined me for the ball in Georgia podcast available on GB Donald\nWherever they were ... around [noise]\n\nSupport for G. P. B. comes from our monthly sustain hers and Georgia State university G. P. B. Atlanta is license to Georgia State university nationally recognized as a leader and innovative programs that help students are in their degrees more information is available at G. S. U. dot edu\nDoes your busy life keep you from staying informed TPP has you covered you can listen live a G. P. B. news dot org and on your smart home device follow us on Facebook and Twitter at gp be news [noise]\nTime Ira later this week on science friday traveled to the moon and back with Neil Armstrong the new ... first man every intention of coming back\nI Will do to capture the personal side of Armstrong space race or the excitement of space travel\nOn science friday from WNYC studio nearby and running the newness brick right here on a point five GDP Atlanta [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin in Del Rio Texas\nAnd I'm Noel King in Washington D. C. a massive search is underway for the person or people who mailed would appear to be bombs to critics of President Trump\nYeah at least ten suspicious packages were sent to a list of notable names including President Obama his former attorney general and his one time CIA director\nAnd parents justice correspondent Carrie Johnson has been following this story as it has been developing good morning Carrie good morning to let's get up to speed on the investigation is there any more information on on who may have done this\nNot yet the investigations seems to be centered in two places one is the FBI lab in Quantico, Virginia which is analyzing these devices may look like homemade pipe bombs and the experts of the FBI will be looking for clues about how the bombs were constructed what materials were used\nThey'll also be looking for DNA or fingerprints the bomber may have left behind on the devices or those ... retired investigators are telling me that is very promising because so many of these devices are intact\nThey didn't explode but if history is a guide that whole process could take\nThat is very promising because so many of these devices are intact they didn't explode but if history is a guide that whole process could take a while it won't be a mediator overnight\nWill last night authorities were searching a package sorting facility outside of Miami what do we know about about that place and what they were looking for their\nThis is NPR News\n... lawyer betrayed and midnight in the garden is good and evil and he's also the caretaker of August the u._k. bulldogs mascot\nFriend using along the way she did give a\nWidening graduating correct\nWe could actually see that fails couldn't turn it back so\nWe accepted the origins and part of being a guy on second thought this morning at nine from keep eating is\nNow is the perfect time to clean up the garage and get rid of that car you no longer need\nLook face the coming months with a fresh start by donating your used Carter G Bebe feel even get a tax deduction called eight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cars and thank\nSupport for CPB comes from you our listeners\nCPB has been recognized by the Georgia Associated Press media editors for best news that speech are reporting best documentary or new special programming and best general reporting\nCPB news stand with the facts your support allows ... to bring you a great weekend programs that are both informative and fun like wait wait don't tell me asked me another and Planet Money check out our entire radio programs scheduled at gp news dot org\nHunters on for whoever sent pipe bombs to some of the president's critics CNN wrestles with reporting the news and being one of the bombers targets also the midterm campaigns hit the home stretch the red Sox round the bases and Sandra Day O'Connor steps away from public life party news roundup\nOh it's also the midterm campaigns who the home stretch the red Sox round the bases and Sandra Day O'Connor steps away from public life the flooding news round up next on on one thing\nYou can hear one aim at ten o'clock this morning right here on a point by ... Atlanta\n\nSupport for NPR comes from the station and from the William and Flora Hewlett foundation committed to supporting ideas and institutions to advance education for all preserve the environment and promote vibrant performing arts more information is available at Hewlett dot org\nFrom me any e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at a E. C. S. dot org\n[noise] from the state of June ... who's ... serves as an enduring investment in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century [noise] and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning the billionaire George Soros says one of several public figures who've been mailed what are believed to be pipe bombs this week\nCirrhosis of hedge fund investor and philanthropist whose donated to causes many of them progressive around the world and we should note that the open society foundation which he founded in Nineteen Ninety three has been a financial supporter of NPR\nEndured summers has a lot of enemies in politics he's been a target of conspiracy theories from the right\nSebastian Mallaby is the author of more money than God a history of the hedge fund industry and I asked him recently if he was surprised to see George Soros among the U.S presidents and other prominent Washington figures who've been sent these packages\nOr the whole phenomenon of the ... surprises me in a poor me but um if she were to say that somebody was to make a list serve you know\nProgressive leaders they wants to attack but I wouldn't be surprised to see store service on that list I think he is the single most important moment politician I'm spearheading progressive causes worldwide\nGeorge Soros has a really interesting personal history tell us about that and tell us how did he make all of his money\nRight now has a really interesting personal history how about that and tell us how did he make calls his money\nWhen he was born in Nineteen Seventy two well to do Jewish family in Budapest, Hungary or his childhood was dominated by the Nazi occupation of his country and he survived by separating from his family and I think that trauma explains a lot about the focus of his finance or being his politics and life\nAnd he left hungry at Seventeen to go to London and from that he went into finance he moved to New York he opened one of the very end of the hedge funds in New York was a very successful stock market trade so that by around Nineteen eighty\nHe was worth a hundred million dollars but I was just to start\nBecause then he went into currency speculation in the eighties and nineties\nBriefly how did currency speculation make him rich [noise] well\nI'm In the nineties a specialty whereas a currency peg theloop unsustainable famously in Nineteen Ninety two he broke the bank of England by betting that the bank of England couldn't\nKeep the British pound losing to the German deutsche mark and weren't sources right or the pound collapse are us made enough food for sure and and the u._k. economy a descended into some chaos\nWhen did you start getting involved in politics in earnest\nAgain in his native Hungary and then in other Eastern European countries where his philanthropy had a clear\nPolitical tapas which was to build tourism so he was sort of in politics from that period and the eighties own words but the switch came in two thousand tree when he waited into us politics because of the Iraq War there once it became clear in two thousand full\nTime much money he was spending on demographic guitar deserved causes that was the inevitable um counterattack from Republican uh and it became a useful trick\nIf you are being attacked in the media and you were a Republican member of Congress to say well the major is slowing me because ... and his allies have put them up to ... to\nGeorge Soros peculiar becomes seen as a shadowy figure hiding in talk is he just because he had so much money\nYou know I think it's ironic that he's seen as Saturday you caught expanding rushing the birth actually his finance or be a girl the open society Institute He's very open about it he publishes figure as uh\nTry to read the extent of Russian there actually is for them to be a girl the open society Institute He's very open about it he publishes figures about whether donations gr [noise] so I think it's hard to escape\nThe suspicion that the critics who say ... I'm a ... on a long tradition of anti Semitism for a Jewish finances are portrayed as the ... figure through manipulate the politicians and so forth I think it's pretty good indication of that tradition\nWell why do people in his native hungry think of Soros\n[noise] he was a year or early on in the transition away from communism of tons more recently because of the anti immigration populist nationalism taken over the country\nSebastian Mallaby is the author of several books and a senior fellow at the council on Foreign Relations thank you so much\nPresident Trump is headed to Charlotte North Carolina today to rally supporters for Republican congressional candidate mark Harris\nHarris is caught in a tight race in a former Republican strongholds against Democrat Dan McCready NPR's Kelsey Snell has more on how major shift in North Carolina politics marriage changes across America\nFor more than fifty years boaters in the ninth congressional district in North Carolina have been sending Republicans to Congress but things are changing your hair is a conservative Baptist minister is slipping in the polls behind mccready a Democrat and former marine\nDays in the Clinton a professor of political science at ... college says the Trump rally is a sign that Republicans have to fight harder than there used to\nThe fact that President Trump is coming from is a sign that they still see the races winnable it would've been inconceivable two decades ago for a Republican president me become into that district\nNick Clinton said that because of shifting demographics people from other states and other countries are flocking to jobs in places like Raleigh Durham and Charlotte young generations of farmers are doing it too he sounds like the rest of America Democrat to North Carolina dominate the cities and suburbs but things change the further out you go\nTo the political five times that I mean you can almost see the county line the shift between the Democratic signs are on one side of the county law and then you move into another county more rural county and all of a sudden it's strong country\nThe line isn't so clear in other areas like Polk County where the view of the political trend line depends on who you ask county commissioner ray gas\nTrump country the line isn't so clear in other areas like Polk County where the view of the political trend line depends on who you ask county commissioner ray Gaspar ... says the areas about sixty percent Republican but he's the only elected Democrats\nAnd when he sees his party dominating in statewide offices in the future that doesn't mean the entire state is turning blue\n... hundred counties and started for sub or for the rule which for him to go much more Republican\nCounty Republican chairman ... says rural Republican voters like Trump\nI'm seeing a trend where there's a movement away from the Democratic party\nThe Republican Party just because\nThere is a lot of dissatisfaction\nWith what has been going on at the national level\nTrump certainly could be the closing pitch for Republicans who want to keep at least\nIn ninth congressional district from turning blue\nKelsey Snell NPR News ... North Carolina\nHusbands cousin pose a matching red tractor up alongside positioning be attached to rain car catch the beans as they're offered out of the combine\nUs farmers agriculture predicts a record sleeping harvest this year China once a major market for soybeans impose that\nTwenty five percent tariff flashing imports that knocked two dollars a bushel off the price osmund send will get costing him tens of thousands of dollars\nIt's one more thing that we have pretty much no control over it seems like that affects us greatly so I guess we're just kind of rolling with the punches here on this\nAnd the punches keep coming this year besides the terrorists persistent rain pushed harvest back by weeks and there's the new tax law that could have a big effect on farmers who sell their crops to the local grain cooperative\nIowa State university ag economist Kerry Jacobs says the laws changes make who to sell to a dicey proposition ...\nBrain cooperative Iowa State university ag economist Kerry Jacobs says the laws changes make who to sell to a dicey proposition that's what's hard to nail down and that's where farmers are\nIn marketing decision process at this point for example a farm with lots of employees might be better off selling to a private ethanol plant\nBut one with no employees might benefit from joining a co op Mike Allen who farms near Huxley Iowa serves on the border heartland co-op he says even though he's been paying close attention he still doesn't understand how that changes will affect his bottom line\nI contact my accountant about it and he's still going to school and learning about it so he didn't feel comfortable at this point advising\nFor now Helens more concerned with bringing in his crop\nMost of us will be glad when this year just over\nThe agriculture department promised farmers twelve billion dollars to help offset the tariff impact but ... says that's not a real effects but we are in an election year so I figured there'd probably be something like that coming\nA key cos elevator enrolling\nThese Web cranks open the hopper on a semi Gillette soybeans cascade into our pets from there there'll be conveyed to a nearby storage\nThan Iowa State at the economist Chad Hart says higher prices are on the horizon\nAnd so as we look out into the spring of twenty Nineteen we do see some reasonable prices out there that means we're gonna have to have this crop for six seven months to get there\nAnd with all the rain some elevators are storing soybeans that can't sit that long meanwhile Mexico Malaysia Indonesia and even Argentina have stepped in to buy us soybeans\nChina went and bought a lot of fighting from Argentina left them a bit too short to go into the world market they bought some from us and so you're seeing some really interesting trade flows\nBut still about two hundred million bushels that would have gone to China need to find another customer\nOn dry days farmers are razor focused on just getting in this lake crop but with terrorists taxes and quality to worry about this nerve wracking season isn't going to end when the last beans hit the Ben for NPR News I'm Amy Mayer in Ames, Iowa\nAmy story came to us from Harvest Public media station collaboration reporting on food and agriculture\nAmy story came to us from Harvest Public media if the station collaboration reporting on food and agriculture\nIt's NPR news\nI'm Peter O'Dowd a young Saudi dissident living in Canada worked with ... before his\nDeath to fight against Saudi propaganda on line he says ... she was like a father two it was saying I don't want to be so if it goes on history I'm not going to\nHave to keep that next year and you can hear it from twelve to today right here on a point by GB Atlanta\nSupport for ... comes from generous listeners like you\nYour support allows GB to bring you end up stories from across the state our reporters take the time to look at what is happening why it is happening and how it will affect you we have bureaus in Atlanta Augusta\nMaking ends so that we take the time to look at the whole picture gp brings you stories that you won't hear anywhere else and you can listen online\nKick us out a gp be news dot org and stand with the facts\nI'm David Folkenflik coming up on the next on point\nA woman's poignant obituary about her sister were young Vermont mother who died from opioid addiction went viral\nSo did the response from the Burlington, Vermont police chief they both join us so does the author of the book groups\nThat's coming up on that extra on point from NPR\nYou can hear on point this morning at eleven right here on a point five CPB Atlanta\n\nSupport for G. P. B. programs comes from our listeners\nIf you're already a G. P. D. sustain or thank you you're reliable monthly donations provide a steady stream of support for the programs you enjoy an gp be\nNot as sustain are you at ... dot org and become one right now you were secure ongoing gift of five or ten dollars a month will feel great and it'll keep gp be strong for you and your community\nThat's G. P. B. dot org and thanks\nI'm my roots later this week on science friday we traveled to the moon and back with deal Armstrong the new film first man every intention remember\nI Will do to capture the personal side of Armstrong space race or the excitement of space\nThe first man since you remember\nI Will do to capture the personal side of Armstrong space race or the excitement of space travel\nOn science friday from WNYC studio science running this afternoon at ... o'clock right here on a point five GDP Atlanta\n\nSupport for NPR comes from this station [noise] and from American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more AJ W. S. dot O. R. G. [noise]\nFrom the Charles Stuart Mott foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org\nAnd from the ... and James L night foundation helping NPR advance journalistic excellence in the digital age\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin listened carefully and you can almost hear Americans' all over the country binge watching the latest releases from Amazon and Netflix\nTo check tech giants are now turning their attention to India that country's market for online video there is expected to reach over two billion dollars in the next five years\nBut so far neither company has had a whole lot of luck so Cardiff Garcia and Sally her ships from our planet money team identify some possible steps to success I was watching this\nMovie recently on Amazon it's a comedy guy gets engaged his best friend doesn't like the girl tries to break up the wedding\nThere is this whole complicated plot but that is all besides the point what was really surprising was all the working which I told a shock to your own car about she's a journalist for the BBC I don't know if you have to working in the u._k. are you all at the same thing we\nDo a show on the covers Indian film and culture that's where you were watching an Indian film and there are all these stereotypes about these films like that they're really conservative\nI get it Sally you fell prey to stereotype it's\nShameful but true and when I told ... I was surprised by all the drinking and talking about sex in the movie she totally school me\nAnd you know not being the way you just described it in many many many is\nDon't feel bad Amazon and Netflix also need to get up to speed on Indian film because they're up against a serious competitor India already has a major online content provider called hot star and hot star says it has about one hundred and fifty\nThere are up against a serious competitor India already had a major online content provider called hot star\nAnd hot star says it has about one hundred and fifty million monthly users according to counterpoint research\nHas eleven Netflix eat poultry five which brings us to our strategies for streaming success in India number\nOne understand the market because if you think India is all Bollywood think again\nIndia and not just Bollywood\nBollywood movies are mostly in Hindi but according to India's last census a hundred and Twenty one languages are spoken in the country so plenty of Indian films are made in other languages\nYou know when you go to the gate and go to them I remember it and then I I live in an age and I went off and then my that was showing Harry Potter but they were showing it when how common will do that I thought they were thinking and Donald\nStep to programming for culture most of the content Amazon and Netflix produced in the U.S plays well all over the country\nYou can show Portland in New York and Seinfeld and Portland but India is packed with different cultures and viewers want content relevant to them which is why Amazon and Netflix are using strategies three focusing on in ... in this case India's wealthy high earners\nPeople who can afford in other words an Amazon Prime subscription which is almost the same price as hot star just over one US dollar a month or Netflix around seven dollars a month\nAnd both Amazon and Netflix said they're having some luck both are offering content in multiple languages and Netflix has a hit secret and games like cop thriller but if either wants to crack the Indian market there is one more thing though like we need hot star has dissing Amazon and Netflix do not\nThe advantage that the have its credit because Indian cricket\n\nFrom the University of west Georgia with his mind be point seven to fail W. W. W. W. H. B. Gerald Ford of Georgia Public broadcasting radio\nNine point seven FM Wu WG and W. W. A. G. H. D. Gerald Ford of Georgia Public broadcasting radio network [noise]\nLive from the G. P. B. newsroom I'm Leah slamming into a victory for civil rights groups and voting rights advocates Georgia elections officials can no longer reject absentee mail in ballots with signatures that do not match those on file GAPP Stephen ... reports on this week's federal court order\nAbsentee ballots the signature mismatch will now become provisional county officials now have to notify the voters would be a first class mail and email is available and voters can send an attorney to present their id if they could not come in person [noise]\nNormally a voter has until three days after the election to correct problems but in this case they have until five PM the Monday after that's the deadline for elections to be certified\nAs of Wednesday night fewer than two hundred absentee ballots had been rejected because their signatures did not match more than eight hundred thousand Georgians have already voted in the November six election for gp News I'm Stephen Fowler in Atlanta\nGeorgia secretary of state Brian Kemp who is also running for governor is asking a federal judge to suspend that order governing uh election officials handling of absentee ballots an application set of mismatch signatures\nWhile he appeals that us district judge may may as you heard yesterday issued a final order instructing the state to stop projecting the ballots because of a signal a signature mismatch without first giving voters a chance to fix the problem\nThe Fulton County school district is looking for a new superintendent today last night at the board accepted the resignation of Jeff arose Rowe says he's leaving for personal reasons his last day will be December thirty first for more news please visit us at gp being news dot org this as gp be Atlanta it's now six though one\n\nLife from NPR News in Washington I'm core of a cold and law enforcement officers are searching US postal facility near Miami, Florida it's believed some of the ten pipe bomb sent to democratic leaders and activists may have been mailed from there\nTo any intercepted pipe bombs were addressed to former vice president Joe Biden he spoke in western New York last night calling for renewed commitment to American values mine could Desmond reports\nBiden spoke to the same forum at the state University of buffalo where President Obama spoke while he was in office the sellout crowd is sixty five hundred cheered him as he called for pollen\nSpoke to the same forum at the state University of buffalo where President Obama spoke while he was in office the sellout crowd is sixty five hundred cheered him as he called for politicians to rethink what's going on in in division in a series of attacks on President Trump without ever naming the president\nBiden told the audience reporters aren't enemies of the people at immigrants are not animals divisions\nHatred [noise] past\nWords matter Biden spoke today after conservative firebrand Steve Bannon delivered a slashing attack on Democrats and defended the prisoners in another buffalo suburb for NPR News I'm Mike does win in Buffalo\nThe Taliban say Pakistan has released the cofounder of the insurgent group the move is seen as a gesture to facilitate talks among the Taliban the Afghan government and the United states and fears DEA hit the reports\nFrom Islamabad, Pakistan detain mullah ... years ago in a sprawling port city of Karachi a Taliban spokesman confirmed to NPR that he was freed the talks and wouldn't say when he was released or if you'd returned to Afghanistan\nBart was released can be seen as a goodwill gesture to the Taliban but it's always thought unclear if he'll be involved in future talks\nOh is it a policy month a small group of Taliban officials met American diplomats and the Gulf state of Qatar that came off to the U. S. restarted its efforts to bring the Taliban to peace talks to end the Seventeen year conflict in Afghanistan Washington appointed the veteran diplomat Zalmay hold on to say though is that\nThey had Dade NPR News Islamabad\nJapan's prime minister Shinzo Abe's in China needs met with Chinese premier Li Keqiang it's the first formal visit by a Japanese leader to Beijing and seven years the BBC's Rupert wing failed Hayes reports they signed several agreements on trade\nI think the significance primarily pays symbolic in the\nSeven years ago Japanese prime minister has visited China so Japanese prime minister has had this sort of summit meeting with the the Chinese premier and the Chinese a president's so\nProminent fishing though are they being in Beijing being welcomed by the Chinese premiere on these words I mean part of the study is that he's a historic turning point the doing of a new era the ... returned to healthy normal relations between China and Japan so this shows the both sides now wants to end this\nWhat it's been seven years of very chilly relations\nThe BBC's Ruben Winfield Hayes it's NPR\nIt was the both sides know won't end these what has been seven years of very chilly relations\nThe BBC's Ruben Winfield Hayes It's NPR\nNews reports say President Trump is considering issuing an executive order that was closed the southern us border to migrants the Washington Post and the New York times report that would also include people who are seeking asylum\nTrump has been vexed reports of thousands of Central American migrants who are now in southern Mexico they're vowing to walk to the U.S border\nTrump is ordered about eight hundred US troops to the border to assist immigration and Customs Enforcement agents [noise]\nThe number of algae Beatty cue characters on TV is up significantly according to the media advocacy group glad and bears Mandalit del Barco has more with\nThe new super girl show introduced the first transgender superhero on TV knee and now a K A dream\nI got her I said back\nOff the new report from glad celebrates the CW network new character as well as the show post on FX\nAccording to their numbers that show has the most transgender series regulars ever\nA number of lesbian gay bisexual and queer characters on broadcast TV is also the highest the group has recorded but glad is asking the TV industry to ensure that within the next two years ten percent of the series regulars represent the algae B. T. Q. community ... NPR News\nLawmakers in Ethiopia have elected the country's first female president ... will assumed a largely ceremonial posed Ethiopia's new prime minister recently named a cabinet in which half\nThe ministers are also women the new president has previously worked for the un\nI'm more of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nSo six you are listening to MORNING EDITION on a point by ... Atlanta we are Atlanta is NPR News station I'm Leah plumbing welcome to friday morning it is a chili one we've got clouds in the marine on and off and forty degrees right now\nIs calling for a cloudy day to day and that rain will stick with us on and off ties are going to be right in the upper fifties for today and it'll be cloudy tonight with overnight lows\nIs calling for a cloudy day to day and that rain will stick with us on and off ... going to be right in the upper fifties for today and it'll be cloudy tonight with overnight lows around fifty degrees [noise]\nMegan Kelly in blackface Matthew Shepard will finally be laid to rest today Twenty years after he was murdered those are some of the stories that we're going to get into in this next hour of MORNING EDITION but first this case and for talks with his mother about an important life of then\nIt shouldn't be scary it'd be who you are I mean maybe a little bit it fresh but it's way happier as fait\nSaid we're going to hear from a twelve year old on his life as a transgender boy that is coming up on story corps in Fifteen minutes this morning edition continues right here on eight point five\nFor TB comes from you our listeners ... museum of art first friday is back on November second from six to nine PM guess will enjoy live music dad's garage performances and art making with color H. T. L. tickets are available at high dot org\nAnd the Atlanta Opera presenting west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and eleven at the called energy center tickets at Atlanta Opera dot O. R. G. and from NPR News I'm Rachel Martin in Del Rio Texas\nAnd I'm Noel King in Washington DC good morning a massive search is underway for the person or people who mailed homemade pipe bombs to critics of President Trump\nAt least ten packages had been sent a prominent figures including President Obama his former attorney general and his former CIA director NPR's national justice correspondent Carrie Johnson has been following this story morning carry the morning to well so what is the focus of this investigation that\nThe investigation seems to be focused on two places one is the FBI lab based in Quantico, Virginia which is analyzing these devices in a while you know they look like homemade pipe bombs and experts at the FBI are looking for clues about\nHow the bombs were constructed a where um materials may have been purchased and they're also be looking for DNA or fingerprints the bomber may have left behind\nRetired investigators tell me and this is very promising because\nSo many of these devices are intact they didn't explode but if history is a guide and this process of analyzing the devices is going to take a while it won't be overnight All right so Quantico, Virginia is one place what's the second place in second place is on north of Miami\nAt a package sorting facility in Florida in ... Florida\nQuantico, Virginia is one place what's the second place and the second place is north of Miami at a package sorting facility in Florida in ... Florida\nThe operating theory for now is that some or all of these ten packages went through that facility and through the u._s. mail investigators are looking for more devices but also any other clues there there's a lot of manpower deployed not just in Florida but all over the country\nAt six Nineteen you are listening to MORNING EDITION on a point by G. P. B. Atlanta I'm Leah Fleming Del Rio Texas it's across the border from Mexico and people there say the two sides get along well ... ...\n...\nIt's actually not just ahead how\nThe issue of immigration is playing out in an area where residents seem to have one foot in each country that's ahead in Fifteen minutes has MORNING EDITION continues\nFor TB comes from you our listeners and Georgia State parks as things get shorter and temperatures start dropping there's no better time to huddle around a campfire at Georgia State parks\nInformation and rates available at visit gee a state parks dot org and fernbank museum presenting nature's superheroes a new interactive exhibits that explores how plants and animals adapt to extreme conditions with surprising superpowers information at fernbank museum dot\nOrg so over the summer it was all black girl magic in the city of ... after it was noted that the law enforcement and you ... the court system was led by an all black woman cast well that's no longer the case of the men now leads the police force\nBut no cell phone is in the news again this time for a while council meeting that was held on Tuesday when one city councilwoman cold and police after she accused another threatening her with a taser according to the AJC the incident inside the council chambers appears to have been triggered by disagreement about the correct way to rename a football field\nAt old national city park the police are investigating [noise]\n\nSunnyside ... lawyer portrayed and midnight in the garden is good and evil and he's also the caretaker of August ... bulldogs mascot\nSame land issues which are you\nDoing graduate Ingrid\n... feet sales\nThe way she did give a\nWidening graduating grade\nWe could actually see the sales couldn't turn and\nWe accept the origins\nAnd part of being a guy on second thought It's MORNING at nine from keep eating in\n\nSupport for NPR comes from the station and from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics Sendai your teeth solutions learn more it's the three I O T dot a guy\nFrom Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles the family's experience of survival relapse in recovery starring Steve corral and Timothy shallow may now playing\n[noise] and from the University of Florida who we're solving for next is powered by its land grant heritage from renewable energy to global health UF students and researchers are working to solve challenges ash next dot U. F. L. dot edu\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning earlier this week NBC's Today show anchor Megan Kelly caused outrage with some on air remarks about Halloween costumes\nAnd the controversy on the outskirts of New York with ... as she dresses Diana Ross and I felt like she wants to look like they interrupt her one day I I don't know how like that got races on Halloween why\nNow NPR's David Folkenflik is reporting that the network has dropped Kelly from the today show lineup and that she appears likely to leave the network because of the fallout from those comments the morning David ... okay so this is not the first time that Megan Kelly has made controversial comments about race here she is in twenty Thirteen when she was an anchor on Fox News\nPearl you can't watch at home than it is white and she said it was a white man to\nTell us about her history of making racialized comments\nWill these aren't uh the only examples of their number I remember back in twenty or ... the Santa Jesus comments back from twenty Thirteen she later said she'd been joking and last year claim that she she regretted those remarks but\nI remember back in twenty ten um she spent a fair amount of time on a tiny tiny he group ... group called the new Black Panthers a one I Believe them ultimately a sea started criminal charges related to voter intimidation she spent over three and a half hours\nBruce ... group called the new Black Panthers or one I Believe them ultimately a face criminal charges related to voter intimidation she spent over three and a half hours in a three week period focusing on it as though it was a threat to the Republican\nIndeed as one of her former colleagues were counted basically yelled at a white liberal strategist for about ten minutes to she felt was failing to take it a sufficiently seriously uh one more example of among several uh she keeps kept inviting the a former LA up a homicide detective mark ... farm in on the air to talk about a ... a\nCriminal justice issues and to talk about the question of a African American relations with police officers he of course had to admit on the stand he had said racist things over the years during the OJ trial um many people saw that as a as discredited thing she welcomed among show\nDo you think that history played a role in NBC's decision to let her go\nI think it's played a strong role in the uh the reaction of NBC's colleagues particularly but not exclusively NBC's I'm African American journalists are outraged who her remarks about uh what she thought was the acceptability a blackface NBC's\nNightly news with Lester Holt there the whole thing about this controversy on its OWN Network which seems to suggest something and at making Kelly's colleagues and their attitude\nToward her for you and me it might be an admirable exercise and transparency and I think it was that I think it's worth pointing out also Lester Holt the only African American anchor ah of any made of the big three broadcast networks but it's also a sign that NBC was saying we're not going to protect the starting with we we might even though she's one of the most recognizable\nFaces and TV news which is really interesting\nThe fact that she has been dropped I think it will surprise some people and I wonder does the way the network has handled these comments say something bigger about the way networks in companies are are Tyler I in tolerating racialized or racist comments [noise]\nWell it's hard not to look at this in light of you know direction at times very slow of major news organizations to the me too movement which was something that for a significant time making Kelly embraced a sheet accused are former boss at Fox News of sexually harassing\nHer I also think you can't divorce it from the fact that making Kelly I received very tepid a welcome from her colleagues NBC News she just play some popular colleagues\nAnd that her ratings themselves were mediocre and that even before all this happened uh she'd been discussing with a network another role there uh because uh she needed to get out of that show now the show's gone and she's a negotiating her eggs that as well to\nNPR's David Folkenflik thanks hated you bet\nAnd she's a go shooting her eggs as well to\nNPR's David Folkenflik thanks to you but\nFriday and time again for during the day a mother talks with one of our kids about an important in life moments\nCaissons for the youngest of seven children when he was twelve years old case and sat down at StoryCorps with his mother Jennifer ...\nTo talk about life in elementary school in Tuscaloosa, Alabama\nTell us a little bit about yourself I named Marshall largest I played the standup base [noise] I Am learning how to play the guitar and I am transgender to what level are you in martial arts on a level to blue built that means I'm halfway to black ...\nWhat is your favorite subject in school the ... our lunch\nWhat grade level where you are in school when you decided to tell your friends and family that you're a transgender\nIt was around fifth grade when I told my friends and family out of his transgender because up until then I did not know that the word existed\nIt was Mary every day\nUh Haiti being called a girl I hated being called an daughter put most everybody in my family friends they were just okay because they kind of knew it was common yeah\nOver the summer I went to a camp and they did not know I was transgender they just called me he was awesome [noise]\nI think the happiest moment in my life [noise] probably be January sixteen two thousand Fifteen eight forty five PM you'd ...\nYou'd been telling me for quite a while there you want to boxers viewer wearing all boy clothes getting boy hair cut and that was like the finals change and you are just ecstatic that but I was there anything else he would lie for people to know about you well\nEven though I'm ... I'm a kid too I have hallmark good deal if I of tests and deal with\nI had them extremely proud of you because you have been true to who you are and you're very courageous\nIt shouldn't be scary it'd be who you are I mean maybe a little bit at first but it's way happier this way as me\nI don't think he realized what a leader you are people look up to you because\nYou are not afraid to take a different path and we know\nPeople look at to you because\nYou are not afraid to take a different path and we know that it's your life and you're the one that's got to live at that we are there for you every single step of the way we're going to do whatever we can to\nTo lighten your leg who'd been very proud to be your mom\nI'm tired of the nation [noise] [noise]\n[noise] that was case and forgive and Jennifer ... for StoryCorps\nConversation was recorded in Birmingham, Alabama in twenty Fifteen\nThey're interview will be archived along with hundreds of thousands of others in the library of Congress\n\nMajor support for StoryCorps comes from super up featuring the all new three row with feeding for up to eight a choice of second row captain's chairs love it's what makes us Subaru was super and learn more at Subaru dot com\nJust across the little if even a river this looks like a week of increased books river unreal how many feet are we talking my\nCall we'll probably talk what three hundred feet foreigner free\nI mean that's the hardest across\nSo nine someone can just\nFrom across just walk up here just like we didn't walk to that road huh\nI asked sheriff Martinez how the immigration debate is affecting people's politics here\nAnd like other folks we spoke to in Del Rio he said it's not top of mind for residents this is a relatively quiet part of the border the people who do sneak in get out quickly and moved to a bigger cities\nAnd even a Republican congressman will Hurd has spoken out against the wall he's facing a democratic challenger named Gina Ortiz Jones who's trying to tie her to President Trump\nBut this is a swing district in heard has positioned himself as a moderate and by doing so he's one of the support people like Jeff Martinez\nWill it come to an air of giving them the same door\nWorries too so that are all busy a tit for us\nThis is interesting because sheriff Martinez like most\nWilling to sell that are all busy a tit for us\nAnd this is interesting because you're Martinez like most elected officials here is a Democrat and even though we didn't vote for President Trump and has some issues with his policies and his rhetoric Martinez is pleased about one thing\nThis ministry Russian [noise]\nSure sure been invited to the table\nFor years and minister ... ...\nFor we were\nEverybody else was even the bones were even below me\nUp to the\nTo solve the immigration issue\nSo sure to be at the table\nReturns you can't just go to\nBecause he knows the battle over immigration is going to go on for a very long time which brings us back to the original question what about that Wal\nMart deal was to [noise]\nDo you control for technology camera a sort of put in the physical structure where you're going to put a\nKey points to the houses along the river on the U.S side of the border\nOr you go to put these people and let you go are you going to put these people in the wrong side of the wall\nClean well people like Amanda gear a block out the noise about the wall she will vote for the incumbent Republican Senator Ted Cruz and Republican congressman will Hurd and she will keep going back and forth across the border in her backyard\nThat she did but I find\nAnd just like that were in Mexico\nCity the exchange places around here where the dollar exchange this is how can we yeah we walked down the mainstream filled with bars\nIn stores selling all kinds of Mexican handicraft we thought that one storefront where a woman is sewing handmade dolls stressed and colorful ... says\nShe actually making them if not my heating and not coming from China these are authentic regulated they cannot\nGet a check out there with a smile on their mission not just for a long black hair over her shoulder and waved goodbye and I had a command it gets in her white SUV and waste in the long line to cross back over into the U.S\nShe'll return in a few days though she has dresses that means tailoring\nAt six forty three you are\nAt six forty three you are listening to MORNING EDITION on a point five G. P. B. Atlanta I'm Leah Fleming it is great to have you joining us today for MORNING EDITION Atlanta continues to build its reputation as a technology hooked by\nNew York based black rock which is a global Asset Management firm and a tech solutions provider they've announced that they have chosen Atlanta for the company's new innovation hub black rock well established a president than Fulton County partner with the local business than university community in addition to creating a thousand jobs within the next few years\nWith the Atlanta expansion black rock says it hopes to extend its technology capabilities close to universities like Georgia Tech\nWhere black rocket currently sponsoring a scholarship for disadvantaged students pursuing degrees in the stem field\nWe're gonna bring you more business news on the marketplace morning report that's coming up in ten minutes right here on a point five [noise]\nFor ... comes from you our listeners and public delivery powered by ... public believes that between work and to do list time as valuable public aimed to help people regain time by delivering groceries to customers doors more public dot com slash delivery\nAnd Callaway resort in gardens Georgia's authentic outdoor escape offering to championship golf courses the scenic ... the course and the mountain view course twelve time host of the PGA Buick challenge more Callaway Gardens dot com [noise]\nTo be a little more than a week to go into election day it appears the conduit for dropping her remains a toss up one of the factors that will shift the balance Brian Kemp or ...\n... commission was closed political rewards insiders will be here to break down every step of the bushes and we'll look at what's happening in other races on the ballot for Congress and state wide officers joining us today or to [noise]\nSound as music to my years\nSeventies in Georgia the four seasons summer fall winter and spring it's football Springfield mo recruiting and finding de ... GB sports every Friday I traveled big covering high school football games for GB TV but there's still a lot to talk about joined me all the ball\nIn day I'm John Nelson a GB sports every Friday I traveled snake covering high school football games for GB TV [laughter] but there's still a lot to talk about joined me for the ball findings in Georgia pod cast available on GB dot org and wherever favorite my ... [noise]\nMORNING EDITION\nSupport for NPR comes from this station and from Amazon Web services used by millions of customers a ws provides a range of cloud services and functionality from tools to security took compliance or information at AWAC is how dot com\nAnd from Trader Joe's offering new products in every store and and new episodes of the original pod cats series inside Trader Joe's at apple pie cash or where pod cast are available more at Trader Joe's dot com\n[noise] this is MORNING EDITION on a day point by db Atlanta I'm Leah Fleming it's been nearly three weeks since hurricane Michael slammed into southwest Georgia Decatur county was hit very hard governor Nathan Deal called at ground zero students in the county school system are finally returning to class this week as ... Ross around reports\nHurricane my goal hit that cater county on a Wednesday during the second week of October so it worked out great for the timing for county school superintendent Tim ... she says they were two days away from going all fall break\nThe only thing is we rented society a potential category one you know as of Tuesday Morning of we were not anticipating we ended up leading\nSchools like most other places ended up losing power for a few days as a result Cochran says the district last about a quarter of a million dollars worth of food\nFor six foot but districts seven schools are policing food was their biggest concern but for ... street elementary school there was damage that type of building or a ... teaches kindergarten mare she says her heart broken for her students when she first saw her classroom\nPlace and they come to every morning come running in the door and there's glass shattered all over the four and\nThere's a trained her in the military\nThere just feeling ... and\nI was dealing with more than on damage how she says she also noticed twenty four computers for missing from her classroom\nI just thought maybe the technology department come in to check to make sure they were all working and then I was told no they're all gone and they got my keyboard on now\nFor mountain here [laughter]\nThat come in to check to make sure they were all working and then I was told no they're all gone they got my keyboard and I'm now\nFrom I come here [laughter]\nWe always have backup plans\nHudson says they will default or traditional ways of learning using more books and other hands on activities while it may be easy to repair storm damage or play stolen computers teachers say students will be dealing with the storms impact for the near future blizzard Benson teaches fourth grade\nSome of them come in Hungary and they come in dirty they may not have running water yet and they might not have what they need so finding out what their needs are and meeting them are going to be our number one priority and giving them the chance to speak or talk about what they need to\nAfter superintendent Tom Cochran announced on Facebook there will be reopening schools some parents voice their displeasure saying it was too soon many families bill act power and water cockroach says it falls on the schools to help those kids and parents\nWe need to make sure we're ... for those families because you know only one day we have kids or do they hold a normal day we have kids don't really have a good place to go there so we had a we have to worry about too\nIt's not just families what students who may need help fencing says some teachers have lost their houses just got power turned back on and still have to breathe littering better yards that she fought back tears basically says none of that will matter the minute their kid step foot back into school\nSome educators that live out in the country that may not have what they need to get there going to put things on the back and they're going to come and they are going to give everybody a child and the best they can give them every day to help them find that scandal and that simply means of normalcy\nAnd on their first day bag Benson says only two students were apps and oh Hudson says her entire class was president for P. B. News I'm Ross Perot in Atlanta [laughter] this is\nEight PM American public media\nFrom the University of west Georgia Ninety point seven FM Wu WG hand Wu WG HD Gerald Ford of Georgia Public broadcasting radio network\n[noise]\nW. W. W. W. H. B. Gerald Ford of Georgia Public broadcasting radio network\nLive from the ... the news room I'm living in a victory for civil rights groups and voting rights advocates Georgia elections officials can no longer project absentee mail in ballots with signatures that do not match those on file D. V. D. Steven Tyler reports on this week's federal court order\nAbsentee ballots with the signature mismatch will now become provisional county officials now have to notify the voters would be a first class mail and email is available and voters consent and attorney to present their idea if they could not come in person [noise]\nNormally a voter has until three days after the election to correct problems but in this case they have until five PM the Monday after that's the deadline for elections to be certified\nAs of Wednesday night fewer than two hundred absentee ballots had been rejected because their signatures did not match more than eight hundred thousand Georgians have already voted in the November six election for gp News I'm Stephen Fowler in Atlanta\nMeanwhile secretary of state Brian Kemp who is also running for governor says he's appealing that federal judges injunction stopping Georgia from rejecting absentee ballots because of signatures deemed not to match those on file camps attorneys called the injunction unworkable given the need to have votes counted and the election certified by the Monday after the election\nThey made those arguments in a new filing submitted late yesterday campus asking the judge to hold off on enforcing the injunction while he appealed it to the eleventh hour at\nThe Fulton County school district is looking for a new superintendent today last night the board accepted the resignation of Jeff rose rose says he's leaving for personal reasons his last day will be December thirty first it's forty eight degrees right now under cloudy skies for\nMore news visit us at ... news dot org this at gp badlands ... it's now seven oh one [noise]\n... news in Washington encore of a Coleman federal and local law enforcement officers are searching the u._s. postal facility in Florida NPR's Carrie Johnson reports it's believed that some of the ten pipe bombs addressed to democratic leaders and liberal activists may have been mailed from this location\nThis postal service was ... he is an over locker near Miami operating theory for now is that some or all of the ten packages went through that facility and through the u._s. mail investigators were looking for more devices but also any other clues\nNPR's Carrie Johnson says NPR has learned the leaves are promising that's because\nFacility and through the u._s. mail investigators for looking for more devices but also any other clues\nNPR's Carrie Johnson says NPR has learned the leaves are promising that's because many of the devices are intact they did not explode the FBI's analyzing them at its lab in Quantico, Virginia agents will search for fingerprints or DNA on the devices or on the manila envelopes they were sealed in\nChina has denied in New York Times report that Chinese spies are listening to President Trump's phone calls NPR's Rob Schmitz reports\nA Chinese official took a page from President Trump's own playbook calling the times report fake news Chinese foreign ministry spokeswoman watch when you suggested President Trump exchange his iPhone for cell phones made by Chinese manufacture while ways if us is worried about security issues\nThe times reported that American intelligence said Chinese and Russian Spies are listening in when Trump calls friends on one of his iPhone is using the information to try to influence him and impact administration policy Trump pushback tweeting Thursday that he only uses government phones\nFor his part China's long been accused of effort to target US government military in commercial entities with cyberattacks Rob Schmitz NPR News Shanghai\nImmigrant activist groups are preparing for families who are being released from detention to the streets on the southwest us border from member station ... in San Francisco Julie small reports there is NO PLAN to ensure their safety\nAnd these apprehended at the border used to get help from immigration and Customs Enforcement upon release in the form of a ride to safe housing or other assistance\nAgency no longer handles post released planning relying on nonprofits and churches to step in Lawrence cues to tell all with crossroads Justice Center of San Diego says the change puts families at risk\nAnd they'd be people who are NATO I'm not even though there are providers in the community or resources available to make sure that they are safe and healthy\nIce will enroll families and alternatives to detention or another form of supervision and issue notices to appear in court for NPR News I'm Julie small in San Francisco\nMeanwhile published reports say President Trump may sealed the southern border against migrants the Washington Post and the New York times report that would include people seeking asylum\nWas learned Thursday that the president has ordered about eight hundred US troops to the southern border they're supposed to assist immigration and Customs Enforcement agents\nHere listening to NPR News from Washington\nOfficials in the northern Mariano\nShouldn't and Customs Enforcement agents [noise] you're listening to NPR News from Washington\nOfficials in the northern Marianna islands are calling for help from the U.S government the U.S commonwealth in the Pacific ocean not far from one was smashed by super typhoon you too it was a category five hurricane and there were some reports top sustained winds where one hundred eighty miles per hour\nThere are reports at least one person was killed officials say the destruction has been catastrophic the Associated Press estimates half a million people live there\nBut they department says the son of slain journalist democracy showed gene is heading to the United states with his family after the Saudi Government lifted a travel ban on them NPR's Michel ... reports\nThe Saudi king and crown prince offered salad ... condolences and an uncomfortable looking photo up this week and made questions of whether he'd be able to leave the country State Department spokesperson Robert Bella dino says the secretary of state raised this directly with the Saudi leadership\nI just confirmed this uh the secretary of state [noise] ah did make it clear to Saudi leaders their job he wanted ... to be able to return to the United states than we are pleased that that is the\n... the U.S is still considering next steps in response to what the Saudis are now admitting was it premeditated crime Michele Kelemen NPR News the state department\nGame three of the world series is tonight in Los Angeles the LA Dodgers will host the Boston Red Sox Boston leads the best of seven series two games to none Boston is trying to win its fourth championship since two thousand for LA has not won since Nineteen eighty eight [noise] this is NPR\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the and he Casey foundation\nSeven six you are listening to MORNING EDITION on a point by db Atlanta we our land is NPR News station I may have Fleming welcome to friday morning we got some rain and forty eight degrees right now the forecasts are calling for a cloudy day and yes we will see that rain on and off throughout the day I was going to be right in the upper fifties [noise]\nAnd then we'll be under cloudy skies tonight with overnight lows right around fifty degrees a domestic terror hunt is underway in this country and the new podcast\nThese and then we'll be under cloudy skies tonight with overnight lows right around fifty degrees a domestic terror hunt is underway in this country and the new podcast that's the most vexing questions about the Larry Nassar case those are some of the stories that we're we're going to tell you about in this next our MORNING EDITION but first this suspicious packages\nWere mailed to numerous public figures this week including billionaire and well known liberal ... George Soros\nIs this thing rumors important moment to push and progressive causes worldwide\nJust add ... tell you more amount Soros NYU so despised by the political right that is coming up in Fifteen minutes at MORNING EDITION continues right here on eight point five\nPort for CPB comes from you our listeners and the alliance theatre presenting Knicks flamingo grill inspired by the true story of the first integrated nightclub in Atlanta and featuring original jazz music September twenty nine through October twenty eight alliance theatre dot org\nAnd we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home well star dot org slash male will start Mayo Clinic working together working for you [noise] it's\nMORNING EDITION from NPR News I'm Rachel Martin in Del Rio Texas home of member station KCPW T. P. D.\nAnd I'm Noel King in Washington DC good morning\nInvestigators are still searching for the person or people responsible for sending ten suspicious packages to political and public figures around the country\nWe're going to keep up keep updating you this morning with the latest on that investigation but first we're going to take a step back and look at how law enforcement has dealt with dangerous mail packages in the past\nAnd how that's informing this current probe\nJoining us now is NPR's national security correspondent Greg Myre yeah Great Hey Noel All right so the government is putting a lot of resources into this investigation uh this is not the first uh type of investigation or investigation of this sort and the country's recent history or what have investigators learn from those those earlier probes\nWell the first of all we know these are relatively rare going all the way back to Nineteen Seventy they've just been fifty seven package bombs and twenty three additional cases of dangerous materials like anthrax or rice than these figures come from the start consortium which studies terrorism at the at the University of Maryland\nBeen fewer than twenty death but one big change some of the cases in the past were very very hard to solve all the ... the Unabomber\nLen been fewer than twenty death but one big change some of the cases in the past were very very hard to solve the ... the Unabomber was on the loose for Seventeen years\nThis is NPR News\n\nAt Nineteen you are listening to MORNING EDITION on a point by ... Atlanta and Leah Fleming good morning a new poll from NPR PBS NewsHour and merits suggests that a boaters impression of President Trump will factor into their vote next month we're going to take a closer look at that poll in Fifteen minutes\nFor CPB comes from you our listeners tend to Georgia brain and spinal injuries trust fund commission advising that a traumatic brain injury is one cause\nBy an external physical force such as a car accident fault or sports the commission can help details of B. S. I. T. S.\nDot Georgia dot com can region staying healthy to transition into financial responsibility with regions to solutions tools to manage their money pay bills and control spending information regions dot com slash students solutions\nSo over the summer it was all black girl magic in the city of cell phones and after it was noted that the law enforcement and municipal court system was led by an all black woman cast well that is no longer the case as a man now leads the police force\nBut that's not the point I'm trying to make now ... is it in the news again this time for a wild city council meeting earlier this week when one city councilwoman cold in the police after she accused another councilwoman a threatening her with a taser\nAccording to the Jaycee the incident inside the council chambers appears to have been triggered by a disagreement about the correct way to rename a football field that old national study park\nThe police are investigating\nSunnyside ... lawyer portrayed in midnight in the garden as good and evil and he's also the caretaker of August UGA bulldogs mascot\nFriend is your land where she would she added to give a\nWaiting period\n... street fairs\nYou've got along the way she did give a\nWidening waiting for it\nWe could actually see sales but couldn't turn it back so\nWe accept the origins\nAnd part of being a guy on second thought this morning at nine from keep eating\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah widely Christina Hendricks endanger rentals a new episode every Friday on prime video\nFrom the S P certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\n[noise] and from at Lausanne a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together\nMore at ... dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning the billionaire George Soros is one of several public figures who've been mailed what are believed to be pipe bombs this week\nCirrhosis a hedge fund investor and philanthropist whose donated to causes many of them progressive around the world and we should note that the open society foundation which he founded in Nineteen Ninety three has been a financial supporter of NPR\nEndured SARS has a lot of enemies in politics he's been a target of conspiracy theories from the right\nSebastian Mallaby is the author of more money than God a history of the hedge fund industry and I asked him recently if he was surprised to see George Soros among the U.S presidents and other prominent Washington figures who've been sent these packages\nBoil the whole phenomenon of the problems are just just depresses me in a poor me but um if you were to say that somebody was to make a list of you know progressive leaders they weren't strict hurt\nBut I wouldn't be surprised to see or service on that list I think he is the single most important and um spearheading a progressive causes worldwide\nGeorge Soros has a really interesting personal history tell us about that and tell us how did he make all of his money\nWhen he was born in Nineteen thirty two ... Jewish family in Budapest, Hungary a serious child\nAnd tell us how did he make calls his money\nWhen he was born in Nineteen Seventy two well to do a Jewish family in Budapest, Hungary or his childhood was dominated by the Nazi occupation of his country and he survived by separating from his family and I think that trauma explains a lot about the focus of it for them to be in his politics and they live\nAnd he left hungry at Seventeen to go to London and from that he went into finance he moved to new key I opened one of the very early hedge funds in New York was a very successful\nStock market trade and so that by around Nineteen eighty he was worth a hundred million dollars but I was just to start because then he went into currency speculation in the eighties nineties\nAnd tell us briefly how did currency speculation make him rich [noise] well\nI'm In the nineties just specialty whereas a currency pegs that looked unsustainable and famously in Nineteen Ninety two he broke the bank of England by betting that the bank of England\nCouldn't keep the British pound losing to the gym and George mark ... is right or the pound collapse are us made enough food for sure and and the u._k. economy descended into chaos\nWhen did you start getting involved in politics in earnest\nBegan in his native Hungary and then in other Eastern European countries where his ... he had a clear political confidence which was to build for autism\nSo he was sort of in politics from that period and the eighties own words but the switch came in two thousand tree when he waited into us politics because of the Iraq War\nThere once it became clear in two thousand four\nQuite how much money he was spending on demographic get out the vote causes that was the inevitable um counter attack from Republicans a and it became a useful trick\nIf you were being attacked in the major and you were a Republican member of Congress to say well the media was slurring me but credit ... and his allies have put them up to it\nWhy does do some peculiar becomes seen as a shadowy figure hiding in talk just because he had so much money\nKnow I think it's ironic that he's seen as Saturday you kind of expanding rushing the birth actually his for them to be a cool the open society Institute He's very open about it he partnership figures are about where their donations go so I think it's hard to escape the suspicion that the credit\nThe suit he's very open about it the partnership stickers about where the generations gr so I think it's hard to escape the suspicion that the critics are saying ... I'm\nA veteran or on a long tradition that under some interesting ... jurors finances are portrayed as the shutter if it goes through minute to politicians and therefore I think it's pretty clear indication of that tradition\nWell what do people in his native hungry think of Soros\n[noise] he was a ... year or early on in the transition away from communism of tons more recently because of the anti immigration populist nationalism taken over the country\nSebastian Mallaby is the author of several books and a senior fellow at the council on Foreign Relations thank you so much\nPresident Trump is headed to Charlotte North Carolina today to rally supporters for Republican congressional candidate mark Harris\nHarris is caught in a tight race in a former Republican strongholds against Democrat Dan McCready NPR's Kelsey Snell has more on how major shifts in North Carolina politics mirror changes across America\nFor more than fifty years boaters in the ninth congressional district in North Carolina have been sending Republicans to Congress but things are changing busier Harris a conservative Baptist minister is slipping in the polls behind mccready a Democrat and former marine\nDavid a Clinton a professor of political science at ... college says the Trump rally is a sign that Republicans have to fight harder than there used to\nThat President Trump is coming from is assigned the Bush still see the races winnable it would've been inconceivable to do is go for a Republican president me become in that district\nNick Clinton said that because of shifting demographics people from other states and other countries are flocking to jobs in places like Raleigh Durham in Charlotte young generations of farmers are doing it too he says like the rest of America Democrat in North Carolina dominate the cities and suburbs but things change the further out you go\nDo it with the political five times that I mean you can almost see other county law and the sheer between the Democratic sons are on one ... and you're moving to another county more rural county and all of a sudden it's strong country\nThe line isn't so clear in other areas like Polk County where the view of the political trend line depends on who you ask county commissioner ray Gasper sense as the areas about sixty percent Republican but he's the only elected a Democrat and well\nIt depends on who you ask county commissioner ray gas ... says the areas about sixty percent Republican but he's the only elected a Democrat and when he sees his party dominating in statewide offices in the future that doesn't mean the entire state is turning blue\nWherever hundred counties in the ... percent or ... rule which for him to go much more Republican\n... county Republican chairman ... says rural Republican voters like Trump\nI'm seeing a trend where there is a movement away from the Democratic party to the Republican Party just because\nThere is a lot of dissatisfaction\nWith what has been going on at the national level\nTrump certainly could be the clothing pitch for Republicans who want to keep at least in ninth congressional district from turning blue Kelsey Snell NPR News pope county North Carolina\nHusbands cousin pose a matching red tractor up alongside positioning the attach rain cart catch the beans as they're offered to combine\nThe U. S. foreign live agriculture predicts a record sleeping harvest this year that China wants a major market for soybeans impose the twenty\nFive percent Paris flashing imports that knocked two dollars a bushel off the price arguments then we'll get costing him tens of thousands of dollars\nIt's one more thing that we have pretty much no control over it seems like that affects us greatly so I guess we're just kind of rolling with the punches here on this\nAnd the punches keep coming this year besides the terrorists persistent rain pushed harvest back by weeks and there's the new tax law that could have a big effect on farmers who sell their crops to the local grain cooperative\nIowa State university ag economist Kerry Jacobs says the laws changes make who to sell to a dicey proposition that's what's hard to nail down and that's where farmers are in marketing decision process at this point for example a farm with lots of employees\nDoes this and that's what's hard to nail down and that's where farmers are in marketing decision process at this point for example a farm with lots of employees might be better off selling to a private ethanol plant\nBut one with no employees might benefit from joining a co op Mike Allen who farms near Huxley Iowa serves on the border heartland co-op he says even though he's been paying close attention he still doesn't understand how that changes will affect his bottom line\nI contacted my accountant about it and he's still going to school and learning about it so he didn't feel comfortable at this point advising\nFor now Helen's more concerned with bringing in his crop\nMost of us will be glad when this year is just over\nThe agriculture department promised farmers twelve billion dollars to help offset the tariff impact but ... says that's not a real effects but we are in an election year so I figured there'd probably be something like that coming\nA key cos elevator enrolling to Iowa these Web cranks open the hopper on a semi to let soybeans cascade into a pet [noise] from there there'll be conveyed to a nearby storage\nThan Iowa State at the economist Chad Hart says higher prices are on the horizon\nAnd so as we look out into the spring of twenty Nineteen when we do see some reasonable prices out there but that means we're going to have to have this crop for six seven months to get there\nAnd with all the rain some elevators are storing soybeans that can't sit that long [laughter] meanwhile Mexico Malaysia Indonesia and even Argentina have stepped in to buy us soybeans\nChina bought and bought a lot of planes from Argentina left them a bit too short to kill them into the world market they bought some from us and so you're seeing some really interesting trade flows\nBut still about two hundred million bushels that would have gone to China need to find another customer\nOn dry days farmers are razor focused on just getting in this late crop but with terrorists taxes and quality to worry about this nerve wracking season isn't going to end when the last beans hit the band for NPR News I'm Amy Mayer in Ames, Iowa\nMe story came to us from Harvest Public media it's station collaboration reporting on food and agriculture\nAt seven forty three you are listening to MORNING EDITION on it a point\nOn food and agriculture\nAt seven forty three you are listening to MORNING EDITION on a point five ... Atlanta I'm Leah Fleming good morning we get forty eight degrees right now under cloudy skies parts of Atlanta are seeing some rain jobs right now we're going to have brain on and off today I was going to be right in the upper fifties for this afternoon I\nDo pot cats as the most vexing questions about the Larry Nassar case the head doctor the U.S women's Olympic team who sexually abused scores of young women we're going to hear from the pod casters on that kept coming up and Fifteen minutes\nThat MORNING EDITION continues right here on the eight point five\nFor TB comes from you our listeners an eagle eye books located in Decatur and independent bookstore for readers of all ages featuring new and used titles and knowledgeable staff to guide any search online or in person or an eagle eye books dot com a great guy for good books and Peachtree orthopedics helping Atlanta heels for over\nSixty five years with specialist for every body part from regenerative medicine to outpatient join and spine surgery\nTheir goal is to help people feel better faster peach tree orthopedic dot com [noise]\nIt was a little more than a week to go until election day it appears the conduit for governor remains a toss up one of the factors that will tip the balance Brian Kemp or ...\n... as the race come as you were closed political rewind insiders will be easier to break down every step on the porch to the finish line and we'll look at what's happening in other races on the ballot for Congress and statewide offices joining us today to\n[noise]\nYou know selling a car can be a hassle but Joan ... is a whole different story split I was taking off your hands or off your driveway and turn it into the public radio and maybe even a tax deductions ... all the host of marketplace here is how to do\nSeven seven GP be one car or donate securely on line a gp dot org slash cars and thanks [noise]\nSeven seven GP be one car or donate securely on line a gp dot org slash cars in fact [noise]\n\nSupport for NPR comes from the station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\n[noise] and from Harvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot any slash executive\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin listened carefully and you can almost hear Americans all over the country binge watching the latest releases from Amazon and Netflix\nTo tech giants are now turning their attention to India the country's market for online video there is expected to reach over two billion dollars in the next five years\nBut so far neither company has had a whole lot of luck so Cardiff Garcia and Sally her ships from our planet money team identify some possible steps to success\nI was watching this movie recently on Amazon it's a comedy guy gets engaged his best friend doesn't like the girl tries to break up the wedding\nThere is this whole complicated plot but that is all beside the point where it was really surprising was all the working which I told a shock to your own car about she's a journalist for the BBC I don't know if you have to working in the u._k. are you all at the same thing we\nDo a show on the covers Indian film and culture that's where you were watching in Indian film and there are all these stereotypes about these films like that they're really conservative\nSo I get it Sally you felt prayed to stereotype it's\nShameful but true and when I told us on the I was surprised by all the drinking and talking about sex and the movie she totally school me\nAnd then not being the way you just described it in many many many is\nWell don't feel bad Amazon and Netflix also need to get up to speed on Indian film because they're up against a serious competitor India already has a major online content provider called hot\nAnd hot star says it has about one hundred and fifty million monthly users according to counterpoint research\nHas eleven Netflix eat poultry five\nThe hot star says it has about one hundred and fifty million monthly users according to counterpoint research\nHas eleven Netflix\nEat poultry five which brings us to our strategies for streaming success in India\nNumber one understand the market because if you think India is all Bollywood think again\nIndia and not just thought it was\nBollywood movies are mostly in Hindi but according to India's last census a hundred and Twenty one languages are spoken in the country so plenty of Indian films are made in other languages\nYou know when you go to the gate and it can go to them I remember in two thousand and I I live in a vintage ad I went off the cinema that was showing Harry Potter but they were showing it would have no doubt that I thought they were asking and Donald\nStep to programming for culture most of the content Amazon and Netflix produced in the U.S please well all over the country\nYou can show Portland in New York and Seinfeld in Portland India is packed with different cultures and viewers want content relevant to them which is why Amazon and Netflix are using strategies three focusing on in ... in this case India's wealthy high earners\nPeople who can afford in other words an Amazon Prime subscription which is almost the same price as hot star just over one US dollar a month or Netflix around seven dollars a month\nAnd both Amazon and Netflix said they're having some luck both are offering content in multiple languages and Netflix has a hit secret and games like cop thriller but if either wants to crack the Indian market there is one more thing they'll likely need hot star has dissing Amazon and Netflix do not\nThe advantage of that so I have is cricket because Indian cricket\nIt's lemming news his neck [noise]\n[noise] from the University of west Georgia mind be point seven FM Wu WG paying to W. W. G. H. B. Gerald Ford of Georgia Public broadcasting radio network\nLive on the GED newsroom I'm Leah Fleming B I Seventy five sounds metro express lanes are shut down at this hour\nAfter someone entered the reversible toll lanes system going the wrong way W S P report the driver and Henry county was trying to head south bound when the lanes were flowing north for the morning commute and crashed the crashes blocking one left lane on both sides of by Seventy five and six Seventy five north bound to lay start\nJonesboro road and south bound traffic is quickly stacking up as well\nDrivers can take Georgia forty two or Tara boulevard to avoid I Seventy five altogether in a victory for civil rights groups and voting rights advocates Georgia election officials can no longer reject apps in the mail in ballots with signatures that don't match those on file gp Steven Tyler reports on this week's federal court order\nAbsentee ballots but the signature mismatch will now become provisional county officials now have to notify the voters would be a first class mail and email is available and voters consent and attorney to present their id if they could not come in person [noise]\nNormally a voter has until three days after the election to correct problems but in this case they have until five PM the Monday after that's the deadline for elections to be certified\nAs of Wednesday night fewer than two hundred absentee ballots had been rejected because their signatures did not match more than eight hundred thousand Georgians have already voted in the November six election for gp News I'm Stephen Fowler in Atlanta\nAnd secretary of state Brian Kemp who is also running for governor says he's appealing the federal judges injunction stopping Georgia from rejecting absentee ballots because of signatures deemed not to match those on file\nA camps lawyers made arguments and a new filing submitted late yesterday and he's asking the judge to hold off and enforcing the injunction while he appeals to one\nLine from NPR News in Washington I'm core of the ... the FBI is urging the public to pass along any information that may be connected to ten suspicious packages addressed this week to prominent Democrats most of these held pipe bombs one was delivered to CNN\nNPR's on the low Wong says the devices and packaging materials are being analyzed as investigators look for a suspect and a motive\nAuthorities say they can't be short\nYeah I was on the low ... says the devices and packaging materials are being analyzed as investigators look for a suspect and a motive\nAuthorities say they can't be sure whether or not there are more packages being sent through the postal system so they're telling the public that if you find a baggage that you suspect contains an explosive device to immediately call the police or the FBI and to get it investigated\nNPR's Hansi Lo long investigators have been focusing on the u._s. mail distribution facility near Miami homeland security secretary Kirstjen Nielsen tells Fox News that some of the packages originated in Florida\nMatthew Shepard the young gay man brutally murdered in Wyoming Twenty years ago this month is being honored today at the national cathedral in Washington DC NPR's Tom Gjelten says shepherds ashes will be placed in a cramped at the cathedral\nProsecutors said Matthew Shepard was murdered simply because he was gay his going was seen as a classic hate crime highlighting anti gay bigotry Episcopal Bishop Gene Robinson himself an openly gay priest will lead the internment\nRobin ... says the placement of shepherds ashes at the national cathedral significant for the ... community\nLet's be honest here churches and synagogues mosques have been the source of our greatest pain as ... to people and for Matthew to come back to church is a remarkable step forward\nShepherds parents say he attended church regularly as a young man Tom Gjelten NPR News Washington\nBut Georgia's secretary of state is asking a federal judge to block a court order to change the way some absentee ballots are counted Georgia Public Broadcasting's Steven Tyler has more\nAt issue or several hundred absentee ballots that were rejected for having signatures that don't match ones on file a federal judge has ruled that those ballots plus any new balance with a signature problem would now be provisional and voters would have until the Monday after the election to rectify problems\nBut lawyers for secretary of state Brian Kemp who is also running for governor say that making any changes this close to the election would bring uncertainty and confusion it's one of several new lawsuits against Georgia's election system for NPR News I'm Stephen Fowler in Atlanta\nPublished reports say President Trump made signed an executive order closing the southern us border to migrants Washington Post and New York times said that could include asylum seekers the White House says the Trump Administration is considering sense\nOrder to migrants the Washington Post and New York times said that could include asylum seekers the White House says the Trump Administration is considering several options to address what he claims is a crisis of mass illegal immigration created by Democrats\n[noise] this is NPR\nPolice and Jefferson town Kentucky have identified a suspect who they allege shot and killed a black man and a black woman at a supermarket about Fifteen miles from Louisville Gregory Bush is alleged to have told an armed bystander not to shoot him because whites don't kill whites\nPolice now say that just before the stores shooting Bush had tried to enter a predominantly black church that was nearby [noise]\nThe world series shifts to Los Angeles tonight in game three the Boston Red Sox hold the two to nothing series lead from member station WNPR Shira Springer reports that Boston has been playing strongly\nThe red Sox arrive in Los Angeles riding a five game road winning streak during the playoffs they have clinched series wins in New York and Houston outfielder Andrew been attendee says where the red Sox play doesn't affect them much\nConfidence in the girls were for\nThird place and so forth and so far this was postseason [noise]\nBe a little warmer out there so you know\nThe Dodgers will be looking to rebound from too tough losses in Chile Fenway though history favors the red Sox winning the world series teams that takes two to nothing lead in the series go on to win the championship nearly eighty percent of the time for NPR News I'm Shira Springer\nOfficials in Jordan said that at least twenty people have been killed and flash flooding near the dead sea many of the victims were children in a bus that was carrying about three dozen people there's a rescue operation underway the low lying Dead Sea is vulnerable to flash flooding following heavy rain\nOn core of a Coleman NPR News in Washington [noise]\nSupport for NPR comes from NPR stations other contributors include a log ... makers of go to a meeting a collaborative meeting platform with over Eighteen million mostly users designed to connect people from anywhere in the world on any device learn more and go to meeting dot com\n[noise]\nAt age six you are listening to MORNING EDITION on any point by the Atlanta we our land as NPR News station and we have Fleming it's a pleasure to have you along\nAt age six you are listening to MORNING EDITION on any point by GB Atlanta we our land is NPR News station I'm Leah Fleming it's a pleasure to have you along on a very cloudy\nAnd rainy friday morning we've got forty degree so far we're going to get up to about the upper fifty by later on this afternoon but the clouds in the rain that going to hang around for the rest of the day will be cloudy tonight with overnight lows around fifty degrees [noise] case in foreign talked with his mother about an important life event [noise]\nShouldn't be a be who you are I mean maybe a little bit it fresh but it's way happier which way\nYou just said we're going to hear from a twelve year old on his life as a transgender boy that's coming up on story corps and that's ahead in Fifteen minutes at MORNING EDITION continues also in this hour we're going to talk about Megan Kelly and her views on black face\nAnd Matthew Shepard will finally be laid to rest today Twenty years after he was murdered we're going to bring you more on that\nAs we get into the next hour of MORNING EDITION right here on a point five\nSupport for TB comes from you our listeners and fernbank museum presenting nature's superheroes a new interactive exhibits that explores how plants and animals adapt to extreme conditions was surprising superpowers information at fernbank museum dot org [noise]\n\nIt's MORNING EDITION from NPR News I'm Rachel Martin in Del Rio Texas and I'm Noel King in Washington DC good morning a massive search is underway for the person or people who mailed homemade pipe bombs to critics of President Trump\nAt least ten packages had been sent a prominent figures including President Obama his former attorney general and his former CIA director NPR's national justice correspondent Carrie Johnson has been following this story good morning Carrie good morning Noel so what is the focus of his investigation\nNow the investigation seems to be focused on two places one is the FBI lab based in Quantico, Virginia which is analyzing these devices in a while you know they look like homemade type bombs and experts at the FBI are looking for clues about\nHow the bombs were constructed a where um materials may have been purchased and they're also looking for DNA or fingerprints the bomber may have left behind\nRetired investigators tell me and this is very promising because so many of these devices are intact they didn't explode but if history is a guide and this process of analyzing their devices is going to take a while it won't be overnight\nIf these devices are intact they didn't explode but if history is a guide and this process of analyzing the devices is going to take a while it won't be overnight already so Quantico, Virginia is one place what's the second place and the second place is a north of Miami at a package sorting facility in Florida in ... Florida\nThe operating theory for now is that some or all of these ten packages went through that facility and through the u._s. mail investigators are looking for more devices but also any other clues there\nIt is now eight Nineteen and you are listening to MORNING EDITION on a point by ... Atlanta I'm Leah Fleming and we're going to go next to Del Rio Texas which sits across the border from Mexico and people there say the two sides get along together well ... ...\n...\nJust that we're going to explore how the issue of immigration is playing out in an area where residents seemed to have one foot in each country that is that in Fifteen minutes [noise]\nReport for TB comes from you our listeners and Callaway resort in gardens Georgia's authentic outdoor\nEscape Callaway offers twenty five hundred acres of hiking and bike trails lake fishing PGA level golf and more\nMore information at Callaway Gardens dot com and Doctors Without borders presenting forced from home and interactive exhibition about the global refugee crisis October twenty first to twenty eight that west plaza park next to the Georgia world Congress center learn more it forced from home dot com\nStarting today ... is going to be available in winter park which is located in downtown Atlanta now the park is used by many college students and business folks who I'm sure will appreciate that\nBut it's also used by the homeless than low income people to try to cut down on what some of that because for the poor have called digital red lining access to free Internet they say will help level the playing field to access to the online world\nThere'll be easier access to the Internet and advocates say that many indigent people will now have a new avenue to search for jobs in social services on line\n[noise]\n... lawyer betrayed and midnight in the garden is good and evil and he's also the caretaker of August ... bulldogs mascot\nSame food\nAnd he ... lawyer betrayed and midnight in the garden is good and evil and he's also the caretaker of August ... bulldogs mascot\nSame food you've got along the way she did give a\nWaiting period\nWe could actually see that sales couldn't turn it back to\nExcept the origins\nAnd part of being a guy on second thought this morning at nine from keep eating is\n\nSupport for NPR comes from the station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\n[noise] from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more it fidelity dot com slash wealth civility brokerage services L. O. C.\n[noise] and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks\nAnd Andrew rentals a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning earlier this week NBC's Today show anchor Megan Kelly caused outrage with some on air remarks about Halloween costumes\nIt was a controversy on the outskirts of New York with ... as she dresses Diana Ross and I felt like Diana she wants to look like they interrupt her one day I I don't know how like that got raises hollow why\nNow NPR's David Folkenflik is reporting that the network has dropped Kelly from the today show lineup and it she appears likely to leave the network because of the fallout from those comments the morning David ... okay so this is not the first time that Megan Kelly has made controversial comments about race here she's in twenty Thirteen when she was an anchor on Fox News\nFor all your kids watch at home than it just is white Jesus was a white man to tell us about her history of making racialized comments\nWill these aren't uh the only examples of their number I remember back in twenty or the CNN Jesus comments back from twenty Thirteen she later said she'd been joking and last year claimed that she she regretted those remarks but I remember back in twenty ten um she spent for amount of time on a tiny tiny\nIn she later said she'd been joking and last year claimed that she she regretted those remarks but\nI remember back in twenty ten um she spent a fair amount of time on a tiny tiny heat group black hate group called the new Black Panthers a one I Believe them ultimately a face criminal charges related to voter intimidation she spent over three and a half hours in a three week period focusing on it as though it was a threat to the Republican\nIndeed as one of her former colleagues were counted basically yelled at a white liberal a strategist for about ten minutes to she felt was failing to take it a sufficiently seriously or one more example of among several uh she keeps kept inviting the a ... LA up a homicide detective mark ... farm in on the air to talk about a ... a\nCriminal justice issues and to talk about the question of are African American relations with police officers he of course had to admit on the stand he had said racist things over the years during the OJ trial um many people saw that as a as discredited thing she welcomed among show\nDo you think that history played a role in NBC's decision to let her go\nRunning it's played a strong role in uh the reaction of NBC's The colleagues particularly but not exclusively NBC's I'm African American journalists are outraged to her remarks about ah what she thought was the acceptability a blackface NBC's\nNightly news with Lester Holt did a whole segment about this controversy on its OWN Network which seems to suggest something out and making Kelly's colleague an attitude toward her\nFor you and me it might be an admirable exercise and transparency and I think it was that I think it's worth pointing out also Lester Holt the only African American anchor ah of any made of the big three broadcast networks but it's also a sign that NBC was saying we're not going to protect us starting with we we might even though she's one of the most recognizable faces and TV news which is really interesting\nThe fact that she has been dropped I think it will surprise some people and I wonder does the way the network has handled these comments say something bigger about the way networks and companies are are Tyler I it tolerating racialized or racist comments\n[noise] well it's hard not to look at this in light of a you know the reaction at times very slow of major news organizations to the me too movement which was something that for a significant time making Kelly embraced she'd accused her former boss at Fox News of sexually harassing\nHer I also think you can't divorce it from the fact that making Kelly I received very tepid a welcome from her colleagues NBC News she had to displace him popular colleagues\nAnd that her ratings themselves were mediocre and that even before all this happened uh she's been discussing with a network another role there uh because uh she needed to get out of that show\nReading some cells were mediocre and the even before all this happened uh she's been discussing with a network another ... uh because uh she needed to get out of that show now the show's gone and she's a negotiating her eggs as well as\nNPR's David Folkenflik Thanks David you bet\nIt's friday and time again for during the day a mother talks with one of her kids about an important in life moments\nCase and for the youngest of seven children when he was twelve years old case and sat down at StoryCorps with his mother Jennifer ...\nTo talk about life in elementary school in Tuscaloosa, Alabama tell us a little bit about yourself\nI Am a martial artist I played the standup base [noise] I Am learning how to play the guitar and I am transgender\nWhat level are you in martial arts on a level to blue belt that means I'm halfway to black ... what is your favorite subject in school the pay her lunch what grade level where you in school when you decided to tell your friends and family that you're a transgender\nIt was around fifth grade when I told my friends and family out of his transgendered because up until then I did not know that the word existed\nIt was a missionary every day\nUh Haiti being called a girl I hated being called an daughter put most everybody in my family friends they were just okay because they kind of knew was coming yeah\nOver the summer I went to a camp and they did not know I was transgender they just called me he that was awesome [noise] I think the happiest moment in my life\nWould probably be January sixteen to two thousand Fifteen eight forty five PM you'd ...\nYou'd been telling me for quite a while there you wanted boxers viewer wearing all boy clothes getting boy hair cut and that was like the final change and you are just ecstatic that was awesome is there anything else you would like for people to know about you\nWell even though I'm ... I'm a kid too I have homework the daily life I of tests to deal with\nI have been extremely proud of you because you have been treated who you are and you're very courageous\nIt shouldn't be scary it'd be who you are I mean maybe a little bit at first but [noise] it's way happier this way as me\nDon't think he realized what a leader\nBe who you are I mean maybe a little bit it fresh but it's way happier as fast as me\nI don't think he realized what el leader you are people like that to you because you are not afraid to take a different path and\nWe know that it's your life and you're the one that's got to live at that we are there for you every single step of the way we're going to do whatever we can to to lighten your leg who'd been very proud to be your mom\nI'm tired of the nation [noise] [noise]\n[noise] [noise] that was casing forgive and Jennifer ... for StoryCorps\nTheir conversation was recorded in Birmingham, Alabama in twenty Fifteen\nThey're interview will be archived along with hundreds of thousands of others in the library of Congress\n\nMajor support for StoryCorps comes from super up featuring the all new three row with feeding for up to a choice of second row captain's chair love it's what makes a super super and learn more it Subaru dot com\nWe're probably talking what three hundred feet for free\nI mean that's hard to swim across\nSo a ninth someone can just from across just walk up here just like we didn't walk to that road\nI asked sheriff Martinez how the immigration debate is affecting people's politics here [laughter]\nAnd like other folks we spoke to in Del Rio he said it's not top of mind for residents this is a relatively quiet part of the border the people who do sneak in get out quickly and moved to bigger cities\nAnd even a Republican congressman will Hurd has spoken out against the wall he's facing a democratic challenger named Gina Ortiz Jones who's trying to tie her to President Trump\nBut this is a swing district and heard has positioned himself as a moderate and by doing so he's won the support people like Jeff Martinez\nIt come to an air of human in the same door\nLike willing to sell that are all busy uh\nOil it's come to an air of humid in this same tour\nLike willing to sell that are all busy uh he's been an advocate for us\nAnd this is interesting because sheriff Martinez like most elected officials here is a Democrat and even though we didn't vote for President Trump and has some issues with his policies and his rhetoric Martinez is pleased about one thing\nThis ministry Russian [noise]\nSure sure been invited to the table\nFor years and minister ... ...\nFor we were\nThere but it was was even the bones were even below me\nUp to the\nTo solve the immigration issue\nSo sure to be at the table\nReturn to a gym just go to\nBecause he knows the battle over immigration is going to go on for a very long time which brings us back to the original question what about that well\nActually my idea was to [noise]\nDo you control where technology cameras sort of put in physical structure where you're going to put a\nKey points to the houses along the river on the U.S side of the border\nOr you go to put these people and let you go are you going to put these people in the wrong side of the wall\nMeanwhile people like Amanda gear a block out the noise about the wall she will vote for the incumbent Republican Senator Ted Cruz and Republican congressman will Hurd and she will keep going back and forth across the border in her backyard as she did what I find\nCity the exchange fainted right here where the dollar exchange this is how can you we walked down the mainstream filled with bars\nIn stores selling all kinds of Mexican handicraft we thought that one storefront where a woman is sewing handmade dolls stressed and colorful ... says\nShe actually making them if not machine they're not coming from China these are authentic regulated they cannot\nGet a check and then with a smile their mission nudges are long black hair over her shoulder and waved goodbye and I can have a mandate gets in her white SUV and waste and the law in line to cross back over into the U.S [noise] she'll return in a few days though she has dresses that need tailoring\nFrom Del Rio Texas this is NPR News support for TB comes from you our listeners ended lent a symphony orchestra music director Robert ... he's piano concerto number one November fifteenth and seventeenth details of a a soda or G. classical series presented by Delta Airlines\nAnd Georgia State university gp Atlanta is license to Georgia State university ranked among the top universities in the nation and commitment to undergraduate teaching more information is available at G. S. U. dot edu\nAt eight forty three you are listening to MORNING EDITION on a point by G. P. B. Atlanta I'm Leah Fleming thanks for joining us today at night I continue to build its reputation as a technology hotspot\nNew York based black rock which is a global Asset Management firm and tech solutions provider they've announced that they have chosen Atlanta the company's new innovation hub\nBlack rock well established a presence in Fulton County they say and partner with local business in universities in addition to creating one thousand jobs within the next few years with the Atlanta expansion black rock says it helps to extend the technology capabilities close to universities like Georgia Tech\nWere black rock currently sponsors a scholarship for disadvantaged students that are pursuing degrees in stem field will bring you more business news on the marketplace morning report that is coming up in ten minutes right here on a point five [noise]\nHunters on for whoever sent pipe bombs to some of the president's critics CNN Russell's with reporting the news and being one of the bombers target also the midterm campaigns to the home stretch the red Sox round the bases and Sandra Day O'Connor steps away from public life\nForty news round up next on on one thing you can\nHear that on one aide morning attend right here on eight point five ... Atlanta\nSupport for TB comes from you our listeners and regions bank providing online tools tips and calculators designed to help businesses and consumers understand a wide range of financial topic and they can form\nSome areas and regions bank providing online tools tips and calculators designed to help businesses and consumers understand a wide range of financial topic and making for money decisions resources in regions dot com slash insights [noise]\n\nSupport for NPR comes from this station and from American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more AJ W. S. dot O. R. G. [noise]\nFrom the Charles Stuart mop foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org and from the John s and James L night foundation helping NPR advanced journalistic excellence and the digital age\nAt eight forty five you're listening to MORNING EDITION on GPA Atlanta I'm Leah Fleming it's been nearly three weeks since hurricane Michael's slammed into southwest Georgia to cater county was hit hard governor deal called at ground zero students in the county school system are finally returning to class as cheaply these Ross corral reports\nHurricane my goal hit the cater county on a Wednesday during the second week of October so it worked out great for the timing but for county school superintendent Tom Cochran she says they were two days away from going all fall break\nThe only thing is we were anticipating a potential category one you know as of Tuesday Morning of we were not anticipating we ended up being\nSchools like most other places ended up losing power for a few days as a result Cochran says a district last about a quarter of a million dollars worth of food\nFor six ... district seven schools opposing food was their biggest concern but for ... street elementary school there was damage that type of building or a hardship teaches kindergarten there she says her heart broke for her students when she first saw her classroom\nPlace today come to every morning come running in the door and there's glass shattered all over the four and\nThere's a train during the military\nThere and just feeling I\nWas dealing with more of an unfair but she says she also noticed twenty four computers for missing from her classroom\nI just thought maybe the technology department had come in to check to make sure they were all working\nSo she also noticed twenty four computers for missing from her classroom\nI just thought maybe the technology department had come in to check to make sure they were all working and then I was told no they're all gone and they got my keyboard on now for mountain here\nWe always have backup plans\nHudson says they will de faults are traditional ways of learning using more books and other hands on activities while that may be easy to repair storm damage or a place do with computers\nTeachers say students will be dealing with the storms impact from the near future ... Benson teaches fourth grade\nAnd let them come in Hungary and they come in dirty they may not have running water yet they may not have what they need so finding out what their needs are and meeting them aren't going to be our number one priority and given the chance to speak or talk about what they need to\nAfter superintendent Tom Cochran had announced on Facebook there will be reopening schools some parents voice their displeasure saying it was too soon many families feel lack power and water Cochran says it falls on the school is to help those kids and parents\nWe need to make sure we're open for those families because you know on a normal day we have the kids that don't hold a normal day we have kids that don't really have a good place to go here so we had at that and we have to worry about too\nIt's not just families what students who may need help Vincent says some teachers have lost their houses just got power turned back on and still have to breathe littering buried yards that she fought back tears venting says none of that will matter the minute they're kids step foot back into school\nSome educators that live out in the country that may not have what they need to get that kind of put things on the back and they're going to come and they are going to get everybody's counting the best that they can give them every day to help them find that scandal and that simply of normalcy\nIn on their first day back Benson says only two students were apps and oh Hudson says her entire class was president for P. B. News I'm Ross Perot in Atlanta is GDP Atlanta", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Carrollton", "day": "26"}