{"month": "10", "state": "GA", "station": "WUWG", "content": "Just as members supported TPP weren't Eighteenth station radio network you can listen online at ... dot org and you can find us on Twitter\nThis is members supported gp Pete were in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that\nMattered one CPB if you didn't get a chance to donate during the drive you were on line contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your general supportive G. P. B. and the service we provide every day [noise]\n\n[noise] from the University of west Georgia Ninety point seven FM Wu WG and W. W. A. G. H. D. Gerald Ford of Georgia Public\nBroadcasting radio network\n\nKavanaugh says he's doing the Supreme Court which new bitter now\nBut when President Trump took to the campaign trail he blasted Democrat\nGoing after his nominee It's MORNING EDITION from NPR\nAlso report to the major data breach Google why didn't the company how users his privacy was ragtime Noel King\nAnd I'm David Greene will spend time in Europe this hour looking at why China invested heavily in a port in Greece and whether workers that are being in\nJournalism becoming more dangerous in your latest debt Bulgarian journalists found rape\nAlso a child homelessness rises will need an eighth grader in Idaho reality Tuesday to overnight Britain's former prime minister David Cameron turn fifty three years old\n\nLive from NPR News in Washington I'm Dave ...\nFlorida's governor is calling hurricane Michael monstrous what forecasters warning it could become a major storm before making landfall along the Gulf Coast sometime tomorrow more than thirty Florida counties are under a state of emergency from Tampa Bay to the panhandle coastal evacuations are underway\nIn the Carolinas NPR's Tom Gjelten says residents are still working to recover from Hurricane Florence\nIn the Carolinas NPR's Tom Gjelten says residents are still working to recover from Hurricane Florence [noise]\n[noise]\n\n\n\n\nFederal investigators say they're still not sure why the driver of a limousine in upstate New York failed to stop all the stops on the stretch limo crashed into a parked SUV and school Harriet a high rate of speed killing all Eighteen people in the vehicle and to pedestrians\n... governor says the limo driver did not have the record commercial license the vehicle had failed a recent inspection lost my friends and family attended a vigil at a park in Amsterdam\nMy heart breaks they seem to all the lives that were never will be will save [noise]\nGives me hope so here we trained\nBut local school superintendent Vicki Ramos one of the speakers up a vigil was President Pence was in Texas yesterday campaigning for a couple of income but Republicans trying to keep their seats on Capitol Hill still a child is with member station ... reports from Dallas\nThe president's first stop was for us representative Pete Sessions he's facing a tough challenge from Democrat ... already\nIt's civil rights attorney and former NFL linebacker tense prayed sessions for his support of Trump Administration policies term Obamneycare rolodex to tax cuts the vice president also tended to trade agreement with Mexico and Canada and unemployment at a fifty are low and on Saturday we heard\n[noise]\nAnd said re electing Pete Sessions and Senator Ted Cruz is crucial to hanging onto a Republican majority in Congress for NPR News I'm Still a child is in Dallas\nThis is NPR News\nIt's crucial to hanging onto a Republican majority in Congress for NPR News I'm Stella Chavez Dallas this is NPR News from Washington\nLater this morning Brett Kavanaugh hears his first arguments as a justice on the U.S Supreme Court the high court is scheduled to hear two hours of arguments at the White House last night there was a ceremonial swearing in\nTurkey is calling on Saudi Arabia to approve of missing Saudi journalist left its consulate in is simple as the government claims as NPR's Peter Kenyon reports from all ... has been missing since he entered the Saudi consulate a week ago\nSpeaking during a visit to hungry president ... said prosecutors are looking into cars show these disappearance including the arrival of more than a dozen Saudis to assemble on the day the journalist disappeared\nHeroin said Saudi consulate officials can't get away with saying he left the building addressing the Saudis air to one added if he left the building then you need to prove it\nInvestigator suspect to show he was either spirited out of the country by the Saudis or killed inside the consulate Saudi Arabia denies the allegations President Trump says he's concerned about the show these disappearance Peter Kenyon NPR News Istanbul\nThe international Monetary Fund is downgrading its outlook for the global economy for twenty Eighteen it expects growth for the year to reach three point seven percent\nThat's down from three point nine percent it's earlier forecast the IMF expects the U.S economy to grow to point nine percent for the year that would be the strongest since two thousand five\nThe Federal Reserve has raised us interest rates three times this year as the economy continues expanding unemployment to the U.S is that a forty nine year low [noise]\nI'm Dave ... NPR News in Washington support\nFor NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum pitcher who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\n[noise] Georgia's outdated voting machines have made headlines this year but state officials say they're just one piece of the larger election Basel\nSomebody conceding or the news calling something has zero effect on anything we do we still have to account for every dollar the cast and even it doesn't end the morning after the election I'm Steven Fowler\nSomething has zero effect on anything we do we still have to account for every dollar discuss and even if does it in the morning after the election I'm Steven feller I'll take a closer look\nAt how Georgia's elections are run today on MORNING edition [noise]\nGood morning it's five or six I'm Leah Fleming and it's great to have you along this morning for MORNING EDITION on a point by G. P. B. Atlanta which has license to Georgia State university the largest University in Georgia and one of the largest in the nation\nIn the market for a new car save the hassle of selling your old one will pick it up for free you'll support the great programs on eighty eight point five and get a tax deduction good a G. P. B. dot org slash cars are called eight seven seven GP be one car and thanks\nSupport for G. P. V. programs comes from our listeners\nAnd the Atlanta upper representing west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and eleven at the Cobb energy center tickets at Atlanta Opera dot O. R. G.\nG. P. B. has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for specialized reporting best anchor and best newscast gp news stand with the fact\nThis is MORNING EDITION from NPR News I'm David Greene\nAnd I'm Noel King good morning at a ceremonial swearing in justice Brett Kavanaugh said that he will put the polarizing fight over his nomination behind him\nYou have a new justice was speaking publicly for the first time since the bruising nomination process and the Kavanaugh said she would not allow what took place to influences decisions on the bench\nThe Senate confirmation process was contentious and emotional\nProcess was over my focus now is to be the best justice I can be [noise]\nI take this office with gratitude\nNo bitterness\nPresident Trump on the other hand took a somewhat different tone he slammed the Democrats for trying to destroy his nominee NPR's White House correspondent Tamara Keith is with us now the morning Tam good morning so what is Trump telling Republican voters\nHe is telling them that Democrats are the enemy a and and that you know he is really playing a rather than celebrating the victory with the Kavanaugh nomination he's playing up the fight\nAnd and trying to continue to just do that\nIn the victory with the Kavanaugh nomination he's playing up the fight uh and and trying to continue to to stoke the anger that rose up I'm as a result of of how that process went\nThis is NPR News [noise]\nMost children eligible for government funded health insurance are not enrolled\nRural areas have trouble with a bunch of different diseases not just depression but diabetes obesity hypertension so we see this disparity throughout the medical\nWorld it's on second time this morning at nine from ...\nThis fall we're counting on the participation of everyone who listens to cover the rising costs of programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life please take a moment now to make an online contribution to the G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you for help cover the cost of the programs you love on cheap ...\nThank you so much for your support of Georgia Public broadcasting\nSupport for deep ... comes from generous listeners like you your support allows CPB to bring you end up stories from across the state our reporters take the time to look at what is happening why it is happening and how it will affect you we have bureaus in Atlanta Augusta\nMaking and savannah we take the time to look at the whole picture gp brings you stories that you won't hear anywhere else and you can listen online\nKick us out they TPP news dot org and stand with the fact\nOf the murder of liquid McDonald prove a turning point for policing in America former Chicago police officer Jason Van Dyke now awaits sentencing for the unlawful death of a black teenager but questions remain over a code of silence and over how we train those who protect and serve\nVan Dyke no wait sentencing for the unlawful death of a black teenager but questions remain over a code of silence and over how we train those who protect and serve upholding the law when enforcement turns deadly next on on one ... joined us from\nWanting this morning at ten here on ... point by keeping the Atlanta\n\nSupport for NPR comes from this station and from Heather started hey gun Paul Ga Ga supporting African wildlife foundation working to ensure wildlife and wild lands thrive in modern Africa learn more at eight O W F dot org [noise]\nFrom the ... foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about ark is at its partners at artists foundation dot org\n[noise] from the John D and Catherine T MacArthur Foundation recognizing exceptionally creative individuals this year's MacArthur fellows and more information or at max found dot org\nAnd from the Robert Wood Johnson Foundation and R. W. J. F. dot org\nIt's MORNING EDITION from NPR\nNews I'm Noel King and I'm David Greene China has poured billions into making basically a Silk Road of the sea running dozens of ports and container terminals around the world\nIt's a way to move Chinese exports to important markets including the European Union and in Europe it all began in the Greek port of Piraeus\nThe Chinese shipping giant Cosco has spent millions transforming it into the fastest growing port\nIn the world but as Joanna Kakissis reports from previous this has come at a price [noise]\n[noise] is that I conduct queen the proper way\nFor a boy or set out for ... the\nAnd more Hollywood dog for the Nineteen sixties film never\n\nPersonally no matter what I'm saying that there's no port she lived as much as ... ...\n... my knee\nNow may he got me on the show he\nRetired David or your ... and his wife Maria song by heart he worked at the port of Piraeus for thirty five years\nThree tired ... your ... and his wife Maria song by heart he worked at the port of Piraeus for thirty five years\nOr even if you're going to but that was going to teach minimizes your but that is this is my father didn't go up in ... when I saw something on who didn't have many machine cargo onto the shouldn't work on with our own hands for your bags of groceries rather go to ... where are all made in Greece old bound for North American astray\nHe says parade his took care of its stock or curse he made good\nMoney and now has a good pension [noise] can flip the string of worry Pete says he reminisced says in his living room underwater color painting of a ship\n... ... you have to ... many heroes using them you know look I shouldn't I be able to cross from the sewers if you ever get dumber go deep enough of big should be able to go to everything will be successful\nBut for years when the Greek state owned the port your credit red tape made it hard to attract investment then came the debt crisis which began in twenty ten ravaged the Greek economy he pushed Greece to privatize support for a U.S only the Chinese showed serious interest [noise]\nChinese shipping giant Costco took over the port in twenty sixteen now own the majority\nStake and the Port Authority Cosco runs cargo terminals cruise ship peers and the largest passenger ferry Wharf in Europe and the Chinese are not stopping they're\nMeant to expand the car terminals they want to expand or they want to create the logistics center they want to build a new on a cruise terminal\nClicked on by that us advisors to the Greek shipping ministry he's aware of the Chinese lease on the port will run out and about thirty five years\nIf at some point in the future they want to abandon paid as\nWell we will have all these investments they will not take them with with them\nOkay they will leave him here\nSo you see it as it entirely a win win win win those are the words of captain food channel chill costs goes CEO and parade as heard here in twenty Fifteen\n...\nAcross\nOne of the port union leaders I ... as another interpretation\nWhen the Chinese said when ... they they mean vaguely\nLife she says the benefits mainly to go\nBecky as another interpretation when the Chinese say when when they they mean they win by she says the benefits mainly go to\nFounder if they if they're if they found them know how their way of getting nicer to\nDoing business they expand do these things\nIn Europe you can actually hear the Chinese expansion half the cargo terminal which are busy twenty four hours a day\nStraddle carriers lip giant metal containers of goods onto shed workers in bright yellow safety best are everywhere and these are coveted jobs in a country where the unemployment rate is twenty percent but most of the Seventeen hundred workers at the port are Tamms without labor wise [noise]\nTwo years ago hundred protesters and police over hostile takeover and their working conditions\nThirty year old Steven ... recalled how he and his colleague\nLong hours and unsafe condition for\nWorkers were too scared to speak on it and they kept their heads down up and working treat shifts with outbreaks even to go to the bathroom\nSome of my co workers had to relieve themselves in plastic bottles and now he says at least they can take twenty minute break starting shit\nOnly about two hundred and fifty workers are in the Greek dock workers' union run by your was ... he cannot stomach the new reality for most workers at the port and blames Costco\nThey won't silent obedient to workers with no unions and this means no right what's the future we don't want to distribute to\nThe shows they can for more fathers bust should have been so difficult issue should want to proceed to go to get into a future workers\nCosts goes pray a CEO food chunk chill and his deputy declined NPR's interview request a Costco spokesman said at an email that after quote long and productive negotiations a labor agreement was signed that benefits both sides\nThe European Union's been largely silent on the labor concerns but those ... secretary of ports\nSays he has heard from a you officials were suddenly worried that China's running a European port\nMe do you ...\n... says he has heard from a you officials were suddenly worried that China's running a European port decision me\nTo ... when you think you know we're all aware that the Chinese state is behind a company like Costco disorders that you use that pushed to sell airport to Costco and the first place and if we were in debt with little bargaining power he says the e you underestimated China\n\nAnd now the Chinese flag is race for re it's too late regrets for NPR News I'm Joanna Kakissis in a way it\n\nIs for it was just the beginning China has snapped up about a tenth of Europe pork capacity in just the last decade or going to hear about that later this week\n\nIn school they start early and only half an hour and a half long bus ride to get them the homeless shelter and where he's staying in the middle of forty five freshman came to my hair\nThen I hurry rushed\nDownstairs to get out and catch my bus type thing at the shelter with his eleven year old brother and his grandma Pam can't travel that they moved here after getting an eviction notice\nThe landlord decided to sell the property and we just could not\nFind a place that we can afford\nMore depressed I God I just didn't know what to do\nA small disability type in the government but that's nowhere near enough to cover rent in Boise and Charles painful for the shelter but says it's hard on her grandsons my youngest\nHe can be a little care because she's upset by you know\nHe gets angry and then\n\nHe'll just say I have a place to place typical for came here but you wouldn't know\nSit corn\nFields to say I hate this place I hate this place\nTypical for cable too but you wouldn't know it\nCame as a social fourteen year old is a big smile one of his favorite things about school is seeing his friend my friend\n... you know about it and me being homeless and they don't teach me on it I'm\nTrying to work hard and it's just an effort to try not to break down it's harder for students who are anxious and worried to concentrate homeless kids tend to score and lower on standardized tests and have more graduation rate [noise]\nSometimes king does break down with his friends [noise]\nAgree\nIn\nHis ... feeling okay\nCame carries a tray of food to a table with the\nIs out of the picture of his mom has a drug problem before his grandma step then he had to help take care of his little brother\n... ready for school [noise] the catch ... one ... wash Pashto for days\nOn time and we only had cereal for what Julie\n... has been trying to convince his grandmother that she should let him get a job so he can help Brent thanks\nSo what do you know about but can't travel won't have it\nYet to be a child as long as possible and you don't want to be in a hurry to grow up\nA few weeks later there's good news and cadence world they've got a house it's about seven hundred square feet that they share with a roommate for ... it's a huge improvement I feel much more comfortable in a safe and probably most importantly he can say something he hasn't been able to for quite some time this is home\nFor NPR News I'm Amanda ... teacher in Boise\nThat story came to us from the the mountain west news bureau and later today on all things considered in a rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name\nCater is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name right\nThis is NPR News I'm Lisa Mullen's a legal battle rages over a question on the twenty twenty cents as the Trump Administration wants to ask about the citizenship status of people living in the U.\nS. opponents said that's unconstitutional and now justice Brett Kavanaugh could tip the balance and decide who wins that battle the latest from inside the divided Census Bureau next time on hearing\nNow joined us here and now today from noon until two one eighty point five she sees the Atlanta and TPP news dot org [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that matter to you on the beach if you didn't get a chance to donate during the drive your online contribution now will still make a difference\nHow we think a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your general supportive G. P. B. and the service we provide every day [noise]\nI'm not going to talk of already coming up on the next one point no ropes no Caribbean or something no cams nothing but his hands and feet [noise] we'll talk with rock climbing superstar Alex ... about his record breaking three thousand foot free so low crime of Yosemite is el Capitan that's coming up and then at some point from NPR\nNews for on point this morning at eleven here on eighty eight point five gee the lesson you can also listen live on line and ...\nSupport for G. P. B. programs comes from our listeners\nAnd eagle eye bookshop offering a chance to meet author Lee ... at the book launch party for the future is female Tuesday October night that seven PM more at eagle eye books dot com a great guy for good books\nCheckout GB music on our Web sites we feature videos at performances from touring artists and emerging musicians and you can see short documentaries about people who make Georgia music it's at gp news dot org\nThe next fresh air had terrorists governments political campaigns and even street gangs are using social media to push propaganda this information and fear with real world consequences we talk with the W. singer and Emerson broken authors of the new book black war the weaponization of social\nAnd and fear with real world consequences we talk with the W. singer and Emerson working authors of the new book black war the weaponization of social media\nShares train here on any point five maybe\n\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilience cities at rock found dot org\n[noise] from the doors do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King\nThirty years ago researchers from the New England aquarium started studying North Atlantic white whales off the coast of eastern Maine large parts of the whales showed up like clockwork in late summer\nNow those endangered whales come to that area only sporadically and more and more they're being seen far to the north Murray Carpenter went out on a research vessel to learn more\nIt's just after dawn and Amy ... surveying the waters of the bay of Fundy just off of eastern most main she's a scientist with the New England aquariums Anderson Cabot Center for ocean life she points out harbor porpoises chasing fish near the boat and then something much larger appears in the windswept water behind us [noise]\nA humpback whale will\nGet better turns out to be too hot backs one spouse near the boats [noise]\nIt's a cool citing but these are not the whales she's after\nSnowden is hoping to find the north Atlantic right wells that she and her colleagues have been studying here since Nineteen eighty they're largely lean whales with big heads and no dorsal fin researchers used to count as many as two hundred forging here in the summer\nThey became scarce starting in two thousand ten and their range shifted dramatically many more of the whales are now summary and hundreds of miles north in the Gulf of St Lawrence Mariano had bloom one of ... research assistants survey that area in August and said it was nothing\nLike the bay of Fundy days where we were\nMariano had blown one of ...\nResearch assistants survey that area in August and said it was nothing like the bay of Fundy\nHad days where we were talking about the individual working them from the ... [noise]\nRight well they're not sitting right\nThing to see what in\nTotal fewer than four hundred and fifty North Atlantic right wells remain in their numbers have been falling for a decade as more urban entangled in fishing gear or killed by ships\nReproduction is also declined researchers found no new cabs last winter\nWith the population on edge scientists want to understand the reasons for the new migration pattern\nNick record is with the big load laboratory for ocean sciences in east ... Maine\nMy hypothesis is that this change in the migration patterns of Wales is connected to their food resource mainly ... count as like the battery of the Gulf of Maine\nColumnist is a type of fat rich plankton that's favored by many species record says a changing climate is not only rapidly warming the region's waters it's also shifting the currents that one swept is important plankton into the deep basins were right whales feed making it less available to them\nMore brown another scientist with the New England aquarium team to she actually find soap and the habitat shipped all the way from the waters near Maine to the Gulf of St Lawrence\nIt's not like it's right next door will have to swim all the way around Nova Scotia so what a tremendous response you know this is a highly endangered whales there's not many of them left and yet they're demonstrating that they can respond to major changes in their habitat and that's actually quite encouraging\nBut she says it's definitely slim pickings in the waters near Maine\nIt's not that this area's abandoned the keys are count for this year is less than a dozen layoffs\nBack at the dock the crew in their thirty mile survey the last of the season with no right well sightings but ... says it's worth sticking with the research\nAnd this is MORNING EDITION from NPR News I'm David Greene and I'm Noel King [noise]\n\nFrom the University of west Georgia Ninety point seven FM Wu WG pained Wu WG HP Carol that part of Georgia Public broadcasting\nWith Georgia nine point seven FM Wu WG and W.\nW. H. B. Gerald Ford of Georgia Public broadcasting radio network\n[noise]\nLive from the TPP newsroom I'm Leah slamming the two candidates competing to become Georgia's next governor will both received campaign help from out of state today is ... Taylor can't reports\nDemocrats Stacey Abrams will hosted event at Cleveland State university featuring US Senator Elizabeth Warren and Massachusetts congressional candidate I oughta Presley who upset a ten term incumbent and the Democratic primary last month\nRunning unopposed Presley is set to become the first black congresswoman from her state a room so to break a similar barrier of the first black woman to serve as governor in the U.S as a Republican Brian Kemp he'll be in Athens with Donald Trump junior for a fundraiser at the classic center\nPresident Trump endorsed camp during the Republican primary to help him to the lieutenant governor Casey Cagle in a runoff\nFor the News I'm Taylor ...\nAtlanta mayor Kesha Lance bottoms is planning to march with employees in Atlanta as pride parade taking place on Sunday\nLast night she hosted a reception at city hall to kickoff pride weak in the city bottom says the city has received the highest municipal equality index score and its history\nThe human rights campaign reports rates over five hundred municipalities around the country on their inclusive of gay lesbian bisexual and transgender a transgender residents and employees\nSince taking office bottom says created Atlanta's first ever office of equity diversion and inclusion also known\nAs the one Atlanta off as a consumer watchdog group is urging consumers to change their passwords on experience one of the three credit agencies that whole data on millions of America as Americans as follows a report of an on line flaw with customer log in this is the Atlanta\nLive from NPR News in Washington encore of a Coleman the newest justice of the U.S Supreme Court will be on the bench this morning when the court hears oral arguments and Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in for Brett Kavanaugh at the White House\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind it and he promised to serve in a non partisan fashion\nWas not appointed to serve one party or one interest [noise]\nMost no confirmation battle behind it and he promised to serve in a non partisan fashion\nI was not appointed to serve one party or one interests but to serve one nation\nWell Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a campaign against Kavanaugh he called dishonest and deceptive the president thinks seat in the new justice will give a political booster Republicans in the mid term elections Scott Horsley NPR News Washington\nThe national Hurricane Center says that hurricane Michael is moving north in the Gulf of Mexico and aiming for the Florida coast forecaster John ... says Michael's top sustained wins or Ninety miles per hour\nIt's gonna be likely to make landfall in the Florida Panhandle of Florida Big Bend area during the day Wednesday that is our current thinking um and it's likely to make landfall as a major hurricane so that's category three or stronger or on the scale\nHurricane Michael is projected to then blow north across Florida and into Georgia and the Carolinas tropical storm watches are posted from the Florida Gulf Coast north to South Carolina\nThe international Monetary Fund is cutting its forecast for global growth NPR's Giles Snyder reports the IMF blames rising interest rates and trade tensions\nThe IMF has revised its forecasts from July when it said the global economy would grow three point nine percent this year it's now cut that down a couple of nachos downgrading expectations for this year and for twenty Nineteen the IMF now says the global economy will grow at a three point seven percent clip\nThe IMF loved us economic growth on change for the rest of this year but cut the U. S. is twenty Nineteen forecast a two and a half percent because of the trade tensions with China the revisions to the global forecasts was issued on the resort island of Bali as the annual meeting so the IMF and World Bank get underway this week\nTrials later NPR News Washington\nThe south Korean government says North Korean leader Kim Jong un wants Pope Francis to visit North Korea\nThe south Korean presidential office released a statement saying Kim told diplomat said the pope would be enthusiastically welcomed in North Korea the president of South Korea is expected to deliver that formal invitation to the contests during his scheduled visit in Rome next week\nNorth Korea strictly controls religious expression in that country Kim has seemed to welcome diplomatic engagement this year meeting with South Korean officials and President Trump this is NPR\nKim has seemed to welcome diplomatic engagement this year meeting with South Korean officials and President Trump this is NPR\nOnline company Google is shutting down its social network Google Plus the company said he discovered a flaw last march that could have exposed personal data of up to half a million users\nThe company did not disclose this law until Monday the wall Street Journal also published a story on the flaw in Google and didn't want regulatory scrutiny or damage to its reputation\nInterior secretary Ryan Zinke is taking action against new mining in the Montana part of Yellowstone National park Yellowstone Public Radio's Kayla to Roche has more\nI think he returned to his home state of Montana to sign papers that put a hold on mining of thirty thousand acres of federal land there\nThere's places that mind there's places\nAnd you have to look at the merger conservation ...\nGreatest good for\nThe land off limits to development is known for its natural resources and tourism the document extend protections put in place during the Obama administration and twenty six team that otherwise would have expired next month\nThe withdrawal of those lands last Twenty years which is the maximum length of time and interior secretary Ken Grant\nFor NPR News I'm Kayla debt Roche in billings\nDisaster officials in Indonesia now say more than two thousand people have died from last month's earthquake and tsunami on the island ... most of the deaths are in the provincial capital Paolo a coastal city that filled the full effect of the disasters\nSome Seventy thousand people have since been displaced food and clean water remain limited [laughter] this is NPR\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email translates a drag and drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\nThis fall we're counting on the participation of everyone who listens to cover the rising costs\nPrograms we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life please take a moment now to make an on line contribution ... dot org and click donate at the top of the page your contribution at whatever level is right for you cover the cost of the programs you lost\nGood at ... dot org and click donate at the top of the page your contribution at whatever level is right for you cover the cost of the programs you laws on cheap ... thank you so much for your support of Georgia Public broadcasting [noise]\nSix you are listening to MORNING EDITION on ... Atlanta we our land is NPR News station I'm Leah Fleming good morning welcome to Tuesday\nWe get Seventy three degrees right now the forecast is calling for a mostly cloudy day today and there is a chance for showers has will get up to about eighty one degree by later on this afternoon\nComing up we're going to explore the challenges of talking to a judge the video and not in person Charles Davis and said that if he had been able to talk to a judge in person instead of through a video camera from inside the jail\nHe might not have been convicted of a crime he denies committing we're going to take a closer look at that just to add on MORNING edition right here on a point five CPB had\n\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California Republican and democratic leaders have one thing in common right now both are hoping\nThat the bitter battle over Supreme Court justice Brett Kavanaugh will motivate their base and Dr voters to the polls\nFor the midterm elections Republican Senate majority leader Mitch McConnell described it as a quote shot of adrenalin that the geo Pete got from the confirmation battle was polls do show that the Republican Party is closing in on Democrats enthusiasm advantage this is McConnell over the weekend on CBS face the nation\nI Want to buy the or\nThe other side for the tactics that have allowed us to kind of energize and get involved I own a voters\nBoth talk about what the Democratic Party might be able to do to try and regain steam I'm joined by rubbing monkey was the campaign manager for Hillary Clinton's campaign in twenty sixteen welcome back to the program\nThanks so much\nSo McConnell seems appreciative for how Democrats handled the confirmation battle over over Kevin all I mean do you worry that the Democrats have given away the edge that they had heading into November\n[noise] I don't think that the I just been given away at all I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a bomb to try to close\nOh I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a bomb to try to close that gap but there's still a significant advantage for Democrats\nAt six Nineteen you are listening to MORNING EDITION on eight point five ... Atlanta I'm Leah Fleming in Alaska Oil and mining companies are finding a ballot initiative aimed at protecting salmon fisheries [noise]\nChanging the way we regulate fish habitat at a time when we don't have a clear problem\nJust seems crazy ballot supporters argue that the current laws but salmon at risk we're going to bring you more on that coming up in Fifteen minutes at MORNING EDITION continues right here on a point five\nIn sports the Atlanta Braves the then came to an end last night after a six to lost to the LA Dodgers and the national league division series despite the loss the Braves enjoyed one of their best seasons in recent history winning the division and qualifying for the playoffs for the first time since two thousand Thirteen\nManager Brian Vickers says that he's optimistic about the future of this team\nPlayers a lot of great experience during the regular season with\nThe LA Dodgers will go on to face the Milwaukee Brewers in the next round of the playoffs on friday\nReport for ... comes from you our listeners and the Georgia brain and spinal injury trust fund commission advising that a traumatic brain injury is one cause by an external\nPhysical force such as a car accident fault or sports the commission can help details of B. S. I. T. S. dot Georgia dot Gov\nMost Georgia children eligible for government funded health insurance are not enrolled\nRural areas have trouble with a bunch of different diseases not just the Russian book diabetes obesity prevention so we see this disparity throughout the medical\nWorld it's on second time this morning at night\nThere's depression but diabetes and obesity hypertension so we see this disparity throughout the medical world it's on second time this morning at nine from ...\n\nSupport for NPR comes from the station and from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more and H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom Harvard Business school executive education for executives said any career stage to prepare for new challenges through one of its comprehensive leadership programs learned more at H. B. S. dot any slash executive\nAnd from at last seeing a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work\nBetter together more at at ... dot com\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King until recently the head of Interpol the international\nPolice organization based in France was a man named among Hong way he's from China but in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol I talk to NPR's Shanghai correspondent Rob Schmitz and asked him what do we know about my whole long\nHallway is sixty four years old he served as the vice minister of public security bureau issues China's national police are in twenty sixteen\nHe became the first Chinese head of Interpol and there's an election was a big victory for China's government which under leader Xi Jinping was eager to use Interpol to locate in extra day Chinese officials at it deemed corrupt to it escaped China\nBut as it turns out among himself is now under investigation by Chinese authorities for corruption\nWhat exactly are they investigating him for\nWhat kind of government hasn't released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how to detention unfolded has come from his wife ... September twenty fifth\nThe day her husband arrive to try to for a visit she allegedly received a text from him that said wait for my call which was followed by in a mood even nights suggesting that he was in danger\nA week later she reported in missing\nFrom him that said wait for my call which was followed by in a mood even nights suggesting that he was in danger a week later she reported in missing the French police on Sunday she spoke to reporters and they own France we're in trouble is headquartered in here's what she said\nTo the half of what might be able to invade us on the on the\nWide and children's husband and father so that they may no longer disappear\nAnd as you can hear in that tape now while she's crying during this part of the video with their back turned to the camera because she's received threats and his under protection by French police well\nWhen she talks about the husbands and fathers who disappeared in China what does she mean\nWell she's talking about the government anti corruption campaign was launched by heating paying immediately after he took office in twenty Thirteen and it snowed hundreds of thousands of officials both on the local level as well as among the highest echelons of the party\nIn fact the man who appointed Malone way to vice minister of public security was Julian Kong the highest ranking Chinese official who was brought down by this campaign Joe was a former member of the pull up your standing committee the group of seven men who rule China he was China's security czar before he was sent to prison for life and twenty Fifteen\nBy removing them from the presidency of Interpol can lose is a lot of sway within that organization that much is clear why does this mean for ...\nWell even before this happened China's use of in our poll and amongst presidency was starting to raise some red flags earlier this year China attempted to issue a red notice that it's an international alert for wanted person\nFor an exile weaker activists years are mostly Muslim ethnic minority who live in northwestern China who China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with ... is a good example of how China's messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob thanks do\n\nAcross the United states more criminal courts are turning to video proceedings this isn't an effort to save time and money as it happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology\nSave time and money as it happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology from Illinois newsroom in Urbana league games report\nToday like most days thousands of defendants will show up in criminal court for their first appearance in front of a judge it's likely that more than half of those appearances will not be in a courtroom in person the defendant will instead face a video camera from inside a jail\nSheriff Jeff standard likes that system he's in Lewis ten in rural west central Illinois he demonstrates what his deputies used to have to do\nThat it would have ... so their stuff we're going to be half of war taking and their selves we're going to be trained together you're walking down the line for like a three legged race\nStandard says the video system they now use freeze up more his officers for patrol and he argues that the convenience of the system is better for everyone\nSo we can become friends of mine from the video camera the judge has access to the video camera\nConversation just like we are now but it's just over video screen\nBut Charles Davis and says it's just not the same Davidson is sixty years old and a recovering heroin user who was in and out of jails and prisons in Illinois for over two decades he finds the video process both off putting and demeaning\nWhen I first went to the radio cordon bleu I'm a because [laughter] watching everybody get up and go in front of us are a nose or you know you couldn't Sunni to\nDavidson says when you're in the same room at the judge it's easier to have a conversation with them and he's noticed there's a greater chance to listen to what you have to say he says the first time he appeared in video court he didn't think he got a fair shake\nOh shortage plenty to the Jewish what happens\nThey told me to record\nSoon after Davidson was sentenced to Eighteen months in prison\nLawyer Rosalie joy says she hears stories like David since all the time she's with the national legal aid and defender association and says the increasing use of video court has some defense attorneys concerned that alienates the accused from those deciding their fate\nBefore the proceedings began you already feel like you're treated as though you're guilty you are feeling excluded from the process you are treated as the least important part of the process\nThey are treated as though you're guilty you are feeling excluded from the process you are treated as the least important part of the process because there is nothing that can replace human interaction\nAnd as a defense attorney I Am never going to be as effective in the courtroom for my client unless my clients stand shoulder to shoulder to me\nWell there's little research on video court what's out there shows it may increase bail amounts and in many cases makes private communication between attorneys and clients more public\nOn the prosecution side many defend video court for its cost savings and efficiency while acknowledging that some of those advocating for the accused say it's a trade off that's unfair to defendants\nFor NPR News I'm Lee gains in Urbana, Illinois [noise]\n\nUsing his vote across whiskers creek Mike what points out a massive shadows undulating just beneath occurrence [laughter] the last time this year stamina for writing here\nOn some on peace\nComes in there too\nIn a small scale commercials fame and fishermen and the consummate Alaska today he's supporting a candle jacket and a gun on his back in case we run into a moose ... vote to have a look [noise]\nAlso helping leaves to stand for salmon campaign for a ballot measure aimed at protecting the state's most iconic fish walking along the creek would says he thinks it's a long overdue\nChange fish scale is been chipped too far in favor of of development and industry and and we're just trying to\nPull it back towards the center Alaska has some of the most valuable salmon fisheries left in the world but wouldn't other ballot supporters say the state's laws protecting salmon are weak putting them at risk especially with a number of large new mines and oil developments in the works\nIf it passes Alaska would enact a much tougher permitting process for big projects in salmon habitat among other things it was\nAn oil developments in the works if it passes Alaska would enact a much tougher permitting process for big projects in salmon habitat among other things it would set strict standards for restoring salmon streams if they're disturbed\nAnd if companies don't follow the rules they could face criminal penalties knowledge is that in a state like Alaska it's a big ask\nWhen you start doing something like this\nIs really kind of [noise]\nI mean your nose at the big guys you know\nFor decades Alaska's economy has depended on industry dollars and oil and mining companies hate this initiative made it together under the name stand for Alaska they're backing a campaign to stop it running a blitz of ads like this while you're\nGoing to protect their habitat\nIn Princeton New regulations slow or stop Alaska project\nCompanies have poured millions into the campaign against the ballot measure\nWith help from donors like BP and Exxon Mobil they've raised more money than all free of Alaska's gubernatorial candidates combined Karen Matthias is with the council of Alaska producers the group that represents mining companies and she argues the state's salmon fisheries have so far ... existed with minds that oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem it just\nSeems crazy but ... thinks the initiative prioritizes standing at the expense of the state's biggest economic engines and taxpayers\nWe couldn't have the Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans salmon are more than just living or the occasional meal here they represent something deeper their vital food source in a traditional way of life in one of the ... states were wild river's still teen with them every summer\nSo when voters head to the polls this November there'll be weighing that against appears that measured protects him and couldn't read all the states' economic foundation\nFor NPR News I'm Elizabeth herbal in Anchorage [noise]\nThat report came to us from Alaska's energy desk it's a public media collaboration focused on energy and the environment\nThis is NPR News [noise]\nAt the forty three you are listening to MORNING EDITION on eight eight point five GB Atlanta I'm Leah Fleming\nGas prices in Georgia rose six cents last week heck according to motor club AAA the average price per gallon with two Seventy eight the most expensive gas prices are in Atlanta ... man of the least expensive gas in the state can be found\nIn Augusta Columbus and Warner robins AAA spokesman mark Jenkins says concern over global supply and demand continues to weigh on oil prices if they're they'll pack output remains low and us sanctions are expected to limit exports of Iranian crude oil while global demand continues to rise [laughter]\nWe'll bring you more business news on the marketplace morning report that's coming up in ten minutes right here on a point by which is license to Georgia State university nationally recognized as a leader and innovative programs that help students are in their degrees [noise]\nFor TB comes from you our listeners [noise]\nAnd the Atlanta Opera presenting west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and eleven at the ... energy center tickets at Atlanta Opera dot O. R. G.\nAnd the high museum of art friday jazz returns on October nineteenth between the loudest Rashid Ali Ali blends African in Latin rhyme with jazz infusion into her signature sound tickets and details at ... dot org\nThe murder of ... McDonald prove a turning point for policing in America for Chicago police officer Jason Van Dyke no wait sentencing for the unlawful death of a black teenager what questions remain over a code of silence and over how we trained those who protect and serve upholding the law when enforcement tours deadly next on on\nOne day you can hear that on one day\nRight here on ... Atlanta\nIf you recently supported G. P. B. during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered you on the beach if you didn't get a chance to donate during the drive you were on line contribution now will still make a difference [noise]\nWe take a couple of minutes\nMatt are you on the beach if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide everyday\nSupport for NPR comes from this station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from PBS with the circus American Experience explores the rise and fall of the big top and its influence on entertainment and the U.S the circus that tonight event continues tonight at nine eastern on PBS\nIt six forty five you are listening to MORNING EDITION on GPA Atlanta I may have Fleming election is security it's a hot topic ahead of this November's midterm elections especially in Georgia in September a federal judge denied the request to move the mid term elections to paper ballots she also said that problems with the current touch screen system\nNeeds to be addressed in the near future but that's just one part of the larger election puzzle\nTBB Steven Tyler takes us behind the scenes that count the state's elections are made\nChris Harvey is George's elections director his team with the secretary of state's office gets to work building the layout of the ballots as soon as candidates are set\nOur resolve this creates twenty five hundred different versions of a ballot with everything from the governor's race to weather Sandy Springs residents can buy alcohol earlier on Sundays\nYou take each county and then you take the different ballot combinations and you take the qualified candidates and you just start plugging them into this laws if you if you think about it that way until you've got every\nRace and every question every candidate a coward for accounting\nSpin those ballad files are hand delivered to each county where local officials double check to make sure everything is accurate once that's done the officials load the ballots from a secure server on to memory cards tied to specific precincts the cards are also matched up to a specific serial number on a specific machine\nEven the seals used to secure those machines have their serial numbers tracked [noise]\nThat's the sound of a machine being unsealed so it can undergo logic inaccuracy testing it's one of four that belong to the black rock voting precinct\nThat's the sound of a machine being unsealed so it can undergo logic inaccuracy testing it's one of four that belong to the black rock voting precinct in Fayetteville twenty miles south of Atlanta Fayette County elections director Floyd\nJones of what we're doing is we're taking the machine where literally ensuring that it actually works and then we're up loaning the new ballots into the machine so they can be prepared to roll out on election\nProcess takes just a few minutes for a machine\nEverything from the ... of the print or to the click of the card reader undergo scrutiny and a sample tally is run [noise]\nJones says all three hundred machines as county uses will be tested over the course of several days\nWhen that's done we Salem we've sold them back on the racks and we have a fair for election [noise]\nSo what happens on election day\nThe machines are delivered the seals are broken and poll workers are ready for business at seven AM\nAfter you check in at the polling place you're handed a yellow voter access card that goes inside the machine but how does it know which ballad goes on the screen a tiny\nComputer chip what's your name and balance dial loaded on fits the same type a chip that you have on your credit cards that's Richard Baron who oversees Fulton County is elections all the ballots are available on the DARE but that one will only activate\nThe ballot that is correlates to your residence your vote is captured on the machines memory card and the yellow card is return to the poll worker\nWants the last person in line has voted poll managers consolidate the vote tallies onto a single memory card shut down in seal the voting machines do some paperwork and then drive results to a central location from their vote totals are uploaded to the state's election night reporting system where tallies are posted on line\nFrom a PM American public media\nFrom the University of west Georgia was Ninety point seven FM W. W. N. G. and W. W. A. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\nIn the W. W. H. B. Gerald Ford of Georgia Public broadcasting radio network\nLive from the G. P. D. newsroom I'm Leah Fleming the two candidates competing to become Georgia's next governor will both received campaign help from out of state today at ... Taylor damn reports\nDemocrats Stacey Abrams will host an event at Cleveland State university featuring US Senator Elizabeth Warren in Massachusetts congressional candidate I oughta Presley who upset a ten term incumbent and the Democratic primary last month\nRunning unopposed Presley is set to become the first black congresswoman from her state's Abrams hopes to break a similar barrier of the first black woman to serve as governor and the U.S has a Republican Brian Kemp he'll be in Athens with Donald Trump junior for a fundraiser at the classic center\nPresident Trump endorsed camp during the Republican primary to help him to the lieutenant governor Casey Cagle in a runoff for the news on the other day or\nAtlanta mayor Keisha Lance bottoms is planning to march with employees in Atlanta as pride parade taking place next Sunday\nLast night she hosted a reception at city hall to kickoff pride weak in the city bottom says that the city has received the highest municipal equality index score in its history the human rights campaign score rates over five hundred municipalities around the country\nOn their inclusive inclusive activity of el ... residents and employees since taking office bottoms has created Atlanta's first ever office of equity diversity and inclusion which is also known as the one Atlanta office\nHurricane Michael could disrupt lights at the world's busiest airport Southwest Airlines says flights in and out of Hartsfield Jackson Atlanta international could be delayed diverted or canceled through friday disruptions are possible from today through Thursday on flights to New Orleans Panama City in Pensacola it's seven oh one\nLine from NPR News in Washington on core of a cold and President Trump has apologized to Supreme Court justice Brett Kavanaugh for the quote suffering he experienced during his confirmation process\nNPR's Emily Sullivan says the apology came at a swear rather ceremonial swearing in on Monday at the White House cabinet was confirmed by the Senate on Saturday receiving fifty votes after an emotional confirmation process centered on allegations of sexual assault\nHe has denied all accusations\nPresident Trump started Monday ceremony with an apology\nOn behalf of our nation I Want to apologize to read and the entire family\nAnd Trump started Monday ceremony with an apology\nOn behalf of our nation I Want to apologize to bread and the entire family for the terrible pain and suffering you have been forced to endure before\nMaking his comments the president acknowledged they were out of the norm and his speech at the ceremony Kevin I said the confirmation process tested him but it did not change his approach to judging Emily Sullivan NPR News Washington\nThe national Hurricane Center says hurricane Michael is a little more than four hundred miles south of the Florida Panhandle\nTop sustained Windsor Ninety miles per hour the forecasters warned the storm will get much stronger before it crashes into the Gulf Coast Becca Amy manages the sense that I only got an RV club in Florida as Big Bend region\nIf she can go you probably should go and if you can't you just like the best preparations you can sit down and hang in there knowing that that that emergency management won't be able to help the at some point although\nHurricane Michael will lose strength when it hits Florida it's predicted to barrel across Georgia the Carolinas as a tropical storm before crossing into the Atlantic ocean\nThe state of Delaware plans to take public comments this week on the Trump administration's replacement for the Obama era clean Power Plan NPR's Jeff Brady reports Delaware officials are frustrated the EPA is not holding public hearings on the east coast\nThe clean Power Plan to reduce carbon dioxide from power plants to address climate change it was a blow to the ailing coal industry President Trump CPA is replacing it with a new rule that give states more authority to regulate emissions\nBPA he'll just one public hearing earlier this month and Chicago Delaware natural resources and environmental control secretary Shaun ... says residents of his coastal state deserved to make their voices heard too\nWe are and I said are feeling the impact now will continue to feel shouted act in the future we do not take steps to mitigate climate change\nDelaware plans to transcribe comments from its public beating and forward them to the EPA for the official record Jeff Brady NPR News\nOnline company Google is shutting down its social network for consumers Google Plus this comes after the company discovered a flaw that could have exposed some personal information of half a million people the wall Street Journal published a report that said Google discovered this law in March this is NPR\nTennessee's Supreme Court has upheld the state's three drug method\nReport that said Google discovered this law in March this is NPR\nTennessee's Supreme Court has upheld the state's three drug method for putting prisoners to death Blake Farmer of member station WNPR land reports from Nashville that in order issued late Monday clears the path for many upcoming executions\nNearly thirty death row inmates were arguing today one drug political using only ... would be easier to carry out in less painful for prisoners several states currently use this one drug method but a majority of tendency Supreme Court said the inmates did not prove ... could be obtained it's been in short supply\nA dissenting justices executions into the sphere cloaked in secrecy making it nearly impossible for inmates to know the availability of lethal injection drugs and she argued that the pending executions should have been put on hold so the high court wasn't forced to rush a ruling for NPR News I'm Blake Farmer in Nashville\nThe investigative ... cat has published what it says is the identity of the second suspect involved in the poisoning of a Russian ex spy and his daughter this year the report alleges Alexander Michigan traveled to Britain earlier this year and that he is a Russian military doctor\nHe and another Russian man alleged to be a senior military officers are accused of using a rare nerve agent to poison former Russian double agent Sergei Skripal and his daughter Yulia\nDisaster officials in Indonesia have increased the death toll from the earthquake and tsunami nearly two weeks ago to more than two thousand people some Seventy thousand people remain displaced the disasters struck the island of silhouettes they and relief efforts remain on even on coral Coleman NPR News\nSupport for NPR comes from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive e verify dot Gov slash go and the ... foundation at ... dot org\n\nAt seven six you are listening to MORNING EDITION on an eight point five ... Atlanta where Atlanta is NPR News station I'm Leah Fleming and it's great to have you along on this Tuesday Morning we got Seventy three degrees right now under cloudy skies coming\nUp a Chinese shipping giant took over Greece's port of Piraeus in two thousand sixteen creating a new reality for the dock workers there\nWill be weeks I learned to obedience to workers with knowing\nPort of Piraeus in two thousand sixteen creating a new reality for the dock workers there\nWill be ... to obedience to workers with no unions in these means no right what's the future we didn't want this to just\nAhead we're going to tell you more about China the impact on an iconic Greek port that is coming up in Fifteen minutes right here on MORNING edition support\nFor ... comes from you our listeners and Harry Norman realtors working to help clients create priceless memories through their homeownership experience founded in Nineteen thirty with a time tested commitment to luxury and an emphasis on customer service more at herring Norman dot com\nAnd we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home well star dot org slash male will start Mayo Clinic working together working for you [noise]\nIs calling for a mostly cloudy day to day there was a good chance for a few showers type will get up to about eighty one degree by later on this afternoon [noise]\n\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC good morning President Trump's celebrated the newest Supreme Court justice last night with every sitting member of the Supreme Court President Trump presided over a swearing in ceremony for Brett Kavanaugh at the White House\nAfter a bitter and divisive nomination Kavanaugh promised that the process had tested but not changed him and that he would always conduct himself fairly from the bench\nI take this office with gratitude no bitterness every American can be assured that will be an independent and impartial justice devoted to equal justice under law\nBut not every Republican is celebrating the appointment of justice cabin on in fact our next guest says he is leaving the G O P because of it Tom Nichols is a professor of national security the U.S Naval War college and he wrote about his decision in the Atlantic thanks for joining us professor Nichols\nThanks for having me you have belonged to the Republican Party for most of your life why did this confirmation process prompt you to leave\nThe confirmation process itself a that was more the final straw a this has been covering for a while I felt strange party but after the twenty twelve elections I was hoping for\nOh uh this had been coming for a while I had felt strange from the party even after the twenty twelve elections I was hoping for recovery\n[noise]\nThis is NPR News\nSupport for CPB comes from you our listeners and by the whole acquaintance state presenting Cyrus chest not a jazz pianist and trio blend in contemporary jazz traditional jazz gospel and seasonings a black and then samba\nFriday October twelfth at seven thirty tickets in more effort by the hall dot org and children's of Alabama presenting an annual symposium educating health care professionals on the latest treatments and research and the care of pediatric cancer and blood disorders friday November nineteenth children's A. L. dot org slash cancer\nGet seven Nineteen you are listening to MORNING EDITION on a point by GB Atlanta I'm Leah Fleming\nComing up according to the national center on family homelessness there over two million homeless children in the United states and we're going to get a first hand experience of what it's like to be homeless kids\nThrough the eyes of one child in Fifteen minutes in sports the Atlanta Braves the then came to an end last night after a six to to lost to the LA Dodgers and the national league division theories despite the defeat the Braves enjoyed one of their best seasons in recent history winning the division and qualifying for the play offs\nBut the first time since two thousand Thirteen manager Brian Snickers says he's optimistic about the future though\nWe are very young players get along great experience [noise] during the regular season and excited about the future is now with\nThe LA Dodgers were going to face the Milwaukee Brewers and the next round of the playoffs on friday\nMost Georgia children eligible for government funded health insurance are not enrolled\nRural areas have trouble with a bunch of different diseases not just depression but diabetes obesity hypertension show we see this disparity throughout the medical world it's on second thought this morning at nine from ...\nAnd so we see this disparity through Rob the medical\nWorld it's on second time this morning at nine from ...\n\nSupport for NPR comes from the station and from Bible a language apps that teaches real life conversations and a new language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at battle B a B B. E. L. dot com\n[noise] from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information it builds on dot a W s\nAnd from universal pictures presenting the new film first man from Damien ... director of la la land and whiplash and starring Ryan Gosling and Claire fully in theaters and IMAX friday\nIt's MORNING EDITION from NPR News I'm Noel\nKing and I'm David Greene China has poured billions into making basically a Silk Road of the sea running dozens of ports and container terminals around the world\nIt's a way to move Chinese exports to important markets including the European Union and in Europe it all began in the Greek port of Piraeus the Chinese shipping giant Cosco has spent millions transforming into the fastest growing port\nIn the world but as Joanna Kakissis reports from previous this has come at a price [noise]\nIs as iconic queen 'cause the proper way\nTo where lawyers set out for ...\nMore Hollywood dog for the Nineteen sixties film never\n\nPersonally no matter who the thing that there's no porch she lived as much as ... ... ... my me today now may he a knee showed the\nRetired ... your ... and his wife Maria song by heart\nHe worked at the port of Piraeus for thirty five years\nTo put those in a bigger teach you about that as this is my father he goes up when I stopped a port who didn't happen\nFive years to but that was going to minimize it but that does business my father did it go up when I got to promote who didn't have many machine cargo into the ... with our own hands for we ought to bags of groceries ... where are all made in Greece old bound for North America Australia\nHe says praised took care of its stock workers he made good money and now has\nA good pension [noise] to flip the string of worry Pete says he reminisced says in his living room underwater color painting of a ship\n... women or you have to ship when will you many bureaus using them when I was living out of the world from the sewers if you ever get bumped deep enough of big should everything\nTo be successful but for years when the Greek state owned support your credit red tape made it hard to attract investment\nThen came the debt crisis which began in twenty ten ravaged the Greek economy he pushed Greece to privatize before the break is only the Chinese showed serious interest [noise]\nChinese shipping giant Costco took over the port in twenty sixteen now owns a majority\nStake and the Port Authority Cosco runs cargo terminals cruise ship ears and the largest passenger ferry Wharf in Europe and the Chinese are not stopping their\nLives not to expand the car terminals they want to expand or they want to create the logistics center they want to build a new on a cruise terminal\nCan be done by let us advisors to the Greek shipping ministry he's aware of the Chinese lease on the port will run out and about thirty five years\nIf at some point in the future they want to abandon paid as\nWell we will have all these investments they will not take them with with them okay what are you doing here\nShe is entirely a win win win win those those are the words of captain food channel chill costs goes CEO and pray as heard here in twenty Fifteen\n...\n...\nOne of the port union leaders I ... as another interpretation when the Chinese\nSaid when when they they mean vaguely\nFlies she says the benefits mainly go\nFounder if they if they're not as bad as they are no how their way to organize it\nThe founder if they if they're if they if they are no how their way to organize\nOf doing business they expand do these things\nIn Europe you can actually hear the Chinese expansion half the cargo terminal\nWhich are busy twenty four hours a day\nStraddle carriers lip giant metal containers of goods onto shift workers in bright yellow safety best are everywhere and these are coveted jobs in a country where the unemployment rate is twenty percent but most of the Seventeen hundred workers at the port in hard times without labor why [noise]\nTwo years ago hundreds of protesters and police over hostile takeover and their working conditions [noise]\nThirty year old Steven ... recalled how he and his colleague\nLong hours and unsafe conditions for\nWorkers were too scared to speak on it and they kept their heads down up and working for each shift with outbreaks even to go to the bathroom and\nSome of my co workers had to relieve themselves in plastic bottles and now he says at least they can take twenty minute break starting shit\nOnly about two hundred and Fifteen workers are in the Greek dock workers' union run by your was ... he cannot stomach the new reality for most workers at the port and blames Costco\nThey will silent obedient cheap workers with no unions in ... which was the to the we didn't go in the future\nOf the can promote her father's bust we should have been so difficult issues they want to proceed to go to different future workers\nCost goes pray a CEO food chunk chill and his deputy declined NPR's interview request a Costco spokesman said it an email that after quote long and productive negotiations a labor agreement was signed that benefits both sides of\nThe European Union's been largely silent on the labor concerns but ... says a lot but ... says secretary of ports\nSays he has heard from a you officials who are suddenly worried that China's running a European port\nSays me do you ... you know we're all aware that the Chinese state is behind a company like Costco you sort of you that pushed us to go so or ... during the first one\nDo you ... when you get the you know we're all aware that the Chinese state is behind a company like Costco you sort of you that pushed to sell airport to Costco and the first place and if we were in debt we had little bargaining power he says the e you underestimated China\n\nAnd now the Chinese flag is race for re it's too late regret for NPR News I'm Joanna Kakissis in a way it's going\n\nTo be said for it was just the beginning that China has snapped up about a tenth of Europe port capacity in just the last decade or we're going to hear about that later this week\n\n... school they start early and certainly has an hour\nAnd a half long bus ride to get them the homeless shelter and where he's staying in the middle of five forty five freshman came to my hair\nThen I hurry and rushed downstairs to get out a catch my bus so time staying at the shelter was eleven year old brother and his grandma Pam can't travel that they moved here after getting an eviction notice\nThe landlord decided to sell the property and we just could not\nFind a place that we could afford\nMore depressed I God I just I didn't know what to do\nIs a small disability type in the government but that's nowhere near enough to cover rent in Boise grateful for the shelter but says it's hard on her grandsons my youngest\nPlan he can be a little terror because she's upset but you know\nHe gets angry men\nSaid\nHe'll just say I have a place to place\nTypical for cable TV but you wouldn't know it\nCame as a social fourteen year old and a big smile one of his favorite things about school is seeing his friend my friend you know about it\nCame as a social fourteen year old is a big smile one of his favorite things about school is seeing his friend my friend\nAnd you know about it and me being homeless and they don't teach me on it I'm trying to work hard\nAnd it's just an effort to try not to break down it's harder for students who are anxious and worried to concentrate homeless kids tend to score and lower on standardized tests and have lower graduation rate [noise]\nAnd sometimes king does break down with his friends [noise]\nAgree\nAnd\nIt is ... is doing okay\nCame and carries a tray of food to a table with their friends\nIs out of the picture has mom has a drug problem before his grandma step then he had to help take care of his little brother\nHelped ... ready for school [laughter] the catch ... on my watch so for days\nLong time and we only had cereal for what Julie ... has been trying to convince his grandmother that she should let them get a job so he can help the rent so I Want to do [noise] you know about but can't travel won't have it\nYet to be a child as long as possible and you don't want to be in a hurry to grow up\nA few weeks later there's good news and cadence world they got a house [noise] it's about seven hundred square feet that they share with a roommate for ... it's a huge improvement\nI feel much more comfortable in a safe and\nProbably most importantly he can say something he hasn't been able to for quite some time this is home\nFor NPR News I'm Amanda teacher in Boise\nThat story came to us from the mountain west news bureau and later today on all things considered in rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name\n\nThis is NPR News support for ... comes from you our listeners and readers\n\nThis is NPR News support for TB comes from you our listeners and regions bank helping students transition into financial responsibility with regions to solutions\nTools to manage their money pay bills and control spending information regions dot com slash students solutions and Georgia State parks as things get shorter and temperatures start dropping there's no better time to huddle around a campfire at Georgia State parks information and rates available at visit gee a state parks dot org\nSeven forty three you are listening to MORNING EDITION on ... Atlanta I may have plumbing and we're going to hear from Keith sick or be old crow medicine show singer has published his first children's book which recounts the traditional folk tale we're going to get to experience that\nThat had on MORNING edition parts of southwest Georgia including Albany in Moultrie are under a hurricane warning as Michael approaches the Florida Panhandle and that means hurricane conditions are expected\nAnd within about thirty six hours down that way a tropical storm warning is also in effect for parts of southwest Georgia as well including Valdosta in Moultrie\nHurricane Michael is expected to make landfall in Florida tomorrow and forecasters expect the storm to strengthen before it lands\nEntire Georgia coast is under a tropical storm watch\nEighty point five its license to Georgia State university the largest University in Georgia in one of the largest in the nation\n\nThe murder of ... McDonald prove a turning point for policing in America former Chicago police officer Jason Van Dyke now wait sentencing for the unlawful death of a black teenager\nWhat questions remain over a code of silence and over how we train those who protect and serve upholding the law went in for swimming towards deadly next on on one day\nYou can hear that on one day at ten o'clock this morning right here on eight point five GB Atlanta\nMORNING EDITION and on second thoughts ... all the heat that are split their support make everything you hear us you ... if we didn't hear from your during our fall fungi your contribution now still make a difference [noise] we take\nJust a couple of minutes to support the programs you rely on and enjoy on TV and do your part now at whatever level is right for you\nGood at ... dot org and click donate\nAnd it's to support the programs you rely on them enjoy on ... and do your part now at whatever level is right for you good a G. P. B. dot org and click donate thanks so much for your support of Georgia Public broadcasting [noise]\nSupport for NPR comes from this station and from log men makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more Goto meeting dot com\n[noise] from Charles Schwab when it comes to wealth management ... believes in asking questions and being engaged so investors can better own there tomorrow learn more at Schwab\nDot com [noise] and from the William T grant foundation at WTC grants foundation dot org\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King\nThirty years ago researchers from the New England aquarium started studying North Atlantic white whales off the coast of eastern Maine large parts of the whales showed up like clockwork in late summer now those endangered whales come to that area only sporadically and more and more they're being seen far to the north\nMurray Carpenter went out on a research vessel to learn more\nIt's just after dawn and Amy ... surveying the waters of the bay of Fundy just off of eastern most main she's a scientist with the New England aquariums Anderson Cabot Center for ocean life [noise] she points out harbor porpoises chasing fish near the boat and then something much larger appears in the windswept water behind us [noise]\nA humpback arson well we'll get a better look it turns\nOut to be too hard facts one spouse near the boats [noise]\nIt's a cool citing but these are not the whale she's after\nAn old man is hoping to find the north Atlantic right whales that she and her colleagues have been studying here since Nineteen eighty [noise]\nThey're largely lean whales with big heads and no dorsal fin researchers used to count as many as two hundred forging here in the summer but he became scarce starting in two thousand ten and their range shifted dramatically many more of the whales are now summary and hundreds of miles north in the Gulf of St Lawrence\nMariano had bloom one of ... research assistants survey that area in August and said it was nothing like the bay of Fundy\nHad days where we were talking about the individual working them in the boat and [noise]\nRight well they're not sitting right\nAnd we were talking about the individual working on the ballot and [noise]\nRight well they're not sitting right\nThing to see what in\nTotal fewer than four hundred and fifty North Atlantic right wells remain and their numbers have been falling for a decade as more urban entangled and fishing gear or killed by ships\nReproduction is also declined researchers found no new cabs last winter\nWith the population on edge scientists want to understand the reasons for the new migration pattern Nick record is with the big load laboratory for ocean sciences in East Bay main\nMy hypothesis is that this change in the migration patterns of Wales is connected to their food resource mainly ... count as like the battery of the Gulf of Maine\nColumnist is a type of fat rich plankton that's favored by many species record says a changing climate is not only rapidly warming the regents waters it's also shifting the currents that one swept is important plankton into the deep basins were right whales feed making it less available to them\nMore brown another scientist with the New England aquarium team to she actually finds hope in the habitat shifted all the way from the waters near Maine to the Gulf of St Lawrence\nIt's not like it's right next door will have to swim all the way around Nova Scotia so what a tremendous response you know this is a highly endangered well there's not many left and yet they're demonstrating that they can respond to major changes in their habitat and that's actually quite encouraging\nBut she says it's definitely slim pickings in the waters near Maine\nIt's not that this area's abandoned the keys are count for this year is less than a dozen layoffs\nBack at the dock the crew in their thirty mile survey the last of the season with no right well sightings but ... says its worst sticking with the research\nI'm David Greene and I'm Noel King [noise]\n\n[noise] from the University of west Georgia mind be point seven FM Wu WG aimed W W E a G H Gerald Ford of Georgia Public broadcasting radio network [noise]\nMine from the G. P. B. newsroom I'm Leah Fleming [noise]\nThe midterm elections in Georgia are less than a month away but the deadline for voters to register is today people can visit the Georgia secretary of state's website to register or check their voter status it's also possible to register using the free Ga SOS mobile app\nEarly voting begins next Monday the secretary of state's website says that polling places will also be open at least one Saturday October twenty seven and all of Georgia counties but two candidates competing to become George's next governor will both received campaign help from out of state today has ... days Taylor Gantt explains\nDemocrat Stacey Abrams will hosted event at Cleveland State university featuring US Senator Elizabeth Warren and Massachusetts congressional candidate I oughta Presley who upset a ten term incumbent and the Democratic primary last month\nRunning unopposed Presley is set to become the first black congresswoman from her state a room so to break a similar barrier as the first black woman to serve as governor in the U.S as a Republican Brian Kemp he'll be in Athens with Donald Trump junior for a fundraiser at the classic center\nPresident Trump endorsed camp during the Republican primary to help him to the lieutenant governor Casey Cagle in a runoff for the News I'm Taylor dance hurricane\nMichael could disrupt flights that the world's busiest airport Southwest Airlines says flights in and out of Hartsfield Jackson Atlanta international airport could be delayed diverted or canceled through friday disruptions or possible from today\nOn on through Thursday on flights to New Orleans Panama City in Pensacola Delta Airlines is also issuing some travel waivers for select flights in Florida and Alabama starting today\nThis is GPA Atlanta now eight a one\nLine from NPR News in Washington encore of a cold and the national Hurricane Center says hurricane Michael is less than four hundred miles south of the Florida Panhandle in the Gulf\nTop sustained winds are one hundred miles per hour and forecasts to become much stronger shelters are beginning to open up today from member station WFSU Ryan daily reports Tallahassee is mayor is urging residents to take precautions Tallahassee mayor Andrew Gillum\nFrom member station WFSU Ryan daily reports Tallahassee is mayor is urging residents to take precautions\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including Irma in two thousand Seventeen but he says the state's panhandle region should brace itself or an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages\nThose who rely on our electric utilities for their livelihood\nSo we would recommend that day\nFind a place to walk out the\nMandatory evacuations have been called in some coastal counties Michael is expected to make landfall Wednesday for NPR News I'm Ryan daily in Tallahassee\nOnline site Google says it will shut down its Google Plus side after saying and found a flaw that could have exposed personal information of half a million users\nGoogle says it has no information the personal data was misused but it's only disclosing the vulnerability now Wall Street journal reporter Douglas McMillan wrote about the breach he told NPR's MORNING EDITION there's no clear law that Google broke by withholding the news\nThere is a a patchwork of laws there's there Patrick state laws and there's a there's a new European law that address is is\nThe problem is the laws hinge on whether or not the company knew that data was improperly access in this case Google was pleading ignorance they're saying we don't know we have no evidence the data was access so we therefore have no obligation\nHe also says Google was worried about damage to its reputation and about government screws name Brett Kavanaugh takes the bench today for his first arguments since the Senate voted narrowly to confirm him to the Supreme Court Saturday NPR's Carrie Johnson reports the new justice spent the weekend working\nBrett Kavanaugh and his family appeared at the White House Monday evening forest ceremonial swearing in ceremony but he's mostly been studying up for his new job Kavanaugh was hired for women clerks a first for the Supreme Court\nAnd a source close to the justice says he's been reading brief to get ready for oral arguments his first cases involve what kinds of crimes are mandatory prison sentences under the arm career criminal act\nKavanaugh's confirmation opens up another seat for the White House to fail on the prestigious federal appeals court in Washington Carrie Johnson NPR News Washington\nMourners held a candlelight vigil in Amsterdam New York last night for the twenty people killed in the limousine\nWashington Carrie Johnson NPR News Washington mourners held a candlelight vigil in Amsterdam New York last night for the twenty people killed in the limousine crash on Saturday the vehicle ran a stop sign to pedestrians are among the dead you're listening to NPR\nA quirky group of new wave pioneers a soulful folk Belvedere end an R. and B. hit maker are among the Fifteen nominees vying for a spot and the rock and Roll Hall of fame for member station WBUR C. P. and Idea Stream David C Burnette has details on the rock calls twenty Nineteen hopefuls\nThe collapse of industry in the mid western Russia built gave birth to a band made up of Kent State arts students whose pioneering music videos parodies the evolution of society and this has DeVos first time on the ballot [noise]\nAlso making their ballot they use our Roxy Music Todd run grin and singer and songwriter John Frye\nA number of previously nominated performers are in contention including Radiohead graph work and\nJanet Jackson [noise]\nVoting committee will narrow the list to a half dozen hall of fame ended up these will be announced in December for NPR News I'm David C Barnett in Cleveland to Brazilian presidential candidates are campaigning for that country's presidential runoff election at the end of the month\nFar right candidate and former army captain gyre bull so narrow came closed outright victory Sunday he'll face former Sao paulo mayor Fernando ... of the leftist workers' party\nOfficials in Ukraine said there have been several explosions and an ammunitions depot thousands of people have evacuated as fire balls shot into the sky east of the capital Kiev on corporate Coleman NPR News in Washington [noise]\nSupport for NPR comes from NPR stations other contributors include the University of Florida we're solving for next is powered by its way into grants heritage from renewable energy to global health us students and researchers are working to solve challenges at ... dot U. F. L. dot edu\nAt age sixty you are listening to MORNING EDITION on a point five ... Atlanta where Atlanta is NPR News station I'm Leah Fleming it's a pleasure to have you with long on this Tuesday Morning we've got Seventy three degrees under cloudy skies\nNPR News station I'm Leah Fleming it's a pleasure to have you alone on this Tuesday Morning we've got Seventy three degrees under cloudy skies the forecast is telling for mostly cloudy day today with a chance for a few showers thirty percent chance I Will get up to eighty one degrees by later on this afternoon\nComing up we're going to explore the challenges of talking to a judge the a video and not in person Charles Davis and said that if he'd been able to talk to a judge in person instead of through a video camera from inside the jail\nHe might not have been convicted of a crime that he denies committing we're going to hear about that coming up in Fifteen minutes if he recently supported U. P. B. during our fault line driveway thank you so much we're already putting your dollars to work to bring you the programs that really matter to you once you ... and if you didn't get a chance to donate during the drive\nYour on line contribution right now it will make a difference you can take just a couple of minutes to go to ... dot org and click on the green donate button at the top of the page [noise]\nSupport for ... comes from you our listeners and Callaway resort and gardens Georgia's authentic outdoor escape offering to championship golf courses the scenic lick the course and the mountain view course twelve time hosted the PGA spewing challenge more it can only gardens dot com [noise]\n\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California Republican and democratic leaders have one thing in common right now both are hoping\nThat the bitter battle over Supreme Court justice Brett Kavanaugh will motivate their base and Dr voters to the polls\nFor the midterm elections Republican Senate majority leader Mitch McConnell described it as a quote shot of adrenalin that the geo Pete got from the confirmation battle is polls do show that the Republican Party is closing in on Democrats enthusiasm advantage this is McConnell over the weekend on CBS face the nation\nBut one of the\nOther side for the doctor to sort of allowed us to to energize and get involved I own a voters\nBoth talk about what the Democratic Party might be able to do to try and regain steam I'm joined by rubbing mock he was the campaign manager for Hillary Clinton's campaign in twenty sixteen will come back to the program\nThanks so much\nSo McConnell seems appreciative for how Democrats handled the confirmation battle over over Kevin all I mean do you worry that the Democrats have given away the edge that they had had an engine of amber\n[noise] I don't drink the edges been given away at all\nBattle over over cabinet I mean do you worry that the Democrats have given away the edge that they had heading into November\n[noise] I don't think that the edges been given away at all I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a bomb to try to close that gap but there's still a significant advantage for Democrats\nHad eight Nineteen you are listening to MORNING EDITION on a point by ... Atlanta I'm Leah ... lemming in Alaska Oil and mining companies are fighting a ballot initiative aimed at protecting salmon fisheries\nChanging the way we regulate fish habitat at a time when we don't have a clear problem just seems crazy\nBallot supporters argue that the current laws which salmon at risk we're going to take a closer look at that coming up in Fifteen minutes as MORNING EDITION continues\nSupport for ... comes from you our listeners and southern environmental law center protecting Georgia's environment and the people who depend on it during these challenging times through the power of the law southern environmental law center on line at southern environment dot org\nAnd by the hall of Clinton state presenting Cyrus chess not a jazz pianist and trio blend in contemporary jazz traditional jazz gospel and seasonings a black and then samba friday October twelfth at seven thirty tickets in more at ... dot org [noise]\nSports the Atlanta Braves season came to an end last night after a six the too long to the LA Dodgers and the national league division theories\nDespite the laws though the Braves enjoyed one of their best seasons in recent history winning the division and qualifying for the playoffs for the first time since two thousand Thirteen manager brand snicker says he's optimistic about the future of his team\nPlayers get a lot of great experience during the regular season and excited about the\nThe LA Dodgers will go on to face the Milwaukee Brewers and the next round of the playoffs which start on friday\nThe LA Dodgers will go on to face the Milwaukee Brewers and the next round of the playoffs start on friday\nMost children eligible for government funded health insurance are not enrolled\nRural areas have trouble with a bunch of different diseases not just depression but diabetes obesity hypertension so we see this disparity throughout the medical world it's on second time this morning at nine from ...\nAnd from capital one offering a variety of credit card options with features for a range of customers from ... to travelers capital one what's in your wallet credit approval required capital one bank usa an a\nFrom Amazon Prime video presenting the return of the man in the high castle where America's history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nAnd from Harvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learned more H. B. S. dot any flash executive\nIt's MORNING EDITION from NPR News good morning I'm David\nGreene and I'm Noel King until recently the head of Interpol the international police organization based in France was a man named among Hong way he's from China\nBut in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol I talk to NPR's Shanghai correspondent Rob Schmitz and asked him what do we know about my mom\nAlways sixty four years old he served as device ministry of public security bureau which is China's national police are in twenty sixteen\nHe became the first Chinese head of Interpol and there's no election was a big victory for trying to government which under leader Xi Jinping was eager to use Interpol to locate in extra day Chinese officials at it deemed corrupt would escape China\nBut as it turns out among himself is now under investigation by Chinese authorities for corruption what\nExactly are they investigating him for\nWhat kind of government hasn't released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how to detention unfolded has come from his wife ... September twenty fifth the day her husband arrive to try to for a visit she allegedly received a text from him\nPension unfolded has come from his wife ... on September twenty fifth the day her husband arrive to China for a visit she allegedly received a text from him that said wait for my call which was followed by in a mood to even nights suggesting that he was in danger\nA week later she reported him missing to French police on Sunday she spoke to reporters and they own France wearing trouble is headquartered in here's what she said\nIn a way to go with the half of what might be able to embarrass them on the wide\nAnd children's husbands and fathers that they may no longer disappear\nAs you can hear in that tape now while she's crying during this part of the video with their back turned to the camera because she's received threats and his under protection by French police well\nWhen she talks about the husbands and fathers who disappeared in China what does she mean\nWell she's talking about the government anti corruption campaign was launched by paying immediately after he took office in twenty Thirteen and smeared hundreds of thousands of officials both on the local level as well as among the highest echelons of the party\nIn fact the man who appointed long way to vice minister of public security was Julia in Congo highest ranking Chinese official who was brought down by this campaign Joe was a former member of the pull up your standing committee the group of seven men who rules China he was China's securities are before he was sent to prison for life and twenty Fifteen\nBy removing them from the presidency of Interpol can lose is a lot of sway within that organization that much is clear why does this mean for Interpol\nWell even before this happened China's use of in our poll and amongst presidency was starting to raise some red flags earlier this year China attempted to issue a red notice that's an international alert for wanted person\nFor an exile weaker activists years are mostly Muslim ethnic minority who live in northwestern China who China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with ... is a good example of how China's messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob thanks do\n\nAcross the United states more criminal courts are turning to video proceedings this isn't an effort to save time\n\nAcross the United states more criminal courts are turning to video proceeding this isn't an effort to save time and money as it happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology from Illinois newsroom in Urbana league games report\nToday like most days thousands of defendants will show up in criminal court for their first appearance in front of a judge it's likely that more than half of those appearances will not be in a courtroom in person the defendant will instead to face a video camera from inside a jail\nSheriff jet standard likes that system he's in Lewis ten in rural west central Illinois he demonstrates what his deputies used to have to do\nThey would have shackles on so their stuff we're going to be half of war taking and their selves we're going to be trained together you're walking on the line for like a three legged race\nStandard says the video system they now use freeze up more of his officers for patrol and he argues that the convenience of the system is better for everyone so\nWe can they come from\nThe video camera the judge has access to the video camera\nConversation just like we are now but it's just over video screen\nBut Charles Davis and says it's just not the same Davidson is sixty years old and a recovering heroin user who was in and out of jails and prisons in Illinois for over two decades he finds the video process both off putting and demeaning\nWhen I first went to the video quarter inches below my because uh watching everybody get up and go in front of this group of us are nose or you know you couldn't Sunni to\nDavidson says when you're in the same room as the judge it's easier to have a conversation with them and he's noticed there's a greater chance to listen to what you have to say he says the first time he appeared in video court he didn't think he got a fair shake\nA shortage plenty to to judge what happened\nThey told me to record\nSoon after David thing was sentenced to Eighteen months in prison\nLawyer Rosalie joy says she hears stories like David since all the time she's with the national legal aid and defender association and says the increasing use of video court has some defense attorneys concerned\nThat alienates the accused from those deciding their fate even before the proceedings began you already feel like you're treated us\nThat alienates the accused from those deciding their fate\nEven before the proceedings began you already feel like you're treated as though you're guilty you are feeling excluded from the process you are treated as the least important part of the process because there is nothing that can replace human interaction\nAnd as a defense attorney I Am never going to be as effective in the courtroom for my client unless my clients stand shoulder to shoulder to me\nWell there's little research on video court what's out there shows it may increase bail him out and in many cases makes private communication between attorneys and clients more public\nOn the prosecution side many defend video court for its cost savings and efficiency while acknowledging that some of those advocating for the accused say it's a trade off that's unfair to defendants\nFor NPR News I'm Lee gains in Urbana, Illinois\n[noise]\nHazing his boat across whispers creek Mike would points out a massive shadows undulating just beneath the courage to last and this year stamina to writing here\nOn some on peace\nComes in there to\nA small scale commercial fishermen and the consummate Alaska today he's supporting a kennel jacket and a gun in his back in case we run into a moose increases vote to have a look [noise]\nAlso helping leaves to stand for Sam and can't pay for a ballot measure aimed at protecting the state's most iconic fish walking along the creek would says he thinks it's a long overdue change\nScale is been tipped too far in favor of development and industry and and we're just trying to\nPull it back towards the center Alaska as some of the most valuable salmon fisheries left in the world but wouldn't other ballot supporters say the state's laws protecting salmon are we putting them at risk especially with a number of large mines in oil developments\nThe world but wouldn't other ... supporters say the state's laws protecting salmon are we putting them at risk\nEspecially with a number of large new mines in oil developments in the works if it passes Alaska would enact a much tougher permitting process for big projects in salmon habitat among other things it would set strict standards for restoring salmon streams if they're disturbed\nAnd the companies don't follow the rules they could face criminal penalties knowledge is that in a state like Alaska it's a big ask\nWhen you start doing something like this\nIs really kind of\nI mean your nose at the big guys you know\nFor decades Alaska's economy has depended on industry dollars and oil and mining companies hate this initiative banded together under the name stand for Alaska they're backing a campaign to stop it running a blitz of ads like this\nWhile you're going to protect their habitat\nIn this brings a new regulation slow or stop Alaska project\nCompanies have poured millions into the campaign against the ballot measure with help from donors like BP and Exxon Mobil they've raised more money than all three of Alaska's gubernatorial candidates combined\nKaren Matthias is with the council of Alaska producers the group that represents mining companies and she argues the state's salmon fisheries have so far coexist with minds that oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem just\nSeems crazy but ... thinks the initiative prioritizes standing at the expense of the state's biggest economic engines and taxpayers\nWe couldn't have the Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans salmon are more than just living or the occasional meal here they represent something deeper their vital food source in a traditional way of life in one of the ... states were wild river's still teen with them every summer\nSo when voters head to the polls this November there'll be weighing that against fears that I met her to protect same and couldn't read all the states' economic foundation\nFor NPR News I'm Elizabeth herbal in Anchorage [noise]\nThat report came to us from Alaska's energy desk it's a public media collaboration focused on energy and the environment\nFocused on energy and the environment\nSupport for CPB comes from you our listeners and Scott antique market indoors this week at the Atlanta expo center over thirty five hundred exhibit or booths with vendors from around the globe and items from all time periods more information that Scott antiques dot com\nAnd Kennesaw state school of communication and media master's program and global communication hosting an open house October eleventh at six PM more information that Kennesaw dot edu slash and a I D C a communication degree to further a career\nAt eight forty three you are listening to MORNING EDITION on ... Atlanta I'm Leah Fleming gas prices in the state rose six cents last week that's according to motor club AAA the average price per gallon was to Seventy eight the most expensive gas prices are in Atlanta\nHappened since the ban them AAA spokesman mark Jenkins says concern over global supply and demand continues to weigh on oil prices will bring you more business there was on the marketplace morning report is coming up in ten minutes right here on eight point five [noise]\nSupport for TB comes from you our listeners and the Atlanta symphony orchestra presenting rebels love letter to Greek mythology the luxury in ballet deaths in the set Chloe October eleventh and thirteenth tickets in details that a U.S so dot O. R. G. classical series presented by Delta Airlines ten rooms CBP in Rome\nInternational film festival returning November first through force last year's festival celebrated Burt Reynolds to record audiences this year's event features screenings master classes and parties more at R. I. S. F. G. A. dot com\nOr find old age registered to vote in the November to watch all the campaigns now or a treasure\nFor more effort to get their supporters usable I'm Bill Marr is one of the most consequential elections and director huge huge final week our panel of binge starters Wilker junior to bring you in Dallas huge huge huge huge and\nJim sergeant on the border tunnel maneuvering or be jammed gory one today and you know [noise]\n\nGood morning I'm Noel King if you've ever done CPR training you know that pumping motion is a lot harder than it look\nA couple of minutes to get really tired\nBelieves in Minnesota recently captured\n... if you've ever done CPR training you know that pumping motion is a lot harder than it look\nA couple of minutes to get really tired\nAnd Minnesota recently captured footage of a man doing CPR with a single things or Nineteen year old\nChris Felix was trying to revive a squirrel that he thought\nHe'd hit with his car and it worked after a couple of minutes the ... doubts world came to and dashed off It's MORNING edition\n[noise] support for TB comes from you our listeners and Georgia trend magazines for more than Thirty years covering Georgia business politics and economic development subscription information and more are available at Georgia trend dot com\nMeals for kids providing delivered meals focused on the child's nutritional needs and picky taste with experience working with private and public organizations of all sizes supporting kids freedom to eat right information at meals for kids dot com [noise]\nLike you who donate to this NPR station\nAt eight forty five you are listening to MORNING EDITION on June ... election security is a hot topic ahead of this November's midterm elections especially in Georgia\nIn September a federal judge denied the request to move the mid term elections to paper ballots she also said that some problems with the current touch screen system needs to be addressed in the near future but that's just one part of a larger election puzzle CPB Steven Tyler takes us behind the scenes of how the state's elections are made\nChris Harvey is George's elections director as team with the secretary of state's office gets to work building the layout of the ballots as soon as candidates are set\nHarvey's office creates twenty five hundred different versions of a ballot with everything from the governor's race to weather Sandy Springs residents can buy alcohol earlier on Sundays\nYou take each county and then you take the different ballot combinations and you take the qualified candidates and you just start plugging them into this laws if you if you think about it that way until you've got every\nRace and every question every candidate account for for the county's\nBeen those ballad files are hand delivered to each county where local officials double check to make sure everything is accurate once that's done the officials load the ballots from a secure server on to memory cards tied to specific precincts the cards are also matched up to a specific serial number on a specific machine\nEven the seals used to secure those machines have their serial numbers correct [noise]\nThat's the sound of um\nThe seals use to secure those machines have their serial numbers tracked [noise]\nThat's the sound of a machine being unsealed so it can undergo logic inaccuracy testing it's one of four that belong to the black rock voting precinct in Fayetteville twenty miles south of Atlanta Fayette County elections director Floyd\nJones of what we're doing is we're taking the machine where literally ensuring that it actually works and then uploading the new ballots into the machines so they can be prepared to roll out on election\nProcess takes just a few minutes for a machine\nEverything from the ... of the printer to the click of the card reader undergo scrutiny and a sample tally is run [noise]\nJones says all three hundred machines is county uses will be tested over the course of several days\nWhen that's done we Salem we put them back on the racks and we haven't been up for election [noise]\nSo what happens on election day\nThe machines are delivered the seals are broken and poll workers are ready for business at seven AM\nAfter you check in at the polling place you're handed a yellow voter access card that goes inside the machine but how does it know which ballot goes on the screen\nA tiny computer chip what's your name and balance dial loaded on fits the same type of chip that you have on your credit cards that's Richard Baron who oversees Fulton County is elections all the ballots are available on the DARE but that one will only activate\nThe ballot that is correlates to your residence your vote is captured on the machines memory card and the yellow card is return to the poll worker\nOnce the last person in line has voted poll managers consolidate the vote tallies onto a single memory card shut down and seal the voting machines do some paperwork and then drive results to a central location from their vote totals are uploaded to the state's election night reporting system where tallies are posted on line", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Carrollton", "day": "09"}